{"episode_id":"SW - #197 - 2021-11-08 - Nicholas Kotar - Double Inversion Storytelling","start":12.08,"end":13.44,"speaker":"Jonathan Pageau","text":"This is Jonathan Peugeot."}
{"episode_id":"SW - #197 - 2021-11-08 - Nicholas Kotar - Double Inversion Storytelling","start":13.92,"end":71.7,"speaker":"Nicholas Kotar","text":"Welcome to the symbolic world. Hello friends, welcome. Thank you all for coming, for making time today to chat with Jonathan Pageau, who has himself been so gracious as to make time to come to this exclusive interview about his wonderful new project, God's Dog. I'm very excited to talk to you, Jonathan, about this. I had the pleasure of reading the entire thing, or rather volume one beforehand. And I read it in one big gulp, so to speak. Couldn't put it down, it was fantastic. And this is even though it was on a computer screen, which I hate, I would much rather have it, you know, in paper form, but still I gulped it up. So I'm very happy to talk to you about it. Welcome to our little zoom room inside Nicholas Kotar's Patreon community. Thanks."}
{"episode_id":"SW - #197 - 2021-11-08 - Nicholas Kotar - Double Inversion Storytelling","start":71.7,"end":80.07,"speaker":"Jonathan Pageau","text":"I know, I appreciate you reaching out. I'm really happy this is the first like discussion I'm gonna have publicly about it. So I'm happy that it's perfect."}
{"episode_id":"SW - #197 - 2021-11-08 - Nicholas Kotar - Double Inversion Storytelling","start":80.55,"end":102.39,"speaker":"Nicholas Kotar","text":"I win. Haha. Jonathan, you don't need to be introduced to these people. They are here to see you. However, I would like you to introduce yourself not as Jonathan Pageau, but as Jonathan Pageau, writer, because this is a new manifestation of you as person. So tell us a little bit about Jonathan Peugeot, comma writer. Who is he?"}
{"episode_id":"SW - #197 - 2021-11-08 - Nicholas Kotar - Double Inversion Storytelling","start":102.63,"end":184.08,"speaker":"Jonathan Pageau","text":"Who is he? So it's funny that a long time ago I was more of a writer. So when I was a young adult, I Guess Starting around 17, 18, I was part of a theater group, this like big Christian theater group, you know, it was like, like 50 people in like massive production and musical and stuff. And so they asked me to write a play for them and which brought me to end up actually writing three plays. So I wrote three plays for them. It was like it was a musical plays with and I also directed them. So I kind of started in this weird slash theater world. So that's where I developed, let's say, my writing. But then I kind of gave it up for quite a while. Well, writing, I was writing mostly theory stuff and not writing fiction, but I always knew that I would come back to it. And then this idea came to me. I think it started around the first time I had the idea was probably in 2003. 2002, 2003. And so I really wanted to write it down, but my life was so crazy and messy and so I, or I kind of asked my brother if he would do it with me and that's what we did. We just kind of wrote it slowly in our spare time, but for me this is like an opening. I want to see how people react to this and how they like the story. And if they do, then I have a lot more storytelling that I would like to be involved in."}
{"episode_id":"SW - #197 - 2021-11-08 - Nicholas Kotar - Double Inversion Storytelling","start":185.13,"end":193.93,"speaker":"Nicholas Kotar","text":"Aha. So you're presenting yourself to the masses. And if the masses turn up their nose and say, jonathan, I don't want any more of this, you're going to be like, I'm not going to write anymore. I don't believe you."}
{"episode_id":"SW - #197 - 2021-11-08 - Nicholas Kotar - Double Inversion Storytelling","start":193.93,"end":215.39,"speaker":"Jonathan Pageau","text":"Well, it's not that I. It's just that I have so many things that I'm doing at the same time. So it's like I always have to decide what is worth my attention. You could say. So if people say, jonathan, now, your writing is not so good, and that project's not so good, I'm like, you know what? I'm doing this icon carving thing that people seem to appreciate. I can just do that and. And I'll be fine."}
{"episode_id":"SW - #197 - 2021-11-08 - Nicholas Kotar - Double Inversion Storytelling","start":216.35,"end":235.07,"speaker":"Nicholas Kotar","text":"All right, fair enough. Fair enough. So let's start talking a little bit about the story. So there's a lot going on in the story. You say that you started to have the idea in 2002, 2003. But this manifestation of it is clearly influenced by things that have been happening over the last year or two. And there's a lot, a lot to unpack."}
{"episode_id":"SW - #197 - 2021-11-08 - Nicholas Kotar - Double Inversion Storytelling","start":235.71,"end":260.38,"speaker":"Jonathan Pageau","text":"You think so? But no, this is straight what we wrote, and we finished writing 10 years ago. But it's also because we knew what was coming in terms of just worldview and everything. And so the fact that giants are now back on the menu, let's say, since this is just complete insane coincidence, but we wrote this. What's there is what we wrote as a screenplay 10 years ago."}
{"episode_id":"SW - #197 - 2021-11-08 - Nicholas Kotar - Double Inversion Storytelling","start":261.18,"end":268.47,"speaker":"Nicholas Kotar","text":"Wow. Because it reads like an episode of Dorda Splinter. Yeah. The Lord of Spirits. Yeah, it does."}
{"episode_id":"SW - #197 - 2021-11-08 - Nicholas Kotar - Double Inversion Storytelling","start":268.47,"end":303.5,"speaker":"Jonathan Pageau","text":"It's one of the reasons why I was so excited about Lord of Spirits and so excited about Father Stephen's work. It was because I was. This is the stuff that I've been thinking about in terms of story form. This is what I wanted to plunge into. But I was always nervous to talk about some of the traditions because of how the Book of Enoch was kind of suspicious. But I just feel like Father Stephen has solved the Book of Enoch problem for everybody now. There's nothing weird about talking to. Talking about it. Like, there's no. There's no strangeness about the whole coupling of angels and men. It's just. Oh, no. It's just a ritual, you know? And it's no big. It's like. It's not no big deal."}
{"episode_id":"SW - #197 - 2021-11-08 - Nicholas Kotar - Double Inversion Storytelling","start":303.5,"end":304.86,"speaker":"Nicholas Kotar","text":"It's not a big deal. Yeah."}
{"episode_id":"SW - #197 - 2021-11-08 - Nicholas Kotar - Double Inversion Storytelling","start":305.42,"end":314.7,"speaker":"Jonathan Pageau","text":"It doesn't confound metaphysics. Like, it doesn't create a strange rupture between, you know, the traditional way we understand the relationship between the invisible and the visible, let's say."}
{"episode_id":"SW - #197 - 2021-11-08 - Nicholas Kotar - Double Inversion Storytelling","start":315.34,"end":332.36,"speaker":"Nicholas Kotar","text":"Okay, so the central conceit of everything is the garments of skin, right? So for those who may not have listened to as much to your podcast as they should, would you please expound on the idea? What are the garments of skin? Where do they come from? What's the deal?"}
{"episode_id":"SW - #197 - 2021-11-08 - Nicholas Kotar - Double Inversion Storytelling","start":332.52,"end":421.13,"speaker":"Jonathan Pageau","text":"So I discovered kind of the idea of the garments of skin was when I read St. Gregory of Nyssa and St. Gregor. St. Nyssa talks about the garments of skin as something that you need to kind of get rid of. You know, these garments that are given to Adam and Eve really being our biological bodies in a way, like the body of death, you could say. And so it includes the idea of the body of death, but then it also includes pretty much everything that is added to the body in order to protect you. And so this is Paneotis Nellis, in his book Deification in Christ, really goes into this in a really interesting way where he talks about all of civilization basically being versions of these garments of skin. And so it's basically just anything added to human nature. So it includes all technology, all medicine, all weapons. All of this is included in the concept of the garments of skin. But then in the story form, what it ends up being is something like the first relic that ever existed that is the first thing that was made. So God makes these garments for Adam and Eve, gives them to them. And so now this outer covering becomes the first object in the history of humanity. And so it has a kind of power that is the power of the border, you could say the power of deciding what's on the inside and what's on the outside. And so that's the conceit of the story. This garment has a kind of power to define inside and outside. And so it gets transmitted from generation to generation."}
{"episode_id":"SW - #197 - 2021-11-08 - Nicholas Kotar - Double Inversion Storytelling","start":422.01,"end":434.8,"speaker":"Nicholas Kotar","text":"So this may seem like a simple question, or maybe not a sufficiently well thought out one, but I think I'm going to ask it for the people who are going to be embarrassed to. Are the garments of skin good or bad?"}
{"episode_id":"SW - #197 - 2021-11-08 - Nicholas Kotar - Double Inversion Storytelling","start":435.44,"end":480.58,"speaker":"Jonathan Pageau","text":"That's right, they're both. That's the whole idea of the garments of skin is that they are ambiguous. And every time they bring something positive, there's something negative in the outset. And every time they bring something negative, there's a way to turn it into positive. And so that's really the notion of technology, or any human action really is something like that. It's an outer action. And so it has a death to it because it's kind of crystallized and it's outside you. But then. So it can become an idol or it can become a tool, and it just depends on how it's used. And so that's why the garments in the story will move between the sides, like, go to the bad side, go to the good side. And people are fighting to keep the garments on their side, let's say, to be able to have the power to define the limit."}
{"episode_id":"SW - #197 - 2021-11-08 - Nicholas Kotar - Double Inversion Storytelling","start":481.87,"end":543.78,"speaker":"Nicholas Kotar","text":"So then how would you answer somebody who says, why are you calling it a relic then? If relics are supposed to not simply be bearers of power? And this is not an. This is not a trivial question, because the question of grace versus power is something that's very strong in contemporary storytelling. And I'm sure you noticed this. You've talked about this a lot. Any sort of world that's built in a fantasy setting that involves divine powers most of the time is expressed by writers who are not Christian as a fairly pagan outlook. A very pagan worldview of humanity trying to either placate angry deities or kill them in any way, shape or form. And the traditional Christian worldview then would look at relics and other objects of power, so to speak, to put it crudely, not as manifestations of power for humanity to grab and then use for their benefit, but rather artifacts of grace that can help one enter into a deeper reality. So how does that work within the world of the story, then?"}
{"episode_id":"SW - #197 - 2021-11-08 - Nicholas Kotar - Double Inversion Storytelling","start":543.86,"end":616.96,"speaker":"Jonathan Pageau","text":"It actually tries to encompass both of what you said at the same time. And so the idea is that the garments of skin are of grace. That is, we always. We have to remember that God gave the garments of skin to Adam as a gift. They're not part of the curse. They're actually a way to. To circumvent the curse. But in that. But it's also a kind of roundabout, right? It's like God is giving Adam and Eve a roundabout to ultimately come back to the same place. But that roundabout has certain consequences. And those consequences are basically, you know, the lineage of Cain and the lineage of civilization, which God is constantly covering, constantly transforming. So I think that's the way to understand it is really that God, whatever action we pose, even if it's fallen or if it's evil, God can cover it and bring it back into glory. So in a way, it actually. So the garments of skin ends up being both at the same time. They end up being something like an evil power that can kind of act on the world and impose itself. But then there's a way in which God can cover that and then make it participate in a real unity, you could say. But obviously none of that is going to be explored theoretically in this story."}
{"episode_id":"SW - #197 - 2021-11-08 - Nicholas Kotar - Double Inversion Storytelling","start":617.2,"end":618.96,"speaker":"Nicholas Kotar","text":"But we're not going to talk about this stuff."}
{"episode_id":"SW - #197 - 2021-11-08 - Nicholas Kotar - Double Inversion Storytelling","start":619.82,"end":625.98,"speaker":"Jonathan Pageau","text":"A story about the relic will manifest itself in the narrative form, like, not in the theoretical form."}
{"episode_id":"SW - #197 - 2021-11-08 - Nicholas Kotar - Double Inversion Storytelling","start":626.22,"end":628.7,"speaker":"Nicholas Kotar","text":"Right. You're not writing propaganda, you're writing a story."}
{"episode_id":"SW - #197 - 2021-11-08 - Nicholas Kotar - Double Inversion Storytelling","start":628.94,"end":632.86,"speaker":"Jonathan Pageau","text":"Yeah, there are very little. Few explanations in this story. It's just the story."}
{"episode_id":"SW - #197 - 2021-11-08 - Nicholas Kotar - Double Inversion Storytelling","start":633.5,"end":635.3,"speaker":"Nicholas Kotar","text":"You just deal. You just deal with it."}
{"episode_id":"SW - #197 - 2021-11-08 - Nicholas Kotar - Double Inversion Storytelling","start":635.3,"end":636.38,"speaker":"Jonathan Pageau","text":"You just deal the story."}
{"episode_id":"SW - #197 - 2021-11-08 - Nicholas Kotar - Double Inversion Storytelling","start":637.1,"end":642.38,"speaker":"Nicholas Kotar","text":"So tell me, is this a historical story? Is it a fantastical story? What is it?"}
{"episode_id":"SW - #197 - 2021-11-08 - Nicholas Kotar - Double Inversion Storytelling","start":642.38,"end":717.28,"speaker":"Jonathan Pageau","text":"And this is also the same problem, is that in a way, we're trying to bridge. We're trying to create something which is going to encompass both at the same time. So it is definite. So in a way, it treats certain, let's say, biblical aspects or kind of traditional aspects as take them very seriously. And then on the other hand, there is a very loose capacity we have to dive into the story. And for example, like, there are certain characters which exist together which obviously are completely anachronistic. Like St. George and St. Simeon the Stylite did not exist. At the same time, we all put them in the story kind of to create something which in which the saying becomes like a type and becomes like a character. And hopefully we. I know it's tricky, and I. And I know some people are going to get angry at this, like, for sure. But we hope that ultimately what's going to come out of it is going to be something like a surprise. Like, if I tell you the impetus of what made us want to do, made me want to do this, you can maybe understand what it is I'm trying to do. When. When I started thinking about this, it was right at the time when there were all these stories and movies coming out which were using Christian imagery and Christian mythology to destroy it. Right. It was at the time of that movie, I remember. I don't know if you remember."}
{"episode_id":"SW - #197 - 2021-11-08 - Nicholas Kotar - Double Inversion Storytelling","start":717.28,"end":717.72,"speaker":"Nicholas Kotar","text":"Stigmata."}
{"episode_id":"SW - #197 - 2021-11-08 - Nicholas Kotar - Double Inversion Storytelling","start":717.72,"end":765.12,"speaker":"Jonathan Pageau","text":"Stigmata, yeah. Stigmata. Constantine. Then a little later, Dan Brown and Da Vinci Code. It was like we had a slew of these stories and images which were using the Christian mythology to basically destroy it. There was also Neil Gaiman's Season of Myths, which was earlier, but there was some in that where he was using Lucifer as a character and this hierarchy of heaven and earth, but ultimately to really destroy the Christian worldview and so my conceit, at first when I thought of the story, I had this idea of like St. George and St. Christopher, like a buddy story of two, like warrior saints, you know, fighting monsters. And I just thought like, I was like, imagine they could do like I thought of a really subversive Hollywood type coming up with this idea. And I thought it would be such a great idea for a subversive Hollywood type."}
{"episode_id":"SW - #197 - 2021-11-08 - Nicholas Kotar - Double Inversion Storytelling","start":765.12,"end":765.21,"speaker":"Nicholas Kotar","text":"And."}
{"episode_id":"SW - #197 - 2021-11-08 - Nicholas Kotar - Double Inversion Storytelling","start":765.36,"end":789.6,"speaker":"Jonathan Pageau","text":"And then it kept playing on me and I thought, what if I did the opposite? What if I put up a story that people think looks completely subversive, but that ultimately it's actually going to turn back towards a truly kind of Christian worldview? And so that's why there's going to be some trickiness to some of the elements as people encounter it. But hopefully they can trust enough to know that we're going towards a place."}
{"episode_id":"SW - #197 - 2021-11-08 - Nicholas Kotar - Double Inversion Storytelling","start":790.64,"end":862.83,"speaker":"Nicholas Kotar","text":"Well, it requires a kind of a historically accurate engagement with hagiography that we've lost. Right. Hagiography is history and it is not history. It's both. Right. And it's not supposed to exist in some. In two completely different and completely distinct spheres. You're supposed to be comfortable with going in and out of it. And even though the medieval mindset certainly would not have accepted a fantasy story, they would have considered it to be a falsehood and considered it to be sinful. Still. You have legends that were written during that time that are clearly ahistorical and some of which are not even hagiographical, but they exist in this uneasy kind of tension with the existing canon and also with the larger canon of scripture and the writings of the Holy Fathers. It's really, it's strange. It would be strange to a traditional Christian from long ago to think about the gradations of truth that we talk about all the time. Like scriptures are the most true and then hagiography is a little less true. The writings of the Fathers, they're most of the time are pretty true. And then you have the legends, those are like they're not true at all. You should just stay with them. No, I mean, they would never relate to it that way. So you're trying to kind of push people back into that kind of way of seeing the world."}
{"episode_id":"SW - #197 - 2021-11-08 - Nicholas Kotar - Double Inversion Storytelling","start":862.99,"end":903.88,"speaker":"Jonathan Pageau","text":"Yeah. And the story of St. Christopher is the perfect place to push back into that because it has so much of that problem inside it, like the problem of dog headed men, the problem of legends which appear in the 12th century. The problem, all these problems. But that when you able to kind of pull back a little bit and look at the story, the big story of St. Christopher, you realize that in a certain manner, it's addressing the very question. Right. It's addressing this border place, like this place in between. And so this is what our story is about the whole way through, even in its form. Like, not just in its content, but in the manner in which it's structured and the elements which are put inside of it."}
{"episode_id":"SW - #197 - 2021-11-08 - Nicholas Kotar - Double Inversion Storytelling","start":904.15,"end":920.51,"speaker":"Nicholas Kotar","text":"Yeah. And so the discomfort that the extremely right people are going to have is actually something they should probably lean into because it breaks that comforting sense that we know everything already, so we don't need to learn anymore because everything's already clear. We've already been told everything that we need to know. Which is death."}
{"episode_id":"SW - #197 - 2021-11-08 - Nicholas Kotar - Double Inversion Storytelling","start":920.51,"end":948.15,"speaker":"Jonathan Pageau","text":"Yeah, exactly. Yeah, it's death, exactly. But we're hoping that it'll be like. My big hope is that this is mostly get people excited about Christian legends and realize how much fodder it is for storytelling and not just for those that want to destroy us. Like, you know, those that want to destroy us have been diving into all these legends and using them. Now why can't we. And use them in a way that is. That is more celebratory, you could say."}
{"episode_id":"SW - #197 - 2021-11-08 - Nicholas Kotar - Double Inversion Storytelling","start":948.55,"end":999.9,"speaker":"Nicholas Kotar","text":"Yeah. And that, of course, again and again, this, we're talking about the medium of the story as opposed to the medium of straight up telling or scripture or sermonizing. That this form of transmission of truth is one that for whatever reason, we've abandoned by and large, as a Christian culture or that we've embraced in very limiting fashion. So the discomfort is not. It's a historically contingent reality. It's not something that Christians would have necessarily subscribed to in ages past. So let's talk about the giants. What is it about the giants that people keep coming back to? Why. Why has there been a resurgence in interest starting, by the way, with Darren Aronofsky? Right. I mean, that's. That's kind of where the things started to show up in Noah."}
{"episode_id":"SW - #197 - 2021-11-08 - Nicholas Kotar - Double Inversion Storytelling","start":1000.14,"end":1117.97,"speaker":"Jonathan Pageau","text":"Yeah. When the Noah movie. It's so funny because we had this story that we were writing and then all these stories would pop up in popular culture and we'd think, okay, we can't tell the story anymore. It's being told. And there are several examples, and that was one. When darrenofsky put his Noah movie out, I wrote my brother and I said, okay, our story's finished. We can't tell anymore. But yeah, you realize that's actually not how it works. It doesn't work that way. It was already completely written by the time the Noah movie came Out. I think that there's something about our time that we feel like the clock is winding down, let's say, to a certain respect. And there are many elements which are popping up in culture. The obsession with hybrids, the obsession with. The obsession with. Also this kind of fall into passions and this fall into degeneracy and all these kind of wild desires that are let loose on the world. There's that and then there's also this sense of a growing power, of a state power and a corporate power which becoming so powerful that all of a sudden you realize that you can't. There's nothing to do in the shadow of this power. And so I think that is, let's say, what's going on in the world. Myth is bringing back the image of these giants. But not just the giants. Right. Also the hybrids and the monsters on the edge of the world in general. But of course, in Christian terms, in biblical terms, those monsters that are on the edge, they are the giants. But a lot of the images we see are all about these monsters on the edge of the world. Even Wonder Woman as the. And the Amazons, like all this imagery of Amazonian women is very strong right now. And so there's many, many images of this going on. I think that the giants, like the Christian one, and it's actually probably going to start to focus towards giants as this moves forward, let's say. I think that even in popular culture there'll be more about giants."}
{"episode_id":"SW - #197 - 2021-11-08 - Nicholas Kotar - Double Inversion Storytelling","start":1118.05,"end":1128.21,"speaker":"Nicholas Kotar","text":"So there'll be more depictions of 15 foot tall, hybridized human animal, minotaur kind of things as being the main thrust of evil."}
{"episode_id":"SW - #197 - 2021-11-08 - Nicholas Kotar - Double Inversion Storytelling","start":1129.01,"end":1146.58,"speaker":"Jonathan Pageau","text":"Or maybe not of evil, like for us on our side. Yes, but maybe not of evil, rather maybe other enlightenments. Other things. Yeah, of enlightenment of something which is frightful, but which is inevitable. There's going to be that type of imagery, I think."}
{"episode_id":"SW - #197 - 2021-11-08 - Nicholas Kotar - Double Inversion Storytelling","start":1146.58,"end":1204.42,"speaker":"Nicholas Kotar","text":"So. That's a really interesting thought. Yeah. I'll be interested to see how that comes out and whether or not the sort of rising tide of storytellers amongst the Christians will be able to in some way put that in the proper context and avoid it. Avoid popular culture being able to take those images and use them for their own means, which is something that I hope will happen. I hope that this, that this is the continuation, if not a beginning of a kind of movement of more proper storytelling, a more old kind of rooted storytelling that didn't necessarily used to be, in the modern sense, limited to the Christian. I don't like to say that, but that's how the world views it. Right. This used to be just the way people thought. Right. And so I would. I would hope that there's enough of a burgeoning movement that would allow us to start telling stories like this on a larger scale. I certainly hope that's what's going to happen with this. Because this is not necessarily intended only for Christian audience, is it?"}
{"episode_id":"SW - #197 - 2021-11-08 - Nicholas Kotar - Double Inversion Storytelling","start":1204.5,"end":1280.71,"speaker":"Jonathan Pageau","text":"No, not at all. Like, there is. There definitely be unapologetically Christian elements in it, but there won't be much of the type of moralizing or evangelizing or telling the story of. Of salvation or whatever it is that you usually find in kind of bad Christian art. There'll be nothing of that. It's going to be a straight up adventure story, you know, with stakes and arcs and giant. You know, it's like all the characters have their arcs and all the, you know, it's just a story, basically. We submitted it to a script scouting agency at the outset. That's how this kind of started. We wrote it, we submitted a script scouting agency, they gave us a few recommendations, we fixed it up, and then they ended up recommending it to studios. And the studios were requesting the screenplay. Yeah. And so it's like, if Hollywood studios are willing to request the screenplay, obviously once they read it, they're like, yeah, there's no way. Like, at the end of it, it's like a Lord of the Rings. So it's like, oh, yeah, I'm going to have armies of giants, like fighting Byzantine soldiers. Like, okay, that's not something we're going to put $200 million into. So for us, it was also proof that. That the story stands on its own. Like, it's not just a Christian story. It can totally exist in a secular world."}
{"episode_id":"SW - #197 - 2021-11-08 - Nicholas Kotar - Double Inversion Storytelling","start":1280.87,"end":1393.44,"speaker":"Nicholas Kotar","text":"I want to get back to the question of using sort of traditional storytelling forms, using dramatic arcs and things like this a little bit later, because I think there's an interesting conversation to be had about that. But first I wanted to address something. When you're talking about the sort of emergence of the giant, the hybrid in the popular consciousness, this is something that struck me a lot lately. The convergence between transhumanist thought and Christian thought in a strange way recently. And that is that technology and the world that's coming into being right now, Web 3.0, the sort of Internet of things, the extension of the virtual out into the real is something that people like Kevin Kelly and people at Google have been thinking about in a philosophical way for a long time. And they see, they seem to allow for the possibility some of these. Some of these People seem to allow for the possibility that there is an emergent consciousness coming into, into all this and that technology itself is somehow a burgeoning consciousness that wants to express itself. On the other hand, so this is something that I find very interesting, the emergence of alternate consciousnesses independent of human will. On the other side, you have a competing school of thought which is popular especially amongst men, amongst Christianity, in that there is a cabal behind closed doors orchestrating this emergence. Which of those two sides do you find to be more compelling? I will put my cards on the table. I think the idea that C.S. lewis shows dramatically in that Haitius strength, which is exactly this. The demonic taking advantage of the emergence of technology in ways that the creators did not anticipate. I think that's a far more interesting and compelling vision of the world as opposed to the cabal that's hiding behind closed doors and orchestrating everything from above. But what about you?"}
{"episode_id":"SW - #197 - 2021-11-08 - Nicholas Kotar - Double Inversion Storytelling","start":1393.44,"end":1478.27,"speaker":"Jonathan Pageau","text":"Yeah, well, I think that you could say, yeah, there's a cabal behind. There's a demonic cabal, like, say it that way. There are demons that are. And so the way that these things work is that everybody just works for their own advantages. Everybody has their own stakes. And the stakes, those stakes don't necessarily have to do with the. With the demonic, you know, taking a body in the world and manifesting a God in reality. But they fall in line because all of those stakes are related to their passions, related to greed, related to power, related to, you know, to having power over others. And so it doesn't have to lay itself out as this superstructured thing of people sitting in dark rooms, like you said, but nonetheless it manifests itself through our passions and through everybody's desire to get what they want. So it is organized, but it's not organized in the way that we would think. It's organized through everybody's own interests. But I think it's definitely something which is. It's so interesting and disturbing and scary to feel like, you know, we're sitting in the Book of Enoch basically, and we're kind of watching it happen and we're actually watching the birth of a new God or a new religion. And everybody seems to think that that's like so many people seem to think that that's plausible. Even people that are secular that are. So it's a very scary. And it's very scary and disturbing, that's for sure."}
{"episode_id":"SW - #197 - 2021-11-08 - Nicholas Kotar - Double Inversion Storytelling","start":1478.91,"end":1489.66,"speaker":"Nicholas Kotar","text":"Yeah, certainly. I mean, yeah, neither one of those two possibilities is one that's particularly exciting. Exactly. Let's talk a little bit about this Entertainment for the wider world."}
{"episode_id":"SW - #197 - 2021-11-08 - Nicholas Kotar - Double Inversion Storytelling","start":1489.74,"end":1490.14,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #197 - 2021-11-08 - Nicholas Kotar - Double Inversion Storytelling","start":1490.46,"end":1537.5,"speaker":"Nicholas Kotar","text":"Entertainment that's inspired by the Christian vision that we hope is going to be something that doesn't merely entertain, that doesn't merely provide for an escape constellation, although those things are important, but also might provide a kind of door or window into individuals being able to experience reality at a deeper level, at a more transcendent level. Recently there have been conversations, or rather, let's step back a bit. What would be your answer to the ever present question that I encounter all the time? As orthodox people, we shouldn't be wasting time writing fiction, because fiction is a waste of time. It's taking you away from the things you should be doing, which is the ever spiraling upward ascent in the spiritual life. How can this possibly be something that you need? What would be your answer to that?"}
{"episode_id":"SW - #197 - 2021-11-08 - Nicholas Kotar - Double Inversion Storytelling","start":1538.33,"end":1560.57,"speaker":"Jonathan Pageau","text":"Well, my answer would be that for whoever person said that, you could say something like, this is not for you. I think it's wonderful that you spend all your attention praying and reading the lives of the saints. That's awesome. It's actually wonderful. And I would say, thank God that there are still people like that in the world."}
{"episode_id":"SW - #197 - 2021-11-08 - Nicholas Kotar - Double Inversion Storytelling","start":1560.73,"end":1562.89,"speaker":"Nicholas Kotar","text":"You're way too nice, man. That's not what I would say."}
{"episode_id":"SW - #197 - 2021-11-08 - Nicholas Kotar - Double Inversion Storytelling","start":1564.73,"end":1652.11,"speaker":"Jonathan Pageau","text":"But I think that, you know, if you say that to someone, like, if I say that to you and then I go home and I stream Netflix. Yeah, we have a problem, right? We have a. We have a problem. And so I would say that it's. It's to really understand it in terms of a ladder and in terms of the lower rungs of the ladder. And I think that it's true that in a way, fiction does not at all play the same role. That liturgy, that sacred music, that the lives of the saints that icons play, not at all. They are quite. They're much lower on the ladder. There's something akin to the type of fairy tales that people would hear in their villages, you know, the type of epic poetry that, you know, that still existed until not that long ago, you know, bards would go around and sing these songs, you know, these have always existed. The idea that this is that fictional stories and stories that are a little more. That tug a little more at your passions, you could say the idea that those didn't exist before and that this is a modern thing is completely false. The problem is that. Is that things are lopsided and that we're obsessed with entertainment and that entertainment has replaced religion, has replaced the things that ask most of our attention. So I would say we need to, if we want to help People come back. We need to put things on the lower bars of the ladder so that people can see them and people can start to kind of climb back into a participative world. That's my best answer to that."}
{"episode_id":"SW - #197 - 2021-11-08 - Nicholas Kotar - Double Inversion Storytelling","start":1652.75,"end":1799.08,"speaker":"Nicholas Kotar","text":"That's a great answer. And I think something implicit in that is the acceptance and the humility that many of us don't have to recognize that we really can't jump over those lower rungs and immediately go up into the higher ones to get the full appreciation of what iconography, of what the depth of the poetic language of the hypnography is trying to tell us until we have a substratum of figurative syntax with which to be able to populate those realities. John Simmons. Yes, you are mentioning St. Basil already dealt with this in his. In his oration to Young Men. We could talk about that. But it's important. It's important for not merely for those outside of the church, but those within it, because. Primarily because of this very uncomfortable reality that some people don't want to think about, and that is that our hearts are very cold and they're not getting much warmer. And the reality of death as it's come at us in Covid has not tended, by and large, to soften our hearts. It's tended to make them harder, and it's tended to make the division stronger. Which suggests to me that we need more, not less, of the kind of heart softening things that stories give us. Because without a softened heart, you could enter into a spiritual experience. Absolutely. And then you will be one with the demons because they will delude you very, very quickly, because your heart is incarcerated, capable of accepting the softness of grace. And there is an experience, an intense experience of oneness with other that happens when you encounter any story, when you're reading, when you're watching. And that association of self with other, that empathic relationship, is something, by the way, that we really don't have right now because we've been physically separated from other people. And zoom doesn't provide it. So for a lot of people, the only thing they have is story. And I'll tell you that, you know, the most. The thing that I get emailed about the most of all the things that I do isn't my novels. It's not my more kind of theologically oriented stuff. It's the fairy tales that I tell for ancient faith. Those are the things that tend to. Tend to resonate with people the most. The simple eternal fairy tales. So. So I think, yes, I think this fits within that, within that larger genre in a very. In a very interesting way. You know, it still pushes some boundaries, which is important as well, because any kind of creativity can't simply sit in the background and just be passive. You have to push people on towards something else."}
{"episode_id":"SW - #197 - 2021-11-08 - Nicholas Kotar - Double Inversion Storytelling","start":1799.32,"end":1859.34,"speaker":"Jonathan Pageau","text":"And like I said from the beginning, the story itself, this story itself is a garment of skin. And we are very much aware that that's what it is. And it's not like we understand of the meta question of what the story is. And so that's why it is going to be. There is a suspicious aspect to it. I don't know how else to say it. Like, not in a bad way, in the sense that there's a way in which for it to reach out into the world, it has to have certain characteristics. And if we're aware of them, we can try to turn them more toward the inside. But I was really excited that Greg Hurwitz, who's like, that's incredible. Right? So he read it and he was like, yeah, great. And he gave us a blurb. And so it's like, he's not at all a Christian, you know, to me, that gave me hope. It's like, okay, this is what we're trying to do is happening, you know, So I just hope Christians will get on board, like, won't get actually annoyed that the other side is also thinking that it's an okay story."}
{"episode_id":"SW - #197 - 2021-11-08 - Nicholas Kotar - Double Inversion Storytelling","start":1859.66,"end":1952.08,"speaker":"Nicholas Kotar","text":"Yeah. Because sometimes we get very comfortable in being separate from everybody. It's much safer to be behind the cloister walls. Back to this larger question of the importance of dramatic entertainment. I don't know if you saw this, but there was a. There was a rather involved conversation on Facebook a while back, maybe about half a year ago, where a rather famous orthodox personality. I won't say who this person is. I don't want to embarrass anybody, but many of you may have seen this conversation on Facebook, so you may know who I'm talking about. Suggested that this. This reinvigoration of the need for re. Enchanting the cosmos is something that is overblown and is. Tends towards the passions rather than towards edification. This person especially made the point that what ends up happening with these entertaining stories that are written according to the traditional arcs that tug at the emotional heartstrings first and foremost, not the spiritual ones, tend to produce a. An internal void of the kind that needs filling constantly. So what ends up happening after you finish an exciting and dramatic story? You want the sequel, right? So this. She. And so this person then insisted that it would be better not to write stories of that kind, but rather to focus on more human, quiet, nonfiction stories of encounter between the divine and the human, kind of a very different kind of story. If this person were sitting here with us right now, what would your addition to this conversation be?"}
{"episode_id":"SW - #197 - 2021-11-08 - Nicholas Kotar - Double Inversion Storytelling","start":1952.48,"end":2092.87,"speaker":"Jonathan Pageau","text":"I mean, my addition to the conversation would be that the stories we have from antiquity, the ones that were preserved and the ones that were kept by Christians and retailers, told as a way to train the mind, as to train people in understanding story arcs and story structures, were very much of the kind, maybe, that she decries, including all medieval legends, Arthurian legend, the Alexander romance. There's so many. There's so many to name. They don't, of course, have exactly the same structure as ours because there has been changes. But in terms of creating these kind of cosmic stakes and these arcs of character, they're all there in those ancient myths as well. And also the fatal flaws in all of these types of structures are all there. So I don't think. I agree. I don't have a problem with the other part. I think it's fine to have stories of encounters, stories of people having spiritual experiences. I think that those are useful as well. But what we're trying to do is a little more than that. We're trying also to poke through the bland materialism that has taken over culture growing since the Enlightenment. We're trying to help people see the cosmic structure again. And so when you listen to Lord of Spirits podcast, you get that that's what they're trying to do. They're trying to say this is all there in scripture, this whole cosmic aspect, this hierarchy of angels, of all these demons and these angels fighting and these monsters and the below in the abyss. And all of this is. This is what this story is about. We've just taped over it, like, we've tried to eliminate it. And now because of that, people are in love with Star wars and in love with Harry Potter and love with all this other stuff. So can't we poke through and help people see once again that this is our story? Like, this is the biblical story, the Christian story in which we live. And there's testimony to that, not only in the biblical stories, not only the hagiography, but the iconography, all these icons, that if you take the time to look at some of these icons, you realize that that's the world that they're in when you see the angels above. And all of this is something that we are hoping to kind of reinvigorate. So I don't Agree. I definitely don't agree."}
{"episode_id":"SW - #197 - 2021-11-08 - Nicholas Kotar - Double Inversion Storytelling","start":2093.35,"end":2152.7,"speaker":"Nicholas Kotar","text":"Yeah, I mean, I'm with you for obvious reasons, but the one thing that, that that kind of argumentation tends to miss is that there's a garment of skin to be poked through, is that most people have such a thick garment of skin, so to speak, when it comes to realistic stories, even if they're nonfiction, of human encounters with the divine, that there's a huge activation energy that needs to be overcome before they're willing to even accept this as plausible. In what? In their version of flat reality. And ironically, by framing it in a more mythological and therefore more real. They don't know this, but we do. In a more mythological, fantastical, however you want to call it, setting, you're allowing for the garments of skin to be stretched so thin that they're much more. It's much more easy to poke through them and allow for the glimmerings of that reality to come. To come in. And then maybe afterwards they can be inspired by those stories. Because, I mean, how many flat materialists are going to sit through a story of a conversion? Hardly anybody."}
{"episode_id":"SW - #197 - 2021-11-08 - Nicholas Kotar - Double Inversion Storytelling","start":2153.98,"end":2183.75,"speaker":"Jonathan Pageau","text":"No, you're right. Exactly right. And I think that it's also, for me, it's also that, you know, for years now I've been talking about this like I'm trying to explain it, explain it, explain it, explain it. But it seems like I also have to. And I complain and I also complain about the quality of the story. And so I also kind of have to make my own to prove to people that I take this seriously, that I am also wanting to kind of be involved and to try to tell better stories. So there's definitely part of it as well, like why we're trying to get."}
{"episode_id":"SW - #197 - 2021-11-08 - Nicholas Kotar - Double Inversion Storytelling","start":2183.75,"end":2196.03,"speaker":"Nicholas Kotar","text":"This done well, and it's putting your money where your mouth is, right? And it's making, it's. There's a bit of vulnerability that needs to be exposed here because, you know, all stories are subject to the criticism of the masses."}
{"episode_id":"SW - #197 - 2021-11-08 - Nicholas Kotar - Double Inversion Storytelling","start":2196.19,"end":2200.75,"speaker":"Jonathan Pageau","text":"That's right. As soon as it's out there, it's like this and that, you know, whatever."}
{"episode_id":"SW - #197 - 2021-11-08 - Nicholas Kotar - Double Inversion Storytelling","start":2200.75,"end":2206.28,"speaker":"Nicholas Kotar","text":"I don't like this. I don't like this. Somebody, there'll be a bunch of other, you know, YouTubers are going to be starting to start complaining about your stories now, right?"}
{"episode_id":"SW - #197 - 2021-11-08 - Nicholas Kotar - Double Inversion Storytelling","start":2206.59,"end":2207.71,"speaker":"Jonathan Pageau","text":"That's right, exactly."}
{"episode_id":"SW - #197 - 2021-11-08 - Nicholas Kotar - Double Inversion Storytelling","start":2208.59,"end":2224.67,"speaker":"Nicholas Kotar","text":"So then what do you think? Do you think there's a way that we can limit that knee jerk reaction? Fill me with more drama. Fill me with more drama. Is there some way that we can. Is there something that we can do with our stories that can Limit that kind of reaction that we wouldn't want to see in our readers?"}
{"episode_id":"SW - #197 - 2021-11-08 - Nicholas Kotar - Double Inversion Storytelling","start":2224.91,"end":2280.35,"speaker":"Jonathan Pageau","text":"Well, I think at least in my case, what I'm hoping to do with this is to point people back to the traditions, surprise people and say, you know, oh, these, what are these traditions talking about? Like, what are, you know, is there really a Saint Mercurius? Is there really a Saint George? And what's his story? And is it as wild as the one you're telling? Maybe not the same, but it's pretty much as wild as the stories that I'm telling. And so trying to get people back into that, like one of the things that's going to happen, you know, as you've seen that the people who were watching this, your patrons have seen in the preview that I've said, we kind of set up this mythological Old Testament narrative, but that's going to come back. So, like, all through the story you'll see all the old, especially in Genesis, all the Old Testament characters kind of reappear as feeding into this mythological story. And that's what we wanted too, is for people to get excited about these characters and go back and rediscover them in their original context."}
{"episode_id":"SW - #197 - 2021-11-08 - Nicholas Kotar - Double Inversion Storytelling","start":2280.67,"end":2285.39,"speaker":"Nicholas Kotar","text":"So what's the plan for the series then? This is volume one. How many volumes do you anticipate there being?"}
{"episode_id":"SW - #197 - 2021-11-08 - Nicholas Kotar - Double Inversion Storytelling","start":2285.95,"end":2381.56,"speaker":"Jonathan Pageau","text":"Well, we'll see. So this was a screenplay, right? So we actually, when we wrote it, at first it was about three times the length of a screenplay because we didn't know what we were doing, obviously. And then when we finally whittled it down to the length of the screenplay, there's so much that we had to cut out, which is good because it gave us really a very purified way of telling the story. And when you read even the first volume, you'll feel that it's very streamlined and very kind of purified in terms of the narrative. So that was great. But there's all this other stuff. And so the question I'm asking is if this is successful enough, like, if people really like it, people really get involved in it. One of the things I'm hoping to do is to reintegrate some of these streams that were clipped. So to make it even more epic. Like a lot of the streams that are clipped were things that would make it even more into like a multi arced epic story. So it really depends on how people like it and how people are willing to kind of get involved. Because the idea with this is, you know, the artist that is working on the book, we've been working on this for like three years. But it's mostly because he's been doing it very much part time, and he has young kids and he has some health issues in his family. So all this has kind of limited him. So what I'm hoping with this book is that we raise enough money so that he can quit his job and just do this full time. If that happens, then I'm really hoping we can start putting books out every six months or every eight months or whatever. And if that works, then we could make this bigger and add a lot. Like a multiverse version of God's talk."}
{"episode_id":"SW - #197 - 2021-11-08 - Nicholas Kotar - Double Inversion Storytelling","start":2383.87,"end":2387.07,"speaker":"Nicholas Kotar","text":"Hey, that's in the ether. Right now everybody's talking about multiverses."}
{"episode_id":"SW - #197 - 2021-11-08 - Nicholas Kotar - Double Inversion Storytelling","start":2387.07,"end":2388.19,"speaker":"Jonathan Pageau","text":"That's right. Yeah."}
{"episode_id":"SW - #197 - 2021-11-08 - Nicholas Kotar - Double Inversion Storytelling","start":2388.19,"end":2398.75,"speaker":"Nicholas Kotar","text":"Well, multi cosmos. All right, so tell us about the practical things. How is this coming out? How do you want people to act?"}
{"episode_id":"SW - #197 - 2021-11-08 - Nicholas Kotar - Double Inversion Storytelling","start":2399.15,"end":2491.35,"speaker":"Jonathan Pageau","text":"All right, so it starts on October 31st. We starting on Halloween, the crowdfunding. And if you've read the. If you've read. Actually, no, the people that want you've read it, you'll see. You can see why, like, the first scenes of the story happened during carnival, and that's when the monster appears. And so it was just perfect to start it on Halloween. And so it starts on Halloween for two months. And people can go on Indiegogo and there'll be different ways to support it, obviously, buying the book. And then I'm also selling prints and signed prints for people who want to kind of be more involved and give more. If we reach a certain amount, like I think it's 50,000, then we're going to add another book, which is going to be called the Secrets of God's Dog, which will have some articles about St. Christopher, some that I've written, some that I will write. And a text by my brother. He hasn't published anything since his book, so it's great. A text on Samson and the relationship between Samson and the cherub and the flaming sword, which I think people get excited about that. And then some of my art that I drew 10 years ago that people haven't seen. So, like with this extra book. And then people can buy pages from the book as well. So that's like original pages. So that'd be like the tried to get. People who want to kind of support it at higher levels will have things that they can. That they can get to. And then ultimately we're hoping to put out a PDF of it as we reach also a certain level, then people can be like, $10. People can buy the PDF as well. So those will be like the major, the major ways that people can support it."}
{"episode_id":"SW - #197 - 2021-11-08 - Nicholas Kotar - Double Inversion Storytelling","start":2491.85,"end":2534.34,"speaker":"Nicholas Kotar","text":"And the good thing about indiegogo is that whatever you make, you make. It's not an all or nothing kind of platform. So everybody who's listening and who are going to be listening to the recording of this later, you needn't worry about this reaching a certain threshold, which is the, the one problem with Kickstarter is that if you don't make it to a certain level, the whole thing kind of collapses. So that's, That's a good thing. Whatever you, Whatever we managed to scrounge up for this project, it's going to be there. But what I like about, about the whole crowdfunding thing is that it's a. It's a way of gathering a tribe together, a community. So this is, in some ways, it's. It's a pure form of contributing to the written word than buying stuff at Amazon."}
{"episode_id":"SW - #197 - 2021-11-08 - Nicholas Kotar - Double Inversion Storytelling","start":2534.82,"end":2535.54,"speaker":"Jonathan Pageau","text":"Yeah, definitely."}
{"episode_id":"SW - #197 - 2021-11-08 - Nicholas Kotar - Double Inversion Storytelling","start":2535.78,"end":2543.74,"speaker":"Nicholas Kotar","text":"You're immediately. It's, it's a, you know, it's an unmediated experience in helping craftsmen and artisans get their workout. It's more medieval, isn't it?"}
{"episode_id":"SW - #197 - 2021-11-08 - Nicholas Kotar - Double Inversion Storytelling","start":2543.74,"end":2579.3,"speaker":"Jonathan Pageau","text":"Yeah, definitely. That's how it feels. We wanted to just. We also wanted to do it ourselves, to stay in control of everything. Because obviously, once you start getting involved with editors, you know, they have their own opinions, they have the marketing team, they have all this. And we feel like this story, this is the story. Like, this is the story we want to tell. We feel like it's been proven in terms of having it read by enough people, so we don't want it to be changed. So this is the story we're telling. That's why. That's one of the reasons why we're doing it on our own. I already had some editors, some publishing companies write me and ask if we'd be interested to submit it or whatever. But, yeah, this is how we're doing it."}
{"episode_id":"SW - #197 - 2021-11-08 - Nicholas Kotar - Double Inversion Storytelling","start":2579.3,"end":2615.13,"speaker":"Nicholas Kotar","text":"Well, no, it's better, unfortunately. The reality is now that if you don't. If you don't skew to a certain cultural line, you're not ever going to get it published. And, yeah, this is the way to do it. And I honestly hope, and I think that this will happen, that this is going to be the beginning of a bunch of different projects. And as soon as this becomes. As soon as people see how it can work, I think this is going to be an avenue for a lot of creatives to start experimenting because it's a harsh taskmaster. If you do a bad product, nobody's gonna buy it. So this is it. Can be a humbling thing, but it can also be a very exciting thing. So I wish you a lot of luck and a lot of providence and I think it's gonna do great."}
{"episode_id":"SW - #197 - 2021-11-08 - Nicholas Kotar - Double Inversion Storytelling","start":2615.53,"end":2619.45,"speaker":"Jonathan Pageau","text":"Thank you so much. I appreciate it. And thanks for the support and all this."}
{"episode_id":"SW - #197 - 2021-11-08 - Nicholas Kotar - Double Inversion Storytelling","start":2619.45,"end":2619.81,"speaker":"Nicholas Kotar","text":"It's."}
{"episode_id":"SW - #197 - 2021-11-08 - Nicholas Kotar - Double Inversion Storytelling","start":2619.81,"end":2641.82,"speaker":"Jonathan Pageau","text":"It's great. I'm happy to know that I have like. I feel like I even have people around. Like I have a team in a way. It's not directly, but kind of an indirect team. You know, there's you in Paul Kingsnorth and there's all the. And even Rodrier and there's people around that are like, yeah, Jonathan, go do it. And I'm like, alright. So I feel like I'm being. I have a. I have a good, good amount of people around me that. So that I'm really grateful for that."}
{"episode_id":"SW - #197 - 2021-11-08 - Nicholas Kotar - Double Inversion Storytelling","start":2641.82,"end":2643.66,"speaker":"Nicholas Kotar","text":"So thanks. Yeah, absolutely."}
{"episode_id":"SW - #197 - 2021-11-08 - Nicholas Kotar - Double Inversion Storytelling","start":2644.38,"end":2706.46,"speaker":"Jonathan Pageau","text":"I hope you enjoyed this episode of the Symbolic World. The Symbolic World is based on a series of videos that you can find on my YouTube channel, Jonathan Pedro's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course leaving a review on itunes. Everybody knows that's the best way to get the podcast out there, to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon, the Pageau videos as well and on subscribestar. All those links you can find on my website or in the show description. So thank you and I will see you soon."}
