{"episode_id":"SW - #079 - 2019-12-11 - The Garden of Eden as Cosmic Structure","start":0.4,"end":39.66,"speaker":"Jonathan Pageau","text":"So one of the comments that I'm getting quite a bit is that people have noticed that I recommend Sand Ephraim the Syrian and his poems, the Hymns of Paradise, to read that in order to understand the story in Genesis and also the symbolic structure. And many people have written me to say that they're struggling to get out of St. Ephrem what I suggest they can get. And so last month, I was invited by Father Jason Foster to Shreveport, Louisiana, to speak at a clergy retreat for the Orthodox Church, the OCA Orthodox Church of America, but also to give two public speaking events at his parish."}
{"episode_id":"SW - #079 - 2019-12-11 - The Garden of Eden as Cosmic Structure","start":39.82,"end":40.82,"speaker":"Jonathan Pageau","text":"And so what you're going to see."}
{"episode_id":"SW - #079 - 2019-12-11 - The Garden of Eden as Cosmic Structure","start":40.82,"end":74.05,"speaker":"Jonathan Pageau","text":"Is the first part of that. I'll post the second part in a few weeks. But the first part was really diving into the poem of Saint Ephraim, also connecting that poem with Saint Gregory of Nyssa and his vision of the ascent of the mountain. And so what we're really getting is this image of the mountain of paradise as this cosmic structure. And so hopefully this will help people get through St. Ephrem and get the gold nuggets that are found in his poem. Please enjoy my first dive into Sand Ephraim the Syrian, and I hope you enjoy that."}
{"episode_id":"SW - #079 - 2019-12-11 - The Garden of Eden as Cosmic Structure","start":87.01,"end":1510.57,"speaker":"Jonathan Pageau","text":"This is Jonathan Peugeot. Welcome to the symbolic world. Tonight, what I want to talk about is I want to talk to you a little bit about that experience that I had or try to take you along that experience that I had of seeing how everything is connected together, to see how the Bible and our tradition of the Fathers, the icons, all of this is really a powerful series of embedded patterns, you could call it. The way I sometimes try to describe it is that reality has a fractal structure, Already knows what a fractal is. So a fractal is like a tree. If you look at a tree, you have the basic tree, but then each branch of the tree has the same shape as the tree. So you have a tree and then the branch and on. If you follow the branch, if you could cut the branch off and hold it, it would look just like a tree. If you cut a smaller branch off, it would also look like a tree. Because the pattern is the basic pattern, but then at every level of the tree, it's the same pattern which reappears. And that's what. When you start to look at the way that the Fathers were interpreting scripture and the way that then they use that, and they. They use that to form our liturgy, to form our icons, to form the way that they talk about Scripture, that that's what they're diving into. They're diving into that pattern. And so when a father will add some. We'll go through some of. Some of the details. When a father will add some little detail in the text, it looks like he's making up some detail in the biblical text, some tradition, but he's not. He's able to say that because he's noticed that there's all these patterns come together and the elements are there in each one. So this is very abstract for now. I'm going to take you on the trip, so hopefully you will see what I'm talking about. So first of all, we have this idea, this embedded idea of patterns. You could call it the Fathers. Saint Maximus the Confessor, especially from, talks about it as macrocosm and microcosm. So there's a cosmic structure and then there's a personal structure. The human being is microcosm. And then you have this massive universe which has the same shape as the human person. So Saint Maximus goes very far in this. He says the entire cosmos consisting of the visible and invisible things is man, and man consisting of body and soul is cosmos. For the intelligible things participate to the substance of the soul, as the soul has the same reason as the intelligible ones. That's a little more complicated. Keep the first quote part, but I'm still going to go through it. And the sensible things bear the image of the body as the body as the image of the sensible things. So we have in the created world, there are invisible things, there are principalities, there are angels, there are things that hold, let's say, hold the world together. Then we have sensible things. And in the person, we also have an invisible aspect to us. We have the soul, we have the noose, we even have our desires, which are invisible. And then there's the body, there's the physical part. And those two are. They are the same structure. So because they're the same structure, St. Maximus sees creation as being built for man because man ends up being the thing that holds the whole thing together like this, like an anchor that has. Just like the universe has a physical aspect, an invisible spiritual aspect, and then kind of brings it all together. So St. Maximus talks about how the man is a. He talks about him as being a laboratory in which because the human being pulls all those elements together, right? We have our thoughts, we have our bodies, we have all these elements to us, and we pull them together into one being. And then the human being does that also for creation itself. And so it's interesting. It's interesting to think about that. It's interesting to think about that today because we're. We're reaching. We've gone through this time in history where we've had this kind of scientific materialism, and we've. We and Christians have been slapped around by a lot of that, that thinking where we have this idea that there's the world. The world has these rules, and we just have to look at them and get measured. We can. We can calculate. And then we can just say, you know, here, how. Here's how it works. We figured it out, but we're coming to. We're coming to the end of that. And even a lot of scientists, a lot of physicists are coming to the end of that, where they realize once we've reduced everything to the material world, once we've done that, we have a problem. Because then you have to explain the spiritual stuff. Because before that, they could kind of ignore it because this is stupid. This is just stupid stuff. Let's not talk about that. We're just going to talk about this material stuff. Then you reach the end of it, you're like, okay, we encompass everything in this material stuff. We've encompassed everything. And then at some point, you're like, okay, well, then let's take that stuff, that spiritual stuff, like consciousness, like human experience, like identities, like qualities of things. How do you now fit that into your material world? And they're struggling to do it, so they come up with words like emergence. Right? How. How is it. Why is it that we know that something has parts, but it's also one thing at the same time? Ever thought about that? Right. You look at a chair, a chair has parts, right? It has different parts, different elements, different. Yeah. Why do we think that that's one thing? Why do we say it's a chair? Why don't we just see the parts. Why don't we just see the parts all the way down? Because those parts go all the way down in the scientific world, all the way down to this. To the quantum, whatever, quantum field of particles that are just floating around. So then they. They stack up. They stack up towards the. These different stages of unity. And then in the human experience, we see it even more. Like, why do we think that this here, people coming here, why do we think that that's one thing? Why do we think that the United States of America is one thing? How do we get to that? And so in the vision of St. Maximus, St. Maximus gives us a key. St. Maximus gives us a key. Is that the human person, a modern way of saying that would be something like consciousness, right? Fathers don't use that word. But it's a good word to use because people understand what it means today. People know a lot of the other words like soul you say use the word soul today people just, they have all these ideas of what it means, like try to find words that actually have meaning for people today. So you say, you say through we need consciousness or consciousness plays a part in bringing things together, in making things one. Right. You need a conscious agent to be able to say that chair is a bunch of stuff. But it's also one thing that jump into. Into unity. And that's how St. Maximus talks about us. That's what we do, that's what we are. That's what, that's what makes us special in creation. That's what makes us not only special, that's what makes us in the image of God. All right, so that's this idea of this macrocosm, microcosm, right. And how relevant it is to understand today. One of the words that the physicists are using today, they have a fancy theory, they call it the anthropic principle because they're realizing that anthropic means the shape, like the shape of man. They realizing that it's so complicated, everything is so complicated that you almost need the world to be made in a way to give consciousness to bring consciousness about. Because consciousness is. They're not able to explain it. They can't explain consciousness. They can't explain the thing by which they're looking at the world with. And then that's when people like Sam Axmus can help us get a key to something more. All right, so a lot of you like me come from kind of Bible believing churches, the kind of Protestant evangelical world. And so what I discovered in reading the Church Fathers and today I'm going to take you mostly through a church father whose name is Saint Ephrem the Syrian. Saint Ephraim the Syrian is a Semite. He's an Aramaic saint who probably spoke Aramaic. He actually did. I know it wasn't Aramaic. He spoke the early Syriac language, I would think. I think his texts are written in Syriac. And so he does this powerful interpretation of the Garden of Eden and of. Of Genesis. He has a text called the Hymns on Paradise. And it's a poem. It's a poem that talks about paradise. But the way that he talks about paradise is so powerful because it does exactly what I'm talking to you about. It shows us this pattern that is there. It basically lays the Garden of Eden out as the pattern of everything all the way, until we understand that it's also the pattern of the heart of the human person. All right, so first off, I want to show you how big. How big St. Ephrem makes the paradise. He says he had a vision. Like, for him, he had this. This vision of paradise. And he says, with the eye of my mind, I gazed upon Paradise. The summit of every mountain is lower than its summit, okay? So it's the highest mountain. And then he talks about how the crest of the flood of Noah reached to the foothills of paradise, but it didn't enter into paradise. And so paradise ended up being above the flood. Okay, now you also have to remember that paradise is a mountain, right? That's not. That's actually in the Bible. People forget that it's in the Bible. It's not in Genesis. It's in Ezekiel. In Ezekiel, Ezekiel gives this description of paradise. And, and he says, he talks about paradise as the. As this holy mountain, as this mountain. So you have to imagine this mountain. Now, I'm already going to give you the image. And so he has this idea of this paradise as a mountain. At the summit of the mountain is the Tree of life, right? And let's say above the tree of life, or coming down upon the Tree of Life is the glory of God. Just like the glory of God descended onto the Ark of the Covenant. He has. He just. He talks about how the glory, or that the glory of God descended to encounter Moses on the Mount Sinai. So too, the glory of God is at the summit of the mountain, and we have the tree of life. So he talks about how the limits of the garden. So imagine that. So the summit of the garden is higher than all the mountains. And the limit of the garden is beyond all the ocean. So you imagine the way that the ancient people saw the world. Basically this giant island surrounded by oceanus, by the infinite ocean, which is still true today. There still is this ocean that kind of surrounds everything, you know, that's all connected together, that kind of flows around everything. And so he saw the paradise as the limits of paradise being beyond the ocean. Here's a description that he. That he talks about. He says Moses made a crown for that resplendent altar with the wreath entirely of gold. And he crowned the altar in its beauty, right? So around the altar in the tabernacle, there was this golden braid or this golden crown which went around the altar altar. So he says, thus gloriously intertwined is the wreath of paradise that encircles the whole of Creation. So the crown of paradise, the wreath of paradise, encircles all of creation. So its summit is beyond the highest mountain, and its limit is beyond all of. Of creation. So already we're trying, we're starting to see that the place that he's talking about is maybe not the same kind of place that we're used to thinking about in our kind of very materialistic world. Let's say that he is talking about a place, but this place is the place of places, you could call it, right? It's that which makes place possible. Something like that, maybe a way to describe it. And so this mountain is also a hierarchy. It's a hierarchy of beings or hierarchy of being itself. So here are some descriptions that he gives. He says when he made this intricate design, he varied its beauties so that some levels were far more glorious than others. To the degree that one level is higher than another, so too is its glory, the more sublime. In this way, he allots the foothills and the most lowly, the slopes to those in between, and the heights to the exalted. So that which is exalted, that which is high, that which is glorious, is higher up on this mountain. And that which is confused or in between, or is lower, is lower on the mountain. All right? So hopefully things are starting to take shape in understanding what he's talking about. So then Saint Effort talks about the four rivers of Paradise. So we know that in the garden there were four rivers of paradise. Now, if you think of the paradise as a mountain, right, all of a sudden the image of the four rivers will change as well. Because you. It's hard, you can't really see it otherwise as these four rivers that are coming down the mountain, right? So you can kind of imagine, I mean, you don't have to think about it too much, but like a source, There's a source, some kind of source that is pushing the water and then it's coming down, coming down the mountain. So he talks about how its fountains delight with their fragrance, but when they issue forth towards us, they become impoverished in our country since they put on the savors of our land as we drink them. So he has this idea that the waters of the rivers of paradise, water all of Christ creation, they are the source of all the waters. We always have to remember when we look at in the Bible, when it talks about water flowing, water always comes from above. It has to. It has to come from above. There's no other way for it to be flowing. And so it, it when we talked about flowing waters we're already in this notion of this hierarchy. The water is coming from above. It's coming from heaven. The water is coming from heaven. So here are these four rivers that come down. Water, the world. And as they get lower and lower on this mountain, they lose their quality. They become mixed with the local places, and then they become less pure, you could say. And then he talks about. Talks about the beings. He talks about the children of light. So he talks about. From their abodes, the children of light descend. They rejoice in the midst of the world where they had been persecuted. They dance on the surface of the sea, and they do not sink. Because he, Saint Ephrem, understands that paradise is always there. It's always. It's not something which was only there in the past. It's always. It's always there. And then if we want to participate in paradise, there are ways in which we participate in paradise. And he gives us the ways. He tells us, first of all, he tells us in the Old Testament what those were. He says this structure with this mountain, and he divides it into three. So he has the tree of life at the top, and that is the same as the holy of holies of the temple, of the tabernacle. And then he has the tree of knowledge of good and evil. And that's the same as the holy place in the tabernacle or the temple. And then he has the lower part, the gate or the fig tree, which would be the outer court of the tabernacle. So he divides it into these three parts. Why is the fig tree. Why is the fig tree the third part? Do you know the story why there's a fig tree in that story? Why is there a fig tree in the story of paradise? Who remembers? Sorry, they covered themselves exactly right. So that becomes the first covering. So then everything else is going to flow from there, this notion of the covering. So imagine these levels as three coverings, three veils, the three veils of the temple. You have the veil to the holy of holies, you have the veil to the holy place. And then outside, you have this rougher covering. You have the covering of skin, the garments of skin. Saint Ephrem doesn't talk about the garments of skin, but Saint Gregory of Nyssa definitely talks about the garments of skin. And he explains how the covering of the tabernacle, which was hairy, it was made of animal skins, is the same as the garments of skin that Adam and Eve put on themselves. So as we. As we get lower and lower on the. On the hierarchy of beings, there is this need to cover ourselves more. And it's not that hard to understand that. It's not that hard to understand it. I always talk in my, in my, in my talks about the garments of skin, trying to understand what that is. What does it mean that Adam and Eve had to cover themselves with garments? And it really does have to do with this moving out towards death. So in the garden, they were self sufficient to the extent that they were only dependent on God. And as they move away from the garden, then they start to become dependent on, they start to have to deal with the outside world more and more. The reason why God gave Adam and Eve garments of skin was to encounter the, the thorns. God said because of your fall, the trees will start to produce thorns. And so the world will be hostile to you. And you have to cover yourself in order to face that hostility. So you add a layer of clothing to be able to face the cold. Then if you want more cold, you go further out into a place where human beings, it's more difficult, the world is more hostile to you. You add a house. And if you want to go further out into a world that's hostile to you, you add a wall to your city, you add this and that, and you add technologies in order to supplement your existence out in the world of the, of the hostile world. In the story of the fall, you see it happening. There's the fall, Adam and Eve have garments of skin. And then there's another fall where Cain kills his brother. And then what does Cain do? Found the city. So you have this garment around Adam and Eve and then Cain puts a garment around, around, let's say the group and then his descendants, they end up creating weapons of war and steel, you know, metal weapons, metallurgy, in order to add that. And then the final result of that is the flood where it all breaks apart. You can't. At some point that garments, you keep adding garments around yourself, at some point, you know, it cracks. And then I went through that recently, for those who know that I've been through a flood that the, the, the our city, they built a dike at the end of, of our city because they used to get flooded. And then they started to trust that dike completely. And everybody forgot that the dike even basically existed. It was like this is just normal world. As the waters rose and rose and rose and at some point the dike gave in and the water came in. So these garments of skin, which are immediately described by the fathers as our physical bodies that are, that our fleshly bodies are the first garments of skin that we all know that those, they give us protection for a while, but they're going to break apart. You better do what you need to do while you've got them, you know, because at some point they're going to go away. All right? So, so the notion is that this thing, this mountain, it goes all the way out until so esed. Ephraim had different ways of describing it. He talks about when Adam and Eve fell, then God chased them out of the garden, and then they were lower down on the slope, slopes of the garden. And then when Cain killed Abel, then Cain was chased lower down still, and then Seth was higher up on the mountain. So it is, it's a hierarchy of beings. It's a ontological hierarchy. The more you're closer to God, the higher you up on the mountain, the further you are from God, the lower you are on this, this mountain. For all, all these, those who are orthodox, it's the ladder of divine ascent. It's the same thing. The ladder of divine ascent is exactly what he's talking about here. You know, several centuries before that, that text was written. The, the, the. It's the same, it's the same structure."}
{"episode_id":"SW - #079 - 2019-12-11 - The Garden of Eden as Cosmic Structure","start":1510.57,"end":1511.05,"speaker":"Jonathan Pageau","text":"Okay?"}
{"episode_id":"SW - #079 - 2019-12-11 - The Garden of Eden as Cosmic Structure","start":1513.13,"end":1815.48,"speaker":"Jonathan Pageau","text":"St. Ephraim talks about how this is the same structure as the ark that, Noah's ark, because the human beings were on top and then the birds were there lower than the humans, and then the animals were at the bottom of the ark. Like I said, the same as the tabernacle. The tabernacle had the glory of God in the holy of holies. And on the outside there was the outer court where they had these. And around the tabernacle they also had these, these animal skins that were around it. So it's, it's. All of it is the same, is the same structure. And so then when, when, when it says in the Bible that the children of God mix with the daughters of men, right? In this, he actually gives such a beauty. He's able to avoid the problem of the whole angel thing because he, he, he has it on a mountain. And so you have the, the daughter, the, the, the children of Seth, the sons of Seth, that go down the mountain, and then they, they mix with the daughters of Cain. And so they go, they, they're going down the ontological hierarchy and they're perpetuating this, this fall, like going further and further down. And then finally, like I said, you have this fig tree that was an image of the, the covering. And, and St. Ephraim does a beautiful thing. He tells us why Christ curses the fig tree, right? That text, which is one of the strangest texts in the Gospel, right? Christ comes up to the fig tree and he curses it because it hasn't produced fruit. Well, Saint effort says it into Sanford. It's just like this makes total sense because that's how the fall started. Adam and Eve fell and they tried to cover themselves. And Christ is saying, I'm removing those coverings. I'm going to remove them. And in the process, he. In the. It's also in the. In the story of his entry into Jerusalem, he's going towards crucifixion. He removes the garments of the fig garments, and then he ends up by ripping the last veil in the temple and entering into the Holy of Holies. And so Christ is going. He's going back up. He's doing it in reverse. He's going back up the mountain. In that story, part of it is cursing the fig tree. So does that, does that make sense to some of you? Like, do you. Can you kind of see how this pattern is repeated in Scripture in different places? And the structure of a church, the actual architectural structure of the church follows the same structure, right? Our church, our church architecture has three sections, basic sections. We have the altar, the Holy of Holies, then we have the nave, which the communions gather, and then we have the narthex. Where is the buffer space between the outside. Right. We chase. We don't. Nobody does it anymore, really. But in theory, we chase the catechumens out at a certain moment in the liturgy in order to create that actual ontological hierarchy. We're actually doing that. So we have the priests in the, in the altar, we have the faithful in the nave, and we have those that are in between. Right. Remember, St. Ephrem said, that which is in between is lower on. So we have this in between in the narthex. And then we have the flood or the chaos on the outside. Hopefully I made my case for that at least, because I'm not done yet. And so because this structure exists at all the different levels, when the incarnation happens, then it gets in like it falls into the personal level. Christ is a person. Christ is also the glory of God which descends down on the holy mountain, right? That's what Christ is. He is the ultimate. He is the ultimate accomplishment of that promise of that image of the glory of God descending and, and, and, and coming down onto the Ark of the Covenant, coming down unto the Holy mountain, all of this. So inevitably, the church fathers are going to associate who with the garden, if you look at the icon right behind you. If you look at the icon of the Last Judgment, there's an image of paradise. And there are two images, two basic images of paradise in paradise. One is the bosom of Abraham, right? So think about, think about this ontological hierarchy that I'm talking to you about. You have a source, Abraham, then he has children. They have children. They have children. They have children and it widens out, right? It becomes a pyramid. Abraham has more and more children, has."}
{"episode_id":"SW - #079 - 2019-12-11 - The Garden of Eden as Cosmic Structure","start":1815.48,"end":1816.08,"speaker":"Audience Member","text":"More and more children."}
{"episode_id":"SW - #079 - 2019-12-11 - The Garden of Eden as Cosmic Structure","start":1816.16,"end":2128.01,"speaker":"Jonathan Pageau","text":"And then when they die, if they're righteous, where do they go? They go back. They go back into their place of origin. They go back to Paradise. They go back to their source. They go back to the bosom of Abraham. We could do that. We could keep going until Adam if we wanted to. You know, we go to Abraham, but we could all say we're all in the bosom of Adam, right? But then the other image is Mother of God, right? Because she is the place where Christ came down and manifested himself through. And so we see, for example, in this image, I always tell people, the reason why we put the Mother of God in paradise isn't just because she's in Paradise. It's because she is paradise, right? The reason why we show the bosom of Abraham in Paradise isn't because Abraham is in paradise, because it is Paradise. That is an image of Paradise. And so the Fathers will bring us on that line. Saint Proclus says, the Holy Mother of God and Virgin Mary has gathered us here. She is the pure treasure of virginity, the intended paradise of the second Adam. So in that, that quote, there's a lot of things going on. First of all, she's the one who has gathered us here. What does that mean? Means that the church is also paradise. I already told you, right? It's the same that this, this structure, this, this thing, this is Paradise. I mean, you could say it's not. You could say that there's an eschatological, you know, glorification of that reality where at some point all of creation is going to, to kind of come into this, this, this ultimate revelation of return to paradise, but also the Holy city, like, of course, but we can participate in paradise all already to the extent that we are gathered by the Holy Virgin into the Church. And then she is the intended paradise for the second Adam. The second Adam is of course, Christ. So what is one of the names you do some of, you know, one of the names for Mount Athos? Mount Athos is called the Garden of the Mother of God. Not a great name. What do you think they're referring to when they say the garden of the Mother of God? They're again, the monks, the holy monks, in their. In their divine intuition, they referring to Paradise. They're telling you Athos is an image, is a participation, is a participation in Paradise. And this image is one of my favorite. The image of the Mother of God, of the Holy Fountain, where if you look at her, she's basically a mountain. She's this mountain. And then you can see that the water is flowing down from her, like the water is flowing from the mountain of Paradise. There's another image as well too. You have it in your narthex, which is the Mother of God as the burning bush. If you look at that icon, not all the time, but often they'll make the burning bush in a way that it fills up the entire mountain. And so it looks like the Mother of God is like a mountain inside the mountain. So you have this amazing image of the. Of Mount. Mount Sinai as being. As being the Mother of God herself. So the return to paradise in the. In the. In the Fathers, especially in San Gregory of Nyse, who is one of my favorite fathers, he talks about it as a. The removal of the garments of skin. So he says, in order then to go back into this space, we have to remove the coverings, right? Remove the coverings. And the coverings have to do with our passions, they have to do with our sins. And you have to think about it, because it's not arbitrary, right? Why do we sin? We often sin because we think that that's where life is, right? We think that that's. We have. We have a desire to eat. And those desires are not wrong. Our desires, none of our desires are wrong. We have a desire for sexual desire. We have all these different desires. But the problem is when we enter into that, and we think that that is going to be our protection, that if I eat, then I'm fine, right? If I give in to this desire, then I will find life there, that I. I will. I will be safe, right? But that's why we have ascetic practices. Because that's not where true safety is. That's not where true life is. So St. Gregory of N talks about this removal of the guard, the. The. The garments of skin. But he talks about it in the sense. For example, he talks about how Moses, when Moses went up into the mountain to see the burning bush, it says that he removed his sandals in order to enter into the holy place."}
{"episode_id":"SW - #079 - 2019-12-11 - The Garden of Eden as Cosmic Structure","start":2128.17,"end":2128.49,"speaker":"Jonathan Pageau","text":"And."}
{"episode_id":"SW - #079 - 2019-12-11 - The Garden of Eden as Cosmic Structure","start":2128.49,"end":2628.36,"speaker":"Jonathan Pageau","text":"And St. Gregory will say, you need, we need to remove the garments from the feet of our soul in order to come into the, the presence of God. You think about St. Paul when he talks about, he talks about the circumcision of the heart, right? So he uses the image of the Old Testament of removing this layer of skin, right? Removing this layer of skin in order to go back to something which is rectified, right? To remove the layer of skin. And he says, no, no, he said, yeah, fine, that's good, it's fine. The circumcision was fine. It's an image of something which is way more deep, way more profound, which is that you need to remove the veils around your heart, you need to remove the garments which you use to protect your heart or you use to cover your heart. And so the entering into the temple, the entering into paradise, all of those now come into the person, where the structure of the person ends up being the same structure as paradise, same structure as the temple, the same structure as the church. And so the church fathers talk about this hierarchy of being. We have, we have a capacity which they talk about the noose, the spiritual intellection, the capacity to grasp God, to come into contact directly with God. That would be up there at the top of the mountain. It would be up there, you know, where the tree of life is. And then we have the soul part. You could say the, the thoughts, the feelings, the desires, all of that is in the middle part. And then at the lower part, you would have the body. Or you could also understand the passions as being in the lower part too. Could just see it as a hierarchy. You have the noose or the spiritual capacity, the thoughts, the passions. And you could imagine the body as even being kind of outside. St. Ephraim, he, he taught, he has this great image. He says that there are no animals in paradise. Think that's weird, right? Because in the Bible it doesn't say that there are no animals in paradise. He says that I, even in here, I drew it different from what Saint Ephrem describes it. He says the serpent was not in paradise. Said the serpent came up to the gate of paradise and Adam and Eve had to come down the mountain in order to encounter the, the serpent at the gate. Okay. And so this idea that the church fathers always attach our bodies to the animal part, like the animality, I mean, it's not, it's not stupid. It's obviously true. That is what we have in common with the animals, you know, that the evolutionists have been, you know, the church fathers knew that our Bodies we have in common with the animals. It's not a surprise we. You have the same structure as the animals, but this idea that they have to descend the mountain in order to encounter the animals. So it actually gives a very interesting, very interesting possible solution to the problem of death. This whole problem with people talking about, was there death before? How is it that there could be death before? But if you see the paradise as an ontological hierarchy instead of just seeing it as a story, then you understand that the animals, the mortality was already there. You could say down at the bottom of this hierarchy already, it was already possibility down below this cosmic structure. I'm just suggesting that. I'm not saying that that's a solution, but it's something, definitely something to think about. I had this great. One of my favorite quotes from Saint Nicodemus of the Holy Mountain. He says, you must therefore keep in mind that as the center of a wagon wheel has a certain number of spokes going out to the circumference of the circle and returning to the center where they meet. So also is the heart of man like a center where all the senses, all the powers of the body, and all the activities of the soul are united. And so you can see that structure. Again, he describes it as a flat wheel, but it doesn't matter. It's the same thing as a. As a mountain. You have a spoke, a center. Then you have all these things that come out which emanate from the center. But as they get further and further away. Imagine a wheel. The spokes on the wheel, as they get further away from the center, what happens? They're further from each other. They're further from the center. If you turn the wheel, what happens? The further you get out, the wheel actually goes faster. If you turn the wheel, the further you are on the wheel, the faster it spins. The closer you are towards the center, the slower it spins. And if you come into the very center of the wheel, it doesn't spin at all. It actually stops. The axis of the wheel is. Is. Doesn't move. It's this invisible point in a spinning circle that doesn't. Doesn't move, actually. And so this image, this is it. This is the image. This is. This is the image when the fathers talk about, go into the heart. Go into the heart. You have to enter into your heart. It's because it's all the senses. They come into the central invisible point. This, this, this, this. This place in the human person where, I guess movement stops. I'm not a saint, so I, I don't it's like, I don't. But then it also. But it doesn't mean that everything on the outside, none of it is bad. Right? All of creation is good. And, And Sinephren emphasizes that too. Problem isn't that, you know, like, what's down on the mountain is not. Is not bad, right? But it becomes bad to the extent that it forgets the top. Right? That's. The church fathers always talk about memory. That's the whole idea of memory. So as you in your. You have these desires on the edge of you, you have these things pulling you in different directions. If you forget the memory of God, if you forget God, then that's when those things are going to. To destroy you. That's when they're going to devour you. But if you remember God, then like Saint Ephre talks about the children of light that come down from the mountain and participate in all of creation, and they walk on water. This beautiful image of how the saint can engage with all of creation without it being a danger to him. He's able to come down the entire hierarchy. And the flood for him is basically a floor that he can walk on, like Christ walked on the waters. So this beautiful image of how everything participates. But if you forget, right. What happens, we know, have the story of St. Peter. No, what happens if you're walking on water and then you. You start to focus on what's going on instead of focusing on the face of your divine Lord that's in front of you, you sink. And in that image you get, you get. What is St. Peter say when he's sinking? Lord Jesus, I'm going to say the prayer. It's like, Lord Jesus Christ, have mercy on me. Doesn't say it in the exact words, but that's the basic thing he's saying. He's saying, have mercy on me. And that's our prayer, right? That's the whole of the mystical tradition of the Church is this capacity to, even when you're falling, even when you're lower, to remember the. The glory of God that descended onto paradise. It's all the same. It's all the same structure. So I. This is. Everybody's very silent. Okay. This is the first time that I talk about this to the extent that I'm talking about it now. Okay. And so I. I know it's possible that I have stretched some people maybe beyond the breaking point. We're so used to this idea of this kind of materialist way of understanding the world that it's very hard to think of these embedded realities in each other. So. All right, thank you, everybody. Thank you so much. Thank you."}
{"episode_id":"SW - #079 - 2019-12-11 - The Garden of Eden as Cosmic Structure","start":2634.76,"end":2699.72,"speaker":"Audience Member","text":"I hope you enjoyed this episode of the Symbolic World. The Symbolic World is edited by Justin Ward and it is based on a series of videos that you find on my YouTube channel, Jonathan Pageau's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by, of course, leaving a review on itunes. Everybody knows that's the best way to get the podcast out there, to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon Pageau videos as well, and on subscribestar. All those links you can find on my website or in the show description. So thank you and I will see you soon."}
