{"episode_id":"SW - #195 - 2021-11-05 - Aidan Hart - The Dance between Sacred and Secular","start":0.48,"end":68.9,"speaker":"Jonathan Pageau","text":"So, hello, everybody. I am delighted to be here with Aidan Hart. Aidan Hart is an iconographer. He is a writer. And for me, it's very personal because he's also, let's say, someone who came before me as an icon carver, someone who represented icon carving to an Orthodox world that had forgotten a little bit about that tradition. And so very early in my own career, I reached out to Aidan for advice and for criticism. He was always very gracious to give it. But beyond that, he has written several books on iconography. I would say the Bible of iconography. And he's also written about theory. He's done so many things. And so I'm very delighted and grateful to have him with me today. This is Jonathan Peugeot. Welcome to the symbolic world. Aidan, thank you for coming to talk to us."}
{"episode_id":"SW - #195 - 2021-11-05 - Aidan Hart - The Dance between Sacred and Secular","start":69.14,"end":78.82,"speaker":"Aidan Hart","text":"Thank you. Jonathan, thank you for the honor of finally having time with you. I feel like I've known you so well through our correspondence here, face to face, virtually, not being virtually."}
{"episode_id":"SW - #195 - 2021-11-05 - Aidan Hart - The Dance between Sacred and Secular","start":78.82,"end":79.3,"speaker":"Jonathan Pageau","text":"Exactly."}
{"episode_id":"SW - #195 - 2021-11-05 - Aidan Hart - The Dance between Sacred and Secular","start":79.62,"end":80.62,"speaker":"Aidan Hart","text":"Virtually, yeah."}
{"episode_id":"SW - #195 - 2021-11-05 - Aidan Hart - The Dance between Sacred and Secular","start":80.62,"end":116.18,"speaker":"Jonathan Pageau","text":"Several years ago, I had the hope of, you know, going to England and studying with you and doing all that thing. But, you know, then than reality of being with a family and trying to set up a carving practice hits you very hard. But maybe tell people a little bit about your story, because you are, in a way, a precursor to many of us being, some of, you know, one of. After Uspensky and that kind of very first seed of iconography, you were one of the first people to plunge in completely into the world of icons, of sacred art and representing it to the world. So I want people to know a little bit about how you came to where you are."}
{"episode_id":"SW - #195 - 2021-11-05 - Aidan Hart - The Dance between Sacred and Secular","start":116.5,"end":252.92,"speaker":"Aidan Hart","text":"Thank you. I did my degree in English literature and also mathematics. I've always loved the arts and the sciences. And this actually played out quite well later on when I became an iconographer, and then I trained as a teacher and left that quite quickly to follow my heart, really, and be a sculptor. So I was in a Heinelican church, so I was aware of the role of art in general, but in my sculpting, I was searching for ways of showing the inner as well as the outer. I was very interested in bringing together the spiritual and the material, and I was looking for art that would help me do this. And I came to some conclusions, how to unite the two. And then a friend of mine in New Zealand, I was raised in New Zealand, had just visited two Orthodox monks in New Zealand, one of whom was an iconographer. So I went and visited these monks, and immediately I saw the archaeological. And I realized that the icon had been doing for 2,000 years, almost what I had been trying to do in my own little sculpting work, and plus a lot more, of course. And then I was really drawn to the monastic life and realized that behind the whole icon culture was a way of seeing, a way of seeing the world, a way of seeing God. So to cut a long story short, I became Orthodox and ended up coming to England. I was born in England, though raised in New Zealand, so it wasn't a problem settling here. And because I had been a sculptor before, I became Orthodox and actually started carving. And then my parish priest suggested I also start to learn to paint icons. And it all grew from there, really. I was able to go full time pretty soon, which allowed me to dedicate my whole life to iconography, which to me is a form of prayer as well. It's not just being an artist. I've always been interested in mission as well, about knowing God as well as I can, but also communicating that to others. And I noticed through the icon all sorts of doors open. Like I've given talks at the British Library and places like that where you could never be asked to talk about Christ, but you couldn't talk about icons apart from talking about Christ in the secular setup. So everything just fell into place very nicely. All these different parts, I mean, that had been a little bit separate, all just naturally found together."}
{"episode_id":"SW - #195 - 2021-11-05 - Aidan Hart - The Dance between Sacred and Secular","start":253.83,"end":263.83,"speaker":"Jonathan Pageau","text":"And you also, at the beginning of your work, you also spent several years on Malathos, living as a monk for several years. Maybe tell us a bit about how that fit into your work as well."}
{"episode_id":"SW - #195 - 2021-11-05 - Aidan Hart - The Dance between Sacred and Secular","start":264.47,"end":382.17,"speaker":"Aidan Hart","text":"That's right. I'd always been attracted to the monastic life, even before I became Orthodox. And my original intention was to join the monks in New Zealand as a novice. But while I was overseas, they suggested I travel overseas a bit before returning to them. Things changed for them. They had to move into the city to look after parish. So I stayed in England and there was a nun in the parish I was in. And so there were a lot of monastic services and I really wanted to join a monastery in the English speaking world. But at that stage the door wasn't open at Saint Sophroni's monastery. So I thought, well, Poppy, Athos is the only place. So I went to Greece to study modern Greek first. Bishop Kalistos, my spiritual father, suggested that I study the language first. So I was taking one step at a time and really intended to go to Athos slightly with a saddened heart, because I really wanted to be an English speake. So after studying for a year, I went to back to England to arrange my affairs and ended up staying with Father Barnabas, the Welsh monk, and joined him as a novice. So I spent with that three years and then I think he found it hard to have people with him. He wanted people, but being old and that, he found it hard. So the bishop said, well, it seems you've got to move on from there. And land was bought in England for me to be a hermit. But it was at that point my archbishop sent me to Mount Athos for training, not to stay there, but for training before settling as a hermit here. So I was there about, I don't know, just over a year and a half with my beloved abbot there, Father Vesalius, of him of entry, and then came back and lived as the hermit for about six years and every year went back for about a month to Veron Monastery, which was my monastery at Athos. So for six years I would say living as a hermit, but in fact, as I say jokingly to people, if you want to live a quiet life, don't be a hermit. People find out about these are hermit on the hill, let's go and visit them. So it's a pretty tiring and social life sometimes."}
{"episode_id":"SW - #195 - 2021-11-05 - Aidan Hart - The Dance between Sacred and Secular","start":383.85,"end":424.55,"speaker":"Jonathan Pageau","text":"One of the things you. Go ahead. Sorry, no, because I was trying to think about some of the things you talked about in terms of wanting to be in the English speaking world and I think this is something with really which really characterizes your work as an iconographer is a desire to both meld into the universal tradition, you could say the universal imagery of iconography, but also try to adapt it, to transform it or to connect it, let's say, to the place where you are, let's say the English speaking world, its own tradition and try to connect it. I think that's one of the most important aspects of your work and maybe tell people a little bit why you think that's important to do."}
{"episode_id":"SW - #195 - 2021-11-05 - Aidan Hart - The Dance between Sacred and Secular","start":424.92,"end":556.62,"speaker":"Aidan Hart","text":"Yes, thank you. It's true, right from the beginning I felt, well, Christ was incarnate on earth and not incarnate in the world in general, but the whole Christian life I think is an extension of an incarnation. So I'm British, I'm not from Greece. Greece has in many ways retained that icon tradition. But I feel my job as a Christian is not just to introduce Byzantium into Britain, but to introduce, resurrect the icon tradition of Britain. So I think it's both theological but also pastoral. I think people think that orthodoxy is an exotic import from Greece. It's not really reflecting life with Christ accurately. You know, life is with Christ, me, aid in heart as a personal experience. And I'm British, I'm not Greek, so I think theologically is really important. And also historically, it's always happened that the icon tradition has gradually expressed itself in a unique way. It always struck me how Russian, Russian churches initially were quite Byzantine. They had a rounded dome, but then gradually they developed the onion dome partially, perhaps practical reasons to shed the snow, but partially they felt that that expressed their experience of God more accurately than around the dome. They extended the drum, they did all sorts of things. It's identified the Orthodox, but it's Russian. You wouldn't get that in Byzantium. So fortunately in Britain we have a long tradition of early sacred art that is in the Orthodox sort of ethos. The Romanesque in particular, to my mind. So quite often, if it's appropriate, I've drawn on that. So for example, the church where my parish is, it's a 7th century, 8th century foundation. The church itself is about 13th, 14th century. So when I frescoed the east wall, I drew heavily on some illuminated manuscripts from what's called the Barry St Edmund Gospel. It wasn't, hopefully, pastiche, wasn't just a straight copy, but it was clearly influenced by that. So when people visit it, they realize actually this church is Orthodox, but it's also British. You know, the iconography reflects that."}
{"episode_id":"SW - #195 - 2021-11-05 - Aidan Hart - The Dance between Sacred and Secular","start":557.26,"end":585.74,"speaker":"Jonathan Pageau","text":"And what is your approach? Because I think this is my. One of my big concerns is to create something which is both traditional, completely traditional, completely soaking in the language that has been given to us, but also, like you said, not a pastiche or not something which is a nostalgic piece of art. And it seems difficult to find the line between the two. But I'm wondering if what is the approach that you have to be able to create something which is both traditional and authentic at the same time?"}
{"episode_id":"SW - #195 - 2021-11-05 - Aidan Hart - The Dance between Sacred and Secular","start":585.74,"end":659.1,"speaker":"Aidan Hart","text":"I think it's an enormous challenge. In some ways we can say that the icon tradition has revived after a time of decadence, if you like, both in Greece and Byzantium. But I think we're still incredibly immature as a sort of an Orthodox iconographic culture, that we don't really understand the timeless principles well enough to do this. Well, I think people like yourself and the Orthodox Arts Journal are exactly on the right track and we know what you're trying to do, but I think it's going to take a few decades for us to really understand those timeless principles. So as you say, we're living within the tradition, we're adopting a pastiche we're doing something that's authentic. But to do that, we need to not only just know in our heads those timeless principles and therefore what can be changed, adapted, but we've got to be in it. So I think I feel myself. I'm still learning a second language. It's not my first language, so though I'm happy with some of the things I've done, I'm so aware that I'm speaking a second language. So I think the first thing is just to be intelligent, you know, not to be scared, not to think, oh, yeah, I've got to copy something from Moscow, 15th century iconography. If I do anything else, I might get. Or decadent."}
{"episode_id":"SW - #195 - 2021-11-05 - Aidan Hart - The Dance between Sacred and Secular","start":659.1,"end":661.14,"speaker":"Jonathan Pageau","text":"Yeah. For the rest of my life, I'll copy these."}
{"episode_id":"SW - #195 - 2021-11-05 - Aidan Hart - The Dance between Sacred and Secular","start":661.14,"end":719.24,"speaker":"Aidan Hart","text":"I'm Odin Hogg and do my own thing. You know, that's the other extreme. But both extremes, I think, are extremes. So I think it needs a lot of intelligence to sort of think, well, you know, actually, what is the central. And what can I draw from my own culture? That is, I was talking to one of my students yesterday who's from Norway and her husband's an Orthodox priest, and Hannah is thinking of doing a doctorate on how to develop, say, an icon screen appropriate for Norway, drawn on the Norwegian folk tradition. They have amazing folk patterns. They paint on the wooden churches and I've got the stave churches. The stave church, as it stands, probably doesn't express the Orthodox liturgy well enough, but one can start with that and then adapt it. So I think more and more people thinking like this, we're fully in the tradition, but lovely culture, feel that a lot needs to be redeemed and completed and show that Christ is in now in Norway or Bristol or Canada or the us."}
{"episode_id":"SW - #195 - 2021-11-05 - Aidan Hart - The Dance between Sacred and Secular","start":719.48,"end":854.83,"speaker":"Jonathan Pageau","text":"Yeah. And I think this is what you said is very important because we have a tendency to have a kind of duality, which is, on the one hand, we find people who are really attached to their culture almost in a nationalistic sense, and they feel like this is the thing they need to grab onto in order to survive in this chaotic world. So we have this extreme, and then the other extreme we find are people who want to deny all particularities and see it as suspicious, see it as idolatrous and everything. And it seems like this breathing in and breathing out, let's say, between how God is the source of our identity, but that we have to be careful not to be attached to these secondary identities, but see them through the lens of Christ, let's say. And that's when they actually take their Full color. That's when their true colors appear and their true value appears is when they're submitted to something higher, submitted to something which is beyond it. And I know you've had some insights into that, let's say, in terms of iconography. And so I'm sorry, I'm a bit selfish because I'm asking this in a way just for me, there is a temptation also. This is a temptation that I have. I don't know if it's a temptation or if it's a. If it's an appropriate desire. Because we live in a world where we have all these images. We can go online, we can find images from the Catacombs to Russia to Greece and everything. It's difficult not to have this mosaic in the back of our minds as we work. For myself also living in America, where we have this strange collage of culture. I'm French, my first language is French, but I live in Canada and you know, I live in America with all this English speaking world. And so there's also, in me, at least there's a desire to create something which is synthetic is the only way to say it, which is particular but also draws not only from, let's say I would draw from the French Romanesque or from. But also kind of pulling in little threads from the Scandinavian world, you know, from. Even from Coptic icons and pulling them together to create something which is moving towards synthesis. So I don't know if there's something of that that you find that. If you find it's a dangerous way of working or if you think that it has some value."}
{"episode_id":"SW - #195 - 2021-11-05 - Aidan Hart - The Dance between Sacred and Secular","start":855.23,"end":978.92,"speaker":"Aidan Hart","text":"That's a really good, very important point you're making, Jonathan, because as with most things, a strength is a potential weakness. But the fact is we do live in a world where all these different icon styles, traditions are available and even impinge themselves on us, whether or not we like exposed to all these things. So it's a fact. We can't pretend that it's not a fact. So I think we've got to be real and think, well, this is going to affect us and that's a good thing. So the next question is how to make it authentic, you know, how to have it come within a living experience, from within a living experience, rather than just be gluing together arbitrarily how to do that. I really think ultimately it's only living the life of Christ and the church. So you've got that sort of music, we have that music of heaven in us. And it's only why we're making all these millions of decisions. When you're carving something, painting something, designing it, every little choice we make, it's got to consciously or unconsciously be decided against that music within us, that experience of the life of Christ. And if it jars with that in a music, I think, no, I'll leave that aside. But if it corresponds with that, then we can use that element of Norway or Egypt, whatever. I don't think there's any formula we can use. And I think it's just living that life in the community of the church, living a life of prayer. Because in the end, liturgical arts got to support worship and awe and thankfulness and joy and humility and compunction. And as we experience that ourselves, we'll make the wrong decisions. So I think, in summary, we do live in this postmodern age. We're exposed to all these things, and I think it's only natural whether or not we do it consciously, unconsciously, that what we make is going to be affected by that. But we've got to measure it against that experience of prayer. Does it support it? Does it support the right virtues, or does it make us noisy inside and confuse us?"}
{"episode_id":"SW - #195 - 2021-11-05 - Aidan Hart - The Dance between Sacred and Secular","start":979.8,"end":1030.09,"speaker":"Jonathan Pageau","text":"And, I mean, that brings me also to another thing that I've at least experienced in myself as I'm working, because there is also a desire to be, you know, let's say. How can I say this? There's a desire to impress in the sense that we want. Like, I want to make the best image possible. And I'm always on a line between, you know, making something which is amazing so that I can impress others, and then saying to myself that I'm doing it for the glory of God, but it's not always true. Right. Sometimes I just know that if I do it this way, it's going to be impressive. And so, for me, at least, you know, in light of what you said, I think I struggle with that quite a bit as well, trying to find the balance between being technically proficient and having something which kind of embodies this music or this kind of living music that you talk about."}
{"episode_id":"SW - #195 - 2021-11-05 - Aidan Hart - The Dance between Sacred and Secular","start":1031.13,"end":1157.81,"speaker":"Aidan Hart","text":"Yes. And this is one thing that Father Vesalius, the Abbot of Averon, taught me. He had this lovely term. There's a perfect imperfection and an imperfect perfection. So. And there was a wonderful exhibition of Byzantine icons that came to the Royal Academy in England a while back. And in the very last room, there are quite a few icons from Sinai festival. Icons. I remember in particular from about the 12th century. What struck me is how free and messy they were. And at the same Time incredibly beautiful. And you get the impression that the person who painted was like a prophet and the word of God was in his soul and burning in his soul, and he just had to get it out. He wasn't too bothered about, you know, putting every toe nail in and that it was done with great skill, exquisite skill. But they weren't bothered about the little details. The buildings were a bit wonky, but you felt the spirit come through. Whereas I've seen a lot of icons that are made with consummate skill, but somehow the skill encrusted the spirit didn't embellish the spirit. So you notice the skill first and not the spirit. So I'm very interested in the approach of the Japanese traditional Chinese painters. And I've done a few articles on elements of the philosophy their painting, especially from a book called the Mustard Seed Garden Book of Painting. And one thing they say there is the different stages. First is to gain great skill, consummate skill. And the top, though, is to discard skill and just express the lie that the inner essence of things, of course, the skill comes through. But it's like your first language, so you don't have to think about grammar because it's part of you. So I think a lot of us, I mean, a lot of people around who don't even have the skill, they're just really badly painted icons. Then you get the next level. Highly skilled, but you're weighed down by that skill. The highest level, like Theophon the Greek, is frescoes. Here's a prophet speaking the word of the Lord burns out. It's a burning bush you're looking at, not a topiary bush, all nice and clipped. So it's that fire we're trying to communicate."}
{"episode_id":"SW - #195 - 2021-11-05 - Aidan Hart - The Dance between Sacred and Secular","start":1159.41,"end":1227.86,"speaker":"Jonathan Pageau","text":"Yeah. And you see, I think, you know, there are some artists right now, like, that seem to have kind of this internal. I'm thinking of Cordius, of course, but Cordis, who has internalized the language so much that, like you said, it's not. He's not in the second language anymore. It's not something he's learning. It's become his own inner grammar. And so when he's working, there's both kind of this deep tradition of the church, and there's also an idiosyncratic aspect to it, which is just him just doing it. And when you watch him draw something and he just goes right in and there's no sketch and there's no measuring, and it just goes straight. And there is something about this Chinese approach where, you know, once the skill has been mastered, and centered. Then there's almost a letting loose, or. Yeah, there's a capacity to just do without thinking, without planning. And you almost. It's almost. It's Sunday. There's something theological about this idea, too, that. That. The idea of will or freedom. We tend to think of it as deliberating. But if you're truly in this music, you know, truly in this kind of. This song that you have inside of you, there is no deliberation. There's just a straightforward manifestation, let's say, of these higher things."}
{"episode_id":"SW - #195 - 2021-11-05 - Aidan Hart - The Dance between Sacred and Secular","start":1228.5,"end":1340.01,"speaker":"Aidan Hart","text":"I think there is that. But at the same time, there must always be sobriety. And you must be listening more than speaking artistically, because I've had the blessing of knowing some saints. Saint Paisius, a bit Father Paphilius, a bit Saint Siloan, Saint Sophronia rather. And I noticed they wouldn't always answer immediately. You felt that there are tons of things they could say, all of which would be true technically, but they would listen and then speak. And it was just precise. It was just the right thing that was said. So I think you can get highly expressive biographers, but to me, it's too expressive. There's a story about some highly educated people looking at a painting on the wall. I think it was an icon, but I don't know what icon it was. But they were to say how live it was and how wonderful it was. Then a peasant lady was overhearing this, and she said at the. I couldn't help overhearing your conversation. And may I say something? She. Of course, she said, I don't think this is a good icon because it's too alive. In other words, it was too noisy. It's too much full of itself. It's like a charismatic person that swamps everyone else. And. Oh, I would have. Charismatic person, but it's just that person. No one else is in the room. So that was interesting. There wasn't that quietness. So I think that's the amazing thing. Like Theophane the Greek, you know, he could be highly expressive in his frescoes, but then you look at his panel paintings and he's really quite gentle and quite highly worked there, and he knows how to be appropriate in each situation. So I think it's. It's really. It's sometimes difficult to get the balance. But, yeah, there is this expressiveness, but it should be quietness as well. Yeah. So you're not aware of all that. Artists are so free. You know, you're not talking about the art rather than the saints. You know, I want people to Forget my icons. And if you're talking about the same type of picture, you know, that's the important thing. That's when you know it's work."}
{"episode_id":"SW - #195 - 2021-11-05 - Aidan Hart - The Dance between Sacred and Secular","start":1340.68,"end":1378.74,"speaker":"Jonathan Pageau","text":"No, I totally agree. I had the chance of having my first experience as a commission. My bishop asked me to make a panagia for him. And that was the first time I was getting a commission. I had no idea how to make miniatures. I was just thrown into this. And so I found someone, a Serbian carver that I had exchanged with. And he guided me through making this little thing. And I was so obsessed with the technical part of it, trying to get it right, trying to, you know, to have it, you know. And he was Serbian, this iconographer, George Bilak. So he was ruthless with me. He was just ruthless. He kept insulting me as I was making the icon."}
{"episode_id":"SW - #195 - 2021-11-05 - Aidan Hart - The Dance between Sacred and Secular","start":1378.74,"end":1379.46,"speaker":"Aidan Hart","text":"It was wonderful."}
{"episode_id":"SW - #195 - 2021-11-05 - Aidan Hart - The Dance between Sacred and Secular","start":1379.78,"end":1470.84,"speaker":"Jonathan Pageau","text":"And so I worked on this. I made this thing, and I brought it to my bishop, and all I was thinking about was if I had done it properly. And he took it, he unwrapped the little icon, and when he saw it, he crossed himself and he bowed. And then I was just. I was floored. And I realized, okay, this has very little to do with me. Like, you know, I am a vehicle for something much bigger. And that's when I knew I wanted to be an iconographer. Because I thought, you know, Picasso will sell his work for millions and millions of dollars, but no one will kiss his icons, no one will kiss his paintings, no one will venerate them. And the only thing I have to give up is the credit for that to happen. And I was like, okay, I'm willing to do that and just be. Hopefully be as much as I can, a vehicle for. For the saints that are being represented. But, yeah, that was my first experience as a commission. And so I wanted to shift a little bit and talk a bit about culture, because many of the people watching this are people who are just interested in culture, where it's going. One of the things that we have in common and that I've seen in your writing and in your work is a desire to not want to completely oppose the world of sacred art and the world of secular art, of secular culture, but rather see them as, let's say, the sacred, as the source of the secular, and the sacred as something which can feed into other arts and become, you know, like a light for culture. And maybe. I know people would love to hear you talk about that a little bit."}
{"episode_id":"SW - #195 - 2021-11-05 - Aidan Hart - The Dance between Sacred and Secular","start":1471,"end":1686.71,"speaker":"Aidan Hart","text":"Yes, it's interesting. When I was a sculptor in New Zealand, before I became Orthodox, I was looking for art that helped express this sense of otherness. I just wanted people not to see a face. Less interested in faces primarily, but as we were the spirit behind the face. And Bamkusi, funny enough, as I was into quite sort of naturalistic sculpture, Vancouver really seemed to me very profound. And I realized gradually that behind the incredibly refined word was actually the Orthodox licitian. He was actually a charger in the Orthodox choir. He's Romanian and sort of rose out of the Romanian culture. And then you look at his Indus columns. All these things were actually rooted in liturgical culture. The Indus column was inspired by indus columns, which were over gravestones in memory of people. That's like the soul ascended to heaven. And the other thing that got me on this track was the vision of Ezekiel, where he has a vision of a temple and an angel is showing him around. And then from underneath the altar of the temple runs a river. And wherever the river goes, it brings life. So I thought, well, the worship of the church, the whole liturgical symphony, if you like, is the source. And then it's not a fountain that goes up in the church and comes down again. It's a river that flows out into the world. And wherever it goes, it brings light. So I thought, well, if a culture is falling apart, it's because its worship is blocked. You know, there's no river flowing out. And so going back to Bencusi, a lot of his aphorisms are to do with this. He said, my studio in Paris is just an extension of the monastery. And he names the monastery of his village in Romania. He talks about simplicity and complexity resolved. All these wonderful pearls of wisdom sort of come out of the whole Orthodox culture. So I think a lot of scholars are beginning to realize that early 20th century modernism, abstractionism, actually had a religious inspiration. And you look at Kandinsky again, actually, he was Russian. A lot of his insight is from Orthodoxy. For him, abstraction wasn't to depart from reality. We tend to think of abstraction as departure from reality. Fermit was to distill the essence, to abstract, to draw out the essence of something and depict it visually. And this is just what an icon does. You know, you're indicating the fiber, God within. And then, of course, Bamcusi was the father of modern abstract art, Kandinsky the father of modern abstract painting. And these came out of religious roots. Then all that was forgotten. And I'll be just sort of play around with this abstraction. They'd actually forget what they're trying to do. Whether one likes their art, that's what they're trying to do to abstract and reveal the invisible. So I think the Turk to call art. Unfortunately, there are a lot of zealot Orthodox who sort of write off in Yadarak, but I think healthy art in the world that isn't liturgical but feeds the soul, like Dostoevsky's writing, I think of his in this category. I've dubbed this threshold art. It can help to bring us to the threshold of the Church. In fact, the man who baptized me, Father Ambrose in New Zealand, he came to Christ through Dostoevsky. He was studying Russian literature, so he sort of wasn't ready to go into the church in the fullness, but he touched the hem of Christ's garment by reading Dostoevsky and then went further and then looked up and there was Christ looking at him."}
{"episode_id":"SW - #195 - 2021-11-05 - Aidan Hart - The Dance between Sacred and Secular","start":1687.67,"end":1720.36,"speaker":"Jonathan Pageau","text":"And so how. I'm curious to see, because I think a lot of people will see that in principle, let's say, will see that in principle. And so are there ways that you're seeing this happen today? Are there some places or some areas, some art or some literature that you feel that you're. Or ways in which iconographers are able to maybe help or feed into this? Because I know a lot of people have that desire. And we see it like Dostoevsky is, of course, an example, but very few of us are Dostoevsky, sadly. Do you see places in the world where this connection can happen?"}
{"episode_id":"SW - #195 - 2021-11-05 - Aidan Hart - The Dance between Sacred and Secular","start":1721.72,"end":1858.92,"speaker":"Aidan Hart","text":"Good question. I don't know about places, but it's more international communities, like, I think Orthodox Arts Journal is really important because it's trying to work toward a fresh, authentic understanding of tradition. But it's not exclusive in the sense that it has this sort of openness to liturgical art being a leaven to inspire healthy secular art in the positive sense of the word, worldwide. What I might call gallery art or threshold art. So I think it's not so much places, it's sort of places of culture, of thinking, of a way of thinking in the individuals who can be inspiring. There's a thing called the Orthodox Arts Festival, which just went online briefly. And so they've got a category for iconography, a category for also just writing, you know. So I think there are some writers there who are doing short stories. So I think there are online experimental bodies, as it were, for people to try things out and get honest feedback from other people, as all throughout our student has been. You know, there's openness for genuine, professional, caring response to people. So you can. Iron sharpens iron, as it were. I've always had the Long term dream of a liturgical art center where you're training people in liturgical art. But also we have conferences and meetings for those who feel perhaps they're not called to be liturgical artists, but perhaps they're composers like John Taverner. I knew Sir John Tavener very well. He wasn't really good at liturgical music on the whole. Sometimes he got it right, but his role was actually to be in the world. And as it would be like a horse of Troy, sort of smuggle the sacred and the profound into the world. So that's been my sort of dream. I don't think it'll happen in my own lifetime. I've worked with Prince Charles a bit and trying to have something happen and my liturgical art, three year part time course as part of that. But I just love to have a center where there's that buzz where people can come and share ideas, bit like the French Cafe was during the 20th century, where they'd discuss ideas. But a center where there is a church where there are different serious liturgical art training programs, apprenticeships. But also we have artists who are not just Orthodox, but Christians who feel that their role is in the world."}
{"episode_id":"SW - #195 - 2021-11-05 - Aidan Hart - The Dance between Sacred and Secular","start":1859.88,"end":1957.85,"speaker":"Jonathan Pageau","text":"I think this idea has been buzzing around now for 10 years, you know, and I think that it's slowly starting to show fruits in the U.S. andrew Gould is also working on something similar. The Antiochians here have these ideas. And so I. I think we just need to be patient and slowly work towards something like that happening. People have also talked about here. People talk a lot about Terrence Malick as a place also where this type of. Where there's, with his recent movie Hidden Life, where you really get this desire to create, I don't know, to visually show in a movie a Christian experience. So I think that there are definitely places where, where this is happening now. I guess I'm going to turn the tables a little bit and ask you. There's also a very experimental iconography going on right now. And so on the one hand we have this sense that liturgical art and the power of our traditions can infuse popular culture. But there's also the things happening both ways. And so I obviously, I don't want to name iconographers. It's important to. I want to avoid polemics, but I've seen a lot of icons that present themselves as icons, but go very far in integrating either modernist or even postmodern aesthetics. Effect, I would call it something like that. And so do you feel like sometimes that can also go too far or do you see it as sometimes I see it as a laboratory like this, bubbling on the edges. And it's not going to continue. It's just going to be idiosyncratic. But a little bit of it will enter into a tradition and follow the kind of enter into the stream. But I don't know if you have some perceptions about that type of work happening."}
{"episode_id":"SW - #195 - 2021-11-05 - Aidan Hart - The Dance between Sacred and Secular","start":1958.33,"end":2041.05,"speaker":"Aidan Hart","text":"Yeah, it's a very important point you raise, Jonathan. I think the two sides to it. I think there needs to be a certain freedom and fearlessness and experimenting. It depends partially on what spirit that experimenting has done. Is it to show off my ego, or am I genuinely trying to make liturgical art, iconography, composing whatever it is that helps people get closer to Christ, but because I wanted to be authentic, you know, I've got to try some different things. So that's. That's fine. I think life in Christ shouldn't be dominated by fear. And you throw these things out there and they're not quite right. They'll just die a natural death. So I think there is a path for certain, a place of certain experimentation. On the other hand, I think you get to a certain point, we experimenting with things that you're playing with fire, you know, experiment as an artist, but don't put it in front of people saying, no, you try to play with this, you know. So I think, I think some iconography there, I just think it's just too. It's great. I appreciate it as art, but don't pretend it's an icon. I think it's just going a bit too far. So I think on the one hand, you have people who say iconography is not art, it is art. It's much more than art, but it's at least art. In other words, it should have a beauty or harmony, but then some. This contemporary iconography, I think is just getting a bit too arty, as lovely as art. You can't. It can't be taken on a case by case basis, I think."}
{"episode_id":"SW - #195 - 2021-11-05 - Aidan Hart - The Dance between Sacred and Secular","start":2042.17,"end":2120.74,"speaker":"Jonathan Pageau","text":"And so one of the things that I think is happening, and this is difficult because, you know, we have a sense, the modern man has a feeling. You could call it, you know, the shock of the new or the effect of novelty. And that the effect of novelty has a surprising element. Like when you see it, it surprises you and it creates a certain. A certain sense that. A certain sense of wonder you could call it. And to be fair to it. And so I think that what I'm seeing in a lot of the more experimental iconography, there's a danger to confuse, let's say this deeper encounter that you talked about, the stillness of encounter with the icon, to confuse the experience of shock of the new and this kind of surprise, because there's an elation in that surprise. And it makes you want to, in the online world, especially, because you want to get attention. And so people will share an image of an icon which is slightly askew because it'll be able to get people's attention quickly as they're scrolling down their Facebook feed. And so to me, I see that there is a little bit of a danger to confuse the experience of novelty with the deeper encounter with the sacred. I don't know what you think of that."}
{"episode_id":"SW - #195 - 2021-11-05 - Aidan Hart - The Dance between Sacred and Secular","start":2120.74,"end":2188.2,"speaker":"Aidan Hart","text":"I think if we look at nature, things adapt by very slow increments. You know, if the environment changes, you'll find that nature begins to adapt slowly, bit by bit. You know, there's a mutation. Most mutations are not useful, but the odd one is useful really to get something. There's a bird suddenly grow four wings. So I think in our time, we need to move toward a more authentic Western iconography by small increments. That's how I approach it. I'm not a particularly great painter myself. I've got to move very slowly and gradually. Gradually I adapt. There are some people far better than I. You can move more quickly, but it's just my insufficiency that I just want increments. And I think some of the works, as you suggest, are just a bit too shocking, really. They're just jumping too far ahead of themselves as well. But on the other hand, I think just to do mind just copying, it might appear safer, but I think it's a bit dangerous because basically we're saying life of Christ is. Well, it's like the man who buried his talent. He buried. It was. He was afraid."}
{"episode_id":"SW - #195 - 2021-11-05 - Aidan Hart - The Dance between Sacred and Secular","start":2188.52,"end":2189.08,"speaker":"Jonathan Pageau","text":"Exactly."}
{"episode_id":"SW - #195 - 2021-11-05 - Aidan Hart - The Dance between Sacred and Secular","start":2189.08,"end":2212.75,"speaker":"Aidan Hart","text":"And took risk. They invested their two talents, five talents. They took a risk. It might have failed, but they thought, well, my master trusts me with this money, so he must believe in me. So I'm going to take a risk and invest it and hopefully it will increase. And it did. But the one who only had one, he was afraid and he buried it and he was told off. So I think just mindless copying is actually acting out of fear."}
{"episode_id":"SW - #195 - 2021-11-05 - Aidan Hart - The Dance between Sacred and Secular","start":2213.31,"end":2261.21,"speaker":"Jonathan Pageau","text":"And it's fascinating because we talked about the world of technology as creating this mosaic of images and this constant novelty and this constant change that it's difficult for it not to attract us. But the same technology is what is making it possible for people to just slavishly copy, you know, 16th century Russian art, because we have these high resolution pictures that people can have in front of them as they're working. You know, the ancient medieval artists couldn't stand there in front of these amazing images and just copy them, you know, to the letter. They had to draw them from afar and then bring them into the studio. And, you know, and so this was. That would create just a natural transformation without a desire to be in, to create innovation. It would just happen on its own. Because you can't completely remember the thing you saw in the cathedral."}
{"episode_id":"SW - #195 - 2021-11-05 - Aidan Hart - The Dance between Sacred and Secular","start":2261.21,"end":2279.81,"speaker":"Aidan Hart","text":"Right, exactly. Yeah. That internalized it. They saw it for half an hour, then three months later they'd get back home and paint it. So they'd have to internalize that image. And of course that would mean that they were translating. And I'd done some translating from Greek into English. And it's quite a creative act. You know, you're translating a content rather than a word."}
{"episode_id":"SW - #195 - 2021-11-05 - Aidan Hart - The Dance between Sacred and Secular","start":2281.65,"end":2338.58,"speaker":"Jonathan Pageau","text":"And so one of the things that you've also been known for, I think that, you know, we talk about you as an iconographer, as an icon cover, but you, your work spans much more than that. You've designed churches, you designed liturgical objects. You're really more a liturgical designer. And so I'd like to know a little bit about how you see this coming together, because there's something different about, let's say designing a reliquary or designing a church and the icon itself. And so maybe you can speak a little bit to how these different languages come together in, in the experience of Orthodoxy in like as a European, like as an English person, you know, to be able to create these spaces that are, you know, you've created iconostasis with icons on them. And I've seen you done everything from a bishop staff to, you know, to reliquaries. How do you decide or how do you kind of pull in your different influences when you are creating things?"}
{"episode_id":"SW - #195 - 2021-11-05 - Aidan Hart - The Dance between Sacred and Secular","start":2341.03,"end":2564.64,"speaker":"Aidan Hart","text":"I suppose I start with place first. You know, where is this place? I've done work for a church in Madrid and another in Amsterdam. So for example, the stone icon screen I made for the Church of St Nicholas in Amsterdam, there are a lot of different cultures there. So in the roughly 1 meter by 1 meter, 3 foot by 3 foot stone plaques underneath the icons, I made designs that reflected the different cultures there. It's Anglo Saxon. There was something more from the Netherlands, something that was Russian, something that was Greek. So I start with the actual place. I think place is important. You know, the gods and kind are in that place. And the fire of the burning bush is in that particular bush. You know, it wasn't a bush brought in from England that Moses saw, it was an Egyptian bush that was burning. So I research the art of that culture and I suppose this is discernment where discernment is required. You know, what is usable in that culture, what isn't A slight deviation, but it does express what I'm saying, that St Nicholas of Japan, to my mind, is the great. One of the great missionaries. Because for seven years he just studied Japanese culture and he really gained a lot of respect for it. So after about seven years, he began to speak to people about the faith. And then when Japanese converted, they realized that they're actually converting to Christ, not to being a Russian, he was able to embed the faith in Japan. So. But all that required quite a bit of research and an appreciation of the Japanese culture. So that's the first thing research, really. And secondly, this object, it might be relic or whatever. I realize it can be part of a larger symphony and it's got to work with that symphony. And I think this is why I've got involved in so many different media that I feel I'm here to serve the church, serve Christ in the worship. And that requires a certain unity of worship. And I think we've suffered too much from this iconographer. Then put an icon painting on the wall and you get another person from another place to do the icon screen. It doesn't fit, but you know, he's Romanian, so do a Romanian one or whatever. He's Greeks, he'll do a Greek screen. So get this incredible mishmash. And this upsets me, you know, I feel there's no. Just aesthetically, you know, I just feel there's no attempt to make the uniform or a beautiful thing that dances together. You know, everyone's just jamming, doing their own thing. It's cacophony. So I think it's out of that that has felt compelled to try to respond to the need and get involved in different media. I'm actually going to be working on a novel soon, partially out of the desire to create a church. I probably would never be able to design and make a whole church. So in this novel, it's all about this process of this man who's. Whose uncle is called into the reading of his will. And the uncle was a very wealthy man and he made a vow to God to build church, but he's got cancer. He knows he's not going to have time to build it. So in his will he says to his nephew, I'm giving all my wealth to you, as long as you build a church, this church for this monastery, and then you can have the rest of the money. And the whole novel goes on about the process of him and other people changing and the process of not just building the building, but. But decorating it inside. So, yeah, I suppose the basis of it is that you're not just creating an individual liturgical art object, but you're creating a symphony. And that symphony, it's an improvisation in the sense that God just doesn't drop from him in a complete score. And Jordan was just a player. He sets a sort of theme, and you improvise on that. So improvisation is unique. You're going to improvise in Canada in a different way. But we're seeing this from the same sort of. Not tomb, but the same theme that Christ has given to us both."}
{"episode_id":"SW - #195 - 2021-11-05 - Aidan Hart - The Dance between Sacred and Secular","start":2564.96,"end":2673.3,"speaker":"Jonathan Pageau","text":"Yeah, there's definitely. I love the images you use. I think that really, theme and variation is exactly the way to see it, you know, and that there is this. There has always been. Because we're so polar in the way we think, you know, we tend to think of tradition as something which is completely solid and completely fixed. And then we have the idea of the modern world which is idiosyncratic and improvisational. But when you look at, like you said, the great iconographers, you see this strange play between the messiness and, you know, and a desire to be in tune with the inner music, let's say, or the hidden music. One of the biggest difficulties, I think one of the biggest questions. This is a very practical question, but it's not. There's also something theological in the question, let's say, is that many of us, like example of the parish where I am, you know, the parish where we are, we are renting from a Catholic church. And so we have this space which is a 1960s Catholic Church. You can imagine, you know, what that means. And we're taking over from a Romanian church that was there before, and, you know, for all my love of them and respect of them, they put up an iconostasis which is as if like an extraterrestrial ship had come down. You know, it's baroque, it's highly ornamented, and it's spray painted, and it has, you know, all of that. And so what is your advice to people who are in spaces which are not liturgically conducive in the outset? How can you. What kind of advice do you have for people who are in spaces that are ugly or that look like strip malls or, you know, how is it that you can without, like I said, without creating this strange disjunct, you know, how can we adapt our work to these kinds of spaces? Sorry for the hard question."}
{"episode_id":"SW - #195 - 2021-11-05 - Aidan Hart - The Dance between Sacred and Secular","start":2675.54,"end":2823.76,"speaker":"Aidan Hart","text":"I think these places gotta be taken in the same mirror. And sometimes it's damaged limitation, probably more often than not as daring to limitation. It's probably impossible to make something really beautiful. But I think the first principle is be appropriate to space, you know, don't force it to be something that it isn't. There's one parish I know where they bought a Methodist church which is just a rectangle, really. No, I think they should have treated that a bit like a basilica, you know. But what they did was they created inside a four column dome church, had a plasterboard, you know, and once you, if you're blindfolded and walk in, oh, it's really nice, you go outside. Well, that's rather weird. So I think that that was being dishonest to what was there. It would have been better to think, okay, this is like a basilica, just basically a rectangle. Let's work with that. So I think authenticity. So if it is just a 1960s white walled geometrical thing or circle, whatever it is, well, let's make the best of that. It's a limitation. But let's make the limitation our strength. I think that's the first thing to listen. I think often we don't listen enough to the space. We just jump in and do what we saw done in Greece or Romania. So I think listen a lot, just worship in a place, look at it and think, okay, well, what can this place teach me? What are its strengths, its weaknesses? How can I capitalize? Just be one string? How can I capitalize on that beyond that? I think that's all I can say at the moment. You've got to take each place as it goes. Sometimes you can put it in reverse and take things out. That can be pastoral challenge because we've always had that and Joe Bloggs gave it to us and it'd be an insulting to take it out. So that's the job of the priest really, to really gradually educate the priest. The icon skin I made for Amsterdam, the priest is brilliant there. He. I think a lot of the Russians are expecting a high Russian screen. So about a year before we did the work, he had in the back and had talks and all that about the history of the icon screen. And he had this display in the back with photographs. So gradually people realized actually the Russian icon screen with five toys was actually quite a late thing. So in fact Having this one layered screen is actually quite traditional. So there's often a lot of education that is needed, patient education into history more often than not. Not just theology, but history. How's church in the past dealt with us? So education and humility and listening, I think are things that can all help."}
{"episode_id":"SW - #195 - 2021-11-05 - Aidan Hart - The Dance between Sacred and Secular","start":2824,"end":2896.12,"speaker":"Jonathan Pageau","text":"Yeah. Yeah. Well, thank you. Because I think this is, at least in America, it's definitely a struggle that many parishes have because, you know, we end up in these very odd spaces and the temptation to create, you know, for example, like you said, to have a flat ceiling, but then put a sticker of Christ Pantocrator, you know, on the ceiling. Even. Sometimes it's even a low. It's not very high. You know, it's not that high. It's like 12ft high. But there's this, there's this, you know, instead of really kind of. But it's hard because the space is ugly. So when you say, listen, it's difficult. We don't want to, you know, because we, we actually don't have a lot of love for the space. But I see what you're saying, really, even in a way, maybe the way to approach popular culture in general or modern culture, which is that in order. This is something that. I think that in order for something to exist, there has to be at least some seat. There has to be. There has to be some seed which is making it exist. And so if we're patient and attentive and we watch, we can find these little, these little, these little sparks. Sometimes they're very small and sometimes they're very hard to find, but they kind of have to be there or else we wouldn't even be able to perceive it."}
{"episode_id":"SW - #195 - 2021-11-05 - Aidan Hart - The Dance between Sacred and Secular","start":2896.36,"end":3021.66,"speaker":"Aidan Hart","text":"But I think sometimes we've got to acknowledge that one generation is not beyond salvation, but you're not going to find much good in that. So you've got to think ahead. What about the next generation? So what I'm talking ahead is future purpose built orthodox architecture. And at the moment, most of the Orthodox churches I've seen in America just don't work. You know, they put, oh, Orthodox church got a dome. They put a dome on. They've got arches, let's have arches. But generally we don't understand at all what you're doing acoustically. For example, when I was doing work in Houston, Texas, I was talking to a priest there about domes and he said not one purpose built Orthodox church ever been to in this country which has good acoustics, you know, and he said, we don't. Out of our hubris, we haven't really studied Byzantine churches properly, but I did read a very good article by an Orthodox man who's acoustic engineer for NASA. He knows his stuff. And this article was outlining some principles of good acoustics. And often they're surprising. You know, right angles is not a good thing. Flat floors isn't a good thing. I think one of the reasons why we're finding it difficult to make successful contemporary architecture is the materials we use. Unfortunately, concrete is here to stay, but with stone, you've got to have an arch. If you want to have a roof that's out of stone, you've got to have an arch. So all these shapes arose out of the weakness of the materials and the natural, and they work well. But concrete doesn't necessarily need an arch. Sometimes you do. But we've got this material, reinforced concrete, that's really strong. It doesn't have many limitations, but we pretend that it's something that it isn't. So I think we need to think ahead and figure out, well, what are the principles of good orthodox architecture? What can be changed? What makes most old Orthodox architecture work consistently? So we need to be thinking one or two generations ahead, really get serious about this. Orthodox churches, and Orthodox has got a dome on top. And I think we really need to look into this and do some serious thinking. And, yeah, we're lucky working here."}
{"episode_id":"SW - #195 - 2021-11-05 - Aidan Hart - The Dance between Sacred and Secular","start":3022.3,"end":3088.6,"speaker":"Jonathan Pageau","text":"Even in terms of culture, I think what you're saying is true. That is, there's. You know, there's something. This is one of the reasons why we started the Orthodox Arts Journal at the outset, is that we realized that it was the seminarians that we had to talk to in a way, that we wanted to create something, a vehicle to show beauty, to show adaptation, to show all these things. And our target was not so much the older priests would thank God if they can hear it, but it was really to affect the seminarian so that, you know, and we're seeing it now. You know, Andrew Gould, if 10 years ago, you know, with the balance of his work, he was struggling to get liturgical commissions. Now he gets them, he has to refuse them, you know, and so you can see that the transformation is slowly happening. Of course, it's not complete. There's still a lot of work to do. But we can see the. The fruits of the seeds that we planted and that you planted 10 years ago, 15 years ago are starting to appear in the culture. And so I think there's a lot to be grateful for that."}
{"episode_id":"SW - #195 - 2021-11-05 - Aidan Hart - The Dance between Sacred and Secular","start":3089,"end":3178.07,"speaker":"Aidan Hart","text":"Yes. I was approached by the chancellor of Chichester Cathedral, a major cathedral in the south of England to help them start a liturgical arts centre. So I said, that's fine. I myself can't do a lot with the practical training of liturgical artists. It wasn't just icons, the whole thing, that my two apprentices, they can go down and be the corporate core of the practical training. But I said, I don't want us just to look at training the liturgical artists, but I want to look at training future priests, or ideally also contemporary priests. But most of them already set in their ways because the commissioners need to be educated. I said, as much as the makers of liturgical art, because a lot of them don't realize the importance of good liturgical art. They think liturgical art is just getting a painter to paint something that's of a sacred subject. But it's how it's done which affects the soul as much as what is done. Like you can't, you know, sing the psalms to rock music and liturgy. It might be great rock music, but it doesn't help prayer, same words, but have the same words to Byzantine Gregorian chant have a different effect on the soul. So you've got to train the commissioners, which is basically the priest. And I think they've got to go hand in hand. I'm just astounded that Orthodox priests and Anglican and Catholic are all talking the same thing, that their seminarian training doesn't have any compulsory training in liturgical art or liturgical beauty. I thought, you know, what converted Russia. You know."}
{"episode_id":"SW - #195 - 2021-11-05 - Aidan Hart - The Dance between Sacred and Secular","start":3178.23,"end":3179.43,"speaker":"Jonathan Pageau","text":"That's right, exactly."}
{"episode_id":"SW - #195 - 2021-11-05 - Aidan Hart - The Dance between Sacred and Secular","start":3179.51,"end":3195.06,"speaker":"Aidan Hart","text":"First of all, to Orthodoxy, normally some aspect of the beauty of it, that's the fragrance. Then they find, well, where does this fragrance come from? The thing that stimulates them. Longing is beauty. But you've got nothing there in the liturgical, in the seminarian training. I think something's wrong here."}
{"episode_id":"SW - #195 - 2021-11-05 - Aidan Hart - The Dance between Sacred and Secular","start":3195.22,"end":3196.34,"speaker":"Jonathan Pageau","text":"So this needs a."}
{"episode_id":"SW - #195 - 2021-11-05 - Aidan Hart - The Dance between Sacred and Secular","start":3196.74,"end":3205.54,"speaker":"Aidan Hart","text":"Every theological academy to have a compulsory at least one day. After three years, one day, please, will you give them a taste of the importance of liturgical art?"}
{"episode_id":"SW - #195 - 2021-11-05 - Aidan Hart - The Dance between Sacred and Secular","start":3206.58,"end":3225.33,"speaker":"Jonathan Pageau","text":"I think that's so true. And there is a. Here in America, we're kind of seeing a little bit. I don't know how it's integrated into the seminars, but we're seeing. St. Vladimir is developing this. This arts kind of arts center. I mean, it's not a practical, it's more theoretical, but that's okay. Cause they're priests."}
{"episode_id":"SW - #195 - 2021-11-05 - Aidan Hart - The Dance between Sacred and Secular","start":3225.33,"end":3225.65,"speaker":"Aidan Hart","text":"But."}
{"episode_id":"SW - #195 - 2021-11-05 - Aidan Hart - The Dance between Sacred and Secular","start":3226.85,"end":3274.81,"speaker":"Jonathan Pageau","text":"And you can see it at Stikon's as well. They want to have a kind of art center. So I think it's coming. It's burgeoning, but yeah, we definitely need to encourage it. And to all you I know a lot of seminarians will be watching this. You need to put pressure on your own seminaries as well, to make sure that you're able to get. And like Aidan said, I'm seeing it. The people that are attracted to Orthodoxy through the things that I'm saying, it really is the beauty which is attracting them, the beauty of the Scriptures, the beauty of how this integrates into liturgical life, these powerful patterns that show us that the world is meaningful, that the world is actually leading us towards God, if we are capable of engaging with it and paying attention to it in the property manner. And so, you know, I think you're completely right."}
{"episode_id":"SW - #195 - 2021-11-05 - Aidan Hart - The Dance between Sacred and Secular","start":3276.25,"end":3381.5,"speaker":"Aidan Hart","text":"When I was in my hermitage, a priest came with his parishioners to talk about things. And I deliberately said something I knew that which would shock the priest, and I said to the parishioners, look. And they're all converts. Forget about Orthodoxy. It's life with Christ. You know, Orthodoxy is just a name, Orthodox angle of that. I mean, I know Orthodoxy is the fullness of the truth, but. But the thing is that you're a human being before God. Forget all the oxies and the isms and beauty. This is the thing in beauty. It doesn't have an ism or an oxym. The beauty affects your soul profoundly. I remember when I was doing up the hermitage, it was run down, this 20 acres of property and had to do a lot of work on it. And I converted half the barn into a chapel and frescoed it and made a wooden mosaic floor and such like. Anyway, there's still work to be done, and I'd get 10 tons of gravel delivered, or sand. And this one day, this big truck comes up, and it was a really wild place. It was up in the hills. This big muscly man with tattoos all over delivers the truck and he delivers the sand. And he said, what are you doing here? I said, I'm making a permitted. I said, I'll show you the chapel. And this guy sort of walks into the chapel, and he just stood there, didn't say anything. I saw he began to cry, you know, just being able to weave. And I didn't say anything. You know, he wasn't a religious man, I think, but it just touched him. Just beauty touched him. So it was just one person. He didn't know about Orthodoxy or anything. It didn't matter. You know, he met God in that place. So I think we just have to go back to the basics. You know, it's all to do with life as a human being on this earth. And God's wonderful creation, loving God and beauty is the fragrance that comes out of that. Loving one another and loving Christ."}
{"episode_id":"SW - #195 - 2021-11-05 - Aidan Hart - The Dance between Sacred and Secular","start":3381.74,"end":3454.07,"speaker":"Jonathan Pageau","text":"Well, Aidan, I think that's a really wonderful place to finish our conversation. Thank you so much for the encouragement and for your wisdom and also thank you for your work. You know, I know how much influence you have and you know, you remained humble and discreet, but I know that so many iconographers have been influenced by you. And not just that, but just as a person. You know, for me as well, I want to thank you for the the advice you gave me at the outset when I started and just knowing that you were there. I could always send you things when I was struggling with some images. I've always sent you some carvings to get your opinion and even sometimes you've been harsh on me with some you might not remember. But there's some times when you said stop doing it this way and I was like, well, I think he's right. So I've actually changed the way that I carve because of your advice. And so thank you for also talking to me. The people for I'm happy that people are able to discover you a little more. Everybody that's watching this, please go online. You will find several books by Aidan. If you go on Amazon, you will discover his writing, his work on the Orthodox Art Journal. There's several articles by him and also you'll see some of his projects. So Aidan, thank you for your time and for being here with me."}
{"episode_id":"SW - #195 - 2021-11-05 - Aidan Hart - The Dance between Sacred and Secular","start":3454.39,"end":3457.35,"speaker":"Aidan Hart","text":"Thank you so much. Jonathan. It's been a joy to talk with you."}
{"episode_id":"SW - #195 - 2021-11-05 - Aidan Hart - The Dance between Sacred and Secular","start":3457.35,"end":3519.36,"speaker":"Jonathan Pageau","text":"I hope you enjoyed this episode of the Symbolic World. The Symbolic World is based on a series of videos that you can find on my YouTube channel, Jonathan Pedro's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course leaving a review on itunes. Everybody knows that's the best way to get the podcast out there to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon, the Pageot videos as well and on SubscribeStar, all those links you can find on my website or in the show description. So thank you and I will see you soon."}
