{"episode_id":"SW - #122 - 2020-10-29 - Why Symbolism - (Campfire Podcast)","start":12.56,"end":16,"speaker":"Jonathan Pageau","text":"This is Jonathan Peugeot. Welcome to the symbolic world."}
{"episode_id":"SW - #122 - 2020-10-29 - Why Symbolism - (Campfire Podcast)","start":26.49,"end":60.81,"speaker":"Radu","text":"I want to start by asking you a couple more things about symbolic thinking, because I'm trying to understand this better and I'm trying to explain it to others and discuss about it, and sometimes I'm having some difficulties. There's a couple of things. One of them is how do you validate symbolic thinking? How do you make sure that you're not just fantasizing or letting your mind wander and you're actually thinking in symbolism?"}
{"episode_id":"SW - #122 - 2020-10-29 - Why Symbolism - (Campfire Podcast)","start":63.13,"end":115.47,"speaker":"Jonathan Pageau","text":"How can you tell? Well, there are a few things. One is the direction in which the symbolism is pointing, which is that if you're looking at symbolism and you're trying to find a pattern, how things are laying themselves out, then already there's less of a chance of you being in the wrong, you know, compared to when you're trying to find out this figure in the Revelation, you know, which emperor does it represent or with, you know, when there's. That the type of symbolism I'm talking about is not the type of symbolism. That is a one for one symbolism. That is, you know, where you have an image. Kind of like a good example of that would be, let's say, C.S. lewis, where C.S. lewis has a lion, Aslan. And that lion represents Jesus."}
{"episode_id":"SW - #122 - 2020-10-29 - Why Symbolism - (Campfire Podcast)","start":116.11,"end":116.51,"speaker":"Radu","text":"Right?"}
{"episode_id":"SW - #122 - 2020-10-29 - Why Symbolism - (Campfire Podcast)","start":116.67,"end":199.64,"speaker":"Jonathan Pageau","text":"So that's not true symbolism. I mean, there is some true symbolism, let's say, in. Maybe in the way he uses it, but that's not true symbolism in the sense that true symbolism is based on the qualities of the thing itself and how they come together, how you know that something is something, how you know that it has. Has unity and the way that it lays itself out. That's when you start to see. So you actually have to trust the thing itself, like you have to trust the story itself. Most symbolism can be found, let's say you're reading a fairy tale. You look at the pattern of the fairy tale, the elements within the fairy tale, and you try to not go outside at the beginning. You try to just look at the pattern, like, who are the main characters? What are they doing? What are they, how do they interact? And then you start to try to see if there is an analogy, if there are analogies with other stories, other patterns, other places. Because one of the ways you validate symbolism is that you try to see the pattern at different levels of reality at the same time. So does the pattern apply to the individual reality? Does it apply to a community? Does it apply to a nation? You know, because the notion of symbolism is that it's a fractal structure, like A tree where the main pattern is reproduced at every level of reality."}
{"episode_id":"SW - #122 - 2020-10-29 - Why Symbolism - (Campfire Podcast)","start":200.52,"end":236.36,"speaker":"Radu","text":"Okay. Okay. So I'm getting a master's degree in philosophy now. I'm a software developer actually, but I've started a master's in philosophy last year. And, and we've studied semiotics, I think the word in English, it's not helpful to understand symbolism or is just so in my perception. Semiotics is. I don't know if I'm explaining this right, but tends to be more analytical and left brain and symbolism is more right brained or more intuitive or something like this. I don't know."}
{"episode_id":"SW - #122 - 2020-10-29 - Why Symbolism - (Campfire Podcast)","start":237.32,"end":295.28,"speaker":"Jonathan Pageau","text":"So. Yeah, so symbolism would be more on the. Indeed it would be more on the intuitive side where you would have. You grasp things. You see that usually you can experience symbolism in the moment where you see something, you see something in its multiplicity and then the unity of it jumps in your face. I always use the example of you meet someone you haven't seen for a very long time and then you're talking with them, but you don't know who they are right away. And all of a sudden you recognize them. All of a sudden the face of that person will change in your perception. They'll actually change. It'll change from the face of a stranger to the face of a person you know. And that's the experience of symbolism. It's the experience of seeing a pattern in multiplicity and it coming together. So it feels like insight. It feels like you have insight into the world when you experience that kind of symbolic pattern."}
{"episode_id":"SW - #122 - 2020-10-29 - Why Symbolism - (Campfire Podcast)","start":296.65,"end":312.81,"speaker":"Radu","text":"And I've also heard you talk about symbols being participatory or you need to participate into the symbol. Can you detail that a little more into how can I actually participate into this?"}
{"episode_id":"SW - #122 - 2020-10-29 - Why Symbolism - (Campfire Podcast)","start":313.69,"end":459.85,"speaker":"Jonathan Pageau","text":"Because, okay, so the idea is that symbolism, or the way that I talk about symbolism is really just the way reality presents itself to you. That is, we tend to think like you talked about semiotics, we tend to think of interpretation where you have a text and then you're outside the text and you're interpreting the text and you're applying interpretation rules to the text. Now, symbolism is complicated. It's not complicated, it's more holistic in the sense that you are made of the same pattern as the text you're interpreting, that you are not outside of the pattern, you're inside the pattern. And so you have to be careful, you know, to think that you're just this strange object, you know, objective observer that's outside of space and time and that is just looking at reality. Symbolism understands that you Are you are a part of the world. And that there's nothing wrong with recognizing the anthropic shape of the world. That is that the world has. Has the shape of man, that the universe presents itself through consciousness, through human experience, and that it has the shape of man. Until now, what we've been told is that subjective, right, that you have a subjective experience, but that's the wrong way of looking at it. It's not subjective, It's. It's personal in the sense that you have to experience the world through consciousness, but it's not subjective. It can be very much objective because we experience the same things in very similar manners, right? The fact that there are patterns which manifest themselves at different and different scales of reality. The fact that it's not like a one on one rule, but most people will react the same to a burn, that's a universal reality. It's not subjective, you know, it's not subjective in the sense of relative. It's objective, but it's experienced personally. And so that's what I mean by you have to participate. You have to be careful not to think that you're an outside observer looking at the world, but that your story is symbolic. And you have to engage your story, your personal narrative in terms of you as a person, but you also have to engage it within a community and then within a larger cosmic story as well. You are a part of the story. So and so that's what I mean. But when I talk about how you have to participate."}
{"episode_id":"SW - #122 - 2020-10-29 - Why Symbolism - (Campfire Podcast)","start":460.89,"end":468.49,"speaker":"Radu","text":"Okay, okay. Can you explain how do you approach teaching symbolism?"}
{"episode_id":"SW - #122 - 2020-10-29 - Why Symbolism - (Campfire Podcast)","start":470.17,"end":612.51,"speaker":"Jonathan Pageau","text":"Well, one of the things I joke about all the time is I say that the fact that we need to teach symbolism means we're in a very bad time. The fact that I'm explaining symbolism, it's actually not good. It's actually very bad. It means that. It means that we're in a difficult place in the sense that we're still part of the pattern, we're still part of the symbolic pattern, but we're in the, let's say if you imagine the basic pattern of reality as a mountain, you know, like this cosmic mountain, like you see, the paradise in Scripture is actually a mountain which people always forget for some reason, because in Ezekiel, paradise is described as a mountain. And so you have this unity at the top, and then it moves towards multiplicity, you can imagine as a wheel as well. And so the notion is that the pattern is about unity and how it kind of separates into multiplicity. That's the basic pattern. So it's the relationship between unity and multiplicity. Now, when we have to explain symbolism, it's because we're in the multiplicity part. That is, we're in danger of being in the fragmentation of the pattern. So we're moving towards death or moving towards the end, or moving towards, you know, dissolution, all these. All this type of thing. So it. First of all, we have to understand that it's a bad sign. So the way that you teach it, in my opinion, the best way is to try to create insight in people is to help have them experience the experience of insight. And once you experience insight, once you see, like, you know, you have things that you think, didn't think were related, then all of a sudden someone can show you how they're connected and can make you experience their. Their connection. Then that is the best way to get someone to understand what symbolism is and hopefully to kind of move forward in that direction. So that's how I do it. And I try to, you know, let's say I. Let's say I'm talking about a symbolic structure. I always try to do it in a way that will surprise people as much as I can. So I'll say something that you think is that you make sense. Like, I'll talk about a story, and you'll be like, yeah, okay, I can see it. I can see it. And then I'll connect it to something which is completely off the map for you. You know, connect it to you visiting your grandmother. And then you'll be like, all of a sudden it'll smash together and you'll see that this pattern is not just a arbitrary pattern in a story, that it is actually a pattern of reality."}
{"episode_id":"SW - #122 - 2020-10-29 - Why Symbolism - (Campfire Podcast)","start":613.47,"end":625.37,"speaker":"Radu","text":"Okay, and can you explain why do you think we're in this place where we don't understand symbols anymore? I think Ganod said that it's because we're modern people. It's because of modernity."}
{"episode_id":"SW - #122 - 2020-10-29 - Why Symbolism - (Campfire Podcast)","start":626.25,"end":692.64,"speaker":"Jonathan Pageau","text":"Well, because we're definitely moving towards the end of something. Like, I don't know, I don't want to be alarmist, but let's say our civilization, our society, has all the signs of the end. There are different ways of understanding it. Like I said, the notion of dissolution, the notion of breakdown in identity, but also a desire to create very solid identities. Those two extremes where you have, let's say, an emphasis on migration and immigration and multiculturalism, and then you have a backlash of purity and nationalism and closed borders. And so these two extremes, as they're manifesting themselves, they show you that we are skirting the edge. Like, we're coming towards the edge. Just like, let's say you imagine a medieval city. Just like on the edge of a city, you have both the enemies outside the gate and then you have the warriors standing on the wall with, you know, with lances and shields holding out, holding them off. Those two realities are manifesting themselves. It means we're on the edge. I don't know if that makes sense."}
{"episode_id":"SW - #122 - 2020-10-29 - Why Symbolism - (Campfire Podcast)","start":693.44,"end":695.44,"speaker":"Radu","text":"It does. Yeah. Okay."}
{"episode_id":"SW - #122 - 2020-10-29 - Why Symbolism - (Campfire Podcast)","start":696.16,"end":731.73,"speaker":"Jonathan Pageau","text":"It's not just, I use the example of nations, but it's not just the example of nations. It's also, it's also in our, you know, the whole notion of sexual identities, the breakdown of society at different levels, at the level of the family, at the level of cities, but also an emphasis on a massive unity, on the idea of global unity or, you know, kind of the notion of trying to encompass everything while noticing that everything is breaking down at the, at the level of communities. You know, all those types of extreme manifestations are, are images of the end."}
{"episode_id":"SW - #122 - 2020-10-29 - Why Symbolism - (Campfire Podcast)","start":732.93,"end":743.21,"speaker":"Radu","text":"Okay. And talking about teaching symbolism. Do you use art to teach symbols or is it related in any way?"}
{"episode_id":"SW - #122 - 2020-10-29 - Why Symbolism - (Campfire Podcast)","start":743.21,"end":850.55,"speaker":"Jonathan Pageau","text":"Of course it's related. There's narrative symbolism and then there's visual symbolism, you know, a visual version of the patterns. And so I think that art can help you. Especially, let's say I'm an icon carver. That's my job. I create icons. And so the iconographic language that the church developed is a perfect place to help people see the patterns and how these universal patterns are manifesting themselves in imagistic form. So I use. What I like to do is I like to. In order to show one of my strategies, you could say my secret strategies has been to propose things which scale from the highest, you know, if you think of, let's say church architecture or icons, you know, sacred, this notion of the sacred as the highest form of symbolism. But then I also try to go all the way down into popular movies or popular culture, advertisements, Anything, everything participates in that pattern. And so I really want to show kind of everything. And so one of the things I've been talking about a lot is talking about monsters and hybrids and marginal things in order to help people understand. Like I'm telling you, we're on the edge of a civilization. And so what we're seeing on the edge of that civilization are monsters and craziness and upside down behavior and hybrids and mixture and all the things that happen on the edge. And so I tend to. So that's one of the reasons why I talk about that stuff. But I'm always hoping to point you towards the end Altar in the middle to point you towards the center, towards the heart, towards the, you know, the top of the mountain. But we have to talk about what's at the bottom as well."}
{"episode_id":"SW - #122 - 2020-10-29 - Why Symbolism - (Campfire Podcast)","start":851.35,"end":887.09,"speaker":"Radu","text":"I wanted to ask you about one of the symbols that is a little harder for me to grasp or the symbolistic of community, because I know of a couple of symbols from St. Paul talks about the community being a body. And in the Revelation, the community or the church is the bride waiting for Christ to return. But are there any other symbols for community? Or how do you explain community in symbolic thinking or something like that?"}
{"episode_id":"SW - #122 - 2020-10-29 - Why Symbolism - (Campfire Podcast)","start":888.61,"end":1147.04,"speaker":"Jonathan Pageau","text":"Well, I think. I mean, St. Paul has. I think the best way, let's say from our angle, is to understand the images that are given. And so St. Paul gives us an image, but understanding it is different. Like seeing it and understanding it is different. So you could a way to maybe help you understand the head and the body is to understand that although we have a head and a body, everything that exists has a head and a body, okay? So everything that exists has a place where the identity of that thing culminates into a point, right? So imagine the body also has a mountain, right? So there you have that at the top of the mountain. At the top of the body you have this origin. And so everything has that. Because the problem we have is the problem is always the problem of why do we think that something is one? That's always the problem which comes to get comes out is, you know, why do we think that a chair is one thing? Because a chair is many things. A chair has many components and colors and aspects. And there are also different types of chairs. How do we know? How do we recognize chair? Like, what is it that we're able to see that this one thing? And a lot of people will think it's funny because they'll think it's obvious because it holds together physically. But we can notice unity in things that don't hold together physically. We can recognize unity across, like I said, across the chairs as well. You can perceive a unity amongst all the chairs, just like you can perceive the unity of a chair. So that perception of unity, how do we account for it? And that is the same thing for everything that exists in the world. And it's the same thing for a community. It is a community is a negotiation or a breathing in and breathing out between unity and multiplicity. A community needs to have multiple members that are all different from each other who are bound together by something which makes you see that they're also one. And so that unity could be all kinds of things. It could be that we all play hockey together. It could be that we, you know, it could be that we all live in the same place. It could be that we're a family, we have the same Father. And then ultimately, the church itself shows us the pattern of that, which is that things move into the head, which is the reason. And in the. In the church, it's personified as Christ, and that is the image. And so we, as the body of Christ, we are multiple, but we share in the identity of Christ, and we do that by loving each other. And so the idea of love is the understanding of the bond which holds things together but doesn't fuse them together. So there's a difference between love and a kind of, let's say, regimental imposition of uniformity. Because the community is not uniform. The community has all different types of members. It has more smarter people, dumber people, stronger people, weaker people, people who are more involved, people who are less involved, people who are more central to the community, people who are more kind of on the margin of the community. But there's something that. Which binds them together, and that is love. It's the capacity to be together without. Without destroying the multiplicity, without destroying the difference between things. And then ultimately, then that becomes the image of God himself. Because that is the. That is why. One of the reasons why Christians have the Trinity, which is the perfection of unity and multiplicity. It is the perfect community. God is the perfect community, perfectly one, perfectly multiple and without contradiction. It seems like a paradox. It's funny because it seems like a total paradox. But it's also. It's a paradox, but it's also the pattern of everything. It's the pattern of all reality. All reality has to find balance between unity and multiplicity. But in God, it has. It's perfectly balanced. It's perfectly balance in a way where there's. That there's even no distinction. There's no. There's no contradiction between the two."}
{"episode_id":"SW - #122 - 2020-10-29 - Why Symbolism - (Campfire Podcast)","start":1147.36,"end":1156.96,"speaker":"Radu","text":"Okay, so the difference between community and a group or collectivity is just. Is love. Love. Would you say that? Or love."}
{"episode_id":"SW - #122 - 2020-10-29 - Why Symbolism - (Campfire Podcast)","start":1156.96,"end":1298.36,"speaker":"Jonathan Pageau","text":"And there's. There's. There's love. And there's also the fractal structure that I'm telling you about. Because one of the difference between. Let's say we can use. It's. It's. It's easy to see it. Like, let's say you take the traditional Catholic Church the way that it was set up, okay, you could use anything. Let's just use that. Because. So you have the church As a totality with its leadership and the people and the parishes, and not just the parishes, but like the districts and the different dioceses or whatever. But then the diocese functions the same way as the whole church. It has a multiplicity of parishes. And then there's an archbishop and then there are bishops and priests. But then a parish functions the same way as the whole church too. There is a priest and there's different people involved. There are deacons or whatever, the way deacons are old in you, I guess. But there are deacons in the church and there's, there's people involved and there's this multiplicity which manifests itself. And there's a hierarchy of participation within the church itself, just like there's a hierarchy in the diocese. More. Some churches are more important, some are less, et cetera, et cetera. So that's how you tell the difference. The modern state, what it wants to often do is it wants to impose from the top down a kind of uniformity where there's the state and then there's all of us, Right, there's your French and then everybody speaks the same language, everybody has the same schooling. So there's this uniformity. And that is not at all how true community manifests itself. True community manifests itself at every level. And so there is no competition between the family and the church or family and the village. And the village and let's say the larger nation. There's no competition between these. Whereas in the modern state there tends to be a kind of top down in position and a competition between. So a desire to eliminate the intermediaries, to have, you know, let's say, control of the identity and then uniformity. Does that make sense in terms of the difference between community and a. And the kind of weird, the weird perversion of the modern state? You could say."}
{"episode_id":"SW - #122 - 2020-10-29 - Why Symbolism - (Campfire Podcast)","start":1299.09,"end":1314.05,"speaker":"Radu","text":"Yeah. I want to ask, does this apply to corporations too? Because corporations try to create a structure like this. Yeah, but I don't, I won't call it, call it a community. A corporation is not a community."}
{"episode_id":"SW - #122 - 2020-10-29 - Why Symbolism - (Campfire Podcast)","start":1314.93,"end":1437.55,"speaker":"Jonathan Pageau","text":"No, I don't think. Well, it can be. If they do it right, they could, they can have the right pattern. Like if, if one of the things that's, that makes some corporations very successful and be able to function is that, let's say the head of the company, they can't, they don't have the capacity, let's say, to enforce everything all the way down. And so they have to have a kind of aristocracy around them, just like a king. They would have a board or they'll have whatever it is that the structure of the company and then within the company, you'll need to have repetitions of the pattern all the way down to the actual worker in the factory or whatever. And so the remainder of ancient community is probably what makes corporations work very well compared to states. Also, corporations tend to work better than states. But in the military, you see something similar too. You see a well ordered military that the general will not tell the troops how to dig their trenches. The general will give strategy. And then as the orders come down the line of the hierarchy, then they will become more specific. And each troop will have its own cohesion and its own team spirit, but that will not compete with their allegiance to the higher level and to the top. And so that type of structure takes, tends to function really well because it does mimic, let's say more closely, traditional community. And so let's say like in an army, if in the smaller troops there's no cohesion between the soldiers. Right. If there's no love, if there's no bond, the word love might be a bit strong, but you know that in the military, for example, they will do a lot of things to try to get the soldiers to bond together at the level of their, at the smallest level of the guys that are directly around them. And you know, and that is what, that's the driving force of the whole army."}
{"episode_id":"SW - #122 - 2020-10-29 - Why Symbolism - (Campfire Podcast)","start":1437.55,"end":1437.91,"speaker":"Radu","text":"Right."}
{"episode_id":"SW - #122 - 2020-10-29 - Why Symbolism - (Campfire Podcast)","start":1437.91,"end":1454.03,"speaker":"Jonathan Pageau","text":"This bond of the smaller units. And so you could say the same for a traditional community where the families would be the bond that hold, that kind of hold everything together and then they also have allegiance to their clan, to the higher identities."}
{"episode_id":"SW - #122 - 2020-10-29 - Why Symbolism - (Campfire Podcast)","start":1455.23,"end":1475.67,"speaker":"Radu","text":"That's really cool. Okay, yeah. About talking about the structure of the church, isn't there a risk that it could become bureaucratic at some point or that there's a lack of bond of this bond that you've talked about and more of a corporation style administration?"}
{"episode_id":"SW - #122 - 2020-10-29 - Why Symbolism - (Campfire Podcast)","start":1476.55,"end":1592.95,"speaker":"Jonathan Pageau","text":"Yes, of course, of course there's that problem, there's that difficulty, you know, in theory, in theory there are two, let's say one of the reasons why there are like the two traditions, let's say the two authorities in the church has been a desire to prevent the fossilization, let's say. And so you can imagine that the church, just like in the Old Testament, has two lines. It has a priestly line and a prophetic line. And the priestly line is there to be more of a kind of top down, you know, let's say enforcing power. And then the prophetic line is there to be more of a, a wilder, but also a more direct version of the pattern. And so that's the same thing that happens in the Catholic Church, for example, you have the authority of the Church, but then you also have the saints, and the saints have more power than the authority. And you see it in the history of the Catholic Church, for example, where when there were three popes in Avignon, they asked Catherine of Siena, who was this woman who lived in a room her whole life and never came out and was completely isolated, that's her, to decide who the pope was going to be. Because of her holy. Because she was a holy woman, she ended up having more direct authority than the more formal structure of the Church. But you need both. You can't just have one side. If you just have one side, you know, either you crystallize, the church crystallizes and it solidifies and becomes, like you said, just a kind of cold, empty bureaucracy, or it starts to split and starts to break apart. And before you know it, you have 10 million denominations that all think the others are heretics. So you need to have those two sides, or else the prophetic side without the order side is like someone drinking too much wine. It doesn't. It just falls apart."}
{"episode_id":"SW - #122 - 2020-10-29 - Why Symbolism - (Campfire Podcast)","start":1594.47,"end":1601.91,"speaker":"Radu","text":"And do you have an example of contemporary church that has these two forces keeping it together?"}
{"episode_id":"SW - #122 - 2020-10-29 - Why Symbolism - (Campfire Podcast)","start":1603.03,"end":1668.49,"speaker":"Jonathan Pageau","text":"I mean, I think, as you know, probably I converted to Orthodoxy. I think the Orthodox Church has that. It's a painful thing, is none of it's fun. It's like human beings are not great. And so it still is painful because you see the conflicts and you see the. It kind of looks horrible. You see the politics. You see the monastics who are fighting with the church hierarchy. The church hierarchy will want to sometimes compromise politically because it's to their advantage. And then the monastics will be radical and say, like, you know, you can't do that, whatever. So you'll see this tension between the monastic community and the church, the church hierarchy. But I think in the end, if you back off and you kind of pull away and you look at the. At how it's going in general, it ends up kind of balancing itself out. And so, not that the Orthodox Church isn't in danger right now, because everything's in danger that, you know, we're in such strange, confused times that, you know, it's difficult to avoid it. But I think of all the churches, it's the one that has avoided the most."}
{"episode_id":"SW - #122 - 2020-10-29 - Why Symbolism - (Campfire Podcast)","start":1669.77,"end":1685.86,"speaker":"Radu","text":"Okay, I wanted to ask a little more about art and its relation with religion especially. Do you think art can have a role in rejuvenating or re. Empowering Religion or reviving it?"}
{"episode_id":"SW - #122 - 2020-10-29 - Why Symbolism - (Campfire Podcast)","start":1686.02,"end":1929.73,"speaker":"Jonathan Pageau","text":"It depends what you mean. What do you mean by art? Do you mean, like, let's say, do you do. Because let's say. Let's use a traditional point of view, right? So in a traditional point of view, you would have liturgical art, which would be the architecture, the icons, the music of the church. All of that is, to me, an integral part of what the church is. You can't get rid of it because on the one hand, it's the expression of the pattern. It's like the pattern manifesting itself in human activity. And on the other hand, it's also a guide to help us know what the proper way of being and of doing and of making is. So it also actually ends up affecting the way that we understand making in the secular. In the secular world. So, you know, I mean, it's not. No one would be surprised to understand to know that church architecture is. Was the template for secular architecture all through Christendom, that the church. The church architecture was, let's say, the highest form of architecture. And then secular architecture, although it was never like a church, would have the church as its center, right? So you have village, you have the church in the middle, everybody builds around. And so the spatial, the actual physical structure of the village ends up being based on this church. It's in the middle. So you can see the same for painting, for music. If you look at medieval music, for example, and how music became classical music in the Renaissance and later, you can see that it. It still holds some roots within the medieval structure, within the medieval vocabulary, let's say musical vocabulary, and then kind of moves away from it, but the reference is still that. And so I think that in. That's one of the reasons why I'm doing what I'm doing, which is I think that we have to. Liturgical art is the only real future for art. And I say that people will think, like, what a crazy thing to say in 2020 to say that liturgical art is the future of. But it's because it's the template. It's because even though you don't understand, even though you don't know, all the paintings you've ever looked at are connected to the history of Christian iconography. Either reacting to, moving away from referencing, even if you don't know, it's all connected to that image making, even secular image making is connected to the manner in which the idea of the precious painting that you put up on your wall is directly connected to the notion of sacred art, even if it is a moving away from it. Or a kind of perversion of that idea. And so to me, it was important just to go back and to reconnect and to rediscover the sacred language of art, not just for sacred art, but in order to now see the waves, let's say, see the waves go all the way into the secular culture. And I think that that's inevitable. And if we don't do it, it's gonna happen anyways. And I've been talking about this in several videos where people are taking popular culture and wanting to make it into sacred art because we have such a profound need for it. And so people treat Star wars as if it's a religion, treat Harry Potter as if it's a religion, you know, and, you know, use. Let's say, someone who get. People get obsessed with, like, manga imagery or all this different. Or comic book imagery or all these different types of images, and they become iconic to them. They see an image of Batman very close to how they imagine what a sacred image would be. And so what I want people to understand is that if we don't recover our sacred art of the west, and we don't, let's say, recover the inner language of it, it's going to manifest itself in all kinds of crazy ways."}
{"episode_id":"SW - #122 - 2020-10-29 - Why Symbolism - (Campfire Podcast)","start":1931.42,"end":1971.73,"speaker":"Radu","text":"Yeah. So in my church in Romania, our art is not given that much importance, in my opinion. And for example, music. We don't compose that much music locally here. We're just borrowing it from the States or some other composers. So. And I really think that it would bring more liveliness to the communion of the. And the meeting of the people here if we would have more art. And I don't know if that. That's a true intuition or."}
{"episode_id":"SW - #122 - 2020-10-29 - Why Symbolism - (Campfire Podcast)","start":1973.25,"end":2232.78,"speaker":"Jonathan Pageau","text":"I mean, I. I think it would be. I think that the difficulty in which you're going to. The difficulty you might face is the difficulty of certain Christian traditions, which is that there are certain Christian traditions which do not view. Do not view the pattern of the incarnation as being the pattern of reality and as infusing everything as being behind the world. That Christ not only is a God, you know, was a man in the first century, not only was someone who came to die for your sins, but is, you know, the Lamb that was slain before the foundation of the world, that Christ is the pattern of everything. He's the divine Logos. And so I think that because some people don't view the world that way, they tend to view the world with a scientific lens and then impose on that world vision of the science, this kind of secular scientific vision. They impose this story of you sinning and Adam and Eve sinning, and then Jesus coming to die and kind of fixing that problem. And, you know, and now you. Now you're saved. And now the purpose of art is to get other people to be saved, right? And so. And so because of that, there's a lack in the deep expression of the Logos which appears in Scripture, which appears in the image of the temple. In the image, all the prophetic images that we see are. Are soaking in the imagery of how the Logos, how the word of God ripples through the world and manifests himself. And so I think that you're always going to kind of hit that wall a little bit, but I think there are ways around it. There are ways around it in the sense that Christianity developed an extremely powerful language of architecture, of. Of music and of visual language. And so, you know, that's the place to look. That's the place to look, to kind of recover it. It's just that if you're in a community that sees all of that as evil, right, and sees all of the tradition, the visual tradition and architectural tradition and musical tradition that Christians develop for a thousand years, if they see that as evil, then you're going to struggle because you're going to be grasping at straws and you're going to try to make it up as you go along, and you're going to try to. You're going to create music based on pop music and all this stuff, you know, and it's going to be. It's going to have a certain weakness. Sorry, I don't want to be harsh, but that's a. That's just. That's a difficulty. You know, that's one of the reasons why there's. That's why Christian art stinks most of the time. And most Christian art that's made is horrible. It's. It's bad art. It's bad Christian art. It's just, you know, it just doesn't have the depth that the ancient. That you ancient ancients have. And they also don't have the depth of the secular people that they're trying to copy because they don't understand the actual message in this, the form of what they're doing. So if you make jazz has a form, rock and roll has a form, that form is symbolic. You can't put a baby to sleep singing rock and roll songs. And so that's because rock and roll has a form, and that form has an effect on us. And so there are some things you can't Say, or can't do with that form because it has a reality of its own. It has its own body. And that's one of the things that people tend to ignore. They think it's all arbitrary and you can just use this form or that form because it's popular. And they don't realize that if you make videos that you show in church in which you use advertisement tropes, you're using advertisement strategies to make videos to show in your church, then the effect it will have on people will be the effect that advertisement has. It won't be. And you can't do more then present, let's say, the gospel as a commodity that you need to get."}
{"episode_id":"SW - #122 - 2020-10-29 - Why Symbolism - (Campfire Podcast)","start":2233.34,"end":2237.5,"speaker":"Radu","text":"If you use those patterns, the medium is the message."}
{"episode_id":"SW - #122 - 2020-10-29 - Why Symbolism - (Campfire Podcast)","start":2237.98,"end":2243.34,"speaker":"Jonathan Pageau","text":"The medium. It's not just. But yes, the medium is the message. You can't completely go outside of the medium."}
{"episode_id":"SW - #122 - 2020-10-29 - Why Symbolism - (Campfire Podcast)","start":2245.18,"end":2276.71,"speaker":"Radu","text":"Okay, I have a couple more specific questions. One is about symbols in the writings of St. Paul, because I've heard St. Paul being interpreted in so many ways, like universalist and egalitarian, identitarian or stuff like this. So I was trying to understand, or maybe you can have some references where I can understand this better. The symbolic thinking of St. Paul."}
{"episode_id":"SW - #122 - 2020-10-29 - Why Symbolism - (Campfire Podcast)","start":2277.11,"end":2430.94,"speaker":"Jonathan Pageau","text":"I mean, that's a. I can't believe you're asking this question. It's like St. Paul is an ocean to swim in. It's not as if St. Paul is always saying the same thing. St. Paul, one of the things to understand about St. Paul, first of all, is to understand who he is and what he is in terms of his role in the cosmic story. You could say. And so in the early church, there was this representation that there were two pillars of the church. And St. Peter was the church of the Gentile. Sorry, St. Peter was the church of THE circumcised, and St. Paul was THE church of the gentiles. And so in there, and you can see early images where you see St Peter and St Paul being crowned by two women who are like these two churches. And this was still like in the 5th century. They were still understood that way. And so that's one thing you can understand, that when St. Paul talks the letter that he's writing, he's writing them to the people that he's writing them to. And sometimes he adjusts, not adjusts, but his message is tailored to the people who he's talking to, because he says, right, I'm all things to all people. St. Paul is something of a shapeshifter in a way, you know, and so it's very difficult when people try to kind of just skip around in St. Paul, it's very difficult because he's. Like I said, he's saying different things to different people. And so it just. So what is the symbolism that he's trying to. I think that St. Paul is mostly trying to emphasize the manner in which the outsiders can connect to the heart. And that's mostly what he's. He's keys. He is. You know, so you. You know, you have this image that I told you about. You have the mountain or the wheel with the center, and then he is trying to see how these outer aspects are connected to the middle. You know, how is it that the foreigner is. If Christ is the savior of all, if Christ is the divine Logos, if Christ is the. The origin and the culmination of creation, then how do we deal with this problem of inside and outside? How do we deal with the problem that there were Jews and Gentiles and that the Gentiles were lost in idolatry? How do we deal with that? We have to reconcile that. We have to join it together. And I think that that's what he's trying to deal with."}
{"episode_id":"SW - #122 - 2020-10-29 - Why Symbolism - (Campfire Podcast)","start":2431.74,"end":2433.58,"speaker":"Radu","text":"Okay, that's good. That's good."}
{"episode_id":"SW - #122 - 2020-10-29 - Why Symbolism - (Campfire Podcast)","start":2433.98,"end":2516.02,"speaker":"Jonathan Pageau","text":"There's so much in St. Paul. St. Paul is. St. Paul is the greatest mystic. And it's so funny because we reduce St. Paul so much. There are some texts in St. Paul that are just amazing. He really is a deep, deep, profound, mystical person and is speaking about things sometimes kind of off where he just says things and he's referring to all these things in the Old Testament. So he's. Yeah, he's difficult reading. St. Paul is really difficult. And I understand why, like, all the. All the schisms come from St. Paul because he's really hard to read and he. Sometimes he says things. And like, I remember when I was Young in church, St. Paul would say some things, and the only way the pastor could, let's say, make St. Paul fit in his box, as he would say things like, oh, he's being sarcastic here. It's like, oh, really? Is that what you're seeing? So. So you're actually. St. Paul says something, and so what you're telling me is that he's actually saying the opposite of what he's saying. That's some smart hermeneutics, huh? Pretty smart. So you can basically do whatever you want, because every time you don't agree with that, St. Paul's saying you can make them. You can say that he's being sarcastic. He's actually saying the opposite wow. Smart."}
{"episode_id":"SW - #122 - 2020-10-29 - Why Symbolism - (Campfire Podcast)","start":2520.74,"end":2566.46,"speaker":"Radu","text":"Okay. Okay. Okay. Thank you for that. That's a good starting point. Okay. And I also wanted to ask about the prophetic writings, especially the Book of Daniel and Revelation, because they help. I think they helped me in some way get to symbolic thinking because I. I was always interested and passionate about studying them and trying to understand them, but I was doing it in a. In a kind of a semiotic way, like one to one correlation. But I think there could be a sort of school of symbolism if you try to understand them better. So if you have also some references or some. Some ways to understand them better."}
{"episode_id":"SW - #122 - 2020-10-29 - Why Symbolism - (Campfire Podcast)","start":2567.43,"end":2966.72,"speaker":"Jonathan Pageau","text":"Well, the book of Revelation is very, very difficult. It's like the most. That's why, if you notice, I make videos. I almost never talk about Revelation just because it's really the. It's really. In terms of symbolism, it's. You can see, like, you can kind of read it and get a sense of all the things it's talking about and let's say the culmination of the pattern in the Book of Revelation. But too much. It's like I said, there's something about it which is. It's like taking too much in. And so you almost need to be a saint to really pierce the mystery of the Book of Revelation. But I think that if you kind of break it down and you look at some aspects and you look at, for example, an image that I reference a lot is the appearance of the heavenly Jerusalem as a culmination of the entire story, as the coming together of the garden with the Fall being brought together into one image. The idea of the garden, but also the wall, which is based on the Fall, which is the development of technology and all the technical skills that came through the descendants of Cain, which. When you see that image together of the tree with the water of life and then the glorious wall around it, that's a good image. You know, and there's a lot of things in there, too, like this notion of, like, death being thrown into death. The idea of the last thing that will die is death. That type of imagery which is bringing us into the resolution of the whole story. Right? The resolution of the whole Bible story. And so it's really all there in Scripture, in Revelation. But some of the images are hard to. They're just hard. Some of them are hard because there are some that do seem to be pointing to more specific. Like sometimes it just seems to be pointing to more specific things. But let's say the image of the. Let's say that the images that are proposed, of the throne and the, let's say the altar. Like, for example, the notion that the altar is the center. Okay, that's a really. That's an example of something people don't realize. In Revelation, you have the altar in the middle and you have the Lamb on the altar. Okay. And you. You have, you know, the choirs around that. That altar, the choir of angels around the altar. Well, that's the reason why we have the altar in the church. A lot of people say that the. A lot of people say that the church is based on the Old Testament, that the structure of the church with the, let's say, a holy place in the middle and then the nave, you know, and then the narthex is based on the. The Old Testament pattern, which is one of the reasons why some people want to get rid of it, because they say, you know, these things are gone, these things are. But that's not. It's not based on the Old Testament. It's based mostly on Revelation. Because in the temple, the altar is not in the holy of holies. The altar is outside. The altar is in the outer court. But Christianity joins the symbolism of the Ark of the Covenant with the altar, which is crazy, but which is. That's what Christianity is. It's the raising up of Christ on a cross, the lifting up of the king as he's being crucified. And so the king and the crucified one, the altar and the ark, are brought together, are joined together into one. It's a crazy, crazy notion. And it's really important if you do believe in the idea that Christ brings together all the opposites and kind of joins them together in his person. And so revelation is actually the pattern of the church building, very much so, let's say a joining of Old Testament symbolism with the symbolism found in Revelation. That's what we. So the traditional architecture of the church is based on that. And so that's something you find in revelation. There's a lot of stuff in there that you'll. The idea also, like, of the saints under the altar, where the saints are crying out from under the altar in Revelation. That's why we put relics under altars. Right? Because it's too. It's not saying that people are so incapable of thinking at different levels of reality. It's not saying that in Revelation, it's talking about a physical altar with physical saints underneath. But what we're doing is we're manifesting in the physical world the patterns which appear in the higher spheres. And so St. John perceives these patterns above, and so now, we replicate those patterns below. And so what is the living saint, let's say, who is crying out to God at the heavenly altar becomes the body of the saint, the remainder of the saint, who is acting as a kind of foundation stone under the physical altar of the church. Right. And so there's all of these. So much of church architecture, so much of the liturgy as well, is based on the Book of Revelation. And so a lot of people, it's like some you'll meet. You'll see Orthodox priests who say things like, the best way to understand revelation is to attend an Orthodox liturgy, because that's what's going on. There are many things in the Orthodox liturgy, for example, that. That are trying to do, know, this move of putting the altar in the holy, holy place. There's a lot of things in the liturgical text related to revelation that are trying to show you the connection. And so there's, for example, there's a place in the liturgy where we sing the holy, holy, holy, you know, Lord of Sabaoth, that you find in the Old Testament of the cherubs singing that. And then we say, blessed is he who comes in the name of the Lord, which is what they said when Christ entered into Jerusalem. And so it's like we both have this call upon God and then the recognition of the king on earth in Christ entering into Jerusalem. So it's like this joining of heaven and earth together in. In the person of Christ. And so that happens all the time. And like everything that Christianity is supposed to do, that's what it's supposed to be about. So if you want a key to Christian art, that's what it should always be, should always be about the joining of heaven and earth and showing how the extremes can meet in the person of Christ."}
{"episode_id":"SW - #122 - 2020-10-29 - Why Symbolism - (Campfire Podcast)","start":2967.28,"end":3028.94,"speaker":"Radu","text":"Okay. I've also understood the revelation as describing the pattern for the end of something, the end of the world, but also the end of something. And you've mentioned breaking it apart for understanding some symbols. There's this image. There's this image of the seven trumpets. Seven angels with seven trumpets. And there's the sixth one when he blows. He blows the trumpet. All the things go upside down. So there's like, islands and mountains going into seas and something like that. And then the seventh angel blows his trumpet, and there's an angel that stands with one foot on the ground and one foot in the water. And I really like that. I was thinking it was either either Jordan Peterson or you like the ground being order and water being chaos or something like that."}
{"episode_id":"SW - #122 - 2020-10-29 - Why Symbolism - (Campfire Podcast)","start":3028.94,"end":3081.68,"speaker":"Jonathan Pageau","text":"Yeah, well, that's what. That's what it is. And that's referring. That's referring right straight back into Genesis. It's not. It's connecting you to Genesis, which is the idea of the, you know, the primordial waters as being. Tohubohu, as being the earth as being a primordial water, and then heaven being order. But then you can bring it down lower. Right. So at first in Genesis, you have heaven and earth, and earth is watery, and then they pull earth out of the water, and then earth becomes, let's say, a lower version of heaven, the mountain. Right. So the mountain becomes a lower version of heaven, and then water below. And so standing on earth and water becomes akin to connecting heaven and earth at a lower level. You could say. Could say it that way. And so, yeah, those, Those patterns are definitely referring straight back into Genesis when you read. When you see that in Revelation."}
{"episode_id":"SW - #122 - 2020-10-29 - Why Symbolism - (Campfire Podcast)","start":3082.89,"end":3101.37,"speaker":"Radu","text":"Okay, I only have one question left. It's also related to a personal experience that I have, and I wanted to ask you. What's your opinion of mystical experiences? Is there. There's something to be sought or something to be?"}
{"episode_id":"SW - #122 - 2020-10-29 - Why Symbolism - (Campfire Podcast)","start":3104.49,"end":3140.49,"speaker":"Jonathan Pageau","text":"Yeah. Well, I can say it this way. The church fathers and the ascetic fathers and the, you know, they always say that you have to beware of mystical experiences. They'll say that mystical experiences will happen like they will happen, but you have to be careful. You have to not confuse the tool or the, you know, the lower rungs on the ladder to where you're going. And so one of the problems that people have is that they have these mystical experiences and they think that that's it. Like, this is it."}
{"episode_id":"SW - #122 - 2020-10-29 - Why Symbolism - (Campfire Podcast)","start":3140.72,"end":3141.04,"speaker":"Radu","text":"This is."}
{"episode_id":"SW - #122 - 2020-10-29 - Why Symbolism - (Campfire Podcast)","start":3141.04,"end":3241.51,"speaker":"Jonathan Pageau","text":"This is. I've. I've reached where I'm supposed to be. And, and, and they're wrong. And they can. And that mystical experience can become a. A. A stumbling stone for them, actually. You know. And so you have to be very careful and be very. Have. Be very discerning and not attach yourself to those mystical experiences. But there's nothing. I mean, mystical experiences happen, of course, and they happen to. To the saints and they happen to the ascetics, and they can happen to normal people. You can have a mystical. I mean, it also dep. Like how high of a myth you can have a mystical experiences. Mystical experience while drinking a glass of water. It just really just depends on how. How deep and profound that mystical experience is. It is, let's say, it is possible, it seems, for saints to live completely in that moment of pure insight where they're completely connected, you know, and for Most of us, it's a glimpse and a moment in. Then it's fleeting and it goes away and then we go on. You know, I don't. It's like. I don't know. It's hard because I don't totally. I would say if you brought something back from that, then great. Like, that's wonderful. And if. And if it's made you, you know, if it's given you some insight on the nature of things, on God and especially on your, you know, if it was a motor for you to be more involved in your life and in your relationships and in your. Your spiritual quest, then that's awesome. You know, that's great. I would say that's probably ultimately the best."}
{"episode_id":"SW - #122 - 2020-10-29 - Why Symbolism - (Campfire Podcast)","start":3242.23,"end":3247.99,"speaker":"Radu","text":"Okay. Yeah. Okay. That's it for me."}
{"episode_id":"SW - #122 - 2020-10-29 - Why Symbolism - (Campfire Podcast)","start":3248.47,"end":3251.83,"speaker":"Jonathan Pageau","text":"All right. Well, it was a lot of fun to talk to you, Radu."}
{"episode_id":"SW - #122 - 2020-10-29 - Why Symbolism - (Campfire Podcast)","start":3251.99,"end":3252.47,"speaker":"Radu","text":"Thank you."}
{"episode_id":"SW - #122 - 2020-10-29 - Why Symbolism - (Campfire Podcast)","start":3252.47,"end":3260.7,"speaker":"Jonathan Pageau","text":"I hope. I hope what I said was a little useful. I'm sorry if I. Sometimes I get into. I become fall into rant mode and hopefully I didn't do that too much this time."}
{"episode_id":"SW - #122 - 2020-10-29 - Why Symbolism - (Campfire Podcast)","start":3260.78,"end":3271.66,"speaker":"Radu","text":"Okay, that's okay. I hope it was really useful for me and I hope that it triggers some. Some ideas to you too."}
{"episode_id":"SW - #122 - 2020-10-29 - Why Symbolism - (Campfire Podcast)","start":3271.66,"end":3278.06,"speaker":"Jonathan Pageau","text":"Some insight. Not too much insight, though. It's good to talk to you."}
{"episode_id":"SW - #122 - 2020-10-29 - Why Symbolism - (Campfire Podcast)","start":3278.46,"end":3279.18,"speaker":"Radu","text":"Thank you. Bye."}
{"episode_id":"SW - #122 - 2020-10-29 - Why Symbolism - (Campfire Podcast)","start":3279.18,"end":3346.77,"speaker":"Jonathan Pageau","text":"Bye, Roddy. I hope you enjoyed this episode of the Symbolic World. The Symbolic World is edited by Justin Ward and it is based on. Of videos that you can find on my YouTube channel, Jonathan Pageau's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by, of course, leaving a review on itunes. Everybody knows that's the best way to get the podcast out there, to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon Pageau videos as well and on subscribestar. All those links you can find on my website or in the show description. So thank you and I will see you soon."}
