{"episode_id":"SW - #273 - 2023-02-09 - Why We Venerate Images","start":0.24,"end":103.51,"speaker":"Jonathan Pageau","text":"So for those who follow online discussions and battles and polemics, there has been a recent polemic about icons. You know, some people have put out some videos criticizing the orthodox use of icons. And so many people have asked me to respond, and in some ways I guess I will, but I'm not going to respond in the same manner. I'm not a scholar and I not a big fan of the scholarly approach and trying to justify this or that from proof text and to justify the accuracy or, you know, the falseness of this or that source or this or that text. You know, I have nothing against that. It's fine. And in some ways I'll leave other people to do that. But I do think that there is a deeper issue that gets ignored when we are looking at the question in that way. And the deeper question is something like the very thrust of Revelation itself, the very way in which God is redeeming the world in the biblical story, and you could say in the universal story. And so that is the way that I want to look at it, to kind of look at things, maybe back up a little and ask questions that people, as they get into the details of things, seem to not be asking. And so that's the way we're going to look at it. This is Jonathan Pedro."}
{"episode_id":"SW - #273 - 2023-02-09 - Why We Venerate Images","start":104.07,"end":105.75,"speaker":"Announcer","text":"Welcome to the symbolic world."}
{"episode_id":"SW - #273 - 2023-02-09 - Why We Venerate Images","start":116.46,"end":1729.64,"speaker":"Jonathan Pageau","text":"Now, of course, the first thing to start with is to start with the text, right? The. The prescription, which is that in the Ten Commandments, but not just in the Ten Commandments, obviously, in several other places, there is a prescription about making images. That prescription is, let's say the root of it could be said to be in the Ten Commandments. All the other descriptions of it are like, let's say, exemplifications or detailed version of the law that you will not make graven images, you will not bow down and worship them, you will not make images of false gods, and you will not bow down before them. You won't worship the images of false gods. Now, of course, most people will understand that this is not a prescription against images themselves because, you know, just a few moments, although some people go that far. But I think that's quite, quite dishonest because further on in the text, God will tell Moses to have images made, have images made on the veils of the temple, have images made, you know, on the Ark of the Covenant, to have these angels carved on the Ark of the Covenant. And then ultimately in the temple, there will be several images. There'll be bulls, there'll be images of fruits and, and different types of images. But the cherub are the most important to understand because the cherub are described as at least partly human figures that have human faces. We don't know what the cherubs look like in the carvings. I honestly think it was probably something like a sphinx of some kind, you know, because they're described as being a mixture of different animals and human. So that's neither here nor there. So the idea is that it's not necessarily, of course, a criticism of image making, but it is a criticism of making idols and also bowing down and worshiping in front of these idols. Now, what's interesting to ask is questions that I guess some people don't ask, which is, what's the deal with the second commandment? What is the reason for the second commandment? As Christians, we need to ask that, why is there a second commandment? So another example, of course, there is a commandment about, you know, following the Sabbath, which is right next to the commandment about images. And, you know, most Christians do not celebrate the Sabbath. And so why is that? Why don't we celebrate the Sabbath? And the answer is usually Christ. The answer is that the reason for that, let's say commandment was revealed in the person of Christ. And, you know, Christ in his descent into death, let's say, accomplished the greatest Sabbath. And because of that, we celebrate the resurrection as a kind of new beginning, as the, you know, the fulfillment of the Sabbath into a day of eternity. And so that is the reason why we celebrate, the deep reason, you know, why we celebrate on Sunday rather than celebrate on Saturday. And we believe, and I hope people believe this or else why are you not celebrating the Sabbath? We believe that the reason for the second command, this, the commandment about the Sabbath, is Christ. And Christ reveals to us the deepest meaning of this commandment. And so that is true of, you know, I would say, most of what is in scripture. If we can see in Scripture the key that Christ brings to it, then that is the highest aspect of it. And I think that that's the question we need to ask again. Why do we have the second commandment? What is the purpose of it? And so, of course, it makes sense that you wouldn't want to make images of false gods because, you know, like, you won't want to worship false gods. That it would be, of course, completely inappropriate. But. But the question is, why didn't God give us an image of himself? And of course, then the problem is, well, of course, God is beyond that, right? God is in heaven. God is spirit. God is not something that can be seen. You see all over in Scripture, right? The notion that God is telling Moses that you cannot see my face. If you see my face, it will destroy you, right? It's not in some ways that God doesn't have a face, but that his infinite face, or however you want to phrase it, will consume reality if you are. If you come into contact with it. And so because of that, then Moses cannot look at God's face, and no one is allowed to look at God's face. Now, again, we have to ask ourselves the question, what is the reason for the second commandment? And so we need to think about it also in another way. It's like, is there a place in Scripture where it is said that there is an image of God? Can we find that? And I think the answer is yes. And I think the answer is that the image of God in Scripture is man. The image of God in Scripture is Adam. And this, of course, makes sense even more now of the second commandment, because there is a sense in which the image of God in man has been tarnished or has been broken or has been disfigured. And so because of that, it is no longer accessible. And this seems to be something which is going on in, for example, the very revelation of the Ten Commandments. Because what happens when God. When Moses really comes into the very presence of God, his face, his image, the visual aspect of him, begins to shine with glory so much that just as in a lower way, but just as we cannot look upon the face of God, the Israelites cannot look upon the face of Moses. And. And he has to veil himself, he has to cover his face. Because you could say in some ways, the face of the image of God is being restored in Moses, but it is too much for people to be able to tolerate. And so, just as there are veils on the temple, Moses puts a veil on his face in order to cover the radiance of. Of his transformation. This is pretty amazing things. It's pretty amazing if you kind of now start to understand that there's something in the very thrust of revelation which is moving towards this idea of the restoration of the glory of God in man, the restoration of the glory of God in the image of man. Because think about it, it is visual. That is, he had to hide his face from the sight of others, because in that face, there was too much glory, there was too much going on for people to be able to stand. Now, I think that this continues on in the notion of the revelation in Scripture. And so there is this movement from something like the name, from something like that which is invisible, that which is spiritual, into that which becomes visible and. And embodied. That is, of course, the very movement from the glory of God into the tabernacle itself. It is the same movement that I'm telling you about, how there's this glimmer, this transformation of Moses as he comes down the mountain. But this gets taken up as revelation progresses, and as God promises to fill the world with his spirit, to fill the world with his glory. So in the prophetic text, we. We start to see a very strange thing start to happen. So in the prophetic text, all of a sudden, this image of man starts to appear. And it's very, very fascinating because what is going on in this question? So in the book of Daniel and in the book of Ezekiel, the prophets have this perception they see on a throne sitting next to God, you know, let's say sitting. And it's important to understand that the figure is sitting. It's. The figure is not standing. If the figure was standing, we would understand that the figure is like an angel that is serving the king, right? Like a servant serving the king. But no, there is a throne there, and the figure that is there is sitting on the throne. And in sitting on the throne, he becomes the one that is served, the one that has to be served by the angels. And what do the prophets see? They see the figure, the image of someone like the Son of Man, of someone that has the image of the Son of Man. This is very fascinating, isn't it? What's going on all of a sudden? The possibility of seeing this figure standing next to. Sitting in the throne, next to the throne of God and also being, let's say, in the glory of God. And so, right. This image that Ezekiel describes of the four cherubs, like these four wheels of a chariot that is like the earth itself. And above, you know, sitting surrounded by a rainbow on a throne, is this image of the Son of Man. Now, of course, you know, most Christians will understand that what he's seeing is the divine Logos, but already the Logos, as in the figure of a man that is already Christ, as being the one who will. Now I'm going to push you a little bit. Who will restore the image of God in man. And so this is what's going on. That's why he's seeing a Son of Man. Even before we know who that is, he's seeing a Son of man sitting on a throne next to God. Because that, in some ways, is the plan of God from, you know, from the fall itself is to restore, not even before that. Even in the creation of man. The purpose of God was to instill his image into the world, you know, and now it is to restore it in Christ. So this is what is going on. So it's all kind of there in the thrust of Revelation. And we can understand it, like I said, as a very. Say, as the very structure of Revelation itself that is moving from heaven down to earth, moving from the invisible to the visible, moving from the, you know, the. Let's say, from the invisible or glory to the. Or light into space. And of course, I think also moving from name into image. And the idea in some of these polemical videos that the Christians at the early centuries had no concept of this at all, were not at all aware of any of. At least the thrust of this movement, I think, is a little dishonest. So I'm going to read for you a text, an apocryphal text. And it's an apocryphal text that is not in Scripture, but it's an apocryphal text that was written between the first and the third century. It's called the Life of Adam and Eve. And in this you get a sense that at least the Christians and the late Jews had an understanding of what it is that was going on and the relationship between the fall of Adam and the second commandment. You know, it's like you always have to ask yourself, what is the second commandment? For what is its purpose? And so I'm going to read from you from the book of the Life of Adam and Eve. And so now it is the. It's the devil speaking. The devil says, o Adam, all my hostility, envy and sorrow is for thee, since it is for thee that I have been expelled from my glory which I possessed in the heavens in the midst of the angels. And for thee I was cast out in the earth. Adam answered, what dost thou tell me? What have I done to thee? Or what is my fault against thee? Seeing that thou hast received no harm or injury from us, why dost thou pursue us? The devil replied, o Adam, what does thou tell me? It is for thy sake that I have been hurled from that place. When thou wast formed, I was hurled out of the presence of God and banished from the company of the angels. When God blew into thee the breath of life and thy face and likeness was made in the image of God, Michael also brought thee and made us worship thee in the sight of God and God. The Lord spake here is Adam, I have made thee in our image and likeness. And Michael went out and called all the angels, saying, worship the image of God as the Lord God hath commanded. And Michael himself worshiped first. And he called me and said, worship the image of God. Worship the image of God the Lord. And I answered, I have no need to worship Adam. And since Michael kept urging me to worship, I said to him, why dost thou urge me? I will not worship an inferior and younger being than I. I am his senior in the creation. Before he was made, I was already made. It is his duty to worship me. When the angels who were under me heard this, they refused to worship him. And Michael saith, worship the image of God, but if thou wilt not worship him, the Lord God will be wrath with thee. And I said, if he be wrath with me, I will set my seat above the stars of heaven and will be like the highest. This is, of course, the oldest version of the fall of Satan. Not of falling before the creation of humans, not falling, you know, in this ancient, ancient way that is described in more recent texts, but falling because he did not agree to bow down to the image that God had put of himself in the world in Adam. Let's say the late Hebrews and the early Christians, they had a sense that there was a direct relationship between the notion of the image in the fall of Adam and the notion of the image in the second commandment. I do believe so. And that. And also not just that, but the movement in the revelation of how the Son of man appears sitting on a throne next to God. Now, of course, this will come to be fully kind of revealed in the person of Christ as being the image of the Son of man, of this restoration of the image of God in man, the restoration of the place of man sitting up on the throne next to God in the person of Christ. And the early Christian artists knew this very, very well. And so some of the very first, some of the earliest art that still, let's say, survives iconoclasm, in it, you will see that this is what they are representing. So this is an image of the ascension of Christ from the Reboula Gospel, which is a Syrian gospel from the 6th century. And so in this image, you see Christ as exact. It's the ascension, but it's the Ascension represented as Christ being the Son of man, Christ being on the chariot of the cherubim, you know, represented in this particular way with the four heads and the wheels and the eyes. And that this is the restoration, this is the full revelation of what is being hinted at, of what is being suggested in the book of Daniel and in the book of Ezekiel. And so the idea that it might have taken Christians time to fully understand the scope of what the story of Christ was bringing, of what the incarnation, the consequences of the Incarnation for us, is something that I. I can understand. And I think that pushing very hard to act as if the early fathers of the church were completely aware and hadn't totally dealt with what the relationship between, what the consequences of all the consequences of the incarnation of Christ were, I am okay with accepting that, but it doesn't change the thrust of what is happening. And so it's interesting because in some of the polemic videos, there's this sense that there is no difference between veneration and worship, that there is no difference of levels between bowing down and worshiping God in the sense of acknowledging God as being the highest and being the source of all things. And I think that's a dishonest take. There are many images of. Of, let's say, the relationship, an honorable relationship towards mediation in Scripture. You know, there is, of course, the image of Joshua who bows down before the ark of the covenant. You know, you have images, different places where people bow down to each other. And so the idea that people couldn't distinguish bowing down before something to honor it, to. To see in it a vehicle, let's say, of God's grace or God's presence, and then the absolute worship of God himself, I think that's a dishonest statement. You know, people did bow down before kings, bow down before all these things. And, you know, and the idea that there's no relationship at all, like bowing down before a king is not connected in any way to bowing down before other things. It's ridiculous. It really is an understanding of power, an understanding of authority, an understanding of something which is at least it is showing us how the authority of God works with us. It's a mediated version of God's authority on us. The idea that we would be willing to bow down to that is completely normal in the Old Testament. And so I don't see that that's an honest argument to say that there's no distinction between the two. And the best example of that is actually not in the physical bowing down, but it is in the way that the people in the Old Testament praise the name of God. And so it's very interesting, right? You see so many examples of it, right? In Nehemiah 9, 5, 6, stand up and praise the Lord your God, who is from Everlasting. To everlasting. Blessed be your glorious name. It may be exalted above all blessings and praise. Of course, in the Psalms there are so many versions of this. And it's interesting because in Psalm 99 there's a version of it. And we can look at it because it's fascinating. It says, the Lord reigns, the nations tremble. He sits enthroned between the cherubim. Let the earth shake. And so it's saying that he sits enthroned between the cherubim. The glory of God on the Ark of the covenant. Right great is the Lord in Zion. He's exalted over all the nations. Let them praise your great and awesome name. He is holy. The King is mighty. He loves justice. You have established equity in Jacob. You have done what is just and right. Exalt the Lord our God and worship at his footstool. He is holy. And so it's fascinating because in one of the polemical videos, there's trying to deconstruct this, as if this is not suggesting that people are worshiping in front of the Ark of the Covenant, or that the Ark of the Covenant is in some ways the place that you bow down, that you. That you are, let's say, relating to. In order to worship God. But then just two verses up, you see that there is relationship to that mediation because he's saying, praise your great and awesome name. And then after that he says, exalt the Lord and worship at his footstool. And so both of those examples are examples of praising and elevating and let's say acknowledging, and you could use the word venerating, that's totally fine. The mediations that God gives us, that reveal him to us. And so it's important that you be able to tell the difference. Unless you think that. That the Israelites worship the name of God in the same way that they worship God himself. And I don't think that is fully. That is acceptable in any way. And so the reason why they're able to worship at the footstool, the reason why they're able to praise the holy Name, is that these are mediations that God has given to them himself. And so because God has given this revelation of him, which we celebrate, we venerate, we raise up these mediations because it's by these mediations that we're able to encounter God in the world. So now you would say that's not true of images. And the answer is, you're right, not in the Old Testament, for sure. That's not true. But why? Why is it not true? Why is it not possible? God made an image of himself in the Garden of Eden? Why can we not venerate the image of God the way that we venerate the name of God, the way that we venerate the Ark of the Covenant? It is because God is working to restore that image in us. You know, and there are already hints of that, right? I think there are hints of that already in the Bible where you see people bowing down before each other. It's not totally clear. Like, there are different reasons why you bow down. But nonetheless, the. Whatever reason it is, the lowering of yourself in front of someone else has a structural relationship. You're lowering yourself and you're raising up someone else. When you lower yourself, you're raising up someone else. So there's no difference between praising the Holy Name and bowing down before something. Those are the same thing. They're both making yourself lower in relationship to something. So they're just the same thing. So the answer to that is that God gives a us an image of Himself, God restores the image in Christ. And so the image becomes a place of revelation of God. And not only would I go say that, but I would say that the reason for the second commandment, the spiritual reason for the second commandment, is a promise that God will give us an image of himself, that God will restore the image of himself that has been tarnished and broken at the fall, and that is Christ. So the image becomes a mode, just like the name becomes a mode of revelation. And people will get caught up in the technicalities of it. Like, people will say, well, we don't really know what Jesus looked like, so you can't really represent him. Blah, blah, blah, blah, blah. Like, this is irrelevant. This is irrelevant for the same reason you could say, well, you didn't hear the name of God in your ear when God said it, so you don't really know how to pronounce it. And so you shouldn't be, you know, you shouldn't in any ways think that you have access to the name of God. It is a question of mode. And so when we praise the name of Jesus, we know that the way we say Jesus is not the same way that it was said in the first century. And that's okay. You know, that's not. The point is not to be. To be. To be completely technically accurate. Obviously, you can't. I mean, there's a range, right? There's a range of recognizability. You can't decide that the name of Jesus is Oscar, and then praise the name of Oscar. But it also isn't about. Just about being technically accurate. The same thing is for the image. We have a way to recognize the image of Christ. We have a way that has been, that has been fostered and received in the church of recognizing the image of Christ. And we see the image of Christ as a mode of revelation of God. And this, this is something that we should be. Like I said, I understand why it took time for the Christians to see that, but it's something that we should be rejoicing of because it is a proof of the restoration of what it's a. It's an arc that starts in Genesis and moves all the way into Revelation. As you know, the image of the holy city which comes down from heaven, the space which is filled with the glory of God, then now the image of the Son of Man sitting on a throne that you find in Revelation is another version of that, is another version of the filling of the presence of God in the world. And so, I mean, that's mostly what I wanted to help you understand is that if you. I understand people getting caught up in reading the source text and looking at what this or that church father said or didn't say, where are the holes and where the proof, that's fine. Some people need to do that. But I think that the argument is made much, far more deeply from the very thrust of what revelation is and from the very thrust of the entire narrative of Scripture. And so, you know, as orthodox Christian, we see, just like we see in the name of Jesus and in the name of God, a place where God has revealed himself to us. And so we praise the name of Christ, we praise the name of God, and we also see in the image a place that God has revealed himself. And that revelation is a fulfillment. I think it's a fulfillment of a great story which starts at the beginning in Genesis. So I hope this has been useful. I know it won't convince people that are looking, you know, to that have a kind of, let's say, a technical way of reading that want to just see the proof text and the source text and try to encode it that way. And all I would ask you to do is to maybe pull out a little bit and ask yourself the bigger questions, the bigger questions of what is the thrust of the entire story. So I hope this was helpful to at least some of you. Thank you for your attention and talk to you very soon."}
{"episode_id":"SW - #273 - 2023-02-09 - Why We Venerate Images","start":1729.8,"end":1749.08,"speaker":"Announcer","text":"I hope you enjoyed this episode of the Symbolic World. The Symbolic World is based on a series of videos that you can find on my YouTube channel, Jonathan Pageau's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion."}
{"episode_id":"SW - #273 - 2023-02-09 - Why We Venerate Images","start":1749.16,"end":1750.4,"speaker":"Jonathan Pageau","text":"I will put a link to that."}
{"episode_id":"SW - #273 - 2023-02-09 - Why We Venerate Images","start":1750.4,"end":1764.68,"speaker":"Announcer","text":"In the show description and so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course leaving a review on itunes."}
{"episode_id":"SW - #273 - 2023-02-09 - Why We Venerate Images","start":1764.68,"end":1766.92,"speaker":"Jonathan Pageau","text":"Everybody knows that's the best way to."}
{"episode_id":"SW - #273 - 2023-02-09 - Why We Venerate Images","start":1766.92,"end":1771.32,"speaker":"Announcer","text":"Get the podcast out there to get it heard and if you want to."}
{"episode_id":"SW - #273 - 2023-02-09 - Why We Venerate Images","start":1771.32,"end":1773.96,"speaker":"Jonathan Pageau","text":"Get involved you can also support the podcast financially."}
{"episode_id":"SW - #273 - 2023-02-09 - Why We Venerate Images","start":1774.11,"end":1791.86,"speaker":"Announcer","text":"Get going to www.thesymbolicworld.com support or else on Patreon the Pageau videos as well and on Subscribestar all those links you can find on my website or in the show description. So thank you and I will see you soon."}
