{"episode_id":"SW - #038 - 2019-05-31 - The Inversion of Masculine and Feminine in Popular Culture","start":0.8,"end":27.6,"speaker":"Jonathan Pageau","text":"On this episode of the Symbolic World podcast, I am playing for you a talk that I gave at Furman University. The talk was looking at the inversion of masculine and feminine in popular culture. In a way, it is a continuation of another video that I did called Symbolism and Propaganda, which I will not put up as a podcast because it is so image reliant. But I would suggest that you go check that out. I think it's one of the most popular videos on my channel."}
{"episode_id":"SW - #038 - 2019-05-31 - The Inversion of Masculine and Feminine in Popular Culture","start":27.76,"end":28.06,"speaker":"Announcer","text":"And."}
{"episode_id":"SW - #038 - 2019-05-31 - The Inversion of Masculine and Feminine in Popular Culture","start":28.21,"end":51.81,"speaker":"Jonathan Pageau","text":"And so the idea is to examine how gender has become such a hot button issue in culture, how it has become a vehicle for political propaganda for political change, and how it is that as people trying to understand symbolic structures, how can we understand these shifts that seem to be happening around us? So, please enjoy."}
{"episode_id":"SW - #038 - 2019-05-31 - The Inversion of Masculine and Feminine in Popular Culture","start":65.79,"end":69.23,"speaker":"Announcer","text":"This is Jonathan Peugeot. Welcome to the Symbolic World."}
{"episode_id":"SW - #038 - 2019-05-31 - The Inversion of Masculine and Feminine in Popular Culture","start":79.79,"end":726.28,"speaker":"Jonathan Pageau","text":"So I'm going to talk about the inversion of masculine and feminine symbolism in popular culture. Just looking at the title, it seems very polemical. And in a way, I guess there's a part of it that is. But I hope that we can work through very quickly the polemical aspect of it and come to show the beauty of the symbolism of the feminine that we have in the orthodox tradition. And so if you bear with me, we will get through the difficult part at the beginning. So what's happening today in popular culture is that there has been, for several years, for decades even, there has been this call to have more. What people are calling gender equality in popular culture. And so this call to have more female protagonists in movies and TV shows, in, you know, even in video games and comic books, all. All of popular culture, there's been this call to have these strong female protagonists. And so what has slowly kind of come out of that is exactly that we have this string of manifestations. Movies, comics, video games, all of this, that have the. What I guess we could call the badass feminine character who. She's strong, she fights, she beats up everybody. And so in a certain manner, the hope, the trope is that she, this character which has all kinds of manifestations, is there to, in a way, manifest the same idea of the action hero or the superhero or the military hero, but as a woman. And so we see them, we recognize them, we saw. I think these are from just this year, from just this year, Marvel Comics, Star wars, all these feminine characters who are. Who are strong, were fighting and who beat up all the guys around them. Now, the thing I want to point attention to is that as we watch this, as we watch this characterization, there's something that's happening also at the same time, what we're seeing is not only the representation of these feminine heroes, but at the same time, we see a strange demeaning or a strange mocking, a strange humiliating of the masculine characters within those same stories. And so at first, you would think that this is a question of parody, right? We have these. These masculine heroes. It would be good to also have feminine heroes that we can look up to in the same way that we look up to these masculine heroes. But what's strange is that in the stories, Many of the stories have this other trope, which is to step on or to mock. So, for example, there's a. They did a version of Ghostbusters. Everybody has probably seen this. They did a version of Ghostbusters recently that had it all set, feminine cast. And in the story, which was in a way not necessary that they did. So there's a scene where the old Ghostbuster, who was a man, Bill Murray, he's sitting there in a room, and they blow him out of the building and he dies. Lands on the hood of a car, and he dies there. And you see the ladies come up to the window and say, I guess he was in Ghostbuster material. And you think, I mean, it's a joke, and it's fine. It's a joke. The problem is not that one joke. The difference difficulty which appears is when it becomes a pattern, right? And that's what. That's what I'm sensitive to, is to be attentive to the pattern. There's a recent video game that came out, and it's creating a lot of controversy because the video game is supposed to be a historical, very historically accurate representation of World War II and the fighting in World War II. And in the video game, it's. It's like 50, 50, you know, they have women, people fighting women fighting in the World War II. Then they put a woman on the COVID she's got a mechanical arm, and she, you know, she's fighting in World War II. And so people are wondering, like, what. This is obviously not a historical representation of World War II. You know, not that there weren't women involved in the war effort. Of course there were. But, you know, 95% of the. Maybe 99% of the people who actually held a weapon in World War II would have been men. And so what is. Like, what is the. What is the impetus behind that? And what I am trying. What I want to suggest to you is there really is this strange inversion, which is setting up where we do want to have this feminine character. But we want the feminine character to embody all that is masculine. We are looking. And so it's basically, if you look at the superhero characters, it's the same superhero character that was Superman, Batman, all those masculine characters. It's only that it's physically a woman. Now, one of the examples of the. Everybody has seen the Star wars, the latest Star wars movie. So if you look at the COVID of the magazine, you get a sense that the COVID of the magazine itself, it's telling you what it is that they're hoping to accomplish. And so you have up there, it says, can Poe get along with his new boss? And in the movie, you have this scene where this character who just appears in the movie is humiliating the male character. And the trope repeats itself in the movie several times. You see these characters being humiliated, given a lesson, taught something. And like I said, it's not the act itself, because in a story, you can have all kinds of things happen, and it's okay to have variations and have this. The problem, the question that is brought up is when we start to see it as this constant pattern which appears over and over in stories, that's when we start to wonder what exactly is happening in these stories. Because, of course, there are always exceptions. There is such a thing as a extremely strong woman that could probably beat up anybody in this room that does exist. The question is not whether or not there are exceptions. The question is, what is the pattern? What is the social pattern that is trying to be shown to us? So in the latest movie, the Incredibles 2, you really see this inversion played out completely. They have the female character. We are told that the male character is too reckless, he's too chaotic. He can't control himself. He breaks everything. And so we're told that it's her. She has to be the hero now, and he has to stay home and take care of the children. And what's fascinating, and this is going to be important as we move forward in the story, is that in the story itself, the lady is amazing. She's an amazing superhero. I actually enjoyed watching the movie because it was so well done, so well put together. So the woman is amazing. She's doing all these amazing things. Visually impressive and everything. And then the masculine character. Sorry, did I. I forgot to change the. And the masculine character is taking care of the kids, but he can't. He's completely useless. He's, you know, everything is crumbling around him, and he doesn't sleep, and he's. He's become a total wreck. And so you have. You really have this dichotomy where you have one character which is shining, which is amazing, and then the other character, the father, who is basically, you know, can't do it. Just can't. Can't hold it together. And we've seen. I mean, we've seen this character. We've seen this character in television and in movies now for the last few decades. It's Homer Simpson, it's the Family Guy, it's all those idiot fathers, right? You know, they've given them to us, you know, piece by piece, you know. And so when we see this now, it's almost as if we're used to seeing this trope in stories. We've seen it now for so many decades that when we see the idiot father who can't do anything right and is. Is kind of breaking everything and can't get his act together, we think that that's the normal, let's say, pattern of a story. Now, a lot of people will think that, obviously I am exaggerating. A lot of people will think that I am seeing this from a certain angle, maybe from a traditional angle, however it is. But you have to pay attention to what's going on, because what you find is, as these stories come out, the people who are promoting the stories in the media, even in journalism, they're celebrating what I'm showing you. They're actually celebrating that this is happening. So it's not just that it's happening, it's that it's being celebrated. And so, for example, in a recent movie called Ant man and the Wasp, you have this very pattern happening. So they made the first movie, it was a male character. Then the second movie, you have a feminine character which usurps his place in the story. And not only that, but the male character becomes this kind of idiotic. You know, everything that he does is kind of."}
{"episode_id":"SW - #038 - 2019-05-31 - The Inversion of Masculine and Feminine in Popular Culture","start":726.52,"end":726.92,"speaker":"Announcer","text":"He."}
{"episode_id":"SW - #038 - 2019-05-31 - The Inversion of Masculine and Feminine in Popular Culture","start":727.24,"end":2570.6,"speaker":"Jonathan Pageau","text":"He succeeds only by chance. He has no skill. He's kind of the goofy idiot. And in the. In the press. I'll read you a. This is from this article that I put up here. The. The author of the article, she. She lays it out herself. She said, we asked for more powerful women. So here we are. So the WASP is the best hero. Her mom is smarter than everyone. The villain is a girl, too. The dudes in this movie are hapless and only succeed by accident. And every one of those sentences has an exclamation point. And she is celebrating. She is celebrating the fact that the masculine hero is being demeaned and is being kind of set aside for this kind of ascent of this feminine superhero. And so I think that this is really the ultimate version in Marvel comics. They created this character who is captain Marvel. She's quite recent in Marvel comics, and they're making her out to be the most. So she is the most powerful character in the entire universe. And if you look again at the magazine cover, you can see that this is not. They're not. This is purposeful. Can you see up there? It says the future is female. So there's. There's this celebration, and the celebration is not of a kind of equality, of a kind of parody, which is what we were told. That's what it was supposed to be. It was supposed to be a world where men and women are equal, where men and women work together, where we don't differentiate the gender so much. But that's not what's happening. What we're seeing is rather a revolutionary trope where one is trying to supplant the other. So why does it happen that way? Why does it have to become upside down? And the problem is this, is that we believed. We were told that equality means same, that if we're to believe in the equality of the sexes, we somehow have to believe that they are the same, that there's no difference between the two. And that is not true. Right? I mean, the entire tradition of human existence has shown us that all societies at all times, from the beginning, have in different ways, but have always demarcated the masculine and feminine and have had gender roles in society, they have been different. I'm not saying that all societies have had the same role, but they've always had that distinction. And it's been, you know, the difference was acknowledged, and actually the difference was celebrated. And so in order to. You would say overcompensate. So in order to say we can have women who are as badass as, you know, tough, as much a fighter, as much a killer as a man, the only way to do it is to flip it, because you have to overcompensate for the illusion, because we know that that's not the case, or at least has not been the case in the entire history of humanity. So there's this desire to overcompensate. And that overcompensation creates this inversion, where it's not only the assent which is needed, but it's also the demeaning which is needed. So the pattern of masculine and feminine is one of the most permanent patterns in all traditions, you know, in all cultures. It takes different forms, of course, Everybody will know this symbol. So the yin Yang symbol is a symbol of heaven and earth. It's also a symbol of masculine and feminine, a symbol of that duality, but a duality, of course, which is together, right? It's not an opposition completely. You know, you could see that the complementary relationship. And in so many traditions, you have that played over. You have it in Greek mythology, you have Gaia and Uranus. You have. In Mesopotamian. Mesopotamian mythology, you have Tiamat and Absu. These kind of primordial. Either it's heaven and earth, or sometimes it can be fresh water, salt water. But this relationship of two complementary, you know, opposites that come together to then produce something, to produce the world. And in the Bible, we have similar pattern. We have this setup at the beginning of Genesis. We have heaven and earth, this kind of primordial duality. And this kind of primordial duality in the creation story itself. You see how it's coming closer to each other. You see these different separations. But we're coming closer. We have the heavens and then we have the water. Then the separation of the waters. The earth comes out of the waters, and we have fish and birds. If you always wondered why we have birds and fish created on the same day, it's because it's to repeat that same pattern, Heaven and earth, below and above. So it keeps repeating. And then it comes down to the human being. And then G D takes the dust of the earth and then blows in the air into his lungs. The spirit. When we read spirit, we always have to remember that spirit, wind is the same word. So you have this union of heaven and earth which appears in man. And it said that man was created male and female. And then we have Adam and Eve as the result of that repetition of the basic pattern which was there right from the beginning. And so there's something that is extremely primordial about that relationship. And if we completely set it aside, we are going to miss a very important aspect of who we are as human being. In the Gospel, there is a call. There is a call for us to transcend the opposite, right? We see it in St. Paul. St. Paul tells us, right, there is neither male nor female, neither Greek nor Jew, right? Neither slave nor free. And there is this call to transcend the opposites. But there's a very big difference between transcending something and confusing something. And hopefully, if you look at what I've been telling you about, to have this, let's say, ascendance of a feminine character which wants to take all the masculine qualities while at the same time demeaning the masculine characters in a story. What you have is not. You don't have this transcendence. You have confusion and an inversion, and you have a conflict, right? You have. You have this perpetuation of a fight. And now it's just one side that's losing. There were times in history where maybe it was the other side that was losing. And now we have this other situation. And we can see. We can see in the imagery that St. Paul uses of marriage, we can find glimpse of what it looks like to transcend the opposite. Because in the union of male and female and the union of masculine and feminine, St. Paul tells us we are one body. There's an actual unity which is created in that bond of marriage. And that unity, which in a certain manner transcends the duality because it unifies them together, it's productive. It produces children, produces community, produces family. And so when that happens, there is a productive result. Whereas when we have this inversion, the result of that is the opposite. It's conflict, and it's also sterility. Once we understand the basic elements of, let's say, that basic opposite of masculine and feminine, once we understand that it does in fact set itself up in society as male and female, we can then also see that it is, of course, more than that. Then in a certain manner, we are called to play those roles in our lives as well as the church. I always tell people, like, I am called to be the bride of Christ. I'm called to also participate in the powerful and beautiful symbolism of the feminine and then encounter my Lord in that manner. So it's not just about, like I said, it's not just about polemics and about complaining about some political change that is happening in front of our eyes. There's something much deeper there and something much deeper which needs to be, to be understood. Now, the problem, the trick in this. This is really the thing that I think is, in a way unexpected by many people, is that when we look at the trope, okay, so when we look at the. At the trope of the. Of the badass feminine character, what seems to be happening is that in fact, what we're praising, what we're celebrating is actually not the feminine, what we're praising, what we're celebrating is the very, you know, the very classical masculine traits of being strong, of being tough, of being able to fight all those types of kind of traditional male tropes. That is what we end up celebrating. And so the inversion actually creates this strange contradiction which. What is being diminished in the end or what is being put to the side is the beautiful and the powerful feminine symbolism which has been held by humanity for thousands of years. We are ignoring it. We are pretending as if what really matters, what's really important is that we can embody those roles, that what matters is to be the CEO. All we want to know is how many female CEOs there are, how many female policemen there are, how many. That's what we want to know. But we're not. We've forgotten. We've abandoned. A celebration of the beautiful imagery of the feminine. So this. I'm going to show you an icon. This icon, in the orthodox tradition, could be the most, let's say, celebratory of what we'd call kind of the hero type of behavior, right? It's very, very. It encapsulates pretty much simply everything that's going on. We have a princess who is in distress, and there is someone who comes and kills the dragon in order to save the princess. And so it has its place. It definitely has its place. Now, the thing is that there is another version of this story. There's another. It's not the same story, but there is a feminine version of this interaction between the masculine and the feminine. So this is. This is a version, and I think it has. It has some importance, but there is also a. A masculine version, right? And so in, for example, the story of Beauty and the Beast, we have a masculine character who is a monster, right? Who is out of control, who is. Who wants to control everything, who wants to hold her, he wants to capture her, wants to control her presence there. And in the story, what happens is that Beauty is able to tame the male monster and she's able to transform him into a man. Now, this story is. It's not just Beauty and the Beast. There are many examples of this. One of my favorite examples of this story is called Howl's Moving Castle. It's by a Japanese director name Miyazaki. And in this story, we have that very trope. And the character, the feminine character, is extremely powerful. She basically holds the life of this monstrous masculine character in her hands, and she slowly brings him to transform and to open up a new space in which he can be more than what he was before. But think of not just in popular culture. In the Bible, we have the story of Queen Esther. And the story of Queen Esther is pretty much the same story as Beauty and the Beast. We have this foreign king who everything is there, set up to destroy the Jews, and then her, through her grace, through her manner, in which she is able to approach the king and tame him. You would say she brings the king, she invites the king to her house, and the king enters into her house, and then she reveals to him the secret that in fact Haman wanted to kill the Jews. And in revealing this beautiful secret, this powerful secret, then the king changes and things flip over, and then the king turns against Haman. And I mean, there are many, many other stories. There's a very, very ancient stories. In the story of Gilgamesh, we have a very similar story. We have a beast named Enkidu who is basically a wild creature in the forest. And the people of the city, they send this woman. And then by encountering this woman and entering her into a relationship with this woman, he then learns to become a human being. So it's a very, very ancient story, and it's a very powerful story which shows you the other side. Instead of just wanting to put a woman on the horse, St. George's horse, who kills the dragon, it shows another aspect, another very powerful aspect of what the flip side of that story is. So let's look at this image again. Now we have many images of what, of feminine symbolism in the church, in our tradition. And many of them, they turn around the Mother of God. And the images that we use for the mother of God are images of her being the opening up of this place. Place the opening up of this possibility. She is the temple. She is the Ark of the covenant. She is the dawn. There are all these images that we use of her to show her as this place in which something will happen in which the divine will manifest itself. And so even in. So the Mother of God becomes the frame. She becomes the frame into which the manifestation happens. And we can see that even in this icon here, we can see that even though we have this idea of the helpless princess, for example, that the princess is the one who is enticing, if you will, the hero to act. Without her, there's nothing happens. There is no heroic action. And that can be good or bad. This is just a structure. It can be good or bad. If you look at the Trojan War, we have the same structure. The Trojan War is fought over Helen of Troy. She is the. She is the one who brings the Greeks. That's why the Greeks are called Hellenes. Right? She is the one who actually entices the Greeks to join together in order to fight and rescue her from the Trojans. And so she becomes that the space into which these Greeks can come and become Something actually manifest something, some identity, right? And so we have this image. We have this image of the mother of God, of Mary, as this frame, as the space, as the opening up of the possibility. So you can see her in this. This is the most ancient tradition of the representation of the mother of God is to show her as the throne of wisdom, to show her as this throne. But if you look at the image, you'll see that she's also this frame. She is the space out of which, you know, the. The sun rises, the space out of which something is happening. And that that pattern is going to be the pattern of this mysterious presence of the feminine always there in the church, always there and following the story of the church. And I'm going to show you this pattern. So this is the wedding of Canaan. Now, in the story we see. Exactly. It's one of my favorite stories in the Gospel, because Christ is hidden. Christ is not acting. No one knows. He's a secret. She knows the secret. She's the only one. She knows the secret. But Christ is not acting. And so then there is a problem. No wine. So she goes up to Christ and she says, there's a problem. There's no wine. And it's very fascinating because what does Christ answer? He says, my time has not yet come. You think that is a crazy answer? She's telling him there's not enough wine. And he's answering, I'm not willing to die yet. How do those things relate? And they relate in the fact that she is inviting him, she's inviting her son. She is saying, here's the question. Show me the word. Show me the answer. Give us the answer. There's that crazy scene in the movie My Big Fat Greek Wedding. I love that scene when everybody knows it, when the lady, she says, you know, the man is the head of the household, but the woman is the neck. And we think it's funny and it's hilarious. But I think there's something very profound in that statement because the mother of God is saying, this is the place where I'm asking you to manifest yourself. And then Christ has to decide whether or not he's going to do it. Now think of that. Think of that in our lives. Think of that as a church. What do we do? What does the church do? We ask. We pray. We ask God. We say, here is my suffering. Here is my sin. Here is my question. And we ask God to manifest himself in that space that we open up as the church. And what does the church say in the book of Revelation at the end. What do they do? They. They're calling, they're enticing, they're asking. They're saying, come, Lord Jesus. They're asking for Christ to return. And that is really the. That is really the powerful symbolism of the feminine as it manifests itself in the. In the church. Now, this structure, I think it's kind of the opening scene for this, where we really see the Mother of God inviting Christ to manifest himself. Him knowing that if he shows himself to the world, it's going to lead him on this path to his death. He knows already that's where he's going. But this is the opening of that new space for him to enter into. Okay. If you're interested, I wrote an article called Sacred Art and the Power of Women. You can find that. Google it. You'll find it. And one of the things I show is that Eve did that too. Like, she enticed. Like she kind of opened up a space for Adam, and that space was a fall. And then the Mother of God does the same, but she flips it. She opens up the space again, and then she flips it so that now it's. It's to our salvation. It's very powerful. I think it's just one of the most beautiful patterns in the big story. Now, the pattern repeats itself over and over. We have, for example, in the judgment of Christ, there is Pilate, who is there and has to judge Christ. But in the background of that story, there is Pilate's wife, who we actually venerate as Saint Procla. And she secretly. No one in this, no one in the crowd knew, but she secretly, in whispering in his ear, she said, this man, you know, he's special. Be careful. Don't mess with him. Then we have the same structure. Who is the first person to go to the empty grave? Who is the first person who alone in that secret encounter, to encounter the risen Lord? It's Mary Magdalene. And then she goes to the disciples, and then the disciples will encounter him in the. In the space. And they will also be the ones who will end up proclaiming the resurrection of Christ. But she is the one who opened up that space. Then we have all the royal women of our history, every single royal women. Every time a nation. Maybe not every time, maybe it is, but at least that we know of. There are so many examples that when a nation converts to Christianity, what's the trope? The trope is the same. There is a woman who converts, and there's this private, secret encounter that we don't even know. We don't know what those women told to their sons or to their grandsons or to their husbands. But we see the pattern, right? We have Saint, we have St. Helen who converts and then Constantine. We have St. Olga, the grandmother of St. Vladimir, who converts and then St. Vladimir. But it's everywhere. The first Frankish king, Clovis, the first Christian Frankish king who converted first his wife, the first British king, King Ethelbert, is that you pronounce it? King Ethelbert of Kent. It was his wife who converted first. This pattern is non stop. And we see it not only with the royalty, but we see it with the saints too. We see St. Monica who converts and then we have Augustine, who is the western pillar, you know, the Western. He is basically, you know, he's that on which the west is founded. And then we also have, we also have Saint Macrina, the sister of Saint Basil of the Cappadocians, who converts and then her family converts. And so the difficulty about this is that, you know, we often say in the Orthodox Church that the Mother of God is a mystery of the Church. We always, we say that, we say we don't have too many doctrines about her. What we have is that encounter, that secret encounter that as you enter into the life of the church, you discover the Mother of God. And so, you know, I, I even always have been hesitating to even talk about this subject because in a way, here I am proclaiming something that is supposed to be right. This, this thing that you discover as you look and it's not there. It's, you know, this pattern. No one will say, oh look, you know, the mother of Constantine, Karuna before. And so, hey, that's not, it's something which is hidden and is this secret opening of a space. And so in a certain manner, it's something that we probably shouldn't be talking about, but that we should probably be experiencing and discovering in that secret place. But I think that the reason why I want to talk about it is that I believe that it's. That this beautiful symbolism of the feminine is something we have as this precious jewel. And in a world where we're so confused about these questions, where we're so. We think somehow that value is to be strong, is to be a fighter, is to be, to be on top, is to be a leader. And then we forget the value of the private space of caring, the value of caring for those that are there, of also discovering that mysterious opening of the place where God can enter into our own lives. There's this image. Everybody knows about the Song of Songs in the Old Testament, where it is this song, the Song of Solomon, where it is basically a romantic discussion between a lover of two lovers. And the church fathers have always interpreted that as this relationship that we are meant to have with God, that as we need to be able to inhabit that feminine space of opening up the. The possibility of then encountering this light, this light that we saw in the. On the. On the. The knees of the Mother of God. The light that we see when we look in the apse of our churches and we see the Panagia with her arms open and Christ who is coming out of the dawn, who is, who is showing himself on the ark, who is sitting on his throne. And so I think that we need to be aware of that and be able to explore and to celebrate that beauty and not let ourselves fall into the war of the sexes that we see raging around us. And so thank you very much. That's what I had for you tonight."}
{"episode_id":"SW - #038 - 2019-05-31 - The Inversion of Masculine and Feminine in Popular Culture","start":2578.49,"end":2634.22,"speaker":"Announcer","text":"Thank you for listening to the Symbolic World Podcast. As you know, this podcast is for now based mostly on my YouTube videos which I am transferring into audio format. Please go ahead and visit my YouTube channel. There are more videos there on different subjects that I'm not going to put into audio. And please share this to your friends. I know a lot of people know about the YouTube content, but not so many people know that this is also a podcast. So share it to your friends. Share it on social media. And if you can, feel free to support this financially as well by going to my Patreon page, which is Peugeot Videos. Strangely, you can go there and you can support it at any amount that you want. A month for all the patrons. I do a monthly Q and A live Q and A in which people can ask questions in the chat. And I try to have a more personal connection with people. The YouTube comments have become difficult to follow and to answer. I'll see you soon."}
