{"episode_id":"SW - #202 - 2021-11-24 - Christopher Kaczor & Matthew Petrusek - Jordan Peterson, God, and Christianity","start":0.4,"end":69.11,"speaker":"Jonathan Pageau","text":"Hello, everybody. I am very excited to be here with Christopher Kasor and Matthew Petrusek. They are the authors of the recent book Jordan Peterson, God and the Search for a Meaningful Life, which is published by Word on Fire, Bishop Barron's organization. And so I'm really happy to have them here. I have the book right here. I've been diving into it, looking into it, seeing the different approaches and different arguments. I'm happy to. To have some time with them to explore why they wrote this, you know, what are they hoping to accomplish, and a few of the main points that they're trying to make. This is Jonathan Pedro. Welcome to the symbolic world. Christopher and Matthew, thank you for coming on. Maybe introduce yourselves a little bit, tell me what your background is and moving up to why it is that you even thought of writing such a book right now."}
{"episode_id":"SW - #202 - 2021-11-24 - Christopher Kaczor & Matthew Petrusek - Jordan Peterson, God, and Christianity","start":69.35,"end":192.95,"speaker":"Christopher Kasor","text":"Sure. So I'm a professor of philosophy at Loyola Mary Mac University in Los Angeles, and I teach a lot of courses that are related to subjects in faith and reason. So I actually teach a course called the God of Faith and Reason. And one of the big issues that comes up with my students again and again is how to reconcile Genesis with contemporary science. So I have many students that are troubled by this, students who see the attractiveness of Christian faith and then worry, well, I'm going to have to jettison all contemporary knowledge about how things evolved and whatever. So for years now, I've been trying to show students that if we put Genesis back into its proper context and read it as a creation narrative, that's a rival to other creation narratives, and that actually there's no difficulty at all in reconciling a proper understanding of Genesis with contemporary science and evolution and things like that. So I'd been doing that for a long time, but then I ran across Jordan Peterson's lectures on Genesis, and I have to say, even though I had read Genesis many, many times, I was really struck and learned a ton from his own interpretation of the text. And so I really became quite fascinated with his work and looked at his writings and also the videos that he's done on other topics. And what I was struck by really was in my way of thinking about a continual effort to put contemporary science in dialogue with this rich faith tradition. And I love that because part of my background is studying Thomas Aquinas. He's one of my great heroes. And Aquinas was all about bringing together what was for him at the time, contemporary science, that is the writings of Aristotle, with the wisdom of the Christian tradition. People like John Chrysostom people like Augustine of Hippo. And what Thomas wanted to do is bring these into fruitful dialogue. And that's what I tried to do in my own philosophical work. So I saw Peterson's work really as another way, in a very exciting way, of engaging in this dialogue between faith and reason. So that kind of sparked my interest in Peterson and led me to write about Peterson and then eventually to co author this book."}
{"episode_id":"SW - #202 - 2021-11-24 - Christopher Kaczor & Matthew Petrusek - Jordan Peterson, God, and Christianity","start":193.35,"end":201.7,"speaker":"Jonathan Pageau","text":"And so Matthew, you wrote the 12 rules part, not so much the biblical lectures part. So what it is that brought you to such a venture yourself?"}
{"episode_id":"SW - #202 - 2021-11-24 - Christopher Kaczor & Matthew Petrusek - Jordan Peterson, God, and Christianity","start":201.94,"end":304.78,"speaker":"Matthew Petrusek","text":"Well, I did my. I'm also a professor, but of theology, just right down the hall from Chris at Loyola Marymount University. And I did my graduate work at the University of Chicago. And it rightly has the reputation of doing a really rigorous, maybe even suspicious analysis of the category of religion. And so it's a very sort of hard knock intellectual environment. And so when I first got this job, I thought, oh, I'm prepared to be able to speak to students who may have some reservations about religion in general and Christianity in particular. And I realized within the first semester that my estimation of where young people are, where the culture is generally, was way off. I couldn't even assume, for example, that students knew that the Bible is composed of, for Christians of the Old Testament, the New Testament. That was one assumption I learned the first day of class. So ever since that's been about seven years, I've been looking for ways to retool, to make religion first accessible and then second relevant. And I've been experimenting with different literature and different approaches. But when I encountered Jordan Peterson's work and then saw the effect that it was having, I thought, this is it. And I've actually been able to test it in the classroom. And sure enough, the kind of response he gets online is also happening in the classroom as well. So for that reason, I began engaging his work. And I also, because I was giving it such a close engagement, started to look at not only areas of overlap, but also what I thought were some significant gaps or areas in his thought that a substantive Christian theism would actually fix."}
{"episode_id":"SW - #202 - 2021-11-24 - Christopher Kaczor & Matthew Petrusek - Jordan Peterson, God, and Christianity","start":306.22,"end":321.22,"speaker":"Jonathan Pageau","text":"And so I'm curious about Matthew, what it is like, what it is about his approach that you thought was in terms of Christianity, in terms of a way of living. What do you thought was so close or what would enliven these young Christian students that you had?"}
{"episode_id":"SW - #202 - 2021-11-24 - Christopher Kaczor & Matthew Petrusek - Jordan Peterson, God, and Christianity","start":321.62,"end":405.4,"speaker":"Matthew Petrusek","text":"Well, if I could play sort of armchair psychologist, which is dangerous to do. We're talking about Jordan Peterson. I think that we're at a point now where the experiment of secularism is not only beginning to fail, but really failing. And students are. Young people especially are bearing the brunt of that. When I think back to my own youth, my own coming of age, and I have that long commute into work, often listen to music from the 90s. Now it's considered classic rock in some circles, which is scary. But I see the culture beginning to experiment with this kind of mischievous nihilism already. But around it, people were still basically believers in a generic sense. It was still propping up the idea that life is meaningful, that there is purpose, that there is a structure to life in general, to your particular existence that will hold you up. So we could afford, the culture could afford to have these pockets of mischievous nihilism. Well, I think it's fair to say those pockets have now become the dominant form. And things are falling apart. Across the board, we see things are falling apart. So I think that there's this hunger, even if it's not explicitly articulated by most, a hunger for rules and then for rules that actually have depth, meaning, purpose, and truth."}
{"episode_id":"SW - #202 - 2021-11-24 - Christopher Kaczor & Matthew Petrusek - Jordan Peterson, God, and Christianity","start":406.2,"end":423.38,"speaker":"Jonathan Pageau","text":"Yeah. There's something funny about the situation when. What happens when the world is ordered. You have room for clowns, let's say, and kind of people poking at the order. But when the world is upside down and everything is clownish and everything's a carnival. Yeah."}
{"episode_id":"SW - #202 - 2021-11-24 - Christopher Kaczor & Matthew Petrusek - Jordan Peterson, God, and Christianity","start":423.38,"end":424.02,"speaker":"Christopher Kasor","text":"What do you do?"}
{"episode_id":"SW - #202 - 2021-11-24 - Christopher Kaczor & Matthew Petrusek - Jordan Peterson, God, and Christianity","start":424.5,"end":430.34,"speaker":"Jonathan Pageau","text":"And then people who tell you to stand up straight and pull up your pants become, whoa, like, this is."}
{"episode_id":"SW - #202 - 2021-11-24 - Christopher Kaczor & Matthew Petrusek - Jordan Peterson, God, and Christianity","start":430.58,"end":431.26,"speaker":"Christopher Kasor","text":"What is this?"}
{"episode_id":"SW - #202 - 2021-11-24 - Christopher Kaczor & Matthew Petrusek - Jordan Peterson, God, and Christianity","start":431.26,"end":432.1,"speaker":"Jonathan Pageau","text":"Like, what is this?"}
{"episode_id":"SW - #202 - 2021-11-24 - Christopher Kaczor & Matthew Petrusek - Jordan Peterson, God, and Christianity","start":432.26,"end":435.66,"speaker":"Matthew Petrusek","text":"Put on your pants and then pull them up. Put them on."}
{"episode_id":"SW - #202 - 2021-11-24 - Christopher Kaczor & Matthew Petrusek - Jordan Peterson, God, and Christianity","start":435.66,"end":482.75,"speaker":"Jonathan Pageau","text":"Yeah, just a lot to start with. And so, Christopher, in terms of Genesis, I think that for sure, my own interest with Jordan is far more in that area. I'll be honest with you. I haven't actually read 12 rules for life, but his work on the relationship between cognitive science and evolutionary biology and the manner in which to read Genesis, this idea of perception and the problem of multiplicity, this is what has interested me the most with Jordan. What got me excited about the manner in which he talks about it. And so what is it about the way he talks about Genesis, which you found connects so much to the Christian tradition?"}
{"episode_id":"SW - #202 - 2021-11-24 - Christopher Kaczor & Matthew Petrusek - Jordan Peterson, God, and Christianity","start":483.15,"end":625.25,"speaker":"Christopher Kasor","text":"Well, I would say in a weird way, the most basic thing was something I never noticed until Jordan Peterson pointed it out to me, and that was that God creates through rational speech. So in some of these rival creation stories, the gods have a big battle, a big war, and then the universe is fashioned out of the. Basically a battlefield remains of this sort of inter. What would you say this war among the gods and what Jordan points out, which, again, it's weird that I never noticed this, but that God says, let there be light. And if you think about rational speech, rational speech can only arise from some kind of reasoner. You can't have rational speech just from a duck quacking or, you know, a tree falling over and making noise. If it's a rational speech, there is a mind behind it. And so the universe is. Arises from this rational speech and reflects a rational mind. And that God repeatedly does this and then says, and it was good. That's another really key point, because some of these rival myths thought of the created order as actually evil, that to have a body, for example, would be seen as a bad thing and an evil thing that we should transcend. And rather than view creation in the human body as good as these other stories would say, no, no, you're trapped in your body, your body. Like Plato would say, your body is a prison that traps your soul. And I think in the Christian tradition, there's this emphasis on the goodness of creation and an emphasis on the goodness of the human body. And so again, Jordan sort of highlighted these things. And I had heard the stories before, but system had never registered with me properly. And he really made it register with me properly. So I was very grateful for. For those insights. And then the more I thought about those sorts of insights, about how human beings are made in the image of God, and therefore we too, express ourselves through rational speech. I mean, Jordan really brought that out in a really beautiful way. So I guess what I was trying to do in the book is connect Peterson's interpretations of Genesis with some of these older classic interpretations of Genesis that you find in people like Origen and St. Augustine and Thomas Aquinas and others. And again, I found this big overlap. And in some respects, I thought that these classic thinkers in a way, could really contribute and augment what Peterson was saying and bring him kind of further down the road. So in the book, that's kind of what I'm trying to do is say, this is great, we're moving in a good direction, but if we look at these. These classic writers, we can go even further and even deeper."}
{"episode_id":"SW - #202 - 2021-11-24 - Christopher Kaczor & Matthew Petrusek - Jordan Peterson, God, and Christianity","start":625.25,"end":800.72,"speaker":"Jonathan Pageau","text":"Yeah, I think that your point about the goodness of creation is a huge thing that seems to come up time and time again in Jordan, which is, even though sometimes you wonder if he really believes in the goodness of the world, he realizes that, just like his proposition about God, that if you act as if the world is good, then the fruits of that will be Something if you act as if the world is inherently bad, then you can also see what the fruits are. And it's interesting because, you know, in the past maybe 20 years or so, there's been a resurgence of Gnosticism in the popular culture. There's been in, you know, even in universities, this idea that the Gnostics were the real Christians and that, you know, orthodoxy was just suppressed. All these marginal voices of Christianity, you know, you have this narrative which is there. And it's fascinating to notice that as we kind of see postmodernism play itself out, we're seeing in these transhuman moves and in these. Even in the digital space and this obsession with the digital space, something like kind of soft Gnosticism, where we believe that we can exist only in these kind of subtle bodies, you know, on screen, then that, you know, the. Our. Our actual physical. Physical bodies are something of a obstacle to our ideal existence, whether it's in the. Whether it's even in the whole gender sexual identity thing, but also in other even weirder tropes, like, you know, like the. The fashion for furries and all that kind of weird stuff where people kind of project themselves into avatars and things like that. So I think that Jordan, even in his own Persona as this kind of gritty, grounded guy, he doesn't anymore, but he's. To wear cowboy boots. You know, that was something about like, he just, you know, he has this sense that he's actually kind of standing on the ground and his. And his. And speaking to you from that. That space. I really think so. And also the same with. With what you're saying. There. There's something when. When Jordan's talking about scripture that you're like. And then, oh, no. Like there's. It's like you're like, yes, yes. And then, I don't know. I'm not sure. Like, here's when things start to get a little soggy, let's say. But his genuineness, I think, is part of the attraction, too. He's so genuine in his desire to kind of plunge in and to know more and to move these things around and to try to see how they can connect to contemporary issues of psychology and how we live in the world. I think that goes a lot to why people are interested. Sometimes, you know, the Christian scholar especially speaks. Speaks from a voice in which you see it. You feel almost as if this has nothing to do with reality. Like, this is, you know, when you're talking about Genesis, it has nothing to do with your life, has nothing to do with how you live in the world. So why would you even care about these old stories, especially if they sound so foreign to our materialist thinking, let's say."}
{"episode_id":"SW - #202 - 2021-11-24 - Christopher Kaczor & Matthew Petrusek - Jordan Peterson, God, and Christianity","start":801.28,"end":892.8,"speaker":"Christopher Kasor","text":"Yeah, no, I totally agree with you. I think that is part of the draw of Peterson's presentation, in particular, when he's actually talking, hearing him talk. So when you see him, and I've seen him live twice, when you see him give a talk, especially live, there really is a sense that he is thinking through these issues. He's trying to figure out what's true. And you probably noticed sometimes he'll just stop and it'll be like just, you know, be three, four seconds, and you're like, God, did he have a stroke? I mean, I'm worried about the guy. What happened here? He's still thinking. He's just sort of collecting his thoughts and trying to pick exactly the right word. And for me, I appreciate that. I think that's great. I mean, it's. He's sort of the exact opposite of a White House press secretary that just spits out the talking points of the day. And there's no relationship between those talking points or very little relationship between those talking points and the reality of what's actually happening. Just, you know, so. So I love, for me, that's a huge part of the draw, that there's a kind of honesty, searching quality to it. And, you know, if you're going to search, you know, sometimes you're going to not find what you want or go in the wrong direction. But, you know, I think we're all in a search. I mean, maybe my questions are slightly different than Jordan's, but, you know, I'm still searching. I'm still trying to grow and move forward, and I love that about him. And for me, frankly, that's pretty inspiring, I think, well, look, if I can spend my life on a search for the true, the good and the beautiful, and trying to live in accordance with the true, the good and the beautiful, well, then I would think my life is going to be pretty meaningful and I'm going to live a pretty good life."}
{"episode_id":"SW - #202 - 2021-11-24 - Christopher Kaczor & Matthew Petrusek - Jordan Peterson, God, and Christianity","start":893.52,"end":953.06,"speaker":"Jonathan Pageau","text":"And there's something about that which people have a vision, let's say, of the Middle Ages or kind of Middle age, thinking of this very rigid and solid way of presenting things. But when you look at how actually things were done with the contestations and the universities, students would bring up questions, there would be this lively debate that would be go on for multiple days, you know, where students would just try to find arguments to kind of. To destroy their Teacher. The teacher would say, like, find all the arguments you can to try to destroy my argument and then be this like, back and forth thing. It was far more dynamic and far more engaged than what we tend to think of today. And so, Matthew, I guess the big question for you is what do you make of the whole I act as if God exists thing? Because that seems to be the biggest issue that keeps coming up with Jordan. He says he doesn't believe in God, but he acts as if God exists. How do you make of that in terms of how it connects to Christianity, how it goes away from it, or how do you see that?"}
{"episode_id":"SW - #202 - 2021-11-24 - Christopher Kaczor & Matthew Petrusek - Jordan Peterson, God, and Christianity","start":953.14,"end":1060.09,"speaker":"Matthew Petrusek","text":"I think in a. The book actually points out that Peterson's use of that trope by act as if God exists is actually something that Pope Benedict, Pope Benedict Emeritus encouraged as a model for Europe and its waning relationship with Christianity, saying at least can we agree degree that it's, all things considered, it's preferable for us to live and to act as if God exists. And so I think we can get a lot of mileage out of that, especially given the current state of the culture. At the same time, I think it's ultimately, it has a formal structure to it, but it's substantively empty because it's hard to have a relationship with a hypothetical. And ultimately Christianity is about a relationship. Those are also words from Pope Benedict. It's not about a set of propositions or a set of ideas. It's about a relationship with Jesus Christ. And so you may get something, but it will be a pittance of the actual reality that's behind it. If we only act according to the idea that there may be some lawgiver and judge, it also misses the grace. It misses the love, it misses the mercy. It misses the best part of the Christian story. It gets, maybe it might get the crucifixion, but it misses the resurrection. And so I think for. For those reasons, it's just, it's not enough theologically, philosophically, but I also would say therapeutically it's not enough, because when things get, when things get dark enough, a hypothetical is not going to carry you through. It's just not going to do it. You're going to have to walk to jump to the other. I don't like the word jump. You're going to have to have the courage to push through to the other side into an actual relationship of faith."}
{"episode_id":"SW - #202 - 2021-11-24 - Christopher Kaczor & Matthew Petrusek - Jordan Peterson, God, and Christianity","start":1060.57,"end":1203.76,"speaker":"Jonathan Pageau","text":"No, I think your point about grace is the most important point because, you know, for all my love of Jordan, we see that the God that he says he acts as if exists, is an ideal, right? Is a judge, is a logos, is something towards which all reality tends, but acts as this overbearing model that you have to conform to. And then this sense, you know, this sense that you can't, right, that it actually becomes a weight on you, like this pressure that makes you suffer because you see it and you want to act in conformity to it, but you always fail. And so, you know, it's actually kind of. It's actually not funny, but it's kind of the strangeness, which is that the whole point of Christianity, right, is that this. This absolute is calling you, right, is always kind of calling you and is the source of reality and always calling reality back into himself. And without that, even the theory, even his theory about how the world exists to me, seems to not. Seems to fall apart because there's something even behind that, that seems to. Even in his idea of perception and this notion of multiplicity, there seems to be a sense in which you have to get it. You have to understand how there's always this kind of calling in, right, this bringing the world, even as a person, kind of into. And so if you stack that up into higher beings, then you end up with something like God. And so there's an interesting thing going on too, with Jordan. I don't know if you commented on it, either of you, but Tammy, his wife, is much closer to Christianity. Although she's not yet going to any church, she has been praying the rosary every day for several years. She attributes her. Her healing to a miracle that she experienced in the hospital. I'm actually doing a series with her right now going through the symbolism of the rosary and which she wants to put up as a podcast, you know, on her own, on her own terms. And now we've heard also that Michaela, his daughter, is saying that she found God. I don't know exactly what that means, but. But it's an interesting situation in general to watch how. How Jordan seems to have been this bridge towards Christianity for many, many people, you know, and it's a bridge that he himself has. He himself has not crossed yet. So I don't know if it's something that you've thought about in the writing of this book."}
{"episode_id":"SW - #202 - 2021-11-24 - Christopher Kaczor & Matthew Petrusek - Jordan Peterson, God, and Christianity","start":1204.08,"end":1356.92,"speaker":"Christopher Kasor","text":"Yeah, a little bit. And actually kind of after writing of the book. So one of the important things about Mary, it seems to me, and Jesus is if Jesus is just a myth or an ideal, you know, an ideal or myth doesn't need an actual mother. But Jesus was not merely an ideal or merely the archetype, but was actually a flesh and blood, real human being. And so he had a real mother. And so I think in a way, the practices like saying the rosary are incredibly important for living as if God exists. So I think that there's something incredibly important about living as if God exists. And I try to do that too. And there is always a gap between my ideals of how to live to love God perfectly and the reality of what I actually do. But part of the way of easing this gap, it seems to me, is recognizing that it's God's help that helps us to cut down on this, on the gap between the ideal and the real. And part of that mercy is the impetus to prayer. So when we pray, it seems to me what we're doing is enhancing that relationship and moving towards ourselves, transforming into being more like how we ideally want to be. And so, yeah, I'm very happy to hear these encouraging developments about his wife saying the rosary. And I hadn't heard about his daughter, but I think all that is really to the good. So if we act as if God exists, the next thing to ask I think would be, well, has God given any sort of revelation about how he wants us to live? And Jordan's answer to that seems to be more or less that, yeah, Jesus really is somehow the ideal and teaches us something really important about how to live. But then if that's true, and we look at the Gospels, Jesus clearly talked about a church and talked about the importance of baptism and talked about all these. These things that Christians are supposed to do to. To serve the poor and to love their neighbor, to forgive their enemies and pray for their enemies. And so I think the next stage would be, well, look, if we try to live as if God exists, we try to follow the teachings of Jesus, well, then the next stage might be, well, we should join a church, we should pray, we should love our enemies, we should serve the poor, we should develop a life of prayer and then. And then continue moving forward. And this way of. It's not really an intellectual way, it's almost by practice, you know, that. That you grow not so much through just thinking, but. But also through living through. Through actual. The practice of prayer, the practice of penance, the practice of serving others. And so that can be, and for most people is a very viable path to God. Yeah."}
{"episode_id":"SW - #202 - 2021-11-24 - Christopher Kaczor & Matthew Petrusek - Jordan Peterson, God, and Christianity","start":1356.92,"end":1400.53,"speaker":"Jonathan Pageau","text":"One of Jordan's main points has been the idea that, let's say consciousness and perception is embodied, you know, and that it is. It is very much embodied. That is the way that we actually address the world. Is always through this embodied judging or evaluating of how things present themselves to us. You know, and this, if you take that a little further, you realize that what it necessitates is it necessitates something like ritual. There's no doubt about it. That is that if the world is teleological, the way it presents itself to us and we have to deal with it in terms of our purposes, then there are ways to deal with them properly. And there are ways to deal with it which lead to death. And that scales into social interactions."}
{"episode_id":"SW - #202 - 2021-11-24 - Christopher Kaczor & Matthew Petrusek - Jordan Peterson, God, and Christianity","start":1400.53,"end":1400.77,"speaker":"Christopher Kasor","text":"Right?"}
{"episode_id":"SW - #202 - 2021-11-24 - Christopher Kaczor & Matthew Petrusek - Jordan Peterson, God, and Christianity","start":1400.77,"end":1471.76,"speaker":"Jonathan Pageau","text":"We have ways of interacting with each other which are ritualized and are not arbitrary. And that continues to stack up. And so all of a sudden, even within this very secular way of describing the world, things like baptism, things like communion, things like coming together, singing, church buildings, all the. All the. The kind of stuff that the modern demylogy. I can never say that word demythologizing. Christian wanted to slowly eradicate all suddenly kind of flood back in. And, you know, I think that even at the end of his own argument, Jordan at some point has to go to church. It has to become embodied. You can't just be talking about embodiment, but there has to be a stacking up of how things come together in community. Like you said, all of this is well and good until you have someone sitting in the pew next to you that you really find annoying. And that just gets on your nerves all the time. And now you're faced with them and you have to talk with them, and you have to go up to the communion chalice at the same time, knowing that you're all part of this body. So, Matthew, I don't know if you have some thoughts on these last few points about Jordan as a bridge and all of this towards Christianity."}
{"episode_id":"SW - #202 - 2021-11-24 - Christopher Kaczor & Matthew Petrusek - Jordan Peterson, God, and Christianity","start":1472.08,"end":1590.42,"speaker":"Matthew Petrusek","text":"Yeah, one of the. Again, through practice, having had the opportunity to teach Peterson's work a few times, one of the elements of his thought that students I think react to most positively is his claim in 12 years for life that you have a nature. It comes to them as if it's like revelation, as if it's prophetic, that there is a. There's a way of being that is particular to who you are as a human being. I think that one of the reasons why that's so revolutionary for those who have been seeded and brought up in secular culture. So it's all they know. It's all they know. They don't have a reference point is it's liberating. Because if it's true, and it is true that we do have a nature that we are made in a particular kind of way. Then the whole life project shifts from one of self creation where we are not only like a stone carver who gets to create our own life, but we are the stone itself. We're the quarry, we're the hammer, we're the chisel. We're absolutely everything. So we're not working with something. We are everything that we work with at the same time, which is even at the most superficial level, impossible to do well because you have no reference points whatsoever. You're operating a vacuum. It's at best exhausting, at worst tragic and catastrophic. So to hear that we actually have a nature and the life project shifts from acting in accordance with a general pattern of being that is ultimately good, resets their horizon of what is possible. Then on top of that, if you can build into that notion of creation, this sacramentality and this, this incarnational understanding of God being present in bodies, in matter, in stuff, well, then there you go. You've got a good religion at that point. And you also have orthodox Christianity. Yeah."}
{"episode_id":"SW - #202 - 2021-11-24 - Christopher Kaczor & Matthew Petrusek - Jordan Peterson, God, and Christianity","start":1590.42,"end":1657.23,"speaker":"Jonathan Pageau","text":"As well. Pretty much. Yeah, pretty much. And so I'm going to. I want to ask the big question. You know this. In the last few months, Jordan has really been talking a lot about psychedelics. He's had quite a few experts, some people even claiming that the original Eucharist would have been hallucinogen. You can feel by my tone what I think of this stuff, But I wanted to know. But this is a big deal. I don't want to also make people's reaction to the way people are dealing with this. Even in my own, the own people that watch my videos, this is a big thing because this is coming back into culture. And Jordan also seems to be, if not encouraging it, talking a lot about it in ways that will encourage it, whether he wants to or not. What do you see to be the difference? Or maybe you don't, but what do you see to be the difference between this vision of spirituality, which is this taking of or take, or having spiritual experiences, seeing the sky open up, you know, having all these, all these, these types of experiences and the spirit, the Christian walk, like the Christian transformation."}
{"episode_id":"SW - #202 - 2021-11-24 - Christopher Kaczor & Matthew Petrusek - Jordan Peterson, God, and Christianity","start":1657.68,"end":1724.99,"speaker":"Christopher Kasor","text":"Yeah, I think one way of thinking about it would be the difference between kind of selfish orientation versus a kind of altruistic orientation. So if I take drugs, especially hallucinogens, I'm cutting myself off from reality and I'm having my own kind of private experience. But insofar as I'm cut off from reality, that makes it much more difficult at Least when I'm cut off to really love God, to really love other people, and even really to love myself. And the reason is that real love has to be based on reality. Real love is based on truth. If I want to. If we think of love as willing the good of the other for their sake, in order for me to do that, I have to know truly who this other person is. And I have to know the truth about what is actually good for this person. And even loving myself, if I'm going to love myself properly, I have to know the truth about who I am and the truth about what would actually be good for me. So insofar as I am on LSD or something and I'm detached from reality, that obscures my ability to know the truth about myself, the truth about other people, and the truth about God. So I think the Christian view."}
{"episode_id":"SW - #202 - 2021-11-24 - Christopher Kaczor & Matthew Petrusek - Jordan Peterson, God, and Christianity","start":1725.31,"end":1734.59,"speaker":"Jonathan Pageau","text":"Let me just be fair for the people I've never taken, but let me be fair to their argument, which is that what they say is that when you do take it, it's the opposite, which happened."}
{"episode_id":"SW - #202 - 2021-11-24 - Christopher Kaczor & Matthew Petrusek - Jordan Peterson, God, and Christianity","start":1734.59,"end":1734.99,"speaker":"Christopher Kasor","text":"Yeah."}
{"episode_id":"SW - #202 - 2021-11-24 - Christopher Kaczor & Matthew Petrusek - Jordan Peterson, God, and Christianity","start":1735.07,"end":1775.59,"speaker":"Jonathan Pageau","text":"That what you encounter is more reality. As you see the reality more, you see a deeper reality of yourself, you see a deeper reality of the world, and you also see a deeper reality of others. So a lot of people, it's not always the case, but some people, like Sam Harris, for example, says that his whole spiritual journey started when he took the. He took dmt, I think, and then all of a sudden felt this deep love, like this, this like overwhelming love for his friend that he couldn't explain, that was so completely taken taking him over and that when he finished his trip, then he wanted more of that. Like, he just wanted more of that. So I just want to be fair to the, to the, to the, to the psychedelics people."}
{"episode_id":"SW - #202 - 2021-11-24 - Christopher Kaczor & Matthew Petrusek - Jordan Peterson, God, and Christianity","start":1775.99,"end":1875.66,"speaker":"Christopher Kasor","text":"Yeah, yeah, no, that's fair enough. That's fair enough. And I haven't taken LSD either, so I, I can't comment, you know, one way or the other. But I guess if we move off Harris's insight, there is something beautiful and wonderful about feeling love for other people and that's terrific. But at the end of the day, I'd say the Christian ideal is not so much feeling and emotion, but being a certain kind of person. And because you're a certain kind of person, you act in a certain kind of way. So the Christian ideal, it seems to me, is Jesus and it ultimately is about love and love, at the end of the day, it seems to me in this fallen world is going to involve suffering. So in a way the opposite of feeling good is going to involve, in some cases, feeling a great deal of suffering. And again, that's not the end of the story. The Christian story is that the suffering of Jesus wasn't the end, that he did suffer grievously, but that, you know, the story continues and we have the resurrection, we have that great joy. And I think that my way of thinking about at least is that my. The goal of my life should not be to feel a certain way or to have certain experiences, but the goal of my life should be love. I should try to love God, I should try to love other people, I should try to love myself properly. And I will have deep, important experiences and deep feelings if I do that. I mean, the more I love other people, the more I care about them, the more I have a feeling of love towards them. So feelings are important. I'm not denying that. But I think that if we put feelings in the first place and chase after feelings, I think that's going to get us into trouble. I think the better way to move is to try to love. And if we do try to love others authentically, I think we will in a very natural way, have very deep, important and positive experiences with these people."}
{"episode_id":"SW - #202 - 2021-11-24 - Christopher Kaczor & Matthew Petrusek - Jordan Peterson, God, and Christianity","start":1875.82,"end":1971.01,"speaker":"Jonathan Pageau","text":"Yeah, I think you've got exactly the right point, at least in my perception, which is that it really is a difference between experience in a passive way and embodied practice in the other, which is that the difference between receiving an experience and just kind of having it and then actually walking on a road and being transformed as you walk on this path. You know, and I think that that's. It seems that while you can be tricked to believe one is the other because you have this elated experience of reality and you, you get a sense that you pierce the veils and the mysteries that are holding the world together. You think that somehow that's you, you know, and then when you're done, you go back to your miserable little life and you don't, you don't necessarily realize that when it hits the road, loving your neighborhood doesn't, like you said, mean feeling all these things about. It means actually engaging with them in a certain way, which, which includes self sacrifice and includes all of this. And so I totally agree there. Even in the mystical tradition of the Christian, the Christian church, like in the Orthodox tradition, you have a sense in which these mystics, they have these crazy spiritual experiences, like, you know, all these very similar to the ones people have on, on, on these drugs. But they tell you ignore those experiences, they'll happen, just let them Go, actually let them go, don't bother with them. Because that's not your goal. Your goal is not to have these. It's actually your goal is to become in the image of God. Your goal is to become like Christ, not to just have these experiences. So, Matthew, I don't know if you have some thoughts on this same subject."}
{"episode_id":"SW - #202 - 2021-11-24 - Christopher Kaczor & Matthew Petrusek - Jordan Peterson, God, and Christianity","start":1971.25,"end":2043.78,"speaker":"Matthew Petrusek","text":"Yeah, it's cheating. It's cheating, pure and simple. I mean, you can win by cheating, but you've still cheated. And so if it's true that God exists and think that God does exist, and if it's true that Jesus Christ is the son of God, which I believe to be true, then that's the ultimate cheat. I mean, you want the resurrection without the cross. And Jesus is very, very clear that that is not the way to go, that that is the way to perdition, not to salvation. And I think that's not because that's just the way that God has happened to rig the system, that you have to suffer in order to make it. But that's just the nature of real transformation, of real individual transformation, is if you're not capable of saying yes to God, of saying yes to Christ in the middle of the darkness, if you need to trip in order to say yes to God, well, then you don't love God. You love yourself. And you've just now, now participated in a mystical delusion of what's ultimately just an expression of self love. So it's. I mean, I even have."}
{"episode_id":"SW - #202 - 2021-11-24 - Christopher Kaczor & Matthew Petrusek - Jordan Peterson, God, and Christianity","start":2043.86,"end":2091.17,"speaker":"Jonathan Pageau","text":"What you're saying is so, so interesting because Jordan had this interview with this, this mushrooms guy. And it was, it was some guy who was saying, I forget what his name is. He was saying that all religion was based on mushrooms. And he was interviewing this other person who was obviously someone who had done a lot of mushrooms, like a lot of psychedelics. And they talked about it for two hours. And then finally Jordan asked this person, and I'm sorry if he ever watches this, but he asked this person, so what is it about? Until now, they're just talking about the actual mushrooms. Like, it's hard for me to even focus that long on something like that. But then they come to saying, like, what is it about? Like, what's behind all of this? And the man answers something like, you realize that after you've been all through this, you know, that you've gone through, you realize that God doesn't exist and it's just you. And I was like, yeah, that's it."}
{"episode_id":"SW - #202 - 2021-11-24 - Christopher Kaczor & Matthew Petrusek - Jordan Peterson, God, and Christianity","start":2091.33,"end":2092.29,"speaker":"Christopher Kasor","text":"He just wasted my time."}
{"episode_id":"SW - #202 - 2021-11-24 - Christopher Kaczor & Matthew Petrusek - Jordan Peterson, God, and Christianity","start":2092.29,"end":2113.93,"speaker":"Jonathan Pageau","text":"Solipsism is the final solution. And when I say Solipsism, it's not even, it's really is like. Yeah, you need to understand what the consequences of solipsism are. That it's not just, I'm not just being a religious rigorous and saying it's wrong. There are actual fruits of solipsism and they look like our world today. And so that's the end of this stuff is something like solipsism."}
{"episode_id":"SW - #202 - 2021-11-24 - Christopher Kaczor & Matthew Petrusek - Jordan Peterson, God, and Christianity","start":2114.8,"end":2139.68,"speaker":"Christopher Kasor","text":"Yeah. And you think of Dante's Inferno, right? The people that are in the deepest part of hell are frozen in ice. So sort of like an image of solipsism, right. They're just inward, just themselves, no actual contact with another person. That, that is at least for Dante, the very worst sit and ending situation. Right. To be in the pit of hell, which is not for him, fire, but to be totally encased in ice."}
{"episode_id":"SW - #202 - 2021-11-24 - Christopher Kaczor & Matthew Petrusek - Jordan Peterson, God, and Christianity","start":2140,"end":2165.12,"speaker":"Jonathan Pageau","text":"Yeah, exactly. All of Dante's hell until then is about love. It's about, it's all about love, but it's about ill placed love and misplaced love. But then when he gets to the deepest pit, it's like that's when the love is gone, then that's it. All that's left is this, these frozen, these undynamic realities that can't, you know, can, can it can't transcend themselves into others. And so it's just the flip side."}
{"episode_id":"SW - #202 - 2021-11-24 - Christopher Kaczor & Matthew Petrusek - Jordan Peterson, God, and Christianity","start":2165.12,"end":2177.41,"speaker":"Matthew Petrusek","text":"Of that kind of existence, see as despair. I mean, and it's, it's paper thin of one side to the other because if you end up by yourself and that's all there is, that's also hell. Absolute terror."}
{"episode_id":"SW - #202 - 2021-11-24 - Christopher Kaczor & Matthew Petrusek - Jordan Peterson, God, and Christianity","start":2177.41,"end":2177.77,"speaker":"Christopher Kasor","text":"Yeah."}
{"episode_id":"SW - #202 - 2021-11-24 - Christopher Kaczor & Matthew Petrusek - Jordan Peterson, God, and Christianity","start":2177.77,"end":2195.52,"speaker":"Matthew Petrusek","text":"And the idea that this would be used as a therapeutic to help people cope with reality, it's awful. It's awful. I mean it's, I can't, I can't stress how much if anybody's watching this who's thinking about experimenting with drugs as a way of dealing with depression or anxiety. Please don't. You will end up alone in hell."}
{"episode_id":"SW - #202 - 2021-11-24 - Christopher Kaczor & Matthew Petrusek - Jordan Peterson, God, and Christianity","start":2195.6,"end":2199.6,"speaker":"Christopher Kasor","text":"Matthew, can you tell us what you really think you're holding back and I'm unclear."}
{"episode_id":"SW - #202 - 2021-11-24 - Christopher Kaczor & Matthew Petrusek - Jordan Peterson, God, and Christianity","start":2200.48,"end":2235.61,"speaker":"Jonathan Pageau","text":"It's like. Can you be any clearer there, Matthew? All right, all right. I think on that last little moment of passion, I think we can finish this. Everybody check out the book. Jordan Peterson. God and Christianity. You can find it everywhere. And it's also one more of the great things that Word on Fire is doing all the work to doing with connecting to the secular world. And so maybe you can finish in telling me a little bit about the reaction you've had from the book and then we'll Finish there. So please tell me a bit about how people are reacting to it."}
{"episode_id":"SW - #202 - 2021-11-24 - Christopher Kaczor & Matthew Petrusek - Jordan Peterson, God, and Christianity","start":2235.93,"end":2268.45,"speaker":"Christopher Kasor","text":"I think the reaction that I've had at least has been very positive. I've had actually the opportunity to go to the Vatican and gave a copy of the book to the Pope. He seemed very happy about it. I don't know now, does he know Jordan Peterson? I'm not sure, but. But he seemed delighted with it. But in terms of people who had actually read the book, I've been very encouraged on Amazon at least the last time I checked, There were about 70 reviews already, and I think it was 4.8 out of 5 stars or something. So that's like, you know, that's really good. I think so. I think that I've been very happy with the reaction so far."}
{"episode_id":"SW - #202 - 2021-11-24 - Christopher Kaczor & Matthew Petrusek - Jordan Peterson, God, and Christianity","start":2269.09,"end":2314.21,"speaker":"Matthew Petrusek","text":"I have as well. There is. Speaking personally, there is a kind of evangelical aspiration in this book that I think is fair to say for Chris as well, that we hope this book not only shows Christians how Peterson, I think, is an ally and a true ally and a very robust ally, but also those coming from the Petersonian side, as it were, who may be interested in Christianity because of him, that there is an ending to this story that illuminates the whole story and puts a foundation beneath it and makes it a true adventure. And so I'm hoping that the book has that effect with some people, and it appears it might be."}
{"episode_id":"SW - #202 - 2021-11-24 - Christopher Kaczor & Matthew Petrusek - Jordan Peterson, God, and Christianity","start":2314.29,"end":2387.71,"speaker":"Jonathan Pageau","text":"All right. Well, thank you for doing this. Thank you for your book and looking forward to seeing how people react to all of this. Everybody, check out the book. Thank you for your attention and we'll talk to you very soon. I hope you enjoyed this episode of the Symbolic World. The Symbolic World is based on a series of videos that you can find on my YouTube channel, Jonathan Pedro's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by, of course, leaving a review on itunes. Everybody knows that's the best way to get the podcast out there, to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon, the Pageau videos as well, and on SubscribeStar. All those links you can find on my website or in the show description. So thank you and I will see you soon."}
