{"episode_id":"SW - #282 - 2023-04-20 - Passover - Death of the Firstborn - Exodus 11-12","start":0.72,"end":2755,"speaker":"Jonathan Pageau","text":"In order for the coherence of the world to exist, that first part has to be sacrificed. And so why does it have to be sacrificed? The best way to understand it is that it has to be given up for things to exist properly. They have to exist in something which is beyond it if it's going to reach its highest potential. Its highest potential is something like giving itself to something that it's not. This is Jonathan Pedro. Welcome to the Symbolic World. I'm really excited to announce that we have just put up the new Symbolic World website. This new website, you know, marks the return of the blog, Symbolic World Blog, the return of the reading list, and also a brand new Symbolic World community which is accessible and will be hosted directly on the website. This community can be accessed by anybody who subscribed to the Symbolic World. For those who are who were already subscribed and supporting us, a different level of patronage, either through PayPal, Patreon or SubscribeStar or all you need to do is put in your email address, you will get a reset link for your password and you are in. And for everybody else, it seems like a good time to join the Symbolic World to access all these new things. We're also offering a few new gifts to everybody who subscribes, even at the level of free subscriber, just to thank everybody for all the support you have given us all through all these years. And I have to say, it's just beginning to. We will soon be announcing new courses. You know, Richard Rollin is preparing a course on Beowulf. There are all these new projects, the new Snow White project, God's dog and the symbolicworld.com will be the place to follow this and to get news and, you know, some. A few sneak peeks at what is coming in the future. So thanks everybody's support and like I said, we're just starting. So hello to all of you. It's been a while since I've come back to Exodus and since for me at least today it is Holy Thursday, I thought that going on the next step of my own Exodus comment would be a good idea. And we are looking at the last plague, which is the death of the firstborn. This is of course very much related to the Passover and to Pascha, to Easter for Christians as well. And so I'm going to look at the text in Exodus. We're going to talk a little bit about, you know, what some of the things that are going on. There's so many things happening in that text that I don't think I can address all of them, but at least the notion of the death of the firstborn, you know, why is this a part of the story and how it relates also to Pascha for Christians? Why is it that we know, we think the crucifixion is the final version of this story and what that means for us. And so as we start, we start in Exodus, chapter 11, I'm going to kind of read through it, you know, and then start to comment on it. And so the Lord said to Moses and Aaron in Egypt, this month is to be for you, the first month, the first month of your year. Tell the whole community of Israel that on the 10th day of this month, each man is to take a lamb for his family, one for each household. If any household is too small for a whole lamb, they must share one with their nearest neighbor. Having taken into account the number of people there are, you are to determine the amount of the lamb needed in accordance with what each person will eat. And so what's important to understand as you right now at the outset, is that this is of course related to the beginning, right? This is a new beginning. It is the new year. And so a lot of the symbolism is in the Passover will have to do with a new beginning, and it will have to do with a kind of purity. And then also the sacrifice of the firstborn is related to a new beginning in a strange way that we will see as we get there. And so it's important, the reason why it's saying that you need to calculate how much lamb you need for each person is that the idea is that you have to eat all the lamb, you can't leave any leftover. And that of course, is related to the notion of beginning or the creation of identity. Like we need the identity to be, to be manifested, the beginning to be clear, and we don't want there to be remainder. And so the animals you choose must be year old males without defect. And you may take them from the sheep or the goats, take care of them until the 14th day of the month when all the members of the community of Israel must slaughter them at twilight. Then they are to take some of the blood and put it on the sides and tops of the door frames of the houses where they eat the lambs. That same night, they are to eat the meat roasted over the fire, along with bitter herbs and bread made without yeast. Do not eat the meat raw or boiled in water, but roast it over a fire with the head, legs and internal organs. Do not leave any of it till morning. If Some is left till morning. You must burn it. This is how you are to eat it, with your cloak tucked into your belt, your sandals on your feet, and your staff in your hand. Eat in haste. It is the Lord's Passover. So there are a few things that are difficult, in my own estimation, to kind of understand, but there are a few things which seem to me pretty clear. Of course, the idea is that you have to eat the whole thing, and you also have to be ready. You have to be ready for this new beginning which is upon you, which means that, you know, you have to be girded. The idea of girding your loins, you know, we. We. It's a funny thing to think about, but you have to imagine people wear these robes and everything is kind of loose in there. But if you're going to do something definite, right, if you're going to do something that requires action and focus, then you need to hold things together down there. And this is not arbitrary. It has to do with, you know, gathering together things that are loose. And that is what is going on in the symbolism of a new beginning. You know, you kind of gather things together so that you have a focus, so you have an identity. So you have a new beginning with the beginning of this new year. And this has to do with the idea of fire, you know, the idea of cooking it with fire and the idea that none of it has to be left, that it has to be a holocaust, that it has to be fully consumed either by the people or by fire, so that there is no remainder, no leftover. And so, of course, we are looking at the fact that the Egyptians did not do this, did not take this. This lamb, and did not put the blood of the lamb on the pillars of the house. And so, you know, this idea of, you know, covering the. The posts of the door, the post of the entrance of the house with the blood of this lamb, which is the firstborn, which is this beginning, which is the new beginning. It's hard and it's obscure for us because it's so different from the way that we think. But if we kind of look at it, we can kind of see a glimmer of what is going on there. Why is it that this ritual of a new beginning, why it has to cover the door as a kind of identity, as an identifying mark marking those that are inside, you know, for this new beginning. So that when death comes and the end of Egypt comes, the end of the plagues come, then those that are marked by that identity will not be Taken over by death, you know, and so you can understand it just in terms of, you know, just in terms of how they. That is, in some ways, how we avoid death all the time, that is how we avoid fragmentation and breakdown and scattering is that we are marked by an identity. We're marked on the entrance, on the place that marks the limit between inside and outside. That's what the door is. There is a mark which binds us to that place and which binds us together. And so we can understand it in that way as a kind of identifying mark which is related to this new beginning and this identity which is. Which is burgeoning. So, you know, hopefully we can't completely see. I think for most of us, it's hard to kind of see through this, but, you know, there's enough, I think, to kind of understand what is going on here. So on that same night, I will pass through Egypt and strike down the ver. Every firstborn of both people and animals and will bring judgment on all the gods of Egypt. I am the Lord. The blood will be assigned for you on the houses where you are. And when I see the blood, I will pass over you. No destructive plague will touch you when I strike Egypt. And so, once again, the firstborn of Egypt, which represents the seed of Egypt, right? It represents. The firstborn, represents the identity, right? It is the first thing to break the womb. It is the first fruit of a union, the first fruit of a family. And this idea of first and identity is very much related to it. Think of, you know, the idea of the first in the sense of the first in hierarchy. Think of a king or something like that. That represents the culmination point of something, just as the beginning represents the origin of something. And so you can kind of understand why the firstborn is an image of Egypt itself, is an image of the seed of Egypt, you could say, right? The place where Egypt finds its name, its identity. And so this is what God will go for. But then it's also a judgment on the gods of Egypt, because those are related, right? The idea of the gods as the principalities and the idea of the firstborn as acting in a similar way, as a kind of principality, in the sense of the one who carries the father into the future, the one who carries the identity. You can kind of see how that works together. And the fact that the. That the Israelites have this blood of the lamb on their door, on the. As a mark between the inside and the outside means that they will be preserved in their identity, preserved in their seed as the Egyptians are being judged and being decimated. This is a day you are to commemorate for the generations to come. You shall celebrate it as a festival of the Lord, a lasting ordinance. Now, this seems obvious, you know, but I've pointed many times to the relationship between the idea of identity, the idea of that which marks inside and outside the common binding of a group or of any. Anything that recognizes that it has identity and the idea of celebration, but also of memory, right? These are, these, these themes are all related. And so God is telling them it's not just that you're going to do this, it's that you're going to do this, it's going to mark you in your identity, and then you are going to celebrate it every year. So you're going to mark time with this ritual, with this event, the event that is your new beginning, so that you can maintain that new beginning, right? It's something like, you know, it's the same thing with the idea of celebrating, you know, your national holiday or celebrating something which marks some origin for you, marks, you know, your identity. And by commemorating it and remembering it and celebrating it, you maintain its reality in your life. You make it participate in. In your life and make. Makes you remember, even though you're far away from the actual event that happened, you remember so that you participate. Right? So you can kind of understand the, the relationship between that, of course, and Christian communion as in some ways the ultimate memory or the ultimate participation. Because we, the Christian, let's say the Christian communion actually collapses. Collapses. The memory doesn't collapse it or it has perfect memory in the sense that we say it is the blood and body of Christ. It is in some ways a memory of it. But that memory is so full, right, that it becomes, it merges with the very thing. So it's like there's a paradox in it. It's like we do this in remembrance of the sacrifice of Christ, but we are participating in the sacrifice of Christ. And because it is in some ways the perfect sacrifice, and it is in some ways, you know, the actions of God himself, we enter into it fully in a way that brings it together completely, right? So it is both bread and wine, and it is at the same time the bread and the body and blood of Christ. At least in orthodox thinking we don't have exactly the same type of theology where we deny that it's bread and wine. We say it is bread and wine and it is the body and blood of Christ. And these things are coming together in this perfect memory, okay? So all of this of course, Will, like I said, all this kind of idea of remembering the Passover will be brought into Christianity at a different level. We could say, okay, so for seven days you are to eat bread made without yeast. On the first day, remove the yeast from your house, from whoever eats anything with yeast in it from the first day through the seventh day must be cut from Israel. On the first day, hold the sacred assembly and another one on the seventh day. Do not work at all on these days, except to prepare food for everyone to eat. Eat. That is all you may do. And so why the yeast? What's this yeast thing? So, of course, the yeast is a strange substance which you act, which is like. It's like a bug. You have to think of it like a bug. And this is something that my brother Matthieu has helped me really understand because he did it right. He learned to make bread and learned to play with yeast and learned to understand what yeast is. It is like a parasite. It's like this living thing, kind of bubbling living thing that you have to keep alive. And then you add that to the bread. And now what you've added to the bread is something like time. And you've also, because you have to wait now you put the yeast in now you have to wait for the bread to grow and to, like, manifest its fullness in time. You could say, but here, this is not what's going on. This is the beginning. This is the beginning of a new identity. And so it has to do with purity. And it's not the rising of the bread, right? It's not the bread that kind of has become full in time. It is the, like I said, it's the seed, it's the identity. It's the marking of the difference between Egypt and Israel, the marking of that identity. And so I think for sure, pretty sure, that that's why the notion that yeast. And of course, just practically, you can imagine they didn't have time, right? They were. They were going to now. The world was ending, this world was ending, this new world was beginning. And so they. Time kind of collapses. They don't have time to wait. They have to be ready. They have to be attentive, and they have to be. Be ready to leave Egypt as it is being consumed. And so all of this is not contradictory. Of course, there's a relationship between time and the. The, let's say, the strange or the parasite or that which comes from the outside, because it is an. It is an agent of increase, you could say, for the identity. And so if you if you struggle to understand that, I suggest again to read my brother's book, which is. Which is the best you can find on that. The language of creation. All right. And so celebrate the festival of unleavened bread, because it was on this very day that I brought your divisions and out of Egypt. Celebrate this day as a lasting ordinance for the generations to come. In the first month, you are to eat bread made without yeast from the evening of the 14th day until the evening of the 21st day. For seven days, no yeast is to be found in your houses. And anyone with a foreigner or native born who eats anything with yeast in it must be cut off from the community of Israel. Eat nothing made with yeast. Wherever you live, you must eat unleavened bread. Read. So it's pretty clear. The idea is you eat from the first month of the year. It's not clear to me why the days, though. I mean, of course all these things have meaning, but I don't totally understand why it is from the 14th day until the 21st day. And, you know, I'm sure it has meaning. Sadly, if anybody has a good idea of what the days mean in the months, I would love to read your comments and, and learn from you. But at least for me, I don't totally understand. But what I do understand is, you know, at the beginning, first month of the year, the beginning of this new identity, the celebration of this identity, all of this has to be done without that which comes from the outside. And if you eat that which comes from the outside, this leaven which is added to the bread, then you will be cut off from the identity. You'll be cut off from Israel, from the identity. So all of this is makes complete sense that Moses summoned all the elders of Israel and said to them, go at once and select the animals for your family and slaughter the Passover lamb. Take a bunch of hyssop, dip it into the blood in the basin, and put some of the blood on the top and on both sides of the door frame. None of you shall go out of the door of your house until morning. When the Lord goes through the land to strike down the Egyptians, he will see the blood on the top and sides of the door frame and will pass over that doorway. And he will not permit the destroyer to enter your houses and strike it down. Obey these instructions as a lasting ordinance for you and your descendants when you enter the land that the Lord will give you as he promised. Observe this ceremony. It's important to understand what it's saying. You know, it's relating the Passover, right, the end of this Egyptian time, the beginning of this new identity, to the moment when they enter into the land. Because in some ways, what they're doing now will only become fully active, will only become fully real when they become a nation and they take the land that God had promised them, you know, and so that's why it's important that it says, like, when you enter into the land that God has promised you, you have to obey the instructions and follow these ordinances. And when your children ask you what does this ceremony mean to you, then tell them it is the Passover sacrifice of the Lord who passed over the houses of the Israelites and in Egypt and spared our homes when he struck down the Egyptians. So remember, right, when your children ask you, remember, that is how you stay connected. That is how you maintain your identity, is by remembering the origin, remembering where you came from and doing that, celebrating that in also, even in ritual, in ritual participation, the people bowed down and worshiped. The Israelites did just what the Lord commanded. Moses and Aaron. Now, there's interesting in terms of structure too, in the text, because it's almost boring when you read it, because it's like, on the one hand, it tells you. On the one hand, it tells you what the rule is or what to do. And then the second hand is like, well, then they told them to do that, and then it's like. And then they did that, you know, but that's the structure of what's going on in itself. It's like, here's the pattern, here's the identity, here's the thing. And then it. It has to be enacted into the world, and there has to be memory of it in order for this to take hold and for. For. In order for it to remain real for the people that participate in it. At midnight, the Lord struck down all the firstborn in Egypt, from the firstborn of Pharaoh who sat on the throne, to the firstborn of the prisoner who was in the dungeon, and the firstborn of all the livestock as well. Pharaoh and all his officials and all the Egyptians got up during the night and there was a loud wailing in Egypt, for there was not a house without someone dead. During the night, Pharaoh summoned Moses and Aaron and said, up. Leave my people, you and the Israelites. Go worship the Lord as you have requested. Take your flocks and herds as you have said, and go. And also bless me. Very interesting way to end that sentence. You know, in some ways, the Pharaoh is recognizing what is happening at a very deep level. He's recognizing that the God of Israel has struck him, struck his nation and is founding this new nation. Doesn't totally understand it. Yes, but you understand that there's something new which is being born. And so that's why he doesn't just say go. He says, go, worship the Lord and also bless me. Interesting. So the Egyptian urged the people to hurry and leave the country, for otherwise, they said, we will all die. So the people took their dough before the yeast was added and carried it on their shoulders in kneading, throws, troughs, wrapped in clothing. The Israelites did as Moses instructed and asked the Egyptians for articles of silver and gold and for clothing. The Lord had made the Egyptians fairly disposed towards the people and they gave them what they asked for. So they plundered the Egyptians. And so I talked about this in the previous video. You can go look at that. I think in the last video I talk about the notion of plundering the Egyptians and what that means. The Israelites journey from Ramses to Sukkoth. There were about 600,000 men on foot. This is very important, that there were 600,000 men. The, the, the addition of six is important because it has to do with man himself. Right? It is in some ways a number of man. It is a number of work. It is the number that comes before the Sabbath number, before the seventh day. It is like it. It's a number of man. You could say, say. And so there were 600,000 men on foot. Besides women and children, many other people went up with them and also live large droves of livestock, both flocks and herds. With the dough the Israelites had brought from Egypt, they baked loaves of unleavened bread. The dough was without yeast because they had been driven out of Egypt and did not have time to prepare food for themselves. Now it's also important to understand, you know, that they do end up leaving with this mixed multitude. And so the problem of like, identity and mixture is all through the book of Exodus and the, the question of how that's going to come to a kind of balance, how we're going to balance the inside and the outside, the identity and the stranger is going to be all through. And so you're right, this idea, remove the yeast from yourself, you know, and also there's a sense in which I, I don't know, I don't think we've read it yet. No, we'll read it later. That, you know, only Israelites, only those that have been circumcised, that the outside flesh has been removed are allowed to participate in this identity. Only those that have removed their outer garments, their, their. Their participation in the, the yeast, you know, of the, of their dough or whatever. Like, sorry to use weird analogies, but just understand has to do with inside and outside. They have removed the outside skin. They are allowed to eat the unleavened bread and participate in the Passover, the Passover meal. And any stranger who wants to do that has to be circumcised in order to be able to do that. And so this is what we're going to kind of see, right? In some ways, even the circumcision of the mixed multitude into the story of Exodus, this is what's related. There are many waves of that you could say, of kind of weaning out the outsider, joining the outsider with the, with the Israelites in different ways. And so now the length of the time these Israelites people lived In Egypt was 430 years, 41. At the end of. No, at the end of 430 years, to the very day all the Lord's divisions left Egypt because the Lord kept vigil that night to bring them out of Egypt. On this night, all the Israelites are to keep vigil to honor the Lord for the generations to come. The Lord said to Moses and Aaron, these are the regulations, the Passover meal. And so here we have a third like regulation of the Passover meal. No foreigner may eat it. Any slave you have brought, may bought, may eat it after you have circumcised him. But a temporary resident or a hard worker may not eat, must be eaten inside the house, right? So take none of the meat outside the house. Think in the categories that I'm telling you, and you'll notice that all of these gestures are making sense. If we're talking about the creation of a beginning, the creation of an identity. Do not break any of the bones, right? Do not. Don't break the hard stuff inside. The whole community of Israel must celebrate it. So a foreigner residing among you who wants to celebrate the Lord's Passover must have all the males in his household circumcised. Then he may take part like one born in the land. No uncircumcised male may eat it. The same law applies both to the native born and to the foreigner residing among you. So this is very important in that in Israel, the identity of becoming an Israelite, the identity of, of joining into that covenant will be related to circumcision. That is, it is circumcision, which is a kind of baptism, which joins you and makes you a child of Abraham more than it is the idea that you're a physical descendant of. Of Abraham, right? You. You join in through a ritual act. This is something that, you know, in our own kind of biological thinking, we struggle to understand. But this is not something which would have been strange to ancient people in any way. All the Israelites did just what the Lord had commanded and Moses commanded Moses and Aaron. And on that very day, the Lord brought the Israelites out of Egypt by their divisions. Okay, and so now we move into chapter 12, which is going to be the strange consequence of the death of the firstborn and of the Passover. And it's going to kind of help us understand what is this death of the firstborn and how is it that it can be transformed in the proper way? How can it mean something more than just a kind of plague that comes in and kills the seed of the Egyptians? The Lord said to Moses, consecrate to me. Every firstborn male, the first offspring of every womb among the Israelites belonged to me, whether human or animal. Then Moses said to the people, commemorate this day. You came out of Egypt, out of the land of slavery, because the Lord brought you out of it with a mighty hand. Eat nothing containing yeast. Today in the month of Aviv, you are leaving when the Lord brings you into the land of the Canaanites, Hittites, Amorites, Hivites, and Jebusites, the land he swore your ancestors to give you, a land flowing with milk and honey. You are to observe this ceremony in this month. And then he repeats it again. You don't want any yeast in your borders on this day. Tell your son. I do this because of what the Lord did for me when I came out of Egypt. This observance will be for you like a sign on your hand and a reminder on your forehead that this law of the Lord is to be on your lips, for the Lord brought you out of Egypt with his mighty hand. This is a very, very. At least for Christians, this is a very profound little verse here. Because he's. He is. This is all coming together and referring to the notion of a mark, of a sign which marks the inside and the outside. This idea of a mark on your hand and a mark on your forehead will be taken up by Christians in the Book of Revelation as the mark of the beast. Like that's where the mark of the beast beast is. And here it is, in some ways, the same. It is saying that you. The observance, this memory of the beginning of your identity, the beginning of when you were separated from Egypt, when you became entered into the land that God promised you be entered into the covenant that God made with you, that you have to keep it as a sign. And you're on your head. That is the place you speak out of, the place you see, of the place of consciousness. You could say, and your hand, the place of your action. And then the law will be on your lips. And so, right. It's like it has to do with. With. It has to do with consciousness. It has to do with action, has to do with speaking. But it also is referring to the idea of the mark, right? That mark that is put on the lintels of the door is an extension of mark making itself. There's a weird relationship between that and the mark of Cain, which is put on Cain to protect him from death. And so God puts a mark on Cain to protect him from death. And now God puts a mark on Israel's door, on the place that separates inside and outside to protect them from death. It is something that might seem strange to you, but it is important to kind of understand that and to understand in some ways how in the story, the story of Christ, all of these. All of these will collapse. Let's say Christ will collapse all these. Christ will collapse all these. These. These categories into his own sacrifice. Okay. All right. So after the Lord brings you into the land of the Canaanites and gives it to you as he promised on oath to you, to your and your ancestors, you are to give over to the Lord the first, first offspring of every womb. All the firstborn males of your livestock belong to the Lord. Redeem with the lamb, every firstborn donkey. But if you do not redeem it, break its neck. Redeem every firstborn among your sons. In the days to come, when your son asks you, what does this mean, say to him, with a mighty hand, the Lord brought us out of Egypt, out of the land of slavery. When Pharaoh stubbornly refused to let us go, the Lord killeth the firstborn of people and animals in Egypt. This is why I sacrifice to the Lord the first male offspring of every womb and redeem each of my firstborn sons. And it will be like a sign on your hand and a symbol on your forehead that the Lord brought us out of Egypt with his mighty hand. So why is it that the death of the firstborn in Egypt is also pointing to the idea that all the firstborns belong to God? There's a very strange suggestion in this text, which is that the firstborn of the people and the Firstborns of the animals should be sacrificed to God. And that in order to avoid that, you redeem your firstborn with something else, right? You, you have a substitute for the, for something else. And, you know, it's, it's interesting because you see that, you know, in certain strands of theology, they'll try to make this related to, like, sin. And, you know, your sin is you deserve to die because you're sinful. But then, you know, something is substituted for that sacrifice. But that's not, not what seems to be going on here. There's no mention of sin. There's no mention of the law. You know, there's a sense in which the death of the firstborn or the giving of the firstborn to God seems to be at the very source of identity, seems to be at the very source of separating Israel from Egypt and making Israel the nation that it is worshiping God. And so why is it that the death of the firstborn is necessary? And so I'm going to give you one tack at that. It's not the only one. This is a very deep, deep subject. And so there are other ways to look at it, but I'm going to give you one. And it has to do with this idea of the highest point of something, the origin of something, you know, the top of the hierarchy. You could say in terms of, like I said, in terms of origin or in terms of first, in terms of that which carries the name further. Right? And so you kind of have this idea that, you know, a father has his firstborn. The firstborn is like the, the image of the Father, right? He's like the first fruit. He's the be. He's the new beginning. He's all of this stuff. And there's a sense in which in order for the, the coherence of the world to exist, that first part has to be sacrificed. And so why does it have to be sacrificed? The best way to understand it is that it has to be given up. It has to be given up to that which is before it. And so it's some ways, like the image of the first or the beginning of something has to be given to something which is even before something which precedes it. So why, why is that? And so it has to do with the way that the world exists. It has to do with kind of this fractal structure that I talk about all the time, which is that for things to exist properly, they have to exist in something which is beyond it. They, they always do anything that has unity. You know, if it's going to reach its highest potential. Its highest potential is something like giving itself to something that it's not, right? So an example that is easy to understand is in sports. So you have, let's say you're playing basketball, I use that a lot as an example. You're using basketball and you have different actions that you're doing. You have dribbling and you have the running and you have passing the ball and you have all these actions. And so the best of that, right, like the best of dribbling, the best of running, the best of passing the ball, the one that is closest to what you're doing has to be given to the purpose of basketball. It has to be sacrificed. It doesn't exist for itself. Dribbling for itself is just pointless and, and nothing. It has to be. It has to exist in that which is giving it its identity. And so you can understand that dribbling has to be sacrificed to the game of basketball in order for it to even have value. And so once you get that, you can kind of understand why it is that the firstborn, you know, the firstborn of something, the highest of something has to be given up. It's supposed to be sacrificed up to God in order to give the rest of the world value in order to anchor the value of everything else. Okay? And so you can understand it that way. There are different ways to understand it. There are ways to understand it that are very practical. You can understand, for example, that in terms of war, in terms of military. So the idea that you have to, in order for your country to exist, you have to accept sometimes that the best of your people will die for your country. They will sacrifice themselves, they will give themselves even unto death for the purpose of the country to exist itself, self. And that that sacrifice will anchor the existence of the, of the, of the family. And so. And that, for example, in, in the Christian world, it was often the idea that, you know, the families would hope that one member, one son would become a priest, for example. And so you think like, in terms of pure, kind of practical, you know, or first level evolutionary thinking, it seems like that's a contradiction. Why would you want your child to become a priest? It means you won't have grandchildren. It means your seed won't continue. But there's a way, a deeper way of understanding reality, which is that the highest part of, you know, the highest part or some aspect of the highest part has to be given up. And if it's given up, it will anchor the rest. And so if one of my child becomes a priest and prays for us, then it will hold my family together, right? And so you can understand, if you're not a religious person, you can understand it just like if there's one person that isn't bothered by all their own, like, personal family or whatever, but has. Is focused on a higher ideal, then that will anchor not just my family, but will also anchor society, will maintain a capacity to see through all the petty little things that I deal with and will ultimately kind of anchor my. My society together, my family, you know, the different things that I participate in. And so this can be seen in practical terms. But you can also understand why it could be ritualized, right? You can understand that, for example, when people harvested their grain, they knew that the best part, the first part, has to be sacrificed. You don't eat it. You. You sacrifice it for. So that the next year you can have another harvest. And, you know, and so you can understand how this type of gesture would easily become ritualized and that the ritualization of it would maintain it as a pattern in society. So if I know that I'm supposed to sacrifice my firstborn up to God, then it creates that pattern in my society where I understand the value of sacrifice, the need for sacrifice, the need to give up the best of what I have up to God. And so, you know, that can be something like the tithing for, you know, God talks about the first part, right? The first part of your earnings should go to God. There are different versions of that in the Bible that manifest different aspects of this idea that the first part has to be given up. And so, interestingly enough, what happens, though, is that there is an uneasiness about this, and there's a sense in which, you know, we can redeem the firstborn with something else. And so it's like instead of killing my own child, instead of sacrificing my child to God, then I will offer something that's lower on the hierarchy in order to substitute that. And so it's. It's a. It's a. It's a deeper ritualization, right? It's like, I. I know that this is important. I know that I do have to give up that which is the most important to me or that which is the highest, But I take something lower instead in order to. In order. Because there's something. I mean, why. Why does it. Why does it bother? It's like there's something wrong with what's going on. There's something that is imperfect about. About. In some ways, about this system. And I think that that's in some ways what Christ is coming to heal. Because what Christ ultimately says is that you don't sacrifice your children, you don't sacrifice, you sacrifice yourself. That's what you have to sacrifice. That's the highest part of yourself that you have to give up to God in you. And then that's the anchor of society. Not giving your son or your lamb or whatever, but that the secret behind all of these rituals is that you have to give yourself up. And that if you do that, then that becomes the best anchor for society. And that those that do that, if you think of the martyrs that don't give anybody else up except themselves, they become the seed for the church. And that, that type of behavior, whether it's the ascetics that give their life in prayer to God, you know, it's a. It is a kind of sacrifice, a kind of self sacrifice, which then becomes the seed for the church to exist and for society to kind of find their. Find a guide or find a, let's say, find beacons to look at in order to model our own behavior. And so now what happens, of course, in the story of Christ is that Christ takes up all this symbolism into the crucifixion. Of course, everybody knows that the crucifixion itself is happening during the time of Passover, right? This is what is going on. And so Christ becomes the Lamb that he becomes also the death of the Egyptians. He becomes both at the same time. And this is what makes that story so difficult to understand. Because in the story of the Egyptians, the way to understand it is something like if you don't give up the first part, if you don't give up the highest part to that which is above you, it will be taken from you, right? And that's just true, you know, if. Think about again, the basketball game. So if you just love to dribble and you just love to dribble and you don't know and you don't give up that action up to the game of basketball, then it's going to be pointless. It's going to be taken away from you. No one's going to want you to dribble. Like there's been no value in dribbling. It's going to lose its very value on its own. If you don't give it up. It's just going to happen. And that's true of everything, right? If, if you, for example, think that you're going to buy a nice car and a nice house and you think that Just doing that for itself. Like without putting your money or your riches to the service of a higher purpose, then at some point you're just going to lose it all. Maybe not the money, but you'll find yourself in a position where these things will not have any flavor for you anymore, right? Where the newest car with the newest girl will just not bring you any joy. Because it's not sacrificed, it's not given up towards a higher purpose, you know, and that's what you see, right? The cliche of the, of the, of the rich person or the movie star that has everything they want, but because they're. They. They have everything is in service of themselves and not in service of higher goods. Then they panic, you know, and they. Then they start to do things for charities or whatever, which is great, which is. Is what in some ways you would want to see happen. But that is the sign that if you don't give up, then it's taken from you. But what happens in the story of Christ is that it's just all kind of weirdly, it all collapses, right? So Christ is the one who receives, who on the one hand is the lamb that is given, but he's also the one that receives the. The wrath of the. Of God. And here I'm orthodox saying that who receives the. On the night of Passover, right? It's like the, let's say the dark thing passes and he's the one who gets it. So he also plays the role of the Egyptian children, the Egyptian firstborn. So he's the firstborn in every way. And then there's also the idea that this, you know, let's say, finishes the idea of sacrifice. And so after the, the death of Christ, very soon the whole sacrificial system will collapse, not just for Christians, but for Jews as well, you know, and, and the sacrificial system will cease to exist. Now, you can give excuses for why that happened in different. In different places, but if you understand the symbolism, what is going on on the cross, you'll understand that it is in a way that the culmination, but then also the end of the animal sacrificial system and the commemoration of the bread, right, that is eaten at the Passover becomes the sacrifice itself. Like it's joined with the sacrifice. And so all the symbolism gets crunched together in ways that is very. Like I said, it's hard. Like, if you keep thinking about it, I'm just giving you a few examples, but you. If you keep thinking about it, of how the crucifixion collapses. The symbolism of Passover crunches it all together. You're going to. You're going to find it very. You're going to find it very interesting. And so those are just a few thoughts, let's say, on the idea of the Passover, the relationship between the death of the firstborn. Why? Why? How it's related to the. The crucifixion a little bit. This is something I hope that you'll continue to think upon as we, at least for the Orthodox, as we come right up to Pasca. And so I hope you have a. A great end of Holy Week, and I will see you on the other side. Bye. Bye."}
