{"episode_id":"SW - #153 - 2021-04-12 - Sir Gawain and The Green Knight - Part 1","start":0.16,"end":899.19,"speaker":"Jonathan Pageau","text":"The tale of Sir Gawain and the Green Knight, although it is somewhat outside of the canon of Arthurian legend, is nonetheless one of the most known stories within these Arthurian stories. And so I want to look at the story of Sir Gawain, look at the symbolism that's there. I will probably make this video in two parts. The first part will be kind of explaining the setup of the story, tell you the story, the first part of the story, and then look at the symbolism that's involved in there. And in the next Patron Only video, we'll do the second part as well. This is Jonathan Peugeot. Welcome to the symbolic world. So I'll give you a basic sense of the story of the first part of the story. Of course, this is going to be very summery. If you're interested in this story. It's. It's very much worth reading. It's very well written. It's a. It's one of the finer of the medieval romances. And I don't know if you can call it a romance, but at least medieval legends or stories. And so the story starts in the court of King Arthur. And so King Arthur has these massive parties with all the knights of the Round Table. And the story is happening during Yuletide, during the time of Christmas, more specifically at the New Year. It is a New Year's feast. And it is customary for Arthur to not eat until he has heard of some story, some challenge, some adventure that his knights or the people in his court had. Had gone into. And so while this is happening, while everybody's kind of waiting to see what's going to happen, a giant green knight walks in to the castle. The story takes a lot of time to describe his armor, his clothing, his hair that is green and gold. And his horse is green. He is green, his clothes is green. Everything about him is green with gold ornamentation. So this green knight walks in and says that he wants to offer a challenge to the court of King Arthur. And his challenge is that he asks that one person in the court comes and takes one blow at his neck with his axe. And whoever is willing to do that will get a full blow at his neck on the promise that in the year that comes, that person will then accept to be dealt the same blow. And so everybody's kind of silent, everybody's kind of wondering what is going on this. This massive, giant green knight walking in and offering such a strange challenge. And so King Arthur is kind of waiting. And finally, because no one is speaking up, King Arthur speaks up. And you Know says that he is going to do it. And as he is getting ready to do it, Guinevere encourages Sir Gawain to propose himself as the one to take the challenge. So Sir Gawain accepts the challenge, walks up to the Green Knight, and the Green Knight places himself, exposes his neck. Gawain takes a swing, cuts the head off the Green Knight. But then the Green Knight reaches down, grabs his own head in his hand, gets back on his horse and says, in one year, exactly one year from now, you are to meet me at the Green Chapel in order to receive your blow. And the Green Knight leaves. And so then Sir Gawain waits the whole year very uneasily. Everybody is kind of uneasy about the situation, knows what is coming, wondering what's going to happen. And the whole story kind of passes through the seasons and then moves all the way to All Hallows Day, which is the. You know, it's after Halloween, the day after Halloween, All Hallows Day, the day where all the dead are. All the saints are celebrated and all the dead are celebrated in that period. And that is when the. That is when Gawain decides to go off on his journey and starts to move out in order to find the Green Chapel. And he goes out and moves into the forest and gets kind of lost in the forest, and he moves to North Wales, you know, which is understood at this kind of faraway place, you know, where all the Celts were pushed later on in medieval history. And so he kind of wanders through the forest, is lost and everything. And then finally he, on Christmas Eve, he perceives the light of a castle in the distance and goes and finds refuge in the castle. And in the castle is where the rest of the adventure is going to take part. But I want to focus just on the first part of Gawain's story right now and look at some of the symbolism that we already see in this story. So it's really important to understand the story of Sir Gawain, to understand the. The cycle of the year and the symbol of the year itself. And so Gawain, the Green Knight, appears at the Arthur's castle at New Year's. And so in the description, there's a description of yule tide of the time of, you know, during the Christmas season, but also the new year. And so we need to understand the moment where this happens as the end and the beginning of something. And so it's related, of course, to the solstice in terms of the day, the lowest day of the sun. It's related to this transition between the old and the new, the transition towards the new year. And so this is what we are seeing happening in this moment. And so the green night, it's difficult to be precise at what the green night means, but there is definitely a relationship between the green night and the idea of this primordial forest, the idea of the ancient world. And so if you know a little bit about medieval culture, you know a little bit about the green men and the. The notion of these green ornamental figures that were carved in churches and represent this kind of man made of foliage and a, you know, a kind of ancient primordial world, a world before. Before the Romanization, before Christianity. And I think that that's really what the green man manifests. We will learn later that he is actually doing this under the guise of Morgan le Fay, this witch, this kind of sorceress who is ambiguous and strange and also seems to represent a residue of the ancient world. There's also a relationship between the green man and Merlin from some of the stories where Merlin is represented as this wild man, as a, you know, as this wild man who lives in the forest. And so the. None of these associations are direct. They're somewhat indirect. There's also relationships to other, other cultures, other traditions which also use the notion of the green man. I think it is related to this, a figure in Islamic storytelling who is known as Al Qadir and who is a. A figure that appears in the Quran as posing enigmas to Moses. Moses meets this strange, mysterious figure who's not actually named in the Quran but who is named later in tradition. And the. The figure poses enigmas that, that, that Moses is not able to answer these very strange enigmas. And it's really. If you watch my video on the. The story of silence, you will see there's a connection in that story between Merlin and Al Qadir. And then also here in the notion of the green man, which is the posing of a mystery, the posing of something which is before logic and doesn't make sense and represents a world which is before the reasonable ordered world. And so you can imagine it as this kind of burst of the ancient world into the. The court of King Arthur. And this burst of the ancient world represents itself as this kind of primordial, wild, verdant green. The forest, it represents itself also as a challenge to order. A challenge to order which doesn't seem to make sense because the challenge is. Is a challenge which is illogical. The, the figure is saying, cut my head off. Right? That's the challenge Is. And so there's a strange contradiction in the challenge. Something which, like I said, precedes order, doesn't fit within the normal battle challenge that would usually appear right. The knight didn't come and say, fight me. He said, come and. And. And basically cut my head off. Which doesn't make sense, but it makes sense if you understand it. In the time of the transition between the old and the new, if you understand the cutting of the head of the green man as the solstice itself, as the cutting off of the old year, as the cutting off of the sun which is going down into the earth, you can understand what is happening moments. And so the challenge is for Gawain to chop the head off the old world to basically inaugurate the new year. And so there is a mystery in doing that, because in cutting off the head of the old, of the old and inaugurating the new, you throw yourself into a cycle you can understand it in. There are several stories that talk about this. For example, the story of the castrating of the God of heaven in Greek mythology, where you castrate the father God, the old God, the old legion of gods that aren't you. You castrate that. Sometimes it's a dismembering of an ancient figure, a dismembering of an ancient giant. There are different versions of the same story where you break apart, you dismember, you cut off the head of that which was before, and that is what launches the new year, because you, you basically cut the head off and you have this new body that you can reorganize into a new world. And so like I said, but once when you do that, you inaugurate the cycle of revolution. And so if you chop, if you castrate the father, the father God, then you are also going to be castrated afterwards. Maybe not castrated, you're going to be eaten by your father, right? So, so Saturn cuts the, the genitals off of his father, but then he ends up like, eating his children. But then that kind of flips. And so there's this weird, like, flip that keeps happening. And then finally Zeus ends up killing his father or, you know, dismembering his father or hurting his father or whatever. I forget actually how it goes, but it doesn't matter. The idea is this relationship between the old guard and the new guard. This is what we're seeing happening. And so Gawain cuts the head off the, off the, this ancient world. But then the, the challenge is that if he does that In a year at the solstice, once again, is when he is going to get his head cut off as well. Right? He has kind of thrown himself into that loop. And, and so that is what is happening. And you make sense in the story itself because as you see, it happens, the beginning of his quest happens at All Hallows. All Hallows is midway between the equinox and the solstice. And so it is in that moment because at the equinox you have this balance between the two day, the day and the night, right? You have this equilibrium, but it's an, it's a, it's an equilibrium which is going down. And so halfway between the equinox and the solstice is where you really would start to notice and you would really start to experience the diminishing of the days and the diminishing of the year. And so Gawain, as the one who cut the head off the previous year, is now going into the darkness and entering into the, the dark world, moving out into the margin where he is now going to experience getting his head cut off. And so as he approaches in the forest, of course he gets lost and he perceives the castle in the, in the distance. And what's going to happen in the castle is really going to be his going out into the margin and experiencing everything about being in the world of the margin, including a weird upside down reality in which he's going to get into. And. And it's going to also be a test of his identity, a test which he is going to. Not completely, he's not completely going to be the conqueror. In this test, he is going to give in a little bit. And this giving in is ultimately though going to end up turning back into his favor. And so we're going to look at the second part of the story of Sir Gawain and the Green Knight in my next Patron Only video. I hope you enjoyed this episode of the Symbolic World. The Symbolic World is edited by Justin Ward and it is based on a series of videos that you can find on my YouTube channel, Jonathan Pedro's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course, leaving a review on itunes. Everybody knows that's the best way to to get the podcast out there to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon Pageau videos as well, and on subscribestar, all those links you can find on my website or in the show description. So thank you and I will see you soon."}
