{"episode_id":"SW - #157 - 2021-05-08 - Monkey Man - The Emergence of Chimeras in Our Culture","start":0.08,"end":76.62,"speaker":"Jonathan Pageau","text":"So not very long ago, Rod Dreher from the American Conservative, as well as a few other media outlets, published a comment on an article on a scholarly article that talked about creating a human monkey hybrid in an embryo form. And they talk about how they did it, you know, the case. And they even use the word chimera, which is the ancient word they use to talk about these mythical monsters that were a mixture between different types of beings. And I want to look at this together with you, not for the shock value, not just because it's strange and it's odd, but because the symbolism that I talk about, there's something objective about it. And when I talk about being attentive to the signs, the signs of the end of something, the signs of the end of a story, these are objective and they will manifest themselves. There are different ways that that can happen, but they will happen. Symbolism really does happen. And this is particularly a case, a sign of the times, to help us see where we are in the story. This is Jonathan Peugeot."}
{"episode_id":"SW - #157 - 2021-05-08 - Monkey Man - The Emergence of Chimeras in Our Culture","start":77.02,"end":78.46,"speaker":"Justin Ward","text":"Welcome to the symbolic."}
{"episode_id":"SW - #157 - 2021-05-08 - Monkey Man - The Emergence of Chimeras in Our Culture","start":86.68,"end":765.13,"speaker":"Jonathan Pageau","text":"In the ancient world, in the story of Noah and the flood, in the traditions surrounding that especially, there is this idea that before the flood, or before the end of a world, there was a moment where there were hybrids, where there is a mixture between the sons of God and the daughters of men. Now, there are different interpretations of this. There are interpretations, we talk about the lineage of Cain mixing which with the lineage of Seth. And there are also interpretations that talk about how it is that angels, fallen angels, would have relationships with humans. But for our particular understanding, it doesn't matter that much which interpretation you follow, or if you even follow both interpretations. It's most important to understand that one of the aspects of the end of a world is hybridity. And this is not just something that you describe, but it isn't the very meaning of what it means for something to reach its end. I've talked about this many times before, but here we really have an example of a sign of the time that is helping us understand where we are and how the possibilities of a world will actually manifest the shape of reality. So the shape of reality is the notion of identity is based on the idea that there is a something which is one, whether it's a person, whether it's a nation, whether it's a community, whatever it is. There's a manner in which we are capable of seeing the unity. And this unity has a coherence. There's something which binds us together, something in common. We have something in common which binds us together. And as you move away from the most common or the elements that are their most, have the most in common, it lays itself out as a hierarchy. And as you move away from that, you reach certain idiosyncrasies and then ultimately you reach the buffer between that identity and other identities. And that buffer is a place of hybrids. Now, this can be true almost of any category. And so you, you can. Sometimes they don't necessarily manifest, but you can imagine, for example, you, you know, the modern world has actually been extremely good at trying to create these hybrid type of even hybrid objects where, you know, it's a flashlight and a pen at the same time. It's different things at the same time. It's two different identities that we can recognize that are kind of jammed into one identity. And this is what happens in the buffer of the world. And it laid itself out in the ancient cosmologies where on, in the middle you would have, you know, some founder, some God, some central figure that is the one that we all look toward to that brought down the law. For example, in the case of Moses, you know, that brought kingship, that brought unity somehow. And then as you move away from that person, you come to the edge where it's the place where you're in a border with what is foreign to you. And so imagine different countries, different empires, and on the border between different countries, then you will necessarily have hybridity. You'll have a mixture, right? If you live on the border between two countries, there you'll have people that intermarry between the two identities. It's just going to happen naturally. And there's a function for that. It acts as a buffer zone to create a little bit of space between two identities where, you know, where it isn't just a complete shutting off or complete cutting off. It's like a breathing space where you can actually get potential from the other identity. And so there's a, there's a kind of, there's a certain openness on the board, but it's on the border, right? It's not happening in the center. When I say that, a lot of people will all of a sudden be suspicious because they're noticing how the narrative of hybridity is taking over the world, right? We value hybridity. We value the idea of mixture in so many domains. Whether it is in terms of culture, the idea that we want to have all these different restaurants and different kinds of foods, different kinds of identities. All of this is something that we value. Usually that reality is, like I said, on the border, but now we're Pretty much embodying it in all of our culture. And just like in the time of the Flood, this was necessarily going to move into. Into extremes. We've already seen a form of chimera in the past. You know, the idea that they're injecting genes of animals into fruits or vegetables, the idea that they're using different genes from certain animals. Like, everybody probably saw the glow in the dark pigs that they created by using certain genes from phosphorus animals and then putting them into the pigs. And so we already seeing little versions of chimera. You've probably seen these weird images of people growing, like, let's say ears on rats and like all this kind of strange stuff that is happening. And so it was inevitable that it would come to the actual creation of a chimera. Just like as a world lays itself out on the edge of the world, there are monsters, there are things that don't fit into categories. As we value the monstrous, the. The exception, the hybridity. It was necessarily going to happen as what I say, like a sign of the times that we would actually go towards hybridity itself. In terms of human animal hybridity, you can see it almost as a layer lower, like, you can imagine, like the first cycle before the Flood as being kind of higher. We have the higher beings mixing with the lower beings. And. And then once again, you have higher beings mixing with lower beings, but at a lower level, where instead of. Instead of having gods mixing with human or angels mixing with humans, like you see in the Greek myths, for example, now you have the lower being, which is more the Minotaur version of hybridity, which is the, you know, the woman mixing with the bull in the myth. And then you see that right now with the idea of creating the hybrids. And so this problem of creating hybrids and creating monsters is, of course, it is very much the problem of a labyrinth. It is the problem where identity starts to fracture and it starts to break down, and it brings about a lot of chaos, but it's also going to bring about other strange things as well. And people are already talking about how the danger of doing that is to. It's like you're creating a lower form of being that will somehow be akin to you, but not completely. So you can imagine, like the creation of orcs or these monsters out of the ground. This is what is actually happening. And so people will say, well, it's just an embryo, it's just a fetus. It's not a complete person. First of all, the fact that they're telling this publicly means that They've done a lot of other things in. In private before letting this out publicly. So there might be things out there that we're not. That we're not aware of, because if they're willing to show this to us in public, then there are other things going on as well, and the narrative will play itself out. This is one of the things that I tried to bring up, is that once you start a certain series of events, once you engage in a story, then that story is going to play itself out. The characters might change, the people who embody the characters might change. And so, yes, this scientist that did that, maybe made the monkey human embryo, will not be. Necessarily be the one to go all the way and bring this being into the world in terms of being born, then it doesn't matter, because you've opened up a space and then someone else is going to go into that space. And. And then when you open up that space, then someone else is going to go into the other space. These things just will. Once you create a possibility, someone will come and inhabit that possibility. And so I just wanted to help you see that when I talk about the shape of the world and this idea that on the edge of the world are these monsters and are these exceptions and are all this weird stuff, and when I told you that we're going to see things that we haven't seen in thousands of years, this is already something that is on the horizon and that is appearing. That is the, the. The old mythological image of a chimera, right? The one that all the rationalists thought were just their imagination, were just this stupid thing that they imagined, that there were these beings that were a mixture of different identities and different, you know, centaurs and satyrs and all of these human hybrid characters, they're, they're. They will actually manifest. They might not look the way that they're represented in mythological storytelling, but they're going to exist in the world because that's where we are and symbolism happens. So I just wanted to put that out a little bit. I didn't want to insist on it too much, but I just wanted to point people to the fact that this is a serious thing, this question of how symbolic structures happen and lay themselves out. They're not just allegorical. They. They really do get embodied in the world. So we have to be careful. We have to be careful of the things that we put out in the world. We're not in control of what's being put out in the world, sadly. But it can also help you see that if we put out real stories into the world, if we put out the versions of the real story into the world, then that will also create a possibility that will be inhabited. And so as this entire world is going towards the, you know, the fallen angel, AI and hybrid human animal thing, realize that this is a sign of the times. Not arbitrary at all, but completely coherent with the way the world actually lays itself out. And for those who are attentive, we can understand what is happening and hopefully try to be. I try to be an antidote through telling better stories, being part of better stories, participating in the real world. And so thank you for your attention, everybody. Thank you for your support with everything that's been going on in the last few weeks after the Jordan Peterson discussion, a lot I've been putting out less videos. I was kind of overwhelmed by a wave of all kinds of questions and attentions and interviews, some of them you might not have seen, but requests for writing articles and requests for all this stuff. And so I'm just kind of surfing this wave. But I've got a lot of videos coming very soon. I ended up recording the whole kind of weird satanic Lil Nas x video. And I've got several discussions on the line as well, including with Vodolaskin, who wrote the novel Loras, that I'm extremely excited to have a chance to interview him because he also has this intuition that we're at a transition mode and we're entering a We're closer to a world that will be re enchanted once again. So thanks again. I'll talk to you soon."}
{"episode_id":"SW - #157 - 2021-05-08 - Monkey Man - The Emergence of Chimeras in Our Culture","start":765.77,"end":830.75,"speaker":"Justin Ward","text":"I hope you enjoyed this episode of the Symbolic World. The Symbolic World is edited by Justin Ward and it is based on a series of videos that you can find on my YouTube channel, Jonathan Pageau's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course leaving a review on itunes. Everybody knows that's the best way to get the podcast out there to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon Pageot videos as well and on subscribestar. All those links you can find on my website or in the show description. So thank you and I will see you soon."}
