{"episode_id":"SW - #365 - 2024-11-21 - Fr. Stephen De Young - Friedrich Nietzsche’s Guide to the Bodily Resurrection (Summit 2024)","start":0.16,"end":63.93,"speaker":"Laura Diaz","text":"Tucson, the Weight is Over Mediweight Loss they're officially open on North Oracle Road. That's right. No more counting down the days. You can walk in right now and start your journey to a healthier you. Hey, it's Laura Diaz from iheartradio and you can trust me. This isn't just another weight loss clinic. I know that because it's where I lost weight safely with real medical support. GLP1 medications. You can see them everywhere online right now. But the truth is your health shouldn't be a DIY project ordering these meds without the professional guidance. It can lead to dangerous mistakes, wrong doses, no oversight, and serious risks at mediweight loss. I got the same medication but with a customized plan, weekly check ins, and a licensed physician guiding me every step of the way. And the cost? The same as those risky online options. Tucson, your moment is here. If you're ready to take control, feel better and lose weight the right way, mediweight Loss is ready for you. Walk in, get started and see real results. Call or visit mediweightloss.com to learn more and book your free consultation today. That's mediweightloss.com pack up the because Chevy."}
{"episode_id":"SW - #365 - 2024-11-21 - Fr. Stephen De Young - Friedrich Nietzsche’s Guide to the Bodily Resurrection (Summit 2024)","start":63.93,"end":90.94,"speaker":"Announcer","text":"SUVs have the capability to take you to some incredible places. Like an adventure in the middle of in the Equinox Active, an SUV that will help you get away with confidence. Or head off for a night in the in Chevy Traverse with all the tech you need to stay connected. While the undeniable value of Chevy Trax will keep you moving from here to over here to way over here. Get to all the places you want to be with Chevy SUV's, see Watson or O'Reilly Chevrolet."}
{"episode_id":"SW - #365 - 2024-11-21 - Fr. Stephen De Young - Friedrich Nietzsche’s Guide to the Bodily Resurrection (Summit 2024)","start":91.5,"end":148.12,"speaker":"Fr Stephen De Young","text":"This very much changes how we would think of hell and of Christ saving us from it. Hell is not a place somewhere where a soul, whatever that is, goes, gets prodded with pitchforks, set on fire for an eternal succession of moments. Hell, then, would be the hell that we've made of our lives. Hell would be the hell that we've made of our experiences and our relationships. The hell that we've crafted through our own corruption and our own evil. Not only is that the hell that could become eternal if there's nothing else. But that's the hell that Christ saves us from. That's the hell that Christ sets us free from. That's the hell that Christ purifies us from and transforms us out of the hell we've made for ourselves."}
{"episode_id":"SW - #365 - 2024-11-21 - Fr. Stephen De Young - Friedrich Nietzsche’s Guide to the Bodily Resurrection (Summit 2024)","start":160.66,"end":230.56,"speaker":"Jonathan Pageau","text":"This is Jonathan Pedro. Welcome to the symbolic world. In early 2024, we put together, the very first Symbolic World Summit live in Florida. It was an amazing event with so many great speakers. Martin Shaw was there, Richard Rowland, Jordan Peterson, Deacon Nicholas Kotar, Vesper Stamper, Father Siloman Giustiniano. Who else? Who else? And of course, I was there and I spoke and I've brought my family and it was just a wonderful time. And so after all this time, we finally were able to put together all these videos in a video package, professionally done, very beautifully edited and easy access. And so for those who missed it, you can access it from the symbolicworld.com we'll post a link in the description. But in the meantime, we are decided to put up one of the talks, Father Stephen DeYoung's talk, to give you a little glimpse of what the event was like. And it was a wonderful talk about the afterlife and all of the big questions that we ask ourselves. And so please enjoy."}
{"episode_id":"SW - #365 - 2024-11-21 - Fr. Stephen De Young - Friedrich Nietzsche’s Guide to the Bodily Resurrection (Summit 2024)","start":231.28,"end":691.63,"speaker":"Fr Stephen De Young","text":"Ladies and gentlemen, Father Steven DeYoung. I was expecting him to just say, and now a man who needs no introduction. So that was nice. As an alternative, and it's good to be speaking to all of you at Peugeot Fest 24, which is the official name of this gathering, if you're not aware. So the topic I chose to talk about today when I told, well, when I first decided, before I even told Jonathan or anybody, what it was going to be, is something that was sort of out at the edge of my thinking at that time that I was still kind of working at. And fortunately it hasn't moved to the center of my thinking. But it's enough in the field that I feel comfortable and confident now sort of talking about it. If you ask the average person walking around, not even at a church, just person walking down the street, if you ask them about the afterlife or what happens when you die, you will get some version of, well, good people go to heaven, bad people go to hell. Maybe if they're very kindly, they'll leave off that last part, but usually get some version of that. Because everybody has somebody who they think is a bad person, a cousin or something, who they think really deserves to be in hell. And they'll differ on sort of how that judgment call is made, right? Like what makes you a good person or a bad person? There are all those variants. So if you're a little more acquainted with the Christian tradition, you know that that's not actually Christian eschatology, that's not the Christian view of what happens when we die. Even though a lot of Christians will talk that way an awful lot. We have at the end of the Nicene Creed, that we believe in the resurrection of the body and the life of the world to come, or the life of the age to come. And for a lot of us, and by a lot of us, including even a lot of theologians, what exactly that means, how exactly the bodily resurrection works with everything else. We think about what happens when we die, what the life of this world to come looks like, how to think it, how to try to envision or even imagine it. There's sort of no guidance out there. It's something we affirm, but I don't think we have a really firm grasp of what it means. And so to try to figure out what it means. If you've listened to or read any of my stuff, you kind of know I try to go back to the beginning of things, right? Where did this start? Who was the first person to start thinking this? How did they see it? How did they envision it? What did it mean for them? And so if we're talking about the bodily resurrection in terms of this grand scheme of things, I talk about where sometimes I go back into the Neolithic era, it's relatively new. It's relatively new, at least in terms of people talking about it in this way. It is inherited by Christianity, out of Judaism. But even within Judaism, if we're talking about the first century bc, the second century bc, this wasn't a universal sort of Jewish belief. This is something that arose specifically within Pharisaic Judaism. This is something that set the Pharisees apart from all the other countless sects of Judaism at the turn of the era. And so as they were first thinking about this, what was it that they meant? What were they thinking? That's what we're after. And for the record, just in advance, as people hear this talk, there's someone out there who is going to say, I heard you say something different in a Bible study in 2017. The answer to that question, before you ask it, is, I was wrong then, I might still be wrong now, but I was definitely wrong then. I have changed my mind. But so in order to get back, we have to sort of go back into the ground, right? Go back into the beginning, go back into the basis of this. And if we're going to go back into the ground on this or any other topic, I feel like we need a guy, a guide, someone to guide us, someone to take us there, someone to point it out to us. Virgil is boring. It's not his fault. It's because Latin is boring. You could boo, but stop me when I tell a lie anyway, so we need a Greek, we need a German, right? One of the two to guide us back. And so I've chosen someone who, at the very least, is never boring, and that's Friedrich Nietzsche. So the shade of Friedrich Nietzsche is going to lead us back into the ground to help us understand the bodily resurrection. I can see that some of you are confused, but this is going to work, I promise. So the first thing we have to address is we have that word bodily in front of resurrection, the resurrection of the body. This is a distinctive. This is depending on the era we're talking about. If we're talking about the first, say, four centuries of Christianity, this is something that distinguishes orthodox Christianity from, say, Gnostic sects and groups who believed in a kind of resurrection, who believed in a kind of eternal life, but that was decidedly not bodily, decidedly disassociated from this world, this earth, this life. And so the word bodily is serving a function here. But the way we normally think about this is, well, okay, at some point in the future, Christ returns, my physical body gets pulled back together and my soul comes and reinhabits it, like my soul's off floating somewhere else. And then it comes back down and comes back into my body, and it's my body. There are a bunch of sort of obvious problems when we start pushing at that, though, because, for example, the matter that makes up my body today is a completely different set of matter than what made up my body 10 years ago."}
{"episode_id":"SW - #365 - 2024-11-21 - Fr. Stephen De Young - Friedrich Nietzsche’s Guide to the Bodily Resurrection (Summit 2024)","start":693.62,"end":693.86,"speaker":"Jordan Peterson","text":"Right?"}
{"episode_id":"SW - #365 - 2024-11-21 - Fr. Stephen De Young - Friedrich Nietzsche’s Guide to the Bodily Resurrection (Summit 2024)","start":695.06,"end":732.12,"speaker":"Fr Stephen De Young","text":"And once I die, my body will decompose, right, and will become part of plants and trees and snails and all sorts of things, eventually, maybe someone else's body. So what does it mean to say that the body that I will have for eternal life is my body, is the same body as this body? Now, this is kind of an open question or a puzzle. So this is the first place."}
{"episode_id":"SW - #365 - 2024-11-21 - Fr. Stephen De Young - Friedrich Nietzsche’s Guide to the Bodily Resurrection (Summit 2024)","start":734.2,"end":734.48,"speaker":"Jordan Peterson","text":"Where."}
{"episode_id":"SW - #365 - 2024-11-21 - Fr. Stephen De Young - Friedrich Nietzsche’s Guide to the Bodily Resurrection (Summit 2024)","start":734.48,"end":988.22,"speaker":"Fr Stephen De Young","text":"Our friend Nietzsche may help us. To the despisers of the body will I speak my word. I wish them neither to learn afresh nor teach anew, but only to bid farewell to their own bodies and thus be dumb. Body am I, and soul, so saith the child. And why should one not speak like children? But the awakened One, the knowing One, saith, body am I entirely and nothing more. And soul is only the name of something in the body. That's from Thus Spake Zarathustra, his fourth discourse. Part of our problem here is that we've adopted this Platonic view of the soul. We've adopted this view that the soul is our real Self, that it is this existing thing that inhabits our body. And this has a bunch of effects on how we see the body, how we see ourselves, how we see the world. A very practical one is if my soul, the soul that inhabits my body is me, that's the actual me. I have disassociated my identity, who I am from my body. My body is now no longer who I am. Really. If you ever wondered how someone could get the idea that they are in the wrong body. There you go, There you go. But this is not how the Jewish tradition saw the soul. There are a lot of ways that we can see this in the Hebrew scriptures. One of them is that very often the speaker will talk to his soul. Bless the Lord, O my soul. Well, if you are your soul blessing, who is it who's talking in that psalm? The soul was seen not as this existing thing, this existing nebulous thing, like a force ghost in Star wars or something, or a sphere. If you're origin. Any originists out there, don't put your hand up, you'll get flagged, right? But the soul was the life of a body, as Nietzsche alludes to there. The soul is something in the body. The soul is what is making the body alive, making it function. This is very practical. When you see someone or even an animal die, you are looking at the same set of matter you were seconds ago when it was alive. But the life is what is gone. The life is what is gone. And this means something very important about identity. It means identity is not an inward thing. We're used to looking at identity as if we were adolescents. When you're an adolescent, what makes me me is what makes me different than everybody else, right? You go and you get the T shirt at Hot Topic. It says, you laugh at me because I'm different, but I laugh at you because you're all the same. And no one understands your pain, especially your mom and dad, right? But a lot of us don't outgrow that."}
{"episode_id":"SW - #365 - 2024-11-21 - Fr. Stephen De Young - Friedrich Nietzsche’s Guide to the Bodily Resurrection (Summit 2024)","start":990.06,"end":990.46,"speaker":"Jordan Peterson","text":"Right?"}
{"episode_id":"SW - #365 - 2024-11-21 - Fr. Stephen De Young - Friedrich Nietzsche’s Guide to the Bodily Resurrection (Summit 2024)","start":990.7,"end":1035.77,"speaker":"Fr Stephen De Young","text":"What makes me me is the way that I'm not my parents, the way that I'm not my family of origin, the way that I'm not whatever's going on in society, the way that I'm different than everyone else, this is an abstraction. We move inward. And this ends in nihilism. Because when you abstract every connection you have everything you've inherited, everything you've learned, everything that you're a part of, you're left with nothing. Your identity is nothing. There's this brief stage where identity Becomes completely protean, where it can change every day. That's kind of fun for a while."}
{"episode_id":"SW - #365 - 2024-11-21 - Fr. Stephen De Young - Friedrich Nietzsche’s Guide to the Bodily Resurrection (Summit 2024)","start":1037.94,"end":1038.18,"speaker":"Jordan Peterson","text":"Right?"}
{"episode_id":"SW - #365 - 2024-11-21 - Fr. Stephen De Young - Friedrich Nietzsche’s Guide to the Bodily Resurrection (Summit 2024)","start":1038.9,"end":1305.38,"speaker":"Fr Stephen De Young","text":"But eventually you realize that it being able to change every day means it is actually nothing in particular. And that is a bad point to reach. So if identity is more concerned with your body, your soul is what is giving your body life, then that means we find our identity outside of ourselves, not by delving inside ourselves. We find our identity in the relationships that we have to our family of origin, to our society and our culture, to our friends and loved ones. These are the things that make us who we are. These are the things that make us who we are. And these are always, for the record, something chosen. One possible objection to this idea, one reason people don't like it, is they say, well, all those things were just given to me. I didn't choose them. I want to choose who I am by rebelling against those things. I didn't choose what family I was going to be born in. I didn't choose what country I was going to be born in, what culture I was going to inherit, what religion I was going to be raised in. I didn't choose any of those things. But ultimately we do choose all of those things. Even if you were married off at age 13 in an arranged marriage to someone you never met before that marriage, you choose to be a husband or wife not just every day, but a countless number of times during each day. You can do otherwise, you can move, you can object. So all these things are ultimately chosen. But it is all of these external things related to our body, related to our interactions and connections with other people in community, that define who we are. Why is this important to the concept of the bodily resurrection? This is important to the concept of the bodily resurrection, because this is why the bodily resurrection is so important, that it's bodily. We're not talking about identical matter coming back together to form a physical space for a soul to inhabit. We're talking about your identity continuing to exist, you continuing to be you in every way. This means not only the maintenance of those sort of relationships, but that maintained is the way that we are formed. What we have come to know, what we have come to think, how we have come to think about things and see the world around us. Now another part of this, a part of this that we haven't thought, the part that's really the focus of the talk this morning, the part that I've been trying to think over the last year especially, we've thought about this in terms of space. What do I mean by that we have this idea of the bodily resurrection that. Well, that means, right, this body, or at least a body like it, this world, or at least a world like it, right? We make these affirmations in the Christian tradition. No, it is this world that will be redeemed. It is this body that will be redeemed. It is this creation that will be redeemed. It's not going to be destroyed and done away with and replaced with something else. It's not going to be destroyed and done away with and replaced with nothing in some kind of ephemeral, ghostly existence. But I don't think we've really reckoned with how this relates to time, how this relates to time. Because part of that view we have in our head is that, well, after this bodily resurrection happens, however we conceive."}
{"episode_id":"SW - #365 - 2024-11-21 - Fr. Stephen De Young - Friedrich Nietzsche’s Guide to the Bodily Resurrection (Summit 2024)","start":1305.38,"end":1305.66,"speaker":"Jordan Peterson","text":"It."}
{"episode_id":"SW - #365 - 2024-11-21 - Fr. Stephen De Young - Friedrich Nietzsche’s Guide to the Bodily Resurrection (Summit 2024)","start":1307.5,"end":1511.6,"speaker":"Fr Stephen De Young","text":"Then eternal life means we're going to have this eternal succession of moments, right? It's going to be like this with all the bad stuff gone, but just going on forever. Just going on forever. This creates a lot of issues that it doesn't solve. They kind of dealt with this. I don't know if anybody here watched the Good Place back when it was on tv, but they kind of dealt with this, right? Because they had a very materialist view of heaven on the show. But so ultimately, all of the characters, spoilers end up in what sort of heaven, right? And everything is wonderful and everything is beautiful and every day is beautiful weather, and everything is good. But time continues as it does here. And so at a certain point, at a certain point, that's not bliss anymore, right? That's not joy anymore. At a certain point, I think, equally importantly, what does that do to our understanding of this life, this life that we live in this age, in this world now, at some point, to paraphrase one of the latter verses of Amazing Grace that nobody sings, they just do the first one over and over again or play it on the bagpipes at a funeral. But, you know, when we've been there for 10,000 years, we'll have no less days left to sing God's praise than when we'd first begun. Just an unending praise chorus for at least 20,000 years, right? And then what does that mean about the 60, 70, 80 years I spent on this earth going through all this and doing all this? Well, that will be long forgotten by then, right? Who will even care? Distant memory, right? Distant memory. And if we envision that we're going to be there with Christ and we see the resurrected Christ in the gospel still has his wounds from the cross. That'll seem a little odd that he went through all that in this world, oh, way back when we barely remember. Doesn't fit. It doesn't fit. Nevertheless, in this life, in this world, our identity, who we are, if it's formed externally in this way, in relation, that's something that happens over time. Our life in this world is not just spread out across space."}
{"episode_id":"SW - #365 - 2024-11-21 - Fr. Stephen De Young - Friedrich Nietzsche’s Guide to the Bodily Resurrection (Summit 2024)","start":1514.47,"end":1514.63,"speaker":"Jordan Peterson","text":"Right?"}
{"episode_id":"SW - #365 - 2024-11-21 - Fr. Stephen De Young - Friedrich Nietzsche’s Guide to the Bodily Resurrection (Summit 2024)","start":1514.63,"end":1535.99,"speaker":"Fr Stephen De Young","text":"That we move about, right. And we're at different places at different times, but it's spread out in time. Those relationships are formed over time. I was not always a husband. That is part of my identity now, but I wasn't always one. In terms of my experience of time. I wasn't always a priest."}
{"episode_id":"SW - #365 - 2024-11-21 - Fr. Stephen De Young - Friedrich Nietzsche’s Guide to the Bodily Resurrection (Summit 2024)","start":1539.68,"end":1603.58,"speaker":"Laura Diaz","text":"Tucson, the Weight is over Mediweight Loss they're officially open on North Oracle Road. That's right. No more counting down the days. You can walk in right now and start your journey to a healthier you. Hey, it's Laura Diaz from iheartradio and you can trust me. This isn't just another weight loss clinic. I know that because it's where I lost weight safely with real medical support. GLP1 medications. You can see them everywhere online right now. But the truth is, your health shouldn't be a DIY project ordering these meds without the professional guidance. It can lead to dangerous mistakes, wrong doses, no oversight, and serious risks. At mediweight loss. I got the same medication but with a customized plan, weekly check ins and a licensed physician guiding me every step of the way. And the cost? The same as those risky online options. Tucson, your moment is here. If you're ready to take control, feel better and lose weight the right way, Mediweight loss is ready for you. Walk in, get started and see real results. Call or visit mediweightloss.com to learn more and book your free consultation today. That's mediweightloss.com pack up though, because Chevy."}
{"episode_id":"SW - #365 - 2024-11-21 - Fr. Stephen De Young - Friedrich Nietzsche’s Guide to the Bodily Resurrection (Summit 2024)","start":1603.58,"end":1630.55,"speaker":"Announcer","text":"SUVs have the capability to take you to some incredible places. Like an adventure in the middle of in the Equinox, Active, an SUV that will help you get away with confidence. Or head off for a night in the in Chevy Traverse with all the tech you need to stay connected. While the undeniable value of Chevy Trax will keep you moving from here to over here to way over here. Get to all the places you want to be with Chevy SUV's. See Watson or O'Reilly Chevrolet."}
{"episode_id":"SW - #365 - 2024-11-21 - Fr. Stephen De Young - Friedrich Nietzsche’s Guide to the Bodily Resurrection (Summit 2024)","start":1632.87,"end":2270.09,"speaker":"Fr Stephen De Young","text":"Don't wish you met me when I was 15. I was a problem, right? But that's part of who I Am too right, but comes out once in a while. But our identity is formed across this section of space and this section of time. That means that in some sense, for the bodily resurrection to be real, for our identity to be preserved in the world to come in eternal life, it's not just a question of the external physicality needing to be preserved. In some sense, that time, the time of our life in this world has to be preserved. The actual concrete moments in which the bonds between me and other people were forged, the actual experiences that we shared. I can't be a husband without my wife. I can't be a priest without the church. And so these concrete moments also have to, in some sense, continue to exist. And so it's not just a question of the bodily resurrection and the life of the age to come. Being this body in this world, that's our starting point. But it also has to be a preservation of this time. It has to be an eternalizing of this life that I actually led. Not this life in a broad sense, but this life that I actually led in this world. So here's the second place where the shade of our friend Nietzsche shows up and has a few things to say to us. What if some day or night a demon were to steal after you into your loneliest loneliness and say to you, this life as you now live it and have lived it, you will have to live once more and innumerable times more, and there will be nothing new in it but every pain and every joy and every thought and sigh, and everything unutterably small or great in your life will have to return to you all in the same succession and sequence. Would you not throw yourself down and gnash your teeth and curse the demon who spoke thus? Or have you once experienced a tremendous moment when you would have answered him, you are a God, and never have I heard anything more divine. That's from the gay science section 341. And that bit of Nietzsche is referred to as the eternal return or eternal recurrence. He had this idea. Did he think it was metaphysically real? What does that even mean in this case? But he presented this as this view that essentially everyone repeats their life over and over and over again an infinite number of times. And he is at least using it. He's at least presenting it as sort of a test to give yourself regarding your life. And he's saying here, is there a moment in which you could look at that not as a horrible curse, right? Is there a moment where that would not be your nightmare? Is how he's presenting it. When he writes, thus spake Zarathustra, he says, the whole thing is a meditation on this idea. And so not at the conclusion, but near the conclusion, we'll hear from him. Once again, there's a dialogue going on. These are a couple of excerpts between who he calls the ugliest man and Zarathustra. My friends, all of you said the ugliest man, what think ye for the sake of this day? I am for the first time content to have lived mine entire life and that I testify so much is still not enough for me. It is worthwhile living on the earth. One day, one festival with Zarathustra hath taught me to love the earth. Was that life? I will say unto death, well, once more, my friends, what think ye? Will ye not like me say unto death, Was that life for the sake of Zarathustra? Well, once more. Later, Zarathustra gets drunk. He sings a song. This is part of it. All joy wanteth the eternity of all things. It wanteth honey, it wanteth lees, it wanteth drunken midnight, it wanteth graves, it wanteth graves. Tears, consolation, it wanteth gilded evening red. What doth not joy want? It is thirstier, heartier, hungrier, more frightful, more mysterious than all woe, it wanteth itself, it biteth into itself the ring's will Writheth in wanteth. Love, it wanteth hate, it is over rich, it bestoweth, it throweth away, it beggeth for someone to take from it, it thanketh the taker, it would fair be hated. So rich is joy that it thirsteth for woe, for hell, for hate, for shame, for the lame, for the world, for this world. O ye know it indeed, ye higher men. For you doth it long this joy, this irrepressible blessed joy. For your woe, ye failures. For failures longeth all eternal joy. For joys all want themselves, Therefore do they also want grief. O happiness, O pain. O break thou heart. Ye higher men, do learn it that joys want eternity. Joys want the eternity of all things. They want deep, profound eternity. That's from Thus Spake Zarathustra, the Ninth Discourse. What Nietzsche is saying is, if we've truly experienced joy in our life, those moments, those joys, those are what would inspire a person to be able to look at his idea of the eternal recurrence of the same as a hope and not as a curse. Because for the sake of that joy, one could accept the pain, the struggles, the heartbreak of this life in order to have that joy. Again, what if. What if the resurrection of Christ represents the triumph of joy? What if what it means is that joy has now become eternal without accepting the rest. Joy has become eternal, putting to death the rest, the pain, the heartbreak, the sorrow. This is what I mean concretely by that. What if when we talk about living an eternal life in which there is no more sorrow or sighing or pain, what our forefathers were really talking about was eternally living this life without sorrow and sighing and pain. They were talking about the actual times that we live, the actual moments we experience, all of them that are blessed, all of them that are permeated by God's love, all of them that are filled with joy, those become eternal, those become the life that we have forever. And everything else is burned away, everything else dies away, everything else is thrown away. This would mean a number of things. This very much changes how we would think of hell and of Christ saving us from it. Hell is not a place somewhere where a soul, whatever that is, goes, gets prodded with pitchforks, set on fire for an eternal succession of moments. Hell, then would be the hell that we've made of our lives. Hell would be the hell that we've made of our experiences and our relationships, the hell that we've crafted through our own corruption and our own evil. Not only is that the hell that could become eternal if there's nothing else, but that's the hell that Christ saves us from. That's the hell that Christ sets us free from. That's the hell that Christ purifies us from and transforms us out of."}
{"episode_id":"SW - #365 - 2024-11-21 - Fr. Stephen De Young - Friedrich Nietzsche’s Guide to the Bodily Resurrection (Summit 2024)","start":2272.74,"end":2272.86,"speaker":"Laura Diaz","text":"The."}
{"episode_id":"SW - #365 - 2024-11-21 - Fr. Stephen De Young - Friedrich Nietzsche’s Guide to the Bodily Resurrection (Summit 2024)","start":2272.86,"end":2816.14,"speaker":"Fr Stephen De Young","text":"Hell we've made for ourselves. I'm going to read a couple of passages from the Scriptures that I think this understanding sheds light on. This is from First John 5, verses 11 through 13. And I'm going to translate this. You've heard this translated a little differently because the phrase in Greek that's usually translated in our English Bibles, eternal life doesn't have an article in it anywhere, meaning it's an arthros. That's the technical term meaning normally when we have adjective noun phrases like that in Greek, we put the indefinite article A or N in front of it. So I'm going to translate this that way. And this is the testimony that God gave us an eternal life. And this life is in His Son. Whoever has the Son has life. Whoever does not have the Son of God does not have life. I write these things to you who believe in the name of the Son of God, that you may know that you have an eternal life, regardless of how you translate it, St. John is speaking in first the perfect and then the present tense. Not you will have eternal life in the age to come. But you've been given it, and you have it now. The life you have now in Christ has. Has this adjective attached. It has now become eternal. It has now become timeless. This is from St. Paul, 1 Corinthians 3, 11, 15. For no one can lay a foundation other than that which is laid, which is Jesus Christ. Now, if anyone builds on the foundation with gold, silver, precious stones, wood, hay, straw, each one's work will become manifest, for the day will disclose it, because it will be revealed by fire, and the fire will test what sort of work each one has done. If the work that anyone has built on the foundation survives, he will receive a reward. If anyone's work is burned up, he will suffer loss, though he himself will be saved, but only as through fire. We may be used to reading that with a whole bunch of old Western theological baggage that the works here is talking about some kind of system of merit and demerit that's attached to actions we take, to things we do. And we're going to be issued a repayment for those merits or demerits. But let me submit that the word works there. Let's take it out of our sort of English and Latin sensibilities and go for Greek, where it's more of a verbal idea. It's talking about not just the things we do, but us doing them, the moments in time and space where we do these things. Then the judgment that's happening here are all those works, all of those things that we did, experiences that we had, choices we made, that are wood, hay, straw, junk, garbage, dross are burned away. All of those moments in time, those moments of connection, those moments of love, of joy, of peace, they are refined, made eternal, made permanent. There's an old Russian folktale. I figure this is a good crowd to tell an old Russian folktale to. This old Russian folktale that there was this very bitter, miserable old woman, hated everyone in her village. No one in the village was all that fond of her horrible, mean, nagging wife, to her husband beat her children, selfish, stubborn, angry. When she died, the priest in her village said, we need to pray for her. We need to pray for her, for her soul. We need to pray for her that she'd be forgiven her sins, especially because of the kind of life she lived. So they prayed. God heard these prayers. There was one moment in her life where she showed kindness. There was one moment in her life where a beggar came and asked her for food. She had just gotten some food. She gave the beggar an onion, Just this one moment. And so in the story, an angel takes that onion and he goes down to hell, and he extends the onion toward her, and he's going to use that onion to pull her out of hell, this one moment in her life. And she immediately grabs the onion, says, my onion, and remains. I told you, it's a Russian folktale. You should have seen that coming. But think of what's going on there. There was this one moment in her life, even though it was only that one, that she could have inhabited that one moment of generosity, she could have inhabited that eternally had she not sort of pushed it away from herself. Had she not sort of pushed it away from herself. So the idea of bodily resurrection then, especially if we start thinking it this way, helps us kind of navigate between sort of Scylla and Charybdis, again, the right crowd to make a reference to this Scylla and Charybdis of, on the one side, a kind of Gnosticism that wants to say this world, this life, our bodies, everything that happens here is unimportant and irrelevant. Something to be escaped, something to be just overcome and superseded. And on the other side, actually, reincarnation, Reincarnation. The idea that we get a sort of infinite number of tries at this until we eventually get it right. In between those two, we have this one life, this one life to live, to become who we are with the promise in Christ that who we are and who we become in this life that will become eternal, this life that we live will become eternal. And into that Christ then further speaks the word that we can change, that we can be transformed, that at whatever point we realize we've been living in hell and we don't want to live in hell one day more, let alone eternally, that he sets us free to live a different kind of life for the rest of our days, however many that may be. That gives us a time and a space then that we can inhabit with him for eternity. So those have been my thoughts about the bodily resurrection, as Dietzsche has kind of helped me, hopefully kind of helped us today. It's a different way of thinking it, and I'm still kind of playing it out, but I hope it will get you thinking as it's gotten me thinking. Right. We can all kind of keep doing the work from here in terms of how we conceive it."}
{"episode_id":"SW - #365 - 2024-11-21 - Fr. Stephen De Young - Friedrich Nietzsche’s Guide to the Bodily Resurrection (Summit 2024)","start":2820.14,"end":2821.42,"speaker":"Jordan Peterson","text":"Father Stephen DeYoung."}
{"episode_id":"SW - #365 - 2024-11-21 - Fr. Stephen De Young - Friedrich Nietzsche’s Guide to the Bodily Resurrection (Summit 2024)","start":2824.94,"end":2887.6,"speaker":"Laura Diaz","text":"Tucson. The weight is over Mediweight loss. They're officially open on North Oracle Road. That's right. No more counting down the days. You can walk in right now and start your journey to a healthier you. Hey, it's Laura Diaz from iheartradio and you can trust me. This isn't just another weight loss clinic. I know that because it's where I lost weight safely with real medical support. GLP1 medications. You can see them everywhere online right now. But the truth is, your health shouldn't be a DIY project ordering these meds without the professional guidance. It can lead to dangerous mistakes, wrong doses, no oversight, and serious risks. At mediweightloss, I got the same medication but with a customized plan, weekly check ins, and a licensed physician guiding me every step of the way. And the cost? The same as those risky online options. Tucson, your moment is here. If you're ready to take control, feel better and lose weight the right way, mediweight loss is ready for you. Walk in, get started and see real results. Call or visit mediweightloss.com to learn more and book your free consultation today. That's mediweightloss.com to design the Lexus ES."}
{"episode_id":"SW - #365 - 2024-11-21 - Fr. Stephen De Young - Friedrich Nietzsche’s Guide to the Bodily Resurrection (Summit 2024)","start":2887.76,"end":2889.6,"speaker":"Jordan Peterson","text":"All we had to do was listen."}
{"episode_id":"SW - #365 - 2024-11-21 - Fr. Stephen De Young - Friedrich Nietzsche’s Guide to the Bodily Resurrection (Summit 2024)","start":2889.92,"end":2895.84,"speaker":"Fr Stephen De Young","text":"Your ears said exactly where to put the speakers. Your eyes told us where to put the available head up display."}
{"episode_id":"SW - #365 - 2024-11-21 - Fr. Stephen De Young - Friedrich Nietzsche’s Guide to the Bodily Resurrection (Summit 2024)","start":2896,"end":2902.48,"speaker":"Jordan Peterson","text":"Hey Lexus, find me an alternate route. Even your right foot helped out. It let us know you'd enjoy a little more torque."}
{"episode_id":"SW - #365 - 2024-11-21 - Fr. Stephen De Young - Friedrich Nietzsche’s Guide to the Bodily Resurrection (Summit 2024)","start":2903.28,"end":2907.36,"speaker":"Fr Stephen De Young","text":"Turns out you had a lot to tell us. We certainly heard you."}
{"episode_id":"SW - #365 - 2024-11-21 - Fr. Stephen De Young - Friedrich Nietzsche’s Guide to the Bodily Resurrection (Summit 2024)","start":2908.04,"end":3193.5,"speaker":"Jordan Peterson","text":"The Lexus es, not just for you. By you experience amazing at your Lexus dealer. So one of the things I've been talking about with my wife is that I guess it's an extension of something I used to do in my clinical practice. If you're dealing with people who are depressed, one of the things you can do with them is you can have them track their mood variability, variation hour by hour even. Because someone who's depressed will tell you that they're depressed all the time. And perhaps they are, but sometimes they're somewhat less depressed than other times. There's still variability. Now, it might be the variability of suffering in hell, but it's still variability. And what that means is that you can help the person delineate when they're suffering most and least intensely. And then you can start to triangulate on that. You might think, okay, well when things are really bad for you, when is that exactly? Does that repeat? Is it the morning and what's the context? And then you can do an analysis of what deepens suffering? And then you can do the reverse, which is, when is it that you're least miserable? And then the next step is, well, maybe you could rearrange yourself so that you're doing the things that make you most miserable, less of the time. And you can see a progression. A progression. Now, you could phrase that positively. So you could imagine that you were watching your marriage like you didn't understand it, which you don't. And you could see your marriage and your family, let's say you could see that now and then, that the light would be shining through, right? That for whatever reason, now under these circumstances, we're playing with each other. Everyone's pleased to be here. We're concentrating on the moment. Our experience is suffused with joy. Grace has descended. We're doing something to allow that to happen. What is it? And could we learn to live there more often? Okay, so you're making. You're pointing in that direction with regards to the emergence of eternity into life, right? So then you could imagine that you could practice that. And people can do that. So it might be that you find that in your typical day, you're only spending 10 minutes in that state. But if you practice diligently for six months, you could get it up to, like, half an hour. And then within that half an hour, you'd see that there'd be a new seed that would be emerging, that would be a higher order of bliss even within that. And that can be continually. That's the pearl of great price, by the way. That's the mustard seed. That's the kingdom of heaven. Those are all the same things. Okay, so I understand. Now, I also like your emphasis, the emphasis you place on the idea that that's something that has to be made manifest here. And that we can't throw away the world of reality in favor of some heaven after death that's displaced. And you can understand why that's a danger, too, because the world becomes a place to escape from and can become denigrated. And our identities become something that float above it, which is exactly where we're at in a kind of postmodern, transhumanist world. Okay, so that's my understanding of what you've said. Now, what I don't understand, and this is a terribly unfair question, but I'd like to know what your thoughts are. Well, I guess the issue still is what of the dead, right? Because it's all well and good to be digging for the kingdom of heaven while you're alive, but it's A lot harder when you're dead. And so. Right, right. So what I saw you doing today was wrestling with the problem of the relationship between eternity and heaven and the proximal, and making a case that we can't abandon the proximal in the least. We need to elevate it to the status of the eternal. But it still leaves us with the problem of death. And so. Well, so that's the question. It's like, how do you reconcile? Because by scrapping that kind of unconscious, traditional view of heaven and hell as what happens after you die, you also scrap the problem of how to address the fact of the loss of death. And so I'm wondering where your thoughts have taken you in that regard."}
{"episode_id":"SW - #365 - 2024-11-21 - Fr. Stephen De Young - Friedrich Nietzsche’s Guide to the Bodily Resurrection (Summit 2024)","start":3193.5,"end":3270.56,"speaker":"Fr Stephen De Young","text":"Sure, yeah. So. And this is obviously based on the tradition I'm in. But so the Russian folktale, you see a piece of that. So the way this has been traditionally phrased is a person can't repent. They can't take action to change and transform their life once they're dead for themselves, but the community of which they were apart can come and intercede for them. And what I think that Russian folktale brings out is what's happening there is not sort of, oh, we're all begging God to change his mind about this person and decide they were a good person instead of a bad person. But what we are doing is we're trying to bring to the fore those moments in that time. Because I think what we mean by the resurrection of the dead on the last day is us coming back to inhabit not just this body in some sense, this physical body, this physical world in some sense, but to reinhabit our lives, but our lives now, purified of everything that was pain and suffering. And only those moments remain. And we live those moments."}
{"episode_id":"SW - #365 - 2024-11-21 - Fr. Stephen De Young - Friedrich Nietzsche’s Guide to the Bodily Resurrection (Summit 2024)","start":3271.68,"end":3352.61,"speaker":"Jordan Peterson","text":"Okay, we sort of do that. Well, we sort of do that when we pull the spirit of great people along with us from the past. Right. I mean, I was sitting here thinking about what you were talking about, and I'm working with this employee of mine now. We're building these. We're building large language models, and we're thinking about resurrecting people, essentially. And so because you can build a large language model of Nietzsche, for example, and now you can more or less embody that. So we could build a large language model of Nietzsche and provide him with a photorealistic avatar and have him lecture again. And that is. I mean, we'd already do that with the great people of the past to some degree, because we pull them along and we pull out their Best. And we carry that with us. Right. And that is something like. You could imagine that in principle being something like the separating of the wheat from the chaff and the conserving of the wheat and the bringing that along with us. But the woman that you talked about, for example, her life was almost all chaff. And that's a terrible thing to think about in relationship to your own life, by the way. Like, it's the most terrible thing to think about, in fact, virtually by definition, does that mean that if your life is all chaff, that you remain eternally dead?"}
{"episode_id":"SW - #365 - 2024-11-21 - Fr. Stephen De Young - Friedrich Nietzsche’s Guide to the Bodily Resurrection (Summit 2024)","start":3354.85,"end":3391.21,"speaker":"Fr Stephen De Young","text":"That is what I think is meant by eternal death when that phrase is used in the scriptures. And that's a horrible rough. It's a horror. Yeah, well, and it's. And one of the key elements, though, of the scriptures and of the Christian tradition is, with maybe a couple exceptions, like Judas and maybe Arius, there's no one that it is said that has happened to, but it is out there continually as a possibility for us that death. Yes, that. That is a possibility not for other people, but for me."}
{"episode_id":"SW - #365 - 2024-11-21 - Fr. Stephen De Young - Friedrich Nietzsche’s Guide to the Bodily Resurrection (Summit 2024)","start":3393.49,"end":3393.73,"speaker":"Jordan Peterson","text":"Right."}
{"episode_id":"SW - #365 - 2024-11-21 - Fr. Stephen De Young - Friedrich Nietzsche’s Guide to the Bodily Resurrection (Summit 2024)","start":3394.29,"end":3397.49,"speaker":"Fr Stephen De Young","text":"And that spurs me to continue to examine my life."}
{"episode_id":"SW - #365 - 2024-11-21 - Fr. Stephen De Young - Friedrich Nietzsche’s Guide to the Bodily Resurrection (Summit 2024)","start":3398.21,"end":3399.09,"speaker":"Jordan Peterson","text":"Yeah, yeah."}
{"episode_id":"SW - #365 - 2024-11-21 - Fr. Stephen De Young - Friedrich Nietzsche’s Guide to the Bodily Resurrection (Summit 2024)","start":3399.41,"end":3422.96,"speaker":"Fr Stephen De Young","text":"To continue to say that possibility being out there, that possibility being extended. Right. So whether there is anyone who will ultimately face that is sort of irrelevant to the question of the work that that idea is doing within the scriptures and within the Christian tradition being that possibility."}
{"episode_id":"SW - #365 - 2024-11-21 - Fr. Stephen De Young - Friedrich Nietzsche’s Guide to the Bodily Resurrection (Summit 2024)","start":3424.64,"end":3484.57,"speaker":"Jordan Peterson","text":"In some ways, you might want that to happen because even with regards to Nietzsche's idea of the eternal return, I suppose hell might be the eternal return of everything you did. Stupid. Everything you did that was stupid in your life being repeated forever. That is hell in your own life, by the way. That's actually why you should solve the problems that present themselves to you, because if you don't, all you do is repeat them. That's why you need to have it out with people, because otherwise you just do the same stupid thing forever. Well, and it gets worse as you do it. That seems to be not the sort of thing you want to preserve. And so that would mean in some ways that what you would properly pray for is to be submitted to the flaming swords that turn every which way. Right. The terrifying part of that, I suppose, would be that most of you would."}
{"episode_id":"SW - #365 - 2024-11-21 - Fr. Stephen De Young - Friedrich Nietzsche’s Guide to the Bodily Resurrection (Summit 2024)","start":3484.57,"end":3490.25,"speaker":"Fr Stephen De Young","text":"Go, yeah, that the person who would truly be that far gone would not."}
{"episode_id":"SW - #365 - 2024-11-21 - Fr. Stephen De Young - Friedrich Nietzsche’s Guide to the Bodily Resurrection (Summit 2024)","start":3491.05,"end":3532.72,"speaker":"Jordan Peterson","text":"Yeah, Well, I thought, for I've been thinking that the degree to which the flaming swords that turn every which way our hell is proportionate to how much of you would have to be destroyed to pass through them to get to paradise. Right. I don't know if that's a literal vision of hell, because if you're 99% dead wood, the flames that purify would be experienced. Would they be experienced as hell? They would be if you experienced that without voluntary compliance. I mean, that happens to you in your life all the time. So. Right, yeah."}
{"episode_id":"SW - #365 - 2024-11-21 - Fr. Stephen De Young - Friedrich Nietzsche’s Guide to the Bodily Resurrection (Summit 2024)","start":3532.72,"end":3552.36,"speaker":"Fr Stephen De Young","text":"And when I sit with people as they're dying, which as a priest you do, the worry and the despair of the family is that all of the love and all of the joy and all of the good is what is dying, that that's what's going away."}
{"episode_id":"SW - #365 - 2024-11-21 - Fr. Stephen De Young - Friedrich Nietzsche’s Guide to the Bodily Resurrection (Summit 2024)","start":3555.27,"end":3555.51,"speaker":"Laura Diaz","text":"Right."}
{"episode_id":"SW - #365 - 2024-11-21 - Fr. Stephen De Young - Friedrich Nietzsche’s Guide to the Bodily Resurrection (Summit 2024)","start":3555.83,"end":3563.91,"speaker":"Fr Stephen De Young","text":"And the hope that Christianity presents is. No, that is what becomes eternal. It's the rest that dies."}
{"episode_id":"SW - #365 - 2024-11-21 - Fr. Stephen De Young - Friedrich Nietzsche’s Guide to the Bodily Resurrection (Summit 2024)","start":3565.59,"end":3566.71,"speaker":"Jordan Peterson","text":"Well, that would be the case."}
{"episode_id":"SW - #365 - 2024-11-21 - Fr. Stephen De Young - Friedrich Nietzsche’s Guide to the Bodily Resurrection (Summit 2024)","start":3566.79,"end":3567.99,"speaker":"Fr Stephen De Young","text":"Dies away and is gone."}
{"episode_id":"SW - #365 - 2024-11-21 - Fr. Stephen De Young - Friedrich Nietzsche’s Guide to the Bodily Resurrection (Summit 2024)","start":3568.07,"end":3676.02,"speaker":"Jordan Peterson","text":"I suppose if the world was overwhelmed by hell, then it would be that the catastrophe, that would be eternal. Right. That would mean that the wrong. What was we conserved? What was we conserved? The wrong thing. Well, I'm wondering. I'm still trying to wrestle with this issue of the dead, let's say. I mean, you make the case for the embodiment, for the resurrection of the body very powerfully. I mean, one of the things our culture is very perverse about is the notion that identity is something that floats above embodiment in a. In a manner that should be disembodied. And that is. Which is why we insist that you can define your own identity. Which Nietzsche had something to do with. Right. Because he said we should formulate our own values, that we'd have to come to the point where we formulated our own. That was a very bad idea. I mean, that was a very bad idea. And I think the psychoanalysts actually corrected that pretty rapidly, although that's not particularly well known. We would hope we would winnow the good and pull it along with us. Right. And that we would build the world on the basis of that good. And that would be something like building the world on the foundation of Christ. It's the same idea fundamentally. Right. Is that if that's the good that's at the foundation, and then that makes itself manifest in the particularities of each person's time and place, then we pull all that, we gather all that as we move along, and that spirit suffuses us, and that's the movement towards eternity. But then I'm still struggling with that. I see that that's true, but I'm still struggling with that in the notion of an embodied resurrection. So I'm not. I really. I know you can't answer that. Because I don't think anybody can answer that. I don't think we understand."}
{"episode_id":"SW - #365 - 2024-11-21 - Fr. Stephen De Young - Friedrich Nietzsche’s Guide to the Bodily Resurrection (Summit 2024)","start":3676.18,"end":3677.14,"speaker":"Fr Stephen De Young","text":"It's a way of thinking."}
{"episode_id":"SW - #365 - 2024-11-21 - Fr. Stephen De Young - Friedrich Nietzsche’s Guide to the Bodily Resurrection (Summit 2024)","start":3677.22,"end":3696.9,"speaker":"Jordan Peterson","text":"Well, it's also something we're stumbling towards the realization of. Right, yeah, but. Okay, so when you're sitting with people dying and they're worried that the good will disappear, what is it that you find to comfort people in those moments?"}
{"episode_id":"SW - #365 - 2024-11-21 - Fr. Stephen De Young - Friedrich Nietzsche’s Guide to the Bodily Resurrection (Summit 2024)","start":3699.86,"end":3753.13,"speaker":"Fr Stephen De Young","text":"I think it is precisely this idea. This idea that not only are those moments not dying, not only is that love you shared not dying, but that is going to become your reality. That is going to become your reality eternally. And I think in terms of drawing the dead with us, I think that's part of the function of saints in the church. Right. The church is not just Christ, it's also the communion of saints. Right? It's the communion of saints who are collecting the good because of their whole life. We read the lives of the saints, their actual stories played out in time as their identity and their spirits, the spirits of the righteous made perfect, as we call them, are now continually part of and foundational to the community."}
{"episode_id":"SW - #365 - 2024-11-21 - Fr. Stephen De Young - Friedrich Nietzsche’s Guide to the Bodily Resurrection (Summit 2024)","start":3753.29,"end":3887.65,"speaker":"Jordan Peterson","text":"Well, you could imagine too, that if you're evaluating your life and you see those moments when you exist in something that's at least closer to paradise than your normative existence, that it is during those times that the spirit of what was best in the past is making itself manifest in the present, in your life. That is what's happening. I mean, those are the times where your existence is configured and things come together so that the spirit of the what, the eternal redeeming spirit of your ancestors is making itself manifest with within you. That's what's happening. And you can invite that in. You know, in the story of Cain and Abel, when Cain is bitter, Cain invites the predatory spirit that crouches on, the predatory spirit of resentment that crouches on his doorstep. He invites that in to take possession of him. That's the accusation that God levels against Cain. When Cain shakes his fist at the cosmos and people do that when things are. When the world reveals itself to you in love, that's an indication that for whatever reason, you were fortunate enough to be wise enough to invite in that the spirit of what's good to possess you. Right? And you can learn to do that. Right? And that's. That's really. I would say that's the Christian journey fundamentally to do that. And that is something like a conservation of the good of the past. You can see that too. Even if you're able to do that in part because maybe you have a wonderful moment with your Son, let's say, when he's a child, if you think that through, you understand that that's the moment in which the best of your father shines through you. Right. And that best of him was an amalgam of what was best about fathers since time immemorial. I mean, literally, because we imitate each other as we move down the generations and the centuries, and that is the emergence of something eternal into the space of the proximal."}
{"episode_id":"SW - #365 - 2024-11-21 - Fr. Stephen De Young - Friedrich Nietzsche’s Guide to the Bodily Resurrection (Summit 2024)","start":3890.29,"end":3898.89,"speaker":"Fr Stephen De Young","text":"And the saints maintain their identity. It's not just their writings, their thoughts, what they did, but we read their lives. Right. Their identity."}
{"episode_id":"SW - #365 - 2024-11-21 - Fr. Stephen De Young - Friedrich Nietzsche’s Guide to the Bodily Resurrection (Summit 2024)","start":3899.61,"end":3968.33,"speaker":"Jordan Peterson","text":"Right. Yeah. Well, that's the other thing about the insistence of the resurrection of the body that's so brilliant. Because if you abandon the notion of the body, you abandon the value of the particularities of time and space. Right. It means that only what's abstract about you is real, and that's not. Well, that leads to this transhuman postmodernism. It's another pathway there. It has to be that the particularities are just as important as the universalities. And I think that has something to do with Jonathan's constant insistence that you have to understand the reflection of the kingdom of heaven not as something that's merely at the pinnacle or that's the foundation, but that's the pinnacle and the foundation, and that suffuses the whole simultaneously. Right. And so you don't get to abandon the particularities in preference to the general. Or vice versa. Right. I suppose vice versa is kind of what the hedonists do. It's only about the embodiment in the present. Right. Okay. Okay. Well, that's. Thank you. Yeah."}
{"episode_id":"SW - #365 - 2024-11-21 - Fr. Stephen De Young - Friedrich Nietzsche’s Guide to the Bodily Resurrection (Summit 2024)","start":3968.33,"end":3968.89,"speaker":"Fr Stephen De Young","text":"Thank you."}
{"episode_id":"SW - #365 - 2024-11-21 - Fr. Stephen De Young - Friedrich Nietzsche’s Guide to the Bodily Resurrection (Summit 2024)","start":3968.97,"end":3969.77,"speaker":"Jordan Peterson","text":"Yeah. Yeah."}
{"episode_id":"SW - #365 - 2024-11-21 - Fr. Stephen De Young - Friedrich Nietzsche’s Guide to the Bodily Resurrection (Summit 2024)","start":3969.85,"end":3975.89,"speaker":"Fr Stephen De Young","text":"Thank you, Father. Thank you. And thank you, Jordan."}
{"episode_id":"SW - #365 - 2024-11-21 - Fr. Stephen De Young - Friedrich Nietzsche’s Guide to the Bodily Resurrection (Summit 2024)","start":3979.41,"end":3994.45,"speaker":"Jonathan Pageau","text":"If you enjoy these videos and podcasts, please go to the symbolicworld.com website and see how you can support what we're doing. There are multiple subscriber tiers with perks. There are apparel and books to purchase. So go to thesymbolicworld.com and thank you for your support."}
{"episode_id":"SW - #365 - 2024-11-21 - Fr. Stephen De Young - Friedrich Nietzsche’s Guide to the Bodily Resurrection (Summit 2024)","start":3994.93,"end":4054.2,"speaker":"Laura Diaz","text":"Tucson the weight is Over Mediweight loss. They're officially open on North Oracle Road. That's right. No more counting down the days. You can walk in right now and start your journey to a healthier you. Hey, it's Laura Diaz from iHeartRadio. And you can trust me, this isn't just another weight loss clinic. I know that because it's where I lost weight safely with real medical support. GLP1 medications. You can see them everywhere online right now. But the truth is, your health shouldn't be a DIY project ordering these meds without the professional guidance. It can lead to dangerous mistakes, wrong doses, no oversight, and serious risks. At mediweightloss, I got the same medication but with a customized plan, weekly check ins, and a licensed physician guiding me every step of the way. And the cost? The same as those risky online options. Tucson, your moment is here. If you're ready to take control, feel better and lose weight the right way, mediweightloss is ready for you. Walk in, get started and see real results. Call or visit mediweightloss.com to learn more and book your free consultation today."}
{"episode_id":"SW - #365 - 2024-11-21 - Fr. Stephen De Young - Friedrich Nietzsche’s Guide to the Bodily Resurrection (Summit 2024)","start":4054.2,"end":4060.12,"speaker":"Fr Stephen De Young","text":"That's mediweightloss.com Pooka Bella, I'm sure you've noticed some changes. Who you talking to?"}
{"episode_id":"SW - #365 - 2024-11-21 - Fr. Stephen De Young - Friedrich Nietzsche’s Guide to the Bodily Resurrection (Summit 2024)","start":4060.52,"end":4061.88,"speaker":"Jordan Peterson","text":"I'm just practicing for when I have."}
{"episode_id":"SW - #365 - 2024-11-21 - Fr. Stephen De Young - Friedrich Nietzsche’s Guide to the Bodily Resurrection (Summit 2024)","start":4061.88,"end":4064.54,"speaker":"Fr Stephen De Young","text":"To tell the dogs about the twins. You know, because they'll be fine in."}
{"episode_id":"SW - #365 - 2024-11-21 - Fr. Stephen De Young - Friedrich Nietzsche’s Guide to the Bodily Resurrection (Summit 2024)","start":4064.54,"end":4065.78,"speaker":"Jordan Peterson","text":"The spacious third row seat."}
{"episode_id":"SW - #365 - 2024-11-21 - Fr. Stephen De Young - Friedrich Nietzsche’s Guide to the Bodily Resurrection (Summit 2024)","start":4065.86,"end":4067.9,"speaker":"Fr Stephen De Young","text":"But the twins can sleep peacefully thanks."}
{"episode_id":"SW - #365 - 2024-11-21 - Fr. Stephen De Young - Friedrich Nietzsche’s Guide to the Bodily Resurrection (Summit 2024)","start":4067.9,"end":4069.22,"speaker":"Laura Diaz","text":"To the rear manual sunshade."}
{"episode_id":"SW - #365 - 2024-11-21 - Fr. Stephen De Young - Friedrich Nietzsche’s Guide to the Bodily Resurrection (Summit 2024)","start":4069.3,"end":4071.38,"speaker":"Fr Stephen De Young","text":"And what about the extra cargo space."}
{"episode_id":"SW - #365 - 2024-11-21 - Fr. Stephen De Young - Friedrich Nietzsche’s Guide to the Bodily Resurrection (Summit 2024)","start":4071.38,"end":4072.66,"speaker":"Laura Diaz","text":"For strollers and dog beds?"}
{"episode_id":"SW - #365 - 2024-11-21 - Fr. Stephen De Young - Friedrich Nietzsche’s Guide to the Bodily Resurrection (Summit 2024)","start":4072.74,"end":4073.54,"speaker":"Jordan Peterson","text":"I guess you're right."}
{"episode_id":"SW - #365 - 2024-11-21 - Fr. Stephen De Young - Friedrich Nietzsche’s Guide to the Bodily Resurrection (Summit 2024)","start":4073.7,"end":4075.06,"speaker":"Fr Stephen De Young","text":"Can we go to the hospital now?"}
{"episode_id":"SW - #365 - 2024-11-21 - Fr. Stephen De Young - Friedrich Nietzsche’s Guide to the Bodily Resurrection (Summit 2024)","start":4075.22,"end":4076.9,"speaker":"Laura Diaz","text":"The contractions are getting closer."}
{"episode_id":"SW - #365 - 2024-11-21 - Fr. Stephen De Young - Friedrich Nietzsche’s Guide to the Bodily Resurrection (Summit 2024)","start":4077.46,"end":4080.34,"speaker":"Fr Stephen De Young","text":"The three row Lexus TX because everyone."}
{"episode_id":"SW - #365 - 2024-11-21 - Fr. Stephen De Young - Friedrich Nietzsche’s Guide to the Bodily Resurrection (Summit 2024)","start":4080.34,"end":4085.06,"speaker":"Jordan Peterson","text":"Should feel like the center of the universe experience. Amazing at your Lexus dealer."}
