{"episode_id":"SW - #110 - 2020-07-30 - Nicholas Kotar - Fairy Tales are Better Than Vaccines","start":0.8,"end":72.8,"speaker":"Jonathan Pageau","text":"Hello, everybody. I'm here with Deacon Nicholas Kotar. Those of you who follow my channel have seen him here before. We did an interview talking about Tolkien and storytelling, and Deacon Nicholas is just finishing up his series of books on Ravenson, so we'll talk a little bit about that, but we'll mostly talk about the situation right now. He wrote a great article for the Symbolic World blog on the question of vaccines and fairy tales and the importance of meaning. And so we'll talk about that, our current situation, and see how that leads us also to always talk about storytelling because we can't avoid that. This is Jonathan Pageau. Welcome to the Symbolic World. First off, I want to congratulate you on finishing your series of Raven Son. Maybe you can give us a little tidbit of how that experience has been and then we can jump into the question of vaccines and fairy tales."}
{"episode_id":"SW - #110 - 2020-07-30 - Nicholas Kotar - Fairy Tales are Better Than Vaccines","start":73.28,"end":111.46,"speaker":"Nicholas Kotar","text":"Well, it's been a really roller coaster for me. I mean, not only because of all of the emotional fallout as a result of coronavirus and everything. We're pretty isolated where we are, upstate New York, so that's not touching us too much. But still, there's always the attraction of social media and things that tend to worry you. But it's not just that. It's also finishing a book series that I've been writing for 13 years on and off, and it turns out that so much more emotional and almost traumatic experience than I expected because these characters have become such a part of me. And of course, they come out of who I am, and every single one of them is carrying some tiny aspect of my personality."}
{"episode_id":"SW - #110 - 2020-07-30 - Nicholas Kotar - Fairy Tales are Better Than Vaccines","start":111.46,"end":111.9,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #110 - 2020-07-30 - Nicholas Kotar - Fairy Tales are Better Than Vaccines","start":112.22,"end":119.77,"speaker":"Nicholas Kotar","text":"As I was. And I had to kill a few of them off. And, you know, I. There was one that I killed off the next morning. I was like, I can't work today. I'm in mourning."}
{"episode_id":"SW - #110 - 2020-07-30 - Nicholas Kotar - Fairy Tales are Better Than Vaccines","start":119.77,"end":121.85,"speaker":"Jonathan Pageau","text":"I'm in mourning for my character. That's awesome."}
{"episode_id":"SW - #110 - 2020-07-30 - Nicholas Kotar - Fairy Tales are Better Than Vaccines","start":122.01,"end":132.81,"speaker":"Nicholas Kotar","text":"It's true. But, yeah, it's been a great experience and it's just the beginning. I'm now really in a good rhythm, and I anticipate at least two or three more books coming out this year."}
{"episode_id":"SW - #110 - 2020-07-30 - Nicholas Kotar - Fairy Tales are Better Than Vaccines","start":133.21,"end":166.36,"speaker":"Jonathan Pageau","text":"That's awesome. Yeah. I've been excited to see how productive you've been despite the coronavirus. And I'm really happy to see you kind of joining our team on the Symbolic World because I love your work and I love your thought process. You know, even from the first articles you wrote on the Orthodox Art Journal, I like. Okay. I have a kindred spirit in this person. So the article you wrote for us is called why Fairy Tales Might be Better than a vaccine, which was quite provocative. So maybe you can kind of lay out the thesis for it. People can obviously check it out and read it, but we can lay it out and we can talk about the tenets of your article."}
{"episode_id":"SW - #110 - 2020-07-30 - Nicholas Kotar - Fairy Tales are Better Than Vaccines","start":167.32,"end":293.7,"speaker":"Nicholas Kotar","text":"Well, actually, it's interesting that it all. It's funny how I don't know if coronavirus is making us more cognizant of weird connections happening throughout our lives in different ways, but I've been preparing a podcast for Ancient Faith Media, and it's basically, I'll be retelling. It's called In a Certain Kingdom, and I'll be retelling Slavic fairy tales with a little bit of analysis attached at the end of each reading. So it's, you know, it's kind of performed and things like this. But my favorite part of it is going to be the analysis. Of course, with fairy tales, you have to be careful not to analyze them to death because you can make him into a vivisected corpse and that's no longer a fairy tale. But this first article for the Symbolic world actually came directly from the analysis of the first story that I'll be telling, which will be made available very soon. And those of you who followed me at all will know that I have a slight love affair with a Russian philosopher of the late 19th, early 20th century named Yvonne Ilim, who is a bit of a controversial figure in some circles. There's effectively a hit piece out there written by a historian for the New York Review of Books that people all the way from here to India have read. And whenever they. People who are really, you know, who consider themselves people of letters, when they hear the words Ivan Irin, the name Ivan Irin, they automatically default to that. To that article which talks about Ivan Ilyin being a fascist prototype for the Putinist takeover of Russia and the eastern whatever, which is. It's a hit piece, basically. The guy doesn't even. He doesn't actually quote Ilyn a single time. He says, Ilyin said that, and then there is no quote. So it's very easy to misrepresent the kinds of things Ilion said. Ilion did have a short flirtation with. With fascism because he was in Germany in the pre. Pre war period, but a lot of the Russian emigres ended up in Germany. And unfortunately there, you know, a lot of people, we don't remember this fact, but a lot of people had a kind of fascist flirtation before they really saw what was going on."}
{"episode_id":"SW - #110 - 2020-07-30 - Nicholas Kotar - Fairy Tales are Better Than Vaccines","start":293.7,"end":369.3,"speaker":"Jonathan Pageau","text":"Yeah. And it's really. It's really easy for us now, to judge people at the time, especially you can imagine a Russian immigrate who had to deal with a Communist revolution, who is now seeing antifa and the Communist Party's taking ground in Germany, and they want to resist that. And so they feel like the only solution is this new thing that's kind of appearing on the horizon. And so it's easy for us to judge them for making those moves at that time, when in fact, a lot of the writers, like Heidegger is a good example where people say, oh, Heidegger, Heidegger. But as soon as he understood what was going on in terms of the madness, he distanced himself from the party. But it's too easy to judge people at that time. I really get annoyed when people do that. And I feel like it's almost like a weird leftist pathology to just accuse. But we don't accuse Jean Paul Sartre of being a Communist member until his death, basically. And Pablo Picasso having gone to Russia and propped up the Communist state in. While it was massacring people and sending people to gulag. So I have no patience for that crap."}
{"episode_id":"SW - #110 - 2020-07-30 - Nicholas Kotar - Fairy Tales are Better Than Vaccines","start":370.18,"end":566.07,"speaker":"Nicholas Kotar","text":"No, me neither. And I get very angry and have got angry recently about it. So I have to control my emotions. But the point is that you can only really judge a man by his own work, his own output. And if you read the stuff that he's written on culture especially, it's really incredible. He has a little booklet that I've translated and actually it's available for anybody who wants to buy it, Foundations of Christian Culture. And it's one of the most unique things that I've ever read because he talks about. He talks about one of the main responsibilities of a Christian being, not simply maintaining an existing culture, which seems to. Which seems to be the default position for about a millennium, if we're honest. But he says that no, especially in this moment. And he's writing in the middle of the 20th century, as the world wars are going on. He says it's time to create anew. And it doesn't mean. Doesn't mean get rid of everything and start from scratch. It means, look, take what. Take what you have, good and bad, transform it. Take what you have now, take what you have in the past, take what you expect to happen in the future. Combine it with a. An active and kind of spirit. He calls it a spirit inspired view of the world. He was. He was very Hegelian, and people kind of believed in the indwelling of the spirit being the prime movement of the. Of the Creator. And also Immersing yourself in the worldview and in the narrative of the scriptures, and from that, allowing yourself to be kind of moved towards a lifelong journey towards creating culture through your own specific medium, whatever that might be. And he even enumerates a whole bunch of. He talks about economics, talks about government, he talks about visual arts, talks about writing, talks about all kinds of things. So it's from that perspective that and from that similar kind of mindset that he. That I found this other article he wrote. It was actually a speech given to a bunch of Russians in Berlin in the 30s. So right before everything started to go crazy. Yeah. Where he talks about the spiritual meaning of fairy tales. The weirdest thing you could talk about in the mid-1930s. I mean, who's gonna be talking about fairy tales right as the Great War is finished and another one is about. Is about to happen? And it's obvious that things are not going well throughout the world. I mean, the Great Depression is happening. I mean, who is gonna want to talk about fairy tal. And yet here, this is what he choose to talk about. And he talks specifically about Russian fairy tales to a specifically Russian audience. But especially if you compare what he says with what Tolkien and other. Not folklorists. I have an opinion about folklorists that I will not share here. But people who actually write in the tradition of folklore, they all agree that there is something about that way of telling stories that reaches very, very deep into the historical past of a nation, that reaches very deep into the spirit base of a human being, that can help reconstruct a proper relation to the world around you in a very realistic way, as odd as that may sound. Because fairy tales are what they're invented, funny little stories about talking animals. What could possibly be there that could help you form a worldview? And yet that's exactly the argument that he makes, which is a fascinating argument, I think."}
{"episode_id":"SW - #110 - 2020-07-30 - Nicholas Kotar - Fairy Tales are Better Than Vaccines","start":566.63,"end":620.11,"speaker":"Jonathan Pageau","text":"Well, one of the things that the fairy tale does is that it. It's using a grammar which seems very, very ancient, that is very, very old. And it's the very fact that you can take these stories seriously because some of the elements are so odd in the story, you know, and the fact that we are able to listen to them and to think that this is fine like, that this is okay to listen to the story and to finish with a sense of satisfaction, it means that it's actually going very, very deep in our psyche and very deep in the patterns of being. And it doesn't matter whether or not they are believable in a kind of Literalistic sense or a kind of historical sense. It doesn't. It doesn't matter. You know, they tend to. Tend to hone in on the best image within the narrative to make it happen."}
{"episode_id":"SW - #110 - 2020-07-30 - Nicholas Kotar - Fairy Tales are Better Than Vaccines","start":621.63,"end":730.74,"speaker":"Nicholas Kotar","text":"Yeah, no, and it's. It's built on structures of symbolism. And these structures of symbolism, they tend to persist throughout, not even centuries, but millennia. I mean, there's some interesting scholarship to suggest that some fairy tales that we tell now were first told 9,000 years ago. It's pretty insane. And you're right. And you touch on something that I think. What. I would even go further. I think that any sort of realism in a fairy tale makes it dead. I think that it's precisely the lack of believability on some level. As long as that lack of believability also plugs into those symbolic structures, those commonly repeated images and ways of relating to the world that seem to appear in all cultures again and again. Things like. And we talked about this with Father Andrew Stephen Damick in the last Amal Soul podcast that I did with him. It's an interesting scene in the Hobbit where Gandalf is talking about storytelling in the context of his little limited world, and he mentions the unexpected luck of widows sons and the rescue of princesses. Now, neither of those things happens in the world of the Hob or the Lord of the Rings, so what is he talking about? Except if you know, if you know your folklore, those two elements are tropes in fairy tales. They happen all the time. The princess always needs to be rescued. And by the way, there's a lot of reasons why she needs to be rescued. And oftentimes it's not because of the princess. So it's not a feminist or non feminist thing at all. It has nothing to do with that. While the unexpected luck of widow sons is also a very commonly repeated trope. And it has to do with how you have to go deep into misfortune in order to find your fortune. You have to be deprived of everything on the superficial level to be able to find that. That sometimes mad, sometimes dangerous wisdom that will lead you by impulse and by instinct as opposed to by rationality. Something that really we need to be paying attention to right now."}
{"episode_id":"SW - #110 - 2020-07-30 - Nicholas Kotar - Fairy Tales are Better Than Vaccines","start":731.06,"end":731.94,"speaker":"Jonathan Pageau","text":"Oh, exactly."}
{"episode_id":"SW - #110 - 2020-07-30 - Nicholas Kotar - Fairy Tales are Better Than Vaccines","start":732.02,"end":732.66,"speaker":"Nicholas Kotar","text":"And it's."}
{"episode_id":"SW - #110 - 2020-07-30 - Nicholas Kotar - Fairy Tales are Better Than Vaccines","start":733.38,"end":792.72,"speaker":"Jonathan Pageau","text":"And it's definitely the Christian message, even though people might be surprised to hear that, is that all the symbolism of Christianity is about finding light in darkness or finding life in death. Even the symbolism of the fish. I always try to remind people that the symbolism of the fish, that's exactly what it is it's all about finding these sparkly things that are hidden in the depth of darkness. It's about finding life in a dead world. And so that is really what Christianity is about. Just the whole image of the crucifixion is about that and how, you know, life comes after this descent into Hades. And so our whole ascetic practice is a way to mimic, if you will, the unfortune of the character. This character that you talk about, you know, the last son or the widow's son or whatever, the loser."}
{"episode_id":"SW - #110 - 2020-07-30 - Nicholas Kotar - Fairy Tales are Better Than Vaccines","start":792.72,"end":793.8,"speaker":"Nicholas Kotar","text":"He's never the first son."}
{"episode_id":"SW - #110 - 2020-07-30 - Nicholas Kotar - Fairy Tales are Better Than Vaccines","start":793.88,"end":812.86,"speaker":"Jonathan Pageau","text":"No, it's never the first son. And so a lot of our aesthetic practice is there to kind of recreate that pattern within ourselves. Even in a world that's fine, you want to create for yourself that opposition so that you see your passions, but then you can also find something, some precious nugget there."}
{"episode_id":"SW - #110 - 2020-07-30 - Nicholas Kotar - Fairy Tales are Better Than Vaccines","start":813.18,"end":948.04,"speaker":"Nicholas Kotar","text":"And this is what drives me, really mystifies me about the reaction to a lot of Christians, unfortunately. And I don't know if it's a lot, but it seems to be a lot, based on what I'm coming across with, especially on social media, the reaction that a lot of Christians are having to the closure of churches and how church closure is being supported and defended by even people very high up in the hierarchy as a necessary step towards stemming the. Or what is it, the flattening the curve and things like this. Well, I'm thinking, wait a minute. Whatever happened to recapitulating the darkness that is around Christ at the moment of his crucifixion so that we can then go down with him into Hades and come back up? It's not merely recreating, it's recapitulating. It's a word that Lyon uses a lot, meaning actually reenacting in our lives in a way that would then allow for the grace of God to fulfill the same thing that happened to Christ with us, but this. We're not even being given the chance. It's really astounding to me how the necessity for maintaining superficial health is more important than leaning into, as we always have throughout history. How many epidemics have we had, Jonathan? I mean, hundreds and hundreds. I was just reading, reading about Saint Philuret of Moscow, who was the Metropolitan of Moscow, the head of the Russian church in the 19th century, who had lived through six, seven, eight cholera epidemics. People, cholera is much worse than COVID 19. I'm sorry. I mean, if you want to die in the worst possible way. I'm not going to get into the details, but just look it up. He never closed churches, he opened hospitals. He sent his monastics to go into those hospitals to minister to those people. He kept the churches open at all times. He rang bells at odd moments during the day and the night to remind people of what is ultimately of the most importance. And in the kind of superficial and pathetic and lax lifestyle we live in the west right now, this is the best kind of wake up call that we could possibly have. And here the doors are being shut in our faces. As soon as we have the opportunity to go and recapitulate Christ's journey, he is offering it to us, saying, go do it. Suffer with me."}
{"episode_id":"SW - #110 - 2020-07-30 - Nicholas Kotar - Fairy Tales are Better Than Vaccines","start":949.08,"end":949.4,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #110 - 2020-07-30 - Nicholas Kotar - Fairy Tales are Better Than Vaccines","start":949.96,"end":951.56,"speaker":"Nicholas Kotar","text":"And they're telling us, no, that's not good for you."}
{"episode_id":"SW - #110 - 2020-07-30 - Nicholas Kotar - Fairy Tales are Better Than Vaccines","start":951.56,"end":1022.11,"speaker":"Jonathan Pageau","text":"Yeah. And I think that that's really, in your article, that's what you kind of suggest, which is very powerful, is the idea that the communion we find in church and the communion we find in common story and in common participation in story is. When you say it's better than a vaccine, it means it's. Because what it does is it affords us the capacity to be human and to be there to help each other and to be a community which is, which is the actual thing which will get us through this crisis and not some artificial medication. Because, you know, and the image that we saw, like the image that we saw happening, I don't know if it happened, everybody, like here in Quebec, the scandal was the old people's homes, like it was a scandal. And so here we are all closed off on each other. No church, no community, no nothing. We're all shut down in our houses watching Netflix. And the old people are abandoned in these old people homes and they die of thirst because no one is caring for them. They just die on these beds because they're being abandoned. They've just basically been abandoned."}
{"episode_id":"SW - #110 - 2020-07-30 - Nicholas Kotar - Fairy Tales are Better Than Vaccines","start":1022.51,"end":1130.32,"speaker":"Nicholas Kotar","text":"It's worse than that. It's worse than that because in the state that I'm in, in New York, there was a scandal that started to be uncovered and then it was just shut down. The governor was sending COVID patients into rest homes, specifically into the population that is the most at risk, the ones that are going to die. And so now the numbers in the US are clear. It's almost 50% of all the deaths attributed to Covid in the United States have come from nursing homes. It's totally insane. And so here we are, all these young people sitting at home, you know, doing. Getting mad at everyone else for not following protocol. All the protocol of which is designed, whether purposely or not, doesn't even matter to disconnect community in, in a world that already has no community, how many people know their, their next door neighbors? Hardly anybody. Yeah, and this is, I will tell you, this is one of the, one of the most incredible things about living in a rural kind of isolated place right now in the middle of this is because the people around me for the most part are being very calm. We talk to each other, we don't talk to each other over, across artificially imposed surfaces. Of course we're being careful. Of course we're not trying to infect each other on purpose. Goodness gracious. Not everything that we have here has to be seen in black and white categories, but. Except most fairy tales are black and white categories, but never mind. So if there's any hope in all of this, it seems to me like the only way out is the rebirth of small communities in places that aren't beehives full of. Or anthills full of, you know, un people going back and forth between their unwork and their unhome where they try to spend as much time as possible in front of their screens so they don't have any communication with their un wife and their un children. You know."}
{"episode_id":"SW - #110 - 2020-07-30 - Nicholas Kotar - Fairy Tales are Better Than Vaccines","start":1132.56,"end":1136.66,"speaker":"Jonathan Pageau","text":"Gee dike. Nicholas, tell us if you. If your opinion on this."}
{"episode_id":"SW - #110 - 2020-07-30 - Nicholas Kotar - Fairy Tales are Better Than Vaccines","start":1139.78,"end":1140.26,"speaker":"Nicholas Kotar","text":"Sorry."}
{"episode_id":"SW - #110 - 2020-07-30 - Nicholas Kotar - Fairy Tales are Better Than Vaccines","start":1140.58,"end":1187.36,"speaker":"Jonathan Pageau","text":"No, I think it's good. I think you're right. And I think that, I think that what, I think that this idea of also one of the things that's lacking and maybe this can bring us to the next situation is that one of the things that had been lacking and that is lacking is the destruction of the common stories. You know, the evacuation of the fairy tales and even not just evacuation, but the subversion of a lot of the fairy tales with like the new kind of retellings, the modern versions of them. More and more we really do have this weird subversion of the fairy tale and of course, ultimately the deconstruction of the common Christian story which has held the west together for, you know, since the fall of Rome, basically."}
{"episode_id":"SW - #110 - 2020-07-30 - Nicholas Kotar - Fairy Tales are Better Than Vaccines","start":1187.52,"end":1297.02,"speaker":"Nicholas Kotar","text":"And isn't it interesting that those two happen hand in hand, that the destruction of the Christian story cannot happen without a subversion of the traditional story tropes? They all, you know, I'll tell you, like most, most traditional publishing houses that are, that are publishing fairy tale based stuff, which is usually fantasy in today's parlance, are very explicit that they don't want anything traditional and that they're looking for as many queer versions of traditional storylines, as many inversions of the. Of the men, women roles. Yeah, roles. Yeah. And Notice the recent horror movie that came out of Europe. It's not Hansel and Gretel. It's Gretel and Hansel. So even on the level of the names of characters, it has to be the woman first now, because there have to be reparations paid. And of course, I'll be honest. Like, occasionally I would like to read. I do like to read a twist on something traditional, especially if that twist somehow re. Illumines some basic aspect of reality that I know to be true. But more often than not, the twist is the point. And because people. Because most of the people who are writing now actively in these genres that have traditionally spoken to the deepest, held sort of the deepest longings of the human spirit that used to be old white men, and now it's young millennials, all of whom, as we have seen, as we see now, political inversion that's going on. They have. They have swallowed up a deconstruction of reality as their worldview. Yeah. That is their world. Their worldview is that everything is nothing or that that thing has to be twisted and that's it. And there. And they haven't yet internalized, for whatever reason, the reality that there is actually no end to that. It's the serpent that eats its tail forever. And there's no way of coming out of it. Just going to keep spinning and spinning until you go insane. Yeah."}
{"episode_id":"SW - #110 - 2020-07-30 - Nicholas Kotar - Fairy Tales are Better Than Vaccines","start":1297.02,"end":1345.88,"speaker":"Jonathan Pageau","text":"And your version is going to be eaten too, for whatever is left of the old world. Then they're going to come after you later because you can never completely deconstruct anyways, because the story still needs to have a pattern very soon. And I'm sure some people have already said that they'll say that the very pattern of a story that has a beginning and an end and a character arc is a form of supremacy. It's a form of power imposition on the viewer, imposing a narrative on the person watching it. And so it's just in these types of things are, you know, like you said, there's no. You're. You think that you've reached the bottom and some other, bigger monster comes up to come and eat up what was there before."}
{"episode_id":"SW - #110 - 2020-07-30 - Nicholas Kotar - Fairy Tales are Better Than Vaccines","start":1346.2,"end":1391.28,"speaker":"Nicholas Kotar","text":"Isn't there like a series of memes where, like, there's one thing eating another thing eating another thing and just kind of, you know, ad infinitum, but, you know, and this is something that all of us with no historical. With no historical background or with no historical. What's the word I'm looking for? Perspective, who've forgotten even the history of the last Hundred years. Don't even realize. I mean, don't forget all of you who are, you know, really happy about the recent changes in that have to do with the riots and everything. Don't forget that they come from an extremely leftist position, you know, Communist one. And what happened to the communists in Russia? You know, they came to power in. Immediately after the revolution in 1918. All of them, every single one of the main people who was involved in that. In that putsch. They were all killed."}
{"episode_id":"SW - #110 - 2020-07-30 - Nicholas Kotar - Fairy Tales are Better Than Vaccines","start":1391.28,"end":1391.84,"speaker":"Jonathan Pageau","text":"That's right."}
{"episode_id":"SW - #110 - 2020-07-30 - Nicholas Kotar - Fairy Tales are Better Than Vaccines","start":1391.84,"end":1409.78,"speaker":"Nicholas Kotar","text":"20 years later, they were all killed as something. By the way, that's really beautifully shown in a Russian movie because we want to talk about storytelling versions of history, not just. Not just, you know, beating people over the head with facts, but there's a Russian movie called Burnt by the sun that was directed. Directed by Nikita Mikhailkov, who's."}
{"episode_id":"SW - #110 - 2020-07-30 - Nicholas Kotar - Fairy Tales are Better Than Vaccines","start":1409.78,"end":1413.26,"speaker":"Jonathan Pageau","text":"Yeah, I saw that. That's an amazing movie. So beautiful."}
{"episode_id":"SW - #110 - 2020-07-30 - Nicholas Kotar - Fairy Tales are Better Than Vaccines","start":1413.34,"end":1414.54,"speaker":"Nicholas Kotar","text":"Everybody has to watch that movie."}
{"episode_id":"SW - #110 - 2020-07-30 - Nicholas Kotar - Fairy Tales are Better Than Vaccines","start":1414.54,"end":1423.5,"speaker":"Jonathan Pageau","text":"So powerful. And it's powerful in that sense where you see the general who. They come for him now and it's his turn now."}
{"episode_id":"SW - #110 - 2020-07-30 - Nicholas Kotar - Fairy Tales are Better Than Vaccines","start":1423.58,"end":1480.65,"speaker":"Nicholas Kotar","text":"And the scariest scene in that movie is when we see the rising image of Stalin on a blimp or it's like a hot air balloon and it's coming up and it's. The hot air balloon is covered by the face of Stalin. And the main character, who's this young, young new Communist who's come to destroy the old communist, he's smoking, he's thinking, he's kind of conflicted about reality. And he sees the image come up, his face goes dead, and he salutes to it. Yeah, and that's it. Like, that is the end game of any such political and cultural program. It's complete depersonalization in front of that power that's going to arise out of the ashes. Napoleon did it, by the way. And we tend to idolize Napoleon to say, oh, what a cool character he was. Napoleon was not a nice man at all. And the things he did to Europe were pretty bad. I mean, go and read your history for people."}
{"episode_id":"SW - #110 - 2020-07-30 - Nicholas Kotar - Fairy Tales are Better Than Vaccines","start":1482.09,"end":1559.59,"speaker":"Jonathan Pageau","text":"That's definitely one of the things that. One of the problems is that there is something about the way that the story is told in North America, which is that we only hear one version of the atrocities. You know, we hear the atrocities of the fascists, which of course we should, because it was horrible. And we should. We should definitely know about them, but we then ignore the other side. You know, we don't know about the atrocities of the. You know, we don't hear about the red wave so much, you know, it's. It's not taught. And so it's very strange. I have my theory. One of the theories, I think is because there's a sin, like, there is a sin in the fact that we won the World War II, right. Which is that we didn't win World War II. People say, oh, we won World War II. No, you didn't. World War II. We didn't win World War II. We won World War II by associating ourselves with a murderous communist regime. And now we have to hide that in our consciousness. We have to hide that and move on, thinking that we won, not knowing that we also. We did win. And of course, we defeated the fascists, which is great. But in that new origin, we gave half of Europe to a demonic, murderous regime."}
{"episode_id":"SW - #110 - 2020-07-30 - Nicholas Kotar - Fairy Tales are Better Than Vaccines","start":1559.99,"end":1585.58,"speaker":"Nicholas Kotar","text":"And we gave up all of our universities and all of the structures that raise our young people, who are now all come up as basically Neo Marxists, who, by the way, who have also been taught how to tell good stories. So this is part of the scariness of what's going on right now in the world around me. It's part of what's making me kind of go, what on earth? And how fast happened? What is happening? It's because they know. They know the storytelling structures."}
{"episode_id":"SW - #110 - 2020-07-30 - Nicholas Kotar - Fairy Tales are Better Than Vaccines","start":1585.58,"end":1612.15,"speaker":"Jonathan Pageau","text":"They have the symbolism. They have it. We lost it. Like, the Christians lost it because they were. There were too. They were too busy arguing about the age of the earth and about dinosaurs and about things that don't, like, matter in terms of your actual life. They started to see the Bible as just a bunch of facts that were aligned next to each other. Stop. And saw narrative as almost something demonic."}
{"episode_id":"SW - #110 - 2020-07-30 - Nicholas Kotar - Fairy Tales are Better Than Vaccines","start":1612.47,"end":1613.35,"speaker":"Nicholas Kotar","text":"Yeah, that's right."}
{"episode_id":"SW - #110 - 2020-07-30 - Nicholas Kotar - Fairy Tales are Better Than Vaccines","start":1613.51,"end":1623.67,"speaker":"Jonathan Pageau","text":"Like as if. And you can say it's funny. Like, I. I'm all for conspiracy theories, but one of the things that's interesting to watch is how conspiracy types, they hate symbolism."}
{"episode_id":"SW - #110 - 2020-07-30 - Nicholas Kotar - Fairy Tales are Better Than Vaccines","start":1624,"end":1624.28,"speaker":"Nicholas Kotar","text":"Yeah."}
{"episode_id":"SW - #110 - 2020-07-30 - Nicholas Kotar - Fairy Tales are Better Than Vaccines","start":1624.28,"end":1631.6,"speaker":"Jonathan Pageau","text":"Hate symbolism so much that every time they see a pattern, they immediately have to attribute it to a demonic force."}
{"episode_id":"SW - #110 - 2020-07-30 - Nicholas Kotar - Fairy Tales are Better Than Vaccines","start":1631.68,"end":1632.24,"speaker":"Nicholas Kotar","text":"That's right."}
{"episode_id":"SW - #110 - 2020-07-30 - Nicholas Kotar - Fairy Tales are Better Than Vaccines","start":1632.24,"end":1654.77,"speaker":"Jonathan Pageau","text":"Says that if there's a pattern, it must be someone who is manipulating. And there's. And I'm saying there isn't. Like, of course there are people manipulating, you know, politics from all sides. But. And you can. You can really see the end of that problem, which is that they hate narrative because they see it as evil in itself. So how do you get. So what happens is you've given up narrative to your enemy, and now they're gonna feed you."}
{"episode_id":"SW - #110 - 2020-07-30 - Nicholas Kotar - Fairy Tales are Better Than Vaccines","start":1654.77,"end":1736.44,"speaker":"Nicholas Kotar","text":"They're gonna feed you. Oh, and they are. They're feeding Some really, really impressive stories. I mean, how can you, how can you argue against this Black Lives Matter narrative? Now, I'm not speaking politically about this. I'm just talking about the way that they tell stories. Okay? You can't argue, you cannot argue with what they are saying because the best you can do is come up with some sort of facts that count to their facts. But it's not about facts. It's about the emotion that has come about as a result of this story being told in this specific way. And the story that they're telling is a good one, even if it's not true. And whether it's true or not is almost beside the point because it's the nature of the narrative, the way it's spoken, and the entire lack of narrative and worldview on the other side and the complete obliviousness to the fact that. No, no, no, no, no, wait a minute. This is a clash not of politics. This is not a clash of ideologies. It's a clash of worldviews. It's a clash of symbolism. It's a clash of story. Yeah. And if you start seeing it on that level, only then can you start, first of all having a conversation, and second of all, being able to internalize and to decide for yourself what is the actual way of relating to us in a way that would give your own life meaning. Because people are just being erased in this, you know, their own personality, their own stories are just being erased in this massive monolith that is this incredibly well told story."}
{"episode_id":"SW - #110 - 2020-07-30 - Nicholas Kotar - Fairy Tales are Better Than Vaccines","start":1736.6,"end":1780.15,"speaker":"Jonathan Pageau","text":"Yeah. But it's also a very simple story of a good, good guy, bad guy narrative. You know, and so it's very convincing because those stories are very powerful. You know, when you have an evil other, even if, for some, Even if it's weird, because the evil other, especially in the BLM narrative, is that because most people were. I mean, most people in America are so white, like, where it's like. I think it's like 20, 30% African Americans. And so most people have now taken on a bad guy narrative in which they play the bad guy role completely. And so I don't know, like, how you, how do you get out of that? Like, do you just self destroy? Like you just."}
{"episode_id":"SW - #110 - 2020-07-30 - Nicholas Kotar - Fairy Tales are Better Than Vaccines","start":1780.15,"end":1780.91,"speaker":"Nicholas Kotar","text":"That's the only way."}
{"episode_id":"SW - #110 - 2020-07-30 - Nicholas Kotar - Fairy Tales are Better Than Vaccines","start":1780.91,"end":1781.59,"speaker":"Jonathan Pageau","text":"Self destruct."}
{"episode_id":"SW - #110 - 2020-07-30 - Nicholas Kotar - Fairy Tales are Better Than Vaccines","start":1781.91,"end":1783.31,"speaker":"Nicholas Kotar","text":"Well, how have you seen it?"}
{"episode_id":"SW - #110 - 2020-07-30 - Nicholas Kotar - Fairy Tales are Better Than Vaccines","start":1783.31,"end":1785.91,"speaker":"Jonathan Pageau","text":"You've seen the flagellants? I saw the flagellants."}
{"episode_id":"SW - #110 - 2020-07-30 - Nicholas Kotar - Fairy Tales are Better Than Vaccines","start":1785.91,"end":1869,"speaker":"Nicholas Kotar","text":"Well, the flagellants and the people who are doing the digital blackface as an act, not simple, not simply of repentance, but as an act of identity angst, like I wish I had another identity. I wish I was not who I am. And there. And that is just. I mean, all kinds of lights are going on in my head. Because as soon as you separate identity from the grounded reality of who you are, where you are, in terms of, you know, your family, your history and your place and your nation, then, which has been happening for a long time now, but when it's then suddenly given this fever pitch by all of the things that are happening. I mean, David Brooks recently wrote a piece in the New York Times where he said that America is going through five crises at the same time. Yeah, that's about right. And it's just bringing to the fore all of the madness that has been going on inside people. And it's also showing how most people have no worldview. There's this incredible video, I think, or a photo, I'm not sure. I haven't seen it. Somebody told me about it, of somebody in an American grocery store. And he walks in, and this grocery store doesn't have all of the directions, you know, about which way to go, you know, where to avoid, which aisle."}
{"episode_id":"SW - #110 - 2020-07-30 - Nicholas Kotar - Fairy Tales are Better Than Vaccines","start":1869,"end":1870.32,"speaker":"Jonathan Pageau","text":"In what direction, right?"}
{"episode_id":"SW - #110 - 2020-07-30 - Nicholas Kotar - Fairy Tales are Better Than Vaccines","start":1870.81,"end":1909.44,"speaker":"Nicholas Kotar","text":"And he stops. He walks in, and he is petrified. He doesn't know what to do. He has no idea where to go. He has no idea who to be because he has no identity as it comes out. And he hasn't had an identity at all. And as soon as the external strictures that have been imposed, which are so comforting, you know, because this will control everything for us, but as soon as those things are removed, even for a second, massive confusion. Massive. Just fear. And this is why, more than anything right now, you need story more than anything else. Because story is the only thing that can start building you up piece by little piece, which is the main point of my article."}
{"episode_id":"SW - #110 - 2020-07-30 - Nicholas Kotar - Fairy Tales are Better Than Vaccines","start":1909.76,"end":1926.49,"speaker":"Jonathan Pageau","text":"Yeah, yeah. And the thing is. Yeah, I was going to say there's an interesting other video that came up, which is kind of the counterpoint to that one, which is the Karen video. Like that there's a lady at the aisle who, because they asked her to wear a mask, she starts throwing all this stuff out of her cart onto the floor."}
{"episode_id":"SW - #110 - 2020-07-30 - Nicholas Kotar - Fairy Tales are Better Than Vaccines","start":1926.73,"end":1928.29,"speaker":"Nicholas Kotar","text":"She's like, I'm not gonna wear a mask."}
{"episode_id":"SW - #110 - 2020-07-30 - Nicholas Kotar - Fairy Tales are Better Than Vaccines","start":1928.29,"end":1953.07,"speaker":"Jonathan Pageau","text":"And she's just, like, tossing her stuff out on the floor. And I'm like, man, we're losing it. Like, seriously, people, this is not. This is not going well. It's not going well on all sides. Oh, mercy. So, yeah, so we need. We need good stories, that's for sure. So all of you people watching this don't just analyze symbolism. Write good stories. We need better stories."}
{"episode_id":"SW - #110 - 2020-07-30 - Nicholas Kotar - Fairy Tales are Better Than Vaccines","start":1953.31,"end":2113.33,"speaker":"Nicholas Kotar","text":"Well, read them first, because if you go and start writing it right now, the likelihood is that you'll probably write some sort of. Some twisted version of something that isn't. That doesn't have the depth, because you probably haven't been formed enough, because we haven't been reading enough, and because we haven't been reading the right kinds of things. So that's partially what I want to do with that, with that new podcast that I'm doing for Ancient Faith is, you know, give people exposure to the way people told stories. Not only by retelling the stories that have been told for thousands of years, but also telling it through a modern voice, my own, because I'm translating them from Russian to English, but I'm also adding my own thing. I'm performing it for audio. So we have to internalize the stories that have been given to us. And if we have never had stories that have been given to us, then we need to find a tradition that we like and build it up. Because I think we've talked about this before, but it's very difficult to really internalize the truth of scripture if you don't already have substratum, an internal substratum of those categories and those realities that are put in place by good stories. Most people, you know, why was the gospel spoken at the moment that it was. It was the absolute fever pitch moment of the culture of a culture of extremely fervid storytelling being spread over the maximum amount of space at any given moment. It was the absolute perfect time to do it because everybody spoke the same stories, everybody knew them, and everybody spoke a similar language. And everybody would understand those categories when they were spoken about. Now and speaking from an American context, there was a. There was an article that I shared about how black slaves in America created their own storytelling narratives by taking stories from the scriptures and from their own pagan past and kind of reimagining their life and adding consolation and hope and the possibility of reclamation through that, through that storytelling tradition and how that eventually became things like jazz and stuff like this. You know, it was an incredibly rich way of dealing with. Of a very horrifying reality. And in the comment section of the post that I shared meaning on my Facebook page, when I shared the post, there were people just crying out to me for the lack of their home culture having a storytelling tradition. Americans don't really have a native fairy tale tradition. The closest thing you might have is something like the tall tales and the Paul Bunyan tales or something like this, but they're fairly recent. They're very culturally specific and they don't really have that same kind of depth as."}
{"episode_id":"SW - #110 - 2020-07-30 - Nicholas Kotar - Fairy Tales are Better Than Vaccines","start":2113.41,"end":2118.45,"speaker":"Jonathan Pageau","text":"You don't think that Wild west stories have that they play that role a little bit."}
{"episode_id":"SW - #110 - 2020-07-30 - Nicholas Kotar - Fairy Tales are Better Than Vaccines","start":2118.77,"end":2159.02,"speaker":"Nicholas Kotar","text":"They do, but it depends on which ones, you know, and those are very difficult to, to take up right now because of all the political issues involved. And it's. And they come from a close enough historical time period that it's not as safe as taking some of these, you know, ancient Russian fairy tales that were, that were told from the 10th century where you have, you know, the mythical king and the mythical hero and the mythical princess who of course all came from real historical realities. But there's enough distance from it and there was enough storytelling tradition happening over centuries that gave it the kind of sheen of eternality."}
{"episode_id":"SW - #110 - 2020-07-30 - Nicholas Kotar - Fairy Tales are Better Than Vaccines","start":2159.34,"end":2258.41,"speaker":"Jonathan Pageau","text":"But I wonder like, I wonder about if you look at the epic, John, like the epic genre in Greece and even in Persia or earlier than that in the Babylonian times or whatever, there really was a capacity to create complexity in the character. So when you read the Iliad, you know, even though the story is being told from the side of the Greeks, it's not clear who's the. Who exactly is right in this conflict. Right. There is a sense in which when Priam meets with Achilles, it's a beautiful scene where you feel such sympathy for Priam and then even almost more than you do with Achilles, who's supposed to be one of the heroes of the battle. And so I think that within the epic, let's say the epic genre, there could be a way to tell Wild west stories where the native people aren't represented as savages and that also the colonizers have. There's an ambiguity to their action on both sides and there's a meeting of two worlds. That's not going to go well. Some places it's going to go well. There could be ways to tell complex and powerful stories that wouldn't be just one sided, but could even heal. Because if you look at the Iliad, for example, the Romans ended up taking the side of the Trojans and they saw themselves as being descendants of the Trojans. So you can see how there really is a possibility to fit within a story told by Greeks that someone else takes the side of the Trojans and then it becomes a discussion between two civilizations."}
{"episode_id":"SW - #110 - 2020-07-30 - Nicholas Kotar - Fairy Tales are Better Than Vaccines","start":2259.28,"end":2293.86,"speaker":"Nicholas Kotar","text":"Jonathan, you have to have the capacity of holding more than one idea in your head at a time to be able to do that. And I'm increasingly seeing the inability to admit to the possibility of there being any complexity to any argument. One of the things that has happened as a result of Facebook and as a result of this particular brand of social media as it's come down to us, is that by its very nature, by the way that it's been created and by the way that is structured, it's intended to remove nuance. It's supposed to give you that immediate hit of dopamine from, you know, from getting a like or from getting rage."}
{"episode_id":"SW - #110 - 2020-07-30 - Nicholas Kotar - Fairy Tales are Better Than Vaccines","start":2293.86,"end":2294.86,"speaker":"Jonathan Pageau","text":"Bait is the best."}
{"episode_id":"SW - #110 - 2020-07-30 - Nicholas Kotar - Fairy Tales are Better Than Vaccines","start":2295.26,"end":2499.81,"speaker":"Nicholas Kotar","text":"Right? Of course. And what nobody talks or some people do, but what we sometimes forget about is that these systems were designed with that in mind. Like they were designed to do that to us on purpose. Because that. That's the easiest way of distilling the. The absolute most basic needs and wants that we have for the purposes of advertising to those basic needs and wants. I mean, there's some really interesting books that have been. That have made their way out recently about the, you know, the. The addictive nature of social media and how it seems to be. It seems. Especially when you have these. These crises, it's starting to. It seems to be eroding our ability, even intelligent people's ability, people who have, you know, who have education, people that I know are able to have a complex conversation about ideas they don't agree with. Something about the nature of this particular event at this particular moment in that particular medium is almost making it impossible to have any sort of conversation in which complexity is allowed to exist. And, you know, the, the idea with. With the Wild west stories is a really good one, but you need to have a community of creators and consumers of that creation who are willing to exist in that state of suspended, complex storytelling and not judge it. And that's actually why storytelling is so important. But you do have to break through a wall to get past the rational self. That initial movement from, oh, no, I'm not going to listen to your story because it's offensive and because you're a white man and because you're telling me things that should. That you have no right to tell me. Getting from that point to, oh my gosh, that's a really great story. I don't care about the color of the skin of the protagonist. There used to be a much smaller wall there. Right now it's massive. So there's a lot more. There's a lot more impetus on the storyteller to be able to draw people into that. That kind of nebulous nether sphere between, between your rational thought and your heart, where stories have their most power. And that's actually something that Elyon talks about in this article that I, you know, that I referenced repeatedly in my. In. In the symbolic world post that I did in that he. But he believes that the stories are. And I mean, it's interesting that he talked about fairy tales, like I mentioned already, during a time of intense ideological divide. Fascist versus Communist. This is. This is like the worst, right? Yeah, but we're recapitulating right now. And yet at that moment, he's like, no, no, stories, stories, stories. Why? Because if you allow yourself to get into that, that almost somnolent rhythm of the storytelling structures. And by the way, all stories start with a nonsense statement with some sort of absurdity that shocks you out of the reality that you live in some sort of bizarre concatenation of circumstances sometimes. In one of the famous priest stories in Russia is there was this muzhayk. There was this, you know, peasant man. There was another peasant man. They came at each other. They started punching each other until they were both bloody. And then there was a bull, and somebody stuck a. Stuck a sword, a knife into it, and gold came out of it. And in a certain kingdom, in a certain land. And we go to the story. So it's like every. Like, what on earth. What is happening? You've been shocked out of the reality, out of your everyday reality, and suddenly you're like, oh, we're in that part of. Okay, I can. I can deal with this."}
{"episode_id":"SW - #110 - 2020-07-30 - Nicholas Kotar - Fairy Tales are Better Than Vaccines","start":2500.37,"end":2500.69,"speaker":"Jonathan Pageau","text":"So."}
{"episode_id":"SW - #110 - 2020-07-30 - Nicholas Kotar - Fairy Tales are Better Than Vaccines","start":2500.69,"end":2501.41,"speaker":"Nicholas Kotar","text":"Yeah, yeah."}
{"episode_id":"SW - #110 - 2020-07-30 - Nicholas Kotar - Fairy Tales are Better Than Vaccines","start":2501.41,"end":2560.67,"speaker":"Jonathan Pageau","text":"And I think that that's been also one of the functions maybe of those types of stories, because they're using categories which are not charged a lot of these stories. Then they. They're able to reach everybody. You know, they. They don't. And. And the danger that we've seen, for example, you know, we saw some recent articles, I don't know if you saw. People were writing me in private about this, and they're asking, what do you think of this? What do you think of this? How people were starting to say how in token, the orcs were. Were racist. Right. Because the orcs were supposed to represent black people. And I thought I was like, guys, this is a dangerous. This is a dangerous road to go down. The people who are accusing these stories of doing that, because is that really what you want? Like, because it's not that in the story, but if that's what you want, then that can go both sides. That can go. It can go either way. It's not a good place to go in your discussion."}
{"episode_id":"SW - #110 - 2020-07-30 - Nicholas Kotar - Fairy Tales are Better Than Vaccines","start":2561.38,"end":2599.93,"speaker":"Nicholas Kotar","text":"Look, Fahrenheit 451 has it right. There are no books left. All books must be burned. It doesn't matter what they are, doesn't matter what they're good or bad or well told or badly told. If you're fascist or communist, all books must be destroyed. All right, that's. That's where it's gonna go if you go that way. And I'm not gonna talk about the idiocy of that, of that argument about works being black people. I mean, come on, give me a break. But of course, this only shows how if you've lost your connection to your nation's or your people's storytelling traditions, then you've lost your perspective on everything. And you're going to be able to be manipulated by anybody who has the best story or the loudest voice in the room."}
{"episode_id":"SW - #110 - 2020-07-30 - Nicholas Kotar - Fairy Tales are Better Than Vaccines","start":2600.33,"end":2661.82,"speaker":"Jonathan Pageau","text":"And you need to be able to understand. Like, it's so interesting. So one of the things, if you notice a lot, I've been emphasizing a lot, the idea of the margin. Like, I talk about that a lot because one of the things, in a way that I want to help, I feel like that's the band aid that needs to be put on, right? It's that on the one hand, you have people who are wanting to kind of move inside and cut off the margin. Like the conservative types, you would say. And then you all have people who live pretty much exclusively in the margin and who want the margin to basically take over the whole system, right? So I'm like, well, no, we need to put a band aid there. We need to be able to help people understand the function of marginality, its role in the giant pattern, show some examples of it, and then help conservative types understand also that, like, it plays a role in your story too. You need that stuff there as well. You can't completely get rid of it."}
{"episode_id":"SW - #110 - 2020-07-30 - Nicholas Kotar - Fairy Tales are Better Than Vaccines","start":2662.3,"end":2694.61,"speaker":"Nicholas Kotar","text":"You know, it's interesting, you mentioning the margin in that context really makes me think about something that's been going on. One of the arguments that traditional, that some traditional orthodox have been giving in support of the closure of churches has been, well, the hermits who lived out in the desert still had access to God's grace. Or are you saying that God was not able to come to them out there and like, okay, what you've just done is you've taken the existence on the margin and you're trying to make it into the staid center?"}
{"episode_id":"SW - #110 - 2020-07-30 - Nicholas Kotar - Fairy Tales are Better Than Vaccines","start":2694.69,"end":2695.33,"speaker":"Jonathan Pageau","text":"That's right."}
{"episode_id":"SW - #110 - 2020-07-30 - Nicholas Kotar - Fairy Tales are Better Than Vaccines","start":2695.74,"end":2718.1,"speaker":"Nicholas Kotar","text":"You've. You've taken it out of its proper context because what they're doing out there is battling demons For God's sake. That's their point. They're. They're winning for. They're winning the. The war for the entire cosmos out there. As soon as you bring that in here, you're bringing the mard. The chaos together with. With all of that back into the center. And the difference between home, the difference."}
{"episode_id":"SW - #110 - 2020-07-30 - Nicholas Kotar - Fairy Tales are Better Than Vaccines","start":2718.1,"end":2729.65,"speaker":"Jonathan Pageau","text":"Between you and the hermit is that the hermit is out there fasting and fighting demons, and you're watching Netflix. Netflix. And the demons are pouring in. You're like, come on, demons, let's go. I'm up for this."}
{"episode_id":"SW - #110 - 2020-07-30 - Nicholas Kotar - Fairy Tales are Better Than Vaccines","start":2732.29,"end":2763.76,"speaker":"Nicholas Kotar","text":"I just. I. It just drives me up the wall. It's like you have. You have no idea what you're even saying. You have no idea. Especially when it comes to the argument about not. Not having communion. Like, oh, those. Those hermits, they didn't have communion. Like, wait, no, they did. They did. How many have you not read all those stories about angels coming to them with communion? There's a lot of them. Those are not occasional stories. They happen all the time. And when those things don't happen, it's St. Mary of Egypt, you know, who's able to do these incredible things. And the one time she partakes of it is like the apotheosis of."}
{"episode_id":"SW - #110 - 2020-07-30 - Nicholas Kotar - Fairy Tales are Better Than Vaccines","start":2763.76,"end":2770.24,"speaker":"Jonathan Pageau","text":"That's right. Yeah. She takes communion one time, and she's basically in heaven right there because she can't live anymore."}
{"episode_id":"SW - #110 - 2020-07-30 - Nicholas Kotar - Fairy Tales are Better Than Vaccines","start":2770.24,"end":2770.64,"speaker":"Nicholas Kotar","text":"That's it."}
{"episode_id":"SW - #110 - 2020-07-30 - Nicholas Kotar - Fairy Tales are Better Than Vaccines","start":2770.64,"end":2772.84,"speaker":"Jonathan Pageau","text":"Her whole life has been moving up to that."}
{"episode_id":"SW - #110 - 2020-07-30 - Nicholas Kotar - Fairy Tales are Better Than Vaccines","start":2773.08,"end":2777.08,"speaker":"Nicholas Kotar","text":"Yeah. Do you live that way? Do you prepare for communion that way? No, you don't."}
{"episode_id":"SW - #110 - 2020-07-30 - Nicholas Kotar - Fairy Tales are Better Than Vaccines","start":2778.2,"end":2788.27,"speaker":"Jonathan Pageau","text":"Yeah, it's like you could say, okay, so if you agree that if you want all the churches to be closed and then us not having communion, then how about this? You fast until you have communion. How about that?"}
{"episode_id":"SW - #110 - 2020-07-30 - Nicholas Kotar - Fairy Tales are Better Than Vaccines","start":2788.59,"end":2789.15,"speaker":"Nicholas Kotar","text":"That's right."}
{"episode_id":"SW - #110 - 2020-07-30 - Nicholas Kotar - Fairy Tales are Better Than Vaccines","start":2789.87,"end":2790.59,"speaker":"Jonathan Pageau","text":"Don't eat."}
{"episode_id":"SW - #110 - 2020-07-30 - Nicholas Kotar - Fairy Tales are Better Than Vaccines","start":2790.59,"end":2793.31,"speaker":"Nicholas Kotar","text":"Eat three loaves in 47 years. Go."}
{"episode_id":"SW - #110 - 2020-07-30 - Nicholas Kotar - Fairy Tales are Better Than Vaccines","start":2796.27,"end":2830.1,"speaker":"Jonathan Pageau","text":"Oh, mercy. Yeah, yeah, yeah. It's crazy times. It's crazy times. All right, so before we all lose our mind here, let's. Tell us, tell us, tell us. Before we go, I want you to give us a bit of a sense of. I mean, obviously, I don't want you to spoil anything, but I want you to give us a sense of how you're closing up your Raven Son series and give us also a place where people can find your books and find your writings, and obviously, that book by Ilion, I'll put that even in the description if you want to get the translation that you did."}
{"episode_id":"SW - #110 - 2020-07-30 - Nicholas Kotar - Fairy Tales are Better Than Vaccines","start":2830.42,"end":2940.88,"speaker":"Nicholas Kotar","text":"Yeah, absolutely. Well, okay, so the book is. This series of books was started out with me kind of describing in story form my own spiritual journey. So the first book. First books are kind of. They're extremely symbolic, but the more. The closer they got to the end, the more I saw them as a kind of an Old Testament to another revelation, a storytelling time revelation, kind of an old kind of fairy tale version of the Old Testament. If we take Tolkien's idea of the evangelion of the incarnation as being the encapsulation of all stories, which he talks about in his famous essay on fairy stories. So this is kind of my addition to the genre in which Lord of the Rings exists, in which the Silmarillion exists, in which some other stories exist. They're explicitly pre incarnational. They're not peddling any sort of religious idea. It's more about the universal longing of humanity for something beyond themselves in a state and in a situation where they can't get that in any easy way, meaning there hasn't been any incarnation. There isn't an easy access to divine grace in any sort of meaningful fashion. Or it happens in kind of odd explosions of encounter that you can't really explain or only if you willingly embody a path of most resistance, sometimes leading into death. So this one is all about death. It's all. It's about the land of the death dead. It's about what it means to die and what it means to go through death to come to better life. And yeah, it's, it's. It's like nothing I've done before. And it's probably gonna really polarize people. I think it's gonna. It's gonna be one of those books that you either love or hate."}
{"episode_id":"SW - #110 - 2020-07-30 - Nicholas Kotar - Fairy Tales are Better Than Vaccines","start":2941.04,"end":2941.58,"speaker":"Jonathan Pageau","text":"Okay."}
{"episode_id":"SW - #110 - 2020-07-30 - Nicholas Kotar - Fairy Tales are Better Than Vaccines","start":2942.05,"end":2944.53,"speaker":"Nicholas Kotar","text":"I'd much prefer writing those kinds of stories anyway."}
{"episode_id":"SW - #110 - 2020-07-30 - Nicholas Kotar - Fairy Tales are Better Than Vaccines","start":2945.09,"end":2947.13,"speaker":"Jonathan Pageau","text":"So when is it coming out? Is it out already?"}
{"episode_id":"SW - #110 - 2020-07-30 - Nicholas Kotar - Fairy Tales are Better Than Vaccines","start":2947.13,"end":3001.08,"speaker":"Nicholas Kotar","text":"No, no. It's available for pre order. The ebook is available for pre order on Amazon, but it's going to be officially available on July 7, and at that point it'll hopefully be available in paperback as well. But at the very least, it will be available on all retailers in ebook format. Yeah. And you can find more about that on my website, nicholaskotar.com and the Il' in Book Foundations of Christian Culture. Just look for it on Amazon. Foundations of Christian Culture by Ivan Ilyin or Put in My Name. Sometimes it shows up because I'm the translator. And yeah, it's a very, very good book. It's one of these easy reads. It's not very long, but you could read it slowly for days on end, trying to understand everything that he's getting at. It's More important than ever. And perhaps not surprisingly, a lot of people are buying it right now. It's great."}
{"episode_id":"SW - #110 - 2020-07-30 - Nicholas Kotar - Fairy Tales are Better Than Vaccines","start":3001.08,"end":3001.64,"speaker":"Jonathan Pageau","text":"That's awesome."}
{"episode_id":"SW - #110 - 2020-07-30 - Nicholas Kotar - Fairy Tales are Better Than Vaccines","start":3002.2,"end":3002.68,"speaker":"Nicholas Kotar","text":"Yeah."}
{"episode_id":"SW - #110 - 2020-07-30 - Nicholas Kotar - Fairy Tales are Better Than Vaccines","start":3003.08,"end":3015.48,"speaker":"Jonathan Pageau","text":"All right. And I'm also looking forward to seeing your future contributions to our Symbolic World blog. And I was happy to see that you also popped in on the Facebook group. People were kind of engaging with you there. So that's awesome. I'm happy about that."}
{"episode_id":"SW - #110 - 2020-07-30 - Nicholas Kotar - Fairy Tales are Better Than Vaccines","start":3015.72,"end":3026.69,"speaker":"Nicholas Kotar","text":"No, I love, I love the fact that you're doing this blog and it's, you know, this past month I've been just. I wrote almost 70,000 words in a month of book five, so I needed to get it done."}
{"episode_id":"SW - #110 - 2020-07-30 - Nicholas Kotar - Fairy Tales are Better Than Vaccines","start":3026.85,"end":3027.33,"speaker":"Jonathan Pageau","text":"Wow."}
{"episode_id":"SW - #110 - 2020-07-30 - Nicholas Kotar - Fairy Tales are Better Than Vaccines","start":3027.33,"end":3030.29,"speaker":"Nicholas Kotar","text":"The Symbolic World is in the near future for me."}
{"episode_id":"SW - #110 - 2020-07-30 - Nicholas Kotar - Fairy Tales are Better Than Vaccines","start":3030.37,"end":3040.29,"speaker":"Jonathan Pageau","text":"Great, great, great. Well, it's great to talk to you as usual. And I wish you all the best in this craziness. And we pray to God that he can give us wisdom in these strange times."}
{"episode_id":"SW - #110 - 2020-07-30 - Nicholas Kotar - Fairy Tales are Better Than Vaccines","start":3040.53,"end":3042.41,"speaker":"Nicholas Kotar","text":"Yes, indeed. Thanks, Jonathan."}
{"episode_id":"SW - #110 - 2020-07-30 - Nicholas Kotar - Fairy Tales are Better Than Vaccines","start":3042.41,"end":3043.93,"speaker":"Jonathan Pageau","text":"All right, thanks, Father Deacon Nicholas."}
{"episode_id":"SW - #110 - 2020-07-30 - Nicholas Kotar - Fairy Tales are Better Than Vaccines","start":3043.93,"end":3044.53,"speaker":"Nicholas Kotar","text":"Alright, bye."}
{"episode_id":"SW - #110 - 2020-07-30 - Nicholas Kotar - Fairy Tales are Better Than Vaccines","start":3046.05,"end":3111,"speaker":"Jonathan Pageau","text":"I hope you enjoyed this episode of the Symbolic World. The Symbolic World is edited by Justin Ward and it is based on a videos that you can find on my YouTube channel, Jonathan Pageau's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course leaving a review on itunes. Everybody knows that's the best way to get the podcast out there, to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon Pageau videos as well and on SubscribeStar, all those links you can find on my website or in the show description. So thank you and I will see you soon."}
