{"episode_id":"SW - #060 - 2019-09-28 - Merlin's Last Laugh","start":0.4,"end":61.31,"speaker":"Jonathan Pageau","text":"I'd like to welcome you to the Symbolic World podcast. On this episode, I will be playing for you a video I did which is a retelling of an ancient Arthurian romance called the the Romance of Silence. It is a lesser known romance, but I think that it has quite a bit to say about the contemporary world as it deals with nature and nurture and the problem of identity and gender. And all these questions are kind of, are kind of brought out in this particular romance. And it also talks about laughter quite a bit. And I think that it has a lot especially related to the question of Clown World and all the last podcast that I put up, I think it is very relevant. So as you know, everything I'm doing here, this podcast, the videos I'm doing, is all thanks to your generous support. If you enjoy what I'm doing, if you like, please consider going to my website, the symbolicworld.com support where you will find ways that you can help out for, for all the patrons, everybody who."}
{"episode_id":"SW - #060 - 2019-09-28 - Merlin's Last Laugh","start":61.31,"end":62.63,"speaker":"Jonathan Pageau","text":"Is supporting the podcast."}
{"episode_id":"SW - #060 - 2019-09-28 - Merlin's Last Laugh","start":62.79,"end":85.75,"speaker":"Jonathan Pageau","text":"I give early access to some of the videos. Some people at certain tiers also get to ask questions, early questions at the Q and A. But ultimately I'm making a extra video a month for supporters. Usually it's going to be interpreting a traditional story, fairy tale, a myth or some legend or something like that. So I've done a few already and I'm looking forward to make more."}
{"episode_id":"SW - #060 - 2019-09-28 - Merlin's Last Laugh","start":85.75,"end":1277.12,"speaker":"Jonathan Pageau","text":"So enjoy. This is Jonathan Peugeot. Welcome to the Symbolic World. As my own life is still in somewhat of a wild, chaotic state, I thought that I could tell you guys a story. It's a story that I've been thinking about for several years. And it's a story which relates to what's going on today in the world. And, and so you guys have been following me, some of you been following me now for two years. I figure you're all ready to do your own symbolic interpretation. I'm going to tell you the story and hopefully you can all come to your own conclusions based on that story. And so the story is the story of a medieval romance called Silence. It is a lesser known romance, but it has garnered attention recently because it deals with certain issues. It is not the only romance with which deals with these subjects, but this one has a particular strength to it which is worth mentioning. It's called the Romance of Silence. It is part of the Arthurian romance cycle. In the Romance of Silence we find a situation in the Middle Ages where women were not allowed to inherit land. And because women were not allowed to inherit land, a certain Nobleman, when he has a daughter, he decides at some point to raise the daughter as a boy. In order that his land may continue on in his family. And so, as the child grows, the father is forced to tell the child, whose name is Silence, that we're going to say heed. Because in the text, the texts, they do say that Silence, they use the masculine pronoun in order to name Silence. And so the father tells his daughter that he must not reveal his true nature to the world. And must hide his true nature in order for his lineage to be able to continue. And so, in this romance, Silence grows up and becomes a knight, becomes a squire, becomes several things which are traditionally roles that men have. And excels at them. Becomes an amazing knight who's extremely strong and gets the attention of the king, even. And so this young knight, at the age of 15. Is brought into the king's court, you know, as this prodigy who is going to help the king in his different problems. And all through the story, there are two characters which appear, two allegorical characters. One is Nature, and the other is Nurture. And these two characters will argue with Silence during the entire story. About whether or not Silence should act according to her nature. Or whether or not she should act according to this nurturing that she has received. And so the different characters, they discuss, they debate the problems of one or the other. And so the question is, who is going to win? Is nature going to win? Or is Nurture going to win? Because in terms of nurture, Silence is a man. But in terms of nature, Silence is a woman. And so the question is, who will win in the end? And so Silence arrives in the king's court. And immediately the king's wife, the queen, becomes enamored with Silence. Especially seeing that Silence is a valiant knight. And that Silent is able to perform several feats. And so the queen tries to seduce Silence and wants to take Silence as her lover. But Silence, of course, refuses her advances. One, because he's an honorable knight, second, because he is a woman. And for all those reasons, he refuses the queen. And the queen is extremely angry with Silence. She is so angry and jealous that she accuses Silence of trying to rape her. And so she accuses the Silence before the king that Silence had tried to rape her. And the king is dismayed because Silence is one of his best knights. Silence has acquired all this honor in his court. And so he does not know what to do to dishonor his court, but also to. To humiliate himself, humiliate his own entourage, all of that he is dismayed. And so the queen has an idea. There is a legend, there is this saying, which is that Merlin has fleed into the wild lands. He has become a wild creature. He has let himself completely go and exist as a wild man in the forest. And. And there is this legend, which is that Merlin cannot be caught by a man, but can only be caught by the trickery of a woman. And so the Queen tells the king, send Silence out to try to catch Merlin, and because he is a man, he will not be able to catch Merlin, and therefore he will be dishonored. You can tell him that if he. If he does not catch Merlin, he has to leave your court, he cannot come back, he cannot be hired by anybody, and you can destroy him in that manner. And so the king tells this to Silence and says, you have to go into the wild area and you have to catch Merlin. And so Silence goes out in order to catch him. He arrives in the wild land and he. He hears of a way that maybe he can catch Merlin. Merlin has been living like an animal on wild nuts and roots, and he has become covered in hair, you know, he is this hairy beast who lives out in the wild. He has lost all memory of civilization, all memory of himself. And so Silence decides to put out some meat because the human, humans, human beings are carnivorous, especially if it is well cooked. And so he puts out this meat, but he also puts out a few other traps which I'll tell you later. He puts out this meat. And so he hides and Merlin comes out. And Merlin, giving in to his nature, you know, he has now nurtured himself into being a wild man. But suddenly remembering and. And being reconnected with his human nature, he devours the meat without thinking, and he eats this entire piece of meat. And he finds himself to be extremely thirsty. And so Silence has laid out something to drink for Merlin. But Merlin does not know that what Silence has laid out is a jar full of honey. And so Merlin drinks this honey. And having drunk this honey, he is even thirstier and thirstier and thirstier. And looking out, he sees something else to drink. And then he finds this jar of milk. And so he drinks up this milk. And so, having drank a jar of honey, and having drank a jar of milk, he finds himself thirstier than he has ever been before. And so right ahead of him is another drink that he can have. And that drink, of course, is wine. And so Merlin gulps the wine without thinking and falls into a drunken stupor. Now, I won't tell you the Meaning. But I'm hoping that in some of the comments, you will try to analyze the relationship between him remembering his nature, eating meat, eating. Drinking honey, drinking milk, and then ultimately drinking wine. Let's see who can come up with a good interpretation of that. All right, enough parentheses. Let's continue. And so Silence finds Merlin in this stupor. And Merlin is surprised. How is it possible that this man has caught me? But Merlin looks at Silence and already begins to snicker. He begins to have a secret laugh rise within him. So Silence tells Merlin that he has to bring him back to the court and that Merlin has to answer for different things. And as Silent is bringing Merlin back to the court, the people hear about this, and they start to assemble, and they start to get ready to. To receive Merlin. But along the way, Merlin comes up, and he sees this poor man who is walking around, and he is holding a pair of brand new shoes, this peasant who is holding a pair of brand new shoes. And Merlin starts to laugh. And Merlin starts to snicker and snicker. And he's struggling to hold it in. And so he's laughing. And Silence asks him, why are you laughing? Why is the poor man holding a new pair of shoes making you laugh? But Merlin will not answer. He will only laugh. And so, as he's going further, he sees in front of a church, a group of mendicants, a group of poor beggars who are begging for their food, who are begging for a little bit of money. And Merlin starts to laugh even more, and his laughter is louder and more uncontrollable. And Silence asks him, merlin, why are you laughing? Why are these beggars here in front of the church? How is it that they're making you laugh? But Merlin will not answer. Merlin will only laugh. And his laugh is getting louder and more uncontrollable. And as he gets closer and closer to the town, he walks in front of the cemetery, and he sees a man who is burying a young child. And next to this man burying his young child is a priest who is saying the prayers. And he is sensing the to. And then Merlin loses control. And he is on the ground holding his belly, laughing and laughing and laughing. And Silent says, how horrible is this? How can you laugh at. How can you laugh at this situation? What is making you laugh in this situation? But Merlin will not tell her. And all he can do is laugh. And so silence drags him back, drags him back to the court and brings him into the presence of the. The king. And so, as the. The as Merlin enters, he enters into the court and all the noble people and everybody is surrounded him. And the king is asking, first of all, the king is asking him, you know, first of all, you lied to us. You told us that only a woman could catch you. And here a man has caught you. You have. You have borne false witness. You have said something which is untrue. How do you account for that? But also, how is it that you laughed at this point, poor man holding his shoes? How is it that you laughed at these beggars? And how is it that you laughed at this child who died and who was being buried by his father and incense by the priest? And Merlin looks at the king and he starts to laugh at the king. And he is laughing and laughing and laughing, and no one knows what's going on. So Merlin looks around and he sees this nun who is coming and who is accusing him on the ground. And he looks at this nun and his laughter, it just keeps going on. And he's pointing at this nun and he's laughing at this nun. And the queen is enraged and she's screaming, how is this possible? What is this insult? And then Merlin catches a glimpse of the Queen. And of course, his laughter gets worse and worse, even still. And so there he is. He is laughing at the Queen. He is laughing at the king, at this nun. He is laughing also at himself. And he is laughing and at silence as well, every time silence appears in his. In his view. And so the king is getting angry, and he says, merlin, you have to tell us. You have to tell us why you are laughing. So this is unacceptable. This is. This is unacceptable behavior on your part. So Merlin tries to call himself, tries to calm himself, and says, first of all, tell us, why did you laugh as you were coming back to the castle? Why did you laugh as at the poor man who was holding his shoes? And then it all begins. Merlin moves from a moment of laughter, uncontrollable laughter, to beginning to reveal the secrets which are hidden behind the appearances. He begins to show how the appearances are concealing, how the appearances are upside down and are concealing a secret underneath. And so he says, I laughed at that man, poor man who was so proud of his new shoes, but who would die before even reaching his house. So the king dispatches his soldiers and he finds the poor man who has died on the road back to his house. So he says, well, then, why did you laugh at these poor beggars who. Who were there standing in front of the church? And so the king, Merlin says, I laughed at those beggars because there they were, begging for the tiniest morsel, you know, acting as if they were poor, as if their environment was completely barren, as if everything was desolate around them, when in fact, right under them, under the ground, was hiding a treasure of immeasurable wealth. And so they pretended that they had nothing, that their resources were finished, but in fact, they had an infinite amount of wealth beneath them. So the king sends out his guards and he digs up the ground and he finds the treasure which Merlin had said. And he sees it. Merlin, now, until now, he has been revealing all these secrets. So finally he says, why did you laugh at the child who died and whose father was burying him and the priest was incensing him? And he says, I was laughing because the father should not have been crying. Little did he know that the father was not the father of that child, but the father of that child was the priest who was incensing the grave. And so the father should not have been mourning the child of the priest which he would have been forced to raise. And so then we come to the final moment. Why did Merlin laugh when he was arriving in the king's court? And so then Merlin says, I laugh because I laughed at four people. I laughed at you, O King. I laughed at myself. I laughed at the. Actually, there's five people. Actually, I laughed at the Queen. I laughed at this nun. And I also laughed at silence. He says, I laugh because amongst all those people, there are two tricks and there are two who are being tricked. And two of those people should be laughed at because they are being tricked. So the king is like, enough of these puzzles. Enough of your puzzles, Merlin. Tell me straight out what is happening. And so finally, Merlin reveals the secret. He reveals the fact that that nun is not a nun, that the nun is in fact a man who is dressed as a nun in order to be sneaky. I won't use Gad Saad's expression, but who is acting as a sneaky person getting into the Queen's chamber and is in fact the queen's secret lover? And he says, I also laughed at you, King, because you were being tricked in that situation. I also laughed because I was tricked. I was tricked because, in fact, silence is not a man. Silence is a woman. And so then the king, of course, puts two and two together. How is it possible that silence tried to rape his wife if silence is a woman? And so Merlin said, I was also laughing at myself because I was tricked by a woman without even knowing it. I was brought back by a man who was in fact a woman. And so they take the nun and they take Silence and they remove their clothing in order to see the truth. And it says in the text that everything was in its place. And I think that statement is the most accurate and the best way to put it of how Merlin's laughter, his uncontrollable laughing, a trick upon a trick. This double inversion brought about a re establishing of normal order. And then the king announced to Silence because he understood that the reason why this happened was because women did not have any place in society before that, because that women did not have ways to participate in their lineage. And therefore the king announces that from this day on, women will be allowed to inherit. And not only that, but of course for the story to end well, Silence becomes Silencia and she now becomes the queen and marries the king. And everything, everything finishes and everybody lives happily ever after. And so that is my little story. I told it to you, so maybe we can see how you all can interpret it yourself. And it also feels nice for myself to laugh because laughter is sometimes the best way to find your way out of chaos and tragedy."}
{"episode_id":"SW - #060 - 2019-09-28 - Merlin's Last Laugh","start":1278.88,"end":1343.81,"speaker":"Jonathan Pageau","text":"I hope you enjoyed this episode of the Symbolic World. The Symbolic World is edited by Justin Ward and it is based on a series of videos that you can find on my YouTube channel, Jonathan Pageau's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course leaving a review on itunes. Everybody knows that's the best way to to get the podcast out there to get it heard. And if you want to get involved, you can also support the podcast financially going to www.thesymbolicworld.com support or else on Patreon Pageau videos as well and on SubscribeStar, all those links you can find on my website or in the show description. So thank you and I will see you soon."}
