{"episode_id":"SW - #205 - 2021-12-02 - November 2021 Q&A","start":12.08,"end":7962.94,"speaker":"Jonathan Pageau","text":"This is Jonathan Peugeot. Welcome to the symbolic world. So hello, everybody. Month of November. Wow. This last month had been just completely insane. Like just one of the craziest months that I've been through. But a good, like in a good way. Not in a bad way at all. Just a very good crazy month. All right, let me just put the chat out here. All right. And so I'm gonna have a few announcements to make before we start. And there is my friend Brad. Nice to see you, Brad. In the chat, it's good to know that you're. That you're there. I always forget to ask if they're going to be moderators in the chat, but it's good to know that. That there are some. All right. So last month has been just nuts. I mean, a lot of things happening. A few things. Oh, Lisa is there in the chat as well. Lisa, thanks for coming. That's cool. It's like the middle of the night for her. So it's always awesome to know that she's, that she's there nonetheless. So last few months have been crazy. One thing I forgot to mention at the last Q A is there are two priests. So Father William Bennett and Father Nick Mihaly. Father William Bennett is at a St Nicholas parish in New York City. It's a. It's a Carpatho Russian parish. And Father Nick Mihaly is also at a St. Nicholas parish in Erie, Pennsylvania. They, last month they, they had someone, I think in, in the parish in New York had passed away and had left a huge amount of books to the church. And so Father William knew, Father Nick knew that I had been flooded and, and that I'd lost all my iconography books. And so they arranged together to send me like just an amazing trove, like 30 books. Just amazing. Some books that I already had that I'd lost. And then a few, few amazing classics that I didn't own and a few surprises as well. So I just. Very grateful to those parishes for, for, for sending me those books. I mean, it, it's a. It really is a treasure. Some of these books are from Russia. Some of these books, even if I wanted to find them, it would. They would be very difficult to find. So thanks to, to, to both of you, Father William and Father Nick. So this month has been God's Dog, basically, if you guys want to know what's been going on, the biggest thing. And so we started God's dog on Halloween, October 1, last month. And it really shot up. We had put a minimum goal of 30,000 just to be able to print the amount that we wanted. And we shot past that in the first day, went to like 40,000 in the first day and then within a week we had reached 100,000. And of course it slowed down a little bit after that. But we're still going, you know, every day we still add about $1,000 every day. We're at 133,000 over. I think we, I think we've, we've gone over 2,000 books and going out and so it's just really amazing. We've had some great coverage. We have articles written by post millennial geeks under Grace Liberty Nation. I'm going to be on Matt Fradd's channel in a few days. A few things that were recorded that haven't come out yet. So, so I'm just really grateful. So if you haven't backed God's Dog, I don't know, it's like I've been talking to a lot of people and we really feel like there's a moment right now, there's a moment, there's a time for a shift in storytelling and we're just really excited that we can play a little role in this. So it's the first graphic novel in a series and so go ahead. It's godsdog.com if you want to back it. There are plenty of stuff. You can get a signed St. Christopher print carving. For me, it's the only time that I'm going to print out this St. Christopher image and it seems it's pretty popular because I'll be signing a lot of stuff. Let's say we've just been really excited about that now one of the things we're going to do is we're going to do an NFT project with God's Dog. This has been super interesting to me because I think this is possibly the most controversial thing I've ever done. Who would have thought, you know, I'm writing, I basically wrote a book about a dog headed Saint who's with St Christopher, who's a dragon slaying saint and with the Leviathan and giants and Nephilim and all this stuff, you know, I've done talk to some very controversial people on my channel but it seems like doing an NFT thing is the most controversial thing that we've done. But I've been thinking a lot about it and some very, some people that I respect quite a bit like, like Vin Armani who has written who he has written me and expressed some, some, you know, some questions about why I want to do this and, you know, a question of NFTs themselves. And so I talked to Matthew about it quite a bit. We talked for like half an hour on the phone. And I'm going to put out a video on the symbolism of NFTs in the next maybe a week or so, or maybe two weeks if I don't have the time, and trying to maybe explain how the NFT is related to something like St. Christopher, how it has to do with the margin and it has to do with something like a place where heaven and earth don't completely meet and what function that can play in a system. And so we're going to talk about that. But the nft, the NFT thing that we're setting up is going to be related to the story itself. And so we're going to put out different levels of rarity in the NFTs and they will unlock secrets that are related to the story of God's dog. And so some symbolic secrets, even a cryptographic secret. And then ultimately the top level will actually have an extra page of, of, of the comic book which will also reveal something which is kind of hidden in the story and which is coming later also, which will be revealed a little later in the story. So we're just excited to see, to try to use this, the NFTs as a way to think about ownership and to think about secrets and to think about cryptography, all of this. And so we're going to be putting that into the very system that we're setting up. And so if you're interested in the NFT project, you have to send me your email. You have to find my email on my carving website and send me your email address. We already have all over 100 people that are involved. And so this will, that'll be launching in the next two weeks, before Christmas for sure. And so, yes, so that is happening. And the biggest thing, I think, like one of the, I guess in a way it's even bigger, but for me it wasn't as big because I recorded it several months ago. But Jordan Peterson finally put out the discussion that we had with Bishop Barron and John Verveki. Also he put out a talk that I gave at the Jung association in Montreal. And so that's been, I mean, it's been great to just have these ideas bubbling out. And in the wake of that, I also published a talk with Bishop Barron and John Vervicki on my own channel. So most of you are here, probably aware of that going on, but it's just been great and A lot of opportunities, people reaching out to me, really interesting people, and hopefully we'll see what plays out. You know, Jordan has been. Has been really, really great and trying to introduce me to all these theologians in Cambridge and these theologians in Washington, D.C. and all these people. So it's kind of funny because I'm still introduced as a Russian Orthodox icon carver, which I think at this time has become a pretty. It's always become like a joke. It's like, here's this Russian Orthodox icon carver and now he's going to talk about the relationship between Genesis, Cogsci and phenomenology. So anyways, it's pretty funny. I actually kind of enjoy still being called an icon carver at this point. So. So, yeah, so that's something that's going on. What else is there to talk about? Okay. So, yeah, another last announcement is this week. I am. I'm. I'm making. I'm. I guess it's because it's Cyber Week and everybody's having sales and on their different platforms. So I'm having a sale this week which started last. It started at the beginning of the weekend and it's going to last until December 4th. And the sale is on kind of all my platforms. If you on my merch platform, SymbolicWorld Store, you can get 15%. And also for my icon carving classes, you can get 15%. And at checkout it's Pajo 15. So if you want to get into that, I'll probably be posting a few ads during the week just to make sure people can take advantage of that. If you want to get Christmas gifts, it's still time to do that. And so, yeah, so, so many things going on. So. All right, so let's just go. So Lisa says, is Johnny doing money laundry? Not at all. The funny thing about this is I'm not going to get any of this money. The NFT project and the crowdfunding for Indiegogo, I'm not going to take any profit from it. I've kind of the reason why I wanted to gather this money in the crowdfunding and the NFT project is to have funds to invest in the next book so that we don't have to wait and we don't have to. Let's say we have the freedom to hire artists if we need to. We have the freedom to maybe even print it on our own budget if we have enough money and distribute it through Amazon if we have to. So if we can. So we're trying to figure out a way to get enough funds so that we don't have to be dependent on anybody and we can just put out the story the way we want to. And so I'm not going to be making any money from this NFT project. All right, okay, so here we go. So let's start on the questions. And so these questions. So most people might know, the people who support me on Patreon at $10 or more, they can ask questions in advance. And we have too many questions. We used to open up super chats so people could ask questions here, but it's just become too unwieldy. So, so what we have now is moderators going through the questions and picking questions that haven't been asked many times, picking questions that are clear. And so we were trying to limit ourselves at around 50, 50 questions for, for the Q and A. And so, so, so, yeah, so if your question didn't get picked this month, try to write a more clear. Try to write a clearer question and try to see if that question has been asked before. You usually can find questions as clips on the Clips channel to know if that question has been asked before. All right, so ten minutes of announcement. That's a lot of announcements. All right, guys, sorry, but it's just been a crazy. It's just been a crazy month. All right, okay, so here we go. So we start with the Symbolic World website. So C Streetsel asks, please explain the symbolism of the Orthodox icon of the Holy Trinity. It has three angels sitting around a table where Abraham's offering has been placed. All right, and so a related question on the Trinity also. Hi, Jonathan. I've noticed that in some renditions of Rublev's Trinity icon, the head of the calf is depicted in the bowl on the table. Is this simply a remnant of the icon's origin as the hospital hospitality of Abraham, or is it something symbolic? There's something symbolic going on. And so, yes, yes, and yes. So I mean, the symbolism of the Orthodox icon of the Trinity, especially the one by Rublev. What Rublev did is that the image of the hospitality of Abraham is one of the oldest images. We have versions of it in some of the early Roman churches. There's a mosaic, for example, in St. Mary Major, where there is a little mosaic of the hospitality of Abraham. And the hospitality of Abraham is when the three angels came to visit Abraham and Abraham served them a calf. But also it's the moment where the angels discern that Sarah is pregnant. But the image of the three angels has been seen by the church fathers as an. As an image or as A hinting of the Trinity from the very beginning. And so what Rublev was able to do was that he was able to reduce the image to its most simplest terms. In the older versions, you would see Abraham and Sarah coming to serve the angels. You would see, for example, young man, you know, killing the. The calf. So you could see different things in the image. But now in the version of Rublev, you really have it simplified and. And the way that it's done, it's very powerful because the way that the angels are sitting around the table, they open up in a manner that, you know, it feels like you are coming towards the table. And so now the table in the icon of Rublev becomes, of course, the Eucharistic table. It becomes a table of the sacraments. It also, in a way, becomes a hint at theosis, at divinization, that is, that the Trinity is asking us to join into the life of the Trinity, to come and be with them in their communion, and so to participate in that communion. And so the angels aren't identified as the different members of the Trinity, but usually the way that it's understood is, at least for sure, the image of the angel in the center is Christ because of the color of his vestments and because of the way that he's kind of holding his fingers. And then after that, it becomes a little more ambiguous, I would say, in terms of interpretations. I've read several, and I'm never completely satisfied with the interpretations. As for the calf, which is on the table, I do really believe that it is suggestive of the Eucharist, and it is suggesting the. The sacrifice of Christ and of the relationship between the blood, the flesh, and the bread and the wine. So that's what's going on there. Hopefully, that answers that question. It's a. It's probably one of the most famous Orthodox icons at this point. All right, so Cormac Jones asks. The stories I was raised on were all either materialistic or humanistic in harmful ways, which have caused me to develop an emphasis on discernment as a survival technique. As a result, I also have trust issues with stories. I'm suspicious of mythologies other than those central to the Church, which have never hurt me painfully. This distrust forms a barrier between me and my Irish ancestors, who by all accounts, belong to the Church, but whose stories can stray from the center. Can you help? Does it have to do with stores being garments of skins? I mean, you could understand the idea of garments. Maybe not. You could say garments of skin, but you can understand that there's a hierarchy in stories and that that's really the way to deal with it. And so if you have a kind of level field where you believe that all stories are the same and that all of them have the same importance, then I can see why it would be a struggle for someone like that to be able to sympathize with some ancient mythological stories or folktales or fairy tales. But if you have a proper hierarchy, then it doesn't bother you so much because you see them as kind of flowing out of the central story of Christ, even though they might precede it in time. You can see it as whatever is good about those stories is that which kind of hints towards these mysteries. And I think it's really important to be able to have other stories besides the biblical stories, because sometimes it can help you see things in the biblical stories that you didn't see before. And so by being able to notice the similar patterns and sometimes similar but contrasting patterns in other stories and in other folklore, then it can, it can help you. Yeah, it can help you see the stories in the scripture more clearly. It can also help you see Christ more clearly. And so you could say that it's like that for every exterior thing, that every exterior thing, you know, in the proper. In its proper place can actually help you see. Can help you see Christ more clearly. So J. Grubb asked Umberto Eco is interesting given his massive knowledge about medieval and Renaissance Europe. I don't quite know how to take his novels, however, and was interested to know if you have any thoughts in particular. I just finished Foucault's pendulum, which seems to adopt a position halfway between postmodernism and symbolism is inevitable in that the plan for ruling the world appears to be put together by cynical tricksters as a joke, and yet appears that they were being used to bring about the plan. And so, I mean, Umberto Eco is definitely a materialist and a materialist in all the. In all the worst ways. He has a lot of knowledge about, not only about the medieval tradition, but also about kind of Western tradition and Western esotericism. You see his knowledge of Western esotericism more clearly in Foucault's pendulum, for sure. And there are some interesting things to. To glean from him. You know, I myself, you. It can help you understand a little bit the problem of causality, for sure. Like the way that you talked about how in Foucault's pendulum, what happens is they, you know, the people who are kind of talking about all these secret societies, they basically Invent a secret society that doesn't exist, then in inventing this secret society that doesn't exist, it creates a vacuum that attracts all these. These types of people that are looking for mystery and looking for secret societies. And so the society ends up existing in the end, even though at the outset they just made it up. And so it can help you actually understand how causality works and how it's saying how the idea of the placebo. The placebo idea could be raised up into other forms of existence. But I do think that in the end, he is. I don't think that Umberto Eco believes that symbolism has a reality the way that we think it. I think that he probably sees it as projections of the human psyche that nonetheless can have an effect on the world, because we live in a human world. But I've used. I've used, for example, like, forget the name of the characters, but in one of the. In Foucault's Pendulum, there's the girlfriend character. At some point, she does this amazing deconstruction of symbolism. And she basically talks about how, you know, the reason why the head is related to, let's say, heaven and all these higher notions is that you don't knock your head against things, rarely. But the feet. You knock your feet against the ground and. And, you know, she reduces it to, like, these super basic bodily body features. Quite crass also, actually. But I keep. I kept thinking, and I think I wrote this in an article, that she was right. Like Umberto Reko. Umberto Echo is right in that understanding. It's just that he doesn't understand that it's actually a reflection of real patterns in the world. And so, you know, there is a relationship between feet and darkness and dirt and all these things. And it plays out symbolically in a true analogy. So it's not. It's not just a projection. All right. Okay. So David Flores says, I discovered Saint Simeon Stylite recently and was excited to see that you have incorporated him into God's dog. Please elaborate on what is your favorite symbolism from his life? And so, I mean, Saint Simeon is awesome because, you know, so Saint Simeon basically is a saint who lived on top of a pillar. And he just stood there on the pillar and he just prayed all day. He did prostrations and he prayed, and he became basically the center of a monastery. At some point, everybody started flocking to him. Kings would come and ask him his advice. You know, there. There are, like, these stories about how people who would want to go up there to do him Harm would just die, you know, in strange accidents. So what. So he's just there at the top of the world, and he basically acts as an. As an authority figure. And it can help you understand how just placing himself up there in humility, because that was really important because at some point, people thought that he was just being arrogant. And so the ecclesial. The ecclesiastical hierarchy came to see him, and they saw him at the top of this pillar, and they said, all right, you know, you come down right now. And he just didn't ask any question, just started coming down the pillar, and they're like, no, no, no, no, no. Stay, stay. Stay up there. If you're gonna be. If you're gonna actually obey us to come down so easily, stay on the pillar. And so he stayed there. And so you can. Can help you understand also how. How stillness can be the cause of action, right? How someone cannot do anything but still become a kind for other things to work and other things to exist. And so Simeon acted almost like the axis of a wheel like this still point in the middle, around which. Where the world started turning. And so, for example, there are these traditions that they took the acts of the Council of Nicaea to him and that he had to kind of approve them. And there was this sense in which if he didn't approve the acts of the council, that who knows, maybe it wouldn't have been. It wouldn't have been. Wouldn't have been orthodox. So. All right, so Patrick asks. Hi, Jonathan. Thank you for all you do. I'm trying to write a short story for the Christ and Tolkien conference and can't get out of the feeling that my ending is a deus ex machina. Can you talk about the symbolism of this pattern, specifically, if there are any positive examples in stories or if it is generally just lazy storytelling? And so I think it's possible to use the. So for those who don't know, a Deuces machina is a solution which appears at the end and basically solves everybody's problem. But it is not a solution which appears out of the process. Let's say the psychological or the process of the story itself, right? And so it's like Superman appears at the end and just, you know, gets all the bad guys. And so it isn't. That's the story, right? So you. You get. You get. You get versions like that, you know, of stories and ancient stories, especially the Greek stories. That's where it comes from, the Greek world, that they would use this story. And so. And Aristotle really wanted stories to, to resolve themselves out of the psychological reality of the characters or out of the. Out of the. The story itself. Right. So the story itself would resolve. Would have the elements in order to resolve the story. So I think that it is possible to play with the deus ex machina ending, but you would have to be very aware of what you're doing and you would also have to. You have to do it in a smart way. But I don't know what else to tell you, but I would say it's probably better to. To resolve the story out of its own. Out of its own logic. Sorry. So Gardner Brothers asked the apostle John ends his gospel saying, Jesus did many other things as well. If every one of them were written down, I suppose that even the whole world would not have room for the books that would be written. What do you make of this? Yeah, I can't help but see a connection between this passage and the fact that the Christian story permeates most other stories. So in this way, the acts of Jesus that John doesn't have space to mention truly have filled the whole world. Is this a stretch? No, it's not at all a stretch. I think that's exactly what they're implying. I think that they're basically implying the idea that what Christ did does fill up the world. And that here's a limited version of it, but ultimately not only now, but you could say in all of time, it will basically fill up the whole world. And I think it's also a way to connect Christ to the divine Logos at the beginning to saying. So it's like, you know, in the beginning was the Word, and the Word was God, and the Word was God. And so this Word shines into, go, moves into the darkness. And so you start with. You start with. You know, I've often showed. I don't know if some of you will have seen this, but I've talked about how in the icon of Christ, the Pantocrator icon, you have Christ with his right hand speaking, right? This is a speaking gesture, you know, or, or blessing. And so you have Christ doing a direct gesture. And then you have in his left hand he's holding a book. So there's this direct and indirect, which is related to also the beginning and the end, right. The start and the finish. And so you can see it that way, in that pattern, which is that the story starts with Logos, light, you know, God, and then ends with the idea that the world could be full of book of could. If the acts of Christ were written down, the world would become a book or be full of a book. And so that's the book that Christ is holding, you could say, in his left hand. It's a good way to understand it. You can understand it also as the heavenly Jerusalem, as this fixed thing, this fixed civilization, this structure that is now fully kind of revealed and fills up the cosmos. So that's the best way to understand it, in my opinion. So a bit not bothered, says. You mentioned the movie Midsommar in a previous video. The main American student characters seem not to understand that their participation in the festival has serious consequences, regardless if they believe in it. In the current culture war, what do modern secular people not understand about participation? Thanks. I think that it's a good intuition that. I think that what's going on even now is that people don't understand that it's about participation. And so even though they will participate and they do participate, they don't necessarily understand the stakes of participating. And so the fact, for example, that. The fact, for example, that the state in many places, for example, where I am, wants us to actively do certain things that permeate all the way into our churches, all the way into our. Into our relationship is about participation. And so the masks and all of the social distancing. I saw a video today where the Spanish. What is the Spanish prime Minister saying? That they're not going to remove the mask. Even if Covid finishes. As long as there's the flu, they're going to keep the mask. So it can help you understand that it's about making people participate. And so I think that people don't realize that this is what's going on. So by making you participate, it's much. It's much better for you to become what they want you to be than having you agree or disagree with what they're saying. You know, by physically embodying and doing things, then you are. You are colonized in a way that is far more. Far more embodied or far more goes deeper than just saying that you think this or that you think that. So I think that for sure, people don't seem to understand what's going on in kind of, let's say, yeah, let's say, reprogramming us in a certain manner. So Siara last asked, is there a difference between the earth and the world, or difference between heaven and earth and the world? How do we understand the difference symbolically? So, I mean, I think that the earth in the heaven and earth in the primordial sense, earth is just potential. And so you can have different Relationships between what's above and what's below. And so when we talk about the world, it's usually to a certain extent something which is manifesting heaven, which is actively manifesting heaven. Whereas the earth, at least in Genesis and at the outset, is like something like darkness. It's just this potential for existence. So I think there's a. It's a little different, but it. The reason why you think it's the same is not, it's not silly. It's because, you know, we often represent the duality of heaven and earth, or heaven and what's above and what's below as what is non manifest, let's say heavenly pattern and what is manifest and so what is happening. And so in that way, it's not a completely silly relationship that you're doing. It's just that you can see it. You can see this opposition in many ways. You can see it, like I said, like, like that of that which is invisible in pattern and then the manifest patterns in the world. Or you could see it as that which is invisible and pattern and that which is invisible and potential. And then in the middle being the world of the cosmos as the joining of the two. And both are totally appropriate. It just depends on the circumstance and what you want to emphasize. But it's good that you're able to distinguish them as well. Right. So Alberto says, I'd be interested in what you think of this. I'm watching your recent Jung Society talk. I was remembering that Gaudi, on many of his buildings, crowns them with a cross, but he uses a three dimensional cross that resembles the origin in a Cartesian sense. That this ties with your explanation that at the top is the origin and from it comes reality. Yeah, for sure. A three dimensional cross is one of the. Let's say it's almost like a more powerful version of the cross itself because. And it's not. These three dimensional crosses exist, you know, on churches as well. They're not just on Gaudi's buildings, they existed on other. On other churches, you know, and so you can understand that as the cross in its fullness, because it is like the four direction of the earth and then the vertical axis of the world you can imagine like an axis and a wheel with spokes. And so it really is a. It's one. I think it's definitely the most. The fullest version of the cross is something like. Something like a three dimensional cross. So. Yeah, your insight is quite good on that, for sure. So Joey says, hi, Jonathan, could you explain the connection between the Divine Liturgy and the dinner table. How are these rituals connected? And thank you in advance. So, so the liturgy, or, you know, especially the. The Eucharist has many aspects to it. And so the relationship between a dinner table is one of them. It's not the only one. And we have to be careful because especially in the modern times, especially it's like the Catholics in Vatican ii, and then maybe before that, some Protestant strains before that, they tend to want to reduce the. To remove the sacrificial aspect of the Eucharist, to remove the altar aspect of the, of the Eucharist and make the altar just into a table, like a meal, a table meal where we, like I talked about in the icon of the Trinity, where we're invited to come and eat. So we're invited into communion at this dinner table. And so there is a. But there is a relationship. It's not, it's not. It's not just that. And so you can understand that the manner in which you eat together at the table with your friends, with your family, you are manifesting communion. That is, you are, you are feeding on the same body, right from below. That is, you're eating the same potential. And, and you're manifesting a team, like you're manifesting a communion because you're sitting together and you're looking at each other, you're speaking with each other. And so eating together is very powerful. It's a, it's a very. It's one of the most powerful symbolisms that we have. It's also so primordial. Right? And so, so you can understand that. It's, it's eating together at a table is participating and embodying the communion of the people that are together. Because you don't eat with strangers. You can eat next to a stranger, right, In a restaurant, in a cafeteria, but you don't eat with them. It's not the same. We know it's not the same. When you eat with someone, you are engaging in an act of communion with them. So now take this up to the highest level that you can, and you can understand that one aspect of, of the Eucharist is that. Which is that we are all eating the same body and blood of Christ. We offered that body up as bread and wine, you know, and now it's coming back to us as the blood and body of Christ. And as we eat it, we are also becoming a body. We're becoming the church, we're becoming the body of Christ. And that is the ultimate form of communion. And so communion, eucharist is a meal. And in that sense it has a higher version of the same type of symbolism that you have, you know, when you're sitting with friends or at the, in a family eating together at the table. All right, so Ramal says hi, Jonathan, any thoughts about Bhagavad Gita and Vedic lectures and how it differs from our Christian perspective? Recently seen your video about Buddhism and the all and the one about duality in the clips channel. Thanks for all your work. And so I think, like, it's the same, you know, with just like anything in, in, in Vedic literature, in the stories, you know, in the, the. The kind of epic stories that exist in the, in India, the Bhagavad Vita as well. There are some very powerful gems to be found there, you know, in Advaita. In Advaita Vedanta, there are things that are very. Resemble Christianity in terms of the. Even their metaphysics. You know, it goes so far that someone like David Bentley Hart says that he's a. That he's basically a Christian Vedantist, you know, and so there are relationships to be found. And you know, you see that. For example, I mentioned recently how there is definitely a relationship between the Bodhisattvas that sacrificed their nirvana out of compassion or for those that are still in the world and the manner in which the. The manner in which the saints also act as patrons for us in, in the world as well. And also the idea that you see sometimes in orthodox writings about how, you know, people almost. Someone was telling me this about Saint Therese de Lisieux. It's a Catholic, a Catholic saint that supposedly she. She wrote in, in her, in her text that she would not go to heaven, not go to heaven unless all would go to heaven, something like that, and that she would remain until the end of the world in order to pray for those who. Those who are left behind. And so, you know, you see a little bit of that now. The problem is always a problem of hierarchy. It's always the problem of people seeing things equally and therefore they won't be able to discern the story. You live in the story, you participate in the story which feeds you. And these secondary stories for you, like these stories that appear as interesting as secondary, as fascinating, surprising, you know. And so it's all about. So it's all about hierarchy. It's also about hierarchy of attention. So if you're a Christian, but all you read is, are the different sutras, like all the, you know, different Mahayana sutras, then there's a problem, right there's a problem in the manner in which you're dealing with your Christianity. You probably have to, you know, reorganize your hierarchy of attention in order to make sure that you. You're not. You're not becoming schizophrenic and kind of alienating yourself. So, so, yeah, so I. Like I said, I think they're different. I've. I've. I've quoted the Bhagavad Gita and I've quoted. I think. I think I even coveted Ramakrishna. And, like, weird, not Ramakrishna. Why am I mixing up that name anyway? It doesn't matter. Some, some Advaita Vedantis, like, I've quoted them before. And so I think that it's. That it's, that it's possible to do that. I'm pretty sure I mix up that name. I think. Didn't I think that was the guy from Theosophy that I just mentioned, which. No, I would never cite that guy. All right, sorry. See, it shows you. I don't really know much about Hinduism. Not at all. All right, so Paul Jordan says, please help me to understand the serpent imagery in early American revolutionary symbolism. I've been thinking about this late a lot lately, and I just don't get it. I know that many of the American Founding Fathers were Deist and Freemason, but I'm pretty confident that most of them were raised Anglican and therefore would have a thorough understanding of what a serpent imagery means from a Christian perspective. Put this alongside the long mystical, Catholic and Orthodox and of course, scriptural tradition of portraying Our lady trampling serpent underfoot. And I don't get why these men were so willing to use it. So I don't think I've ever seen that. I don't know. Like, I would have to see what the actual. What the actual thing is, I guess just have to do with the idea of the. The snake being cut up in terms of liberty or death. I get the don't tread on me symbolism. I mean, I have to think about it. The snake is not bad in itself. And, you know, I've mentioned, you know, like, I've mentioned it before, bishops in the Orthodox Church have a staff with two snakes on it, you know, and often the iconostasis will have dragons and snakes on them. And so it's not like, like snakes are bad in themselves. But, you know, I think that often it seems to me that the snake in the, in the American way, especially the don't tread on me idea, it has to do with a refusal of authority and so it's the idea that, right, there's a snake on the ground. The don't tread on me symbol is a good example. It's like, don't try to impose something on me or else I'll bite you right from below. I'll get you from below and that. And, and I'll, and I'll, you know, and so I think it seems to have something to do with the refusal of authority. And if you look at that image that I was, I just saw of the serpent getting cut up, then you could think of it something like, you know, we have this serpent which is very powerful, to come up and bite the king and to kill the king, to kill, to get rid of the authority. And so if we, if we cut it up, you know, then, then we don't, if we're not together, if we're not joined together, then we won't have that power to strike from below. And so you could say that that is possibly subversive because, you know, it makes sense with, the symbolism is coherent, but it's, it's also a little scary to think of that when you, that you imagine yourself that way as this, as this snake that will refuse all authority. Yeah. And I mean, it goes to, it, it says a lot about the problem of American culture like that. I'm not, like I've said before, I'm not a libertarian. You know, I can, I can complain about a lot of the insanity that I see in the modern state and the insanity that I see in, in these, kind of the, these, you know, the government's becoming stronger and stronger, but I'm also definitely not a libertarian. I think that hierarchy is inevitable. And so, so I, I'm not attracted at the, you know, at the outset towards images like this. All right, so. Hi, Jonathan. I'm asking this question as a request from my 15 year old nephew, Carlos. This is Eric Salander asking, he wants to know the meaning of the meteorite striking the statue in Daniel's Interpretation of the Dream. He has started to go to liturgy with me as well, and I'm very proud of the way he's excelling in life. Well, cool. That's awesome, Eric. Eric has written some really great articles on the Symbolic World website, by the way, if you guys want to check it out. So it's not a meteorite. I don't know why you think it's a meteorite. It's the, it's the idea of an, of a, of a, an uncut stone, a stone not cut from human hands. And so maybe you could interpret it as a meteorite. But I usually that's not the way that it's. That it's interpreted. It's like a stone which falls from a mountain. You see that the images of, for example, the Mary. Sometimes she's called the uncut mountain or the mountain from which the uncut stone has come down. But in terms of the actual symbolism of the statue of Daniel, you have to understand it as the statue of Daniel is a hierarchy. It's a Golden Age, a Silver Age, a Bronze Age, an Iron Age, and the end of the Iron Age. We're in the toes, where the toes split into 10. So imagine you have the head at the top. You have one at the top with the crown, the golden crown, as the head. And then you have the two arms, right? And then you have two arms on the torso. Then you keep going down. It's two, and then it ends in multiplicity. It ends in ten toes. And the ten toes are the end of the age, the end of those four ages. And the ten toes are mixture. They are a mixture between. Between iron and clay. And so you can imagine that as the hierarchy goes down, the metal at the top is the most precious, the most light and also the most shiny. You could say the most incorruptible, but also the least strong in terms of physical strength. It's the weakest. It's the weakest metal in terms of. You can make a sword out of. Out of gold, right? And so as you go down, the metals are less precious, less. Less light, darker, you could say they're also. They're also, you know, harder and more akin to something like. Let's say, something like a weapon. So as you go down, you get to bronze, of course, that's when they made. You can start making swords with bronze. And then iron, which is the hardest, the strongest of metal, but then moving towards that strong and hard, at some point it starts to become brittle. So the very process by which you make something hard and powerful, if you lose its flexibility in materiality, and also you lose its unity in terms of moving towards the crown, it's all. All these analogies are playing out together. Then you come to something which is a mixture and which is multiple and which is brittle. So those are the toes at the bottom. And so then you can understand that in that situation, an event will happen, right? An event which is, let's say, a purely natural event, one which doesn't participate in this hierarchy of meaning, this hierarchy of technique, this hierarchy of technology, the hierarchy of meaning, the hierarchy of civilization, all of these things. That something will come from the outside, something not made in the system. And once the system is brittle, it'll smash it, and that's it. So you can imagine, for example, that it could take several forms. Often it's seen as Christ. How Christ basically smashed the Roman Empire, how Christ came down and restarted the whole. A new world, let's say, a stone not made of human hands. Purity, all of these things. And so that's what it means. Usually Christ is seen as this stone, but you can understand it as a pattern of a cycle and how a cycle ends, you know, when it comes to, to these last moments. Yeah. All right, so Kelly Madden asked. A breakthrough in symbolic understanding. Happened to me when I sat alone on a beach and observed. I could see land rising above with water, with square built houses, seagulls, flying waves and so forth. I wonder how many people today have ever seen the stars without light pollution. Don't the physical circumstances of mediated urban life pose a huge obstacle to our ability to grasp the ancient worldview? May I experience it? May I recommend these experiences to our community here? Yeah, you're right. You're totally right. You know, the city, the city, let's say the artificial city, what it does is preserves you from the pattern in a certain matter. Not totally, but it protects you from the dangerous aspects of the pattern. But it also isolates you from the higher aspects, let's say. And so you can imagine, you know, how in, you know how in, in scripture it says at the end of times the stars will fall from the heavens. Well, there's something about a modern city that. That's what it is, right? It's like you can't see the stars in the heavens anymore. And the stars are on the, on the earth. And so the light comes from below and it's this artificial light that is lighting up everything. But because of it, you can't see the divine patterns anymore. You can't see the stable patterns which are in the heavens. And so I agree. And so going up a mountain like you said, sitting on a beach, or just going into the ocean, all of these things can be definitely helpful in kind of seeing how the world lays itself out symbolically. All right, so Will asks, why pray for the souls of the dead? And then there's a related question. Let's, let's, let's answer this one and see if I can, if I end up answering everything. So the best way to understand that is that you don't pray for the souls of the dead, at least not ultimately. There's a manner in which the. At least in the Christian story, there's a man in which what Christ reveals a transformation of death. So it's mysterious. It doesn't completely make sense in terms of. If you're just paying attention to the limited temporality. But if we. If you listen, for example, to the. The Homily of St. John Chrysostom, which we say at. At Easter, at Pascha, every year, at the end of the homily, it says, hades is empty, Death is empty. Christ has vanquished death, Death has been overturned. Death has no power. Basically, death is gone. And so it's mysterious because it's like we look around and we see that, okay, when people still die, but there's a manner in which Christ has vanquished death and has also in a certain way, transformed the very nature of death. So when we're praying for those that have fallen asleep in the Lord, for those that have, those who have died in the colloquial sense, we don't understand them as being dead. We understand them as being very much alive. And not only alive, but also praying. If they are in Christ, like if they are in the church, then they're also praying. They're praying for us. We're praying for them in the same way that we did while they were on the earth, right? We prayed for them, they prayed for us, and we pray for their salvation. They pray for our salvation. And so we continue to do so after death. You can understand it somehow, like, there aren't two churches, there aren't two bodies. There's only one body. There's only one body of Christ, and that body is eschatological. And so all those that have died before us in Christ are alive in Him. And ultimately we will all be together in Him. But through our prayers, through our praying for each other, it participates in us coming together. So I hope that answers that. It's hard. I know it's hard for some people to kind of understand that. And why that. Why that's actually a very important part of the transformation that Christ brought about, let's say, and the way in which we understand that. All right, so Jason Schweitzer, supposedly it's related. Let's see what it says. I'm not sure if I'll get this question in time or not. Okay. I've heard there is an idea, possibly within the Catholic tradition, that one can pray loved ones out of hell after they have deceased is 2 Samuel 21:10 a symbolic image of this? No, not at all. If not, what purpose is this scripture trying to convey? I guess my question might be on symbolism of moving someone's bones. And so, Samuel, is that. Is that the story of the. Is that when King Saul. Oh, no, this isn't what I thought it was. I thought it was when. All right, I don't want to look into this right now, but. And let's say in Catholic. In Catholic tradition, you could say it this way, that maybe you can't really pray someone out of hell. You can pray them out of purgatory. I guess that's probably the best understanding of Catholic, in my understanding of Catholic, the way the Catholics understand it. But I would say that there is one story in the ancient church of a church Father. I forget which church Father it was who said that he prayed incessantly for the soul of an. Of a pagan emperor and that he was. It was revealed to him that. That he was able to. To basically get him out of hell, you know, and so love. Love covers a multitude of things. And we. We need to understand it. We have to always. Like, it's just hard to talk about this stuff because I don't. People tend to understand it technically or understand it like, they have weird ideas about what it is that we're talking about here, what it is that it means. And so maybe you could ask yourself, do you believe that prayer has an effect on people's spiritual life in the world? Now, do you think that praying really makes a difference or not? So do you think that by praying for someone you can affect their own state? Now, if your answer is yes, then it's the same answer for those that are not in their bodies anymore. It's just the same. But how is that, like, what exactly does that mean? Is not super clear. So maybe, let me. Let me say. Let me try. I'm trying to try to help you guys, because I'm trying to avoid this becoming one of those weird things where we believe things that don't mean anything anymore, right? It's like at some point sometimes when we talk about these things, about life after death, and we talk about these types of interactions, they don't. They don't mean anything to people. We believe them, we say them, but they don't mean anything. And so when you pray for someone, right, you hold them in yourself. You're remembering them. You are connecting them to you, so you're bringing them to a certain extent in communion with you. This has to do with the idea of God remembering Noah or Noah remembering God. Or Jonah remembering God when he was in the depth of sheol, like when he was in the depth of the ocean, when he was basically in death. Remember that that's what's going on in that story. And that the memory of God is what lifted him out. The repentance. His repentance and his reconnecting to God. Remembering the temple, remembering God is what brought him out of death. And so that is true of God, but it's also true at a lower level for all of us and the way in which we interact with each other. And so by remembering someone in your prayers, you are connecting them to you. And to the extent that you're connected to others, to the extent that you are connected to God and that those others are connected to God, that's a real thing. It's a real binding of people together and a kind of dance of prayer. It's the best way I can explain it. And I just want to be careful because I know that, like I said, these things can become arbitrary really fast. So I want to be careful that it doesn't sound arbitrary. Hopefully this is a little helpful to understand. So. Yeah. Or maybe I just confused you guys a whole lot more. Sometimes I feel like that, especially during these. During these Q and A's, and I'm just confusing people more. All right, so Mark says, greetings from Tbilisi. Wow, cool. I heard you use the word fractal a lot. Is dimensional a more accurate word? By and by the. By that Mandelbrot fractal image, the zooming into different repeats only seems to work if the zoom occurs on the edge of the pattern. I mean, I don't know. I'm not sure how you use the word dimensional. I think the way that we use the word fractal is really just to help people understand that it's a pattern that repeats itself and that is made of itself, but it. Not in a. It's also not in a. Not necessarily the Mandelbrot, let's say. Fractal is great because it's. It's not just a repetition of the exact same pattern. It's almost. It is like a dance where bigger patterns are made of smaller patterns which are related to the bigger patterns, but aren't exactly the same. And so you get this kind of similarity and difference at different places, the patterns. And so I agree, like, obviously, if you. If you just zoom into the dark, into the absent part of the Mandelbrot pattern, you're not gonna. You're just gonna. I mean, I imagine it'll Be dark for a long time before you actually encounter something. But I'm not sure what you mean by dimensional, so. All right, so enough of the symbolic world questions. So one question from the people who Support me on SubscribeStar. So Little Joe asks. Hi, Jonathan. I love your work. Thank you for your podcast with Bishop Barron. Quote John Paul, too. The church must breathe with her two lungs. Just wondering if you have ever heard of Full Metal Alchemist brotherhood. If not, it is so deeply symbolic. I'm sure all of your followers would appreciate your analysis of it. And so it's interesting because, like, my daughter. My daughter was really into anime. She's not so much into anime anymore, but she was into anime for, like, about a year. Like, about, like, when she turned a little bit before she turned 13. And she really, you know, we were really looking for an anime that we could watch together. That wouldn't be. Because she was. She's smart and she's kind of mature. Like, that wouldn't be too. That wouldn't be too childish, but also not too crazy. And so we decided to watch. To watch that series together. We watched a few of the episodes, and there's some really in. Definitely some interesting stuff in there. Definitely some interesting things in terms of the idea of, like a kind of a bad incarnation. You know, this idea of something that is in a shell that isn't fully embodied but is kind of this. This arbitrary, almost arbitrary relationship between heaven and Earth. And there's also, you know, there was this weird episode about hybrids and stuff that was very well understood in terms of the symbolism. So, yeah, so there were some interesting things, but we ended up just not. It just. We didn't. We just stopped watching it at some point just because school started and then everybody's busy and. And so. Yeah, but I mean, sure, maybe one day. I really don't watch anything these days. I tend to. I have waves sometimes. I'll watch a few things, and then I just move on. There's so many things to do in life, basically, right now. There's so many things to do. All right, so. So let's. Now we are moving on to Patreon. All right, so Christian Swenson asked, what is the symbolism of symbolic thinkers? What role do people like you, Jonathan, play in the symbolic world? What is the pattern you play out? And so it depends. It depends which way you could see it. Like, what we hope is that in a way, we are. We're acting as something like. We're acting like a crutch in a way, but crutch like you could say we're acting like garments of skin. We're acting like a way to help people walk again. But it's also dangerous because explaining symbolism can get. Can make people. Can trick people. Not trick. I'm not trying to trick anybody, but can delude people in thinking that they, that they. That they've got it because they can explain it, but explaining it and living it are not the same. And so, and so it's a. We're playing a tricky game where we're kind of walking between trying to help people have those intuitions on their own, trying to help people go back to church in the broad sense of getting, you know, re involved in symbolic worlds and explaining it enough so that people don't just think we're spouting gibberish, you know, so. So. Yeah, so. So I think that that's the role we play. Yeah. And we hope that we're not ruining ourselves, you know, sometimes because you think like if just explaining it so much. Yeah, it's dangerous. All right, so Maximus Magyar asks, are objective and subjective useful terms for talking about reality while consciousness plays a role in all manifestation? How about John Abervakey's word transjective? That's fine. I mean, I use the words. I tend to use those words a little subversively because I obviously don't agree with. I tend to, like. I'll tend to, for example, want to show that the subjective is objective in the way that people think about it kind of in a vulgar way. You know, the idea that. Because we have this weird idea that somehow the subjective is idiosyncratic and the objective is stable and true. And. And it's the problem of this object, subject relationship in. In the first place. But sometimes I play with it. You'll notice that I'll talk about how that's one. One's experience is objective. And so it's like, it's obviously. It's obviously in a way a misuse of language. But. But I think it's because use. When you use. If you use a new word like transjective, I'm not sure people will know what you're talking about. And so, you know, I think that if you, if you couch it and you, let's say, accompany it with other words, maybe, you know, but I think that that's sometimes like one of the thing in. In John's. Sometimes in John's descriptions is that he's taken so much time to really define very precise words because he. He really is. Wants to be sure that he's super precise and, and so it's extremely useful and extremely powerful. But if you just drop into it from the outside and you hear like, you know, a, a good, like a good way to understand it is like go to John Vervicki's channel and watch, you know, like It's a. Episode 50 of the Meaning Crisis series. And so if you just drop in, obviously you won't understand anything that he's saying. So it's a build up, you know, and that has a lot of value because once you get to the episode 50 and you know what he's talking about, you know, it's like you can just see how it all comes together. So. So I wouldn't use the word transjected myself, but there are some words that John uses that I do use, ones that I think that are immediately available to people that would watch my video for the first time. Although, yeah, I say that, but I'm sure a lot of people watch my videos for the first time and they're like, what is this guy talking about? Just complete, complete random. I love the term like. I like relevance realization. I like that term. I think it's not that hard for people to just drop in and understand. I love the word combinatorial explosion. I think that's an easy word to get. So, so. But there are other terms that he uses. For example, like you know, when he, when he talks about affordance, I think that requires people to, to kind of dive in and see what it is that he's talking about. And also the word transjective, I think is not easy access, but it's a good word. I mean, it's fine. I don't have a problem with it. So Nathan Condon asks. Hello, Jonathan, what is the symbolism behind the saying sins of the father, they are not the responsibility of the son. What of the son who takes on the responsibility himself to amend those sins. Thank you. So a good way to understand that is that you could see that the sins of the father fall on the son. And this, you could understand it in a broad sense that, you know, the actions we pose, they create worlds, they create bodies. And even if we leave those program, you could call them programs, let's say a good way to understand it. Like you, you create programs. And even, and even if, let's say you, you leave, those programs will run and they'll run in other people as well. And so someone, I mean the example of like, let's say the son of an alcoholic is a good. Is a great. It's an easy example to understand, but it applies to so many other things too. So you can, you can imagine that a father, an alcoholic father, will, those sins will fall upon the children, will affect them directly because obviously you might not have a very good father if he's an alcoholic. But also certain patterns of behavior will kind of will program themselves into the children. And so you definitely. So it can be a good idea to take on the sins of your father. Take on the responsibility of the sins of, of your father in the sense that even though you're not responsible for the. You're not responsible for those effects that have appeared on you, but if you take them, then you can re align them. But if you just act as a victim and you just act as someone who is a victim of circumstance and has, and you don't become aware that this, these patterns play out in yourself, then you're going to be that. You're just going to be like a reed in the wind. You're just going to, you're not going to be able to, to transform that reality. So. All right, so Nick Scott says hi, Jonathan, by the time of this Q A, I will be laid off as a result of medical mandates. I would like to ask you to clarify why you think this is not the mark. I'm not trying to suggest you're wrong or to paint you in a corner. Just hoping to better understand what's happening to me and my family right now. It certainly feels like I've been excluded from society both directly, no income, and indirectly can't take my kids to a hockey game without it. Thanks for your time and God bless you and your family. So, Nick, I'm sorry to hear of your situation. I'm sorry to hear that you're going through this. And so maybe let me be clear about this. You know, what's happening is definitely one, scapegoating is definitely the setup of an authoritarian system which is creeping in and taking up more and more space. And this authoritarian system is using scapegoating as a means to be accepted by the population by creating the image of those that don't want to participate as being the cause of the problem. This is what's going on now. This is evil. It's an, it's an evil we are, we are facing with a growing evil and a growing danger. That is true and that is completely cannot be ignored. Now having said that, these things have existed before, right? So authoritarian states, scapegoating ways of identifying people that don't want, that aren't inside and Using them to bring about more and more authoritarian measures is something which has happened before. And so does this type of behavior participate in, let's say, beast symbolism? Yes, it does. And I've tried to explain this before, especially if you understand the revelation as a system, as a symbolic structure which reveals how society lays itself out, how certain interactions happen. You know, I've often talked about how, you know, for example, Weimar, from Weimar to the Third Reich is a moment where the beast killed the whore and where these types of authoritarian measures are being set up now. So the reason why I say it's not the. It's not, let's say, the epitome or the. Let's say it's not completely what's being described in Scripture is that at least for now, there is no direct apostasy. No one's asking you to, to, let's say, to engage in apostasy in order to be. In order to. To get this. And so that's the reason why I'm saying it's not now. I'm not. I haven't. I've been vaccinated, you know, and because of the authoritarian system which is setting itself up, you know, I definitely intend to resist as much as I can. Like, resist as much as my will. God, God willing, is capable of helping me resist. But I also, I harbor no ill thought to those that did get vaccinated. It's like some people don't perceive what I perceive. They don't perceive that this is moving into scary territory, that, that. And also some people have a different barrier of a different limit into what it is, what type of authoritarian measures are acceptable and which ones aren't? Because we've already seen many authoritarian measures that we all participate in or that are moving towards authoritarian measures that we participate in. So it's like, where do you draw the line? Where do you decide? No, this I'm not going to do. So I think that's up to each of us. But I think it's dangerous to say. I think it's dangerous to say that it's the thing. But I think that those who act as if what's going on is not happening or that it's not a big deal, that we've moved from a situation where freedom was the. Where freedom of movement, for example, was the basic right of all. And now we've moved into a system where basically the authorities are allowed to ask for your papers, are allowed to ask you to identify yourself. And I think that that's a massive change. And those who don't think that that's a massive change. Are deluding themselves if you aren't reading. For example, like I suggest people read Paul Kingsnorth Substack. He's been doing a great job at explaining the system, let's say the machine, the modern machine, and how it's playing itself out almost automatically, revealing itself to be what it was even before COVID before all of this, that it was already this. But now we're seeing. Let's say we're seeing the face of it more clearly. And so. So, Nick, I'm sorry to hear about what you're going through. And I know several people here in Montreal that are some people in around the symbolic world that are dealing with the same kind of. Same kind of problem. So. Yeah, so I don't know. I don't know. I don't know. I could say is say a prayer for you and hope things don't get worse. Matthew F says, what is the symbolism of the roles of prophet, priest and king? So a good way to understand. I mean, you have to. You maybe have to separate it. First of all, you could separate it between something like spiritual authority and temporal power. So you can start by having something like the spiritual authority above and then temporal power below. The king receives. The king is anointed by the spiritual authority. The king finds his legitimacy in spiritual authority because the spiritual authority is that which binds us to a higher purpose. And by receiving his authority from a spiritual, Receiving his role and his crown, let's say, from a spiritual authority makes him more than just a thug, is the only way to say it makes him more than just someone who uses force to impose his own will on other people. Because obviously states often easily, rapidly degenerate into that. And so by. By receiving his power from above, you could say it limits that to a certain extent. Not completely, but it does. Now, if we look at the spiritual authority, then you can separate it into two. You could say, and so the prophet is something like the direct authority, and the priest is something like a mediated authority. So the prophet. So it's really similar to like left hand and right hand symbolism. So the prophet, on the one hand has visions, has intuitions, is visited by God, visited by the spirit. Sometimes that becomes a little wild. Things get a little crazy. You know, sometimes even the vision or the experience of God will manifest its ways in manners, which are a little slightly strangely illegitimate. Right. Think of, for example, when God tells Ezekiel that he has to cook food on human feces. It's like sometimes some of the prophets experiences Is. Is. Is a little outside of the bounds, let's say. And so then you. What you need is also, you need another. A binding tradition. You need. You need something like the priests, which are related to ritual, which are related to law, which also are chosen or have a kind of succession, you know, and they have functions, clear functions, whereas prophets don't necessarily have clear functions. They can sometimes, but often prophets are just. They just like to come down the mountain, you know, with the word of God or whatever. But that can be super dangerous if it's not. If it's not mediated by. By an ecclesiastical hierarchy. So an example of that today is something like the relationship between monks and clergy. And so in, let's say on Mount Athos, there are a bunch of, like, hermits up there and Mount Athos who live in caves and who get visitors and who say things that are sometimes a little wild. And, you know, they have these direct intuitions and, you know, like, what is it that someone was. It was Father Andrew, Andrew Damick, who was telling us about the naked ascetics, right, that, that Saint Paisios talked about how there are these invisible naked ascetics that live up in the. In on Mount Athos and, you know, that can manifest themselves. And so it's like that kind of stuff, man, that's some intense stuff. And Saint Paisios knows these, these naked ascetics that are. That are there. And so, but so you need something like hierarchy of priests in order to moderate and to mediate these types of influences. And so, of course, the danger with the, the priests and the, the priestly hierarchy is it can become corrupt. It can become somewhat something like a kind of corrupt bureaucracy. And so that's why you also need the saints and you need these more prophetic figures to keep it in check, you know, and so that's the way to understand that. So Dan Larrabee says, why does paganism necessarily end in human sacrifice? I don't know. Does paganism necessarily end in human sacrifice? I don't know. I mean, it's. I don't think necessarily. You know, it seems that a lot of human sacrifice, by the time the Christianity came about, even in the Roman world, for example, was probably all but gone. There maybe might have been some. A few examples left, but it was. It was pretty much all but gone. Seems to be something which happened all over the place where human sacrifice was became moderated by animal sacrifice and other kinds of sacrifices. So if you want to understand human why human sacrifice, you know, the best thing to looking at Gerard can maybe help you understand that, you know, and I'm not sure I'm going to go into that right now because there's a lot of. There's a manner in which sacrifice, like, ultimately the sacrifice should be human, like no matter how you think about it, you know, and you can see that in the story of Abraham and his son. It's as if there's a sense in which ultimately the sacrifice tends towards becoming like, let's say the symbolism of sacrifice tends towards human sacrifice, even though I don't think that it necessarily happens that way because I mean, pagan culture is sacrificed animals, you know, not necessarily humans. And that there's a man which. That somehow has to be moderated because it's dangerous. Like it's a super dangerous thing. And. But ultimately that's what happens in, in Christ, I think. Christ. It all kind of comes together. It all kind of comes together in the idea of self sacrifice where the problem of human sacrifice kind of gets resolved in, in, in Christ, you know, and, and the martyrs. So think of the martyrs that way. Think of the martyrs as willing human sacrifices. Sorry, think about it that way. It's pretty crazy to think about it, but that's kind of how they were, you know, and so, you know, so. Man, I can't believe I'm talking about this. So think about, so think about how ancient cultures practice human sacrifice. A lot of them, like they would, for example, they would kill a child and then they would put the child under a post of a building. So the sacrifice of the human sacrifice would become the foundation on which the building would hold. So you can understand it obviously, symbolically as the idea that human sacrifice is the, the, the man in which groups exist, right? So you have to, you can't have everything in the group. It doesn't work. And so you have to sacrifice some aspect, some the best of you up towards the purpose which binds you together. Then you have to sacrifice the worst of you out. So you cut off that which is defective, that which is strange, that which is that which is not part of the group. And so that's how it works, you know. And so ancient people had a deep intuition that that's how it works. And they engage with it, like. And so, but that's a problem, like it's a serious problem, you know, because it leads to crazy things, like it leads to escalation, right? And you, you know, the image that we have, for example, right, of the, of the Aztecs, you know, that were killing thousands of people, you know, to keep their Societies holding together because they were in trouble and they just got to keep killing people in order to kind of try to consolidate this thing that was falling apart. And so Christ solves it. And so if you think of this, the martyrs as willing sacrifices, then you can understand why we say the blood of the martyrs is the seed of the church. It can help you understand why we place relics under altars, especially relics of martyrs. It can help you understand why martyrs, we found churches on the, the place where martyrs died. Man, I can't believe I'm saying this. Sorry, guys. Oh boy. All right, okay. Like every, every Q and A I do, I figure one day I'm going to say something. All right. Okay. So mid, Mid, Mid. Ali says. Hi, Jonathan. Bonsoir. Why does the Christian story only have white skin complexion characters, including the angels? What advice would you give a Muslim black man who resonates with orthodox teachings and looking to convert orthodox Christianity? I asked because after going to an orthodox church for the first time and seeing the icons, I started to question whether the Christian story was really my story. Help. Thanks. So I think that, I think that for the first thing to understand is to understand that a lot of, A lot of the way in which people represented, of course, Christ and the. Has to do with just the reality of the historical moment. You know, and so orthodox, you know, Christianity became Roman very fast, and so it became Roman in all of its representations. But if you look, for example, at representations of the Syrian images of Christ in the Syrian tradition, they're not exactly the same as the representation in the Roman tradition. There are differences in the way they're portrayed also because, you know, we just, people didn't think about it in that term. Like a lot of these skin color tropes, the way that we think about them now in terms of the whole history of racism and the whole history of race in, in especially in the modern world and slavery and all that stuff, it's just, it's. We have to be careful not to project that back into the ancient world. Now that's one thing, the one thing that can maybe help you, which maybe is not exactly the same as a skin color question, but you can help you understand that Christianity always has an aspect of the strange included in it, which is that for the Romans, Christ was not a Roman. And so they understood that there was an element of Christ which was not just their own like thing and that that was actually part of the story. Part of the story was engaging with something which was not just my thing. And so I know that Might be. This might be hard, maybe hard for you, but maybe that's the way to go about it, is to understand that just in a certain manner, just like the way in which Christianity came from Israel into Rome, right? In the same way, the Christianity that you're encountering probably comes from Rome to you. And so it will appear as somewhat as Roman. And it's better to think of it that way rather than to think of it in terms of skin color. Now, if you look at Ethiopian Christianity, you'll notice that the way Christ is represented, it's very different from. From the way that the Greeks represent Christ and the way the Romans represent Christ. And the way, if you look at, like I said, Syrian images, you'll see like, Christ has kind of almost like more. The eyes are more like almonds, you know, like, there's just different traits that people would just intuitively put into Christ. We have to be careful not to be excessive about it, because it's dangerous. It's dangerous to consciously try to make Christ into the image of what we are, because that's a little dangerous. And. But there is. It will. It will subtly appear. Now, there's some interesting things, like. There's some interesting things, for example, like if you look at Nubian Christianity, which at some point disappeared when then. When most of Nubia converted to Islam or was invaded by Islam or whatever, you can see that the way that they represent themselves and the way that they represent Christ is different. And so if you find old frescoes of Nubian churches, you'll see that they represent themselves as darker than Christ. But in Ethiopia, I've had some crazy discussions with people, like just accidentally about that, where the Ethiopians perceive themselves as being very much the same as Christ in terms of the way they look, but they also perceive themselves, the Ethiopian Christians, a lot of them, as not actually being African, which. It's just weird. It's weird how fractal a lot of these things are, you know, so. So I wish I could help you more, you know, but I think that it's. It's important to understand that we. That there is an aspect of Christianity which will always be strange to us, that will always be something else. And so when I, as a Frenchman, encounter an icon of Christ, I know I'm looking at a Jew. I'm not looking at a. At a European, you know, and so that's important to understand that. And even though it doesn't appear, let's say, in the actual. Let's say the. The pigmentation of the color of the Skin, it's nonetheless part of how we encounter Christ. So hope that's good enough. Hope that helps you. But if you're interested, like, look, I'll be honest with you, like, if you're interested in thinking about this differently and exploring this, there is a really a wonderful group called the. The Brotherhood of St. Moses the Black in the United States that are mostly Antiochian Christians. And a lot of people who had, you know, you know, the experience of being, being black and living in America. And so there are some amazing priests. Father Moses Berry was just like a living saint, to be honest. And Father Turbo calls, who I keep telling, I keep telling myself I'm going to have them on the channel and then just life moves, moves quickly. But I might have Father Turbo on my channel soon. So there's someone you might. Some people you might want to look into, and they've done some interesting work in terms of exploring the symbolism of darkness. I read some of their, some of their prayers that they did and some of the articles that were published on their website, and there was some interesting things going on where they're also trying to show the positive aspect of darkness in the Old Testament, right? The idea of the dark glory of God and the idea of the Queen of the south. And you know, how Christ says the Queen of the south will rise up and judge this generation. There's all of this interesting symbolism which is there. You can look. Also in our universal history series, we did a whole thing about how there's our Greek, Greek traditions of how the, the final emperor will rise out of Ethiopia. So it's not as simple as we want to think. And so I, Although I understand your struggle, I would say there's. There's a lot of, There's a lot of things to think about beyond that as well. So hope that helps. All right. So Dusan Babik asked why silver hurts monsters. It doesn't hurt every monster, right? It hurts werewolves and vampires, maybe. I'm not sure, but for sure, werewolves. I think it has to do with purity, you know, and I think it has to do with light. Light and purity. You know, like the silver is, is, is, is so shiny and, and, and light. So I think that's what it has to do. It's kind of like, say it's like, like a silver bullet, right? Like a light bullet of light that shoots and dispels the monster. So Chase and Lindsey ask, is the relationship between demons and humans a cosmic version of the relationship between Cain and Abel? And is this why fallen angels are so connected to Cain's lineage. If not, why do demons seem to hate humanity so much? Maybe. Yeah, for sure. Like, this is a good way to see it. Like there are some strains or some traditions, for example, that talk about how demons or the demons that fell, it's because they were jealous of humans and the special place that humans played. And so, so, yeah, so it's a good. It's a. Maybe it is a good way of thinking it, of thinking about it. And so why do humans, demons, seek to hate, Seem to hate humanity so much? It's, it's. I think it's mostly the idea that they want to enslave us. Right? That there are patterns of being and beings that have that, let's say that manifest certain, certain idolatrous patterns that they want us to fall into so that we follow them. Right? So that we worship them. And so it's basically, you can understand it as beings that embody certain patterns that are looking to be worshiped instead of God. So a jealousy to God and jealousy towards men, where men are meant to ultimately, let's say, rise up beyond the angels, would we say of the Mother of God? More glorious beyond compared than the seraphim, right? More. She's higher than the seraphim, higher than the cherubim. She's higher than all the angels. And so humanity is meant to be above the angels, ultimately. There's a mystery about that, by the way. There's a mystery about that. Even in terms of things like cognitive science and in terms of understanding the man in which identities exist through embodied intelligence, all of this is, Is not, It's not arbitrary, right? None of this is arbitrary. So. So maybe that helped a little bit. So, White Lawrence, what is the symbolism of the great pyramids of Giza? I think, I think, I think that I've said. I've said on my. That Egyptology is a certifiable disease. I think so. I think Egyptology is just. Most of Egypt symbolism is just complete hua. Like, it's just complete nonsense. But, you know, you can understand the symbolism of pyramids in general. That is, it's basically a mountain. It's just a mountain. It's a symbolism of a mountain. It's a triangle, it's a mountain. It's like a ziggurat. It's like. So that's really what the symbolism of, of those of pyramids are. And so they're a symbolism of the manner in which, let's say, the transcendent heaven meets Earth and then comes down into the world. But you know, it's like, I don't really know what those pyramids are for in terms of a more specific. And I think a lot of people speculate and I think probably most people don't really understand much about Egypt. Egyptian symbolism. It's just lost and it's just speculation, to be honest. You know, And I mean, just because they translated the hieroglyph doesn't mean they understand what's going on there. So, I mean, it's interesting to see something. Sometimes you see parallels and it's like, oh, it's interesting, but I really wouldn't spend much time on Egyptian symbolism if I were you guys. Jeff Dunlop asked, what is the meaning of the moon landing? What is the redemption of Werner Von Braun or a continuation of the Nazi. The Nazi worldview? You mean Werner Von Brown, that's the guy who joined NASA? Is that. Is that what it is? Yeah. Well, let me just see this. Yeah. Okay. Yeah. So he's the. He's the Nazi that became. That became a. Became the NASA. NASA. I mean, what is the meaning of the moon landing? It's the meaning. The meaning of the moon landing is basically the disenchantment. The highest point of disenchantment of the world would be something like the moon landing, where gives you the sense that none of this means anything. Like none of these, none of these lights up there mean anything, that none of this has any. You know, it's like. It's a. It's a form of. It's a form of alienation. It's like the ultimate alienation, you know, and it's. Think of it like this. Think of it like it's the. It's this success in disembodying self from your experience and perceiving the world from a completely alien point of view. And then that having the fruit of basically destructuring the world, like, acts as a way to. To. To destroy the world. And so in terms of Vernon Von Braun or whatever, that kind of stuff. I don't know, man. I mean, there are too many crazy stories about that. I mean, you could say, like, it's. It's about power. A lot of this stuff is just about power. All right, Josh, you've talked about the subject of piercings. I've had my own thoughts on how Christ was pierced through both hands, his feet sided, and then thorns on his head and by flogging. But it seems there's a greater picture of how all of these piercings are completion or fulfillment in a lot of ways. Can you expound yeah, this stuff is hard to talk about. The piercing thing, like the last. I think it's on the last Q A that I ended up talking about piercings and the kind of subject that you regret talking about as soon as you've talked about it. But let me just give you a few hints about how the story of Christ is just so completely crazy. That crazy in the sense that it just contains everything. And so. So there's this whole symbolism of Christ being pierced in the sense that he becomes the new source of the world. And so blood and water flows from his side. You know, the wounds, the wound. Symbolism of the wounds of Christ. You know, I talked about this. I talked about Shabbon. Ula says, vulnerary of Christ. But there's also a manner in which Christ is also fixed to the cross. And so it's like the. The wound. The wound becomes both a symbolism of this opening up of a new world. But at the same time, it's like the fixing of something. That stuff's hard to thinking about. The crucifixion is one of the hardest things you'll ever do. All right, Reuven Korf asks. Hi, Jonathan. Looking forward to God's dog. I've been listening with great interest, as we all have here, account of universal history with Richard. However, I'm wondering whether in your discussion of the symbolism of Constantinople you stray into the pattern of revolution. That is, you say that the converted Rome is Constantinople rather than Christian Rome itself. This ultimately ignores and reduces to the margin the source of the meaning for Constantinople found in the title, the New Rome. If I misunderstood something here, I'm trying to understand what you mean. Okay, so you say that the converted Rome is Constantinople rather than Christian Rome itself. So I'm not sure there's a dip. What's the difference between those two? I'm not sure I understand it. This ultimately ignores and reduces to the margin the source of the meaning. So I think. I think Constantinople was Christian Rome. That is, it was a refounding of a new Rome under the Christian banner. So it's basically a baptized version of Rome is the way to understand Constantinople. So. So I'm not sure I totally understand why this is the pattern of revolution. Yeah, sorry. I wish I don't totally understand the question. I wish I did. Might just be late too. It's not that late, actually. But some of those questions, some of your questions, guys, just crazy doozies. All right, Dean Parker asked. Look at this question. Dean, what are you doing? Was there anything symbolic about the 1980s? Satanic panic, particularly for those that were falsely accused of heinous crimes. Do you think a similar pattern might repeat? I don't know. I don't think so. I don't think that a similar pattern will repeat. And I think that, let's say the satanic panic, just like a lot of these things, a lot of. So you can understand, okay? So think about the people in, in the most common sense, right? In the most basic, like the, the regular Joe six pack, like whatever, the most common type of person you can imagine. And so you have to understand these, those people as the, the building block, like the building block from below of a, of a society, right? The peasants. And so they actually, from below hold the world together, okay? And so the people that are down here, they don't understand. They're not the smartest people, but they're the most embodied people. That's why there's a sense in which peasants don't go to hell, right? Like intellectuals go to hell and priests and bishops go to hell. If you look at images of, of hell in the middle, in the Middle Ages, it's like the peasants, they'll go to hell. It's all the monks and the priests and the bishops and the kings, they go to hell. But what I mean is that, is that there's a sense in which they're very embodied. And so sometimes things get. Starts to shake up and this lower part of reality is like, rings an alarm bell and they're kind of embodying or intuiting or noticing a change. And it's very unconscious. And so they start to ring the bell. And when they ring the bell, things start to manifest themselves in a weird way. And so the, the Satanic panic as much as the witch craze that happened, you know, in the, in the late, in the early Enlightenment. And you know, around that time, it's the marker of a transformation. You have to look at the way things are described not necessarily as just descriptions of events in a very discreet way or a very concrete way, but rather as something which is happening. And so it's like the Satanic panic or the, the Satanic change did happen in the late 70s and 80s. Like there really was a train. Like there really is a. There really was these changes happening in culture which were, which were taking Christianity out of the center of cultural discourse and putting in something which was Satanic in a broad sense, which was about the passions, which was about greed, which was about all the, all these things which are. Which was about self aggrandizing all of this stuff was there. So then this manifests itself in like, almost in a story, literary imagery. And all this imagery which kind of pops up. And so you could think that someone. Let's say so, you know, it has to. It's similar to what you see with this Travis Scott thing. You know, I'm probably going to make a video about that. Maybe a patron only video, just because I don't want to go into too much in public. But it's like there's certain imagery that are related to certain behaviors and that just happens. And so the kind of satanic imagery is related to passions and is related to obsession with things that are what they are. So I don't know if this makes sense. And so it's so like the people that the satanic panic in the 80s, although it went. It became like a kind of. A kind of hysteria, was nonetheless manifesting something that was happening in the. In the culture, in the basic culture, a change that was happening. And so I think that that's how you have to look at a lot of these. This stuff now is that you don't have to believe in the. In the. The way that the conspiracy theories and all these things, the way that they're described in their concrete. So, like, think about it. Like, a good example is like, lizard people, right? Like lizard men. You know, the people who think that there are lizard men that are ruling the world and everything. It's like, you don't have to think that they're like genetically lizard people that are ruling the world to understand what these tropes are referring to or what these tropes are ringing the bell about this intuition that there's something corrupt in the hierarchy structure and that there's something about. There's a sense in which there are certain hands that are moving things around, not that aren't doing it for our. Our good, that are only acting for the good of something else. For a strange good, you could say. And so. All right, anyways, I hope you guys understand what I mean. Not saying there aren't like, actual people who worship the devil. There are. There definitely are. For sure there are. Everything exists. So Walrus King 16 says, hi, Jonathan. Is daylight savings a little 666? God bless. I don't know. I don't think I understand what you mean by that. Is daylight savings a little 666, like in the sense. Maybe like in the sense of a system that tries to impose itself, like, on the natural patterns of the world and change them almost kind of arbitrarily. Maybe, I don't know. It's a bit of a stretch to connect those two together. All right, so Patrick Moore says, what is the symbolism of torture and mind control? Example, MK Ultra, man. What if a community who consciously takes part in torture and mind control of an innocent person and in the process destroy that society? I. I'm not sure I understand your question. What do you mean and in the process destroy that society? I mean, there's nothing. Like, MK Ultra is just evil. Like, and MK Ultra is an example. Okay, so let's say this way. So people are going to freak out when I say this, okay? Like, because you're not gonna. You're not gonna. You're not gonna. Some people are not gonna understand what I'm about to say, but I'll say it, you know, Like, MK Ultra is an example of the lizard people that are acting. That have infiltrated power and are acting in the world. All right, let's unpack that. It's like MK ULTRA is an example of evil forces that were able to infiltrate the secret parts of. Of our governing structure and were able to do horrible things to their own population in order to make themselves more powerful. Do you see what I'm trying to do here? Like, do you see where I'm trying to bridge the story verse and what's happening? And so hopefully that makes sense to you guys. Hopefully you understand what I'm talking about. And I won't. People won't clip this and say Jonathan believes in the. In the lizard people, man. All right. Nina Morris asks, is Maui from Moana a St Christopher? No, I don't think so. I mean, maybe kind of. I don't know, because he carries her across the waters kind of, I guess. Yeah, I thought about that. Maybe. Maybe. All right, man, how many questions are left here? I'm running out of. I'm running out of breath here. All right, I need to go a little faster. Janet Horseman, when you use the word eschaton, do you mean the same thing as the phrase age to come that Jesus and Paul use? Also when Jesus says, whoever believes in him will not perish but have eternal life, what does he mean by eternal life? I always thought it meant unending time that would occur in the age to come. But now, since listening to some of your content, I understand you turned it something separate from time. Do you think our resurrected bodies will inhabit both time and eternity, like Jesus resurrected body seems to. So I understand the word eschaton as the age of ages. The age of ages is a good way to Understand it. That's what we say in our. In our prayers till the ages of ages. That is, say, just like. Let's say eternity is like the. Something like the. The. The time of time or the heaven of heavens, right? And so the age of ages is a place in which all ages culminate into one. I don't know how else to tell you. And so that's what the eschaton is. It's the totality of everything brought together. So the. The totality of all the ages, totality of all of time brought together. That's the. The eschaton. And eternity is something like that in terms of. But not exactly the same. Eternity is the eternity seems to. Even more than that, than just eschaton, because eschaton seems to be like, take. Let's say you take all of. All of time in all society, and then it comes to its end. And when it comes to its end, it like, reveals the meaning of everything. The re. The meaning and the. The totality of all that happened until then. Kind of like that's why it's a judgment, you know? And so you could say that, you know, when you. You play, let's say you. I don't know, you play a football game, and then when the football game ends, then you understand and you know the consequences and the fruits of all the actions that were taken during the football game game. So while the football game is going on, you see the players playing, but you don't know what the fruits of those actions and those interactions are going to be. You only know the fruits of that at the end. So the end becomes a light by which we look back and we see all of what happened before. And so it judges all that what that all. And it gives and it reveals the purpose of all of that which happened before. And so imagine something like that, but for everything. All right, this is good as I'm gonna get. Also, I'm getting tired. All right, so Brad Holcomb says. Hey, Jonathan, I really appreciate all your work. I wanted to ask what the Mandorla almond symbolizes. I know it surrounds Christ in the transfiguration icon. Is it the coming together of opposites, heaven spirit and earth matter? I think it also relates to the Vesica Piscus P and the fish symbol. Yeah, I've had some people tell me that there's definitely a relationship between the Vesa PIs and the fish symbol in ways that I. That I didn't totally get, you know, until this is a priest which. The name Father I'm Sorry, Father, that I. Philip. Father Philip. Father Philip Kantos. Yes. He is the one who told me about this. He said if you look at an image of the. At Anastasis, sometimes Christ is standing on the doors of Hades, and the doors of Hades, the way they're placed, they often act as the, they act as the, the tail of the fish. Like you have this fish and it creates the fish. And I was like, man, I need to think about that more. Sadly, I didn't think about it more. But for sure, that's that image. A mandorla is the only image, the only possible image that only has two sides. So it's, it's probably the best way to understand, understand that the, that image. The mandorla or the almond. Yeah. And so, you know, some people have seen feminine symbolism in that, that image, and it's possible that it's there. It's not completely. I don't think it would be completely arbitrary to think that it's, it's somewhat in that symbolism as well. But mandorlas are, aren't always almond shapes. Sometimes they have other shapes. But the almond shaped mandorla seems to have something. And it also seems to have something to do with like. Yeah, like the union of opposites is probably the best way of understanding that, I think. All right, so Daniella Pearl Roth says, while the Kyle Rittenhouse trial, so pervasive in the US can't help thinking about Pontius Pilate and the show trial that convicted Christ and led to appeasement of the mob. This must be a very old symbolic pattern. Can you talk about the symbolic meaning behind this pattern of trials? Thanks. So I'm not going to comment on your American politics, guys. I'm not American. But the idea of a trial, especially a public trial that is serving a form of sacrifice is maybe the way to understand that. And so you can understand how the mob or the people, they're looking for a way to, to appease their, their anger or to appease the sense in which this person is responsible for all their, all their problems becomes an image, becomes a totem. Right. Of all the problems. And so they project all the sins into that person. And then that's when the trial can become something like a show trial. And that the person, the judge or whatever, who's in charge of the trial will want to give that person as a sacrifice to the mob to appease them because, yeah, it's a scapegoat situation. And that's what happened with Christ. And that's what happens usually in show trials. All right, Norm. Grandin says, he starts by saying, this is obviously too big to fully delve into a Q and A. All right, Norm. Thanks, man. But I wonder if you can touch upon the symbolic relationship between the transfiguration, the Resurrection and the Ascendant Ascension. Is each a small fractal of what follows, maybe how the role of light plays into each? Yeah, definitely. I mean, definitely. The transfiguration, the Resurrection and the Ascension are really something like. They're really something like fractal images of each other and that they kind of contain each other. They help us understand each other, you could say. And so there's a way in which you could understand that the, the Ascension is a. Is something like a transfiguration. Right. And the Resurrection is already ready, the beginning of the Ascension, and that the resurrection of Christ manifested the meaning of the transfiguration. So I think a good way to see it is that way is to say, to see how they each cast a light on each other. And so you, if you try to under. If you understand all three looking at each other, you'll have a better sense of what's going on and what is the ultimate purpose of the Incarnation. We could say. All right, so Dorothea asks, in our church marriage preparation programs, people have been telling engaged couples to always put their spouses first in a marriage and their child second. While I get where this is coming from, it still doesn't sound right. What are your thoughts? People probably say that because that, that, that, that some people, that naturally there's a tendency to do the opposite. Let's say, especially, I think mostly women, I think mostly women tend to immediately want to put their child first. But, but I. So that's why they need to consciously try to put their spouse first. And this is important because it creates the proper relationship of, of hierarchy between the children and the, the parents. And it also models a relationship, you know, and so it also models the manner in which the couple exists together. And so that's better because the child will see a model of a couple so that when that child grows up, then they will be able to reproduce it. But if, if, let's say the mother puts their children ahead of the father, then, then that child will not be able to properly engage in a, in a healthy relationship when they're older. So Anders of Ralstrad said. Hi, Jonathan. Paul recently did a commentary about your interview with Ben Hatke. The video left me wondering how you would distinguish between an angel of principality and a spirit. So maybe this can give me the opportunity to say that, by the way, like there was some misunderstanding and like I really enjoyed Paul's video because he really helped me to reef to think of certain things, like to phrase certain things the proper way. But I think there was a general misunderstanding about Ben, which is that Ben is actually Catholic. Like Ben is not just like an atheist materialist. He's actually someone who grew up in a very Catholic world and went to a very Thomistic college. So he actually grew up with a lot of Catholicism and is very knowledgeable about Catholicism. Now I think that for sure it was clear in the interview that you could see that Ben is questioning his faith, that he's struggling with some elements of Christianity. But he wasn't just like a, just like a reg. Like a kind of atheist materialist the way some people perceived it. So that's one second of all is that. So angel, principality and spirit, they're related to each other, right? They're, they're, they're related to each other. But you can understand that there, there's something like in a. So you could say that angels and principalities are spirits. And that principality describes the type of spirit that is a, that is the head of bodies, that is the head of certain realities. So it's a principle, right? It's a, it's the principality of, of an aspect of reality, right? And so angel usually means messenger. And so in general, so the angel is, is that which carries that which is above down, lower to, to that which is below and then carries that which is below back up above. You can could say so the angel moves back and forth between heaven and earth. You can understand it between, like Jacob when he sees the angels going up and down the ladder of, of. Of reality. And so. But then these can be interchangeable, right? Because you could say that Prince, a principality is, is an angel because if it's a proper, if it's a proper principality, then it's, then it's. In manifesting a higher, the, let's say the higher will into lower aspects of reality by being subject to God and being, let's say the, the. The angel of, of this city or this aspect of the reality, then it's acting like an angel because it's, it's bringing the will of God down to a lower level. It's, it's communicating it and bringing it down to a lower level. And so that's the best way that I could help you understand it. So into a certain extent. Some of these terms are interchangeable, but they can also Be used more precisely if we want to. If we want to, to talk about specific things. And so you, let's say you have a spirit. There's an aspect of you that is spirit, that is invisible, that is pattern, that is all these things. And you also, to a certain extent, act as a principality in a lower way, but maybe not in a cosmic way. And you also are an angel. Can be an angel. You know, sometimes the angels in scripture, it just means messenger. So you can also be an angel of God, but maybe not in a cosmic way, at least not yet. And so maybe in a more local way. So maybe that helps to understand. It's the best I can do with that. All right, so Garrett Widner says. Hello, Jonathan, give me for the foolish question, but does Jesus ruling at his Father's right hand imply equality? And so forgive me, from what position is the Theotokos granted to rule? If I am in any way onto something, would this be best not to discuss? If I'm not, could you perhaps tell me what my error is? So being on the right hand implies. It implies a hierarchy of function, at least. And so the idea that Christ is at the right hand of the Father implies that there is a. Not necessarily a hierarchy of nature, because that's important not to have that in the Trinity, but there is definitely a hierarchy of function. And so the right hand is something like the surrogate of the center. That's the best way to understand it, actually. If you understand that, you'll understand a lot of stuff about right hand symbolism. And so the right hand, because the right hand is that which, let's say, brings towards, let's say, bring towards himself when you, you. The right hand is that by which you act deliberately in the world and, and you bring it towards you, let's say it also becomes a surrogate of, of the center. So the right hand man will be something like, you can understand it like, like my right hand man is the one who represents me when I'm not there. That's the way to understand it. And so that's why, for example, the idea like of St Peter being on the right of Christ and also being seen as, you know, has a certain primacy. And you can understand. That's why, for example, if you look at. And there are different ways to think about it, but if you look at icons of, let's say, the Ascension, the Mother of God will be in the center, right? But if you have her direct relationship with Christ, she'll be on his right hand. So that's a way to understand that in terms of right hand symbolism, you'll understand, you'll see. Like I said, if you understand that, you'll understand a lot of stuff about right hand symbolism. And also if you don't get that sometimes you'll be confused at why certain figures are on the right and then on the. In the center in other images. All right, so Benjamin Kincaid says. Hi, Jonathan. I was wondering why crowns are associated with royalty and their symbolic value. I understand that it probably has to do with the value of precious metals adorned above the queen. But why didn't we sympathize, empathize, emphasize valuable pendants over the heart as the primary symbol of royalty? Because the crown is glory. So a crown is the manner in which you participate in something which is beyond yourself. So that's what, that's what glory is. Also, it's an extension of you that's not you, that's kind of added to you, but makes you participate in something higher. So that's why the crown comes from heaven, right? God gives you a crown from heaven. That's why, that's why Samuel pours the oil down on the head. The shiny stuff. He pours the, the shiny stuff from above. And so, yeah, that's the best way to understand it. So think of, think of anointing, for example, as putting shiny stuff on your head. As like a pointing like that separates you from the crowd, pulls you up and in pulling you up, right? It. It. Both. You're both held. You're both hold the, the. So the king holds the kingdom together, but ultimately has to do it in the name of something which is beyond him, or else why would people join together under him? They might do so for, let's say, suspicious reasons like getting loot or getting, you know, accumulating stuff. But, but if you want something that is more noble, then you need that, that movement up. All right, so, Marcus David, why does someone who follows Christ need to get baptized in order to officially considered part of the church? I don't see the need for it. What exactly is it that baptism does? So Christianity is a participative religion. It's a ritualized participative religion, despite what some of our Christian friends want to believe. You know, it has sacraments. And sacramentality is a manner in which we are bound to that which is above. And we receive from above. And then we also, let's say, embody the participation, that which is above. And so baptism is a form of washing, you know, it's a form of dying to your old self. In order to become a new creature. So it's a transition between an old world and a new world. Yeah. And so I don't know how else to say it, you know, I mean, it's a lot of other stuff, but it's that, that's, that's what it is. And so. But you have to, you have to manifest that. You have to, you have to manifest the transition between two worlds. Like, it has to, it has to actually be. Be real. It can't be just. Yeah, so, so I don't know how, how else to explain. It's like any ritual. It's, it's obviously, it's not like any ritual. The sacraments are not like any ritual. But the only way to approach them if you don't understand them is to think of more lower rituals that can help you kind of get it. And so, so you could say something like, let me say, let me, let me tell you, let me, Let me bring about a situation for you that can help you understand. It's like you could say, if I'm going to, if I'm going to talk to someone, if I'm going to come up to someone and talk to them, like, why do I need to shake their hand? Like, why do I need to look at them in the eye? Why do I need to stand in front of them? Right? And so he's like, because all those things, he's like, I don't, I don't see the need for it. I don't, I don't want to do those things. I want to. I want to encounter the person. So why do I have to do these types? Why do I have to do these kinds of things? Why do I have to acknowledge them, you know, by saying, hello, why do I have to. So it's like these methods, like these embodiments are the manner in which we enter into relation with someone. So the sacraments are the formal manner, the formal ways in which we enter into relationship with each other and with Christ in the church. To me, it's not, it's. It's. Those things exist for a lot of stuff, all right? You know, it's like those things exist for many, many participations that you'll have hope that helps. I don't know. I hope it helps. I don't know if it does. Also, towards the end of these, I always get a little rambly. All right? So Alyssa says, hi, Jonathan, could you please help me to understand how to conduct myself in the current situation? Man, the imposition of control over private life. And body around the world. It terrifies me to death as the events unfold. And I'm not sure I could withstand if it things got complete go completely downhill. I was thinking of attending the walks, but something within me is uneasy with this idea. And after watching your video on the two headed serpent of discourse, I'm thinking, I think I'm thinking in the wrong direction. I don't know what else I could do to make any difference. I think, I think this, I think different people play different roles in these situations and I think, I think that being attentive to. To. To yourself and being attentive to what you think you need to do is better than any answer that I'm going to give you because. Yeah, I wish I had a simple answer to give you. I don't know. I think the. Ultimately it's possible that the best, the best way to deal with a authoritarian situation is to resist and accept the consequences. That seems to me to be the most Christian path. But I don't think it, I don't think it's. It does. It doesn't mean that everybody has to do that. Yeah, I don't think everybody has to do that. All right, so Daniel Townhead so says dear Jonathan, why do some contradictions seems to be or point to a higher form of truth while others seem to show hypocrisy or to discredit anything relying on the contradiction? It's a good question. And so the reason why some contradiction seems to point to a higher form of truth is that reality is beyond the. Is beyond what we can say. So sometimes there's a manner in which you can show two aspects of reality which seems to be contradictory, which ultimately point to a higher truth. And so the difference between one and the other is that usually the contradiction which points to hypocrisy is usually has ulterior motive. It's usually weaponized. It's usually you can, if you're careful, you can discern the power that is. That is trying. People are trying to get by engaging these types of contradictions. Yeah. That it's utilitarian. So it's a lie basically and, and a hypocrisy. Whereas the contradictions which reveal higher mysteries will usually appear free from these types of. These types of utilitarian goals. So hopefully that helps. So Drew McMahon asked, you recently talked about monsters being something we might use to fight off other monsters. Does this seem to align more with Jung's idea of integrating the shadow rather than the Christian idea of removing it all together? Or do I not have the correct understanding here. Thank you. So, so, okay, so monsters are just things that are, that are ill defined. Like monsters are not necessarily moral in themselves, their chaos or potential. They're ill defined categories. You know, they're not moral. Now the problem, the problem with Jung's notion of integrating the shadow is it seems to me like it's, it seems to me that he tends to give substance to darkness. Like he tends to give being to, not to, non being. And, and so for example, a Christian will say something like, be aware of your shadow, like be aware of your darkness, be aware of your, of your death. Like stay aware of these things. But it seems like Jung's idea is more like you need to become conscious of your worst, of your worst aspects and then integrate them into your person. But again, it's always the problem of seeing darkness instead of transforming that darkness into something good. So let me give you an example. So in Christianity would say things like, everything that exists necessarily points to a good because for it to exist, it has to point to a good. And so we could say that all our passions are good and they need to be turned towards the good in order for them to reach their own fullness. So let's say like even something like, you know, you know, like let's say your, your, your desires for sexuality, your desires for food, these can be turned right towards something which will bring you, would transform you spiritually. So what Jung seems to, to say is something, I mean, this is, I'm not a Jungian, but what, what I encounter, it's more like, you know, you have all these dark fantasies and you need to integrate them in order to be full. But it's like, okay, to me that, that is very different from the idea of you have all these desires and you need to be able to, let's say, turn them towards the good so that then they become full. Because, because if, because if they're just dark, then they, they're actually like fragments. It's not that they're, that have, they have body in themselves, that they're, they're like, they're like ligaments or like they're strands of things which, that, that don't connect. So I mean, that's the way that I see it. But. All right, so Scotty Thorpe asks, hey, Jonathan, the book the Cloud of Unknowing, we're taught about two realms in centering prayer called the cloud of forgetting beneath us and the cloud of unknowing above us. Can you describe these concepts in our symbolic worldview? Thanks. So, yeah, that's. I mean, I've talked about this before. That, the idea that there's a manner in which. I talked about this recently actually in the Jordan Peterson video, the one, the. The symbolic world one that he put up where there's a man in which identity, above identity is something like unknowing in the sense that it's self sacrifice or it's kenotic. Like identity empties itself above, you know, so you have to give yourself to something above you in order for your identity to have any value. So it's like the highest point of identity is something like sacrifice of identity, sacrifice of knowledge, sacrifice of gnosis, even in that sense, where above knowledge is unknowing. Now below there's another darkness, which is also a breakdown of identity, which is forgetting, which is not being connected, being disconnected. So let's say Jonah at the bottom of the whale forgot God. Like was forgotten by God or forgot God and he had to remember God in order to be reconnected to God. But then there's also a sense in which above, that giving himself to God would be something like a sacrifice of himself into that higher state. And so they're all, they're opposites. Now it's really important because a lot of people today, super subversive people, will try to trick you in thinking one is the other. And so we'll try to connect, let's say, I'm telling you, it's going to happen more and more. We'll try to connect something like hybridity, strangeness, fluid identity with divine unknowing. I'm telling you, if you haven't encountered it yet, you're going to encounter it pretty soon. You might even encounter it coming out of some churches. And so that's the deep confusion. It's the deepest confusion. Um, so watch out for that stuff. All right, so we're almost done here. Connor says, I find the scene in Genesis 15 where Adam brings all the animals to be cut in half very interesting, but I don't know what to make of it. He brings a heifer, a female goat, a ram, all three years old, a turtle dove and a young pigeon. The land animals are cut in half and the birds are not. When the sun goes down, there was a flame, and behold, there appeared a smoking oven and lamps of fire that pass between those divided pieces. Could you explain these passages? Yeah, I mean, kinda. Matthew would probably be better at explaining this. So you can understand that it has to do, like, think about it in terms of a body and light or Body and spirit. And so it's like you create a body and then there's the flame. Like, let's say the flame manifests itself amidst that body. I don't know how else to say it. Like, I don't know how else to explain it. The, the, the light is in the center of the dead, of the death. Like the, the, the spark appears in the carcass, like the spark. So it's like, it's like honey found in the body of the dead lion. Or, you know, it's like Christ moving down into Hades. It's, it's. So I'm just going to give you analogies because I'm not going to explain this to you. Yeah, I think that that's probably the best way if I, if you think of those analogies that I just gave you, maybe it can give you the intuition you need to, to, to understand that. All right. All right. So, Stephen Osborne, you. I think it's maybe because we've done so many of these Q and A's. Like all your questions are becoming more and more just becoming harder and harder, man. I mean, good question, though. It's great question. Just harder. Stephen Osborne, John Vervecki's relevance realization requires a top down and bottomless simultaneity to work. So why not characterize this as us and dwelling angels and angels indwelling us? Yeah, I mean, something like that. So read St. Maximus, dude. Saint Maximus. It's awesome about this, you know, and so it's mostly the idea of, you know, so distinguishing, for example, the way that Christ, when he talks about you, are in God and God is in you. And so St. Maximus will distinguish those two as being different. Right. And so. And he'll distinguish them in a way that is top down and bottom up. So something like Christ in you or God in you is that Christ becomes your head, becomes the heart, becomes the head, becomes the source, becomes the thing towards which all things culminate. So that's the matter in which Christ is in you. He's in your heart of hearts, of hearts, right. Or he's the head of the body. There are differences between those two, but sometimes they can play a similar role. And you are in God in the sense that through a communion of love, right? You become the manner in which God appears in the world. So you become the body of Christ. So we are in Christ in the sense that we are his body and he in Christ is in us in the sense that he is our heart of hearts or our head. So you can see it's so powerful. Like you can see how it's just these two things moving up. You know, this up, this top down and bottom up. Ontology is just great in Saint Maximus. All right, so Arthur Holmes Brown. Last question, guys. So. Hi, Jonathan. When a person pursues a profession, trade or business, there's an aspect of personal drive, self made man, go getter, et cetera. But there's also an aspect of the economic climate. Can the economic environment be thought of as the feminine preparation of the space while the action of knocking on doors and pressing through until you get the job or make the sale be thought of as masculine? Further, could extreme free market capitalism be the masculine extreme while the extreme socialism is feminine extreme? Yeah, not sure about this last part, but the first part for sure is, is, is exactly right. That is that you could understand it and you could understand it really like you could understand it almost like use breeding as a, or like an actual, as a sexual encounter as an image of this, which is that the, the salesman has to, if the salesman wants to be successful and making sales because let's say he's encountering indefinite amount of people like he's encountering all these people. So he has to be quickly be able to recognize the right potential for the thing that he's selling because he's going to waste his time, he's going to, he's going to waste his seed if he doesn't, if he wastes his energy, if he doesn't find the right potential for. So that what he's selling or saying will connect with someone who needs that, you know, or can be convinced of that, right? And so you could see it also you could see it the other way around as well, which is that let's say you're, let's say you're, you're the client now, right? And you're looking for your needs to be to, to find a service or find something which will fill your need, right? And so you also have to be attentive and you have, have to be able to discern the right seed. You have to be able to discern the right company. Those that are honest, those that are, that will deliver what they say they'll deliver. You have to be able to identify those that have the proper product because there's a there, there can be a miss like the heaven and earth can miss, right? You, I don't like something as simple as, you know, you, you need a cable for your computer or whatever, and so you're not careful. And then you, someone convinces you to get this cable or you buy the wrong cable. Then there's the mismatch. Heaven and earth don't fit. They don't. They don't fit together. And so, and so, yeah, there's definitely a male, a masculine, feminine relationship between, let's say a client and, and provider, let's say market, you know, and, and companies. All of that is related to each other. But we're not sure about the second part though, so. All right, so, yeah, we went over a little bit. 10:30. I like to. I don't like to. When it lasts too long. So. So I hope things weren't too crazy in this chat. I see some deleted messages, but thanks, Brad, and thanks, Lisa, for your help at. I don't know if there's, if there are other moderators there, but thank you for your help in moderating this. And. And so, yeah, so month of December, we still got God's dog going for another month, so it's still time to back it. Still time to get other people to back it. We're trying to participate in a change. We're trying to participate in a, in a cultural shift with everything we're doing. And so thanks for your support, all of you that supporting me on Patreon, you know, like, you're really part of the reason why I can do this because, you know, because I know that I've got this, this base. Then I'm also able to, to, to, to draw my attention to things that I think are worth pursuing, hopefully to, to grow, to grow this kind of symbolic understanding and the transformation we hope to see does he happen in the world. And so everybody, thanks for your attention. Thanks for your time and we'll see you very soon. So bye bye. I hope you enjoyed this episode of the Symbolic World. The Symbolic World is based on a series of videos that you can find on my YouTube channel, Jonathan Pageau's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism. That is, it's quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course, leaving a review on itunes. Everybody knows that's the best way to get the podcast out there, to get it heard. And if you want to get involved, you can also support the podcast financially. Going to www.thesymbolicworld.com support or else on Patreon, the Pajo videos as well, and on subscribestar, all those links you can find on my website or in the show description. So thank you and I will see you soon."}
