{"episode_id":"SW - #123 - 2020-11-04 - Fr. Andrew Damick and Fr. Stephen De Young - Gods, Angels and Demons","start":12.72,"end":122.25,"speaker":"Jonathan Pageau","text":"This is Jonathan Peugeot. Welcome to the symbolic world. So, hello, everybody. I am here with Father Andrew Damick and father Steven DeYoung. Both of them are working with Ancient Faith Radio and started a new podcast called the Lord of Spirits. And the people around me, the people that watch my videos, everybody has been really excited about this podcast. I listened to the first episode and it's very, very fascinating. It's an exploration of the world of angels, of spirits, of demons, basically trying to help people understand that as Christians, as believers, we don't believe that it's just us and God, although we do believe that God, the God we worship, is transcendent, is beyond time, beyond space, beyond everything. It's uncreated. But that between us and God, let's say in the hierarchy of beings, there is a whole bunch of stuff going on. That's how the ancients understood it. That's how the fathers understood it. And so they are trying to dive back into that understanding and present it to us today in a manner that we can understand and that can also help us transform our lives in relation to all of this. Now, I'm going to have some questions, some tough questions, too. I hope they're ready in terms of what this means and what the consequences of going into this might be, because as you've seen in my videos, I've been tempted by talking about this more and more. And so, yeah, so I think we're going to have a lot of fun. So I don't know who is going to speak first, but I would like you to maybe tell us a little bit about your vision for this podcast, what you're trying to accomplish, and then we'll just dive in. I think we'll probably have to cut it short because there's so many things we could probably talk about. And so we'll see."}
{"episode_id":"SW - #123 - 2020-11-04 - Fr. Andrew Damick and Fr. Stephen De Young - Gods, Angels and Demons","start":123.37,"end":248.57,"speaker":"Fr Andrew Stephen Damick","text":"Well, I'll go first. I usually go first on the actual show because I'm the one who's looking at all the blinky lights in the studio. But, yeah, so, you know, Father Stephen and I bring very different things to the table. And my desire to do this show was number one in some ways to give a wider audience to some of the work that Father Stephen has been doing in terms of talking about the Bible, especially in the orthodox tradition in its full sense, and especially in the sense that is maybe hidden from us as people who tend to function as materialists. Right. And so the reason why I've been fascinated by that stuff is because, you know, serving for a number of years as a pastor and still doing pastoral work in another different kind of way. Now. I think one of the biggest problems that we have in our age is that we tend to function as materialists. We tend to function even if we're believing Christians. We tend to function in a way that suggests that the 3D world is all that there is. And occasionally we maybe add in some God here and there, and then, you know, if we're. Then we occasionally maybe add in some saints and angels if we view feel like really desperate, you know, God, please do this for me. And oh, by the way, you saints and angels, please help. You know, and the truth is that's a very anemic way of understanding the spiritual life. And so I'm also fascinated by narrative. And I think narrative is really the way that we understand and organize reality, the way that we actually able to approach it. And so much of what we're talking about in this program is about reclaiming narratives that are in orthodox tradition. They're in the Scriptures, they're in the Church fathers, they're in the liturgical services, but have become opaque to us because of our modern culture and its secular humanistic materialism. So that's kind of the nutshell of what it is that I. What I'm interested in, particularly for this particular program."}
{"episode_id":"SW - #123 - 2020-11-04 - Fr. Andrew Damick and Fr. Stephen De Young - Gods, Angels and Demons","start":249.21,"end":261.13,"speaker":"Jonathan Pageau","text":"Father Stephen, maybe tell us about your research and the way you've been presenting it to people I know in a blog for a while, but now in this podcast, tell us a bit about the angle and what you're trying to accomplish with what you're doing."}
{"episode_id":"SW - #123 - 2020-11-04 - Fr. Andrew Damick and Fr. Stephen De Young - Gods, Angels and Demons","start":262.01,"end":400.22,"speaker":"Fr Stephen De Young","text":"Yeah, I'm the Bible nerd of our duo. I actually went and got a PhD in it, and I've spent a lot of my life studying ancient dead languages. But I think a big part of what has motivated me is I don't think that as Orthodox Christians living in the west, for the most part, we sort of fully appropriated our tradition. It's all there. It's all in the tradition. It's in our liturgics, it's in the Fathers, it's in the Scriptures themselves. But we've tended to, in part, I think, because we're doing this work in English. So we start out adopting traditional English language, theological terms, sort of our interpretive grid for theology and understanding God. And understanding the Scriptures has been dictated by sort of modern assumptions, mostly modern Protestant assumptions, especially in terms of the Bible. And so, you know, we try to figure out, well, what's the orthodox view of justification, what's the orthodox view of predestination. We take these Western categories and Just try to plug in the Orthodox stance and you don't end up with the Orthodox faith that way. You end up with sort of an Orthodox ish form of Western Christianity. And so I've been trying mainly to try to pull out some of this stuff that's there in the scriptures there in our tradition, especially the very early fathers there in the Jewish traditions of the second Temple period that formed the background for the New Testament that people just don't know about and sort of show that, hey, this is what's there. That there's a whole other way of understanding all of these things that's more original, that is the basis of the Orthodox faith and that we're just unaware of. That's already. With one episode in the bag, the most common comment we get either from a critical side or a non critical side is why haven't I heard this before?"}
{"episode_id":"SW - #123 - 2020-11-04 - Fr. Andrew Damick and Fr. Stephen De Young - Gods, Angels and Demons","start":400.94,"end":470.52,"speaker":"Jonathan Pageau","text":"Well, one of the things that we've been, that had been a disservice to us, let's say in the west, is our translations have been a desire to demythologize the scripture. And so, you know, when I tell people that, you know, in the creation narrative it says that God created sea monsters. And people, they've never seen it, but it's right there in front of you, they just use words to kind of make you think that, to make, to avoid the problem, to avoid all the strange characters, the dragons, the demons, the strange, you know, gods that are named or these, these strange mythological creatures. They don't. They. There has been this attempt to kind of shield this from us in order to protect Christianity in the modern world. But now in the past few decades, what we've had is we've had kind of secular atheist type biblical scholars come at us with arrows and knives and say all of this stuff is there and try to bring it back. And Christians have no idea. And so one of the things I'm excited about what you're doing is saying we're gonna do this, but we're gonna do it in a way to show that it's completely coherent with our Christian tradition. It's not in opposition to it, it's not there to undermine what we believe."}
{"episode_id":"SW - #123 - 2020-11-04 - Fr. Andrew Damick and Fr. Stephen De Young - Gods, Angels and Demons","start":471.64,"end":480.07,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. We don't have to be embarrassed by the appearance of monsters and spirits and so forth in the Bible. You know, they are there."}
{"episode_id":"SW - #123 - 2020-11-04 - Fr. Andrew Damick and Fr. Stephen De Young - Gods, Angels and Demons","start":482.71,"end":514.93,"speaker":"Fr Stephen De Young","text":"There's this idea that we need to sort of make Christianity respectable. Right. We need to make sure that it's something we can talk about in polite company at cocktail parties with educated people, you know, and so if we start talking about demons, or we start talking about sea monsters, or we start talking about giants, they're going to laugh at us. So we need to figure out some way to paper over that, some other way to understand that so that we can all be modern, intellectual, respectable folk."}
{"episode_id":"SW - #123 - 2020-11-04 - Fr. Andrew Damick and Fr. Stephen De Young - Gods, Angels and Demons","start":515.25,"end":588.57,"speaker":"Jonathan Pageau","text":"Yeah, yeah. And so I would. My big question. This is like, I'm going to go straight to the toughest question I would say is one of the reasons that I have been going very slowly at this, or kind of bringing people slowly onto this point of view, which is this notion of these principalities of these beings, is I'm afraid of the Marvel Comics spirituality. Like I'm afraid of the Marvel Comics version of mythology, which is that everything is on the same level, Right. So you have these beings, but they're all basically like us, Right. They're all basically on a kind of material sphere, I would say. And. And so Thor is on another planet, and these gods are kind of floating in space, or the recent version we've heard are things like they're in other dimensions, this type of speaking, which is trying to use scientific speak to explain these beings, but always trying to explain them on the same level. And so this is the thing that I'm a little worried about, because to me, what it ends up creating is they kind of science fiction version of the Bible. And so I don't know if that's something you've thought about."}
{"episode_id":"SW - #123 - 2020-11-04 - Fr. Andrew Damick and Fr. Stephen De Young - Gods, Angels and Demons","start":589.13,"end":690.53,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Like, one thing you notice, for instance, in the recent Marvel films, I think the last. I think it was the last Avengers movie, you know, Thor gets a beer belly, right? So, like, I mean, this is the reification of Thor that he's real. He's so real he can get, you know, become a deadbeat and get drunk and have a beer belly, right. And be out of shape. Whereas no one who ever worshiped Thor and the Christians who encountered Thor worshipers would have ever seen him that way. They would have regarded, you know, those who worshiped him would have regarded him as a God. And those who encountered those worshipers were regarded him as a demon, which are both biblical terms for the same kinds of beings. And he, you know, he was not just a human with kind of superpowers who lives on another planet, but actually this spiritual being who, through sacrifices and through sin, frankly, is in communion with this group of people and affecting them. And they've made him part of their community. And he's super dangerous, right? So the powers that he wields are by virtue of the kind of being that he is. And he's not just like us. He doesn't get bummed out like us. He doesn't, you know, fall in love like us. He doesn't get a beer belly like us. That's just not what Thor is. Just as an example, you know. But yeah, it's. I mean I've long loved comic books and Father Stevens is a comic, comic book lover as well. But you know, that's not the real Thor."}
{"episode_id":"SW - #123 - 2020-11-04 - Fr. Andrew Damick and Fr. Stephen De Young - Gods, Angels and Demons","start":691.33,"end":743.03,"speaker":"Jonathan Pageau","text":"Yeah, well, there are analogies, let's say. I mean, I like comic books too for sure and I think that there are analogies to help us understand. Sometimes you can use analogies of physical power to help you understand spiritual power. There are ways to use those tropes and let's say the manner in which even in the stories of the gods that they're told, they're told that way, right? The gods are described in ways that have massive, let's say physical power and that they manifest this power. There's a mapping of the two worlds, let's say there's a mapping on of the higher world with the lower world and we use words from the lower world to talk about it. But, but angels don't, right? Angels don't have physical bodies or they have something like subtle bodies or you could call them that. I don't know. Am I wrong in my understanding? Father Stephen, what is your vision of this?"}
{"episode_id":"SW - #123 - 2020-11-04 - Fr. Andrew Damick and Fr. Stephen De Young - Gods, Angels and Demons","start":743.67,"end":816.18,"speaker":"Fr Stephen De Young","text":"Well, I think to begin with your original question, I think really getting into the reality of this does the exact opposite. I think the whole spiritual world and God himself has been sort of domesticated by sort of modern theology, especially Protestant theology. You know, you've got Calvinism, which basically has a God who's within time and sometime in the ancient past sat down and wrote out everything that was going to happen. You know, and if he didn't do that, then he's not sovereign and he's not in control, you know, or, and then you get, you have people who respond to that and go the other way with open theism who say that God like doesn't know the future. Right. So we've, we've got these woods that are so humanized God. So I think when we come and say, well no, if you look at the scriptures, you know, the alien or the angels are these vast cosmic intelligences that are helpful God in his governing of the spiritual and the material world. You know, I think that's a much less sort of marvelesque, that's less Justice League."}
{"episode_id":"SW - #123 - 2020-11-04 - Fr. Andrew Damick and Fr. Stephen De Young - Gods, Angels and Demons","start":817.94,"end":890.64,"speaker":"Jonathan Pageau","text":"Than. No, and I think the word intelligence is probably the. I mean it's a traditional word to talk about these beings. And it's probably a good way to speak about them in a manner that people can maybe understand what we're dealing with here. Because one of the things you said, I think it was in the first episode, or maybe I read it on your blog, where you talk about the notion that the spiritual world, for the ancients, even though it's seen as these intelligences that are above us and that are kind of managing the world, they nonetheless map onto the physical world. There's a correlation. And so you have places in the world that are like the gates of hell or the mountain of the gods, or you have all these physical spaces in the world that kind of cut, let's say, concentrate these spiritual powers. But it doesn't. It doesn't mean that. Let's say that if you went up the Mount Olympus, you would find God. You'd find Zeus sitting there kind of, you know, fiddling away at his. At his lightning bolt, you know. But it's difficult because people are so materialistic that I was afraid sometimes that, like, do you understand what I'm talking about? Because sometimes I'm a little worried when I talk to people about this stuff."}
{"episode_id":"SW - #123 - 2020-11-04 - Fr. Andrew Damick and Fr. Stephen De Young - Gods, Angels and Demons","start":892.47,"end":966.54,"speaker":"Fr Stephen De Young","text":"The ancients saw these things as sort of overlapping. Like, to use a modern term, it's like you have a transparency over a photo, you know. And so the Acherusian lake, for example, was a lake in Hades, in Sheol, in the underworld. And it was the place of. For Plato, it was the place of forgetting, where the souls sort of lose their memories before they get reincarnated. In general, Greco Roman paganism, it was just forgetting their former lives completely and sort of starting to dwindle away to nothingness. Christians adopt that. And in a lot of the early Christian apocryphal works like the life of Adam and Eve, they have repentant people in Hades at the coming of Christ being baptized in that lake and being cleansed of their sins and then able to enter into. Into paradise. But that lake, you know, we could talk about how that functions in the stories, but that was also a lake in Italy. You could go there. It's an actual physical lake. And they didn't think it represented this spiritual reality. They thought those two things were the same. They overlapped."}
{"episode_id":"SW - #123 - 2020-11-04 - Fr. Andrew Damick and Fr. Stephen De Young - Gods, Angels and Demons","start":966.54,"end":997.14,"speaker":"Jonathan Pageau","text":"It's more like a manifest. I always use the word manifesting in the sense that it's not an arbitrary representation, but it's a condensation of something which is beyond what it's condensating. Like it. It actually. It's actually manifesting this principle, but the print, the principle or the intelligent part of it is beyond what is being shown to you. Let's say, you know, just like a church really does it really, the physical building of the church really does become the place where Christ descend, manifests himself in the cup."}
{"episode_id":"SW - #123 - 2020-11-04 - Fr. Andrew Damick and Fr. Stephen De Young - Gods, Angels and Demons","start":997.14,"end":997.5,"speaker":"Fr Andrew Stephen Damick","text":"Really."}
{"episode_id":"SW - #123 - 2020-11-04 - Fr. Andrew Damick and Fr. Stephen De Young - Gods, Angels and Demons","start":997.5,"end":1010.28,"speaker":"Jonathan Pageau","text":"Really, you know, but you cannot limit that just to the blood and bread that's in the cup because there's something else going on. It's pointing us, bringing us into something higher than what's there."}
{"episode_id":"SW - #123 - 2020-11-04 - Fr. Andrew Damick and Fr. Stephen De Young - Gods, Angels and Demons","start":1010.36,"end":1179.2,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And also that human participation makes a big difference in terms of what people actually experience. Right. So like, early on, one of the memes that I think Father Stephen shared on our podcast Facebook page had these two pictures on it. And on the top you see this very plain, very primitive looking sort of village with huts, you know, and then on the bottom you see this idyllic countryside where you see mythological beings cavorting with human beings and they're labeled separately. I'm doing this from memory, so forgive me, I'm getting a little wrong. But the top one with the sort of primitive bare set of huts, it says something like what a video camera would have seen. And then at the bottom it says what ancient peoples experienced. And so what is the difference between those two? Like, if I go to those huts, I'm probably going to just see huts because I don't know how to participate in the same way that those people did. Right. And so, and I think that that's one of the key things, right. Is this sense of ritual participation, but also just having having the imagination. And by that I don't mean that they're coming up with ideas in their heads and then they're seeing things. But I'm saying having the ability to recognize something as being there and having that ability, then you actually do see more. Right. So for instance, you talked about that lake in Italy. Just because you go to that place in Italy and stick your toe in doesn't necessarily mean you're gonna forget everything you ever knew. Right. There's something else going on there at the same time. Right. There's certain conditions that kind of have to be met in order to have that specific experience. And I'm still kind of grappling to get a handle on a lot of this stuff. Father Steven has been working with it for a lot longer. But one of the things that I've found that's really fascinating to me is that so much of it is I have this internal feeling of like, I've always wanted this to be real. I always wanted this to be true. And now, actually, now I have a coherent way of understanding how it is in fact, true. Right? So these sort of human intuitions that we have about the presence of spirits, for instance, there is a vocabulary, there is a tradition to understand and access and approach in the right way these realities, because, like, there are other ways to access them that are not the right way. You know, you can engage in the occult. You can engage in, like we were talking about offline psychedelic drug usage. You can engage in this stuff and get in contact with the spiritual world, but you're lost."}
{"episode_id":"SW - #123 - 2020-11-04 - Fr. Andrew Damick and Fr. Stephen De Young - Gods, Angels and Demons","start":1179.2,"end":1248.93,"speaker":"Jonathan Pageau","text":"That's the difficulty is that a lot of the. There's a hierarchy of beings, and there's also a hierarchy in the good sense, in the sense that that which is connected to which is above. But there's also hierarchy in the sense that there is a bunch of stuff that's different, disconnected, or that's wild and not that. You know, that is beings that are on their own and doing their own thing. And people have no way of discerning how. What. Or how what they're encountering when they go on these trips. At least that's my perception. You know, people. I remember one time a guy who I respect very much, but he was telling me about psychedelics, and he was, you know, he was trying to get me to do psychedelics. A lot of people are trying to get me to do psychology psychedelics. And so I was asking questions. I'm like, okay, well, tell me about your thing. You know, explain it to me. And he's saying. And then he says, well, you take psychedelics and everything, and if you ever see a monster, he said, you know, just relax. Just relax and, like, ask it what it has to teach you. And I'm like, you know what? Let's. Let's move on to something else, because if I see a monster, I'm not going to ask it what it has to teach me, because that would probably not be good for my soul."}
{"episode_id":"SW - #123 - 2020-11-04 - Fr. Andrew Damick and Fr. Stephen De Young - Gods, Angels and Demons","start":1249.25,"end":1273.21,"speaker":"Fr Andrew Stephen Damick","text":"You know, it's funny, and I want to. Yeah, right. Don't talk to the monsters. But, you know, it's funny. Like. So within 24 hours of our first episode, we must have received, I don't know, five or six messages from people that essentially kind of went like this. My house is haunted. What am I supposed to do about this?"}
{"episode_id":"SW - #123 - 2020-11-04 - Fr. Andrew Damick and Fr. Stephen De Young - Gods, Angels and Demons","start":1273.21,"end":1273.65,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #123 - 2020-11-04 - Fr. Andrew Damick and Fr. Stephen De Young - Gods, Angels and Demons","start":1275.42,"end":1292.3,"speaker":"Fr Andrew Stephen Damick","text":"You know, and I mean, like, we're gonna talk about this at some point, but yeah, I mean, Father Stephen, you could probably comment on that. Like, I don't know. It's so funny. We're just Kind of there's this explosion of interest that we've experienced. And so there's an unending list of topics, you know."}
{"episode_id":"SW - #123 - 2020-11-04 - Fr. Andrew Damick and Fr. Stephen De Young - Gods, Angels and Demons","start":1292.94,"end":1318.54,"speaker":"Fr Stephen De Young","text":"Well, yeah, and there's, you know, I frequently brought up when I'm talking about this and you've heard me do it, like at speaking engagements, I bring up the fact that, for example, St. John Chrysostom, in one of his homilies, instructs his people on what to do when they encounter the spirit of a dead loved one. So apparently this happened frequently enough to people that he had to give them directions on what they should do. Right. And how they should handle it."}
{"episode_id":"SW - #123 - 2020-11-04 - Fr. Andrew Damick and Fr. Stephen De Young - Gods, Angels and Demons","start":1319.5,"end":1321.82,"speaker":"Jonathan Pageau","text":"What did he say? I need to know. What did he say?"}
{"episode_id":"SW - #123 - 2020-11-04 - Fr. Andrew Damick and Fr. Stephen De Young - Gods, Angels and Demons","start":1322.46,"end":1418.96,"speaker":"Fr Stephen De Young","text":"He said, assume it's a demon, right? Until prove it. Otherwise, assume it's a demon trying to trick you. But I say that and people kind of chuckle. They're like, wow, that's weird. And da, da, da, da, da. But then when everyone else leaves the room, I have people start coming up to me and say, hey, when my mom died, when my dad died, when my aunt died, when my grandma died, I kind of. Did. They tell me they've had that experience. And I think these experiences are. Well, because this is reality. Because spiritual reality is reality. People have these experiences. They try to write them off or re. Explain them or, man, I must ate something weird or whatever, or they just don't admit that they've had them because everybody, again, they won't be respectable. Everybody will look at them like they're crazy. So reality intrudes on people's lives. And so part of what I think is valuable about what we're trying to do, hopefully for people, is that we'll give them a context, an orthodox context in which to talk about and understand that, you know. And what. What do you do when your house is haunted? Well, I've done an exorcism on a house, and I ended up doing it because it wasn't an Orthodox person. It was a person from a Nazarene church. But he went to his pastor and said, hey, this weird stuff is happening. This thing grabbed me and left like, burnt finger marks on my body. What do I do? And his Nazarene pastor was like, I don't know. You need to go find a priest."}
{"episode_id":"SW - #123 - 2020-11-04 - Fr. Andrew Damick and Fr. Stephen De Young - Gods, Angels and Demons","start":1421.28,"end":1423.84,"speaker":"Jonathan Pageau","text":"Don't you watch movies? Find a priest. What do you do here?"}
{"episode_id":"SW - #123 - 2020-11-04 - Fr. Andrew Damick and Fr. Stephen De Young - Gods, Angels and Demons","start":1424.72,"end":1443.71,"speaker":"Fr Stephen De Young","text":"Like, this isn't in my wheelhouse, right? I don't have the toolbox for this. Right? So, I mean, these things happen to people, and they're normal in the sense that they're part of the whole world. We've just done everything we can to blind ourselves to the whole spiritual element of the world around us."}
{"episode_id":"SW - #123 - 2020-11-04 - Fr. Andrew Damick and Fr. Stephen De Young - Gods, Angels and Demons","start":1443.79,"end":1579.08,"speaker":"Jonathan Pageau","text":"Yeah, well, one of the things that's being opened up, I would say, right now, is there are certain scientists and certain thinkers. There's someone, his name is Don Hoffman, who's kind of attracting a lot of attention. And he's. He's positing that consciousness is basically a fundamental part of. Of the world. Like it's a fundamental particle of the universe and that it scales down the human. It scales down from our experience all the way down to the subatomic level. And it scales up as well, beyond persons. And then this. This phenomenon of consciousness scales up. And. And so, you know, and he's really kind of muddling around. You can tell that he doesn't have any traditional metaphysics. He hasn't studied philosophy. He's really doing it as a scientist, but he's. He's trying to account for consciousness, which is the last thing that scientists are unable to really account for. They can't explain it. They don't understand it, despite the fact that it's through consciousness that they're saying everything they're saying that they're. Everything they're doing is basically through the lens of consciousness, but they can't account for that phenomena. They think it's just a phenomena. It's not a phenomena. Right. It's that it's the place. The place meeting of heaven and earth, we could say. But what happens is that it opens up the possibility, even for materialists are kind of scientifically minded, the possibility that the world actually organizes itself not just in material categories, but in consciousnesses. And if you join that with a kind of traditional metaphysics, if you imagine, let's say, the Platonic metaphysics of ideas, that the notion that there's a hierarchy of concepts, you could say, or ideas, whereas the real traditional way of understanding it is that, no, there's a hierarchy of beings, the world manifests itself through beings. And that even things in the world that, say, sectors of reality are. Have principalities that are beings that are managing those. Those things. And it's hard for people to kind of grasp that. But if you. In our human endeavor, that's how it works. Right. We have a mayor, we have a president, we have a general. We have these characters that are acting as principalities on larger constituents."}
{"episode_id":"SW - #123 - 2020-11-04 - Fr. Andrew Damick and Fr. Stephen De Young - Gods, Angels and Demons","start":1579.08,"end":1693.27,"speaker":"Fr Stephen De Young","text":"You could say, yeah, I'm totally fascinated by panpsychism, which is what you're talking about. Yeah, yeah. In large part because it accords with you mentioned the Platonic metaphysics. But, I mean, back when I was studying philosophy, I did a thesis on. In Aristotle's physics. Aristotle has everything having a will. Anything that has a nature has a will because will is a function of nature, which is also part of our orthodox theology that separates us from the west in a lot of ways. But that's sort of treated as some kind of weird crude, of course, by modern people reading Aristotle, they're like, oh, this is some weird crude. He's, you know, humanizing natural elements and the world soul and all of this. But this was basic to the ancient view, is that there are these consciousnesses associated with everything in the material world. And as you say that the idea that they scale based on the complexity of the system that they represent. But. And then the question was, like when you read Philo responding to Plato in a Jewish context, he's saying these consciousnesses aren't gods to be worshiped in their own right. Right. They're gods. We would put it with a small G. But they're those beings created by and appointed by the God to administer his creation and through whom he administers his creation. And then the idea of demonic rebellion is that some of these powers have rebelled and we're being worshipped as gods by the various nations treated as ends in themselves rather than as part of this hierarchy that leads toward the God."}
{"episode_id":"SW - #123 - 2020-11-04 - Fr. Andrew Damick and Fr. Stephen De Young - Gods, Angels and Demons","start":1695.35,"end":1785.7,"speaker":"Jonathan Pageau","text":"Yeah. One of the questions is probably. This is a question that I've had for a very, very long time. So I'm gonna ask Father Stephen because I want an answer to this. So one of the things that I. I would say people are going to call me a heretic now. But one of the things that I've appreciated, let's say, in the Islamic cosmology is the possibility of the jinns. Okay. That is, it seems to me, this is. And I might be wrong, because maybe I do come from a Protestant background, but it seems to me that in the Christian cosmology of which I'm aware of, there's this idea that there are, let's say, angelic beings that are connected in the hierarchy to God, and then there are demonic beings that are rebelling and therefore, let's say, fallen or scattered, full of pride and pulling the world apart, let's say diabolos. But we don't seem to have the possibility of beings that are neutral or that are ambiguous in between. And we don't have that. But then they reappear nonetheless as, like, fairies and gnomes and all these. All these, let's say, kind of Folk beings that are there for the Christians, even though they're not part of their official Christian. Christian cosmology, let's say. So to me, that's like something that I've always wondered about. Are there traces in the Fathers or in. In, let's say in the traditional text or the extra biblical. Extra biblical stories where we talk? There. There is this idea of neutral or ambiguous beings."}
{"episode_id":"SW - #123 - 2020-11-04 - Fr. Andrew Damick and Fr. Stephen De Young - Gods, Angels and Demons","start":1787.3,"end":1800.39,"speaker":"Fr Stephen De Young","text":"Yeah. I think. I think there are two answers to that. First is that that's sort of where humans are. Because humans are. Humans are both immaterial and material."}
{"episode_id":"SW - #123 - 2020-11-04 - Fr. Andrew Damick and Fr. Stephen De Young - Gods, Angels and Demons","start":1802.07,"end":1802.39,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #123 - 2020-11-04 - Fr. Andrew Damick and Fr. Stephen De Young - Gods, Angels and Demons","start":1802.39,"end":1868.54,"speaker":"Fr Stephen De Young","text":"But by being a soul, body unity, humans are the bridge between the unseen and the seen world. And so we are sort of in between in that regard, or able to move in either direction would probably be. Would probably be a better description. The other place where you see that kind of thing is with the idea of the giants, where you have this kind of. And we could talk about how to see that. But this quote unquote hybridization idea of something fallen and something human. Right. And there are. There are some outlier traditions, but there are some outlier traditions that have people who would be categorized as giants, but who are nonetheless righteous or repentant. And I think Father Andrew's favorite one that I, That I pointed out to him is that there is actually a tradition that Noah had some kind of Nephilim connection himself."}
{"episode_id":"SW - #123 - 2020-11-04 - Fr. Andrew Damick and Fr. Stephen De Young - Gods, Angels and Demons","start":1868.94,"end":1885.79,"speaker":"Jonathan Pageau","text":"Yeah. And then they represented different ways. Yeah. He's married to Naamah, like with his children. Or he himself is kind of a cause. He's an artisan. Even in the regular story, he can see that he has something of Cain's descendants because he builds a boat. And that all is in Cain's lineage."}
{"episode_id":"SW - #123 - 2020-11-04 - Fr. Andrew Damick and Fr. Stephen De Young - Gods, Angels and Demons","start":1886.43,"end":1897.39,"speaker":"Fr Stephen De Young","text":"Yeah. And there are a lot of stories of his miraculous birth. And there are a whole series of stories where after his sort of miraculous, weird birth, his father Lamech is kind of like, hey, is this mine?"}
{"episode_id":"SW - #123 - 2020-11-04 - Fr. Andrew Damick and Fr. Stephen De Young - Gods, Angels and Demons","start":1897.47,"end":1898.03,"speaker":"Fr Andrew Stephen Damick","text":"You know."}
{"episode_id":"SW - #123 - 2020-11-04 - Fr. Andrew Damick and Fr. Stephen De Young - Gods, Angels and Demons","start":1901.45,"end":1927.7,"speaker":"Fr Stephen De Young","text":"Did like an angelic being get involved here? Because he seems to be right. He has to sort of be reassured. And the dynamics of a lot of those stories actually get. They get inverted, but they get reused by St. Matthew in his gospel in terms of St. Joseph's questioning. When the Theotokos becomes with child. Now they get inverted because he's told the opposite answer. Lamech, sort of reassured, like, no, it's."}
{"episode_id":"SW - #123 - 2020-11-04 - Fr. Andrew Damick and Fr. Stephen De Young - Gods, Angels and Demons","start":1927.7,"end":1930.7,"speaker":"Jonathan Pageau","text":"He's your child. And Joseph's like, nope, it's not yours, Joseph."}
{"episode_id":"SW - #123 - 2020-11-04 - Fr. Andrew Damick and Fr. Stephen De Young - Gods, Angels and Demons","start":1930.7,"end":1953.5,"speaker":"Fr Stephen De Young","text":"It's like, yeah, no, it's not, you know, humans, but it's the same kind of dynamics in the story get played Out. So there is that. Those would be the two places, I think, where you would see something like that. Even then, I don't think there's ever really neutrality, but there's the capability for certain beings to move in either direction. They're not sort of locked in. In place."}
{"episode_id":"SW - #123 - 2020-11-04 - Fr. Andrew Damick and Fr. Stephen De Young - Gods, Angels and Demons","start":1953.74,"end":1994.37,"speaker":"Jonathan Pageau","text":"Yeah. Because C.S. lewis seems to want to try to recast that idea. And so, you know, he takes the different kind of little gods, or the. Like, the woodland creatures and the woodland spirits, and he recasts them in his Narnia series as being somehow something which I think are akin to the Djinn. Like, are these. These characters that you don't really know, like, they're kind of neutral? You're not sure. Some of them are with Aslan, some of them aren't. And some of them can flip. Anyway, so I just thought. I just was wondering about that. Cause I see that someone like C.S. lewis seems to have tried to create something akin to that in his series."}
{"episode_id":"SW - #123 - 2020-11-04 - Fr. Andrew Damick and Fr. Stephen De Young - Gods, Angels and Demons","start":1994.53,"end":2065.78,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And, you know, I mean, so, you know, you and I have talked about Tolkien in the past a little bit, and Tolkien tries to deal with this on some level, too. Right. So, on the one hand, you know, we were talking earlier about the idea of spiritual beings were engaged at kind of every level of creation, kind of helping to make it go like. One of the best fictional depictions of that is in The Silmarillion by J.R.R. tolkien. When you have the one God who creates this, you know, the angelic beings, and they're engaged in all this and so forth, and then. And then some of them rebel. Right. Justice happened in the real. The real world. And then at the same time, then there's various kinds of creatures that exist in his world, like. Like, you know, that. That seem to not necessarily always be entirely aligned in one direction or another, although, if you really had to sort them out, I think you could probably do it. But, like, the. One of the ways that he attempts to kind of solve this problem is you have men and elves, but he essentially says that elves are essentially a kind of version of man, you know, that they're two different types of peoples of the same one species."}
{"episode_id":"SW - #123 - 2020-11-04 - Fr. Andrew Damick and Fr. Stephen De Young - Gods, Angels and Demons","start":2067.06,"end":2068.98,"speaker":"Jonathan Pageau","text":"Like a caste system of some kind."}
{"episode_id":"SW - #123 - 2020-11-04 - Fr. Andrew Damick and Fr. Stephen De Young - Gods, Angels and Demons","start":2069.22,"end":2134.44,"speaker":"Fr Andrew Stephen Damick","text":"That it has to be sort of. Yeah, sort of. But of course, you know, elves can be evil, too, even though, like, when you encounter them in the Lord of the Rings, they're generally, you know, almost divinized. Right. But, yeah, so it's interesting how there's various people that are attempting to kind of work out how to deal with these problems of, you know, the how do you represent spiritual forces in the world? And also what do you do with the fact that mankind has always kind of seen, up until relatively recently has kind of seen fairies and sprites and gnomes around every tree. I think one of the problems that makes it difficult for us to understand that is that especially since the Victorian era, a lot of those creatures have been kind of domesticated. So like Tolkien hated, for instance, one of the things he hated about Shakespeare. Now he's pre Victorian, but one of the things he hate about Shakespeare is that Shakespeare's fairies are kind of too small, they're too weak. Right. They're too cute. And that really becomes extreme in the Victorian era."}
{"episode_id":"SW - #123 - 2020-11-04 - Fr. Andrew Damick and Fr. Stephen De Young - Gods, Angels and Demons","start":2134.44,"end":2135.08,"speaker":"Jonathan Pageau","text":"Peter Pan."}
{"episode_id":"SW - #123 - 2020-11-04 - Fr. Andrew Damick and Fr. Stephen De Young - Gods, Angels and Demons","start":2135.08,"end":2164.67,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, right. And now you get, you know, images of. You get Tinker Bell. Tinkerbell is the ultimate and cute fairies. Although it's interesting how Tinkerbell is then presented in Pierpan as being ultimately dangerous. Right. Tinker Bell attempts to kill Wendy. So even then you still have this idea that they're dangerous, but they've been made much, much smaller. Right. Whereas Tolkien's elves and fairies and so forth are dangerous people to run into and generally not a good idea."}
{"episode_id":"SW - #123 - 2020-11-04 - Fr. Andrew Damick and Fr. Stephen De Young - Gods, Angels and Demons","start":2165.79,"end":2224.12,"speaker":"Jonathan Pageau","text":"So one of the things that I don't bring up often, but I think in this case it's probably a good idea to bring up the author Rene Guinon, who was like an early century traditionalist and he came out of the occult. Some of the stuff he wrote is very. Is off. Some of the stuff he wrote is quite good. But one of his theories that he has was that materialism was like a wall that the civilization had built around itself to protect itself or to isolate itself from the spiritual world, let's say. And he said it was actually, you know, certain way successful like there. It's true, there are less miracles, there are less manifestations. You know, it's a. From the Enlightenment on, there are less and less connect connection with what you would call the spiritual world. And so the materialism, philosophical materialism and then had actually created this wall around the world. But his theory was that at the end one, because that can't hold, at some point it's going to start to crack."}
{"episode_id":"SW - #123 - 2020-11-04 - Fr. Andrew Damick and Fr. Stephen De Young - Gods, Angels and Demons","start":2224.2,"end":2224.46,"speaker":"Fr Stephen De Young","text":"And."}
{"episode_id":"SW - #123 - 2020-11-04 - Fr. Andrew Damick and Fr. Stephen De Young - Gods, Angels and Demons","start":2224.53,"end":2285.41,"speaker":"Jonathan Pageau","text":"And he called it the great fissures in the wall. But he said when the wall cracks, it's going to crack at the bottom, it's going to crack below and it's the stuff from beneath that are going to come up. But people are still going to be more isolated from the higher beings. And we've seen like he wrote that maybe in 1920. And we've seen it with all the New Age insanity and all the craziness, we've seen it kind of happen, manifest itself. And so this brings me then to the question of the, you know, kind of what you're trying to bring back, which is, you know, the Book of Enoch and the Enochian traditions we could call them, have been controversial like to a certain extent in Christianity, but nonetheless, it seems like they do offer us a way to deal with this in the world as we see these beings kind of creep back into reality. You know, it offers us a map or a guide to help us understand what exactly is going on. I don't know if you've thought about that."}
{"episode_id":"SW - #123 - 2020-11-04 - Fr. Andrew Damick and Fr. Stephen De Young - Gods, Angels and Demons","start":2286.21,"end":2397.38,"speaker":"Fr Stephen De Young","text":"Well, I think building off what you said, I think the rule of Christ gave us the luxury of materialism for a while because the Western world, Christendom as such. Right. The fact that there weren't practicing pagans and so sort of idolatry and the religious aspects of sexual immorality had been kind of ruled out. It kind of created this space where there weren't a lot of demonic manifestations and people getting possessed, which were commonplace in the ancient world and are still commonplace in some parts of the world, but within Christendom they became relatively rare and that allowed everyone to become materialists. Right. But the problem is that materialism then turned on Christ himself for a while in the 18th and 19th centuries. They kind of put brackets around God and Christ and said, well, we'll get rid of all the rest of this stuff, but we'll keep those. But once you deny those, you lose that sort of protection. And that's why you get sort of the return of, of demonic powers, of chaos sort of welling up from the bottom like you described. And in terms of the Anakic literature in particular, it was actually less controversial in the ancient church than it is now. I think, frankly, Sola Scriptura has poisoned the well in the west where we, even most orthodox people have this very binary view of like something is canonical, therefore 100% true and literal, or it's non canonical and therefore it's full of lies and it's garbage and you shouldn't read it and it's bad."}
{"episode_id":"SW - #123 - 2020-11-04 - Fr. Andrew Damick and Fr. Stephen De Young - Gods, Angels and Demons","start":2397.38,"end":2410.7,"speaker":"Jonathan Pageau","text":"Yeah. So why do you think the Naukic literature was lost? Because to a certain extent, I think the only copies of those texts were kept in Ethiopia and most of the whole world had lost those traditions. They were, they kind of had faded."}
{"episode_id":"SW - #123 - 2020-11-04 - Fr. Andrew Damick and Fr. Stephen De Young - Gods, Angels and Demons","start":2410.7,"end":2431.64,"speaker":"Fr Stephen De Young","text":"Away in some way in the West. In the west they had, we know they were still in circulation in the 8th and 9th centuries, you have Byzantine historians drawing on that. When they write their chronicles and write the history of the world, they're pulling directly from first Enoch for all of their early history of the world."}
{"episode_id":"SW - #123 - 2020-11-04 - Fr. Andrew Damick and Fr. Stephen De Young - Gods, Angels and Demons","start":2431.8,"end":2432.44,"speaker":"Jonathan Pageau","text":"Interesting."}
{"episode_id":"SW - #123 - 2020-11-04 - Fr. Andrew Damick and Fr. Stephen De Young - Gods, Angels and Demons","start":2433.24,"end":2470.06,"speaker":"Fr Stephen De Young","text":"And George Singelos in the Synchelos in the 8th century, basically said, this is the Byzantine word on first Enoch. He said it was an apostolic apocrypha. What he meant by that was, in the original meaning of apocrypha, something hidden. So he was saying this is a text that has this information that's part of the apostolic tradition, part of the apostolic preaching. St. Irenaeus, in his on the apostolic preaching, basically cites straight from first Enoch."}
{"episode_id":"SW - #123 - 2020-11-04 - Fr. Andrew Damick and Fr. Stephen De Young - Gods, Angels and Demons","start":2470.62,"end":2474.94,"speaker":"Jonathan Pageau","text":"The scripture cites quotes from Enoch, but."}
{"episode_id":"SW - #123 - 2020-11-04 - Fr. Andrew Damick and Fr. Stephen De Young - Gods, Angels and Demons","start":2475.02,"end":2478.7,"speaker":"Fr Stephen De Young","text":"It'S hidden in that. It's not read publicly in the churches."}
{"episode_id":"SW - #123 - 2020-11-04 - Fr. Andrew Damick and Fr. Stephen De Young - Gods, Angels and Demons","start":2478.86,"end":2479.26,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #123 - 2020-11-04 - Fr. Andrew Damick and Fr. Stephen De Young - Gods, Angels and Demons","start":2479.58,"end":2497.98,"speaker":"Fr Stephen De Young","text":"Because that's what canonical means. Means we read it in liturgy. Right. It's not read in liturgy, so it's hidden in that way. But it is this apostolic tradition. Even St. Augustine. And I hate bashing St. Augustine because he gets picked on way too much, but St. Augustine is really the first one to really reject."}
{"episode_id":"SW - #123 - 2020-11-04 - Fr. Andrew Damick and Fr. Stephen De Young - Gods, Angels and Demons","start":2498.14,"end":2498.78,"speaker":"Jonathan Pageau","text":"Oh, really?"}
{"episode_id":"SW - #123 - 2020-11-04 - Fr. Andrew Damick and Fr. Stephen De Young - Gods, Angels and Demons","start":2499.26,"end":2556.09,"speaker":"Fr Stephen De Young","text":"Yeah. And that's why it sort of fell into disfavor in the west, because the west became all about St. Augustine. But even he, when he talked about the Book of Enoch itself, said that. Well, yes, Enoch wrote something. He says St. Jude quotes it as being from Enoch. He says, but this text is so old, that would mean. Right. That means it's antediluvian. It's from before the flood. He says it's so old, we have no way to verify that what we now have is the original Book of Enoch. And that's why you shouldn't trust it. Right, right, right. That was his argument. It wasn't to just say, this is spurious. So even he, who was the first one to really be against it, had this sort of marginal acceptance. And St. Jerome, at the same time, his contemporary, went into a protracted argument about how, well, Noah must have had a copy on the ark, like, to explain how the."}
{"episode_id":"SW - #123 - 2020-11-04 - Fr. Andrew Damick and Fr. Stephen De Young - Gods, Angels and Demons","start":2556.09,"end":2557.93,"speaker":"Jonathan Pageau","text":"She's going all out with that."}
{"episode_id":"SW - #123 - 2020-11-04 - Fr. Andrew Damick and Fr. Stephen De Young - Gods, Angels and Demons","start":2558.09,"end":2604.13,"speaker":"Fr Stephen De Young","text":"My goodness, like, how could this have survived the flood? Well, Noah must have had a copy that he got from his great grandfather and brought with him, you know, this whole elaborate thing. So it was much more accepted in the early church because they didn't have. They really had three categories. They had canonical, that's read in liturgy. They had books to be read in the home, and then they had books not to be read or heretical, and the books to be Read in the home. So you still find people the 5th and 6th century quoting the shepherd of Hermas authoritatively, for example, but they wouldn't have said it was canonical. They wouldn't have read from it in liturgy, but they're still quoting from it. Same thing with 1st Enoch all the way into the 8th and 9th century with examples we still have."}
{"episode_id":"SW - #123 - 2020-11-04 - Fr. Andrew Damick and Fr. Stephen De Young - Gods, Angels and Demons","start":2604.13,"end":2702.31,"speaker":"Jonathan Pageau","text":"Yeah, I'm happy to hear that, because I have been trying to, let's say, slowly reintroduce the ideas from first Enoch, mostly because it seems like it offers us a map of what's happening around us right now. Because one of the stories of first Enoch is, of course, the increasing of technicity, which is connected with magic. We tend to want to separate those, but they're really very similar in the sense that there's an accelerated modification of nature, which is brought about by connection with these demonic beings. And these demonic beings teach all the different crafts and the different. Also ornamentation, which is important. I think it's Azazel, who teaches both metallurgy and ornamentation, which is like such a great, great connection between the two. Weapon making and seduction making, you know. But so, but so it seems like we're going through the same. The same situation that was happening first Enoch. This acceleration of technicity, the loss of virtue, the loss of morality, the falling into sexual immorality to an extreme degree, all of this is kind of happening at the same time as we're talking about. As we're talking about the notion of creating an AI, for example, that would be this artificial intelligence. I always tell people, if you want to know what a fallen angel is, just imagine what AI is going to be like. That's probably going to be the closest thing you're going to come into contact with in AI so anyways, maybe tell me a little bit about your perception of that trope that I'm trying to bring up here."}
{"episode_id":"SW - #123 - 2020-11-04 - Fr. Andrew Damick and Fr. Stephen De Young - Gods, Angels and Demons","start":2703.27,"end":2812.62,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I think you're right. And, you know, one of our problems in looking at material from the ancient world is we tend to assume materialism as being what's actually true. And so when we see stuff from the ancient world, we tend to think like, if we're trying to give them a break, we'll say, oh, well, they saw lightning and thunder and they didn't understand it. And so therefore they had to come up with Thor or Perun or Perknas or Zeus, you know, and then that was their explanation. And so then they wrote stories, you know, that were probably initially metaphors. And eventually people took them as being real. And then they thought that Zeus was a real being. Right. As an example. But the problem is that, number one, doesn't take seriously what these people are saying about their own actual experiences. Right? And you know, that they're actually encountering divine beings and they're engaging with them. That's what they say about themselves. Now, we can simply say they're all lying, but if we accept that idea, then we're basically saying that almost every single text from the ancient world is a lie. That people are lying about their actual lives, you know, across the world, consistently. And interestingly, they're lying in very similar ways throughout the whole world, the whole globe. Right. You know, like, I'll give an example that blew my mind when Father Stephen first told me about it. He said almost every ancient culture, when they depict spiritual beings that they encounter, depicts them as being about 15ft tall. Everywhere, Africa, Asia, Indo European cultures, South America, Egyptians, everyone is depicting their gods as being about 15ft tall. Like, what is that about? I mean, like, you could explain, I."}
{"episode_id":"SW - #123 - 2020-11-04 - Fr. Andrew Damick and Fr. Stephen De Young - Gods, Angels and Demons","start":2812.62,"end":2814.38,"speaker":"Jonathan Pageau","text":"Don'T know, maybe you could explain it, right?"}
{"episode_id":"SW - #123 - 2020-11-04 - Fr. Andrew Damick and Fr. Stephen De Young - Gods, Angels and Demons","start":2814.38,"end":2913.96,"speaker":"Fr Andrew Stephen Damick","text":"Like, so, like, you could, for instance, do the historical critical thing and say, okay, well, maybe someone at some ancient Indo European point depicted a 15 foot tall God. And so then therefore all of these Indo European cultures got the 15 foot tall God from that and it kind of spread out from there. Right? You know, essentially kind of explain it linguistically, you know. But the problem is you have cultures that are not connected to those cultures at all that are depicting the same things. So you could either say, like, wow, that's an interesting, massive, enormous coincidence all over the world, everywhere, or you could say, well, maybe they're all having a similar experience and so they're all therefore all depicting this same experience that they're all having, you know, and so, like, that's one example of these things that are kind of right in front of us, but that we just sort of just disbelieve them from the outset. Right? But I think you're right that we are now experiencing this kind of increase in, for lack of a better term, spiritual activity. Right? And it's funny, like one of the jokes that Father Stephen and I have sometimes made about the way that we're already interacting with people about the Lord of Spirits podcast is, you know, at some point we're gonna have to say, look, we're not Ghostbusters. We are, we are, number one, we are ready to believe you. We are ready to believe you. You know, but, but that's like, that's not what we're talking about. But it's interesting that what happens in the Ghostbusters films, right, is this sense of this increase in spiritual activity. You know, they're talking about that. So that's, that's interesting."}
{"episode_id":"SW - #123 - 2020-11-04 - Fr. Andrew Damick and Fr. Stephen De Young - Gods, Angels and Demons","start":2913.96,"end":2941.39,"speaker":"Jonathan Pageau","text":"It's in Ghostbusters, it's all materialist. It's all ectoplasm and like capturing the ghosts in these machines. It really is like the worst of 19th century kind of materialist magnetism. All that kind of, I'm sorry to say, crap that came up in the 19th century to kind of to make the spiritual world into material categories. People write seances and then they would gather this goo which was like."}
{"episode_id":"SW - #123 - 2020-11-04 - Fr. Andrew Damick and Fr. Stephen De Young - Gods, Angels and Demons","start":2943.15,"end":3029.32,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. I think the dynamic you're pointing, which obviously is front and center in the book of the Watchers in the Book of Enoch about the connection between the increase of kind of demonic activity and the increase in technology has to do with the way, even if we just stick with the Old Testament, the way in the Old Testament that the spiritual powers of chaos and evil attack. Right. Their goal is the destruction of God's creation in general and humans in particular. And the way they do that consistently is by trying to give to humans ideas, thoughts, wisdom, knowledge that they're not prepared for, that they aren't in a spiritual state to receive yet because they know that will cause self destruction. That starts with the serpent, with Eve. You know, take the knowledge. Yeah, right, yeah. That you're not prepared for yet. It's not that the tree was evil, it's that that they weren't prepared and all the way through. And that's the same thing in the Watchers story, right. Where I'm going to give them weapons technology. They're not prepared to use it responsibly and so they're going to use it to kill each other. I'm going to give them these means, the women, these means of seduction because they're not prepared for it. And they're going to fall into sexual immorality. All this destruction and chaos comes."}
{"episode_id":"SW - #123 - 2020-11-04 - Fr. Andrew Damick and Fr. Stephen De Young - Gods, Angels and Demons","start":3029.48,"end":3029.96,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"SW - #123 - 2020-11-04 - Fr. Andrew Damick and Fr. Stephen De Young - Gods, Angels and Demons","start":3029.96,"end":3042.59,"speaker":"Jonathan Pageau","text":"And it's knowledge that fills your desires. It's knowledge to fulfill your desire for power, for domination, for seduction. All of these things that it's basically how to act upon the world to get what you want is what they're giving the people."}
{"episode_id":"SW - #123 - 2020-11-04 - Fr. Andrew Damick and Fr. Stephen De Young - Gods, Angels and Demons","start":3043.79,"end":3067.44,"speaker":"Fr Stephen De Young","text":"Yeah. And that's that experience again, like Father Andrew was saying is universal. That's why you read about Prometheus. It's, it's, it's all of that understanding that there are these spiritual powers who gave to man knowledge. He wasn't Ready for. That's been destructive. And they were punished for it. Is. Is universal."}
{"episode_id":"SW - #123 - 2020-11-04 - Fr. Andrew Damick and Fr. Stephen De Young - Gods, Angels and Demons","start":3067.52,"end":3068,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #123 - 2020-11-04 - Fr. Andrew Damick and Fr. Stephen De Young - Gods, Angels and Demons","start":3068.24,"end":3069.12,"speaker":"Fr Stephen De Young","text":"Around the world."}
{"episode_id":"SW - #123 - 2020-11-04 - Fr. Andrew Damick and Fr. Stephen De Young - Gods, Angels and Demons","start":3069.44,"end":3085.96,"speaker":"Jonathan Pageau","text":"And you see it. It's funny because you even today, I don't know because I've mentioned this before. I've been sadly, I mean, strangely you've been connected with all these people doing. Doing psychedelics. And so, you know, they talk about these mechanical elves that they meet, whatever they call them Cockwells or whatever."}
{"episode_id":"SW - #123 - 2020-11-04 - Fr. Andrew Damick and Fr. Stephen De Young - Gods, Angels and Demons","start":3085.96,"end":3086.52,"speaker":"Fr Stephen De Young","text":"Machine elves."}
{"episode_id":"SW - #123 - 2020-11-04 - Fr. Andrew Damick and Fr. Stephen De Young - Gods, Angels and Demons","start":3086.52,"end":3141,"speaker":"Jonathan Pageau","text":"Yeah, machine elves or I don't know. And I keep. And I read a story, a comic book story about Santa Claus which was written by a weird pagan guy, Grant. Grant Morrison wrote a Santa Claus story. And he has Santa Claus meeting these machine elves, right. He takes some mushrooms or whatever, then he sees these elves and then he makes toys better. But then he also like ends up making a sleigh into like a super slay or whatever. But what I was thinking is that, wow, they were actually encountering the demons from first Enoch. Like they're actually encountering these demons, beings that are giving them like mechanical formula or showing them technological feats that they then kind of encounter. And so it's just very strange because we already have this story from the stories from thousands and thousands of years ago, but we seem to be going through similar process right now."}
{"episode_id":"SW - #123 - 2020-11-04 - Fr. Andrew Damick and Fr. Stephen De Young - Gods, Angels and Demons","start":3141.32,"end":3156.08,"speaker":"Fr Stephen De Young","text":"Yeah. And ayahuasca isn't a new thing, Right. Like it's been around. To give you an idea of how long it's been around. The Greek word that's usually. When you read sorcery in your English Bible, the Greek word that's usually behind that is pharmakeia."}
{"episode_id":"SW - #123 - 2020-11-04 - Fr. Andrew Damick and Fr. Stephen De Young - Gods, Angels and Demons","start":3156.16,"end":3156.64,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #123 - 2020-11-04 - Fr. Andrew Damick and Fr. Stephen De Young - Gods, Angels and Demons","start":3158.48,"end":3178.31,"speaker":"Fr Stephen De Young","text":"Because they were using pharmaceutical. Right. Even the oracle Adelphi was inhaling fumes coming out of a crack in the ground to produce an altered state of consciousness in order to be possessed by the spirit of Apollo, you know, and give these oracles. So, yeah, it's not a new thing. That experience has just continued into the modern world."}
{"episode_id":"SW - #123 - 2020-11-04 - Fr. Andrew Damick and Fr. Stephen De Young - Gods, Angels and Demons","start":3178.87,"end":3204.3,"speaker":"Fr Andrew Stephen Damick","text":"You know, one of the things I think that makes so much of this stuff very urgent is that like we were just talking about drug use, for instance. Right. For a lot of people, they might ask like, why. Why is it immoral for me to do psychedelic drugs? Right. And I mean, if you listen to everything we just said, then it becomes clear why it's a super bad idea, why it's a rebellion against God. Because you're entering into communion with these other spirits."}
{"episode_id":"SW - #123 - 2020-11-04 - Fr. Andrew Damick and Fr. Stephen De Young - Gods, Angels and Demons","start":3204.62,"end":3216.3,"speaker":"Jonathan Pageau","text":"It's mostly dangerous. It's like. It's like going on down a dark road without anybody to guide you. And you know, you encounter beings and you think they're there to help you. Like, what are you talking? What are you doing? This is really not safe."}
{"episode_id":"SW - #123 - 2020-11-04 - Fr. Andrew Damick and Fr. Stephen De Young - Gods, Angels and Demons","start":3216.54,"end":3336.63,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And you know what's, what's interesting, like, if you understand Christian morality not just in terms of a list of things you're supposed to do and not supposed to do, but, but rather actually, like, this is the right way to interact with the, with the spiritual world as it, as it actually exists, then all the other elements, for instance, of Christian morality, such as sexual morality, and even things like, like the right way to worship God. Like, this all makes much more sense if we understand it as not just being. Instead of arbitrary tastes or preferences or even just desires, but this is actually you're interacting with reality and there are things that result from that interaction. Right? So, like, that's why, for instance, over and over again in Scripture, you've got idolatry and sexual immorality are just paired together as always going together, you know, as an example. And I think it's, you know, it's. It's frustrating on the one hand to see the modern world just diving headlong into immorality. Not because it's like we're sitting here and saying, look how moral we are. How dare they? You know, like, that's not. But, but the problem is a lot of people, that's how they see what Christianity is. That's. They think Christianity is sort of moralism. But really it's like that immorality is immoral not because it violates a law somewhere in the sense of a legal code, but rather that it is, you know, it's like telling your children not to stick their hand on a hot stove. Like, that's reality. Like, it's not just right and wrong. Don't tell me what to do, dad. You know, like, no, it's like, no, you are going to be burned if you engage in immorality. You are entering into communion with demons. You are, you know, like, that's just objective truth. And you can watch people, like I saw this as a pastor, watch people who, who get into the. Get into it a little bit, and they get into a little bit more and get into a little bit more, and then, you know, they would not even recognize where they had gone, you know, when they got it, where they were at the beginning of that process."}
{"episode_id":"SW - #123 - 2020-11-04 - Fr. Andrew Damick and Fr. Stephen De Young - Gods, Angels and Demons","start":3337.59,"end":3407.45,"speaker":"Jonathan Pageau","text":"And so this, to me, this is. I'm. I could just say that I'm very excited to see where this is going to go, and I'm really happy to. That you're taking this trip and in a way, I'm happy that you're doing it, that I'm not doing it, because first of all, I don't have the knowledge to do it, of course, but also because I know this road is going to be fraught with all kinds of strangeness that is going to manifest itself to you in terms of demonic things attacking you, but also people coming to you, like Father, Father Andrew already said, coming for help, trying to get them to deal with these experiences that they've had that they don't understand. In a modern world where, you know, all of this has been, although wealthough it's everywhere in our fiction, it's everywhere in our stories. You know, in the real world, people try to avoid it or try not to talk about it or put it to the side, but nonetheless, it's. If you look at all the card readers and all the new age stuff and people are trying to understand this. And so. And so I'm happy to see that I've got orthodox priests trying to guide people along the road so they don't get lost."}
{"episode_id":"SW - #123 - 2020-11-04 - Fr. Andrew Damick and Fr. Stephen De Young - Gods, Angels and Demons","start":3408.09,"end":3423.25,"speaker":"Fr Andrew Stephen Damick","text":"I think that, you know, and I say this not in a kind of to draw attention to us kind of way, but I think the fact that we are priests, it's not just a question of like, authority. Right. In the sense of like."}
{"episode_id":"SW - #123 - 2020-11-04 - Fr. Andrew Damick and Fr. Stephen De Young - Gods, Angels and Demons","start":3423.25,"end":3425.37,"speaker":"Jonathan Pageau","text":"Although it is, we're talking about principalities. Right."}
{"episode_id":"SW - #123 - 2020-11-04 - Fr. Andrew Damick and Fr. Stephen De Young - Gods, Angels and Demons","start":3425.37,"end":3539.21,"speaker":"Fr Andrew Stephen Damick","text":"So that's the kind of authority. Yeah, right. That's the authority that I mean is, you know, and it's interesting. Like, for instance, I had the experience one time just. And this would. This happened years ago where my wife was somewhere and I mean, I wasn't even present, but my wife was somewhere. And this woman approached her in public and essentially kind of offered her. I don't know if it was a seance or a fortune telling or something like that. Like, you know, and my wife told me that she looked the woman straight in the eye and said, my husband is an orthodox priest. That was the one thing she said. And she said that the woman like, drew back in sort of shock and fear. Right, right. So it's not that, like I'm some holy person. I'm not, I'm not. But as priests, our task is to stand at the altar and to facilitate people communing directly with God and being engaged with the angels and the saints. And so, you know, there are many times, you see in scripture where priests engage in this kind of spiritual warfare. Not again, not because they have some special holiness all their own, but because this is the way that God has Chosen to work, right? You know, that offering incense, that offering up the Eucharist, these things are spiritually powerful and not just in an individual way that makes somebody have a spiritual experience, but like for instance, that offering up incense fumigates the space from dark powers. That's literally what is happening when incense is being. It's clearing them out. And you see it happening in the Bible, right? It happens. Father Stephen, what's that passage where you see, isn't it Aaron and a couple of other ones, like there's some kind of plague that has happened with the people of Israel until they offer up incense to drive this up."}
{"episode_id":"SW - #123 - 2020-11-04 - Fr. Andrew Damick and Fr. Stephen De Young - Gods, Angels and Demons","start":3539.93,"end":3596.27,"speaker":"Fr Stephen De Young","text":"After the rebellion of Korah, Aaron takes his censor and his sons take their censors and sort of stand between the language is that they stand between the living and the dead offering incense. And as they stand there, sort of the plague stops at that line like that forms the sort of barrier between, between life and death. And yeah, that, that's. This is another one of those things that ancient people just understood. You see people offering incense and incense is offered as a sacrifice. There are altars of incense, right? But incense is offered all over, all over the world, in every culture. And it's so ingrained that the, the Greek word for purification, right, Katharisiya, is derived from the Akkadian word for incense, kitaru. That's where it comes from."}
{"episode_id":"SW - #123 - 2020-11-04 - Fr. Andrew Damick and Fr. Stephen De Young - Gods, Angels and Demons","start":3597.71,"end":3703.01,"speaker":"Jonathan Pageau","text":"And there's something, I think the materialists who are watching this, who are listening to this, they really struggle to understand this stuff. And I always want to try to point them back to the notion of intelligence and the notion of consciousness that we brought up at the beginning, which is that if the world is constituted by consciousnesses or by intelligences, that if these intelligent patterns are the way in which the world lays itself out, then it's not strange to think that ritual behavior or that acting in a way that is meaningful will, will be part of it, will alleviate these problems, that, that doing certain things that have meaning, that and that have a coherent kind of symbolic ritual meaning will affect the world because that's how the world lays itself out, as meaning and as intelligences. And of course, if people can't even conceive that or understand that, then it all looks like superstition and bunk and just whatever. But we do it all the time. We use meaning to affect the world all the time, you know, and the most recent one is one of them. The most recent ones is this mask wearing thing. So, so much of the mask wearing thing is a ritual behavior. I even Saw someone posted recently a post from the New England Journal of Medicine saying that the main aspect of mask wearing is a talisman function where as people wear the mask, they feel safe and they, they are willing to act out in the world because they have this kind of protective garment that is shielding them from, from their perceived danger. You know, and so that's an, that's a, that's a ritual. That's a ritual behavior."}
{"episode_id":"SW - #123 - 2020-11-04 - Fr. Andrew Damick and Fr. Stephen De Young - Gods, Angels and Demons","start":3703.73,"end":3787.36,"speaker":"Fr Stephen De Young","text":"Yeah, I mean, it's, it's, I think again, just basic that, that ritual. Well, ritual does something. Right? Too often people look at ritual, they obviously 99.999% of people in the world have never studied ritual theory. But, but we look at ritual, we tend to look at it in this sort of diagnostic way where even if we' Liturgy or the parts of the liturgy. Right. Well, this represents this and this represents that and this stands for that. But ritual does something. And so, yes, the person who participates in ritual is going to be shaped by that. The community that participates in ritual is going to be shaped by that. They're going to be brought together as a community and that community is going to be formed in certain ways. And the example I use with people who are just raw materialists is I talk to them about sports. Maybe this only works in the U.S. i don't know, maybe it works with football, other places, like non American football. But it does not matter what socks you wear in terms of whether your team will win or not. It doesn't matter whether you watch the game. Like on a materialist level, it doesn't matter what you do. It's not going to affect the outcome of the game. But you cannot tell a sports fan that what they do and their rituals and those kind of things, you know, Dressing up like a team member."}
{"episode_id":"SW - #123 - 2020-11-04 - Fr. Andrew Damick and Fr. Stephen De Young - Gods, Angels and Demons","start":3787.44,"end":3788.08,"speaker":"Jonathan Pageau","text":"Yeah, you're right."}
{"episode_id":"SW - #123 - 2020-11-04 - Fr. Andrew Damick and Fr. Stephen De Young - Gods, Angels and Demons","start":3788.08,"end":3806.24,"speaker":"Fr Stephen De Young","text":"Yeah. Dressing up like a team member, as far as they're concerned, that's part of the game, that's part of their team winning is their support from their house miles and miles away. You know, so we understand it at some base level, even if we won't let ourselves fully sort of appropriate it."}
{"episode_id":"SW - #123 - 2020-11-04 - Fr. Andrew Damick and Fr. Stephen De Young - Gods, Angels and Demons","start":3806.72,"end":3879.06,"speaker":"Jonathan Pageau","text":"The example I would use is shaking hands. Because, you know, you could say shaking hand represents showing your hands that you don't have a weapon, that shaking hands represents, you know, a movement towards the other, blah, blah, blah. But it doesn't just represent it. If you're actually doing the thing, you're encountering someone and the gesture is creating the bond between you and that person. It's not just a represent, although you can Find all the meaning and it's there. You can. You can show it. You can show how all of this is very, very meaningful. But it's also acting in the world and transforming the world in the way that ritual does. Well, this has been good. We've been going for way longer than I usually go. I knew this was gonna happen. But I am really excited, like I said. And I first of all appreciate you coming on here. And I want to tell all the people listening to tune in. It'll probably be a lot to think about, a lot to discuss, a lot to debate about. I'm certain you're going to create all kinds of controversy with this podcast, which is going to be good controversy that'll bring up the help us understand a lot of the spiritual malaise that is in the modern world today. So thank you for your time and thank you for all your efforts."}
{"episode_id":"SW - #123 - 2020-11-04 - Fr. Andrew Damick and Fr. Stephen De Young - Gods, Angels and Demons","start":3879.46,"end":3881.14,"speaker":"Fr Andrew Stephen Damick","text":"Thank you, Jonathan. We appreciate it."}
{"episode_id":"SW - #123 - 2020-11-04 - Fr. Andrew Damick and Fr. Stephen De Young - Gods, Angels and Demons","start":3881.78,"end":3882.82,"speaker":"Fr Stephen De Young","text":"Thank you for having us."}
{"episode_id":"SW - #123 - 2020-11-04 - Fr. Andrew Damick and Fr. Stephen De Young - Gods, Angels and Demons","start":3883.46,"end":3892.74,"speaker":"Jonathan Pageau","text":"Maybe in a few months, once you've given us a full demonology and angiology, I'll have you back on the show and we can talk about it again."}
{"episode_id":"SW - #123 - 2020-11-04 - Fr. Andrew Damick and Fr. Stephen De Young - Gods, Angels and Demons","start":3893.78,"end":3894.34,"speaker":"Fr Andrew Stephen Damick","text":"That's good."}
{"episode_id":"SW - #123 - 2020-11-04 - Fr. Andrew Damick and Fr. Stephen De Young - Gods, Angels and Demons","start":3895.38,"end":3896.1,"speaker":"Fr Stephen De Young","text":"Absolutely."}
{"episode_id":"SW - #123 - 2020-11-04 - Fr. Andrew Damick and Fr. Stephen De Young - Gods, Angels and Demons","start":3896.34,"end":3896.7,"speaker":"Fr Andrew Stephen Damick","text":"Bye."}
{"episode_id":"SW - #123 - 2020-11-04 - Fr. Andrew Damick and Fr. Stephen De Young - Gods, Angels and Demons","start":3896.7,"end":3897.06,"speaker":"Fr Stephen De Young","text":"Bye."}
{"episode_id":"SW - #123 - 2020-11-04 - Fr. Andrew Damick and Fr. Stephen De Young - Gods, Angels and Demons","start":3898.1,"end":3963.01,"speaker":"Jonathan Pageau","text":"I hope you enjoyed this episode of the Symbolic World. The Symbolic World is edited by Justin Ward and it is based on a series of videos that you can find on my YouTube channel, Jonathan Pageau's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by, of course, leaving a review on itunes. Everybody knows that's the best way to get the podcast out there, to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon Pageau videos as well, and on subscribestar. All those links you can find on my website or in the show description. So thank you and I will see you soon."}
