{"episode_id":"SW - #055 - 2019-09-04 - Symbolism Happens","start":0.72,"end":80.5,"speaker":"Jonathan Pageau","text":"On this episode of the Symbolic World podcast, I'm playing for you a discussion that I had called Symbolism Happens. And in this particular ranty discussion, I look at some of the criticism that people have been leveling at me or has been buzzing around me, which is that somehow symbolic interpretation is a way to deny the events of the Bible or the fact that things happened or not. And I tried to rectify that understanding and try to point to the fact that symbolism is rather the bringing together of patterns and that reality or manifest reality or events also participate in that manner in which things come together and show themselves. And so, yeah, hopefully it will become simpler as you listen to the actual explanation. So just remind everybody that everything I do here online, this podcast, you know, even putting out this podcast, I have someone who helps me to do that. The videos I have people help me edit it. And so it's all possible due to your generous support. So go check out the symbolicworld.com and see how you can support this podcast. Of course, sharing, subscribing. And I hear also that leaving a five star review is quite helpful for this podcast. So if you can go do that wherever it is that you listen to this podcast. And so please enjoy this discussion about how symbolism happens."}
{"episode_id":"SW - #055 - 2019-09-04 - Symbolism Happens","start":93.92,"end":97.36,"speaker":"Jonathan Pageau","text":"This is Jonathan Pageau. Welcome to the Symbolic World."}
{"episode_id":"SW - #055 - 2019-09-04 - Symbolism Happens","start":108.8,"end":1557.29,"speaker":"Jonathan Pageau","text":"For those who follow me carefully, I would say most people by now understand that when I talk about symbolism, I am not talking about the notion of metaphor or the idea like you would say the wind was cold like my heart in winter or whatever, some kind of poetic metaphor to describe something, to give it feeling or to give it. Or even a kind of simple metaphor in the sense of, let's say the Pilgrim's Progress, where this image means something else in the world. When I talk about symbolism, I. That is not what I'm talking about. What I am talking about is the notion that underneath our stories, underneath images, underneath also the way we experience the world, there are patterns and that those patterns are really the way the patterns of how reality lays itself out. So when I'm talking about symbolism, I am not suggesting that the events that are being referred to or the things that are being spoken about didn't happen. Sometimes they didn't happen, sometimes they did happen. The important aspect that I'm trying to point to is whether or not we're telling a story, whether it's a fictional story or it's actually a story of something that happened, an important thing that happened. Especially those, the structure by which we even recognize that it's a story, the structure by which we even recognize that it's something that we need to pay attention to, that that structure is symbolic. That is a symbolic structure. In a story, you have a beginning and moving towards a purpose, moving towards an end. In an image, you have a frame which delimits it from the rest of everything else. All those things are what bring reality together for us to be able to see that it's actually something. Something to pay attention to. And so this is really the biggest break that everybody needs to make in their thinking. Because when I talk about the structure of how something is described, I am neither. I am not saying that it didn't happen, nor sometimes am I saying that it did happen. I'm only trying to point at how the manner in which the thing is described is a symbolic structure. Many times these relate to actual events that happened in the world. Why? Because what I'm trying to show you is that the way in which reality lays itself out is necessarily symbolic. The way that you perceive things in the world is symbolic in the sense that there's too much in the world, and we have to condense that information into something that is meaningful, into something that is a pattern. Okay? And so whether it is how you will talk about your child's birthday party, whether it is whether it's about a Bible story or a, you know, or a Marvel movie, within all those stories, there is a symbolism, a pattern by which we recognize the meaning in it. Okay? Now, there are certain stories, there are certain texts which are more symbolic in the sense that they seem to condense in a more pristine manner these patterns. And they show them to us in a manner which is clear because you can imagine, let's say, the world manifesting itself through different patterns. We have all these patterns. We have seasons. We have, let's say, just in terms of time. We have seasons. We have years, we have months, we have weeks, we have days. All these are cyclical patterns that repeat themselves. Now, there's a mess. There's a little bit of messiness to these patterns. That is, the seasons aren't always the same. There are four seasons, but they don't always, always last the same length. Sometimes one season is more intense than the other, you know, but the pattern of the season, as we pull back and we look at the seasons, we can recognize, let's say, the. The pattern of seasons. In the west, we've cut it into four. There are four seasons which also relate to the solstices and the equinoxes. Of course, none of this works perfectly like a. Like like an actual clock. But we can still see within it, through the diversity, we can see the pattern. And that's how all stories, all patterns manifest themselves. There's a noisy aspect to it. There's a noisy aspect to it. But then within that noise, we are nonetheless able, and not only able, but inevitably we will see the pattern. And so there are stories which are more symbolic in the sense that they tend to show us the pattern in a stronger sense. So when, for example, I talk about how Alex Jones refers to certain conspiracies, talks about psychic vampires, talks about interdimensional beings, talks about, you know, of course he is talking about actual events. Whether or not those events are factually true, honestly, I don't know. But he's obviously talking about events in the world, but he is describing them in a manner which is extremely symbolic. Now, when it comes, for example, to the Bible, this is the biggest criticism that I've had, is that people somehow think that I don't believe that the Bible is describing events. And I will say it here, and I will say it as loud as you want to hear it. I think that everything in the Bible is describing events. The idea that ancient people were sitting around and making up stories, you know, in order to. I don't know, in order to fool other people. I don't know what. I don't think that that's just not how the world works. The Bible is describing events. And not only the Bible, but also all so many ancient stories, whether it's the Iliad, whether it's the. The, you know, the Odyssey, whether it's even. Even mythological stories are describing events that happen in the world. They're based on traditions of things that people have described as events in the world. Now, sometimes those events are not necessarily as manifest as we would want them to be, especially when it talk in mythological stories, when we're talking about gods that are not in the world, but nonetheless, they are talking about events to a certain extent. Now, when it comes to the Bible, in the Bible, it is very important that the symbolic aspect or the pattern aspect is related to an event aspect. This is very important in the story of Israel, the story of Christ. It is absolutely important that those two are related to each other. The question is, how is it that we tell the story? Now there is something which happens. I told you a little bit about how the world tends to manifest itself in a noisy manner. And so there's a pattern, but there's also a noise. There's an order to any event, but there's Also a chaotic fringe or a chaotic aspect to that event. And so when you describe the event, sometimes what happens, and I'll show you, I'll give you a few examples of that in the Bible and in Christianity itself, sometimes what happens is that the noisiness of the event tends to snap back to the pattern. We see that, for example, even in the times when an important character accumulates legends around them. Now, one of the things you can do when you see that legends have accumulated around a character is to say something like, oh, all this is legendary, all this, all this is just made up. We need to sift through that in order to see the real person, the real historical person. And you see that, for example, in the Historical Jesus Seminar and all that kind of, in my opinion, nonsense. I don't think that that's the right way to see it. When legends accumulate around a figure with the most important aspect to ask ourselves is why are there legends accumulating around that specific person? Maybe it's because that person is worth paying attention to. Maybe some of those legends that have accumulated around that person are there to show you something very specific about that person. Now, of course, sometimes the legends become extremely fantastical. An example, of course, is in the story of Alexander the Great. The legends become extremely fantastical. Now, it doesn't mean that we have to believe in the factuality of all those fantastical event factuality in the sense of, let's say, kind of historical factuality, the way we understand it today. But nonetheless, those legends still describe events to a certain extent, and it's important to understand the way that they do and also the way that some, some of those legends can point us towards the character that the story is talking about. Now, in the Bible, especially in the story of Christ, there is an importance in staying close to the figure of Christ in the way that the story's told and in the way that the church fathers have seen the traditions, how they were passed to us. There's an importance in staying close to the figure because Christ himself is seen as the ultimate, let's say, joining together of meaning and events. He is really this kind of place where everything comes together. And so in his person there is a tendency to want to stay close. But to be honest, as an orthodox Christian, I don't have a problem with looking at some of the more legendary aspects of, of the story, even legends that came later or traditions that came later, that appeared later in the church and seeing them as important ways to understand the figure of Christ and what Christ brought to the world. Now, the way in which stories tend to, let's call it compress, maybe is the best way to say it. There tends to be a symbolic compression which. Where the noisiness of reality will snap back to the pattern. So I can give you a few examples. One example, which is from the Bible itself, is there was in the time of Christ a tradition which is not in the Old Testament, but was a tradition which was seen with authority, that before the Messiah would come Elijah, that Elijah would come and manifest himself before the Messiah. Now, I'm not going to go into the actual meaning of that pattern, but you can see it as a pattern that someone perceived the pattern that before the Messiah comes Elijah. And that is the pattern of how Messiah manifests himself, how Christ manifests himself in the world. And so we can. I'll go into the meaning of that, maybe in some other video, but let's look at the fact that this is the. The pattern. And it is a pattern which was accepted by people, was accepted by the disciples, was accepted by Christ. And so then when the disciples ask Christ about this, about whether or not the Elijah will manifest himself before the Messiah, what is the answer that Christ gives? The answer that Christ gives is the Elijah did Elijah did manifest himself before the Messiah, and that Elijah was John the Baptist. And Christ even recognizes, you know, that this might be slightly difficult for people to understand how he's joining those two figures together. And so he says, if you're willing to receive it. But nonetheless, this is what Christ does. You know, Christ shows us how the pattern is manifesting itself in the world. And the pattern of Elijah coming before Christ is manifesting itself as St. John the Baptist, manifesting himself before his own incarnation or coming to announce his incarnation. Okay? And so that is a way in which, if you look at the actual, let's say, events in the world, they were somewhat messy, somewhat, you could say a bit noisy, but Christ was able to see the pattern we. Which was hidden in those events and then was able to point to it and bring out the meaning, the actual spiritual meaning that was in those events. Now, here's another version which is more related to orthodox tradition. An example of what I call symbolic compression, a manner in which things become compressed together in a way that is there to show us even more the pattern, even more, what the meaning is behind an event. So I want to show you an image of Pentecost. Now, this is an icon of Pentecost. There are some variations in the icon of Pentecost, but mostly this is the image which has been received by the church. And if you go to pretty much any orthodox church in the world that has an image of Pentecost, you will see a variation on this image. Now, if you look carefully at the image of Pentecost, you will notice that in the icon of Pentecost, there are a few things happening. First of all, if you look down in the bottom of the door, there's a figure sitting there that is holding 12 scrolls. And that figure, and he's sitting in a dark place. Now, a long time ago, when this image began to develop in the church, what used to be shown in the door, which is the door to outside of the high place, was an accumulation of different groups, different races, different peoples that were accumulated in the door. This was, of course, to show that Pentecost was the moment where everybody received the truth of Christ in a manner which was understandable to them in their own language. So to do that, we show all these people in the door. But at some point, these figures, all these figures of different people began to compress, and the compression made it into this one figure which is named Cosmos. And it is. In this case, we really do have a kind of metaphor and an allegory of cosmos. And what it does is that it's there to show you the deeper meaning of the event which happened in scripture, which is that it is not only all people, but it is all of creation, the entirety of creation, which is to be filled with the spirit of God, which is filled with the Spirit of God, you know. And so you can see the. The figure of Cosmos is holding 12 scrolls, which are the 12 teachings, let's say, of the 12 disciples that are sitting around, around in the upper room, you can see them around. But now let's look at those 12 disciples a little closer as well. If you notice on the. On the. On the right side of the icon, and you have to see the right side of the icon kind of flipped backwards. You have to imagine that empty space that you see in the middle between all the different disciples, that Christ would be sitting there. This is the empty seat which is left for Christ in that empty space. So you have to imagine that if Christ was sitting there to his right, you can see St. Peter with the gray beard, with the curly gray hair. And to his left, you can see stuff. St. Paul. Now, in the description of Pentecost in the Bible, was St. Paul at Pentecost? That is impossible. He wasn't even a Christian then. He wasn't even. He had never heard of Christ. He had never Heard of any of this. And so in terms of factuality, this is pushing, this is compressing this image. And in a manner which shows us Saint Paul there. So why would you show Saint Paul at Pentecost? Well, we show Saint Paul at Pentecost because we are trying to reveal the hidden mystery of this story, which is a mystery of the church itself. St. Peter and St. Paul, you could call the two pillars of the Church the inner pillar, the disciple, the apostle to the Jews, and the outer pillar, you could call it the apostle to the Gentiles. The those two notions of the inner and the outer are there to show you that this image is not just an event in Scripture, but is an event which is showing us the pattern of reality itself, which is showing us the left and the right of Christ, which is showing us. For people who are interested, I've written several articles about the left and the right hand of Christ. I'll put some links to that down in the description about especially St. Peter and St. Paul, how they represent different aspects of the church and of. Of Christ in the world. And so this is what we're trying to show is how Christ manifests himself in the world and is to fill up the entire cosmos. Now, is this false? This is absolutely true. This is what Christians believe. This is what Christians. This is a synthesis of what Christians believe the Holy Spirit filling the world is. And so in order to do that, there is a compression, a symbolic compression which happens, which brings St. Paul into the event, which sometimes also in some of the icons, you'll see the four evangelists in the 12 as well. And of course, we know that the evangelists, most of them were not disciples, were not part of the 12 at least. And so some of them will show the four in that to once again give us the sense of the Church itself. And this pattern is not only represented in Pentecost, but it's also represented in the Ascension, where we see, just like in the other one, we see St. Peter on one side, St. Paul on the other, both looking up towards Christ, who is the head, and with the Mother of God, with Mary in the middle, who. Who is the body. And so this image which is an event, it is an image of an event in the Bible, but it is compressed in a manner which is there to show us the hidden and the deeper meaning of the event. And so one of the problems we have when we are reading stories in the Bible is that we are so obsessed with a kind of forensic manner of describing that we forget that the purpose of describing These events is more important than just, let's say, the randomness of the. Or the noisiness of the event itself. There's a reason why those events are described in the Bible. There's a reason why the Christians hold those events as being true and as being foundational for the church. And that already is a form of symbolic compression. But as you can see in the image of Pentecost, or as you can see in the way that Christ talks about St. John the Baptist and his relation to Elijah, there are ways to cut through the noisiness of the world and describe things, show things in a manner which point to their meaning and to the way in which they participate in, let's say, the cosmic mystery or the cosmic pattern. And so now I know this is really. I know I'm pushing all of you. I know that so many of you will. Will think that I'm again saying that no, everything is relative, that no, then you can say whatever you want. That is not at all what I'm saying. These patterns are objective. These patterns are objective. And so many of them, in their actual, let's say, geometric form, are universal. And already, when you tell a story, you are ignoring a million facts. When you tell the story, you are focusing. You are taking all these disparate facts and you are bringing them together in order to tell a story. Now, there are ways in which that can happen even more. And these stories can compress in a manner which is even tighter and tighter and tighter. And when you look at the. If you look at Scripture, the more you go back in time, the more you go back towards Genesis, the more it seems like those. Those stories, in order to describe more of absolute reality, are compressing things. Compressing, compressing all the way to the creation narrative, which is one of the most dense and complete stories, text that you will ever read. Now, do I believe that even the text in Genesis, I believe that those are describing events, but they're not describing them in a way which would satisfy the modern historian. They're just not. And they don't have to. And it doesn't matter because that's not the point. We don't have those events anymore. The events are gone. All we have are the stories. And so those stories, if they don't reveal to us the mystery, if they don't reveal to us the higher truth in a manner in which we can engage with them, then those descriptions are. Are futile. They're pointless. And so I think that what we need is a shift in our thinking, a very deep shift in our thinking, which is difficult to do. But unless we do that, we're not going to. We're not going to get through this meaning crisis. We're not going to get through even the crisis in Christianity, the textual crisis, with all these silly Bibles that have, you know, a million little parentheses, and this version of this verse is not in one of these original texts, and this and that and this kind of horrible textual analysis, instead of looking at the text as something which has been given to us by the church within a tradition given to us in order for us to see those events, but see them through the lens of their pattern, through the lens of their meaning and how they are transformative of reality. So I hope this is helpful to you. And I know that even as you watch this, some of you will find this controversial, but it's important to understand it. And it's important to understand it. For all the videos that I make. You know, when I make a video about Alex Jones and his description, what I'm looking at is the manner in which the way he's speaking fits with those patterns. When I talk about a movie, I'm trying to show you the manner in which the movie is set up fits with those patterns. And when I talk about Scripture or talk about icons, I will do the same. And of course, it doesn't mean that I believe the movie happened, and it doesn't mean that I believe that Scripture didn't happen. It means that the world is full of meaning and that the world is glowing with meaning. And that's what we need to see if we want to regain our culture. Because if we want to regain our world, if we want to regain our hearts, we need to be able to see that the world is full of meaning, full of logos. And so. All right, enough ranting for today."}
{"episode_id":"SW - #055 - 2019-09-04 - Symbolism Happens","start":1559.29,"end":1615.17,"speaker":"Jonathan Pageau","text":"Thank you for listening to the Symbolic World podcast. As you know, this podcast is, for now based mostly on my YouTube videos, which I am transferring into audio format. Please go ahead and visit my YouTube channel. There are more videos there on different subjects that I'm not going to put into audio. And please share this to your friends. I know a lot of people know about the YouTube content, but not so many people know that this is also a podcast. So share it to your friends, share it on social media. And if you can, feel free to support this financially as well by going to my Patreon page, which is Peugeot Videos, strangely, you can go there and you can support it at any amount that you want a month for all the patrons. I do a monthly Q and A, live Q and A in which people can ask questions in the chat. And I try to have a more personal connection with people. The YouTube comments have become difficult to follow and to answer. I'll see you soon."}
