{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":0.32,"end":65.11,"speaker":"Jonathan Pageau","text":"Hello, everybody. I am sitting here with Syvilla King. Civila is a therapist. She has also a YouTube channel called Equality Existence. And she's really been diving into this whole problem of the meaning crisis. She's been talking about John Vervaeke, about myself. She had a discussion with Paul Vanderkly. So she's really in the midst of things. And she's also trying to connect a lot of the ideas that we're bringing up with Robert Pircig, who is the author of Zen and the Art of Motorcycle Maintenance. So a pretty famous book. I have not read it. So I'm kind of discovering that whole area with Sevilla. And so I'm really looking forward to seeing her insight and where we can get to in this whole problem of the meaning. Cris, this is Jonathan Pageau. Welcome to the symbolic world."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":75.99,"end":349.85,"speaker":"Syvilla King","text":"Well, thank you, Jonathan. I've really enjoyed your channel, as many of us did. I came through to this through Jordan Peterson. And I was watching, you know, I was watching his lectures. This is before he became famous because he just was touching on so many areas that I was interested in. And it was helping me understand certain psychological, Big psychological issues, understanding Carl Jung. And there was the meaning aspect of it. And this is sort of when I had started to really become interested in spirituality, my own spirituality, and the way my clients were using their spirituality, you know, to deal with, let's just say, mental health issues and other issues. So I began in the arts, and we may have a similar experience, because when I was in art school, some of the things you say about being in art school and being kind of bulldozed by postmodern art, that certainly happened to me. I was in art school in New York in the 80s, so that was a big deal then. And. And so I was in the arts for a long time. I was in the antiques business, art restoration business. And then I found that I needed. I just found myself drawn to psychology, and I wanted to be a therapist. So in my 40s, I switched careers. And so what was happening is, as I moved along in my new profession, one major problem I found with my clients was a lack of connection to what, let's just say Verbecki calls the real world and what Viktor Frankl calls the noetic dimension. And in Eastern philosophy and Zen, you might call it the observer. And maybe to relate to your philosophy, I think it might be a lack of a significance center, if that makes sense. And I guess so that's how I sort of characterized the meaning crisis, is people were sort of looking for Meaning in the material world. And so that, you know, so in Jordan he did this thing where he, you know, kind of switched a focus of reality onto meaning rather than things. And this was just such a profound thing for me to hear because it just seemed like he says, it just seemed to line up with something I already knew. And so then I just. That particular thing at that time, and it's not long ago that I. That I got involved in Robert Piercy. It was about the same time that I read that book. And it was just like, wow, this is it. You know, this is someone who is trying to identify as you are, you know, as you are doing the patterns of the structure of reality or the structure of reality on a metaphysical level that is. That is not materialistic. And so I became very drawn to this. And that's when you had done the metaphysics of Pepe. But the video that I really loved that you did was Symbolic versus literal Meaning in the Bible. And that really kind of made me addicted to your channel. And so I noticed with you and with. Under the umbrella, I guess, of Robert Pierce, I was very interested in Jordan at that time, so I was really focused on his work. But I kind of sort of segued into Pirsig, which is where I am now. But I noticed that with you, you have the symbolic meaning structure and your brother with his. With his book. And I know you and him, it's very related. Jordan Peterson has his maps. Rebel Wisdom is reintroducing. Ken Wilber who has his quadrants. You know, Vervaeke has the Anagogi and the connection to the real world. So it's so related. And it just seems like everyone is trying to discover meaning on this new plane, on this non materialistic plane. And like Paul said in the interview the other day, that the materialistic way of looking at the view is just about run out."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":350.01,"end":350.49,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":351.37,"end":354.17,"speaker":"Syvilla King","text":"And so that's what I'm really compelled by."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":354.49,"end":503.44,"speaker":"Jonathan Pageau","text":"Yeah, I totally. I think that that's one of the things that really attracted me to Jordan as well. This one lecture he gave early on, I think was called Reality and the Sacred or something. Something like that. Yes, that he had sent that to me because I'd heard him on the radio and then he had sent that lecture to me to say, you should watch this one. And so I was really blown away by. And I think what's amazing and what's really strong about what he's doing and what's happening now is it's not only that. It's not only that the Materialistic world is materialistic vision is running out, is that it's flipping on itself. It's kind of turning back over in order to reveal the inevitability of meaning. It's like as we reach the. As we kind of exhaust this idea of the flux around us, as we kind of notice it, as it becomes clear that the world is so full of flux and meaning of detail, that at some point the inevitability of the pattern comes back. Because we realize, no, we need a framing. We need framing. We need these frames in order to even perceive reality, in order to even engage with reality. And like you said, this notion that we perceive meaning first, we perceive purpose first, and then we can analyze it and give it a more kind of materialistic frame. But the first thing we see is purpose. And so that, to me, was really the key to help people. It's like to really. Because you have to turn this screw, this weird screw that has been tight for, I don't know, since the 50s or 6. I don't know since when. Maybe since the 19th century to kind of. You have to turn it. And then all of a sudden, you see, once it opens, then you can see it in people's eyes. You can see that they've changed their perspective. They've not. They've realized, okay, oh, that's what it. That's what it's all about. This is what we're talking about. You know, this is this notion that the inevitability of experience, inevitability of the first person, all this stuff, it's coming back. And it's not a question of subjective versus objective, which is the way it has been framed to us, you know, in. In the past, where they're saying this idea that personal experience is subjective. And then there's this whole objective world. Like, no, no, no, no, no. The objective world needs a personal frame. But that personal frame is not relative to each person. It's an objective structure that all of humans, you know, have in their. You know, in their psyche or in their being."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":503.44,"end":505.44,"speaker":"Syvilla King","text":"So the structure of consciousness."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":505.52,"end":512,"speaker":"Jonathan Pageau","text":"Yeah, the structure of, say. And then the structure of consciousness becomes actually the pattern by which the world exists."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":512.16,"end":512.64,"speaker":"Syvilla King","text":"Yes."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":512.88,"end":540.59,"speaker":"Jonathan Pageau","text":"And that opens up so much in terms of understanding the story in Genesis, in terms of why it's language, why it's consciousness, why it's. It's, you know, the. The knowledge of good and evil. Why it's all these words that are related to what we would call today consciousness. Those are the words by which we talk about creation itself. Because it's analogous to how we experience and encounter the world. So, yeah, to me, it's like this whole rediscovery is so fascinating."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":540.67,"end":554.11,"speaker":"Syvilla King","text":"It's fascinating. And isn't it fascinating how these maps, you know, like yours and Jordan's line up and then there's these other maps that line up with that as well? So what you're saying about the structure of consciousness, it's got to be true because it's showing up everywhere."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":554.47,"end":581.11,"speaker":"Jonathan Pageau","text":"Yeah. And so. Yeah, so it's an exciting time. And I think that discussion with John that's kind of going on, and we're probably going to do some. Actually do some events with him. And then Paul, and then I'm seeing you pop in. And so I'm hoping there's other people like Benjamin Boyce and all these other people on the. That are turning around this whole question. And so it's exciting because it's like a weird virtual community, I guess."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":581.68,"end":582.08,"speaker":"Syvilla King","text":"Mm."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":582.4,"end":583.28,"speaker":"Jonathan Pageau","text":"Something like that."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":584.24,"end":628.66,"speaker":"Syvilla King","text":"And I guess it has to be because this is where we are. And, you know, and this is. I mean, this. This digital Internet thing, it's not going away. We have to. We have to integrate it in the best, in the highest quality way as possible. And that's. I mean, I'd like to talk, you know, at one point in this discussion about how one thing I think is amazing that. That what you're doing is taking this ancient way of seeing things, this eternal way of seeing things, and integrating the new into it. And there's no other way to do it, because this is reality. You know, that. That you. That within your framework, there's a place for technology and there's a place for science because they are part of reality."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":629.7,"end":689.61,"speaker":"Jonathan Pageau","text":"Yeah. The idea is to not just be a reactionary and resist to be a Luddite or all that, all that kind of stuff that you see. But rather, if this is the pattern of reality, then all we're going through has to also somehow fit in that pattern. And even the stuff that is hostile, let's say, to the more traditional worldview, all of that that's trying to eat at it, it's also part of the bigger pattern. And we can see by looking at the stories that we've already talked about this, we already discussed the problem of. Of how a worldview breaks apart, what that looks like, what happens when it. When that. And how does it come back? How does it resurrect or how does it come back to life? So, you know, to me, that's. That's the best way of doing It. That's why I always try, remember, like, the right hand and the left hand and to understand those two sides that you can't. If you emphasize one side too much, you're, You're. You're in deep trouble. That's one of the things I liked about Jordan Peterson right from the start."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":689.69,"end":690.13,"speaker":"Syvilla King","text":"Yes."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":690.13,"end":716.23,"speaker":"Jonathan Pageau","text":"That I felt that his structure encompassed a lot. It encompassed a very large field. And so you could look at two sides and be able to explain why those two sides exist, and you could criticize one side and criticize the other, and you can also see the positive sides of one side and the other. So you're not becoming polemical in the same way that we're seeing the politics today."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":716.63,"end":950.77,"speaker":"Syvilla King","text":"Exactly. So it's interesting because I've looked at so much of your content, but a lot, ironically, a lot of what you and Paul. You know, there are things that you and Paul discussed the other day that actually rose to the surface as points that I could connect with piercing probably as well as anything. And let me. I want to just, you know, I had gone through the Meta, like an introduction to metaphysics of quality in that second video I did. So I don't want to go into it too much because it's there. But the metaphysics of quality is a philosophy that reintroduces value as the element. You know, like in subject to object and scientific and materialistic. There's no room for value, you know, in the. In the actual rational framework. What you say is, no, there is, because it's ensconced in this greater value. And I think. And that's very similar to what Pirsig would say. He would say that the metaphysics of quality is value creating the universe. And I want to just briefly mention one thing about his philosophy that I think that. That I think makes it a little bit more apparent. So when Phaedrus is the character in the Art of Motorcycle Maintenance and what he is, he's the original Pirsig, before Pirsig had electroshock therapy for what was diagnosed as schizophrenia. And Pircik is really brilliant. So he's off in this direction to trying to unite, trying to do a lot of what we're talking about here. He's identified that there's classic quality, which is the more rational, the mechanical, the rational, and then there's romantic, which is aesthetics. And so as he's trying to. He realizes that if you're just looking at things in these polar opposites, like you were saying, polarization, you're not going to get the full picture. You can explain most of the world with the subject object way of looking at things, but you're not going to explain these ephemeral qualities that you have in romantic quality. So he makes a really big breakthrough when he discovers the mathematician Poincare. And Poincare is where looking, like we said, now there's all these facts and now we have even more because the Internet introduces just an explosion of facts and these facts will present themselves and you don't know which ones are right. So say you're working on something and you care about this project, but you don't know what the next step is. And you can't just observe everything objectively and figure it out. You have to care, you have to have this essential state of wanting it to be better. And so Poincare found that when he's working on a mathematical problem, the right there is a. There's what you would say a quality detector. In this is his theory in pre intellectual awareness, you know, before conscious, like, like consciousness, but unconscious. And in that pre intellectual awareness, that's where, that's where quality makes itself known to you. You don't actually have a will, you can't. I mean. Yeah, well, let me go into it in a second, but in there the next quality step kind of, kind of presents itself and then that comes into awareness."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":950.85,"end":959.09,"speaker":"Jonathan Pageau","text":"Yeah, so it's a form of intuition. I mean, it's, it's this, it's just this like. It's the click, the aha. You know, it's the click."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":959.17,"end":1130.47,"speaker":"Syvilla King","text":"It's the aha. Yes, but, but, but even more than that, it's like an essential quality is an eternal thing that comes up to you. You know, it's, it's always present and it comes up to you in that subliminal state and then you'll detect the right facts there. If you are caring about it, if that's what you want, you know, you can't just like sit back and wait for it. And so there's a quote here. The difference between a good mechanic and a bad one, like the difference between a good mathematician and a bad one, is precisely the ability to select the good facts from the bad ones on the basis of quality. He has to care. This is an ability about which formal, traditional, scientific method has nothing to say. It has, you know, it has no, no room for value. Yeah, so, so the last part, and this I think is the most important is there's a metaphor in Zen, in the art of motorcycle maintenance of the train. So there's a train that that is known as knowledge and that, and, and the train is classical knowledge. It's, it's rational knowledge that's represented by the engine and the boxcars and everything that's in the box cars. The sum total of human experience plus your own understanding of that, everything you've learned so far, your innate biological traits, you're not going to see romantic knowledge. So if you look at the train, you're not going to see the romantic part. So this is materialism. But romantic knowledge is the leading edge of the train. And that's what's going to keep the train going. And it's going to keep the train going on the track of quality. And without this ephemeral thing that can't be measured by science, you know, nothing's going to work. So this is the stimulus. Quality is the stimulus. And what is valuable propels the train forward. So the romantic quality is the leading edge of experience that keeps the train on track. The boxcars are the collective memory of where the train has been. And the leading edge tells us where to go. So, and that leading edge is right in the moment. So the structure of the future is selected pre intellectually. And you could say that pre intellectual selection is kind of like what you were saying about God's will, because value is the predecessor of structure, not the other way around. And the manner, and this is what you said, the manner in which the infinite encounters the particular. So that's that pre intellectual awareness encountering the next thing. And that thing will specify into what's needed. And like you said, it's going to look like it's our will, but it's really this quality showing us what it is."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":1132.47,"end":1226.68,"speaker":"Jonathan Pageau","text":"What's interesting is that I guess I'm interested in the, or curious about the fact that he uses the word romantic in what I noticed to be kind of the romantic sense of this kind of sentimental ebb and flow. All of that is that would, I would put that below the thought rational. So you have, I mean this is like traditional Christian, you know, ontology. So you have the noose, which is, which is above. Then you have the thoughts, the will. All of this kind of the thing that we consider consciousness would be below that. And then below that you would have the desiring quality and the irascible quality. So that all the emotions, all the, all the pulls, all of that would be kind of this bubbling, this bubbling thing underneath, you know, so, so in a way there's the unconscious. In normal psychology, it was almost like the unconscious would be this below thing, but Then you have supra kind of supra consciousness, which is not. We don't see or framed a lot in modern. Modern way of thinking. It's not. It's not the same as the unconscious in the sense of these secret desires and all these secret pulls that you have. But it's actually something above which is this kind of intuitive grasp you can have. I don't know if Percy talks about this difference or for him, it's the same like, let's say the romantic part of the wispy kind of connection to that aspect to the belly, to all that stuff is different from the top part, let's say. I don't know if that makes sense, but I'm trying to."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":1226.68,"end":1319.56,"speaker":"Syvilla King","text":"No, it does make sense. But what he does is he changes the terminology in the second book, okay. So he changes it from romantic quality to dynamic quality. And he changes classical quality to static patterns, okay. So it's this dynamic quality which is in the pre intellectual. And that like the train metaphor, he uses classic and romantic. So I used it there. But in Lila, he changes it to, you know, the second book where he really, you know, codifies the theory. He changes it to this dynamic quality. And that's what was going to be det. In the pre intellectual net. Dynamic quality. You're in the static patterns, you know, and the static patterns in the metaphysics of quality very much are like in your brother's book, this here with the inorganic on the bottom. And then it's biological, then it's social, and then it's intellectual. So it's similar to that. I mean, not exactly the same, but it's a very similar hierarchical structure. And so these patterns, and they can be of any of the four, the dynamic quality acts on these to transform them. And so it's not romantic in that sense. It's dynamic in the sense that you have things that are stable. And this is the transformative agent, let's just say."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":1321.08,"end":1344.37,"speaker":"Jonathan Pageau","text":"Interesting. Yeah, I mean, it's interesting. I guess I should probably at some point actually just read the. Read the book. I was, you know, I have a secret. I have a secret thing which is my. It's not a secret. I guess people probably have figured it out by now, which is a certain. A certain aversion to this kind of California Buddhism, I call it."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":1344.37,"end":1347.61,"speaker":"Syvilla King","text":"Yeah. And I share your version because the."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":1347.61,"end":1399.54,"speaker":"Jonathan Pageau","text":"Name of the book was called Zen and the Art of Motorcycle Mania. It just turned me off right away because. Just one more book on that. And so I feel bad because it's obviously not an acceptable way to judge a book and to judge a philosophy just by its title. And because I have this. This weird thing about people using Buddhism as a deconstructive agent, actually, you know, like they're using the foreign. Something outside of their own tradition and culture to wreck their own thing. You know, it's a normal move. You know, it was there. The Romans did the same. You know, the young people would dress as barbarians as the barbarians were at the gate, you know, coming in. So it's like you use something the outside to kind of to demolish your thing. So hopefully, so hopefully I can get over that little thing. Read the book."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":1400.1,"end":1403.54,"speaker":"Syvilla King","text":"Well, I think actually a lot of people didn't read it for that reason."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":1403.78,"end":1404.5,"speaker":"Jonathan Pageau","text":"Oh, really?"}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":1406.18,"end":1458.68,"speaker":"Syvilla King","text":"And as you know, in the 70s, as people read it, they realized, wow, this isn't about Zen at all. I mean, it is, you know, but it's not what they thought it would be. It's really going back into Western philosophy and figuring out where the problem was and kind of revivifying, taking that and using that to revivify a new philosophy for the new age, which I think is similar to, you know, John Verveckis going back and to the ancient Greeks and looking for. And other philosophers and looking for a direction there. And. And it seems to me that Eastern Orthodoxy is bringing back an old practice into the modern age. So there's a similarity there, I think."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":1458.92,"end":1548.48,"speaker":"Jonathan Pageau","text":"Yeah, well, for sure. It's funny because what I'm saying has absolutely nothing to do with actual Buddhism. Like, if I read Zen texts, I get a lot from them and I've read some, really. If I read a series of koans, for example, I find them extremely powerful. And I think it's obvious that it's inevitable to notice the resemblance between mindfulness and remembrance of God or remembrance of sin that you find in the Hesychastic practice. It's very similar. So obviously there are inevitable to see the resemblances. So, yeah, so like I said, a lot of it. A lot of my. A lot of my reaction might not be as profound as I know. It's more just a. It's almost like a social problem that I see rather than an actual philosophical problem. So how do you see, let's say, so in terms of. Because I've seen you're doing a lot of stuff on Persig and then you're kind of looking, watching John's lectures, following Paul and myself. And so what's your. How do you see these things kind of coming together? How do you see them connecting in the different way, because you have your own very particular perception about John's work and my work and all that. So maybe you can talk a little bit about that for people who also, even for people who haven't watched the video that you put out, by the way, there are two videos that you did trying to connect some of these ideas together. I'll probably put them in the description for those who want to get a little bit more of that."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":1550.24,"end":1646.05,"speaker":"Syvilla King","text":"Well, I think that my goal in all of this is to actually be able to practice it in the world, you know, not. Not just as a therapist, but my own personal, personal journey. Because I think we really, as you're saying, as we come to the end of this cycle, as everything's kind of falling apart, as everything is so superficial, fragmented, what are we going to do to read here? That. And I think that all of us, you know, you. All of us here in this corner are trying to do that, are trying to figure out a way, a philosophical way of being in the world that can manage what's going on, that can manage all this fragmentation. And I think fragmentation is a beautiful way of putting it. And so you. So John is looking at a variety of practices, and you and Paul already have established Christian practices which, you know, work beautifully. And I think that for me, it's sort of to follow you and to understand what you're doing sort of gives me ideas of what is the next direction, and is the next direction going to be something secular, or is it going to be something where I do, in fact, turn around and start believing in God? And I know, I don't mean to put that as superficially as it sounds, because the problem with this."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":1646.05,"end":1647.45,"speaker":"Jonathan Pageau","text":"Turning around is the right word."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":1647.77,"end":1676.66,"speaker":"Syvilla King","text":"It's turning around because the problem with this is. I don't know, and I don't know how you feel about this. I don't know if you can sort of fake it till you make it. I don't know what happens in those terms because it seems to me that I have this innate sense that unless I truly feel it with the entirety of my being, unless a person feels it with the entirety of their being, it's somehow counterfeit."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":1677.7,"end":1751.1,"speaker":"Jonathan Pageau","text":"Well, I understand what you're saying. I think that if you. One of the. This is. I guess one of the problems with Christianity in general is that you also don't want to confuse the beginning of the road and the end of the road, right? If you could completely inhabit it with your entire being, then you would already be a saint. And so then you'd be fine. So I think that we have to be careful not to look, to be. To find illumination before we just actually enter onto the path of, you know, up at the bottom of the mountain also. But at the same time, you don't also want to pretend in the sense you don't want to lie to yourself, which would not be. Not be appropriate. But there, you know, I think that you might not need as much as you think to kind of start the journey. And so what is your. In terms of the notion of maybe. What is your. A little. Tell me a little bit of your story. Do you. Did you have a religious upbringing or did you grow up in a secular. Like, do you grow up secular or did you kind of move away from a religious upbringing at some point?"}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":1751.42,"end":1788.46,"speaker":"Syvilla King","text":"Well, my parents were Episcopalian, and we had lived. We had lived overseas during, you know, there's a lot of transition in the late 60s, early 70s. And that's when we had gone on a long tour. And my parents were rather. They liked the traditional aspects of being Episcopalian, the Episcopal Church. When we came back, they said that they were really kind of jarred by how liberal it had become. You know, the macrame and macrame. Did you frame it that way?"}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":1788.46,"end":1789.22,"speaker":"Jonathan Pageau","text":"Is hilarious."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":1790.98,"end":1858.55,"speaker":"Syvilla King","text":"And so I think that they kind of. They kind of pulled back from that. And so I've started going back to the Episcopal Church. And it's interesting, the last. So I sort of became interested about maybe 10 years ago. I started saying, you know, there's something in this for me, maybe a little longer than that. And so I've recently, I've been going back on and off, and I've gone to the Catholic Church a little bit. But, but, but it's interesting. The last time I went, I had. I was so full of your content in my head, because I was preparing for this interview, that it took on a different dimension to see it symbolically, you know, to see. To see that these, that these are. These. The words were the way things were phrased for these eternal representations. And then I talked to a friend of mine who said, well, you know, it's just the same thing every week. And I said, yes, exactly."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":1860.71,"end":1879.23,"speaker":"Jonathan Pageau","text":"Yes, exactly. And so then what. How. I mean, what is your. In terms of God? What is your. Where are you? Like what. What is your. What is holding you back or what is pushing forward? What is. What is the issue, let's say."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":1879.71,"end":2026.19,"speaker":"Syvilla King","text":"Well, I'm very compelled, obviously, by Pirsik's work. And I guess I should talk for a second about the Split, you know, where Phaedrus, the protagonist, finds the problem, and where he finds the problem is back in Plato, where Plato separates reason from emotion. And before that, you know, the pre Socratics, the highest value was the good, was arete, was excellence, was quality. And this is such a high thing. And so Phaedra says, this is what we have to go back to. We've had, you know, 2400 years of rationality, which we needed because. Because we had to figure out how to manage nature so we don't die, you know, basically. And now we've exhausted the utilities that we know how to do all this stuff. And now we're kind of empty, you know, the meaning crisis. And so that arete, that excellence, that quality is. You could say that that's the bottom in itself in Pirsig's work, or you could say that that's informed by God. You know, you could say underneath that, on another level is God, who gives us this quality, who gives us the stimulus towards the better, who is allowing us to embody on earth His. His will, let's just say. And his will is toward the good, it's toward the better. It's always. It's always improving, it's always progressing ultimately in the sum total of things. Of course, they're ends of the cycle, like now, but even now, you could say that like, like, like you said at the beginning of this, that this is an exciting time because amidst all this chaos is the possibility for resurgence, which is a totally new metaphysics. So I think. So I think that's a roundabout way of saying that in the center, the center of what I'm looking at, is it this arete, Is it this quality? Is that enough? Or do I believe that this quality is informed by God? So it sounds simple to say, but when I'm actually struggling with it, it's really hard."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":2030.16,"end":2300.16,"speaker":"Jonathan Pageau","text":"Yeah, I mean, I guess I can understand that. I think that the idea of the importance of God is also to bring. Let's say you have something like quality and quantity, for example. Like, we can use your terminology. You know, you have the essences, and then you have potentiality. You can say it that way, you can have quality and quantity. Um, but you need. You need a way for those two things to kind of. I mean, I could say you could say it like that God is the manner in which you understand that those two resolve into one, that they don't. That there isn't this. This eternal opposite, you know, and that's. That's one of the problems that Christianity is trying to always deal with problem of the eternal opposite. You know, that you see in Gnosticism or you see in a lot of the ancient religions that in fact reality is, reality actually has a common oneness out of which the quality and quantity come together. And that's why, that's also why there's this resurrection. Because without, without, without the non duality, you don't have it, you can't. How can you understand resurrection? Because you have that quality and quantity that start to pull apart and then they, that you know, it's things start to fragment and the ideas go up into heaven or whatever, you know, they, they, they, they disincarnate you could say. And then things start to break apart and. But then how does it, what's that, what's the, what's the thing that, that the mystery that brings things back, you know, and that's the mystery of the, of non duality. And so Christianity, people don't realize that Christianity is a non dual religion. It is a non dual religion. God is non dual. It's not. There is no duality between God and the, and the world. God informs all of all of all of the world that God is hidden in manifestation. We don't, you know, we don't confuse God and manifestation. We don't say, we're not pantheists, you know, we don't say everything is God, but we do believe that, that ultimately everything is in God is a way to say it, something like that. And so that to me that's the, that's why. And I guess you know, there are non dual religions that don't, that won't tend to personify or to see the person or to see the infinite in personal ways. You could say something like that or that will say. When people talk about impersonal, the idea that the absolute is impersonal. I mean you see that in Buddhism as well. But I think that that's problematic in the sense that we talked about, that you mentioned before, that I talked about with Paul, which is that there is a way in which God is impersonal and super personal or something like that. But God will always encounter us personally. That the place where the infinite and the particular meet, the place within is going to be analogous to what we understand as personal. And so that's why we also encounter God as God is personal also like because we are personal and we are the, we are the meaning makers. We are, you know, we are the meaning those who encounter meaning. We are persons. And so there's that you Know, all of that has to be part of the, of the infinite somehow. And so that's the image, you know, you can't use another image of God besides that. Always understanding that God is beyond all those images. You always have to. When we talk about God, we say Father. When we talk about God, we say son. You know, when we talk, you know, there's no other way to talk about these, these, these realities which are ultimately beyond all name and all word. I don't know if that, I don't know if that makes sense in the term. In the sense that if you, if you want to go to, let's say, if you want to stop equality, you're going to have that problem, which is how then how do you deal with the opposition that you've set up? I don't know. I don't know. How does he deal with it?"}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":2300.16,"end":2391.83,"speaker":"Syvilla King","text":"Well, he deals with it. It's again, this dynamic quality which unites the two opposites. Because let me give an analogy of how it actually plays out in the book. So you have a problem, let's say it's something with the motorcycle. And so you see the problem, but it's not, it's not the non dual, you know, is the quality and the item. And your relationship with the item has to change, has to update constantly. So you're. So quality is helping you do that so you can actually fix the thing. And that means that it's not just an objective piece of metal. It becomes, you become involved with it. There's a communion between you and the motorcycle. And I guess Vervecki might call this the flow state. It's where you are in communion with the physical world and you're improving it and you're informed by this desire, let's say, God's will for the good. I do think that there's something. Maybe the dynamic quality is a symbolic representation of God or Christ. I have also difficulty understanding in your philosophy, what exactly is the difference between. Sounds so silly and I'm sorry to ask this question, but what is the difference in your philosophy between God and Christ?"}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":2393.03,"end":2657.71,"speaker":"Jonathan Pageau","text":"Yeah, obviously the idea is that this is the creed, this is really the Christian way of understanding. And so there is something which is. There is the uncreated. You could say the that which is without origin, that which is before all and beyond all. Right. And so that's God. And we say Father, right? Because Father, is that origin. Now Christ or the Logos, the thing that makes Christianity so specific is that what we say is that. So this thing, it's not a Thing, obviously these are all words. That which transcends all, which is the absolute or the infinite. It, it manifests itself. It has a, an expression. That expression is, is the, the, the names of the. Is that which just creates the world. And so the difference between Christianity and a lot of other kind of Neoplatonic religions that came about in the around that the same time as Christianity is that the expression of the infinite is one with the infinite. That is the Logos is fully divine. It's not a lower state of being. It's not lower in the hierarchy. And so what that does is, it does is it eliminates the problem of the notion that as that the hierarchy of being is necessarily. It's a moral hierarchy. Because you see that in a lot of Gnosticism and a lot of the ideas or in a social hierarchy, which is that the idea that the king is somehow good and the peasant is bad because he's lower on that hierarchy. Whereas what Christianity does is that it, because the divine Logos is fully God isn't like one step lower. That means that the expression, the expression of the infinite fills the whole of everything and is. And so everything parted, everything ultimately can participate in the life of God because there isn't that moral hierarchy of being, although there is a. There are hierarchies of being, but God fills all of them. And so that's the idea. So there is no difference between the Logos and the Father. There's a difference in the sense that there are two. One is the absolute infinite, one is the expression of the infinite. And they're different in the sense that they're not, but they're also of the same nature. That's how we. This word they use, they're fully uncreated. They're both are uncreated. So that's kind of the way to understand it. Then when you understand Christ as the person Jesus Christ in history, obviously there's a specification, but the notion is that that's part of the process of the filling. And so you could say something like that Jesus Christ is the fullest of that feeling. And so Jesus Christ gives us the full image of the way that the world is in God and the full reality of how the world is in God. And so that's kind of how we see, that's how Christians would kind of present it. And so when you look at the story of Christ, you see in his story, and it has to be a story because it's so weird. The non. Duality part is so difficult to express in terms of categories that you have to see it in the story of a person, this incarnate person, so that you can see the strangeness of something like the crucifixion into that mystery is extremely difficult because I keep saying it because it fills the whole world. It's both the highest and the lowest at the same time. On the cross, Christ is the king and the scapegoat at the same time filling that whole thing. So that's the way that Christians would present it. I don't know if that makes sense."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":2657.71,"end":2807.79,"speaker":"Syvilla King","text":"To you a little bit. No, it does make sense and I think what I'm thinking at this moment is that I think Pirsig's, you know, the metaphysics of quality kind of, it's parallel to this because it describes the process, this process of incarnation, let's say, because. Because dynamic quality creates the universe and it's within everything. So, so quality is, is. And it's not just people with a pre intellectual awareness. This creation, this create, creative process is all the way down to the, you know, the smallest quark. You can could say that everything is directed towards the good. And one way to characterize the good in the metaphysical quality is towards freedom, towards more agency, towards more space. So as you go up the hierarchy to the intellectual, you are closer to the good, which is similar to God in the sense that it's more limitless. So there is a moral element in the metaphysical quality in the sense that intellectual is higher than organic, in the sense that if there comes a time where you have to sacrifice one for the other, you would sacrifice the lower. Because in the higher is where the progress is, is where the direction towards God is. The intellect, let's say in this. But at the same time everything works together. So in another way one isn't better than the other. They all need each other. You know, the inorganic supports the biological, which supports. And the intellect comes down and informs how we see these things. So there's a dynamic going on in that regard too. So there's some similarity there except for the fact that except for this moral progression which intellect is at the top. So. But I think the process itself to me sounds very similar. And when Pirsig discovered this he felt like it was a trinity. He felt like this dynamic quality is what united the static, which united the static and I mean the classic and the romantic, which put together subjects and objects which made subject as an object able to be in communion with each other rather than separate."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":2807.95,"end":2831.52,"speaker":"Jonathan Pageau","text":"Right, right, interesting. And so did he ever like, did Pirsig ever talk about. Because I imagine he's a Westerner, so he probably has some contact with Christianity. Like did he try to formulate his ideas in relation to Christianity or was he always kind of in the. I guess he was in. It was in the 60s and 70s. So that might have not been the best thing to do, do for him at the time."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":2832.4,"end":2983.29,"speaker":"Syvilla King","text":"Well, I don't. He wasn't. I don't think he was a Christian per se. I think he was more his. His love was Western philosophy. So he was very much, you know, for, for a long time he thought that rationality and reason was all there was. In fact, the last chapter I just did in the reading of the book is where he. He is so married to the idea of reason and truth being the ultimate that he's defending it fanatically. And in the wings is something telling him, no, this isn't the ultimate. And what he does at one point he does where he falls apart. And a couple of times he falls apart one very much so when he discovers that this split in Greek philosophy, that they valued truth over, over quality, that really, that is where his madness begins. But before that he goes to India and studies for a couple of years and tries to integrate Eastern philosophy and has a really hard time doing it because he can't get out of the Western rational mind. So a lot of what he was trying to do is have a totality that can, you know, metaphysics that can, that can be used in any situation, in any culture. And it's more profound than that. But I don't know how to describe it differently. That was the key, you know, the infusion of the Eastern philosophy was key to overcoming the non. Duality. But it's not one or the other, it's a unification of both. And I don't have the. Oh, here it is. He discovered this very difficult book by FSC Northrop called the Meeting of the east and the west, where this guy was trying to do the same thing. And this guy said, well, no, everything in the universe is on a continuum. Like we begin, you know, with a big bang and it goes all the way to where we are now. And so Pirsig used that continuum and with quality he said again, everything is. Quality is in everything and quality creates everything, if that makes sense."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":2984.25,"end":3026.49,"speaker":"Jonathan Pageau","text":"I do think that. I do believe that the word quality doesn't bother me so much either. Because has something similar to what the. Because it implies the. In a certain way, it implies the essence of something, but it also implies the goodness of it. Just essence in the sense of A concept. Sometimes you might think that essence is just the concept of something or the name, you know, just the name in a neutral way. But rather that quality also includes the idea of a kind of ultimate purpose or a, you know, a. Yeah, something which is. Which is more related to the good, not just in a moral sense, but kind of a bigger sense."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":3026.49,"end":3028.49,"speaker":"Syvilla King","text":"Yeah, even in a pragmatic sense."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":3028.57,"end":3042.33,"speaker":"Jonathan Pageau","text":"Yeah, exactly. No, you're right. In the sense that that's what you. Like you said, like fixing a motorcycle is not a moral question. Yeah, but there is a goodness. There is something which makes it better than. Better than what it was before."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":3042.33,"end":3083.68,"speaker":"Syvilla King","text":"Exactly. And so everything in the universe is being informed by this notion of the better. And there's interesting. If Jordan Peterson used this neuroscientist to explain this, his map of the going towards the better. Jaak Panksep, who has the seeking system that you certainly see in anything biological and certainly in human beings, that you're all always looking for what is going to solve the problem, looking for the better. So even in that, you see the same. The same pattern of directedness towards the good."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":3083.84,"end":3159.37,"speaker":"Jonathan Pageau","text":"Yeah, but there's something for sure in the modern world, let's say, that has. I don't know if he deals with this at all, because it's funny that he would choose something like motorcycle repair, because there is something which has diverted, in my perception, this, of the good into the material world. Like we have turned it completely towards the material world, which means that we understand the better and the good only in terms of technical innovation, in terms of making our life easier, you know, with technical supplements, where in a Platonic sense, the good would not. Would not be understood exactly in that way, but rather an existential way. I think John Vervecki is a good way to talk about these different modalities of being. You know, the modality. We talked about the modality of having and versus the modality of being. And those two, we've actually confused them today where we think that, you know, the good is only in making things better. And you hear people talk about it so inevitably, as if it's so inevitable, you know, how great our world is because we have nice. We have greater things, greater technology, you know, forgetting this whole other aspect of the good, which is transformation of the."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":3159.37,"end":3162.69,"speaker":"Syvilla King","text":"Person and which is why we have the meeting crisis."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":3163.01,"end":3188.85,"speaker":"Jonathan Pageau","text":"Exactly. Yeah. And I think John frames that very, very well, you know, in a way that is understandable to most people, because everybody feels it today. We feel that pull because on the one hand, we do want more stuff and on the other hand, we also know that that stuff is not going to. It's just not going to do what we're. It's weird because we're deluding ourselves. Some people are completely deluding themselves."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":3188.93,"end":3189.65,"speaker":"Syvilla King","text":"I think so."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":3190.21,"end":3204.28,"speaker":"Jonathan Pageau","text":"Completely unaware. But I think most of us are somewhat unaware that although I am, let's say I am still, I am going to buy this new gadget. I also know that it's not going to. It's not going to give me what I. It's not going to solve my problem."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":3206.52,"end":3208.44,"speaker":"Syvilla King","text":"The moment you buy it. And then that's it."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":3208.44,"end":3215.88,"speaker":"Jonathan Pageau","text":"That's it. It's probably going to make my problem worse. Especially the whole cell phone. You know, I've avoided having a cell phone for 10 years now."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":3216.28,"end":3217.32,"speaker":"Syvilla King","text":"Oh, good for you."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":3218.36,"end":3227.4,"speaker":"Jonathan Pageau","text":"But now I got a cell phone. I know. Like, it's just too complicated. You know, people can't reach me and I'm traveling and so I finally got a cell phone and I'm like, this is this thing."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":3227.4,"end":3228.1,"speaker":"Syvilla King","text":"It's going to be."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":3229.53,"end":3230.33,"speaker":"Jonathan Pageau","text":"It's going to kill me."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":3232.17,"end":3248.25,"speaker":"Syvilla King","text":"And like Jonathan Vervecki says, you know, it's so salient. It takes those things that we. It takes the same mechanism that we actually use for, you know, meaning and puts it there."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":3248.33,"end":3304.97,"speaker":"Jonathan Pageau","text":"Oh, yeah. And not just that, but the actual symbolism is so powerful because, you know, people don't realize. Because I was. For a while, I was wondering, why is it when they see people on television that they. That they all of a sudden those people become special, you know, And. And I realize it's. It's. It's not just this, but one very simple aspect is the very fact that screens actually emit light, that you're looking at a person emitting light to you that is a glowing. It's glowing. That person is glowing. It's not at all the same as looking at a person in the world where they're reflecting light. Now if you look at a screen on your telephone, it's actually emitting light to you. I mean, can you imagine just. It's like. Can you imagine just how strong. Just very deep, deep. Your deep, deep. How strong it is that you could. That you could be looking at this. These machines that are emitting your meaning to you in light."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":3305.29,"end":3307.13,"speaker":"Syvilla King","text":"Yes. Which is meaning to us."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":3307.45,"end":3308.89,"speaker":"Jonathan Pageau","text":"Beat that. It's like it's going."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":3308.89,"end":3313.68,"speaker":"Syvilla King","text":"You can't beat that. That is so. That's amazing. That's brilliant. That's brilliant."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":3316.56,"end":3359.29,"speaker":"Jonathan Pageau","text":"It's funny because, you know, and the YouTube thing has done this strange thing where everybody now can do that. And even on YouTube where it's. There's no meth, there's no mechanism of legitimacy, you know, there's no clear method of legitimacy. People can still go on YouTube, make videos, and then people see you as a. As a celebrity. I meet people and they're like, oh, I feel like I'm meeting a celebrity. I'm like, well, just because. And I know that's what it is. The fact that you're looking at me on my face on the screen and my face is emitting light to you. And so it's like. It makes you feel like this strange encounter, you know?"}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":3362.53,"end":3363.33,"speaker":"Syvilla King","text":"That is so true."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":3363.49,"end":3365.09,"speaker":"Jonathan Pageau","text":"Very subversive, that's for sure."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":3366.05,"end":3367.17,"speaker":"Syvilla King","text":"Subversive, yes."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":3368.77,"end":3395.62,"speaker":"Jonathan Pageau","text":"Anyways, I don't know. Just an insight that I've had and I mean, I've had that brilliant insight. Yeah. But I've had that strange experience where, you know, even someone that. Let's have you. We're talking like this on the screen, then one day I'll meet you, or maybe I'll meet you, and it'll be a strange moment. It'll be a strange moment when I meet you or if I. When I remember meeting, like, Benjamin Boyce or people like that, when I meet them in the. In the world. It's like this weird moment."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":3395.7,"end":3396.22,"speaker":"Syvilla King","text":"Yeah."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":3396.22,"end":3406.98,"speaker":"Jonathan Pageau","text":"Where all of a sudden this person is different, has a. It's kind of embodied, you know, And I realized just how. How strong the screen is, just how powerful it is."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":3407.3,"end":3412.26,"speaker":"Syvilla King","text":"Well, that was my. Certainly my experience when I went and saw Jordan Peterson and did the meet and greet after."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":3412.42,"end":3413.7,"speaker":"Jonathan Pageau","text":"Oh, you did do the meet and greet?"}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":3413.7,"end":3413.98,"speaker":"Syvilla King","text":"Yeah."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":3416.85,"end":3432.37,"speaker":"Jonathan Pageau","text":"Why did I turn on the radio at first? And so it was a little different. The radio is not the same because sound is the same. You know, you have the same experience of sound. Someone on the radio, but the screen. Yeah, the screen. I don't know how we ended up talking about this."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":3434.13,"end":3435.81,"speaker":"Syvilla King","text":"It's all part of the conversation."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":3435.89,"end":3450.04,"speaker":"Jonathan Pageau","text":"That's right. So what would you say is your next step in terms of. Because I know you're doing the series on Percy. People can check it out on your challenge on your channel. But what are the next. What do you see as the next steps for you in terms of. Of exploring these questions?"}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":3450.68,"end":3566.28,"speaker":"Syvilla King","text":"Well, ongoing. It's trying to figure out how to use this, you know, and the reason I call it a quality existence is because that's what I'm looking for. I'm looking for how to have a meaningful, the best possible life for myself, for my clients, for the people I love. You Know in the most genuine way. And going through dialogues like this, going through, you know, muddling through it, which is what I'm doing. I am by no means an expert on Piercy, but, but just being, you know, being, doing it in a community like this is really helping. I've had so much good help from viewers who know a lot more about it than me. And, and so it's just progressing with that, progressing with understanding, looking at ways to implement in the world. And I want to. This is a good segue because yesterday when I was. Or the other day when you did the, when you did the dialogue with Paul Vanderklee, there were some things that came up for me that I think are so useful for what I'm doing and they don't necessarily actually relate to, to piercing per se. This is, this is more, this is more what you're doing. Although again, I see I'm relating all these together. Sacramentality. I just really, I really am drawn to that idea because what you were saying is that if you are oriented in the world towards the good and you apply this towards other people, this will deepen your experience of other people. Whereas you can just be in the superficial subject, object, negative, or you can engage, you know, with people, I guess in communion. Would you say. Is that the right word?"}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":3566.28,"end":3568.24,"speaker":"Jonathan Pageau","text":"Yeah, I think that's a good way to see it."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":3569.2,"end":3634.55,"speaker":"Syvilla King","text":"So you're looking for what you know. You're using your quality detector. This, you know, you say, okay, my problem now is I care about, in the Peirsix term, I care about making this person valuable. I'm not going to, you know, go to my base or instincts and just dismiss them, be negative about them. I care to make them valuable. And then, you know, as you're doing that, the sub. The pre. Intellectual awareness, detection of quality will help you see the quality, the good in the other person. And that. I just love that. I think that that particular approach would be extremely valuable for people who have a tendency to go towards negativity. Maybe I can go back to saying, you know, what you were saying about you practice it and then it becomes second nature. So that would be something that, if you practice it would, you know, really improve your view of the world. But you do have to get kind of a hold on it. You do have to have connection with the spiritual, with the noetic, with, you know, with that sense in order to, to implement that."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":3634.71,"end":3640.07,"speaker":"Jonathan Pageau","text":"And that's what you said is it is actually an example of when you talk about how quality creates the world."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":3640.15,"end":3640.63,"speaker":"Syvilla King","text":"Yeah."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":3640.95,"end":3660.15,"speaker":"Jonathan Pageau","text":"That way you Exactly. Yeah. That's also a way which you can understand it because we know, let's say that if you engage others with that mindset, if you engage others in a manner in which you see Christ in them or, you know, you see the good in them, then you're actually going to transform them."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":3660.71,"end":3662.47,"speaker":"Syvilla King","text":"That's right. That's right."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":3663.19,"end":3717.9,"speaker":"Jonathan Pageau","text":"It's not just going to do you good, it's actually going to. Because people are more malleable than we think. People are way more malleable than you think. And so by seeing in others that they will also slightly tilt towards that as well. There's a manner in which you're also putting on them an expectation which they may not have it. It's not that light. Seeing the good in others isn't as. As. As light as you think. It's actually. It can be quite, quite heavy because you're also. You're also putting on the other person. A. You're framing the other person. And that person then will also have a. Will inevitably feel a desire to fill that frame. You know, or it could all. It could be the opposite. Sometimes that person will feel. Flee away from that and act even worse. You know, this is the whole problem of the last judgment, let's say. You know, the whole problem. But there is."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":3718.14,"end":3719.02,"speaker":"Syvilla King","text":"That's interesting."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":3719.02,"end":3729.86,"speaker":"Jonathan Pageau","text":"There is a chance that you will also transform that person towards that, the highest version of themselves, just by engaging with them that way, by giving them."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":3729.86,"end":3733.98,"speaker":"Syvilla King","text":"As Carl Rogers would say, unconditional positive regard. Giving them a chance."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":3734.94,"end":3735.42,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":3736.78,"end":3843.28,"speaker":"Syvilla King","text":"The other thing that I just. There's actually three elements. The second one is, I noticed that your framing of, let's just say health and pathology, correct me if I'm wrong, is pathology is fragmentation and health is cohesion. So I believe the way that I see personality that makes the most sense for me is as divisions between parts of self and that these divisions can be very fragmented, especially in, you know, in cases of trauma. I'm actually going to show this book, this is the Way We Are by Frank Putnam. It's not a famous book, but it's absolutely brilliant. And what it does is it proves, and this is the states that we're born with as infants. So it really is a scientific way of proving that we have the potentiality for fragmentation and we have the potentiality for cohesion. And in, you know, in kids who are in terrible circumstances, they end up being very fragmented in their adult life. And so to cure them is to use methods to cohere. And that is, I think, which are you know, it's exactly the same pattern. Let's just say it's a fractal of the greater pattern that you're talking about is around the center. You know, you go, you. Would that be right? It's the antidote for fragmentation. What would you say that was in the Christian."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":3844.16,"end":3867.28,"speaker":"Jonathan Pageau","text":"No, but I think the word cohesion is the right. Is the right way to understand it. Love and is another word for it in the sense that it's a form of cohesion that doesn't eliminate the particulars, you know, so it's not that. It's not that you. Those different aspects of you. Different personalities are different. You know, it's not that they're bad in themselves. It's just that they don't know each other or that they forget each other."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":3867.28,"end":3867.68,"speaker":"Syvilla King","text":"Yes."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":3867.68,"end":3900.35,"speaker":"Jonathan Pageau","text":"They forget their origin, their higher self, or they forget what's hot, what's above them. And if they remember, then they become connected and they become proper expressions of the person, you know, and the same with all the desire. It's the same with desire, you know, that the church fathers, they don't. They don't think that most of the church fathers leave. They don't think that desire is bad. They think desire is good. Desire is inevitable. By desire, that you will actually also heal yourself, that you will actually enter into God is by desire."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":3900.35,"end":3901.67,"speaker":"Syvilla King","text":"But desiring the good."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":3901.91,"end":3931.72,"speaker":"Jonathan Pageau","text":"Yeah, exactly. But the only problem is that these, the desires, they have a. When they have a will of their own and they. They take over and we all feel it. You could. Everybody experiences that where some desire will take over and you become that desire for a moment, you know, and then you usually remember afterwards, you're like, okay, so why did I eat that second piece of cake? I always use that example. It's like, what happened? You know, but it's the same when you get really angry and you're like, okay, who was that? Because, you know, all of a sudden you fell into this. This mode of. This desiring mode."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":3931.72,"end":3932,"speaker":"Syvilla King","text":"And."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":3932,"end":3956.8,"speaker":"Jonathan Pageau","text":"And you. You forgot yourself. And so. So I think that that's the way to. To understand it, you know, that. That the person. That the person has to unite within themselves their different aspects. And then. But then there's a cosmic aspect to that where the person also uniting the whole world. You know, when we talk about consciousness and this, the way the world exists is. We also do that for everything."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":3957.22,"end":3957.62,"speaker":"Syvilla King","text":"Yeah."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":3957.78,"end":3965.46,"speaker":"Jonathan Pageau","text":"That's what the person, the human person is is this, this place where all things come together. But that also has to happen in yourself."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":3965.62,"end":3966.1,"speaker":"Syvilla King","text":"Yeah."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":3966.1,"end":3968.98,"speaker":"Jonathan Pageau","text":"So memory Is the, is the way that. I mean, memory and attention."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":3970.02,"end":3970.94,"speaker":"Syvilla King","text":"Memory and attention."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":3970.94,"end":3972.42,"speaker":"Jonathan Pageau","text":"Yeah, the way it's presented in the."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":3973.94,"end":3977.54,"speaker":"Syvilla King","text":"And I wanted to say that attention is like that caring in person."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":3977.7,"end":3980.02,"speaker":"Jonathan Pageau","text":"Yeah, exactly. Yeah, that's the right way to see it."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":3980.02,"end":3995.16,"speaker":"Syvilla King","text":"Yeah. And so, and one thing I want to say about the fragmentation is, you know, just to go back to trauma. Like often in kids who have been really abused, they don't. Like one part of them won't have a memory of the other."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":3995.32,"end":3995.88,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":3995.96,"end":4020.5,"speaker":"Syvilla King","text":"You know, like invert multiple personality disorder. The worst case scenario, you know, the end of the spectrum. And so it's interesting how that view in Christian, in the, in the Christian worldview mirrors the worst pathology in human people. You know, the fragmentation or the most difficult multiple terse. We do. Yeah, we all do."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":4020.5,"end":4026.14,"speaker":"Jonathan Pageau","text":"But it's deluded to think you're not aware of your experience if you don't realize it."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":4026.22,"end":4039.18,"speaker":"Syvilla King","text":"Yeah. And that, and that is scientifically, he, you know, this is the scientific proof for that, let's just say. Not that that's the, you know, pinnacle of everything, but embedded within our worldview are scientific tools like that, that help us, you know, help us understand."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":4039.81,"end":4057.81,"speaker":"Jonathan Pageau","text":"I mean, I know people very close to me who, who, who have certain aspects of them where sometimes they'll say something and then, you know, if I remind them that they said it, they don't remember, is they're not in the, they're really not in the same memory stage saying certain things."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":4058.69,"end":4059.33,"speaker":"Syvilla King","text":"Exactly."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":4059.41,"end":4061.17,"speaker":"Jonathan Pageau","text":"Just not in the same mode at that time."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":4061.73,"end":4062.45,"speaker":"Syvilla King","text":"Exactly. Right."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":4062.45,"end":4094.76,"speaker":"Jonathan Pageau","text":"Fascinating. The fascinating thing to notice, and it's like not, it's not pathological in the sense that functional, like, you know, functional person, but sometimes when you see it in others, then you can try to be attentive to yourself and realize, you know, it's like sometimes these moments where you, you lose, you act, you act a certain way. Like, what the hell, to want to impress other people, you know, and you're acting a certain way and then you go back home and you're like, what? Like, who was that? Like what, what? You know, who was I in that, in that moment? Very strange."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":4098.09,"end":4132.14,"speaker":"Syvilla King","text":"And so you need something to help you cohere again. And I like in Jordan Peterson, what he says, it's an embodied sense of the truth. You're cohering, you're lining yourself up, you know, mind and body and soul with what feels right, what feels like the truth. And I think that that is the third element I want to talk about in terms of things that would really help people with mental Health problems is worship is like the idea of worship. And I think, am I right, that that is going around is having a center?"}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":4132.86,"end":4188.82,"speaker":"Jonathan Pageau","text":"Well, I would say. I mean, you could say it as circum. You can see worship as circumambulation. In that sense you can. I mean, a good way to understand is also in terms of hierarchy, in terms of higher. So the idea is that what is it that you put at the highest? And then what is it that you turn toward? What is it that you celebrate? Yeah, and celebration and worship are very similar. Worship is more celebration. I guess celebration is kind of this circumambulation. Worship is really is this recognizing the highness of something. Just seeing it, just talking about it, doing all these gestures, bowing down, all these things that we do to lower yourself in front of this higher thing. All these things that we. That recognize the, the. The what is above all. What is above all. And so it's. It is an. Or it is an orienting. Right. It's an all. The ultimate orientation."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":4189.3,"end":4200.59,"speaker":"Syvilla King","text":"Yeah. And, and, and how to. And I think the difficulty would be in this circumstance how to reorient it toward the real high, not some subversion, you know."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":4200.59,"end":4284.36,"speaker":"Jonathan Pageau","text":"Yeah. And that's the difference between idolatry and, and I mean, in the Christian, you know, in the kind of Christian world, that's the difference between idolatry and true worship. But with Christianity, at least traditional Christianity, orthodox Christianity, they don't oppose. And I think that's something that happens in Protestantism is that they, they want to always oppose the highest and everything below. And so they'll say, you know, it's like if you, if you honor anything, then it's a form of idolatry. But that's not the right way to see it. What you're doing is you're separating God from. From everything. Rather, the best way to do it is to have, let's say, a category which is the highest of high, which is worship, and then have a form of honoring for the way in which that infinite is seen in the world. So you, you honor the saints who manifest to you the highest mode of being, the clothes, you know, the highest mode of love, of being in communion with God. And you also honor the sacred places, the sacred, sacred things which help you participate in that mode. To me, that's the best way to do it so that you don't. Because when you oppose, when you oppose worship complete, when you make worship so high that you have to be neutral towards everything else in the world, it comes back."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":4284.6,"end":4286.2,"speaker":"Syvilla King","text":"Yes, absolutely does."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":4286.2,"end":4327.56,"speaker":"Jonathan Pageau","text":"Comes back without Your will and you. You end up doing things that you're not aware of and you don't realize. It's like I always tell evangelicals who tell me that you only worship God and, you know, you don't give honor to anything else. And I'm like, why? What is this? When you. In church, when someone sings a good song, how is it that that happens? Like, do you even understand what you're doing? Like, do you also understand that you're not aware of what you're doing because you. Is that the right reason to honor someone? Is it because they sang? Well, there may be better reasons to honor someone besides that they performed well anyways. So it's like, you have to. It's better to be aware of it and to give proper honor to the different levels and then do it."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":4327.56,"end":4328.56,"speaker":"Syvilla King","text":"Pretend they don't exist."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":4328.96,"end":4329.68,"speaker":"Jonathan Pageau","text":"Do it anyway."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":4329.68,"end":4340.58,"speaker":"Syvilla King","text":"You're absolutely right. And so we go again. Do it anyway. So we go back again to. To like a. A uniting of all the parts."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":4340.74,"end":4341.22,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":4341.22,"end":4358.66,"speaker":"Syvilla King","text":"That do exist. This is reality. This is life. This is being a human being. Everything is. Is about, you know, all these things. If you approach them in communion rather than rejection or rather than idolatry, then you have a integrated system. Let's just say integrated system."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":4363.61,"end":4391.18,"speaker":"Jonathan Pageau","text":"I could probably get slapped on the wrist by some priests for using words like that to talk about the Christian faith. But it's totally understandable. Like, it is. That is what that structure is, what a real integrated system would look like in the world, too. Like a company, a family, you know, all of these things have to have that balance between the highest thing that unites us and the participation of all the parts within that. That higher thing."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":4391.66,"end":4395.86,"speaker":"Syvilla King","text":"Yeah. And let's just say integrated system is a fractal way of the bigger pattern."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":4395.86,"end":4409.26,"speaker":"Jonathan Pageau","text":"There you go. That way of talking about it. All right. I don't know if there's something else because we've been going for a while, for about an hour and a half. So I don't know if there's something else that you wanted to talk about."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":4409.58,"end":4457.25,"speaker":"Syvilla King","text":"Okay. There's one last thing I think I'd like to bring up. So I think it's really interesting, and it's a big problem we're having now in society. And you're. I can't. I was going to watch it another again, the propaganda video where you're saying the feminine qualities are just as important as the masculine qualities. And for some reason in society, we've decided. And I think it's because of rationality. I think because rationality is essentially a masculine structure. And that's what we revere, that we've also put in the highest value, you know, the highest attributes into that lowered the feminine. And then part of what you're talking about is, you know, bringing the feminine up to where it needs to be on par with the masculine. Is that correct? Or."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":4457.33,"end":4480.99,"speaker":"Jonathan Pageau","text":"I think. I think that. I think that a way to understand it is. How can I say this? It's that the absolute necessity of the feminine for the world to exist, there is no way to avoid it. And so it's to bring the. The problem with saying higher."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":4482.35,"end":4483.15,"speaker":"Syvilla King","text":"Yeah, I know."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":4486.99,"end":4638.34,"speaker":"Jonathan Pageau","text":"In a hierarchical structure, in a way, the feminine is the. Is the opposite of the. The hierarchical structure. And so it's. That's the problem when we want to. We want to make women equal to men. It's like if you do that, then you're already negating the power of the. Of the feminine, which is of the question, the power of the space, the power of the opening up of possibility. And so, and so it's not that I want to make women, you know, on the same level as men, but it's mostly that I want to open up the space for us to be able to perceive and to engage in the feminine aspects of reality. Yeah, but then on the actual hierarchy there, that each rung of the hierarchy, let's say, has feminine and masculine. Of course, for everything to exist, it has to. And so that's why a lot of people who look at feminine symbolism very simply, they'll say, like, you know, man above women below. And you see that in some of the representations that are used. But it's like. Yeah, but it's like, what's a queen then? You know, there is, at every level, there is a coupling, you could say at every level of the social hierarchy, of the ontological hierarchy, there's a coupling between the potentiality or the opening of the space and then the. The manifesting or the making public or making visible or whatever, you know, of that space too. So it's always. It's always happens in terms of a coupling. And so what I want, like. But I think what you said is right, is the problem with the modern world is that it's actually very, very masculine. And a lot of the. A lot of the feminism that we've seen is a. Is a weird masculine caricature. Like, it's like a caricature of the masculine. It's not an actual. It's not an actual, let's say, glorification of the Feminine, you know, but the problem about it is it's really hard to talk about this because of the mysterious aspect of what the feminine is. So there's, there's a way in which I always, I always kind of hesitate to talk about it too much because. But even by explaining it, your, your, your. There's a desacralization which is happening in the very mode of explaining the feminine too much. You don't want to explain it because that's not, It's a question. It's a, it's a. It's the very space. It's the opening. So how do you. If you try to explain it too much and you're, you're, you're denaturing it, I don't know if that makes sense."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":4638.34,"end":4639.38,"speaker":"Syvilla King","text":"It does make sense."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":4639.62,"end":4655.08,"speaker":"Jonathan Pageau","text":"And so it's, it's a weird, It's a weird, It's a weird game that I've engaged in, which is to try to point at it, to try to talk about it a little bit, to give images, to give suggestion without, without denaturing something."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":4655.4,"end":4663.8,"speaker":"Syvilla King","text":"It does make sense. Would you say that. Is that in orthodoxy, it's the Sophia, Is that correct?"}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":4663.8,"end":4731.06,"speaker":"Jonathan Pageau","text":"I mean, yeah, that's a big problem, the whole Sophia problem, because we had that very problem at the beginning of the century, which is that some theologians tried to talk about Sophia and the relationship between Sophia and the Virgin and the Mother of God and, and pushed it very far in terms of theological pronouncement, to a point where they were talking about the Mother of God and Sophia, like talking about the Mother of God as an incarnation of Sophia, you know, in very difficult ways, which got slapped by the church, like the church slapped and said, no, this is not, you can't, this is not proper. It's not a proper way to talk about God. A proper way to talk about it. And I think I mentioned it recently in a video where there are some things which are true, but they become untrue when you say them, and they have to remain unsaid. And I think that one of the problems that sofiology ran into is exactly that problem, which is they're trying to express something which should not be expressed, which should remain in the unsaid."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":4732.98,"end":4734.5,"speaker":"Syvilla King","text":"They're trying to explain it rationally."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":4734.84,"end":4749.16,"speaker":"Jonathan Pageau","text":"They're trying to. Rationally. Exactly. They're trying to rationally explain something which is, by its very nature, is the opening up of the rational space, which is opening up of the space of the world. So you're, you're denaturing it by talking about it almost."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":4749.56,"end":4751,"speaker":"Syvilla King","text":"No, no, that doesn't make sense."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":4751,"end":4767.44,"speaker":"Jonathan Pageau","text":"Yeah, so it's a, it's a. So the feminine is a problem in that sense. Because you want to. Sometimes I was like, I want to say certain things and I'm like, but I'm not helping. Like I'm not helping by, by going too, too far in the, in the, in the pronouncements, you know."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":4768.32,"end":4788.24,"speaker":"Syvilla King","text":"Well, I think, I think one thing I got out of it though, that I did find helpful is just keep in mind that value of the feminine, you know, that, that don't dismiss is a value. And another thing that's interesting is all human beings have elements of both."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":4788.68,"end":4789.32,"speaker":"Jonathan Pageau","text":"Yeah, for sure."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":4790.2,"end":4790.6,"speaker":"Syvilla King","text":"So."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":4792.04,"end":4899,"speaker":"Jonathan Pageau","text":"And the way that it's presented, like in St. Maximus and a lot of the Fathers, is that Christ in a way united both and transcended both, you know, so Christ is ultimately androgynous in that sense. Yeah, but you, you know that. Yeah, so there is, I always tell people that there is a manner in which I, you know, the church is feminine. When I pray, I'm acting in a feminine man or when I. Yeah, that makes sense. And so there's, there's. There's this whole idea that. But it, yeah, but it also, it also, we always, we also have to see the master and feminine within their specific spheres. And that's what, that's what's. It's so hard. People just muddle everything together, you know, And I've seen this too. It's like, let's say the argument that I use, which is that we are all feminine in. Relate in certain aspects of us, then they'll say, well, there, there you go. We could. We're all feminine, we're all masculine. Gender is fluid, all of this. That's not what I mean. In the manner in which I am a man in the world, then in that mode, then I am not feminine, I am masculine. But in the manner in which I am the church and I am a supplicant in the manner in which I am worshiping, then I will embody also all of that. I try to embody all of that which is which the virgin embodies. But in terms of, you know, in terms. But I would I marry a woman because in that mode of my bio, my physical self, of the social presentation of myself, I am a man. You know, it's like, so it's so it's like there is no that just because we can see that femininity, masculinity exists at all aspects and all levels of reality doesn't mean that it's confused. It's not confused. It's not anything goes. And it's not whatever you want. It's."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":4899,"end":4918.64,"speaker":"Syvilla King","text":"It's. Yeah, exactly. And. And Phaedrus would say that's applying the rational knife to something that shouldn't be cut up. And that's a big. Actually, that's a big component of Zen and the Art of Motorcycle Maintenance is. That's how he characterizes cutting things up rationally with the rational knife. That's one of the tropes in Zen of the Art of Motorcycle."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":4919.12,"end":4927.48,"speaker":"Jonathan Pageau","text":"I will. I will. I'll have to read the Zen of the Art. It's a great book. There's two of them, though. If there's an audiobook, it's easier for me."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":4927.48,"end":4936.77,"speaker":"Syvilla King","text":"Oh, there's a really good audiobook. I mean, actually, someone has put it online, and I can. I can send you a link to that. It's. The voice actor's. Fantastic."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":4936.77,"end":4937.33,"speaker":"Jonathan Pageau","text":"It's good."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":4937.57,"end":4939.81,"speaker":"Syvilla King","text":"It's such a pleasure to listen to."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":4939.89,"end":4942.29,"speaker":"Jonathan Pageau","text":"Because I have way more time for audiobooks because I'm carving."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":4943.09,"end":4943.69,"speaker":"Syvilla King","text":"That makes sense."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":4943.69,"end":4947.09,"speaker":"Jonathan Pageau","text":"Actual reading books is very limited. I do, but it's very limited."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":4947.09,"end":4949.73,"speaker":"Syvilla King","text":"Yeah, you just have to keep it to what you really need to read."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":4951.01,"end":4975.2,"speaker":"Jonathan Pageau","text":"All right, so I think. I think. I think we should wrap this up. And I. And I. Yeah. I really appreciate. I really appreciated your channel. I've appreciated watching the videos where you're trying to kind of piece together. I can feel the authenticity in your desire to kind of figure things out, and we should keep tabs on each other. I'll try to kind of keep an eye on what you're doing."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":4975.52,"end":4987.62,"speaker":"Syvilla King","text":"Okay. Well, thank you. And I will certainly do the same for you. And thank you so much for inviting me on your channel. And at one point, one last thing I'd like to say is I love your introduction. I think that's your painting. Correct. Of Genesis."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":4987.62,"end":4995.42,"speaker":"Jonathan Pageau","text":"It's not mine. No, it's a traditional. It's a traditional. It's from a German missile. It's a representation of the six days of creation. Yeah, I love it, too."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":4995.42,"end":5000.18,"speaker":"Syvilla King","text":"It's incredible. And it's funny, you know, that opening overture. The Eastern."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":5000.42,"end":5000.9,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":5001.3,"end":5007.62,"speaker":"Syvilla King","text":"So Scheherazade has always been my number one favorite piece of music. So when I heard that, I was like, oh, that's wonderful."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":5010.1,"end":5012.1,"speaker":"Jonathan Pageau","text":"It's also like. It's. People don't realize that."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":5012.1,"end":5012.34,"speaker":"Syvilla King","text":"It's."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":5012.34,"end":5050.9,"speaker":"Jonathan Pageau","text":"That it's actually like a resurrection, like the first part, because it's starting right away at Easter. And when you Hear that ascending part at the end of the clip? That's like the resurrection. That's the Easter moment. And so it's like, to me, that's what's going on. But also in the image of creation, people, I'm giving my secrets away here, but thank you. You notice that image? It's the awakening of Eve. That's the image. So that, to me is also, like I said, it's one of the things that I'm trying to do, what we were talking about doing it too much or without doing it explicitly or kind of turning around it and pointing and talking. And so."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":5050.9,"end":5062.66,"speaker":"Syvilla King","text":"Yeah, makes sense. Well, thank you so much, Jonathan. This has been such a treat and I've learned a lot today. I continue to learn from you and thank you."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":5062.9,"end":5068.67,"speaker":"Jonathan Pageau","text":"All right. And I also wish you the best on your own personal journey. I'll be. I'll be looking forward to seeing where it leads you."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":5068.67,"end":5070.03,"speaker":"Syvilla King","text":"Yes. Thank you very much."}
{"episode_id":"SW - #078 - 2019-12-08 - Sevilla King - Living a Quality Existence","start":5071.63,"end":5136.53,"speaker":"Jonathan Pageau","text":"I hope you enjoyed this episode of the Symbolic World. The Symbolic World is edited by Justin Ward and it is based on a series of videos that you can find on my YouTube channel, Jonathan Pageau's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by, of course, leaving a review on itunes. Everybody knows that's the best way to get the podcast out there, to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon Pageau videos as well, and on subscribestar, all those links you can find on my website or in the show description. So thank you and I will see you soon."}
