{"episode_id":"SW - #114 - 2020-08-28 - John Vervaeke - Original Sin and the Meaning Crisis","start":12.56,"end":16,"speaker":"Jonathan Pageau","text":"This is Jonathan Peugeot. Welcome to the symbolic world."}
{"episode_id":"SW - #114 - 2020-08-28 - John Vervaeke - Original Sin and the Meaning Crisis","start":26.09,"end":70.25,"speaker":"John Vervaeke","text":"Welcome everyone to Voices with Revaeke. I'm joined with my. I'm joined by and with my good friend Jonathan Pageau, whose work on the symbolic world deeply resonates with a lot of what I've been doing work on. And as many of you no doubt know, and I find Jonathan brilliantly insightful and his reflections on the symbolic aspects of existence and his ability to reshine and refurbish these stories so that they can shine for us again is often, you know, it sort of catches you. It's deeply impressive. So thank you, Jonathan, for coming."}
{"episode_id":"SW - #114 - 2020-08-28 - John Vervaeke - Original Sin and the Meaning Crisis","start":70.65,"end":119.1,"speaker":"Jonathan Pageau","text":"Oh, it's my pleasure. I always enjoy talking with you, you know, ever since I discovered your work and kind of discovered the language which you're developing, also to talk about these subjects, it's been really helpful to me. I find myself thinking in the categories that you are bringing forth and especially speaking to kind of a secular audience or also convincing Christians that the words they use have meaning, because sometimes we have this kind of internal language and it stops to actually be meaningful in the world and it just becomes like a kind of magical language. So I've been using your expressions on attention, the idea of relevant realization. All of these expressions have been good to help people re see things in a different frame so that they understand them. So I really appreciate our discussions, for sure."}
{"episode_id":"SW - #114 - 2020-08-28 - John Vervaeke - Original Sin and the Meaning Crisis","start":119.82,"end":250.54,"speaker":"John Vervaeke","text":"Well, thank you for saying that, Jonathan. I aspire to this being true, that above and beyond trying to convince or persuade people about my specific claims, truth claims, theoretical claims, proposals, practical endeavors, etc. I aspire that I do afford a vocabulary and a grammar for people that helps them to clarify and develop their thinking. I mean, that's the art that for me, that's the way in which I try to enact the Socratic ideal of being the midwife. Right, the midwife for other people. So thank you for saying that. That means a lot to me. So what I wanted to start off specifically talking about, you released two excellent videos and I'll put the links to them in the description of this video. One was on. I won't get the actual verbatim name. One was on sort of the religious nature of a lot of the demonstrations that are happening around that were sort of galvanized into existence by the death of George Floyd. And then you did a follow up, they were sort of like part one and part two. One on the iconoclasm, the destruction of images, the pulling down of statues. And one of the things you did was you put your finger on a Huge important aspect of this that is being completely ignored in the mainstream media. But I think is of vital importance, as has happened in the past between you and I, I was very convergent. I was coming to very similar concerns and reflections. And I'd said some things early on about how Covid was going to accelerate the meaning crisis and cause just a mental health tsunami. And you'd see a proliferation of conspiracy theory thinking, you'd see purity code behavior. Human beings are going to respond in fashion to this invisible, ubiquitous threat that's causing them to isolate. And as you, I like your, your invocation of the symbolic idea of fasting for most of their connections."}
{"episode_id":"SW - #114 - 2020-08-28 - John Vervaeke - Original Sin and the Meaning Crisis","start":250.86,"end":251.26,"speaker":"Jonathan Pageau","text":"So."}
{"episode_id":"SW - #114 - 2020-08-28 - John Vervaeke - Original Sin and the Meaning Crisis","start":251.26,"end":510.18,"speaker":"John Vervaeke","text":"And then I saw all of that and then when the protests began, I had, so I want to. I had a reaction that made me sort of accuse myself from commitment, commenting on that publicly. Part of it was a concern, which you said in your first video, of just, you know, saying something that would be premature, polarizing. It was difficult to say anything that was going to be heard with that had any kind of nuance or reflection to it. So part of it was just that kind of caution. But there was a deeper issue for me. I was very concerned and I talked to my close friend about this, that I would fall into a kind of self deceptive bias when I tried to talk about any of this. So give me a moment, please. I don't mean to trespass on your patience, but I want to, in order to try and articulate this, and this has helped me, upon reflection, I want to invoke Weber's distinction between the manifest and the latent function. So to give you a classic example, you know, Weber talked about the manifest, manifest function of a bureaucracy is to facilitate information traveling upward and decisions traveling downward. And that's its manifest function. But it has all kinds of latent functions. It has the latent function of allowing people to diffuse responsibility and shift blame onto others. And Kafka, of course, brought this into high art. He showed us how the latent function can put us into a tragic situation because our commitment to the manosphere function binds us in a tragic fashion to the latent function that can be antithetical to it in kind of a profound way. And so I was, look, I was, I'm watching this and I'm saying, well, yeah, that's horrible and racism is a horrible thing. And what we're seeing happening here. And there's definitely. I know this because, you know, what's happened since, you know, 9, 11 and the patriot act, there's been the Militarization of the police. And that has been a very dangerous thing. Right? And I know there's nasty tricks happening, there's voter suppression happening and all kinds of bad things, and people are feeling, I think, legitimately manipulated and disenfranchised in powerful ways. And this is meshing in ways that we're all finding it hard to understand with a history that has disadvantaged certain groups of people. And all of this is going on. And I'm saying, yes, these are issues that all get addressed. So my, I don't mean to sound Freudian here, but my sort of conscious, explicit awareness is going, yes, yes, yes. But I'm having this negative, visceral reaction to all of this. And I'm trying to go, what's going on? And at first I'm, oh, you know, I'm making all these things and I'm. And I can feel that I'm in the grip of something. And so I'm talking about this with my friends and I'm reflecting on it and, you know, journaling about it and everything. And I'm coming to realize, oh, oh, and Jonathan, you know that I respect your allegiance to Christianity. I'm speaking about me here. Okay? So I said, oh, this reminds me, I'm back in my fundamentalist church and I'm the 10 year old again and I'm being traumatized by a puritanical form of Protestantism. I'm being told that I have an original sin that I. Not because of any act that I committed, but that is just because of how I was born. And that there's an aspect of this that is unforgivable no matter what I do. And everything I try to do to overcome this just makes it that much worse. And that I need to be absolutely contrite and guilty until some external obscure authority will finally pronounce me, you know, saved or whatever. And that. And then what this brings with it, you know, is bonfires. And I mean, I'm not being hyperbolic, Jonathan. I'm talking about gathering behind the church and putting the rock and roll albums and the books into a thing and lighting it on fire. Like, can you imagine?"}
{"episode_id":"SW - #114 - 2020-08-28 - John Vervaeke - Original Sin and the Meaning Crisis","start":510.34,"end":514.42,"speaker":"Jonathan Pageau","text":"Oh, yeah, I've been through that too. I grew up with that kind of stuff as well."}
{"episode_id":"SW - #114 - 2020-08-28 - John Vervaeke - Original Sin and the Meaning Crisis","start":515.06,"end":855.45,"speaker":"John Vervaeke","text":"Okay, so, and so I'm realizing that the latent functionality of this is so reminiscent of kind of a, kind of puritanical fundamentalist Protestantism. And again, I was noticing the same things you're noticing, you know, the acts of contrition, the throwing down of the stones in the high Places like from the Old Testament, right. Where the prophets are always doing that. Right. The kneeling and the confessions and the statement that there's nothing I can do about it other than feel guilty. I was noticing how this was tremendously religious and that. That, as I said to others, that upbringing like, that upbringing traumatized me. I mean, I remember going to the minister in the church with my mother when I. Because I read the Bible regularly, daily, and I came across the passage in the New Testament about the unforgivable sin. I fell into. I mean, Cartesian skepticism was nothing compared to the. Well, I fell into about, well, how do I know what it is? And how do. And, like, did I just do it? And if it's unforgivable, I'm now doomed. I'm doomed, right? And that feeling of being doomed and trapped and, you know, and I went to him and what I wanted was a clear definition of what it was. And I just got, you know, the usual, you need to have faith. And it was very unhelpful. And so I was realizing, oh, John, you better keep your mouth closed about. Because even if you want to speak about this, this is just going to come flowing through you because you have an incredible bias. It's very hard for you to see this in a positive light, even though sort of intellectually you can understand these important things that we've already mentioned. You know, the racist history, you know, the subversive disenfranchisement of people. Right. The militarization of the police. All of these things are real and they need to be addressed. But I realized if I try to say anything about this, my chances of speaking in a way that I think is clear were going to be seriously undermined. So I just sort of held back. But then I saw your videos and I thought, well, maybe I. Maybe with Jonathan's help, I can talk about this. Sorry, I don't intend this to be a therapy session. That's not what's going on here. I want to be really open with you about where I'm coming from. And I think your video actually points out that this tension. Well, let me. I might be too bold. It suggested to me that this tension that I'm finding in myself is not exclusive to me, that I sensed in you, not to the degree I'm talking about, but. But also a tension between what this might be sort of at a manifest level and then this unacknowledged latent function of religiousness. And then you have some criticisms, at least implicit, of this you had towards the end you warned of danger in the first video because the religion that does not know that it's a religion is not oriented towards the ultimate. And so there's like a critique coming via or similar to what Tillich would meant. Ultimately it's an idolatrous. For all of its bringing down of images, it's ultimately an idolatrous religion. And then I was thinking about this and I was thinking about how that politics has in many ways taken over the domain of religion. I don't think, well, it's drenched the 20th century in blood. But I noted that, well, there's sort of two religions are supposed to have, like you said, there's supposed to be moments of communitas and transformation. And I'm trying to think, well, what are the only rituals left to politics? Well, there seem to be two and it was noted how they seem to split between the right and the left. There's the demonstration of the protest or the rally. And the right likes the rally and the left likes the demonstration, protest. And then I'm thinking, and both of these we have good historical evidence, don't bring about the new man, the new person, the transformation of human beings, you know, and all of the revolutions, left and right, the French Revolution, etc. Onward show that it doesn't bring about that. Although there is often religious goal within the French Revolution and you know, they worshiping the goddess of reason and all that stuff. Right. It doesn't actually bring about the promised transformation that. That it is groping towards. And so I was thinking that is it possible to talk about this sort of in terms that are kind of meta political about the latent functionality of the religion and at that level legitimately criticize it without thereby implying that we think, or I'll speak on my behalf, not yours, that without thereby implying that I think that we shouldn't do something about militarization of the police, the subversive suppression of voting and disenfranchisement of people and then how that has often allied itself with historical factors that are ongoing of racism, et cetera. That's what I'm proposing to you. Is it possible? And I'd like to try and explore that with you, but that's sort of the frame I want to set out."}
{"episode_id":"SW - #114 - 2020-08-28 - John Vervaeke - Original Sin and the Meaning Crisis","start":855.53,"end":968.26,"speaker":"Jonathan Pageau","text":"Yeah, yeah, I think for sure. I think there are a lot of things to deal with in what you said, a lot of things to kind of unpack at different levels. I think maybe we can kind of separate them in different parts so that we don't get completely jumbled. One is to look at the possible reinterpretation of your experience, let's say, or the notion of the original sin, that the idea of Adam or the fall of Adam, what that can mean and how we could reinterpret that in a manner which is more useful than your traumatized youth. And I understand, because I went through all the stuff you dealt with, I went through the same. And even the description of the idea of blaspheming the Holy Spirit and everybody wondering, did I blaspheme the Holy Spirit? All of that, I understand, but I think there are ways to reappropriate the stories. Those stories, and I say reappropriate is. I also believe one of the reasons why went towards orthodoxy is because they have a different vision of the fall of Adam, one which I think has a healthier balance. So that's one. And then the other is then looking also at the way in which these protests or Covid and the protests together kind of just exploded into a kind of weird catharsis and what that means and what it's kind of looking towards. And so, sadly, the third part, which would be, like, how to get out of this kind of this bind that we're in, is the one which I don't know. Like, I really. A lot of people ask me, so what should we do? And I'm looking around and I think, I don't know what to do, except I don't know what to do socially. Like, I think I know what to do personally, but I don't think I know what the societal solution is. So maybe that one will be harder."}
{"episode_id":"SW - #114 - 2020-08-28 - John Vervaeke - Original Sin and the Meaning Crisis","start":968.5,"end":1071.78,"speaker":"John Vervaeke","text":"Well, I do want to talk about that, because I've been talking about that with other people as well. But I'm happy with your proposal. But like I said, I'd like to put it, like I said, into the way in which what's happening, it has, at the level of the latent functions. There's. Well, you said it. I want to use your words. There's something dangerous happening in this as well. And I want to explicate and draw that out. I'm happy to hear your revisions. And so I don't know what to call it. Let's say revisioning rather than revision of these. Of these stories. And then. But if you could put that into dialogue with. Because, okay, let me. Instead of making a statement, let me make. Ask a question. It's kind of a request. I see in, you know, I see an analog to a strong analog in this movement to that version of original sin that I was brought up with let's remember that the word Protestant means those who protest. I mean, right there. And I was brought up in a church where, you know, protesting and constantly declaring what was evil and what should be burnt or, you know, and that was like. That was daily the kind of practice. So do you think that I'm incorrect in saying that the version of original sin, whether or not it's the right version, I'm going to give you space to talk about that. But do you think that maybe overly Augustinian version of original sin is what's at play in this movement right now? Am I incorrect about that?"}
{"episode_id":"SW - #114 - 2020-08-28 - John Vervaeke - Original Sin and the Meaning Crisis","start":1071.78,"end":1214,"speaker":"Jonathan Pageau","text":"No, I think you're definitely right. I think you're definitely right. One of the. And I think it's something that we've seen before in the sense that maybe an inverted version of what we've seen before in terms of like racialized vision of the world in the past, which is that we've taken the notion of original sin and we've brought it down into biology and which is the scariest thing that can happen because it actually is inevitable. Like it actually does become inevitable because it's related, it's linked in a. Not in a really scientific way at all, but in a mythological way. It's still brought into a term which is using language of kind of biological identity or categories which are material categories. And so the idea of this racialized guilt, or, you know, was there in kind of 17th century racism, like kind of Neo Darwinism, kind of social Darwinist racism, this idea that. That certain races were inferior by their own biology and therefore were made to be slaves or were made to be the lower. And now we're seeing a kind of weird reversal of that where we're saying to be a certain race is in itself to be the oppressor. Like to be white is to be guilty of the sin of the revolutionary thinking. Like, it's kind of like it's not completely original sin. It's like the end of the revolutionary trend in thinking. Right. The French Revolution, the Marxist revolutions. And now we've come to kind of the end of it where we're actually bringing it into almost a biological reality where the guilt of the oppressor is a racial guilt. And it's. And that's that. So that. So like you said, it does relate to original sin because it means that as someone who has that identity, whether it's actually legitimate, scientifically or not, it doesn't matter. They're still framed in those categories. As someone who has that identity, I have no way out, like I have no way out, except for two things which your people are doing, which is to self flagellate and to scapegoat. That is to put myself on the. To put myself on the side of. Find someone guiltier than me."}
{"episode_id":"SW - #114 - 2020-08-28 - John Vervaeke - Original Sin and the Meaning Crisis","start":1214.16,"end":1214.64,"speaker":"John Vervaeke","text":"Yes."}
{"episode_id":"SW - #114 - 2020-08-28 - John Vervaeke - Original Sin and the Meaning Crisis","start":1214.64,"end":1221.36,"speaker":"Jonathan Pageau","text":"And yell at him and tell him that he has to be canceled and he has to be excluded from society. It's the only, the only two solutions."}
{"episode_id":"SW - #114 - 2020-08-28 - John Vervaeke - Original Sin and the Meaning Crisis","start":1221.6,"end":1250.47,"speaker":"John Vervaeke","text":"Yeah. And that I, like I said, I went through periods where the church I was in would be riven to bits by exactly that. That process repeatedly, in cycles, again, again and again. And when I sort of, when I sort of woke up to that, I was like, whoa, this is like, like when I started reading some literature and I realized. And the literature, like showed me what human beings could be other than this. That was like, so."}
{"episode_id":"SW - #114 - 2020-08-28 - John Vervaeke - Original Sin and the Meaning Crisis","start":1250.87,"end":1304.46,"speaker":"Jonathan Pageau","text":"But you're right in the Protestant sense. Like if you think of Protestant sects and. And you notice both the puritanist kind of self flagellation of complete depravity and then the schismatic notion that all of a sudden the group I'm in is not pure enough. They're not close enough to the truth. They're not. And then removing myself with a little. A smaller group and then condemning those on the outside as being as. It's like an acceleration. It's always been there. It's there in every, every structure. Like we can talk about that, but there's an acceleration of it in the kind of fragmentation of Protestantism. And we see it in intersectionality to an extent which becomes completely absurd where, you know, at some point it's so obscure that most like regular people don't even know what you're talking about when trans exclusive this and then trans inclusive. And we don't. Most people are like, I don't understand."}
{"episode_id":"SW - #114 - 2020-08-28 - John Vervaeke - Original Sin and the Meaning Crisis","start":1304.62,"end":1305.42,"speaker":"John Vervaeke","text":"And then it's."}
{"episode_id":"SW - #114 - 2020-08-28 - John Vervaeke - Original Sin and the Meaning Crisis","start":1305.42,"end":1311.11,"speaker":"Jonathan Pageau","text":"There's smaller and smaller identities which are. Are excommunicating other identities and you don't know what's going on."}
{"episode_id":"SW - #114 - 2020-08-28 - John Vervaeke - Original Sin and the Meaning Crisis","start":1311.51,"end":1318.11,"speaker":"John Vervaeke","text":"Yeah. So I mean, to my mind that is the meaning crisis on steroids or methamphetamine or something."}
{"episode_id":"SW - #114 - 2020-08-28 - John Vervaeke - Original Sin and the Meaning Crisis","start":1318.11,"end":1318.63,"speaker":"Jonathan Pageau","text":"That's right."}
{"episode_id":"SW - #114 - 2020-08-28 - John Vervaeke - Original Sin and the Meaning Crisis","start":1320.63,"end":1391.58,"speaker":"John Vervaeke","text":"And I think given the deeply deleterious effects which we're seeing. You and I were talking just before we hit the record about, you know, we're seeing people are like. They're people that were normally sort of very sane, like in our personal relationships are moving more towards the fringe and they're filled with anxiety and they're describing their experience as surreal. I think, you know, the deleterious effects of the meaning crisis are being exacerbated by Covid and then perhaps by certain latent aspects of this. But I wanted to give you the opportunity to make good on your promise that there's an alternative way. There's an alternative way. And I mean, I'm interested in this both philosophically and personally. I typically try not to get too personal in these conversations, but this one has to be different for the reasons I've already articulated and I'm putting my trust in you about this so that there's an alternative way of conceiving of the myth of original sin. And you know, I use that word not in a pejorative fashion. And so what do you, what is that alternative understanding to your mind?"}
{"episode_id":"SW - #114 - 2020-08-28 - John Vervaeke - Original Sin and the Meaning Crisis","start":1392.22,"end":1528.51,"speaker":"Jonathan Pageau","text":"So the way to understand it is to clearly differentiate between sin and death. They're related, but they're, they're different. And so in scripture it says the wages of sin is death, right? And there's an idea that even in the, in scripture, it never says that we inherit the sin of Adam. It says that, that we, because of Adam's sin, we are, we are in death like we are in the, in a. We are living in a world of death. And that's really the best way to understand it, which is that sin causes death. So you, you have a purpose. You miss the mark, and that's, that's what death is. And so there's a, there's a brokenness that you break. The system breaks down as you miss the mark. And this is. Happens at every level of reality, whether it's in your own life or society or entirety of the world. When something misses the mark, then there's a breakdown which happens. Now we inherit the breakdown of that which is before us. We inherit death. So we are born in families that have missed the mark. We are born of parents that have missed the mark. We are born of systems that have missed the mark. And so because of that, we live in a world which has an aspect of it which is broken. We still have the aspiration of hitting the mark, and that's what kind of guides us and makes us want to live. But we have to live with the consequences of that. Miss. And the difficulty is that when you're in a world of death, that is when you inherit the consequence of, of sin. So when your parents miss the mark, and they will, and we know they do, you inherit that. And it makes it more difficult for you to hit the mark because you have all the baggage which comes and you have inherited the patterns of being that will make that worse, right? Which will increase the brokenness which will tend to fragment. Okay? And so that's the manner in which we need to understand original sin. That's what it is. It's the inheritance of brokenness."}
{"episode_id":"SW - #114 - 2020-08-28 - John Vervaeke - Original Sin and the Meaning Crisis","start":1529.63,"end":1580.25,"speaker":"John Vervaeke","text":"So that, And I hope you take this as a helpful thing that to me reminds me of, you know, certain interpretations of the Buddhist notion of karma, that there are these patterns at work and we inherit them and they affect our behavior and they cause suffering. And the way I've sort of understood this, at least psychologically and existentially, is, as you said, you know, we pick up from others, our parents, our friends and our culture. We pick up. And, you know, here's where historical racism does matter, right? We pick up patterns that are shaping us and moving us in ways that are detrimental to our aspirations. Is that a fair person?"}
{"episode_id":"SW - #114 - 2020-08-28 - John Vervaeke - Original Sin and the Meaning Crisis","start":1580.65,"end":1703.18,"speaker":"Jonathan Pageau","text":"Yeah, but the idea is. The idea is, of course, the very desire, the very aspiration, that is the very possibility we have of conceiving the good and of seeing the point that we're aiming at, right, Of. Of. Of seeing it in our view and. And moving towards it, right, Is. Is the very. How can I say this is the reminder that we are not. That we don't fit in this broken world, that we are. That we are. We find dissatisfaction in the brokenness. So that's what causes our suffering. But it's also what. What can ultimately cause our hope. Because we see, we can see that we're not made like there's something in us which wants more than this brokenness and this. This world of death. There's something in us which is. Which can see that, which we can aim towards, which is the good, of course. And so that is really the. And so what, let's say what Christianity shows us and like, what Christ shows us is that the manner to reach. The manner to reach the aim in the brokenness is to a certain extent, embrace death. And that's really the. That's the hardest thing is to embrace death consciously, embrace the brokenness consciously, and therefore we don't become slaves of that brokenness, right? It's to see your sins, to see the place where you miss the mark instead of just blaming your parents. Because that's what you will want to do, right? You want to blame your parents, you want to blame the system, and you're right to, because the system is broken. Your parents are broken. Everything. There is an aspect of everything that's given to you which is broken not fully, but there is an aspect of it which is broken. And the solution is to. Is to actually rather see your own Death. The places in you that you're dead. And recapture the vision. Right. Recapture the aim."}
{"episode_id":"SW - #114 - 2020-08-28 - John Vervaeke - Original Sin and the Meaning Crisis","start":1704.46,"end":1858.69,"speaker":"John Vervaeke","text":"So this brings me to a central question that I have about this. Thank you for that. I think that was very helpful. So let's shift the discussion onto mortality, then. And the interesting thing, of course, and you're aware of this, I know, in the Greek world is mortality has. And Heidegger, developed this a lot. It has a much more encompassing notion to it. And that'll help lead me to my question to you. Because one of the great sins, and I think this is the right word in the Greek world, is hubris, which is to, in some sense, for forget your mortality. Right. And to think that you can. That you can be a God. And you know. And this is captured in great literature, you know, Conrad's Heart of Darkness, which, of course, is now a contentious work, but nevertheless, Kurtz's big sin is hubris, right? He forgets. And Marlowe's heroism is. He commits himself to his humanity, that he will preserve his mortality. And I've been talking to my son about this because, you know, he lives with me now partially because of COVID and, you know, I've been exposing him to certain ideas, and he's going, but, you know, but I want certainty. And I'm saying, well, yeah, but you can't. Part of what being, you know, being, embracing your mortality is to realize that no matter how good your idea might be, you're ultimately a fallible human being. You're finite. And he was like, but I don't like this. And I said, but your mortality isn't just. Right. You'll see how this connects to what you said in a second. Your mentality isn't the fact, you know, like in Tolstoy's Ivan Ilyich. Ivan Ilyich knew he was going to die. Right. It's not that. Your mentality is that, like you said, in some fundamental way, you know, we are finite, we are broken, we are not gods. So. And I'm seeing this in my discussion with him. How do you. Because I'm trying to work this with him as a father. Getting people to embrace their mortality is good because it prevents inflation. It prevents hubris. It prevents. I suppose it would prevent blasphemy, too, from a Christian perspective. And as you said, it helps people not to fall into the error of. By criticizing others. I implicitly remove myself from that criticism. Right. I see all of that. How do we do that without the truck, without traumatizing them? Sorry. I'm sorry. That was a Bit of a garden path. I blow."}
{"episode_id":"SW - #114 - 2020-08-28 - John Vervaeke - Original Sin and the Meaning Crisis","start":1858.85,"end":1872.14,"speaker":"Jonathan Pageau","text":"No, I think there has to be. I'm sorry that I'm going to say, but I think that trauma is part of the experience. Like I think that death. We don't want to be cruel, but."}
{"episode_id":"SW - #114 - 2020-08-28 - John Vervaeke - Original Sin and the Meaning Crisis","start":1872.14,"end":1873.38,"speaker":"John Vervaeke","text":"We don't want to be cruel is what I'm."}
{"episode_id":"SW - #114 - 2020-08-28 - John Vervaeke - Original Sin and the Meaning Crisis","start":1873.38,"end":1900.27,"speaker":"Jonathan Pageau","text":"No, no, right, no, I understand. But death is, death is, is traumatic. Like there is a trauma in death. And so we need, like the, the church fathers and the, the ascetics, they always say two things. They say, remember God and remember death. Those are the two things you need to remember. I always kind of joke around and say, you know, that's the Christian version of like mindfulness. You know, it's like, remember God, remember death."}
{"episode_id":"SW - #114 - 2020-08-28 - John Vervaeke - Original Sin and the Meaning Crisis","start":1900.27,"end":1900.59,"speaker":"John Vervaeke","text":"Right."}
{"episode_id":"SW - #114 - 2020-08-28 - John Vervaeke - Original Sin and the Meaning Crisis","start":1900.67,"end":1917.71,"speaker":"Jonathan Pageau","text":"And so the idea is that if you, if you are, if you kind of remain in your death, then like you said, you avoid all the problems that you talked about. And the strange paradox in Christianity is that by doing that you actually do become God."}
{"episode_id":"SW - #114 - 2020-08-28 - John Vervaeke - Original Sin and the Meaning Crisis","start":1918.75,"end":1919.15,"speaker":"John Vervaeke","text":"Yes."}
{"episode_id":"SW - #114 - 2020-08-28 - John Vervaeke - Original Sin and the Meaning Crisis","start":1919.15,"end":1923.91,"speaker":"Jonathan Pageau","text":"Like you actually do become deified ultimately, if you do those two things."}
{"episode_id":"SW - #114 - 2020-08-28 - John Vervaeke - Original Sin and the Meaning Crisis","start":1923.91,"end":1926.88,"speaker":"John Vervaeke","text":"Right, but it's a non. Inflationary."}
{"episode_id":"SW - #114 - 2020-08-28 - John Vervaeke - Original Sin and the Meaning Crisis","start":1927.2,"end":1963.18,"speaker":"Jonathan Pageau","text":"Exactly. And that's the kind of the paradox of, the paradox of creation and the paradox of the Garden of Eden, which is that if Adam had submitted to the will of God and not eaten of the fruit of the tree, then God would have given him the fruit of the tree. That's the tradition, that's what many saints have said. And not only that, but that that would have been his access to the tree of life, which would have been perfect communion with the divine. And so it is in humility that we actually reach the highest."}
{"episode_id":"SW - #114 - 2020-08-28 - John Vervaeke - Original Sin and the Meaning Crisis","start":1964.14,"end":1987.95,"speaker":"John Vervaeke","text":"It's interesting, I just read this morning when I was doing my lecter divina, Rilke's passage where he talks about, we throw a ball into the infinite and then it returns to us differently, it returns to us heavier. And it's only in having done that that we actually get to feel the true weight of things. And it sounds like you're saying something very analogous to that. So what I was trying to."}
{"episode_id":"SW - #114 - 2020-08-28 - John Vervaeke - Original Sin and the Meaning Crisis","start":1987.95,"end":2043.64,"speaker":"Jonathan Pageau","text":"How do we avoid the trauma? All I can say is the idea is obviously to place the trauma, ultimately to place it in Christ. Like the ultimate trauma, right, Is communion. Like that's the ultimate trauma. If you really take communion seriously, you are engaging in a traumatic experience. You are eating the flesh and blood of the God man like you are, you are at the foot of horror, like we thought. You know, you talk about horror a lot in your, in your, in your, in your lectures. And I. One of the things I do want to bring up to you is that. That is why communion, one of the aspects of communion is to bring you into that horror in a manner which will. Which will save you and not destroy you in a manner in which you can integrate it in that it's both a participation in horror and a communion of love at the same time. In a paradoxical way."}
{"episode_id":"SW - #114 - 2020-08-28 - John Vervaeke - Original Sin and the Meaning Crisis","start":2043.8,"end":2102,"speaker":"John Vervaeke","text":"Yeah. I mean. Well, maybe we can talk about this at some point. I mean, I do think. Yeah. The sacred brings in simultaneously the symbol on. Right. The horrifying function and the homing function in a profound way. And that goes back to. So, I mean, there's two things I want to say. One is, like, I'm trying to. But there's a notion of mortality, and isn't it in the symbolism of carrying your cross that's analogous to the Buddhist notion that mortality isn't just death, but that the idea that moment by moment I'm dying, there's little deaths all the time. And that if I try to avoid that, if I try to get some kind of permanent hold on things, I'm just gonna. I'm gonna cut myself on that, and then I'm gonna cut other people. It's. Again, is that. Is that. Is that a correct analogy to."}
{"episode_id":"SW - #114 - 2020-08-28 - John Vervaeke - Original Sin and the Meaning Crisis","start":2102,"end":2219.63,"speaker":"Jonathan Pageau","text":"Yeah, of course. Like, if you look at. If you look at the prayer of Jesus, the basic mystical prayer of the church, it has two. It has two parts, right? It says. It has an invocation. It says, lord Jesus Christ, son of God, have mercy on me, a sinner. And so it's like there's this invocation and this remembrance of my own brokenness, remembrance of my own incapacity. And so those two movements simultaneously, they're the ones that will. And it's. And it's. It's also. And because I think one of the problems of the. Of the trauma of the Protestant is to a certain extent, the idea that. It's weird. Like, the idea that you should be pure, right? That you should be, but you can't. And so it's like, what then? What do you do? Right? You just remain in this strange, broken, broken self. But if you rather see it as this necessary part of being a human person and moving towards the good, then it does. Then it's not as traumatic because you. You'll then see that even the saints lived in, you know, in the most difficult temptations, that the saints were struggling with their passions, you know, and those who reached the highest had the same frustrations you did. Like, they. No one pretends to be. If you There isn't like, the holier. The person that's holier than thou. And that kind of just. If you read the lives of the saints, you see the story of broken people who their whole life struggle with thoughts and with temptations, you know, and are delivered by God. But it's like, okay, if they struggled. So for 30 years, you know, you read crazy stories of the saints where it's like, for 40 years, he struggled with the thought of fornication. And it's like, would he struggle with that for 40 years? He actually struggled actively with that for 40 years. Okay, so I need to stop complaining, because seriously, there's no way that I'm doing that."}
{"episode_id":"SW - #114 - 2020-08-28 - John Vervaeke - Original Sin and the Meaning Crisis","start":2222.25,"end":2297.63,"speaker":"John Vervaeke","text":"So Duhanin talks about this in connection with Plato and Socrates. He talks about it in terms of. He has a book called Finite Transcendence where he said that Plato was always trying to keep this tension alive between the relationship to transcendence and the acceptance of our finitude, of our mortality. And so I'm wondering then if there is something like a feature of wisdom. I know you have your particular Christian commitments, and I'm not trying to trespass on those, but you're also not. You're not being offended, which I thank you for. When I make these connections to other things, you find them, I think, valuable, at least in discussion. But there seems to be a feature of wisdom which is this kind of tonos between the aspiration in transcendence and then the deep acceptance of our humanity and our mortality and keeping them always together is. And there's a finesse to that. There's a dynamic shifting. I can't give you a rule or a recipe for doing that. It's an ongoing, ever evolving capacity. Would you think that."}
{"episode_id":"SW - #114 - 2020-08-28 - John Vervaeke - Original Sin and the Meaning Crisis","start":2297.63,"end":2338.01,"speaker":"Jonathan Pageau","text":"Yeah, it's a mode of. It's a mode of being. It's a way of being which is what will kind of hold those two things together. And I think your image of wisdom is particularly good in the sense that wisdom, at least in Scripture, at least in the. In the Bible, the way that wisdom is described seems to really be the capacity for those. For, let's say, the principles or the ideals to be united with the particular. Like that seems to be, you know, it's like the wisdom always comes as, like, advice on how to, you know, how to find the good woman or how to. How to live your life, how to deal with money. Like, that's how wisdom comes. But it's patterning something which is above, you know."}
{"episode_id":"SW - #114 - 2020-08-28 - John Vervaeke - Original Sin and the Meaning Crisis","start":2338.25,"end":2407.96,"speaker":"John Vervaeke","text":"Yeah. Aristotle has that with Sophia and Phronesis being brought together. Right. Sophia is your grasping of these universal and profound principles. And then phronesis is how do you make them contextually relevant in a contextually sensitive manner? So this now brings me back around then. It sounds like this deeper reflection on. Well, let's use the word sin for now. This deeper reflection on sin affords us what might be missing in what we're seeing in the demonstrations. And this is part of my concern that you talk about inclusion as the sole value. I talk about something similar in that that justice is the sole virtue. And a very truncated sense of justice, the Greek sense of justice was always simultaneously external with others and internal with oneself. That's really clear. And what we have is a completely. We get a reduction of all the virtues to justice and then just the social aspect of justice, hence the name social justice."}
{"episode_id":"SW - #114 - 2020-08-28 - John Vervaeke - Original Sin and the Meaning Crisis","start":2408.04,"end":2415.49,"speaker":"Jonathan Pageau","text":"Yeah, we're not sure exactly what. What that justice entails in terms of its particular. Like how it's going to manifest."}
{"episode_id":"SW - #114 - 2020-08-28 - John Vervaeke - Original Sin and the Meaning Crisis","start":2415.73,"end":2452.57,"speaker":"John Vervaeke","text":"Well, that goes to the point I want to make because I have a concern that we are losing the other virtues. I mean the Greeks had at least the cardinal four and then the Christians had the next, the sacred three. And so we at least have seven we should be talking about. Right, we at least have seven we should be talking about. And we were just talking about one. One of the ones that's considered something like a meta virtue, which is wisdom. You know, I shared the, what I think one interpretation of Socrates that Socrates saw that each virtue was a way of being wise in a particular situation. The virtues aren't separate things."}
{"episode_id":"SW - #114 - 2020-08-28 - John Vervaeke - Original Sin and the Meaning Crisis","start":2452.57,"end":2453.13,"speaker":"Jonathan Pageau","text":"Yeah, of course."}
{"episode_id":"SW - #114 - 2020-08-28 - John Vervaeke - Original Sin and the Meaning Crisis","start":2453.13,"end":2487.22,"speaker":"John Vervaeke","text":"Particular ways of enacting. And so to me, if that argument is good, and I think it's a good argument talking about justice without having concern for wisdom seems to me to be like really, really almost oxymoronic. It seems to be self contradictory, self undermining. And that's a very dangerous kind of thing to be for human beings to be embracing. Embracing committing yourself deeply to something that is self undermining in its foundations is a very problematic thing to do. What do you think about that as a professor?"}
{"episode_id":"SW - #114 - 2020-08-28 - John Vervaeke - Original Sin and the Meaning Crisis","start":2487.22,"end":2584.28,"speaker":"Jonathan Pageau","text":"No, I totally agree and that's why it's one of the reasons because the idea of justice seems to have something to do with equality, although it's ill defined as well. Like what exactly do we mean by equality? And what. Because obviously equality is a strange term because you need a category to declare equality. Because you can't have equality in everything, because then everything would just be the same like it. So equality is a complicated term and so it seems like you know, it's like, what is it? The intersectional. It's like the diversity, equity, inclusion, right? Those are the three kind of values that kind of mesh together in this idea of justice. And so the difficulty is, of course, that the revolutionary aspect of it is what you also talk about in the sense of it undermining itself. It ends up eating itself, and it ends up eating itself by its very mechanism, which is that. I hate to say it this way, but it's inevitable to come to the fact that there is no such thing as equality, right, in terms of actual equality. Because what does it mean? Like, everybody's smarter, stupider than others, Some are taller, some are shorter. And it's individually true. And it's true in different categories and different cities. It's like there's difference. You can't have equality. And so this, like, weird desire for equality ends up being. Ends up being a kind of power play, it seems. Not. Not really a desire for equality, but a desire for power."}
{"episode_id":"SW - #114 - 2020-08-28 - John Vervaeke - Original Sin and the Meaning Crisis","start":2585.64,"end":2811.42,"speaker":"John Vervaeke","text":"So I wonder if there's something going on here, a kind of displacement, because. And this. This is going to be really. You have to move very carefully here. So I think what people want to do. Sorry, that sounds pompous, but it's hard to talk. It seems plausible to me to propose that what people want to do is reduce the suffering of pain and distress. And then they're making a claim that most suffering is just distress, or maybe all is caused by inequality. And of course, there is truth to that. When resources are not being distributed as fairly as they can, and fairness is not the same thing as equality. This is part of the problem, because justice is also supposed to be about fairness, not just about equality. And so when we cause unnecessary suffering. So let me try and give you a bit of a slight riff on this. I see the left as really sensitive to the fact that human beings are. I'll use a Greek term here, but you'll find a Christian analog, I'm sure that human beings are really subject to fate, that there is just shitty things that happen to human beings because they're finite and they're limited and the world is an overwhelming machine. And there's historical forces and material forces. You know, you might even say powers and principalities at work, right? And people are just subject. Right? And that we have to do. And that people therefore deserve our aid, even if they haven't earned it. Because if we don't do that, we are. And this is like the aspect of synagogue, we're ignoring the fact that we are finite and we are subject to forces beyond our control. The left gets that, and I think the right tends to forget that. And that's why the right often comes off as cruel. But what the left forgets is what the right is. No matter how haphazardly they do it and stupidly they do it, is the right tries to remind people that even though we are subject to fate and people should be aided beyond what they deserve or have earned right, human beings are nevertheless also responsible. They need to culture virtue, because every human being is beset by self deception. And the only person that can get out of self deception. I can't get you out of your own self deception. I can give you guides, but you have to go through it. Like, you have to go through it. I can't do that for you. Right. So to put it in a slogan, you know, the left remembers fate and forgets virtue, and the right remembers virtue and forgets fate. And so what I'm trying to get at is how could we change this discussion about justice so that we could put it back into what it was supposed to be paired with, which was Sofrasa. Right. We pursue the external justice of trying to reduce the suffering of others that are caused by history. And fate has to always be counterbalanced by sophrosyn, the cultivation of the inner justice, of virtue, and that those. For the Greeks, it was axiomatic that you had to talk about those two things together. Somehow we have gotten to the point where we only talk about one side of this. And I find that also a very lopsided thing. Sorry, that was a long thing to say. But, you know, you're a de thinker and I want to give you a lot to wrestle with."}
{"episode_id":"SW - #114 - 2020-08-28 - John Vervaeke - Original Sin and the Meaning Crisis","start":2811.77,"end":2834.89,"speaker":"Jonathan Pageau","text":"Yeah, well, it seems like the way that at least when I look at the way that things happen in the Bible and kind of the way the emphasis that Christianity has put on it is obviously, Christianity is obviously very, very preoccupied with the poor. Preoccupied with the poor in the broadest way you can interpret that. And those that have less and those that have little."}
{"episode_id":"SW - #114 - 2020-08-28 - John Vervaeke - Original Sin and the Meaning Crisis","start":2835.61,"end":2836.01,"speaker":"John Vervaeke","text":"Right."}
{"episode_id":"SW - #114 - 2020-08-28 - John Vervaeke - Original Sin and the Meaning Crisis","start":2836.73,"end":2985.35,"speaker":"Jonathan Pageau","text":"Whether it's, you know, whether it's the poor in terms of their own, let's say, spiritual poor, or it's poor, even physically, in terms of their material poor, or it's the sick or it's those that have no recourse, like the widow and the orphan. This is something that Christianity is extremely concerned about. But the way that Christianity seems to have concerned itself about it mostly is to ask those who have to give right to put responsibility on those who have to care for those who need to be cared for rather than tell those who are lacking to go get theirs, right? To like to take it from those who have it. And that's really the difference between the revolutionary mindset and the Christian mindset. And some people might say, well, why, why can't it happen? Like why can't those that have less just take, right, take, take it back. And the reason is because. The reason is very practical reason. It's because it's a self defeating pattern. Yes, the pattern which will, which will destroy itself. Because there's always someone who has less than you and there's always someone who will be there to take from you, even though you think you are the one who, you're the one who has less. And so you take from that one above you, but there's always someone below you who has less than you and will take from you. And as soon as you take from that one above you the power especially then you become the one who is now in the, you know, who's going to be shot. Like the story of Robespierre is obviously the most classic example of that happening. And so that seems to be the way that Christianity deals with it. And there are consequences if you don't. And the consequences need to be kind of put in the right position. The way I kind of say it is I don't excuse the peasants for killing the King, right? But I still think it's partly the King's fault, right? It's still because the King didn't care for the peasants that the peasants ended up killing him. And I'm not justifying the peasants actions, but I am saying that if you don't care for the poor, at some point it's going to happen. Like the people will come and take theirs if you don't care for them. But it's not morally justified that they do. I don't know if that makes sense."}
{"episode_id":"SW - #114 - 2020-08-28 - John Vervaeke - Original Sin and the Meaning Crisis","start":2985.75,"end":3040.31,"speaker":"John Vervaeke","text":"No, it does. I get what you're saying, but what I was trying to. Well, maybe this is a way of bringing it back. I'm trying to get to this notion that isn't just about equality or even equity. I'm trying, like, yeah, you know, you're right. Jesus does both. You see, Jesus and the Buddha both. And what's interesting is they both do this, they both criticize equally. Something like cruelty and something like hypocrisy. Right. And so what I'm saying is what we're trying to bring in here as we're trying to encompass the nature of human beings is that the notion of social justice, especially if it becomes just the pursuit of equality, does not have the machinery to deal with it. Jesus and the Buddha are neither left nor right. Like it doesn't make sense to talk. Right. Yeah, exactly."}
{"episode_id":"SW - #114 - 2020-08-28 - John Vervaeke - Original Sin and the Meaning Crisis","start":3040.47,"end":3041.83,"speaker":"Jonathan Pageau","text":"It doesn't make sense at all."}
{"episode_id":"SW - #114 - 2020-08-28 - John Vervaeke - Original Sin and the Meaning Crisis","start":3042.39,"end":3125.8,"speaker":"John Vervaeke","text":"Exactly Right. And so the point is, in a very profound way, they're kind of. It's not that they're non political, but if you'll allow me, they're meta political. Oh yeah, right. They're trying to get at what are the values or the virtues people should be aspiring to that are the most responsible and I mean both senses of the word, responsible to human nature. Right. That's what I see them doing. And that's what I'm not seeing in this movement. I'm not seeing the wisdom of, you know, like we said, of trying to balance these things together, of getting a deep understanding of human nature. I'm hearing a very, very superficial theory about human nature and human history and human culture. And I don't think that the version of justice. Justice is what really concerns me is this version of justice. It sounds so easy. And that to me means it's got to be wrong. Because I mean, what I get from all the great philosophers is justice, real justice. I mean, John Rawls writes this huge book, right? Like real justice is hard. It's really hard because human beings are so incredibly complex and they have, as we've been talking about here, these, you know, these opposing forces and poles at work in them. That was the point I was trying to make."}
{"episode_id":"SW - #114 - 2020-08-28 - John Vervaeke - Original Sin and the Meaning Crisis","start":3125.8,"end":3210.2,"speaker":"Jonathan Pageau","text":"Sorry, you're totally right. And I think that, like, if you look at this, if you look at how Christ deals with it, it's interesting because, you know, we talk about responsibility and you can see that in. You can see the way that Christ talks about, like he talks to the Pharisees and he says, you're a bunch of hypocrites. And he talks to woe to the rich if you don't care for the poor. And woe to, you know, and blessed are those who are poor, for they will receive. And all of this, like there's all this in his. But he also has several parables where he talks about the poor who don't care for what they have and the consequences of that. Like, he also has that. He also has the parable of the talents, where he talks about the servant who receives something and doesn't make it fruitful and therefore has to face the consequences of not making fruitful that which he has. And so Christ talks at all Levels at the same time. You know, I always say, like you said, he's meta political. He's a judge and a victim. He's the king and the servant. He's all these things at the same time in a very paradoxical way. And so he kind of transcends politics. And it's interesting to watch politicians, the politically minded, because they see in Christ a kind of weird mirror of themselves. So the people on the left see Christ as a kind of revolutionary figure, and the people on the right see Christ as get your act together type figure. It's like. Well, you know what? It's neither of those really."}
{"episode_id":"SW - #114 - 2020-08-28 - John Vervaeke - Original Sin and the Meaning Crisis","start":3210.68,"end":3213.16,"speaker":"John Vervaeke","text":"Yeah, I think that was very well said, Jonathan."}
{"episode_id":"SW - #114 - 2020-08-28 - John Vervaeke - Original Sin and the Meaning Crisis","start":3214.36,"end":3230.2,"speaker":"Jonathan Pageau","text":"So there's what to do with this. What to do with this. This weird. The way that I think the way to understand it. And you know, you talked a little bit in our, before our conversation started about the inevitability of religio. And I think that's really the way."}
{"episode_id":"SW - #114 - 2020-08-28 - John Vervaeke - Original Sin and the Meaning Crisis","start":3230.36,"end":3303.54,"speaker":"John Vervaeke","text":"That'S exactly where I wanted to go. This whole discussion seems to be pointing. Right. It's making a very, I think, plausible argument about the inevitability of religio, the unavoidability of religio in human endeavor. And you made. And human existence. And you made this point, and I wanted to give you the opportunity to expand on it. You made a point of criticizing the new atheists and how they were sort of saying if we could just get rid of religion, you know, and what they did is, you know, they identified religion with a, you know, belief in the supernatural, etc. Etc. And if we just got rid of those false beliefs, then that would be it. And then your point is. Well, the people that are in these marches, they're not advocating anything necessarily supernatural, something perhaps transcendent, but not supernatural, etc. They're not doing well. But nevertheless, look at the religious behavior. Look at how comprehensive and powerful it is and look at how much it's a response to the way the COVID crisis accelerated, the meaning crisis. And you made that. And it was sort of a very brief thing. It was about two or three minutes in the video. But I wanted to give you, and I think this is a good context, you and I in discussion. I wanted to give you the opportunity to expand on that."}
{"episode_id":"SW - #114 - 2020-08-28 - John Vervaeke - Original Sin and the Meaning Crisis","start":3303.78,"end":3471.58,"speaker":"Jonathan Pageau","text":"Yeah, well, my criticism of the new atheists, you know, and I would use Steven Pinker as the main example just because of the kinds of books he's written and the kind of statements he's made about enlightenment and this kind of progress and everything is that And I think that what you're doing is a much better, like the Cogsci approach and the cognitive science approach is a much better approach to this because there is an understanding of what a human being is in a deeper way, and there's an understanding of the reasons why we have certain patterns and the reason why certain things exist within us. And what the new atheists seem to want to do is to see the advantage of reason and then want to kind of box the human being in reason and see everything which is outside of reason as the thing to get rid of, as the bad thing to get rid of. There's our original sin is everything that's outside of reason needs to be eliminated. But the problem is that you can't eliminate it, you know, and, and there's a kind of weird utopian vision. And the example I always use is the example of sleep, you could say, and reason and, and, and awakeness, you know, and the idea of kind of this, more this other aspect of us in sleep, it's a good way to understand it. It's as if I told you you could be way more productive if you didn't sleep. Like, you just have to not sleep. And then you could be awake all the time. And wouldn't that be amazing? Like, then you would imagine how much progress you would make. Like, like imagine how far you would go if you would just stay awake all the time. But the reality is that you can't. That's not. Just not part of being a human being. And so these other patterns that we have are there. And so, and they're extremely important. And if you try to get rid of them, what they do is they kind of, they go down for a little while and then they come back like a monster and then will swallow you. And that's what were. Those are the kinds of things we saw in the, in the French Revolution, in the Russian Revolution, all the kind of end of atheist cycle where all of a sudden the patterns come back like a big monster to devour you. And now we're seeing very similar things as well. We're seeing a secular religious manifestation. And it's akin to the one we saw in the French Revolution, and it's akin to the one we saw in the Russian Revolution. And so, and I always want to say it's like the people who kind of made fun of Jordan Peterson talking about this. It's like it's happening right now. It's happening right now. Look at what's going on and you can just pooh, pooh it, you can toss it to the side, but it's the same pattern happening again. And the reason for the pattern is the same like the denial of. Sorry, I get excited and I throw myself."}
{"episode_id":"SW - #114 - 2020-08-28 - John Vervaeke - Original Sin and the Meaning Crisis","start":3472.3,"end":3473.26,"speaker":"John Vervaeke","text":"Me too, me too."}
{"episode_id":"SW - #114 - 2020-08-28 - John Vervaeke - Original Sin and the Meaning Crisis","start":3475.1,"end":3515.4,"speaker":"Jonathan Pageau","text":"The denial of certain aspects of the human person is going to come back. And so the idea is what do you do? Like how do you deal with it? And to me that's why I think that, that's why I think that have a conscious, having a conscious religious aspect to you. That's why ritual, conscious ritual is, is important because ritual will be there. You can't avoid it. Now the question is whether or not it's part of you integrated or, or whether or not you're a slave to ritualized behavior and kind of scapegoat and identity forming behavior that is just part of existence."}
{"episode_id":"SW - #114 - 2020-08-28 - John Vervaeke - Original Sin and the Meaning Crisis","start":3516.2,"end":3681.52,"speaker":"John Vervaeke","text":"I think that was very beautifully said. Yeah, I agree. I think the first point you made about the CogSci and all the stuff on relevance realization and those aspects that are pre rational and how primordial they are, the importance of ritual. So for those of you, I mean you're watching this video, you know this work and so there's arguments there and thank you Jonathan, for gesturing to them. And then as you, as you were building on that, I thought of this scene and you'll probably be able to riff on this because it's from mythology, it's from a science fiction classic, you know, Journey to the center of the Earth. And especially in the movie version, Count Sacknusson, who is the villain. You'll see how this connects in just a sec. They come to him and they say, well don't you sleep? And he said, I never sleep. I hate those little slices of death. And he represents exactly, just right. So the journey to the center of the earth, which of course has all kinds of mythic meanings attached to that. Right. But he's the villain. And notice how he brings together your analogy and how it connects back to an unwillingness to accept his humanness and his mortality. There's the hubris in here and his and that cycles us back again to this refusal to accept our humanity. It's ultimately it's again the same kind of, it's a puritanical kind of refusal to accept our humanity in a profound hubristic way. And that I think is what, when I talk to people who have sort of come out of the new atheist movement, one of the things that they'll often say that started putting them off was they got a sense of arrogance attached to these people. And you Know, and I'm not talking about. And part of it is, no doubt, personality, there's narcissism and. But I think they might also have been putting out their finger on this. The sense that, right, there are aspects of our humanity that are not being given due. And this is what I mean again about justice, Sophras and justice. Plato had this sense that you had to give all of the parts of the human their due. They had to be given their due regard, their due role, their due place. The attempt to eradicate was a deep mistake, right? And so the softness and the inner justice is we have to give due regard and due place and due role for all aspects of our humanity."}
{"episode_id":"SW - #114 - 2020-08-28 - John Vervaeke - Original Sin and the Meaning Crisis","start":3683.04,"end":3821.68,"speaker":"Jonathan Pageau","text":"If you look at the very first commandment or the very first place in Scripture where it talks about something which is holy is in the description of creation. And so you have six days, then you have the seventh day, which is the day of rest, and it's the day which is set aside for God, right? It's the holy day. And right there in Genesis it says, that's why we follow the Sabbath. Now, there's a mystery in that which is very profound. And the mystery is that it's exactly the mystery that the new atheists are incapable of seeing, which is that the way that the world is made, in the way that consciousness is made and the way that reason is made is because it's a patterning system. It can never encompass everything, right? It can be coherent, but it cannot be complete. And you need to leave a bit out for completeness to manifest itself like it's in its mystery. So you need to leave a bit on the edge that is not closed, that isn't tied up, that isn't accounted for. There has to be some aspects which are not accounted for. If you try to account for everything, that's the, you know, that's the. That's the, the most dangerous thing, right? It's the. And if you also try to see that which is accounted for as totality, which is the sin of Satan, which is the sin of pride, which is the sin of Adam, that's the hubris. And then you fall because that aspect which is supposed to be unaccounted for, which you're trying to ignore, is still there, right? And the fascinating aspect of that margin, or let's say the seventh day, is that it has two parts to it. It has a part which is the unfathomable of creation, the completeness of creation. But it also points to the infinite. There's a secrecy in it which Also points to the infinite, which is why it's both the day of rest but also the day set aside for God at the same time. So it's both death and the source of life at the same time."}
{"episode_id":"SW - #114 - 2020-08-28 - John Vervaeke - Original Sin and the Meaning Crisis","start":3823.12,"end":3902.41,"speaker":"John Vervaeke","text":"That's very interesting, your invocation of Godel. I mean, I take Godel's theorem that you can't have it both complete and consistent to be an example of what I meant earlier by mortality. That's the mortality in the heart of any epistemological project or, you know, Heisenberg's uncertainty. That's the mortality in the heart of any empirical observation or investigation. And more and more of these. Right. And the, the history of philosophy over the last two centuries have been philosophy and science. At least the more philosophical aspects of science have been the discovery of this. I like your invocation of it because it brings me back around. And you know, I don't know if you're doing it deliberately, but you're invoking. I heard Levinas when you were comparing totality to infinity because he has a book around that. Right. And how infinity is not the same thing as totality because totality is the pretense that you have both consistency and completeness. That's my way of understanding it. And therefore, like, if you take the Godel's argument seriously, and you should. Right. That is always a dangerous pretense. And that the problem with any system that claims to be complete and consistent is that it is actually a deep form of self deception."}
{"episode_id":"SW - #114 - 2020-08-28 - John Vervaeke - Original Sin and the Meaning Crisis","start":3902.41,"end":3903.85,"speaker":"Jonathan Pageau","text":"Oh yeah, that's for sure."}
{"episode_id":"SW - #114 - 2020-08-28 - John Vervaeke - Original Sin and the Meaning Crisis","start":3904.98,"end":4000.41,"speaker":"John Vervaeke","text":"So I mean, and this is why, you know, this was. This is the great. For all of the criticisms I have of them, this is the great thing that comes out of the whole pragmatism movement of James and Pierce and Dewey and more recent people, you know, like Quine and Davidson, and they've had a deep influence on me. I haven't had a chance to talk about them very much. I will in another series. But the point I'm trying to get to here is like, there's a shadow side of totalitarianism. There's a negative version of it, which is strategies of eradication, because eradication is an attempt to be completely consistent and complete. So there's an argument, and I'm not advocating for all of his ideas, but I just want to give due credit. Coleman Hughes makes this argument about, look, we all agree that murder is a deeply immoral act. And I'm not playing around with terms. Well, sometimes you kill, but when we say killing, that's not immoral. We don't call it murder. Murder is the name for the killing we regard as immoral. So let's not play that game. So we guard murder as immoral, but we don't pursue an eradication strategy in our society because if we were to eradicate. Try to eradicate murder, we would so subject ourselves to a radically dehumanizing totalitarian state. That. And that's why no culture anyway does it. Right. Every culture has prohibitions against murder. There's variations on it, of course, but you don't see them saying, and what we're gonna do is we're gonna set things up so that murder is impossible. You know, Philip, that's a Philip K. Dick kind of situation."}
{"episode_id":"SW - #114 - 2020-08-28 - John Vervaeke - Original Sin and the Meaning Crisis","start":4000.73,"end":4031.38,"speaker":"Jonathan Pageau","text":"Scary thing. No, and you're right about the strategies of eradication. These are extremely frightening because they do. They tend towards exactly what you're talking about. And I'm afraid that I see the same. You know, and I'm afraid that I'm seeing that right now with COVID I'm seeing exactly a falling into a strategy of eradication where we think that we cannot continue to live until this virus ceases to exist."}
{"episode_id":"SW - #114 - 2020-08-28 - John Vervaeke - Original Sin and the Meaning Crisis","start":4031.62,"end":4032.1,"speaker":"John Vervaeke","text":"Yes."}
{"episode_id":"SW - #114 - 2020-08-28 - John Vervaeke - Original Sin and the Meaning Crisis","start":4032.1,"end":4076.91,"speaker":"Jonathan Pageau","text":"This is not how. This is not how it works. This is a dangerous. Because the methods you will use to eradicate the virus, the totalitarian methods you will use, will be extremely harmful. They will be very, very harmful to our health, to our community, all of these things. And it's like the difficulty that you understand the desire to eradicate because it's a bad thing. This virus is a bad thing. You want it to go away. But once you enter into that strategy of eradication, especially with techno states where you. You are develop the power to push that capacity of eradication to its, you know, to. To limit that or not seen before. Yeah, it's a. It's a very, very frightening situation."}
{"episode_id":"SW - #114 - 2020-08-28 - John Vervaeke - Original Sin and the Meaning Crisis","start":4077.31,"end":4098.33,"speaker":"John Vervaeke","text":"A clear example of that is the proposal that we. We. We start tracking everybody's movement, every movement. Yeah, I see people. Do you really want the state to have that power? Do you really want the state to have that power? Do you. You really want the corporations to have that power? They already have that power to some degree, and they use it to manipulate you."}
{"episode_id":"SW - #114 - 2020-08-28 - John Vervaeke - Original Sin and the Meaning Crisis","start":4099.21,"end":4146.43,"speaker":"Jonathan Pageau","text":"Look, and I can't believe it. I saw a BBC article just a few days ago, and it was just like a regular article where they're talking about what the future of travel will look like. And in their description of the future of travel, they talked about vaccines with identification in the vaccine that they can scan your body so that. So that you. And this was a BBC article. It wasn't a conspiracy article. It wasn't like someone. It was like, this is what travel is going to look like. They'll scan your body to know whether or not you have the vaccine, and they'll let you participate in social things depending on whether or not they can track you. It's like my good. Don't you watch science fiction movies? I don't know. Am I the only one who watches science fiction movies?"}
{"episode_id":"SW - #114 - 2020-08-28 - John Vervaeke - Original Sin and the Meaning Crisis","start":4146.67,"end":4154.28,"speaker":"John Vervaeke","text":"Well, I watch them too. So, I mean. And we have to be careful here. So Covid is very bad."}
{"episode_id":"SW - #114 - 2020-08-28 - John Vervaeke - Original Sin and the Meaning Crisis","start":4154.52,"end":4155.16,"speaker":"Jonathan Pageau","text":"Oh, yeah."}
{"episode_id":"SW - #114 - 2020-08-28 - John Vervaeke - Original Sin and the Meaning Crisis","start":4155.16,"end":4274.21,"speaker":"John Vervaeke","text":"No, no, no. I want to make an analogy here. Covid is very bad. And you should try, as much as we can ameliorate it, but with wisdom, toggling against over empowering the state and taking a dehumanized view or a simplistic view of human nature in order to achieve it. So we don't push for eradication. We push. We push for amelioration that doesn't cost us too much our humanity. Isn't that the same attitude we should take for how to deal with the very real evil of racism that we should try, which. And we should continue to try to ameliorate it, but we shouldn't. You know, I talk a lot about how you frame the problem. It is way more important than the method about actually solving it. Should we be adopting a mindset that is a totalitarian kind of eradication about something like racism? It strikes me that argument by analogy means there is a sense in which we can go too far on this. And that doesn't. I hope that doesn't make me a racist. And what I've seen is I saw the interview with Don Lemon and I forget the name of the actor. And he was trying to say he's a black guy. And he's right. He's trying to say. I'm just saying that some of the leaders of the movement are going too far, too extreme. That's all he was proposing. And he was treated with smugness and dismiss. And then this horrible argument by Lemon. Well, people accuse Martin Luther King of being too extreme. As if. Well, are you saying that. Because sometimes people have misused that word, that. That every time they use it, they're misusing it. That's a really stupid argument. Can we have a better argument, please? And it's like, if we can't even bring up the question that we might be framing the attempt to achieve a goal, a laudable goal that I fully support, then I think we're in a very, very bad place. I think we're getting into a very bad place."}
{"episode_id":"SW - #114 - 2020-08-28 - John Vervaeke - Original Sin and the Meaning Crisis","start":4274.29,"end":4285.37,"speaker":"Jonathan Pageau","text":"Yeah. And you're right, because one of the things Covid did was awaken in us this. This. This pattern of infection. Right?"}
{"episode_id":"SW - #114 - 2020-08-28 - John Vervaeke - Original Sin and the Meaning Crisis","start":4285.37,"end":4285.81,"speaker":"John Vervaeke","text":"Yes."}
{"episode_id":"SW - #114 - 2020-08-28 - John Vervaeke - Original Sin and the Meaning Crisis","start":4285.97,"end":4291.81,"speaker":"Jonathan Pageau","text":"And it awakened in us the pattern of infection and the desire to exclude and eradicate."}
{"episode_id":"SW - #114 - 2020-08-28 - John Vervaeke - Original Sin and the Meaning Crisis","start":4291.81,"end":4292.37,"speaker":"John Vervaeke","text":"Yeah."}
{"episode_id":"SW - #114 - 2020-08-28 - John Vervaeke - Original Sin and the Meaning Crisis","start":4292.45,"end":4306.45,"speaker":"Jonathan Pageau","text":"And now it's being politicized. Like, not. Not the COVID Like, it's weird because you can see that there's. There's no. Like, there's no narrative connection between Covid and the Floyd, but there is a pattern connection."}
{"episode_id":"SW - #114 - 2020-08-28 - John Vervaeke - Original Sin and the Meaning Crisis","start":4306.45,"end":4306.85,"speaker":"John Vervaeke","text":"Yeah."}
{"episode_id":"SW - #114 - 2020-08-28 - John Vervaeke - Original Sin and the Meaning Crisis","start":4306.85,"end":4312.33,"speaker":"Jonathan Pageau","text":"And you can see that in the. That it's awakened the pattern, and it's playing out in the political sphere."}
{"episode_id":"SW - #114 - 2020-08-28 - John Vervaeke - Original Sin and the Meaning Crisis","start":4312.49,"end":4356.24,"speaker":"John Vervaeke","text":"Well, I mean, isn't that a case. Again, I'm talking at the latent level, not the manifest level. But that seems like a case, you know, it's like a clear case of what a psychodynamic person would call displacement. Right. That you're being. It's like you're. Covid puts you like you're suddenly in the Old Testament. And I don't mean that pejoratively. Right. But, you know, you have this ubiquitous threatening things out there in the world, and you have to adopt this very, you know, very, you know, insular purity code. And then you don't know when it's gonna strike you. And then. Right. And they might be infected and, you know, and then. But now what we can do is we can't. We couldn't do anything about the COVID But I think what your suggestions. But I can do something about this over here."}
{"episode_id":"SW - #114 - 2020-08-28 - John Vervaeke - Original Sin and the Meaning Crisis","start":4356.4,"end":4371.78,"speaker":"Jonathan Pageau","text":"Can do something about. Yeah. And the danger of the racist thing is the limit of it. Cause the limit is. The problem with racism is that it's an invisible thing in the sense that it ends up being thoughts and feelings and people."}
{"episode_id":"SW - #114 - 2020-08-28 - John Vervaeke - Original Sin and the Meaning Crisis","start":4372.26,"end":4372.74,"speaker":"John Vervaeke","text":"Yes."}
{"episode_id":"SW - #114 - 2020-08-28 - John Vervaeke - Original Sin and the Meaning Crisis","start":4372.74,"end":4411.99,"speaker":"Jonathan Pageau","text":"And the idea that you can reprogram someone and that you can move towards the eradication of thoughts and feelings. I mean, we know where that leads. Like, we know where that goes. And because it can't happen then, like we said, like I said before, but it's going to end up looking like it's scapegoating where we're going to choose some. We're going to find examples that we can drag out in public and, you know, and have struggle session watch struggle sessions and have them be humiliated in public so that we can deal with the problem of eradicating something which is. Which is unconscious bias. Like, it's unconscious. So you can't. How can you eradicate it?"}
{"episode_id":"SW - #114 - 2020-08-28 - John Vervaeke - Original Sin and the Meaning Crisis","start":4413.03,"end":4427.06,"speaker":"John Vervaeke","text":"Well, I think trying to eradicate that Is, I mean, given what we've argued, isn't that the same? It's ultimately committing you at some level to eradicating the machinery of humanity."}
{"episode_id":"SW - #114 - 2020-08-28 - John Vervaeke - Original Sin and the Meaning Crisis","start":4427.14,"end":4427.7,"speaker":"Jonathan Pageau","text":"That's right."}
{"episode_id":"SW - #114 - 2020-08-28 - John Vervaeke - Original Sin and the Meaning Crisis","start":4428.02,"end":4429.38,"speaker":"John Vervaeke","text":"Right. And so."}
{"episode_id":"SW - #114 - 2020-08-28 - John Vervaeke - Original Sin and the Meaning Crisis","start":4432.5,"end":4528.22,"speaker":"Jonathan Pageau","text":"Let'S say that this is. I've been more and more attracted to Renee Girard in the past year, I would say, you know, just because of everything that's happened. And I've been seeing that his analysis of the situation is really one of the wisest in terms of the way that he interpreted what's happening and intersectionality. I mean, he passed away, I think around 2010 or maybe a bit later. You know, he talked about, I saw a quote of his in 2007 where he talked about the machine of Antichrist which is ramping up. And he saw exactly what we're seeing. He said it'll be infinite victimhood looking for infinite sin, scapegoat. And so it's like this perpetual wheel of victimhood which is looking perpetually for more and more scapegoats and like, almost like a self devouring machine. And so we're seeing it that the solution is like, I hate to. I know you dislike when I push it too far, but the solution is the image of the scapegoat being the murderer and this and the victim at the same time. Like identifying with Christ and identifying with those that killed him. Identifying with the capacity to exclude and the reality of also being excluded to a certain extent. Like those two things together, if you can kind of, you can integrate them properly and not in a weird disorderly manner, can help you have compassion for those who are excluded, but can help you also understand that you are one of those who do that all the time. Yes, you're always doing it, but this."}
{"episode_id":"SW - #114 - 2020-08-28 - John Vervaeke - Original Sin and the Meaning Crisis","start":4528.3,"end":4634,"speaker":"John Vervaeke","text":"Is what I meant. I think there's power in Gerard's argument. I've only read the one book, and not completely the one I saw Satan fall like lightning. But the idea that you can explode, if you'll allow me to use some of my terms, you can explode the cultural cognitive grammar of scapegoating and that the Christian mythos does that. I thought that was one of the most powerful arguments. And it's a new argument, as far as I know, one of the most powerful apologetic arguments for Christianity that I had heard in quite some time. So I think that is a good point that you brought up. But I think it's situated within this larger past, again, which we keep coming back to, of trying to get to a place where we can simultaneously accept faith and virtue. Because one of the ways in which you can. Right. One of the ways in which you can address people's thoughts and feelings is by inspiring them to aspire to virtue. Rather than trying to eradicate, you can try to inspire the aspiration to virtue. And this has been, to my mind, you know, a very, very successful strategy where I've been talking a lot recently and Akira, the dawn, did the meaning wave about it, about stealing the culture? I actually use Christianity as a primary example of that, that Christianity doesn't try and overthrow the political structure. What it does is it steals the culture. It creates an entirely different culture from the bottom up. And then. Because the problem, to my mind, what the French Revolution shows is you can radically transform the state, but if you don't transform the underlying cultural cognitive grammar and normativity, nothing is fundamentally going to change."}
{"episode_id":"SW - #114 - 2020-08-28 - John Vervaeke - Original Sin and the Meaning Crisis","start":4635.12,"end":4637.72,"speaker":"Jonathan Pageau","text":"Yeah, you just change the. You just change the ones who are."}
{"episode_id":"SW - #114 - 2020-08-28 - John Vervaeke - Original Sin and the Meaning Crisis","start":4637.72,"end":4706.93,"speaker":"John Vervaeke","text":"Holding the reins and you circulate the elites. And so whereas what Christianity does is it builds a new civilization. Buddhism does the same thing. Right. It builds a new civilization. Islam does the same thing, it builds a new civilization. And so that brings us. And we don't have much time, I suppose, but that brings me towards the third point. You said you sort of despair of knowing what to do. And I'm wondering if you. Sorry, I realized I might be daring the preposterous thing of proposing some sort of a Christian thing to a Christian, which is a ridiculous thing. But I gave you all of those examples, to my mind, of the idea of, well, isn't the response to do as much as we can to engage in building the next culture? And that sounds preposterous, but a commitment to that kind of thing seems to me to be the most responsible response to the depth of the situation we are in right now."}
{"episode_id":"SW - #114 - 2020-08-28 - John Vervaeke - Original Sin and the Meaning Crisis","start":4707.17,"end":4815.46,"speaker":"Jonathan Pageau","text":"Yeah, no, I think so. I think. I mean, I would say on a personal level, it's just. I mean, love God, love your neighbor, is a pretty, pretty good thing to live by in the immediate reality and not abstract categories. To deal to love the people that you encounter with, to see in them the face of God is something that will transform at least your life. It's harder in terms of like a social responsibility, for sure. Myself, the way that I frame it. That's why I'm doing what I'm doing. What you said is that I'm trying to help people see the grammar of culture or see the pattern. And of course, one of the things I've been emphasizing the most is the importance of the margin. And talking about the margin in a balanced way, so that you neither have the desire, because both sides want to eliminate the margin. Everybody wants to eliminate it. They want to eliminate the margin either by making it the same as the center, by integrating all the marginal aspects and making them equal to everything else, or by eradication or by cutting it off. And that's the real problem with the like. It's the question we had during the first wave of violence of the 20th century. You had two sides. You had one side which wanted to create equal utopia and one which wanted to create a hierarchical utopia that cut off the margin, that burned it off. And so. And we're facing the same. It's like we didn't deal with it. We're facing the same problem now. And we're seeing the one side now. We're seeing the. We're seeing the side that wants everything to be equal. But I always tell people that when the Nazis came to Germany, they were on the verge of a communist revolution."}
{"episode_id":"SW - #114 - 2020-08-28 - John Vervaeke - Original Sin and the Meaning Crisis","start":4815.46,"end":4816.02,"speaker":"John Vervaeke","text":"It's not."}
{"episode_id":"SW - #114 - 2020-08-28 - John Vervaeke - Original Sin and the Meaning Crisis","start":4816.76,"end":4822.76,"speaker":"Jonathan Pageau","text":"The pendulum doesn't move in one direction. The pendulum swings. And it's a scary thing to watch."}
{"episode_id":"SW - #114 - 2020-08-28 - John Vervaeke - Original Sin and the Meaning Crisis","start":4823.72,"end":5043.46,"speaker":"John Vervaeke","text":"But this is part of the way in which, again, the way in which this lack of. The lack of a dynamical nuance in thinking. So Leo Ferraro and I talk about this idea that in living systems and you see opponent processing, and I've argued, right, and that what an opponent processing means. This is the way you deal with trade offs. And we've been talking about trade offs all the way through, right? You have opponent processing, like your parasympathetic and sympathetic nervous system, like the sympathetic nervous system is biased. It tries to interpret everything as a threat or an opportunity and it arouses you. And the parasympathetic system is biased and it tries to interpret everything as a signal that you should relax and calm down. And they're working, their biases work in opposite direction, but they're functionally integrated together because that's how you get the most self corrective system. And what we were supposed to have. You can see this in Dewey, right, Because we're supposed to have a point processing, but what it's devolved into is adversarial processing. And this is the eradication idea. It says zero now. It's a zero sum game. I've given up the idea of self correction. I've given up the idea of commitment to a process that you and I, even though we disagree, we can commit to, like you and I do in dialogue. We have disagreements, but we see the potential that we can correct each other in valuable ways that we mutually appreciate. There was that commitment, and that commitment to that process has been lost. Like the fact that most Americans are more distrusting of the opposite party than they are a foreign threat. Like, what the heck does that mean? Right? What, like, what does that mean to you? Like, like. And so the adversarial eradicate the other, destroy the other. Zero sum game mentality, I think, has made. The process, I think, is broken. I think the process is broken. And so I don't, I don't know, I don't see how. I mean, and Lehman, Pascal and others, they disagree with me on this. I don't know how to work within that, in a way. And so that's what I mean by steal the culture. That I don't know if working within that machinery is a viable strategy. I think the strategy has to be. Jonathan, I was at a conference two weeks ago called the Movement Summit, and there's all these communities of practice springing up everywhere, trying to integrate mindfulness and movement practices and discourse practices. And so many of them, and you know, these people, and they're all, and they all want to talk to each other and they want to network. And it felt very different. This is, it felt very. It was neither, you know, the revolution of the left or the law and order of the right. It was orthogonal to that. And it was these people trying to seriously time and talent and money and energy and commitment to the cultivation of wisdom and a deeply alternative way of being. And to my mind, that's where. And I know you think it should be given a particular Christian slant, but I also think you're charitable enough to include other people of good faith who are willing to work with you. I think that's where the answer is to the more difficult problem lies. I think there is stuff actually happening right here, right now, culturally, symbolically, existentially. That is where the diff, the difference that is needed is starting to be generated."}
{"episode_id":"SW - #114 - 2020-08-28 - John Vervaeke - Original Sin and the Meaning Crisis","start":5044.34,"end":5058.84,"speaker":"Jonathan Pageau","text":"But I for sure agree. I think that the seeds of the, like, a way to see it is like that. This is horrible because it has bad implications. But like the seeds of the next world will appear in the current one, right?"}
{"episode_id":"SW - #114 - 2020-08-28 - John Vervaeke - Original Sin and the Meaning Crisis","start":5058.84,"end":5059.2,"speaker":"John Vervaeke","text":"Yes."}
{"episode_id":"SW - #114 - 2020-08-28 - John Vervaeke - Original Sin and the Meaning Crisis","start":5059.2,"end":5113.66,"speaker":"Jonathan Pageau","text":"Like, they, they're just hard to see. You know, the little sprouts are hard to see because everything else is burning in the forest. Right? So it's, it's difficult to see the, the seeds as this is kind of breaking apart. And, and I mean, I'm curious to see how all of this will be integrated. I do, I do. Again, like you Know, we. We've talked about this before. Right. So we're not going to come to a conclusion. But I do. I do think that there is a need for a narrative cohesion. And I do think that until. Until something happens in the west, it's still. It's still the Christian narrative. So I don't. I don't see a way out of it for at least, you know, I don't see a way out of it, so. But I appreciate. I do think that the questions that people are asking and that the desire for wisdom and the desire for transformation is one which will bear fruit."}
{"episode_id":"SW - #114 - 2020-08-28 - John Vervaeke - Original Sin and the Meaning Crisis","start":5113.66,"end":5114.22,"speaker":"John Vervaeke","text":"It won't."}
{"episode_id":"SW - #114 - 2020-08-28 - John Vervaeke - Original Sin and the Meaning Crisis","start":5114.22,"end":5120.02,"speaker":"Jonathan Pageau","text":"It has to. If it's done with sincerity and done, you know, in a desire for transformation, it will bear fruit."}
{"episode_id":"SW - #114 - 2020-08-28 - John Vervaeke - Original Sin and the Meaning Crisis","start":5120.26,"end":5177.02,"speaker":"John Vervaeke","text":"Yeah. The point I'm trying to make is thank you for saying that. And, you know, from my part, I don't ever claim to have a foreclosure argument against Christianity. I always say that I do not have such a thing. But what I was trying to emphasize is there's not only sincerity, there's depth, like what's going on here. It has the appreciation for humanity and complexity. That's what I'm seeing in these people, in this movement. Of course, we're all flawed human beings. I'm not painting some utopic vision, but I'm talking about, you know, a real possibility and the acknowledgement that I think it's in existence. I like your metaphor for all the ways it's fraught, but I do like your metaphor of the seeds. I do like putting the two together, that the burning of the forest actually fertilizes the seeds in the way they need to be fertilized. And perhaps you were alluding to that and your wry smile."}
{"episode_id":"SW - #114 - 2020-08-28 - John Vervaeke - Original Sin and the Meaning Crisis","start":5177.26,"end":5181.42,"speaker":"Jonathan Pageau","text":"Yeah, but it's not a fun. It's not fun like it's not pleasurable."}
{"episode_id":"SW - #114 - 2020-08-28 - John Vervaeke - Original Sin and the Meaning Crisis","start":5181.74,"end":5223.01,"speaker":"John Vervaeke","text":"No. And it means death and suffering. And I have kids and I don't want this, but I want. And what needs to happen are not always the same thing. Jonathan. I think maybe this would be a good place to bring it to a close. So I proposed to you privately and you already agreed, so I'm going to do it publicly. I think that you and I and Paul should have a. Have a discussion like this. Dialogos, as I would call it, at length, for the three of us. And I'd like to invite you, and then I've also invited Paul. And let's. Let's try and work to make it happen, because I think it would be very beneficial for all of our respective Listeners."}
{"episode_id":"SW - #114 - 2020-08-28 - John Vervaeke - Original Sin and the Meaning Crisis","start":5223.33,"end":5226.61,"speaker":"Jonathan Pageau","text":"Yeah, that would be great. I would love that. Let's set it up."}
{"episode_id":"SW - #114 - 2020-08-28 - John Vervaeke - Original Sin and the Meaning Crisis","start":5226.93,"end":5277.35,"speaker":"John Vervaeke","text":"Okay. So I'll reach out to Paul and I'll try and make it happen. So I found. Well, you could see I got passionate, which means this was definitely dialogos for me. I always say that the difference between a dialogos and a monologue is both people find themselves adduced. They find themselves drawn to a place they couldn't get to individually on their own. And there's a kind of education in that that's very different from just sort of thinking in your own head. And so I always find that the case when I get into such a dialogue with you. And I wanted to thank you for it. You had so many, so many insightful and brilliant ways by which. So many insights and brilliant things you said. And. And not only what you said, the manner in which you said, the imagery that you used was itself often deeply helpful. So thank you very much. Thank you very, very much."}
{"episode_id":"SW - #114 - 2020-08-28 - John Vervaeke - Original Sin and the Meaning Crisis","start":5277.67,"end":5294.39,"speaker":"Jonathan Pageau","text":"Well, you know, I really. I always enjoy talking to you and I. And I really appreciate the insight you're bringing to the conversation. And I'm looking forward to seeing where this is going and kind of how this is slowly going to, let's say, play dance together is the best way to maybe to say it."}
{"episode_id":"SW - #114 - 2020-08-28 - John Vervaeke - Original Sin and the Meaning Crisis","start":5295.12,"end":5298.88,"speaker":"John Vervaeke","text":"I agree. I agree. Okay. So thank you very much."}
{"episode_id":"SW - #114 - 2020-08-28 - John Vervaeke - Original Sin and the Meaning Crisis","start":5298.88,"end":5300.64,"speaker":"Jonathan Pageau","text":"All right, John, it was good to talk to you."}
{"episode_id":"SW - #114 - 2020-08-28 - John Vervaeke - Original Sin and the Meaning Crisis","start":5300.8,"end":5303.36,"speaker":"John Vervaeke","text":"Good to talk to you. All right. Bye bye. Bye bye."}
{"episode_id":"SW - #114 - 2020-08-28 - John Vervaeke - Original Sin and the Meaning Crisis","start":5304.56,"end":5369.52,"speaker":"Jonathan Pageau","text":"I hope you enjoyed this episode of the Symbolic World. The Symbolic World is edited by Justin Ward and it is based on a series of videos that you can find on my YouTube channel, Jonathan Pageau's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by, of course, leaving a review on itunes. Everybody knows that's the best way to get the podcast out there, to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon Pajot videos as well and on SubscribeStar, all those links you can find on my website or in the show description. So thank you and I will see you soon."}
