{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":0.16,"end":62.61,"speaker":"Laura Diaz","text":"Tucson, the weight is over Mediweight loss. They're officially open on North Oracle road. That's right. No more counting down the days. You can walk in right now and start your journey to a healthier you. Hey, it's Laura Diaz from iheartradio and you can trust me. This isn't just another weight loss clinic. I know that because it's where I lost weight safely with real medical support. GLP1 medications. You can see them everywhere online right now. But the truth is your health shouldn't be a DIY project ordering these meds without the professional guidance. It can lead to dangerous mistakes, wrong doses, no oversight and serious risks. At mediweight loss. I got the same medication but with a customized plan, weekly check ins and a licensed physician guiding me every step of the way. And the cost? The same as those risky online options. Tucson, your moment is here. If you're ready to take control, feel better and lose weight the right way, mediweight loss is ready for you. Walk in, get started and see real results. Call or visit mediweightloss.com to learn more and book your free consultation today. That's mediweightloss.com dinner time."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":62.61,"end":89.95,"speaker":"Announcer","text":"It's more than just a meal. It's when work comes to a halt, where macaroni masterpieces are made and little moments turn into lasting memories. With the Blue Cash preferred card, you can get 6% cash back at US supermarkets so you can bring home the flavors that bring everyone together. We did say everyone. Make the special moments even more rewarding. Learn more@americanexpress.com Explore BCP terms and cash back cap. Apply with Blue Cash preferred."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":91.31,"end":119.13,"speaker":"Jonathan Pageau","text":"So people would say, what's the moral of the story? Right. And so that's what they want to ask when they listen to a fairy tale. And the truth is that there's something implicit which is more important than whatever moral you think you should get out of this story. There's some participation, some mirror of reality, something that is that is reflecting to you something precious and powerful and sometimes beautiful, sometimes tragic. But it's more than a moral."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":119.29,"end":141.13,"speaker":"Kendall Hoyer","text":"And that's where like it seems like that's the feminine thing. It's very elusive. It's implicit, not explicit. And the mistake people try to make is they try to. When you try to make the implicit explicit, I think that's when it gets into like propaganda territory. That's when it gets into like you're hitting people over the head with it and that, you know, if they want to hear a sermon, they'll go to church, you know, they don't want to hear it."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":152.81,"end":211.31,"speaker":"Jonathan Pageau","text":"This is Jonathan Pedro. Welcome to the symbolic world. So hello everyone. I am excited to be speaking to Kendall Hoyer. Kendall is someone who worked at Disney for many, many years and she's now co head of story at Skydance Studios. She is an animator, but mostly she is someone who does storyboard art. She, she kind of takes the ideas from the script and from the director and actually creates the basic bones of the, of the story that bring it all together. And so when you watch a movie she, that she's worked on, she's some of the scenes she'll have worked out in detail of what, how the characters react and where they are and everything. So it's a really a joy to be able to talk to someone like that and see how her thinking, storytelling, thinking, how she brings symbolism into that and her experience as an artist. So Kendall, thanks for coming to join me."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":211.79,"end":212.91,"speaker":"Kendall Hoyer","text":"Yes, it's my pleasure."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":213.31,"end":216.99,"speaker":"Jonathan Pageau","text":"So Kendall, maybe tell me a little bit about what exactly it is that you do."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":217.95,"end":287.94,"speaker":"Kendall Hoyer","text":"Oh, I'm a storyboard artist. So I work with the director and other storyboard artists to board out the movie. So I started, we storyboard out scenes and eventually those scenes get cut together to make a entire story reel of the movie. And it's almost like a comic book version of the movie. It's almost the blueprint of the movie before it moves to other departments like animation and lighting and layout and all these other departments that end up building the movie in production. So we, we watch our reels and we judge the movie, the story basically on if it's working, what's not working. And then we oftentimes tear it apart and rebuild it again like four months later. So we're in this constant. It's almost like rewriting. We're doing iterations of the movie to really try to hone in on the story and make it the best it could be. So that, that's my job is to like take the story but the script pages or description of moment in the movie and flesh it out with like. Because that is camera, environment, acting, character, like all that stuff."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":288.1,"end":295.54,"speaker":"Jonathan Pageau","text":"Yeah. Okay, so let's, let's say if I ask you this, like just to figure it out, what's the difference between you and the director?"}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":296.5,"end":365.73,"speaker":"Kendall Hoyer","text":"The director, he makes the final call. He makes the final call. So it's very, very collaborative, which is great. Like this is the same model that at Disney and at Pixar, it's like a very collaborative and some other studios, but Disney this is really the Disney Pixar model. And because the head of our studio, John Lasseter, came from Disney Pixar, he brought that model over here. It's great because you, it's kind of like the best idea in the room wins. It's very collaborative and creative. So the difference between me and the director is I don't have the final call. However, I. Sometimes we'll be like, is that what you really want? Or is that what we should do? Because remember that, that might contradict this, like, the hierarchy, the, the main story point, like, look. And I can point out to them, like, this isn't really, you know, jiving with this idea over here. And that's where, like, I might say, like, symbolic thinking is. Really has kind of honed my story senses because I'm like, I can kind of see how, you know, things are more hierarchical and I can see the pattern overall, you know, like, and it helps, it helps me. I feel like I already kind of had a story mindset because I, I."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":365.73,"end":367.61,"speaker":"Jonathan Pageau","text":"Discovered, obviously you were doing that before."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":367.93,"end":374.41,"speaker":"Kendall Hoyer","text":"I was doing that before I discovered you guys podcasts and stuff like that. But it helped a lot."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":374.41,"end":385.97,"speaker":"Jonathan Pageau","text":"Right. And sometimes it makes something implicit more explicit. Like, because you have these intuitions, it's not easy to explain them. And, and, and so sometimes it can give you tools to kind of understand intuitions."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":386.13,"end":403.73,"speaker":"Kendall Hoyer","text":"For sure. For sure. I think I can recognize things that are implicit quicker and, like, put my finger on them. You know what I mean? Like, because I, I, I'm like, oh, that's that. I can call it what it is where some people don't, they're just, they're not aware of those things."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":404.21,"end":416.91,"speaker":"Jonathan Pageau","text":"Yeah. And so in, in your job, that means that if you are working on a project, you have to, you have to adapt whatever you're doing to the style of the project and be able to draw the characters and be able to, like."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":416.99,"end":433.07,"speaker":"Kendall Hoyer","text":"Yeah, yeah, like, like if you were animating, you have to, like, be able to kind of draw them on model to serve. Although sometimes we don't have models for characters. We just have, like, that's going to kind of look like this. You're just like, oh, okay, just go for it."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":433.07,"end":436.11,"speaker":"Jonathan Pageau","text":"Right. If it's not a main character, I imagine they don't put as much time."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":436.43,"end":455.78,"speaker":"Kendall Hoyer","text":"I get. Yeah. So eventually these, these characters are modeled and then it goes to a different department, which is called from here, it goes to edit, and then it goes to where they take my boards and they put it together with sound and music and they make Like a story reel is what we call it. And eventually we will watch the whole movie in this form."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":456.26,"end":457.18,"speaker":"Jonathan Pageau","text":"Oh, really? Okay."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":457.18,"end":515.5,"speaker":"Kendall Hoyer","text":"Wow. Yeah. Multiple times we. We watch. Every couple months we watch them to judge if it's. The story's working. And that's how we kind of hone in on how the story is coming along to see if it's coherent. And then we bring in people from the studio to the other writers and directors. And also everybody in the studio gives notes. And with those notes we go, oh, this isn't working. There's a problem in this area. This isn't working. It's kind of like metacognition for the story, I guess, within the studio. And that's a very key thing. Yeah, yeah. So that's kind of like that way we can pinpoint the problem areas and sometimes we'll take people's suggestion. Most of the time people are like. Everybody is like pointing in the same areas where we see that something isn't working. And that's how, you know there's patterns in stories because everybody will almost always one rises to the surface, something is happening. It's always similar across the board."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":516.62,"end":528.86,"speaker":"Jonathan Pageau","text":"And so in some ways, the animation, you know, before you put in the massive amounts of. Of investment, you need to get it animated. You know what the movie's going to be. Pretty much, yeah."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":528.86,"end":586.04,"speaker":"Kendall Hoyer","text":"You're figuring it out. Although it's. It kind of simultaneous. Usually the schedule is. We get about. You get a couple iterations of scripts, scriptments, sometimes treatments, and then they go to boards and we get three screenings before things have to enter production. And that means when we'll. After like the third screening or so, they'll look at the movie and go, this scene is. Is working. And we don't foresee it changing too much in the future. Send that one to production. And there's all these other things that have to get done in production, like the models for characters have to get built, the sets have to get built. They all have to get designed first by artists and then they have to get built in the computer by a 3D artist. And then. Yeah, so there's. And there's all kinds of computer simulation tests and things that people working on all at the same time. It's very labor intensive."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":586.36,"end":595.24,"speaker":"Jonathan Pageau","text":"Imagine. Yeah. And so that means that sometimes you are working with, let's say, certain set designers that would have worked on some sets before. You're. You're going in."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":596.21,"end":640.99,"speaker":"Kendall Hoyer","text":"Yes. Well, yeah, they take it. So we kind of work with them. The director works with all the departments that's the difference between me and the director, too. Director is seeing it through all the way down the line from, like, color and design and camera work and all these things. Like, he's seeing everything through. But eventually these boards will get input and edit, and then the layout department will take kind of like what I did here. And they might not have the exact set I draw because I. I try to stay close to what we have. But sometimes I kind of just make things up. They'll try to get the spirit of what I'm doing and they'll. They'll set the cameras in the set because, like, within the computer, right, there's a digital set."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":640.99,"end":641.83,"speaker":"Jonathan Pageau","text":"It's already there."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":641.83,"end":674.74,"speaker":"Kendall Hoyer","text":"Yeah, already there. And they have the camera and they can place it and they lock off shots. And those locked off shots, then those go to the animators. And the animators do the performance on the character within those shots. And then from there it kind of other things happen, like effects and fur simulations and water simulations and lighting. Lighting is really important. And all these other departments that touch the shot before it gets done and usually gets much better each time. And when you see the final thing, you're like, whoa."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":675.86,"end":676.34,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":677.46,"end":677.86,"speaker":"Kendall Hoyer","text":"Wow."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":677.86,"end":705.24,"speaker":"Jonathan Pageau","text":"And so it's like the fact that it's so labor intensive and that there's no possible improvisational aspect to it. It's. It's surprising that you could have an animation by the time they put it out that has, like, bad stories in it. Like, how does that. Because you. Because you would think if you have people looking at it and you. They can actually see the story play out. Like, and these are professionals, wouldn't they know if it's a bad story? Like, wouldn't they be able to tell?"}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":705.32,"end":801.58,"speaker":"Kendall Hoyer","text":"I feel like they can kind of tell, but they don't know what the problem is. It's almost always a problem of not going deep enough with the, you know, theme essentially, like, what. What it's talking about. And they. You know how you talk about layers of reality? So, like, it. If, you know, the deepest levels here are the deepest levels. Higher, whatever. They're like, somewhere in the middle, and they don't know how to go to the next level of depth. That would unify the parts and lets parts fall off. Sometimes they get. People get caught up in, like, something that they're like, oh, but this is just so beautiful. But the story's about this. And I'm like, yeah, but when you have that moment in a movie that doesn't speak to the broader thing, the movie feels fractured and disjointed it's not all pointing to the same thing. Like the best movies. Right. Are firing on all cylinders in the sense that they all have. They're all pointing to the same thing. Right. Like, the story carries that. The theme. Right. But also then the. The set design, the lighting, all those choices are pointing to one thing. And. But if you get caught up somewhere in the middle and you want this sequence to be just really cool and whatever, but it's saying something different than what you have in your final conclusion scene, then it's like they're not. People are like, wait, what. What was that about? Oh, that didn't tie into this. Oh, okay. You know that. That tends to happen."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":801.98,"end":808.38,"speaker":"Jonathan Pageau","text":"Yeah. So people get, like. They like a certain bit of writing or like a little exchange, and they're not willing to sacrifice it to the."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":808.78,"end":809.18,"speaker":"Kendall Hoyer","text":"To."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":809.18,"end":810.86,"speaker":"Jonathan Pageau","text":"To the bigger. To the bigger whole."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":811.26,"end":846.49,"speaker":"Kendall Hoyer","text":"Or sometimes they. I think they can't see the bigger hole sometimes, or they can't. They think that one sentiment might be, like, the deepest there is. I think this comes from a materialistic perspective, too, because it's harder to perceive, like you said, to see the idiosyncrasies that are evident in exchanges or that are evident in a character's journey, but you're not. You can't. You can't. Like, you can't see it, you can't perceive it, or you. You don't see it in your own life, so you can't see it in. In the character's life. I don't know. It's just sometimes I notice people can't."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":846.49,"end":871.77,"speaker":"Jonathan Pageau","text":"See it, that they can't. Yeah. So they. They. So if you have, you know, have you. Have you had a moment, like, have you had moments where you worked on something and, like, you thought it was all good and whatever, and then later you look back at it and you thought, how couldn't. How did I miss this? Like, how did. I didn't see this weird thing about it? Or this, like, this bump or this, this, this."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":871.85,"end":883.45,"speaker":"Kendall Hoyer","text":"I mean, I. I haven't had as much say in other projects as the one I have now because now I'm at a position where I have more."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":884.97,"end":886.89,"speaker":"Jonathan Pageau","text":"You have more power now than you did before?"}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":886.89,"end":965.23,"speaker":"Kendall Hoyer","text":"Yeah, I have more access now to. To say something before when I was just a straightist and I would. I would say things, but it wasn't in the room all the time to, you know, truly try to get to the bottom of it. And sometimes it takes a while to get to the bottom of what something really is. About like, because the, how the process works is the director usually has a couple different ideas and they don't know necessarily what, what's at the base of those ideas. It's just like there's something intriguing about this, you know, and then the creative director or executive. Creative, executive producer, like comes in and says, okay, develop this idea out of the three. Like they pick one out of the three and they say go in this direction. And so they start to develop that and as they're developing it, they start to see kind of a story and they start to develop the world, the environment that the story is going to take place in and the other characters and, excuse me, the basic story structure. But they, I, I wouldn't say that they have the theme in hand and that kind of like, I think it's like when people say they write a book and like it, it starts speaking to them. It'll start speaking. It's just sometimes I don't think everybody listens fully."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":966.11,"end":1001.4,"speaker":"Jonathan Pageau","text":"But there's something about, you know, when we talk about these animated movies, there's something about the early Pixar movies that were, that seemed like they were really able to just, it's hard to explain it. Like they just had a mastery of storytelling and also of characterization. Also because they were doing animation, they didn't have to, the characterizations didn't have to be, you know, complex like you would in some, in, I don't know, in some Oscar winning, you know, movie. But the characterizations were, were captured so well. You know, like, it was hard, it was magical."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":1001.4,"end":1001.68,"speaker":"Kendall Hoyer","text":"Right?"}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":1001.68,"end":1043.7,"speaker":"Jonathan Pageau","text":"It's like the, the first Toy Story or Monsters Incorporated or there are these, these, these early Pixar movies where there was something about it when, when the story finished, you were really mesmerized by just how much airwell to capture. Even in terms of, you know, the, the way the, the movie, the story twisted and turned and how it kind of came back in the end and how all these threads ended up being brought back. The writing was just astounding. And so, yeah, so that's why, that's why like, in some ways they, they kind of ruined us for animation because it's as if it was the first blowout of, of real 3D animated movies. And they did such a great job that now like everything's measured at the light of these early Pixar movies."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":1044.58,"end":1103.81,"speaker":"Kendall Hoyer","text":"I mean, they were like the other good thing that they had for them at that time was like less pressure almost like, and let you know, like voices in the room. But maybe they're not in the room. You know, just let's top down bureaucracy for lack of a better word. You know, just like they were a small group and ideas could free flow and you know, they were like let's do it. You know, they like, you know, more taking chances and it's that kind of creative environment that you're going to have to like. It may come easy when you're small in a smaller studio and you, you've got something to prove. But as soon as you've proved something, that kind of pressure comes, you know, starts turning heads. Oh, I want a part of that or you know, and it starts to protect the creative environment you actually ask. You have to protect it to a certain degree actually."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":1104.21,"end":1146.66,"speaker":"Jonathan Pageau","text":"Right, right. I mean that's interesting to. To think about. You know, and it's interesting that in some ways you could imagine that some. A studio like Pixar ended up being the, the victim of their own success like you said, which is that they attracted so much attention, you know, bought by Gigantic, the biggest, biggest entertainment corporation. And then, then basically the stakes are so high now. Every time, every time you now every. These movies are so expensive too because the stakes keep getting higher that I imagine the pressure in the room is different from a bunch of, I don't know, like guys who finished college that are just going. You're just kind of just bouncing things off the wall until it totally sticks and, and bring it together."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":1147.46,"end":1170.56,"speaker":"Kendall Hoyer","text":"Yeah. I think there's probably different pressures when you're at that level than when you're at the top. And I think. And then you're at the top, there's more voices and more, I don't know, like money pressure and you know, expectation and things like that which can really kind of drag you, drag you down creatively. It's hard. Yeah. Yeah."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":1170.56,"end":1172.12,"speaker":"Jonathan Pageau","text":"So you would hope position."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":1172.12,"end":1173.32,"speaker":"Kendall Hoyer","text":"I'd never been a director."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":1173.64,"end":1174.76,"speaker":"Jonathan Pageau","text":"Yeah, yeah, I know."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":1174.76,"end":1179.72,"speaker":"Kendall Hoyer","text":"I can't imagine like the pressure that they, they hear, you know, that they."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":1179.72,"end":1186.76,"speaker":"Jonathan Pageau","text":"That they have to deal with. So hopefully you hope that they'll protect their creative crew so that they don't have to feel that heat so much that."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":1187.46,"end":1210.02,"speaker":"Kendall Hoyer","text":"And that's where somebody is to have a creative person in charge that under really understands the creative process. To kind of protect the creatives underneath them is really important. Like, you know, because the business side is the business side. You know, they're, they're businessy which they have to be, you know, that's important."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":1210.34,"end":1210.82,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":1210.9,"end":1222.6,"speaker":"Kendall Hoyer","text":"And do what we do without that side of it. But also there's a certain Aspect that you have to create. Create like a buffer or protection between the people just trying to be creative, you know?"}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":1222.6,"end":1270.98,"speaker":"Jonathan Pageau","text":"Yeah, yeah. I mean, that's really interesting. Like what I. What I find interesting about what you're saying because you wonder like when I see the bad movies come out and I. And I'm like, what. How is it possible? Because you think they're definitely creative people. Like, it's not like there's a dearth of people with great ideas and a dearth of people that tell good stories. But in some ways, maybe it's just that pressure that's so high coming from people who aren't creative, who want to make sure that. I mean, it's in. It's. It's not anybody's fault in particular. But it's like if your movie has to generate a billion dollars, I mean, the pressure for something like that is so crazy that. That it has to. It has to kind of like come down onto the. The people that ultimately are the resource to make it happen."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":1271.54,"end":1291.3,"speaker":"Kendall Hoyer","text":"Right. And it becomes kind of like a beast in and of itself because the more you, I guess circum to like making things more expensive, the more that cycle just kind of perpetuates itself in a way because you just. Well, that one was really big. We gotta make a big, you know, one on this one. You know, it just kind of like spins kind of out of control in a way."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":1291.3,"end":1323.45,"speaker":"Jonathan Pageau","text":"Yeah, yeah, yeah, yeah, yeah. And I think we're reach. It seems like we're at the end of that. Like, it seems like whatever the next wave of things is going to be is not. It's just not going to be. It's like, what do you do after Endgame? Like, what do you do after these like massive, huge, you know, really well done and successful, like things that then it's like. Well, I. There's just nowhere to go after that. If all you're trying to do is make it more fireworks like you. You can't come back to. Come back to story, come back to character, come back to. To simple things."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":1323.61,"end":1335.05,"speaker":"Kendall Hoyer","text":"Real thing. Yeah, I mean, I think people are really looking for like real and authentic things. You know, small things. I think. I don't know."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":1335.53,"end":1340.01,"speaker":"Jonathan Pageau","text":"Did you see. Have you. Have you followed a little bit Arsenal White thing? Have you seen a little bit of what we're doing?"}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":1340.33,"end":1342.49,"speaker":"Kendall Hoyer","text":"Yeah, yeah, it's great. I. I bought it a week."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":1342.65,"end":1343.37,"speaker":"Jonathan Pageau","text":"Oh, cool."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":1344.43,"end":1348.15,"speaker":"Kendall Hoyer","text":"I'm gonna read it to my daughter. She's. She's about to turn seven, so she's perfect."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":1348.15,"end":1372.73,"speaker":"Jonathan Pageau","text":"That's perfect. Yeah. Where it's like, I'm listening very carefully to what you're saying because in some ways, you know, it's like I, I think, I think that it is possible right now to make very powerful beautiful things. But, but in some ways you have to have the right. We're the right people, but then also the right spirit of, of, of, of creative possibilities in order for it to happen."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":1374.09,"end":1458.73,"speaker":"Kendall Hoyer","text":"Yeah, yeah, yeah, yeah. To like protect that thing. And I think, you know, the other thing that I think people like or maybe wanting or they need is something that gives them something to reach for. Something that's so much of things like, are like story wise. They're not like aspirational, you know, they're just kind of like, here's what it is, you know, and it's kind of a downer. It's like, oh yeah, that is house. So you know, as opposed to something that's like, look at this beautiful thing, you know, and you know, people might criticize, that's just idealistic. That's never whatever. But it gives people something to aim for that's higher that, that they can look up to, you know, you know, stories that give them something, something. And also stories like that, but where they can find themselves in where they like the psychology of the character is real, you know, that's another thing that's really, that's hard to do, I think, is finding a character that's interesting, relatable, appealing. Right. That you're like, you're like, oh, I'm on board with them. Like, I, I know what they're feeling in this moment. I really understand what they're. What wound is. You talk about that sometimes. Like, what's a character's like flaw and wound. What, what drives a character, you know?"}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":1460.01,"end":1461.05,"speaker":"Jonathan Pageau","text":"Do you, do you write?"}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":1462.57,"end":1465.89,"speaker":"Kendall Hoyer","text":"No, I, No, I haven't ever written. I should."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":1465.89,"end":1468.81,"speaker":"Jonathan Pageau","text":"Why you say no? You said, do you have story ideas?"}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":1469.69,"end":1472.01,"speaker":"Kendall Hoyer","text":"Yeah, some story ideas. Yeah."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":1473.29,"end":1474.73,"speaker":"Jonathan Pageau","text":"And why wouldn't you want to?"}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":1476.02,"end":1476.26,"speaker":"Kendall Hoyer","text":"Right?"}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":1476.58,"end":1477.06,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":1477.38,"end":1485.46,"speaker":"Kendall Hoyer","text":"I don't know. I, I just, I'm always a picture person. But I mean, I don't hate. I like words, but, you know, I just haven't."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":1485.46,"end":1493.46,"speaker":"Jonathan Pageau","text":"No, but. Right. Not in the sense of. I, I don't care about the writing part. What I mean is in the sense of creating stories. Oh, like creating your own story."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":1494.5,"end":1496.82,"speaker":"Kendall Hoyer","text":"Yes, I probably should. Should."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":1497.06,"end":1498.1,"speaker":"Jonathan Pageau","text":"I probably should."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":1500.66,"end":1511.39,"speaker":"Kendall Hoyer","text":"Sometimes, like, I just do my work and then I, I do my mom duties, I take my daughter to LA and all these things and then by the end of the day I'm like, oh, But I. I should try to make time for that sort of thing."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":1511.39,"end":1512.51,"speaker":"Jonathan Pageau","text":"How long have you been doing this?"}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":1513.55,"end":1518.99,"speaker":"Kendall Hoyer","text":"Uh, I started I. In 2008 as a story artist."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":1519.39,"end":1523.55,"speaker":"Jonathan Pageau","text":"Wow. So that's. And now you're head of story."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":1523.63,"end":1524.83,"speaker":"Kendall Hoyer","text":"I'm a co. Head of story."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":1524.91,"end":1526.31,"speaker":"Jonathan Pageau","text":"Co. Head of story, yeah."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":1526.31,"end":1530.83,"speaker":"Kendall Hoyer","text":"So I have another coworker who's doing the job with me, which is super helpful."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":1531.07,"end":1534.15,"speaker":"Jonathan Pageau","text":"And what does that mean? What does it mean, the head of story?"}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":1534.15,"end":1555.39,"speaker":"Kendall Hoyer","text":"Well, our job is to oversee the storyboard artist team, and also to be in the meetings with the writers and the director, to kind of almost like shepherd the story and kind of help the director find the story and then carry that vision through in the boards, in the storyboards."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":1556.52,"end":1560.08,"speaker":"Jonathan Pageau","text":"And now the. The project you're working on now. This is the first time you're doing this, like, as."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":1560.08,"end":1561.72,"speaker":"Kendall Hoyer","text":"Yeah, this is the first time I've been headed story."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":1562.68,"end":1563.96,"speaker":"Jonathan Pageau","text":"And how. How is that?"}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":1564.44,"end":1642.68,"speaker":"Kendall Hoyer","text":"Well, it's great. It's great because that's why in this job, I have more say. Because the director's really great. He has us in, like, all these meetings, and because we're at all these meetings, I can really see the story. Like, if you're not in all the meetings, like, little things get changed all the time. But if you're in all the games and you're like, oh, okay, I know why that's there. I know why that's there. I know why that's there. And this needs to accomplish this and this character. We need to have a moment around this area where a character realizes this, because you have to track their character arc, right? You have to figure out, you know, because all the little pieces have to come together. You gotta do the main character, the secondary character, the world problem. Like, all these things need to track throughout, and you need to lay enough pipe in the story so that it feels cohesive at the end. Right. You're trying to, like, have all these things come together at the end and the conclusion and feel satisfactory. So you can really track that if you're in all the meetings, all the discussions about the story. And so it's super fun because I really, really enjoy talking about story and character and really figuring out. I like story problems because it creates an opportunity to. To solve something, to pick something. Yeah, yeah, yeah."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":1642.84,"end":1644.52,"speaker":"Jonathan Pageau","text":"What did you study to do this?"}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":1646.04,"end":1647.32,"speaker":"Kendall Hoyer","text":"I studied animation."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":1647.56,"end":1648.2,"speaker":"Jonathan Pageau","text":"Okay."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":1648.36,"end":1666.01,"speaker":"Kendall Hoyer","text":"And I like you. I went to art school, but I. For animation. Illustration. Yeah, yeah, yeah. And I always wanted to work in animation since I was like, eight. You know, when I was like eight, I was like, I want to work at Disney, like many kids. Yeah. Pre floor. I didn't."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":1666.01,"end":1668.89,"speaker":"Jonathan Pageau","text":"You actually went. You actually went for it and ended up doing it."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":1669.21,"end":1676.17,"speaker":"Kendall Hoyer","text":"Yeah, yeah. Um, but, yeah, I studied drawing. You know, in high school, I was that kid with a sketchbook."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":1676.25,"end":1676.73,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":1677.21,"end":1678.97,"speaker":"Kendall Hoyer","text":"At youth group drawing."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":1679.93,"end":1680.89,"speaker":"Jonathan Pageau","text":"Yeah, yeah, yeah."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":1681.13,"end":1682.57,"speaker":"Kendall Hoyer","text":"Always drawing. So."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":1683.61,"end":1709.85,"speaker":"Jonathan Pageau","text":"Hmm. I mean, this is weird, but there's a difference between how I think the public perceives entertainment or movies and stuff like that in terms of actors and all that stuff. Like, that stuff is really secondary. Like, it's. It's like they get the money, but that. Who cares, really? Like, the. The. The important thing are the important people are the storytellers."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":1710.73,"end":1738.72,"speaker":"Kendall Hoyer","text":"Yeah, yeah. The storytellers are the writers and ultimately the directors that take the story and make it into something, you know. Yeah. And they take you on a journey with. With the actors and the cinematographer and the lighting and the set dresser and all that stuff. And that's why it all has. The director has to be the keeper of whatever here is at the top. Like the thing that everything needs to be pointing to. And if they don't know what that is, then everybody else is in trouble."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":1739.12,"end":1785.35,"speaker":"Jonathan Pageau","text":"Right. Yeah. And so. And so. So we need. We need for people that are thinking about storytelling and realizing that that's really the key to. To. To actually talk to each other. So. Yeah. Anyway, so, like, in my case, that's what I want to do. Like, I. I have to stop complaining about stories, and I have to try to. To. To tell better stories. So that's what. That's kind of the. The. The vision I give myself in the next few years with this fairy tale series. But then also God's dog and then other stories that I have in mind. And so hopefully we can also attract people around that, like, people who. Who are. So anyways, that's my."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":1785.43,"end":1825.69,"speaker":"Kendall Hoyer","text":"I mean, like, ultimately, you know, I feel like I've never heard of so many people interested in, like. I mean, as. As people. More and more people recognize, wow, Hollywood's really not doing good things. Other people are like, well, we'll do good things, you know, just like everybody's, you know, and. Which is good because it creates opportunities for other things to arise as the other. As the established system seems to be floundering. Um, but, you know, I think some. You have to, like, go into it soberly and, like, also be really, like, led into it, because I think that it's. It's harder than it. Well, at least for animation."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":1825.69,"end":1826.37,"speaker":"Jonathan Pageau","text":"So many people."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":1826.9,"end":1843.78,"speaker":"Kendall Hoyer","text":"And it makes you. I'm like, really do you really know what that takes. Like, you need backers, and you need someone at the head of that. That understands it. And, like, I mean, I don't even understand it. Like, all the, like, things that need to come together for that to work. It's like, it's. It's a lot."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":1843.78,"end":1859.17,"speaker":"Jonathan Pageau","text":"It's a massive enterprise, definitely. No, I. You know, that's true. Especially if you want to make really quality things, because obviously you can pump out animation out easy, more easily than any time in the history. Like, you could animate without knowing anything about animation."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":1859.17,"end":1860.49,"speaker":"Kendall Hoyer","text":"And then you forget and you're like."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":1861.29,"end":1872.33,"speaker":"Jonathan Pageau","text":"Yeah, and then it's horrible. And then. And then. And then nobody. Nobody cares. So. So maybe tell me a bit about how. How kind of symbolic ideas has influenced your."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":1872.81,"end":1873.37,"speaker":"Kendall Hoyer","text":"Your work."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":1873.37,"end":1881.53,"speaker":"Jonathan Pageau","text":"Like, how you. You feel like you're able to integrate some of the things you've been that. That I talk about or that. Or that, you know, Jordan talks about and into storytelling."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":1882.26,"end":1916.47,"speaker":"Kendall Hoyer","text":"Yeah. Well, I'll tell you how I came across Jordan. I came across Jordan first. And how, like. Well. Cause I'm always looking at stuff and, you know, filmmaking things and story things anyway, and I think I was looking up. I had heard that Akira Kurosawa was influenced by Dostoyevsky stories. And so I was looking up Dostoevsky, and I found Jordan's video about Dostoevsky, and he was in the Personality series. I was like, wow, this is really interesting. And so I started following. And around that same time, he became kind of controversial. And people."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":1916.47,"end":1921.75,"speaker":"Jonathan Pageau","text":"This is like, back in 2016, like 2015, 2016, when was it might have been."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":1922.31,"end":1926.35,"speaker":"Kendall Hoyer","text":"It was either early 2018 or late 17, I think."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":1926.35,"end":1929.35,"speaker":"Jonathan Pageau","text":"Yeah, yeah, yeah. Well, that's when it really blew. Like, it really blew up."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":1929.43,"end":2098.22,"speaker":"Kendall Hoyer","text":"Yeah, it was starting to blow up. People were talking about how this guy is really. He's misogynistic. He's this really. I don't disagree with anything that he's saying. I'm like, oh, okay. It's just kind of kept my interest to myself and just watched all his videos by myself. And then I think he had you on. And I was like, wow, that's really interesting. And then I looked up your channel and you had, like, all of these things about movies. I was like, oh, cool. And so I watched a bunch of that. So it. That shook my worldview. Yeah. Like, I had pretty much been living in, you know, for, like, you know, very worldly. Like, I was raised in the church. During college, I kind of fell away. And then. So when I discovered all these things Like Jordan and you. My worldview had already been shifting. Like I'd come back to God and like I was questioning everything and it really kind of um, things that I had been experiencing but having gone in my life again were really resonating with what Jordan was saying. When like he talked about the bottom falling out, I was like, um, and everything, all the things that he would describe, I'm like, yes, that's what happens. Yes, that's what happened. That's what it feels like. Phenomen, phenomenologically. And so all those things really spoke to my personal experience, but also I could apply them to what I would see in the story room or what I was seeing in stories. Like I was like, oh, that's that principle that you guys talk about. Or you know, when you kind of peel away the materialistic view and you see that really the spirit is the ontological truth, you can see things more clearly, you know. And I feel that's what symbolism is very connected to the spiritual realm. So it's very like, it's, it's like that represents that, that thing in the story is this principle in kind of the spiritual realm. It's symbolic of something that's unseen and, and the more I could see those things, the more I could kind of problem solve stories. So I think that like listening to you and Jordan, I didn't discover John Reiki until a couple years later. I think we're kind of really just opening my eyes to seeing things. Not materialistically and seeing things and patterns, stories and patterns as more, lack of a better word, more spiritual in a sense. And it just made it clearer to me to see the pieces moving underneath the physical reality. Yeah, it's hard to talk about these things."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":2098.3,"end":2130.31,"speaker":"Jonathan Pageau","text":"I understand. Yeah. And so definitely one of the issues that people complain about in terms of the modern movies is in some ways a lot of, some of the decisions that seem to be made are not based on the needs of the story itself, but come from outside the story. Like some message or some thing they want to get through. And it, and that, and that it's, it seems artificial or tacked on because the, the story itself doesn't need it or the, the, it actually sometimes goes against the basic pattern of the story."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":2131.19,"end":2200.62,"speaker":"Kendall Hoyer","text":"Yeah, yeah. And I, I think that was kind of like where I was seeing like, I think sometimes people, can't they, they see like sometimes those things, those, those values as the highest value, like the best. Like that's the deepest point of the movie or that's the theme or that's what it should be about. And they try to. It's like, I always compare it to trying to hammer in a square peg in a round hole or something. It's like you're trying to make it fit, but it just doesn't fit. But you'll bend over backwards because you think that that's the most important thing. And it comes from not listening to the story or the characters of what this movie is really trying to say. Just like if, you know, you were writing a novel and you weren't really listening to what the characters would say or who that character is, like, you would make them act in a way that was counter to what you had established before, you know, and we'll go like, well, that character wouldn't do that. And he pulls you out of this suspension of disbelief. And it. Because it's just like it doesn't jive with reality. It doesn't jive with the patterns in reality. It doesn't jive with what you've previously set up. Nobody would act that way in that situation."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":2201,"end":2250.51,"speaker":"Jonathan Pageau","text":"Yeah, yeah, yeah, yeah. And then. Yeah, but it's interesting because. Right. It's like that's when you can see that in some ways the highest form of reality is not. Because we used. We. We tend to think something like. Even myself, you know, writing fairy tales, some people would say, what's the moral of the story? Right? And so that's what they want to ask when they. When they listen to a fairy tale. And the truth is that there's something implicit which is more important than whatever moral you think you should get out of this story. There's some. There's some participation, some mirror of reality, something that is. That is reflecting to you something precious and powerful and sometimes beautiful, sometimes tragic, sometimes, you know, but it, but it's more than a moral, right?"}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":2250.51,"end":2305.72,"speaker":"Kendall Hoyer","text":"And it's. Yeah, like, like. And that's where, like, it seems like that's feminine thing, you know, like, it's. It's very elusive. It's implicit, not explicit. And the mistake people try to make is they try to. When you try to make the implicit explicit, I think that's when it gets into like, propaganda territory. That's when it gets into, like you're hitting people over the head with it. And they, you know, if they want to hear a sermon, they'll go to church. You know, they don't want to hear it. And I have a little post it. I had tons of posters on my screen, but one of them is Avoid Didacticism. And it. Because I Learned that word. I was like, oh, that's what we want to avoid didacticism, because. And there's a time and place for it. Like, I mean, I feel like Aesop's Fables or there's some, you know, there's some things that are, like, for children that have more of a."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":2305.88,"end":2307.72,"speaker":"Jonathan Pageau","text":"A little more of that. That didactic."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":2308.2,"end":2344.43,"speaker":"Kendall Hoyer","text":"It has that aspect to it, but as you get older, you don't want it to be so explicit. You know, you're more. You're in the story. You're more like kind of asking questions in a certain area, like a certain, like over. Around a certain value. And you can't straw man the opposing value or it feels didactic. You have to let the. The anti hero or whatever, the antithesis, be as strong as the. The. The protagonist or whatever, because otherwise it feels rigged."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":2344.91,"end":2404.83,"speaker":"Jonathan Pageau","text":"It feels rigged. I love that word. I never thought of you thinking about it that way. It feels rigged. That's a. That's a great idea. And then, and then it makes you realize in some ways that, like you said, that there's something about a story which is rather a puzzle of human experience that is playing out and that there is in. There is a solution, but the solution is within the puzzle of the story. It's not, it's not a. It's not just a, a, A, A more a moral tale that comes in from. From outside. And obviously we're not the first ones doing this. Right. The whole deus ex machina idea was that was like, you know, Aristotle complained about the playwrights not making the characters work out the story from within their own motivations, rather than, rather bring in, you know, at the end someone who just solves the problem from outside and just basically tells you what, you know, what the moral is so that you can go back home, you know, with a nice package."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":2405.31,"end":2457.7,"speaker":"Kendall Hoyer","text":"Right. And as a storyteller, I feel like you have to be aware of the audience, the characters you're creating and yourself. You have to be aware of, like, what you yourself putting in there, you know, because. Or what you already like, have in your head in, like, in the story, like so many times. I feel like I've been on projects where it's like. I feel like we are like, yeah, we're seeing this and we know that this is what it is in the story, but. But we should take that out of it because by this shot or saying this, we're imposing ourselves as the storytellers onto the characters. Right. And if you do that too much, the audience feels it and it doesn't feel right."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":2459.14,"end":2513.78,"speaker":"Jonathan Pageau","text":"Yeah, yeah. And it's a. And you can imagine, like, you can also. You can imagine it too, that as. So the person telling the story, you're like, well, this is what I want people to get from this story. And so the danger, of course, is, is that that's what you want. So you make it too explicit. And then by the time you make it too explicit, you've. You haven't succeeded because nobody cares about your story anyways. And so it's like you. You've lost if you try to make your point or whatever it is you think you're. You're. You're making. And so the. And so what happens, I think too is like, if you. If you remain in story mode and in. In the kind of story puzzle mode where you have these factions and characters that play off each other, that balance each other out, you know, that, that. That relate to each other in ways that is. That is in the puzzle of the story. I think what it does too is that it can make someone say something deeper than what they're capable of."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":2514.42,"end":2515.74,"speaker":"Kendall Hoyer","text":"Yeah, I do think that that."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":2515.74,"end":2515.94,"speaker":"Jonathan Pageau","text":"Ha."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":2515.94,"end":2551.45,"speaker":"Kendall Hoyer","text":"That I. You could just see it starting to emerge. Like. Like somehow you just stumble across it and you're like, oh my gosh, that's so much deeper than. Than we could have even, like, constructed. It just starts to kind of happen. It. It. It's like things start lining up, you know that the things are starting to line up and it just kind of flows. It's strange, but it. It happened. If you don't fight it, though, somehow, like, that's the. You have to almost get yourself out of the way as the. As the storyteller. It's almost like a conduit. You have to kind of shepherd it, but you can't get in the way."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":2552.09,"end":2607.97,"speaker":"Jonathan Pageau","text":"Yeah, yeah, yeah. No, I. It seems like that I. I think you're. You're totally right. And that's why sometimes, like the best storytellers. And this is true, like in terms of music, in terms of all kinds of. Sometimes those. You don't really want to hear the people tell you what it's about because actually they don't really know what it's about or they think they know, but once you. Once you see you're like, well, what you're saying is actually reducing the. The. The movie or the song or whatever, like the reason why people actually care about it. That's it. That's it. And so in some ways that the storyteller is almost like a. It's like an antenna almost more than. It's someone who's just basically vibing in the puzzle and is able to. To put it out there, but it doesn't even necessarily understand it. It's not even to their own. To their own merit sometimes that. That they're able to. That they've been able to do something like that."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":2608.69,"end":2609.97,"speaker":"Kendall Hoyer","text":"Yeah, I think so."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":2610.21,"end":2629.12,"speaker":"Jonathan Pageau","text":"And then the muse idea becomes way more coherent. Like, we can kind of understand why the ancients, you know, not just the pagans, the Christians too. You know, in the Middle Ages, they. And even in the Renaissance, people were still invoking the muse before they started. Because in some ways, new. That it doesn't totally come from you."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":2629.84,"end":2667.85,"speaker":"Kendall Hoyer","text":"Yeah, there's like a. You kind of have. Yeah, you're like some sort of conduit. You're half. You just kind of have to shepherd it. And I think the more you do it, the more you kind of, you know, recognize where you're inserting yourself and where you're just letting things flow to a certain extent. And, you know, you've been in creative. Or. I don't know, I've been in creative rooms, you know, that I. There's a certain flow that happens in behaviors, too, where things just go back and forth and they just kind of go. And there's ones where it's just like, oh, can't say that. Well, that's. That, you know, you just start putting blockades up in your own mind, you know, like, they're not gonna like that or this, that and the other."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":2668.57,"end":2720.2,"speaker":"Jonathan Pageau","text":"So that's true. I mean. I mean, when you. When you are creating something and there's that flow, like, really. The way that John Revaeke talks about it, there really is this. Dialogos. Right. That John also brings up, which is that in the end, the. There's more than what you thought was possible. There's definitely more than what you could have done on your own. And that's really precious. I mean, if you can have that, it's quite rare and it's really precious. And that's probably, you know, like, you talked about the. Like the early Pixar movies or even the early Disney movies or, you know, other projects like that where there was probably some of that going on. Like, there was just this really bubbling thing where the ideas just jived and everything was just kind of falling together in a way that was. That was intuitively. Right. You know."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":2720.6,"end":2762.51,"speaker":"Kendall Hoyer","text":"Right. I mean, I think, like, to use, like. I mean, I don't know, but like early Disney as an example. I think Walt Disney and his brother were kind of like the business people, like protecting their little hive of creatives. And they had, they, they amassed all these great creatives but, and they, they interfaced with like I'm, I'm sure they were hustling to try to get money and funding to keep this thing going. Right? But they were also protecting their little hive of artists, you know, and trying to give them like the best that they could. And they also were visionary. Like, we're going to need this and this is going to be great. And so the, yeah, they're like shepherding the creative process and moving it forward."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":2762.75,"end":2800.36,"speaker":"Jonathan Pageau","text":"You know, and for sure there, there's something unreasonable about those early Disney movies. I mean when I, I remember just a few years ago, I watched Pinocchio again and I was looking, watching that animated waves and I was thinking this is completely unreasonable. Like how the hell did they, how did that, how did they. Who did this? Like, who animated the water? Like just. And it's all, you know, it's all hand done and everything and there's just something so completely unreasonable about, about it. And, but also this, you can just feel the absolute care and love like, like if you're looking at a handcrafted violin or something."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":2800.68,"end":2861.49,"speaker":"Kendall Hoyer","text":"Right? Yeah. And the, they, you know, and like early Pixar they created, they had, they were visionary and they wanted to tell the story and they, they wanted to do it with such care that they created technology. They bring in like people that can help them to do these things. And that's kind of where like, you know, early Pixar would talk about like art pushes on technology and technology helps the art and it kind of, they kind of move forward together. Because sometimes the artists can't create, you know, they can't, they don't have the tools to create what they want. And so the technological people will come in and help them create like the multi plane camera, like that wasn't a thing. Right. You know, and they created that to do Snow White so that they could get these, the feeling of these, you know, of one layer moving, play in that way. So you felt like a camera moving and you know, all this stuff and it gave depth and beauty to the, the shots and the, the final product, you know, like. But they didn't have that before. They had to create that."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":2861.73,"end":2907.5,"speaker":"Jonathan Pageau","text":"Yeah. So I'm gonna, I think, I think maybe I'll end with the dark question. Sorry to end with the dark question. But the. So AI is all abuzz. Everybody's talking about AI and you can see, you know, the different software, the different platforms that are like stable diffusion and amid journey and all these platforms that are kind of pushing on us. And so what do you think in terms of as we watch this kind of these technologies, these massive technological innovations down the coming downstream, how do you see the future of this like, of animation, of creative storytelling in relationship to the, these, these tech tools that are just coming down very fast?"}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":2908.62,"end":2991.56,"speaker":"Kendall Hoyer","text":"Well, honestly, I don't know that much about AI. Like you probably understand more than I do. I really don't understand that much about it. But I think, I think it's, I tend to think it's kind of a hack, you know, like people, it's also robbing people of something, right? Like there's a certain amount of like gratification and that happens when you put in the time to, to do something and you, and you, you overcome and you overcome and then you put, you have something, you're like, wow, that looks great. You know, but now people are like using AI to get their faster. And I'm, you know, I'm not about like not getting something faster, you know, like to a certain degree, but you're like robbing people of excellence in a certain sense, you know, by giving it to the machine and giving it to some program or something that like, you know, if you spend hours drawing and really honing your craft, that can't be taken away from you, right? That can't be taken away from you. That's something that you put in the attention and the time to do. And I think AI kind of robs people of that. You know, like that handcrafted thing is so valuable. I think it devalues some things if, if it was just a machine algorithm."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":2991.64,"end":3044.78,"speaker":"Jonathan Pageau","text":"Yeah. And what do you think of the idea that in some ways, like the best way to frame it is something like care and attention in the sense that even though the tech, the, the computer might bring to us like technically proficient images that will be very fast to produce and will be visually stunning and, and surprising and all that. But that, because it's so easy, the type of care and attention you would need in order to create something that people will love will like you won't. It's like as if you won't have to put that in there because it, it can happen so fast and that will necessarily affect the, the, the result and it'll, and it'll necessarily affect the, the perception that people have of that result as well."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":3045.42,"end":3073.37,"speaker":"Kendall Hoyer","text":"But I mean, I think people can tell for sure. Like you said, I think People can perceive that something doesn't have that level of care and attention, you know, that and that I feel like it's just gonna, you know, some people will be like, oh, that's great. But then when something comes out that really has the care and attention, people are gonna like, walk onto it because they can. I think we're just built to notice things like that, you know? I don't know."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":3073.53,"end":3155.43,"speaker":"Jonathan Pageau","text":"Well, I mean, we're artists. It's hard for me to know how. How objective I am. But for sure, like now I've seen in the past six months, I would say maybe a little more. I've seen a huge percent of ads online get replaced by Mid Journey images. And I. Not only can I tell, but there's something about it. Like, there's something that it. I don't know how to explain it. There's something about those images that are boring. Even though they're all stunning and they have all the right light angles and they have this, this kind of perfection. There's something about a lot of these images that are boring and, and repulsive to some extent. And so, I mean, I'm curious if it's just because I'm an artist and I can tell and I'm like, it's like, oh, please, another Mid Journey image. Like, if I just scroll down my Facebook, whatever thing, or all I see are just a bunch of mid Journey generated ads. And people use it for thumbnails too. On, on, on YouTube. A lot of people are using Mid Journey for thumbnails on YouTube. And there's something about it that is just not that I find very uninteresting, but it's almost like something really flashy at the out. Flashy. Really fast. Like, it's just. Obviously it's flashy, you know, but then it, it wears off really fast."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":3156.31,"end":3224.64,"speaker":"Kendall Hoyer","text":"Yeah, I, I mean, I'm also an artist, so I probably have a similar, like, mindset to you. Like, I'm also like, my eye is really attracted to things that are like handcrafted or there's something, I don't know, something. Just something nicer about, you know, like handcrafted things. And I kind of have like, like, oh, look at that one. And then I'm like, oh, look, it's really expensive. And then a reason for that. Doggone it. Um, but yeah, and a long time ago, I. I turned off to most of the, like, comic book movies because, like, oh, same thing again. It's like flashy, flashy, flashy. It's like the same thing. And my mind Just kind of shuts it down. I don't know if everybody will be like that, you know, but I do think that if you create something that is really good quality and appeals to people, it's not like high artsy or whatever that it will attract their attention. I think people are just built to see things like that, like the early Pixar movies or the early Disney movies, like, things like that. Like people are drawn to them, you know, and they. They withstand time."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":3225.28,"end":3230.88,"speaker":"Jonathan Pageau","text":"Yeah, definitely. Definitely. So. Well, thanks for your time, Kendall. I really appreciate it."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":3231.2,"end":3231.92,"speaker":"Kendall Hoyer","text":"That's great."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":3233.12,"end":3292.15,"speaker":"Jonathan Pageau","text":"Next year, February 29th to March 2nd, we're going to have the very first symbolic world summit in Tarpon Springs, Florida. There'll be some amazing speakers. Of course I will be speaking, but there will also be father Stephen DeYoung of Lord of Spirits fame. You will also find there Martin Shaw, who's a mythographer and amazing storyteller, but a bunch of other people too, of course. Richard Roland will be there. Nicholas Kotar, Neil Degrade and Derpow Robbins are actually going to play a concert. There will also be Vesper Stamper, but also a lot of other people involved in the symbolic world community will come together to explore how we can recover, rediscover the ancient cosmic image. But it'll also be a time for people to connect together, to meet in real time, in real space, develop relationships, you know, find people thinking in the same line as we are to further this community and to further this type of thinking in the world. So I'm really looking forward to meeting you in person in Tarpon Springs, February 29th. So hopefully see you there."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":3292.47,"end":3356.47,"speaker":"Laura Diaz","text":"Tucson the weight is over. Medi Weight loss. They're officially open on North Oracle Road. That's right, no more counting down the days. You can walk in right now and start your journey to a healthier you. Hey, it's Laura Diaz from iheartradio and you can trust me. This isn't just another weight loss clinic. I know that because it's where I lost weight safely with real medical support. GLP1 medications. You can see them everywhere online right now. But the truth is, your health shouldn't be a DIY project. Ordering these meds without the professional guidance is. It can lead to dangerous mistakes, wrong doses, no oversight, and serious risks. At mediweightloss, I got the same medication, but with a customized plan, weekly check ins, and a licensed physician guiding me every step of the way. And the cost? The same as those risky online options. Tucson, your moment is here. If you're ready to take control, feel better, and lose weight the right way. Mediweightloss is ready for you. Walk in, get started and see real results. Call or visit mediweightloss.com to learn more and book your free consultation today. That's mediweightloss.com pack up, though, because Chevy."}
{"episode_id":"SW - #312 - 2023-11-03 - Kendelle Hoyer - Behind the Big Screen","start":3356.47,"end":3383.44,"speaker":"Announcer","text":"SUVs have the capability to take you to some incredible places. Like an adventure in the middle of in the Equinox Active, an SUV that will help you get away with confidence. Or head off for a night in the in Chevy Traverse with all the tech you need to stay connected. While the undeniable value of of Chevy Trax will keep you moving from here to over here to way over here, get to all the places you want to be with Chevy SUVs. See Watson or O'Reilly Chevrolet."}
