{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":12.08,"end":15.6,"speaker":"Jonathan Pageau","text":"This is Jonathan Peugeot. Welcome to the symbolic world."}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":30.08,"end":47.32,"speaker":"Jakub","text":"Okay, so Jonathan Pageau. Well, I'm not going to introduce you because anyone that is here is here for you. And you also noticed recently that it's kind of silly to introduce you as an icon carver. Still."}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":48.2,"end":59,"speaker":"Jonathan Pageau","text":"I think it's hilarious. I really actually enjoy it, especially when, like, Jordan Peterson introduces me as a Russian Orthodox icon cover, which is just great. It's funny."}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":61.06,"end":72.1,"speaker":"Jakub","text":"Yeah. And it is more and more visible with each interview that you're having recently that. Okay, I can. Carvers don't talk about those things or don't talk about."}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":72.26,"end":94.49,"speaker":"Jonathan Pageau","text":"It's mostly that I think it's just strange. People don't understand how to frame me. They don't understand what category to place me in. And so they struggle. They have to give me a qualifier and then they struggle to do that. So I think it's just part of parcel of what I'm doing. You know, I'm trying to kind of span a lot of categories in what I'm doing. So. So I think that's what. That's what happens when you try to do that."}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":94.73,"end":96.81,"speaker":"Jakub","text":"But you also studied some theology, right?"}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":97.69,"end":118.62,"speaker":"Jonathan Pageau","text":"Yes, I did, yeah. I studied theology, both in university and on my own. I don't have a degree or anything, but I did study in. There's an Orthodox program here in Montreal, so I studied. I studied for a few years in that program. So I have some formal. Some formal theory, theological education. But most of what I know is just from my own reading and from my own."}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":119.34,"end":129.1,"speaker":"Jakub","text":"Yeah, sure, but. But it's not just you. It's like. Matthieu is a very curious guy. Then we recently learned about Dan. How many?"}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":129.1,"end":178.58,"speaker":"Jonathan Pageau","text":"Yeah, my third brother. Yeah, three, though there are three Peugeot brothers. And so. So, yeah, so Mattir is more. He is definitely more like a mathematician. He studied computer science in school. Yes, he's more hermit, like, you know, that's more his personality. But him also, I would say most of his understanding and knowledge come from his own studies and not from the formal world of academics. We both became very disillusioned. Maxir actually quit university. I think he had like one or two classes left before he got his degree. And he almost did it on purpose because he was so annoyed with the academic world that he quit just before having his degree. Just almost to be able to say that he doesn't have a degree in anything."}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":178.98,"end":199.61,"speaker":"Jakub","text":"So. Yeah, I mean, maybe it's a question to your parents, actually, not necessarily you, because I have four little boys myself and I wonder how to raise them so that each of them follow their own path, but at the same time is so successful as you three are. Because Dan Oslis was like a popular guy."}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":200.01,"end":261.76,"speaker":"Jonathan Pageau","text":"My brother Dan was a professional skateboarder. At some point he was one of the top. He was like in the top seven or 10. Like top 10 in the world for a few years. Just super. Very technical, very proficient. And so he's actually now a Pentecostal type pastor in Vancouver and he just opened a skate park there. So we're quite like. We're all. All three of us. We both. The three of us are quite different in some ways, but then also in other ways we're pretty. We're very similar. Like, our father is someone who wasn't afraid to just blaze his own path. Like, didn't feel the need to get the, let's say, the acknowledgment of others necessarily. Like, it's like he just did his thing and he did it completely. And so I think that all three of us got that. You know, we never felt like we needed to have official titles or official this or official that. We just did what we did with all our. All our heart."}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":261.76,"end":266.36,"speaker":"Jakub","text":"Really low in agreeableness. Not necessarily to fit in."}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":267.48,"end":277,"speaker":"Jonathan Pageau","text":"Oh, for sure. Matir is low in agreeableness. My father, too. I'm higher in agreeableness, I would say. And Dan, I'm not sure. I think he's probably pretty high in agreeableness too."}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":277,"end":297.63,"speaker":"Jakub","text":"Yeah. Okay, so before we move to the symbolic stuff, I wanted to ask you about the missionary work that you did. Because you say a word or two about it here and there, but we never got like a whole idea what it was like. And what did you do there? And you were still in Palestine there right then, right?"}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":297.71,"end":582.65,"speaker":"Jonathan Pageau","text":"No, I was orthodox. I was already orthodox. It's one of those things like, don't ever do this, people. So. Because what happened is I was going through this crisis, I would say a general crisis, which was not just a crisis in terms of art, and there was a spiritual crisis, but I was also working a job which, although I appreciated the work and I appreciated the job, I always felt like there was something missing or that I was. That it was just not. It wasn't particularly useful to be doing what I was doing. I was working for a project management company and developing. Developing pedagogical material and writing case studies and doing animations and doing all this stuff kind of like to support their trainings. So. So that's what I was doing. I was doing that, I guess, like, from 1999 to 2000, 1998 to 2003, maybe so about five years. Anyways, so in that moment, like, I was. I was just thinking, like, this is not what I want to do long term. And so with my wife, we had looked at going to do some volunteer work with a Christian organization which was called MCC Mennonite Central Committee. But I converted to Orthodoxy in 2003. And then everything came together in 2003 to leave. And so I basically converted in, like, at Pascha and left in the fall, which was. Just never do that. That's like the worst thing you can do. Because I was basically a new convert. And I was just kind of thrown out into the world. And there in Congo, where we were, I was able to. It took forever. I was able to finally find a parish, but it's really hard to access it. And it was difficult because of the cultural difference. You know, it's like all. Imagine all this cultural difference. You've just become orthodox, then you move to Africa, and then you go to an orthodox church in Africa. So it's really intense and difficult. But there are some very powerful, shining moments of my time in Congo in terms of orthodoxy that were pretty powerful. Anyway, so while we were there, what we were doing was working with artisans. The MCC Mennonite Central Committee, they started a project called 10,000 Villages, which was a series of stores all over North America that sold, let's say, handmade things from all over the world with kind of fair trade ideas, like ideas of encouraging local economies, encourage local know how to. And also preserve more traditional ways of making things. So that's who I was working with in Congo. We basically teamed up with a group. We basically created a network of artisans. And because export was so difficult to do in Congo, what we did is we opened a local store and then used a local store to kind of train the artisans in terms of terms of quality, in terms of design, in terms of also how to present yourself to clients and all that. Because it's hard, you know, when people are. Are poor and are. Don't have a lot of education. They don't. They. It's like they need a bridge, right, to be able to interact with people that are more highly educated and have more means. And so we were kind of acting as that bridge between the market and the artisans. And we did that for four years in Congo. We opened a store. We had about working with like, at least 30 different artisans and artisan groups. Um, and when we. So what we did is we set it up in a way with a local partner, and we trained that person. And ultimately the last year, like the fourth year, we. We moved out of the management of the project, became like, consultants, and the project just ran for that year with the local person. And so that store remained open until Covid like it. It. So that was like 15 years. So it was a pretty. Pretty powerful project. Especially knowing that in Congo, most projects just don't. They just don't. They. They. They physically, Congo is a crazy, chaotic place, but sadly, the store is in. Is in trouble because of COVID You know, it's just. They don't have. He didn't have a lot of safety net. And so I've been in contact with our friend there. His name is Debo, and he's really struggling. So. So hopefully, like, there'll be some opportunities for him soon because it's. It's tough. We have. At least we have social nets that kind of help us out of these moments. But Covid in Africa, like in Kinshasa, was just insane. They had lockdowns. Can you imagine lockdowns in Kinshasa? Like, my friend called me and he said, we have these lockdowns. The police are finding us. We have to wear a mask and all this stupid stuff. And then he said, oh, it's like, I'm just. I just have a bit of typhoid, right? It's like there's diseases everywhere in Congo. Like, people get typhoid, they give malaria."}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":582.65,"end":584.17,"speaker":"Jakub","text":"As long as you don't get Covid, right?"}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":584.33,"end":597.51,"speaker":"Jonathan Pageau","text":"It's like, okay, as long as you don't get, like, Covid is nothing compared to these diseases. Just really. It was just so absurd. Anyways, so that tells you. It gives you an idea of what we were doing and how four years in Congo and three years in Kenya."}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":597.59,"end":603.11,"speaker":"Jakub","text":"Oh, wow. Was there like a spiritual element to it in any way? Evangelization?"}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":603.59,"end":645.43,"speaker":"Jonathan Pageau","text":"No, not at all. No. Not in terms of the. Not in terms of. Because I wasn't a Mennonite, you know, so we didn't have official evangelization as part of the program. It was really more in terms of craft. But there was always. There's always like a secondary evangelization that is, you know, you. You work with people, you know, you. You learn from people, and you become like a testimony. But to be honest, the idea of sending missionaries to evangelize Africans is the silliest thing in the world. It's like they should be sending missionaries to evangelize us because they're way more Christian than we are. And so to me, the idea of going to Africa to evangelize Africans is just a. It's just not. Just not something that holds up."}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":645.43,"end":645.8,"speaker":"Jakub","text":"It's."}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":646.27,"end":652.51,"speaker":"Jonathan Pageau","text":"It's more to kind of help them, to give them potential to do the projects they want to do. You know, so that's what we were doing."}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":653.47,"end":674.67,"speaker":"Jakub","text":"It's actually happening already in Poland. We have a very famous Ugandan priest that goes around and gives retreats. So, you know, it's happening. But in terms of, like, the Orthodox Church is not necessarily known for sending people out into those remote areas. Right. Is that."}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":674.67,"end":720.39,"speaker":"Jonathan Pageau","text":"Is there a reason they will. But it's different. Yeah, it's a different way of evangelizing Orthodox. The way the Orthodox will often do it is this, is that. For example, there was an Orthodox mission in Congo which was pretty successful. It was more in the interior than in Kinshasa. And the way they did it is. I mean, they basically send a monk. A monk goes out there, sets himself up, builds a hermitage, you know, builds a chapel, starts doing his thing, and then attracts curiosity and ultimately admiration. And then people start to kind of congregate around that monk. That seems to be the way that it was done also in Alaska and the different places where the Orthodox had a major impact. That seems. It's more that way than through colonization."}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":721.59,"end":726.15,"speaker":"Jakub","text":"But that's like. Particularly like the Russian church or the."}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":727.67,"end":968.48,"speaker":"Jonathan Pageau","text":"Yeah, both the Russians and the Greeks. So the Russians are the ones who evangelized Alaska, for example, and they were very well received by the local people there because of. Because they didn't come with. Also a lot of the colonization and the evangelization was done with, like, the military on one side and then the evangelization on the other. And so it's very shady. Whereas in Alaska, it was more of just someone, you know, saints who would go there and. And. And just live with the people. And so that's what happened in Congo. There's a. There was. I forget his name, which is horrible in Congo was a Greek. It was a Greek monk who went to the interior of Congo and set. Set himself up there. And he had a massive effect. I saw some of the churches involved with it. And that's one of. Actually one of my little magical moments of Orthodoxy in Congo is one year. One year I was in the interior when Pascha was coming around. And so I was away from my. My wife for several weeks, kind of in a small. In a small area inside and kind of in the. In the Congolese jungle, I guess. And so it wasn't totally in the jungle. It's a city, but it's really. It's more remote. And so Pasco was coming around. I was. I was doing my fast for the Hope for Holy Week. And so I was. I was like, what do I do? Like, I won't. I won't be anywhere for Pasca. It's not going to work out. So I start asking around, and I start asking people, do you know about. You know, do you know about an Orthodox church? And asking of the Congolese around me, and a lot of people were like, I don't know what that is. And then there was one guy, he said, I think I've heard of what you're talking about, this Orthodox church. And he was really fascinating because the man, he was severely handicapped. His legs didn't work very well, and so kind of had to drag himself on the ground with his hands and his feet. But despite that, he was, like, a serious badass. This guy was tough as nails. I mean, a lot of the people that are handicapped that I met in Congo are super tough. They almost have to be, right? Because, like, they have to compensate for their physical lack. So he was super tough. And he's like, you know what? I'm going to set it up for you. I'll figure it out. And so he basically sets it up. He finds. He says, the church. I know where it is. He finds where the church is. He sets up this taxi to bring me to the church on Saturday in the afternoon. So I get on this taxi. The taxi breaks down in the middle of nowhere. And so we get out of the taxi, and he's with me, right? So he's like, there's another road down there. So we, like, get to the other road, and this guy's, like, crawling on his hands and on his hands and legs at this point, we get to the other street, he flags down a car, and I'm not even sure it was a taxi at this point. And he's like, can we pay you to bring this guy to this place? And so, anyway, so I get taken to this. To this church, like, through this whole chaotic thing. And I arrive at this church, and it's like a church from Thessaloniki that's, like, dropped in the middle of, like, Congolese forest. And it's amazing. So there's this church there, and it's Saturday afternoon, and I'm, like, walking around, and, you know, there are no white people there. There are no Europeans there. It's just. It's just called these people. And so everybody's like, what is this guy doing? Here, like, what is happening? And so I walk into the church and it has frescoes. It's beautiful. And then people start to kind of stream in from everywhere. They kind of just start to stream in for the. For the Paschal service. And I'm thinking, you know, it's like, I haven't struggled. I struggled to go to church. And for all the Holy Week I was in, I was there. And I'm like, I need to go to confession because know, before Pascha. So I'm like, trying to figure it out. And I see this line forming before the priest, like, okay, this, this. There are people are going to confession. So I get in line with everybody to go to confession, and like, I come to this, to this African priest, and like, I do my confession, and all the whole time I'm thinking, like, what is he going to. Like, how is he going to react? And he has the best reaction in the world. He looks at me after I go, I confess, and he says, you know, we're not pagans anymore, so we really have to live like Christians. And I'm like, what did I say? Like, what is the thing? Which way? What did I say that? It's like, here's this African priest telling me to stop being a pagan anyways."}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":968.64,"end":969.6,"speaker":"Jakub","text":"Oh, you pagan."}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":970.16,"end":999.13,"speaker":"Jonathan Pageau","text":"Yeah, it was pretty amazing. So. So I was able to commune that. That night and spend the night with the people. And, you know, it was really Greek. Greek chanting and everything. But then when they said Christ is risen, you know, at the moment of the resurrection, then Africa started to, like, appear. People started to ululate, you know, when you hear women going to be more boisterous. So it was wonderful. So I had a few moments like that of, like, amazing contact with Orthodoxy in Africa."}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":999.61,"end":1003.05,"speaker":"Jakub","text":"Wow. Well, I certainly wouldn't expect that to happen there."}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":1003.85,"end":1009.37,"speaker":"Jonathan Pageau","text":"Yeah, well, you can't know what to expect. Especially in Congo. Everything's possible."}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":1010.98,"end":1014.1,"speaker":"Jakub","text":"Okay, so thank you for that, but let's move on to."}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":1014.58,"end":1016.02,"speaker":"Jonathan Pageau","text":"Yeah, let's move on to something else."}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":1017.06,"end":1051.95,"speaker":"Jakub","text":"Okay, so the moment that I think I got what you meant was the Moana video, right? So you brilliantly showed that. Okay, so we have those images, but they present this deeper reality that tell us something about our current situation. The mechanics of the current world surface in that movie. And then we can see that. Right. And especially shocking was the scene with the pile of those flat stones and then the shell on the top. Right?"}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":1052.11,"end":1062.03,"speaker":"Jonathan Pageau","text":"Yeah, that was so clear. It was. I mean, if you doubt my interpretation up to that point, when you see that, that pillar with like, with a With this shell on top. It's pretty clear."}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":1062.03,"end":1067.29,"speaker":"Jakub","text":"Yeah, it was. It was definitely like the. The definition of this moment. Right?"}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":1067.29,"end":1067.77,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":1068.01,"end":1082.65,"speaker":"Jakub","text":"But then I checked the comment section right under that video, and there was someone talking about how the shell can actually be the, you know, the rainbow over the mountain, or that it can be the crown. The crown. Yeah, that's right."}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":1082.73,"end":1108.37,"speaker":"Jonathan Pageau","text":"Yeah. That's what makes it all very ambiguous and strange is that, in a way, maybe that's what's happening ultimately in this moment. But, you know, it does. Can I say this? It's that maybe that's what's happening, but it's also. There's a scandalous aspect to it. It seems to happen through scandal. But so it's like, we don't excuse the scandal, even though it might be ultimately revealing some little hint about how all the things come together."}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":1108.77,"end":1128.94,"speaker":"Jakub","text":"Yeah. So would that be okay to say that? So the patterns there we have the pillar and we have this, let's say, the crown. But then the interpretation is something else. Like if it's like a positive finishing up of the hierarchy, like the decoration, or if it's like the, I don't know, the harbinger of breakdown soon."}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":1129.26,"end":1164.31,"speaker":"Jonathan Pageau","text":"The thing is that in a way, so especially in Moana, what you have with people in Disney and a lot of this is that they have a very, very, actually profound and intuitive understanding of these symbolic structures, but they are weaponizing them. And so that's the problem. And so often some people point out to me, they'll say, like, there's this. This aspect which is. Seems to be true or seems to be pointing something true. And often they're right. So, for example, that image is very powerful, but in. In the story, it's represented as a kind of replacement scheme."}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":1164.55,"end":1165.03,"speaker":"Jakub","text":"Okay."}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":1165.03,"end":1260.6,"speaker":"Jonathan Pageau","text":"You know, because it ends with, you know, let's say it ends with. With Maui being completely left out of the equation. And then this, you know, the having Moana, that they solve the problem of the goddess and all this, like, it's a. This. These two women encountering each other ends up being the solution to the problem. And so it shortcuts the usual masculine feminine relationship which. Which brings about. That's like the birth of a. Of a new world. So. So the image, for example, the image. So the image of the pillar is. You're right, that it has. There's something of it that can actually reveal a high mystery about reality. But then it ends up being weaponized. So you. But you see that all the time. That, like I said, a lot of the people Even, even some of the wokest. The wokest of the woke. They, they. They have a very deep intuition about these patterns and they're using them. And that's why Christians. And that's, that's why Christians and people who don't want to be completely take over, taken over by this thing have to be able to, to understand it. It's the same with the rainbow symbolism, you're right. You know, the current ruling party that is ruling in terms of cultural narrative, they're using the rainbow in a way that is completely symbolically. Right. Like, it's not. It's a, It's a perfect understanding of the rainbow. It's just weaponized in one direction. And therefore it becomes a problem because. Yeah, because it, it is. It's almost like a devouring. It's using the ornament to devour the image. As you can imagine, the idea, like, of the pillar and the crown. It's like this crown is trying to eat the world. It's trying to devour the normal."}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":1260.84,"end":1281.12,"speaker":"Jakub","text":"Yeah, yeah, yeah. So, like, from the technical perspective, when interpreting, like a work of art, like a movie or animation of sorts, you get the full idea of what this pillar with this shell means in the light of the following scenes. Not in itself, like in isolation. Right, yeah."}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":1281.12,"end":1366.73,"speaker":"Jonathan Pageau","text":"So you always have to interpret the patterns as all together. And that's. I think I always tell people when you're interpreting a movie, for example, you have to stay inside the movie as long as possible because people tend to right away see something and say, oh, that's an image of Prometheus, you know, and then they jump out of the movie to now make these analogies. But, but it's like, wait, before you do that, why is that image of Prometheus used among all the other images that are there? You need to get that first before you tell me about something else. And so I always, that's my, always, my recommendation is for people to let the story tell you what its relationships are. So like, this happened again with. This happened, for example, in the Green Knight movie, where people would take certain aspects of the Green Knight story and then they would say, well, this is very. This is good. Like this is a powerful image of some powerful image. But like, okay, yeah, but you have to be able to account for all these patterns working together in order to really see what it's about and not just isolate one. And it's the same. So it ends up being the same with scripture. Right. Ultimately, with scripture, you have to kind of get to the basic pattern before you take a verse and you just say. And you just kind of put it out there. You know, a lot of. A lot of modern Christians, that's what they do. They just take a verse and put it out, and then it looks like it means something, but you always have to have it in balance with all the other stuff going on."}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":1366.81,"end":1377.37,"speaker":"Jakub","text":"Okay, so you teaching all of us to think symbolically, the symbolic way of thinking is a kind of apologetics, right?"}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":1377.77,"end":1396.31,"speaker":"Jonathan Pageau","text":"I mean, maybe. I mean, I think you could see it that way. Apologetics in the sense that it's at least proving, let's say, proving the case that the patterns that are in scripture are useful for you to. As a lens to see the world. And so it can open people up to wanting to explore them more, you know?"}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":1396.31,"end":1412.03,"speaker":"Jakub","text":"Okay, so do you think there could be a danger in that? Like you had with the Green Night? Like, people interpreting just things taken out of context, maybe. And maybe you can do the same thing with the scripture, right? And when you interpret."}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":1412.03,"end":1440.46,"speaker":"Jonathan Pageau","text":"Oh, yeah, for sure. That people do it all the time. With scripture, it happens all the time. You know, the word heresy. The word heresy means choice. Like, that's what it refers to. It's like a heretic is someone who takes an aspect of something and then takes it to the exclusion of the others. So you can. You can. You can use an aspect of scripture to create complete, you know, aberrant things, like things that aren't that are completely wrong if you isolate them from everything else."}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":1441.46,"end":1446.98,"speaker":"Jakub","text":"And symbolic thinking does not protect us fully from that. Or does it?"}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":1447.94,"end":1510.07,"speaker":"Jonathan Pageau","text":"Well, if you do it properly, it'll help, because what you want to do is you always want to be able to perceive the different aspects of each part. And so there's also. There's always. Especially like in Old Testament stories, I always tell people each character has set several sides to them. And so let's say, you know, let's say Jacob represents something in a pattern, but Jacob has a light side and a dark side. You can see. You can see the story from the perspective from different perspectives and see the effect from different perspectives. So that helps to. That helps to kind of balance things out. And so. But there. There are totally have been moments where people have pointed out to me, I think that I'm. That I missed some aspect. Like, for example, in the Moana video, there are people that said, well, you know, maybe you could see it this way. And I'm like, oh, you know what? There's. There's. Even though I do think that that's what Disney was Doing what I. My basic. But sometimes you can miss some aspects if you're too focused on that."}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":1510.15,"end":1513.27,"speaker":"Jakub","text":"Well, especially in the light of all the other movies they're making, Right?"}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":1513.43,"end":1566.65,"speaker":"Jonathan Pageau","text":"Yeah, exactly. If you see all these movies getting put out with all the same thing, you know, you can try to isolate one and say, this one isn't as bad, but, like, it's really happening in a way that's almost impossible to. I mean, if you look at what's going on now, it's just crazy. Like, it's. It's accelerating to levels that is just so caricatural and absurd. You know, like DC Comics, I think it's like almost every one of their characters now is like some LGBT character. It's like, you know, Wonder Woman is bisexual, Robin is bisexual, Superman is bisexual. Everybody is. Is one kind of. And that's just the first step because the bisexual one is the most, like, the easiest one to swallow because it's always. Still likes. But he's also, you know, and then. Then it's just going to keep going. It's going to get weirder and crazier and more insane."}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":1566.97,"end":1583.04,"speaker":"Jakub","text":"Yeah. Recently, I mean, like a couple of days ago, I showed your propaganda in pop culture video to my local priest, and he was like. His eyes were like. Became so big, and he said, oh, that's just Peterson on St."}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":1585.51,"end":1587.15,"speaker":"Jonathan Pageau","text":"What did you mean? Peterson on steroids?"}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":1587.15,"end":1594.71,"speaker":"Jakub","text":"Yeah, yeah. Because there's this saying around our part of YouTube that Peterson is the entry drug to Pajo. Right."}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":1595.43,"end":1596.07,"speaker":"Jonathan Pageau","text":"Okay."}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":1597.59,"end":1652.04,"speaker":"Jakub","text":"So, yeah, when you notice those patterns in several movies across, like, across the whole spectrum of movies, then it's like so obvious that you just cannot simply deny it. Right. I have a question, because I had this problem recently analyzing waters above in one of the animes, because you talked a few times about waters above already. But I don't know, because when the mountain is putting us in the direction, putting us up, like we're looking up, and then above us is also water. It's usually, as you say, it's usually a water of blessing. But then in that particular anime, and maybe that was just one scene, or maybe the Japanese culture is somehow disconnected from this way of thinking and it just doesn't work. There. There were monsters as well, like the whales and."}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":1652.04,"end":1670.68,"speaker":"Jonathan Pageau","text":"Yeah, there are monsters there. I would think even in Western. I mean, you know, the story of Jack and the Beanstalk, that's the short. Jack and the Beanstalk has the same. So you go up the ladder and then you encounter giants in the heavens. So why. Right, right."}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":1670.68,"end":1687.6,"speaker":"Jakub","text":"So the question is like we are kind of. The hierarchy is built to somehow escape from the flood that is below or the waters below, but then it moves upwards toward like waters as well. Is this the way to move?"}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":1689.44,"end":1793.68,"speaker":"Jonathan Pageau","text":"Well, like in terms of the monsters above, you have to understand them as. You have to understand it frac. Like as a fractal. So in the same way that, in the same way that when you let that you go into the temple, you will encounter a cherub at the, at the door of the Holy of holies, or if you're going toward Eden before you get to Eden, you'll encounter a monster at the Gate of Eden. So the Gate of Eden is higher than you, right? It's. It's already above you. So there are traditions, for example, that talk about how the dog headed men are both like monsters from the edge of the world, but they are also guardians of guardians of Eden. So all of this is related. It's the idea that it's like if you're in a world, right, so imagine you're in any world. So the world has a lower part and the world has a higher part. A part that gives itself to something above. Now if you move down, you'll encounter monsters, you'll encounter Cerberus, you'll encounter, you know, the kind of tonic monsters, these earth monsters, you know, whatever it is that you. The freaks, the Amazons, all of this is at the, it's at the lower level, okay? And the demons and all that stuff you see in Western imagery, the demons are underground, right? And they're mixtures of all these kind of creatures. But if you go up, right, you encounter angels. Angels are monsters too. I don't know what to tell you. They're men with wings, they're hybrids. But it's not the same. It's a different. You have to be careful, right, not to mix them up, not to confuse them, because one of them is like a guardian for a higher level. The other one is, let's say."}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":1795.44,"end":1795.72,"speaker":"Jakub","text":"You."}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":1795.72,"end":1832.58,"speaker":"Jonathan Pageau","text":"Could say that it in a way might act as a guardian for even lower level. So Cerberus is a good example. Cerberus stops people down here from coming up, but he also acts as an image of Hades for that person that's coming this way, right? So it's like if you're coming this way, you could be eaten by Cerberus. Cerberus is preventing these things from coming up. So you can understand, you can always understand it that way. So when you're going up, then you'll also encounter a guardian and then that guardian will stop you from going up. But it'll be like the lower aspect of the higher world is the best way to understand it."}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":1832.58,"end":1833.22,"speaker":"Jakub","text":"Okay."}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":1833.7,"end":1890.16,"speaker":"Jonathan Pageau","text":"So you could see it as a support. Right? So, for example, so the cherub guards you from. It's not necessarily a monster that eats you can also be dispotential. So like a monster, the cherub acts as a guardian to the Garden of Eden, but the cherub is also the mount of Yahweh. Yahweh rides the cherub across the heavens. So you see that in the Psalms. So he's the potential. He's the throne. Right? He guards the throne of God and the throne itself. Like the reason why some angels are called thrones is not arbitrary. Right? They're the lower aspect of what is above us. So they function in a similar way as the throne that would be below and would have like, you know, imagine a throne with like, you know, like lion feet. Like you see in a lot of these thrones, like, that's what a throne is. A throne is potential that seats your authority. You sit, you establish your authority on your throne. And so it becomes an image of your kingdom."}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":1890.16,"end":1895.88,"speaker":"Jakub","text":"You could say, so the throne is potential, and then the crown is potential. Right, but it's different."}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":1895.88,"end":1927.9,"speaker":"Jonathan Pageau","text":"It's. The crown is glory. The crown. The crown is glory. But they're related. They're related together, but they're not the same. And you could say that metaphysically, ultimately, in God they're the same, but not in the world. And you have to be careful not to confuse them because that's. You could say that that's the trick, right, that's happening now. One of the trick that's happening now is to confuse the lower waters with the higher water and to try to, try to change, try to kind of switch one for the other."}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":1927.98,"end":1928.38,"speaker":"Jakub","text":"Right?"}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":1928.38,"end":1933.5,"speaker":"Jonathan Pageau","text":"So you have an intuition, right, that let's say the crown is the highest."}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":1933.66,"end":1934.58,"speaker":"Jakub","text":"Yeah, yeah, yeah."}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":1934.58,"end":1942.35,"speaker":"Jonathan Pageau","text":"And so, so then with what the world is trying to do now is, is to put the monster up there as the crown, but the lower monster."}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":1942.59,"end":1943.07,"speaker":"Jakub","text":"Yes."}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":1943.07,"end":1950.59,"speaker":"Jonathan Pageau","text":"So that's what's going on. Like, it's. That's why the highest God right now is, you know, intersectional monster."}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":1950.91,"end":1958.43,"speaker":"Jakub","text":"Okay, so that's the flood. That's what we worship, and that's the flood at the same time. Because the above and the below are mixed."}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":1958.43,"end":1970.78,"speaker":"Jonathan Pageau","text":"Right, so exactly. So you could say that it's an image of the flood because that's exactly what happens during the flood. The waters from below come up and the waters from above come down, they mix. They mix together, and then the world ceases to exist."}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":1970.94,"end":1972.22,"speaker":"Jakub","text":"Okay. Okay."}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":1972.38,"end":1978.78,"speaker":"Jonathan Pageau","text":"That's why a lot of this stuff is like. Is basically it's destroying the world, it's destroying the categories."}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":1979.26,"end":1996.07,"speaker":"Jakub","text":"And is this war always going on? Like, do the margins always attack the center, or does the center always try to expand to get the margins? Or do we have a stability at times? Or is this always, like, is there always this turmoil?"}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":1996.87,"end":2061.13,"speaker":"Jonathan Pageau","text":"I think that there's always a tension, but I don't think that it's necessary to be conflict all the time. So I think that there can be, let's say. So, for example, like the image of Yahweh riding the cherub, Right? So that's an image of a balanced relationship between the margin and the higher aspect. You know, you can imagine, for example, moments where the stranger is a wonderful relationship of trade with strangers or with other empires. You have an empire and then you have these other empires, and they're able to have enough peace so that they provide potential for each other, and they actually kind of increase the possibilities of each. And so that's. Though there are moments like that in history, I think, but it's difficult to kind of maintain that. And then things tend to get pulled a little bit on one side too much, and then they move to the other, and then you get this pendulum, and before you know it, you have war."}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":2061.77,"end":2070.65,"speaker":"Jakub","text":"Right. As for war, I haven't done a Dune video because I was really expecting that you would do it."}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":2072.43,"end":2079.63,"speaker":"Jonathan Pageau","text":"I don't have a Covid passport, so I haven't seen it. So I'll watch it as soon as it comes out here in streaming, I'll just get it and watch with my family."}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":2079.95,"end":2084.91,"speaker":"Jakub","text":"Okay, but. But movie. The movie is one thing, but you know the story, right? You've read the books or."}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":2084.91,"end":2086.03,"speaker":"Jonathan Pageau","text":"I know the basic story."}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":2086.03,"end":2087.07,"speaker":"Jakub","text":"Yeah, basic story."}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":2087.15,"end":2109.95,"speaker":"Jonathan Pageau","text":"I tried reading Dune several times, but, man, I don't. I really don't enjoy it. And I never finished. I read, like, some of the later books when I was younger, but then I tried reading the first book again just two years ago, I guess, but I just didn't, like. I just didn't. I found the writing to be. To be too, like, really heavy and very winded. Long winded, I would say."}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":2110.27,"end":2150.72,"speaker":"Jakub","text":"Yeah, well, Tolkien didn't like it either. So you're in the same thing. I mean, the main question I have about Dune is whether it is the Return of the King story or the Barbarians at the Gates. Like when Paul gets the Fremen to take over Iraqis again is this. And I don't know how to interpret that because, like, with each book, with each next volume, the story develops and it's never finished. So the consequences of that one action are spread across millennia. Right."}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":2151.28,"end":2157.09,"speaker":"Jonathan Pageau","text":"So you want to know if. If it's the. If it's the return of the king or the invasion of the barbarians, right?"}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":2157.09,"end":2157.57,"speaker":"Jakub","text":"Yeah."}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":2158.69,"end":2167.89,"speaker":"Jonathan Pageau","text":"So this is gonna. It's gonna not. This is not gonna be particularly. It's giving an answer that might frustrate people is that. That really depends on the point of view."}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":2168.21,"end":2169.29,"speaker":"Jakub","text":"Right, Right."}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":2169.29,"end":2172.37,"speaker":"Jonathan Pageau","text":"That's what. That's this. That's the thing. So think about."}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":2173.33,"end":2174.45,"speaker":"Jakub","text":"That's the postmortem."}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":2175.97,"end":2266.19,"speaker":"Jonathan Pageau","text":"King David is a great example, right? So King David associates himself with a bunch of thieves and thugs and like, lives as an outlaw in caves. And so when he becomes king, from the point of view of King Saul, it's definitely not great. But for sure, from the point of view of David, then it's the arrival of the hidden king. It's the arrival of the true hidden king. And so it's not. It's. Sometimes it. Stories can have multiple. Can be. So the pattern is true, right? The pattern of the invasion of the barbarians is true. I'm not being a postmodern and saying it's all mush and it's all. It's all. It's all whatever you want it to be. It's like the pattern of the return of the king or the hidden king, the secret king manifesting himself is true. The pattern of the invasion of the barbarians is true. But sometimes one can be the other pattern from a different perspective. And so. But there's also, like, you could say that you can also have things like patterns of, like the. Let's say the king wielding old potential, like something which was forgotten or something which had lost. You know, so. And a good example is. So is. Is Moses leaving Egypt, right? Is it Egypt falling into chaos and losing control of its hierarchy? Or is it the establishment of a new identity and a. You know, it's both at the same time."}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":2266.35,"end":2273.27,"speaker":"Jakub","text":"That's exactly what I struggle with each time I see a movie. Now try to make something that's great, dude."}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":2273.27,"end":2283.11,"speaker":"Jonathan Pageau","text":"If you can. If you're able to perceive the patterns from the different perspectives, then you can come a lot closer to insanity."}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":2283.11,"end":2283.55,"speaker":"Jakub","text":"Yeah."}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":2284.35,"end":2335.62,"speaker":"Jonathan Pageau","text":"No, not. Well, if you're careful, you can mostly understand that. Let's say meaning is everywhere, right? That the. The patterns are there and in their. In their complexity and their multiplicity. And if you were able to see that in a movie. Then when you go back in Scripture, like I said, you'll have a much deeper understanding of what's going on there because you're able to see, like, for example, Matthew was. Was really good at this. And. And then I tried to kind of follow in his example. He would always try to say, okay, so let's read the story from the point of view of the Egyptians in the text. Like, not, not. Not trying to, to, to, to. Or, for example, think of a proverb where it says, if you do this, this will happen. You know, and the first reading is that this is negative. But then asking yourself, is there a moment where I would want this to happen?"}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":2335.94,"end":2336.34,"speaker":"Jakub","text":"Yes."}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":2336.34,"end":2369.33,"speaker":"Jonathan Pageau","text":"Right. And are there stories in the Bible that manifest that this relationship of causality in a positive way, even though usually we think it's a negative? You know, so if we want you do that, then you can. Then the story of Samson opens up to you. And a lot of the stories in the Book of Judges that people have no idea what they're about will kind of open up to you. So for sure. So, I mean, I would say, yeah, I always be careful not to go crazy, but think that it's a good tool to. It's a good mental exercise to do that."}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":2369.41,"end":2379.33,"speaker":"Jakub","text":"It's like the stumbling stone that destroys the hierarchies. It's not necessarily like the thing that is bad, but not necessarily."}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":2379.33,"end":2448.26,"speaker":"Jonathan Pageau","text":"Exactly. So a good. Yeah, so the example in the vision of Daniel, right. In the story of the. In the vision of Daniel, then you see how this uncut stone which comes from the mountain, crushes the feet of the hierarchy and then it comes tumbling down. The description of the hierarchy is pristine. It's the best. One of the best descriptions of hierarchy that exists in Scripture is the statue of Daniel. And you can apply that hierarchy to the temple. You can actually apply the vision of the statue of Daniel, which is an idolatrous evil hierarchy. You can apply it to the way in which, for example, the metals are used in the temple. It's the same. Yeah, but. But in that case, then the stone that comes to crush it. That's. I mean, if you can get into that space, dude, you. You're. You're in a good. You're in a good. You're in a good. On a good road. But it's like you said, it's hard. And the hardest part of it is communicating it because, yeah, like, if you see me in a Q and A hesitating, like, and going, I'm not sure I want to talk about this, because communicating the different aspects and communicating some of this subtlety and complexity is difficult."}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":2448.5,"end":2473.22,"speaker":"Jakub","text":"Yeah. And I mean, I feel the danger of it because I really feel that, like, if I asking myself if I'm going, like, too far into. Into. Into one of those interpretations, that. That I could, like, I could motivate a crazy interpretation of something because, you know, I see the patterns and it works like that, like this for me. And then, you know, yeah, go for it. Try the religion."}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":2473.22,"end":2614.62,"speaker":"Jonathan Pageau","text":"Right, sure. You have to be careful and kind of pull back, you know. And then also, you know, you could see it as. Can I say this? You could. You need to have a hierarchy in interpretations as well, you know. And so, for example, let's say the story has a structure. Let's say the scriptural story has a structure and has a main thrust that is important to maintain. And then let's say ornamentally or more marginally, then those variant interpretations are real and they're possible, but they're only good if you keep them in the proper order. Because if you don't, then you get very dangerous. You get a very dangerous thing. So, for example, you could say, is it possible to understand the story of Cain and Abel from the perspective of Cain? And the answer is, of course you can. And doing that can actually help you understand, like I talked about subtly, like, why Christ saves Rome, why Christ is Roman, is to be able to perceive the story from the point of view of Cain or the point of view of Esau. But that's. If you. If you're not careful, then you come up with. People will come up with, like, Luciferian interpretations of scripture. They don't have a normal hierarchy. They will flip it upside down. And you see that, like, a lot of the kind of occultist Luciferian interpretations are just them taking the pattern, flipping it upside down and saying, oh, this works, and then wanting to kind of embody it. You have, like, an early Christian sects. Like, you had these. They were called Cainites, for example, and they had completely embodied the idea of, let's say, the upside down as their story. You see that in also in some of the weird kind of kabbalist sects, like in the frankism and all these kind of weird late kabbalistic sects where they basically said it's like, will just do the opposite of the law in order to show the totality of the patterns. Like, dude, that's not good. Like, that's. That'll destroy the world. Like, that will destroy the world."}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":2615.26,"end":2618.14,"speaker":"Jakub","text":"Yeah, maybe the world should be destroyed, right?"}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":2619.18,"end":2632.36,"speaker":"Jonathan Pageau","text":"Yeah, but what did it, what did Christ say? I mean, Christ always has the best answer to that. He says all will be revealed, you know, all the stones will be overturned. Scandal must happen, but woe to those by whom it happens."}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":2632.6,"end":2633,"speaker":"Jakub","text":"Right?"}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":2633.24,"end":2680.75,"speaker":"Jonathan Pageau","text":"It is the world, the things. So it's something like, for example, accelerationism. So people who want to embody accelerationist ideas who want to bring about the end of the world. Right. So there are people out there that what they want to do is they want to bring about the end of the world. So what they're doing is they want to accelerate the process, okay. So they will embody things that they think are evil. The LARP as the, their own political enemy. They'll pretend to be super woke in order to provoke the hard. Right. In order to provoke, right. To create more and more of this chaos so that this world will end and something new will come out of it. Now, like the thing is, what people don't realize is that that plays out in you as well."}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":2680.91,"end":2681.39,"speaker":"Jakub","text":"Yeah."}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":2681.39,"end":2710.98,"speaker":"Jonathan Pageau","text":"So it's fractally true. So if you do that for society, don't think it won't affect you. And so you will be one of those that perishes in the flood that you're trying to bring about. You're not going to make it through. So that's why Christ says things like that where he says, you know, like we know scandal must happen, the Antichrist must come, Antichrist must appear. It's all part of the pattern. Understand that it's going to happen. But that, that, that doesn't mean that you should play a part in bringing it about because it'll destroy you."}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":2711.54,"end":2713.78,"speaker":"Jakub","text":"Sorry man, I think."}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":2713.78,"end":2715.46,"speaker":"Jonathan Pageau","text":"Am I feeding your insanity now?"}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":2715.46,"end":2723.3,"speaker":"Jakub","text":"Like, no, no, no, it all works if you know, the children of the revolution being eaten, et cetera, et cetera. It's all the same. It's all the same."}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":2723.86,"end":2724.5,"speaker":"Jonathan Pageau","text":"Exactly."}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":2725.22,"end":2779.8,"speaker":"Jakub","text":"And the famous line from, from the dark night like that some people just want to watch the world burn. And that's, that's, that's what you just laid out. So. Yeah. And it seems changing completely the direction with Bitcoin again, you recently spoke to that guy and it's the same, it seems that two patterns or the two phases of the same pattern are going on there. Bitcoin is supposed to topple the central banks, but are the central banks the proper hierarchy or are they the corrupt hierarchy? And Bitcoin has this, is this people that keep using that immaculate conception of Bitcoin. It's the savior of the monetary system or something. How to interpret the bitcoin? Is it one or the other or is it both? And you never know."}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":2779.88,"end":2798.67,"speaker":"Jonathan Pageau","text":"No, but the thing. How can I say this? So, for example, let's say the decentralized idea, the idea of the decentralized blockchain and to create a completely decentralized network that is almost automatic because it doesn't have a hierarchy."}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":2798.67,"end":2799.11,"speaker":"Jakub","text":"Yeah."}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":2799.11,"end":2831,"speaker":"Jonathan Pageau","text":"It's like those things don't exist in a vacuum. Like, something like that will call to more control and more. It was the same with. You saw. You saw it happen in the Internet. Right? The Internet. It was like, oh, this great thing where now all of a sudden everything is available and everybody can just say whatever they want and everybody can be anonymous and do whatever they want. And people thought like it was basically manifestation of a kind of anarchic freedom. And it was for a while. Right. But now look at it."}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":2832.04,"end":2832.84,"speaker":"Jakub","text":"Right, Right."}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":2833.64,"end":2887.87,"speaker":"Jonathan Pageau","text":"Because extremes call upon each other. Right. Extremes call to each other. And so the idea that bitcoin will just be left to exist. And that's why, if you watch my conversation with. Actually, I think it's not out yet. I did a conversation with Robert Breedlove that's going to be on his podcast, I think. And I kept bringing it back to guns and weapons and saying, in the end, it's like, this will play out. The power of the mechanical state that has weapons is going to play itself out in terms of. Bitcoin is not just going to remain online. If bitcoin becomes a threat to the system, it's going to play itself out in the streets with. With real dangerous weapons. It's not going to continue to just be online. It's a silly idea to think that that's how it's going to play out anyways. I think it's naive. It's going to call for more control."}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":2888.11,"end":2892.91,"speaker":"Jakub","text":"If people want to defend bitcoin, they will eventually have to do it in the streets. Right."}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":2893.39,"end":2958.46,"speaker":"Jonathan Pageau","text":"I mean, I don't know how it's going to happen, but I'm just saying that it's not a simple. It's not simple to think that it's just going to take down the central bank. And like I said, it's like the idea that bitcoin is secret power is not necessarily something that you want either. It's going to reveal all these. So basically you have right now possibly massive billionaires. And if bitcoin keeps going up, maybe you'll have trillionaires, Bitcoin trillionaires, who are their only reason why they're trillionaires is because they own this coin. That's the only reason. They never built anything, they never done anything. They've never managed people. They're just people who bought this coin. And so is that who you want to rule you? I'm not saying the people that are ruling us now are doing a great job. It's horrible, and there's a lot of horrible stuff going on, but it's like, am I going to trade that for a bunch of guys that bought Bitcoin in 2011? Really? No, thank you. Seriously, no, thank you."}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":2960.62,"end":2982.18,"speaker":"Jakub","text":"I think there is some evolution in your ideas about governance. Correct me if I'm wrong, because I remember you telling us three, four years ago maybe, about obedience to the authority, right. And you still keep that. But when Covid came, like, you had expanded this view on."}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":2984.1,"end":3061.38,"speaker":"Jonathan Pageau","text":"Super obedience, if you want to know my position now, is that sometimes you have to disobey, and you disobey and you accept the consequences. That's the way that I see the saints do it. It's like if you look at the way that, let's say someone like Saint Maximus the Confessor, for example, he just said, you're wrong. He told the emperor, you're wrong, Emperor. You've got it wrong. And the emperor's like, if you keep saying, I'm wrong, I'm going to hurt you. And he's like, you're wrong. And so he cuts his hand off, okay. And then St. Maximus says, you're wrong. And the emperor says, if you keep saying I'm wrong, I'm going to hurt you. So he cuts his tongue out. And then Saint Maximus gets sent into exile. And it's like, I'm not saying that. That's easy, but I'm saying that. So St. Maximus never said. Never tried to get an army, never tried to raise an army to fight the emperor. Like another character in the Middle Ages who disagreed with his hierarchy, let's say. So you can see the difference between a revolutionary and someone who disagrees for the sake of the world itself, because that's what I think. But, I mean, I don't know when things hit the fan, like, who knows how it's going to play out because it's not getting better. That's for sure."}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":3061.54,"end":3086.16,"speaker":"Jakub","text":"That's for sure. Yeah. Well, on this positive note, I want to thank you very much for coming to my channel, especially in the. In this time when it's like, it seems that you have an interview every day somewhere, and you're becoming very popular very quickly. Especially with God's dog and everything that is going around it that you found."}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":3086.16,"end":3095.52,"speaker":"Jonathan Pageau","text":"Well, thanks for the. I really love your interpretations and I like, I remember the first time I saw them was actually Matthieu who sent me your video. Yeah. I don't know how he had stumbled."}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":3095.52,"end":3098.2,"speaker":"Jakub","text":"Upon it and how that happened."}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":3098.76,"end":3111.06,"speaker":"Jonathan Pageau","text":"Yeah. And so we both, we both really, we really saw that you have a very, very strong symbolic intuition. And so if you cannot go crazy like I think it'll, I think it'll serve us all well."}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":3112.82,"end":3126.02,"speaker":"Jakub","text":"I'll try. I'll try. I tried to carve out a niche with that anime and symbolism, but it seems that this, this niche can be non existent almost because like there aren't many people interested in both things at the same time."}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":3126.42,"end":3148.48,"speaker":"Jonathan Pageau","text":"Yeah. But I mean I would say just, I would say to keep doing what you're doing and to do it the best you can. And I mean it's sure. Also the fact that a lot of your videos are in Polish is obviously limiting to their reach, let's say. So that's definitely going to happen. But for sure the ones that I saw in English were really excellent. So yeah, keep going."}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":3148.56,"end":3161.3,"speaker":"Jakub","text":"Yeah. So thank you very much and I invite everyone to go and buy and support God's dog and I hope that this develops into like a multi book series and then who knows what."}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":3162.58,"end":3166.18,"speaker":"Jonathan Pageau","text":"Thanks Jakub. I really appreciate it. It's good to meet you in person finally."}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":3166.26,"end":3168.3,"speaker":"Jakub","text":"Thank you, Jonathan. See you. Have a nice day."}
{"episode_id":"SW - #209 - 2021-12-22 - How to Navigate Symbolic Interpretations - Symbols Patterns Hierarchies","start":3168.3,"end":3230.18,"speaker":"Jonathan Pageau","text":"I hope you enjoyed this episode of the Symbolic World. The Symbolic World is based on a series of videos that you can find on my YouTube channel, Jonathan Pedro's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course leaving a review on itunes. Everybody knows that's the best way to get the podcast out there to get it heard. And if you want to get involved, you can also support the podcast financially going to www.thesymbolicworld.com support or else on Patreon, the Pageau videos as well and on SubscribeStar, all those links you can find on my website or in the show description. So thank you and I will see you soon."}
