{"episode_id":"SW - #345 - 2024-06-22 - Fairy Tales as the Music of the Spheres","start":12.16,"end":1654.34,"speaker":"Jonathan Pageau","text":"This is Jonathan Pedro. Welcome to the symbolic world. If I have a pattern of behavior, it is always towards a purpose. And then we realize that that's what patterns are actually for. And so every time that we experience multiplicity coming into one, Every time we experience variability that suddenly appears as it's moving towards purpose. What's happening is we are experiencing. Experiencing the music of the spheres. We're experiencing the pattern of the cosmos. And it brings us great joy. Every time you see a great past in a football game, you're experiencing the music of the spheres. Because you see these several players moving. And all of a sudden something happens. He throws the ball and the other person is exactly in the right place. For some reason, they're not even looking at each other, but they know where to be. And he catches it. And we rejoice. Why do we rejoice? If you break it down to its elements, it's pretty silly, right? Why do we rejoice? We rejoice because we see multiplicity come into one. We see action move in pattern towards purpose. And so we experience the music of the spheres. When. When we see a cook make a great meal. Because they take all this stuff, the meat, the vegetables, the spices. They bring them together, they mix them up. But not just mix them up. They move them towards purpose. And so when we eat the meal, we rejoice because we're experiencing the music of the spheres. We're experiencing multiplicity move into pattern, multiplicity move into purpose. And so this image, the image of the heavenly man, if we can put it up again, of the heavenly man that is at the center of the spheres, it can help you understand a lot of aspects of that story. That's why, for example, when he's born, there's a choir of angels. A choir of angels is the same as the heavenly spheres. It's just exactly the same. There's no difference. It's just music coming from above. Something which is revealing to us the great pattern. Something that's happening in the world which is hiding in it a greater purpose and a higher pattern. So it's the same when we see people dance. We also have that pleasure. It's like, why do we enjoy dancing, especially dancing with someone else, right? Because then all of a sudden you do see this multiplicity come together. You do notice that you're moving in unison with someone else. That all of a sudden you act and they react. And there's this back and forth. And that is the music of the spheres. And we especially experience the music of the spheres in A great conversation. The. The cognitive psychologist John Vervecki talks about Dialogos. He explains this idea that when you enter into a real conversation and everybody has had that experience where all of a sudden you're carried, you know, and you build on each other's discussion, so maybe you push back a little, but you nonetheless bring the person further, and they push you back a little, but nonetheless you're brought further. And all of a sudden you notice that there's almost like a third being in the room, that there's almost a third reality, which is the conversation itself. And you know that that third reality could not exist if you were alone, just thinking about whatever you're thinking about in your room, you know. And the great theologian Bulgakov saw that reality as an image of the Trinity itself, that this capacity to enter into conversation or into communion with someone else, coming into common purpose, and that common purpose appearing as the frame or as a third reality in our communion, that it was an image of the Trinity. And so this image of the music of the spheres is something that continues on until today. What does this have to do with fairy tales? My contention is that fairy tales are like tuning forks. Fairy tales are mechanisms by which we participate in that music, but also mechanisms by which we train ourselves in the grammar of that music. And so it's both a participation, but it's also a training. And the way we can think about it, we can think about the origin of fairy tales. You know, this is a speculative origin, but you'll notice that it's not that far fetched. And so you can imagine a great way to think of fairy tales. You can imagine a bunch of grandmothers in villages telling stories, you know, telling stories that are. And noticing when they tell certain stories with certain aspects that all of a sudden people's attention perks and they're like, oh, now they're listening to what I'm saying. And then the person listening to that remembers that when their grandmother told that story, people were paying attention. And so then they tell the story in the same way, maybe they modify it a little and they notice, oh, when I modified too much this way. Well, nothing of this is conscious. By the way, they noticed that when they modified a little bit this way, then people stopped paying attention. If they modified this way, oh, then all of a sudden people are paying attention even more. Now imagine that happening over 40,000 years. And so salient stories that gather attention, that are remembered and are transmitted, and nobody has to know why. Nobody has to understand the story. Some people do, but most People don't. And that actually doesn't matter. All that matters is the attention, the memory and the transmission. Because the music of the spheres is the meaning of things. It's the purpose of things things. It's the way that the pattern comes together. And so when you remember something and when you transmit it, you're participating in that game. You're participating in the game of meaning, in the game of relevance, maybe is a better word even to use that the stories that are relevant will be transmitted and remembered by the very process of storytelling. And there's almost no way around that. For the same reason that certain TV series become more popular and are remembered, for the same reason that certain songs are more popular and remembered, it's because they have something in them that capture more attention. And you can measure that over, you can do a, how can I say this? You can do a shock version and get attention, very short attention. And then some people will do that even in the music sphere, but usually that attention peaks and then goes away. What happens over time is that the regular pattern of attention gets remembered. And so the stories will kind of move up and down, will change, but nonetheless will keep transmitting that capacity for attention, for memory and for transmission. And so it's a very, it's a very powerful, it's a very powerful vision. Because what it means is that you can trust the fairy tales. You can trust those stories that have been transmitted over thousands of years, hundreds of years. You can trust them even if you don't understand them, because they must necessarily manifest the pattern of human cognition. They must necessarily manifest the pattern of human attention, of human memory and that music of the spheres. And so we have, therefore in these stories we have very powerful tools and you know, we change them to our peril. We're actually dealing with the Chesterton's fence situation here, is that when we come up to the stories and we try to modify them too much, we're actually, especially if you're dealing with children, you're actually in danger of twisting their attention. Luckily, in the long term, the twisted versions will go away, they just won't be remembered. The political ones, the ideological ones, all these twisting of fairy tales that we've seen in the past decades, they. Nobody will remember them in the long term. The damage can be short term, sadly. And so we still, we have to be attentive to that. We have to be attentive to the short term damage that changing them. But what we know is that we can trust these stories because they do contain this powerful structure in Them. And in that way, I would say that they are indistinguishable from myth, you know, and in a similar way, I would say not as much. They are very close to Scripture. They're not exactly Scripture, because Scripture is elevated. You know, the fairy tales are not elevated. They're just remembered, transmitted. And therefore, they definitely contain the basic structure of reality in them. For some reason. We have certain texts, we have certain stories that we elevate on purpose and we put above us, and we all look to them as shining beacons. So those stand above, but they're very close. Fairy tales are the closest thing to scripture that you can find besides Scripture because they have that same. The same code or the same underlying structure of reality and this capacity to perceive meaning and to transmit it. And so one of the great things about the fairy tales right now is that especially for you, all of you that are teaching, those of you that are teaching children, is that, you know, the Iliad was not meant to be read. Ultimately, you know. And you all know that, right? The Iliad was told around the campfire. The Iliad was told to warriors who came back from battle to help them to return to their land, to kind of go through the process of all the horrible things they have done by. By participating, by remembering, by engaging with the great heroes of the past that had to make the same types of sacrifices, made the same types of errors. And so it was really a participative act. The Iliad was a ritual text, and we have very few of those left. We're so used to entertainment culture, and we're so used to passive reception that we've forgotten that these stories, they are meant to participate. And just like the great conversation that I mentioned at the outset, how the great conversation participates in the music of the spheres, well, that's what telling a fairy tale to a child does, especially if you do it while you're being attentive, being attentive to the child, not just telling the story, but watching the child and watching how the child responds and interacting with the child as you tell the story. You're really participating in that great cosmic music. So it's an amazing opportunity that we have because it's one of the last remainders of the ancient world that we have the capacity to sit with children in a classroom, in a group, around a fire, as you're tucking them into bed and tell them a story. You know, this is one of the last remainders of these great worlds that we love from the past. So we have to cherish it. And we have to really engage with our children in that vision and understanding that it's not just about information when you're telling a fairy tale. It really is a tuning fork for reality. And in ways that often we even don't understand. The fairy tales have cosmic structures. Fairy tales are not morality tales, I hope. If you've read the Grimm fairy tales, you probably know that it's like, try to find the moral story from Puss in Boots. Like, really try hard to find a moral story out of Puss in Boots. Very difficult. But nonetheless, we tell the story, the children love it, they remember it. We don't know why, because fairy tales are not moral stories. They have morality downstream from them. But actually, just like the Bible, stories are often not moral stories, especially the Old Testament stories. If we can actually stop thinking that Old Testament stories have to be moral stories, we probably could appreciate them more, because then we go in there and we're shocked at every story because it doesn't fit the way we think things should happen in a nice, decent, puritan moral story. So the fairy tales don't have that at all. The fairy tales are. They are cosmic images. And like I said, I think it is the time to enter into it in a way that is living. And so this is what I've decided to do now for the past few years, because of what I've seen happen in the world. I decided to kind of enter into it because it's also dangerous, I think, especially for people that love classical education, to just see the fairy tales as texts and say, like, oh, we're going to read them, Grimm. Well, the truth is that Grimm didn't make up these stories. They didn't come up with these stories. You know, we're gracious to them because they translated them, because they collated them, because they told them in a beautiful poetic way. We have to be grateful for the them for that. But all of them, the Perods, the Grimms, all of these people that brought the fairy tales together, none of them wrote them. So we have to be careful not to treat them as we treat a novel, for example. You know, it's like little women in fairy tales. They don't inhabit exactly the same world. The fairy tales is like a grammar, right? It is like music. And that's why they rhyme with each other, too, right? The fairy tales look like each other, you know, oh, wait a minute. Why? This woman falls asleep in this fairy tale, and then she falls asleep in this fairy tale, and then, you know, and you see, like, there are These things that repeat each other. And then you think, oh, she eats an apple and she falls asleep. That looks like another story I've seen in the Bible somewhere. I don't know what's going on. But you notice that these stories are different. They have this kind of grammar of repetition, of pattern, that musical pattern. And so that's the way that I'm encouraging you to engage with them is that, yes, of course, read the kids the grim version, but also enter into the grammar of the stories, right, and see how you can actually play with it to some extent. And I think that that's something that possible to do with great reverence and love for the stories. And so I'm going to take you just quickly through our project that, that we're embarking on. So I've started now with eight fairy tales. I'm going to tell eight of the most known fairy tales that you can imagine. Snow White, Cinderella, Jack and the Beanstalk, Rumpelstiltskin, all the very, very known ones. But enter into them with that desire to first of all celebrate them, but then also a desire to play with the musicality of the story, you know. And so I've also noticed that when Snow White eats the apples, she falls asleep. And that looks like a story in Genesis. So I can add a few little details in the story to make that more salient. I'm not going to change the story, right? I'm not going to twist it and turn it, but I will bring out or make certain elements shine, you know, to kind of participate in the great symphony. A good way to think about it, you know, and to add my voice to the symphony of the stories. And so we have. And one of the things that's interesting that's happening now as well is that there are a lot of. There are a lot of artists that are tired of the way culture is going and you'd be surprised how many there are writers and artists and musicians. And now is a really great time. Pay attention. For the next few years, you're going to see things shake because a lot of the artists are checking out and they want to now move into a rekindling and a recapturing of these ancient stories in a powerful way. And so I was able to get an artist for this book who was a designer for all the great franchises, right? All the Disney's and the, you know, and the Marvels and Harry Potter and all that stuff. And so. But nonetheless, her love of the true fairy tale made her want to move on to a project like this. Where if you tell a. And it's so funny because, you know, if you tell a literary agent, I'm going to write a version of Snow White, and they ask you, well, what's your take on it? And it's like, no, there's no take on it. I'm actually going to tell the story. Story of Snow White. And, you know, and it's funny because obviously nobody. I mean, soon people will understand. But at the outset, people wonder what's going on. But, you know, nonetheless. We sold out the first print of the book. I was actually supposed to have books tonight, but I don't have any because we just sold out all the books. And so the moment is happening. Like, the moment is clear. So what I want to do is I want to take you through a fairy tale. And this is actually a fairy tale that we're going to tell, but I want to kind of take you through it to help you hopefully see a little bit of how it is a cosmic story, even though it is couched in rather silly imagery, you know, and things that. Stories that we've heard since we've been 10. And that the type of story that the new atheist will mock Christianity as looking like, it's like, I'm happy that the Bible looks like Jack of the Beanstalk. Jack of the Beanstalk is an amazing story. It's an amazing cosmic story. So we're going to go through Jack of the Beanstalk, and hopefully you'll be able to start to see how we can play with this and how this makes sense. All right, so Jack and the Beanstalk is also a story that I'm fond of right now, because a lot of the fairy tales that have been popular in the past decades have been about. Have girls in them. And a lot of the fairy tales that I'm telling also will have female protagonists. This one is a story that has a male protagonist. And it's interesting because I think that it has to do with that as well. It has to do just like Snow White or Cinderella to some. To some extent, are the transition of a young girl to womanhood. I think Jack is also about that for a young boy. So we kind of look at it and see. So Jack doesn't have a father. That's important in the story. I think he has two things. He has a mother and he has a cow. Now, fairy tales are sometimes quite on the nose, and there's a relationship between the two in the story, you know, because the cow is obviously the creature that provides the milk for the. For the Family, you know, and now his mother is his guardian and so he's an 11 year old boy, 12 year old boy, it's not clear in the story, but he's a boy that's right on that edge where he's going to start to change, his mind's going to start to change, his body's going to start to change and he's going to start to realize certain things. And so he's missing something in his life. He doesn't know quite what it is yet, he doesn't understand it. But he lives in this world with his mother and the cow. But things are so dire because they're missing that which provides and that which makes his. Could make his family continue. They're missing that they're running out of body. The good way to understand it, they're just running out of food, they're running out of wealth, they don't have anything left. And so at some point his mother becomes desperate, tells him, go sell the cow. You know, basically we'll buy some food, we'll eat and we'll die, you know, like that'll be it for us, you know, Similar to the story in of Elijah and the widow, by the way, very similar in terms of the structure. And so Jack goes out and he sells his cow. So I'm going to show you these are some images from our book. I'll tell you when they're from our book, just so you can see the difference. So Jack goes out and he sells the cow for beans, match beans. It's really interesting because right in the story, of course it's presented as a trick, and in some ways it is a trick. But the question is, is it really a trick? What is he trading for? What is he trading? He's trading the cow for seed. That's what he's trading for. He's trading it for a seed. What's a seed? A seed is a pattern without body. It's the best way to understand it. Right? That's the, maybe the, the. That's when Christ talks about the mustard seed. That's what he's trying to refer to. It's like it's a, it's a, it's a pattern that doesn't yet have body and that it has to then find body and it will grow. But it's a meaning, right? It's a purpose. But it's still small. It doesn't have body yet. But it's also, you know, it's interesting too, like in the 20th century, you've had all these People tell you that fairy tales are all about sex. And the truth is they are about sex. They're not just about sex. And that's the difference, is that the cosmic dance involves sex, guys. Sex is part of the cosmic sex, the music of the spheres, right? It is a pattern of communion. It is a pattern of dance, of coming together, you know, of the finding of purpose and of meaning and of life. And so the imagery will always contain some sexual aspect to it, but it's not just that. And if we can see the whole picture, then we are not afraid of the aspects that are, to some extent, reflect that, right? And so this is also reflected in this question, is that he finds the seed. That's what he's missing. He's missing his father, right? And he's also missing. He's also entering into a world where this will become relevant to him, right? He's discovering this aspect of the world, okay? So that's part. That's part of the. That's part of the story. Now, you know, his mother cannot recognize the seed. She doesn't recognize the value because of her role in the story, because she is the widow in the story. She's the woman who doesn't have a husband. And because of that, their family's in trouble. And so she can't recognize it. Tosses it out. Tosses it out, of course. And then overnight, what happens? The beanstalk grows. And when he wakes up, there's a beanstalk there in the morning. Now, there are so many stories that have that similar structure, right? The beanstalk is Jacob's ladder, right? It's Yggdrasil. It's, you know, it's the pillar, the axis mundi, if you like that type of language, right? It is the thing that connects heaven, Heaven and Earth. It is the hierarchy of being. It is the music of the spheres, right? It is. That's how the ancients understood these heavenly spheres that went up as a hierarchy of purposes and of truths, that went all the way up into those stars that don't move, that are fixed, that are. That. That don't move, that aren't part of the dance, that are beyond the dance, right? The prime mobile, right? That's what Dante goes through. Dante experiences layers of meaning, layers of purpose, layers of virtue, as he ascends the heavenly spheres to reach the highest point. And this is exactly the same as what's going on in this story. This pillar appears which connects heaven and Earth. And, you know, but it is also. It is also Jack waking up in the morning to the beanstalk. Right. And so it, it has a sexual element to it, but it's not just that. Right. And it's, you know, and it's the same. Even like Jacob, Jacob's pillar is related to all of this symbolism. But it's not the same. It's not just that. That's what I want to say. I just want to help you when, when the postmodern will tell you that fairy tales are only about sex, it's like, yeah, get over it. You know, they're also about higher meanings and, you know, and those are more important. I don't know what to tell you. Right. And so Jack climbs the beanstalk, but before he climbs the beanstalk, it's important that his mother wants to prevent him from climbing the beanstalk because his mother wants to prevent him from climbing beanstalk for the same reason that she couldn't recognize the seed at the outset. Right. And that is also the 12 year old boy that has to now find his own purpose, that has to, you know, has to find his way out of the house slowly and progressively, but has to find his own purpose. And that is what Jack is doing. And so he climbs the beanstalk."}
{"episode_id":"SW - #345 - 2024-06-22 - Fairy Tales as the Music of the Spheres","start":1656.74,"end":1656.94,"speaker":"Moderator","text":"And."}
{"episode_id":"SW - #345 - 2024-06-22 - Fairy Tales as the Music of the Spheres","start":1656.94,"end":2482.05,"speaker":"Jonathan Pageau","text":"He comes to the giant. So this one is also from our book, future book. Now, this music, okay, what's important to understand is that this music like a fugue or, you know, it's fractal, which is that the pattern that it shows you will always repeat itself in the parts of the story. So the parts of the story are like little mirrors for the whole story. Does that make sense to you? That's what a fractal is. It's like, it's a pattern that repeats itself at every single level that you can recognize. So when Jack enters into the house of the giant, what happens? The woman wants to protect him, obviously. What does she want to protect him from? She wants to protect him from this giant man that's going to devour him. Will the giant man devour him? Yes. Does he have to confront that? Yes. Right. Those are all true. All of it is true. And is the woman kind of right to want to protect him from that? Of course she is. Right. Of course she does. She wants to protect him from the evils of hierarchy, the evils of masculinity. All of that stuff is real, you know, the tyranny of the, of the father. All of that stuff exists. But nonetheless, Jack has to deal with it, has to encounter it, has to confront it. So what does he get from his first encounter? So he goes up three times. I don't want to make this the longest store in the world. He goes up three times and he gets three things. The first thing he gets is gold, and he brings the gold back down. Now what can you do with the gold? He can buy food. Problem solved. It's great, right? We had a problem, we don't have enough food. I go up into heaven, I get the solution, I get the reason, I get the purpose, Then I bring it back down, then I solve the problem. That's what we do all the time. When we solve a problem, we go up into heaven, we find the reason, we find the purpose, we find the solution, and then we come back down and implement it into the world. Okay, but then what happens? The money runs out. He didn't go high enough, or he didn't get enough from heaven. Because what's better to solve a problem or to know to solve a single problem or to understand how to solve problems? Understanding how to solve problems is a much better skill than solving a particular problem. I can know how to hammer a nail, and I could do that all day. But if I understand carpentry, then I can figure out all the things that are designed downstream from that. So what's the next thing Jack gets? Goes up there, and he gets now the cause of riches. So riches are one thing. They're great. But how to make money is way better than money. If you know how to do that, it's much better. And all this time, what's really important is that Jack is also sacrificing his immediate needs. And that's what he did at the outset. He's learning, you know, to delay pleasure. He's learning to delay his immediate desires because, you know, milk is good and getting food is good. And that's why when he goes up, he always asks the woman for food. If you notice in the story, he goes up and he asks her for food. Then she puts him in the cupboard, tries to protect him. And then he adventures out, goes out, deals with the dangerous man, then gets the treasure. And the second thing he gets is the way to make money. That's great. Now he comes back down. He's pretty much solved all of his problems, you know, now he can just generate wealth. He's good. He's a businessman. He knows how it works, right? He doesn't just know how to run a dry cleaner, but he knows how to run several companies. He's good to go. So he can become rich. It's all good. There's something missing, it seems, and something's itching, right? Something's itching at him. He feels like there's something more that he hasn't gotten yet. He needs one more step. So he goes back up. Same thing happens, but this time the weirdest thing, right? How do you. So you, you get gold. Then the chicken that lays eggs makes sense. Why is the third one a harp? That's weird. I hope you've been paying attention from the beginning because now you know why. It's a harp, right? Now he's getting the pattern. He's getting the pattern that cannot be spoken. He's getting the origin of all the other patterns, right? He's getting the harp that sings. He's getting the music of the spirit spheres. That's what he's getting. And that's the highest thing. He's getting the pattern of reality. And now he brings it back down and it's not clear like what advantage in material terms this harp is going to bring him. It doesn't seem like it's going to bring him any. But it's the beauty of the song, right, that attracts him. Something more than just his belly. Something more than just the desire to celebrate, solve the problems. He's lifted up into something higher, something that transcends those desires. And he's capable of perceiving it because all this time he's been sacrificing to some extent those little desires for higher purposes, right? And we all know, right, that's what education is, right? You know, when you tell a 10 year old boy to sit still, it's like, what are you doing? You're saying, sacrifice your immediate desire for something more and you'll thank me later, you know, because if I, if you, if I let you do whatever you want and I let you eat all the candy and I let you do whatever, you know, you'll be miserable. And you know, and so Jack discovers that. Jack finds that as he ascends the hierarchy. Now, you know the story, you know the story more than you think, right? This story, the story of Jack is very similar. It's actually almost the same as this story. It's almost exactly the same as the story of Moses. What happens, what happens to Moses, right? He's a shepherd, he's got a good life, he's got a wife, he's got kids, good to go. Then he sees this glimmering thing. It's not a seed, it's a burning bush. But you get it, right, sees this shimmering thing and then ultimately that leads him to sacrifice all to go through great difficulty in order to ascend the mountain. Now what does he get at the top of the mountain? He gets a pattern. What do you think law is? That's what law is. Law is a pattern of behavior. And in the case of the law that is given to Moses, it's not just a pattern of behavior. It's first of all a pattern of attention. You will have one God, you will worship one God. That's a pattern of attention. And then downstream from that, it's a pattern of behavior. So that's also part of the top. The first aspect of the law have more to do with ontology, with the way the world exists. And then the second part, the moral part, is downstream. Fairy tales are the same. Like I told you, if you try to find too much morality in fairy tales, you're really going to. You're gonna. You're gonna have to twist them, you're gonna have to make them into something else. But if you understand that they're actually usually ontological structures, they're showing the structure of being, and then downstream from that, you can get moral meaning. That's a much better way to approach fairy tales. Then also, what does Moses get there at the top of the mountain? He gets a literal plan for a building. He gets an actual pattern for a building. God says, you're going to make a building. It's going to be this size. Like, he's like a. He gets architectural plans at the top of that. But that's what you need to understand. And why also you need to understand that, you know, the temple, the pattern of the temple is not, is not a moral question. It's not moral in itself. It's not telling you how to, how to, you know, how to not steal or do all that stuff. It is, it is a pattern of participation, right? The liturgy or the, the way that the Israelites came to the temple and sacrificed, and the whole order of, of the temple itself was representing the beanstalk itself. The structure of the temple is this moving into the secret place where the secret glory of God is hidden. And that's the same, at least in these kinds of stories, as, as that mustard seed. And the crazy thing about that is what does Moses find when he comes back down the mountain? He finds a cow, you know, because the people have worshiped their desires, right? And then they've worshiped their desire desires instead of looking up towards higher reality. And the sacrifice, you know, it's an. It's the upside down of what the story. In the story in Jack, Jack has to sacrifice the cow he has to sacrifice the cow in order to get the meaning. Here you find Moses coming down and realizing that because the people are now worshiping the cow, the. The pattern doesn't. It's not going to fit. The path pattern has to be broken. The pattern cannot connect with that world, and they have to purify themselves so that when he comes back down again, then the pattern can connect to the people. And so this is just one fairy tale, you know, and I, and I chose one which, when I was a child, I loved Jack and the Beanstalk. But it always bothered me because I was told that, that fairy tales are supposed to be moral. Jack in the beastock is not moral at all. There's nothing moral about it. When he goes up there, steals from these giants. If you take it at the first level, it's like, who's the bad guy in the story? You know, it's probably Jack, right? Just in terms of simple morality, it's not the giant, like he's up there minding his own business and someone's in his house. You know, it's like. But if you see it rather as this, this structure of being, right, as this structure of participation, and then it lays itself out beautifully and powerfully before you. And so, you know, my call to you is to take these stories very seriously. And, you know, so I spend all this time, you know, explaining it to you, and I'm not explaining it to you. This story has way more than what I was able to explain to you. And it's really important when you think about fairy tales, that they're not metaphors for things. And Tolkien got this right, by the way, because Tolkien hated when people said that his work was symbolic. He said, my work isn't symbolic, my work is applicable. And that's the way to understand fairy tales, is that fairy tales are patterns of being that are applicable. Now I can show you the analogies, right? And I can say this is like Moses. This is like this. This is like that. This applies to this. And it can help you see the pattern that you didn't perceive before. It's helpful to do that because it can make you see how valuable it is. But I'm not explaining it to you, and that's really important. And what that means is that two things inset, one, you can keep telling the fairy tales to the kids and don't worry about it. The story will take care of itself, right? And two, you have the rest of your life as you tell these stories to the kids, to realize that they have something to teach you. You have no idea. Like, you have no idea what they contain, the power and the depth that they have in them, that, honestly, fairy tales are not just for kids and they never were really. It's weird. It's a very modern idea that fairy tales are just for kids. We tell them to kids because kids, you know, they haven't forgotten how to hear the music of the sphere so much like Pythagoras said. But they're for us as well. And so I'm embarking on this. On this adventure myself. I encourage you to embark on it on your own, to look through. You know, look, in the next few years, you'll see these eight fairy tales that are going to come out, that are going to be a kind of symphony of fairy tales where we're going to play with the rhyme and with the meanings of the fairy tales so that they kind of come together in this great symphony at the end. So, hopefully I was able to make you love fairy tales even more than when you walked in. Thank you."}
{"episode_id":"SW - #345 - 2024-06-22 - Fairy Tales as the Music of the Spheres","start":2494.38,"end":2494.86,"speaker":"Audience Member","text":"Thank you."}
{"episode_id":"SW - #345 - 2024-06-22 - Fairy Tales as the Music of the Spheres","start":2496.46,"end":2514.47,"speaker":"Moderator","text":"We're going to have a Q and A session now. Take about 15 minutes or so. We do have a microphone down front, so I'll kick us off with a question here. But if you could. If you could line up in front of the microphone so that you're ready to go, and we would ask. Let the question be a question."}
{"episode_id":"SW - #345 - 2024-06-22 - Fairy Tales as the Music of the Spheres","start":2518.55,"end":2518.95,"speaker":"Audience Member","text":"Not."}
{"episode_id":"SW - #345 - 2024-06-22 - Fairy Tales as the Music of the Spheres","start":2520.23,"end":2552.11,"speaker":"Moderator","text":"Five minutes, and then, hi, Jen, what do you think about that? So, in other words, try to be concise so we get more questions. So please feel free to come line up here at the microphone while they're doing that. I was very taken by this initial analogy of the football team, and when the pass is thrown, everything's in its place. Now, I grew up a suffering Browns fan, and the receiver was never in his place."}
{"episode_id":"SW - #345 - 2024-06-22 - Fairy Tales as the Music of the Spheres","start":2552.19,"end":2553.71,"speaker":"Jonathan Pageau","text":"Yeah, very frustrating."}
{"episode_id":"SW - #345 - 2024-06-22 - Fairy Tales as the Music of the Spheres","start":2554.11,"end":2590,"speaker":"Moderator","text":"I won't ask you what you make of this. No, my question actually is, obviously, lots of talk about these stories being in some sense, freed from. From a particular telling, right? They are. They existed before Grimm. What do you make of the connection, though, between the story and the particular telling? Is the particular linguistic incarnation important? Is it important to read multiple versions of it? What is that connection between the story itself and that particular telling?"}
{"episode_id":"SW - #345 - 2024-06-22 - Fairy Tales as the Music of the Spheres","start":2590.87,"end":2702.45,"speaker":"Jonathan Pageau","text":"Well, it's the same process as what was there before. Is that the reason why the Grimms were able to do that and that we love the fairy tales is because they capture something true? You know, if. And so that is something that should be remembered and celebrated, and it will be. And so, you know, I think that it's important to read the Grimm versions because they are a beautifully crystallized version that has become a marker for the way we understand fairy tales, and that has. There's a reason why that's the case. And so I think that we definitely need, you know, to. To do both. To both remember the great tellers of the. Of the fairy tale, but then also engage with them, you know, and it is a good idea to play with the fairy tales a little because, you know, we all know now that there's, like, 25 versions of snow White, you know, and it's interesting, you know, when you tell the story to a child, to switch it up a little bit, to do it in a traditional way, right? To not make some stupid thing up, but to really. You know, sometimes the dwarves are robbers. You know, sometimes the dwarves are more like. Or miners. Sometimes they're not even dwarves, right? Sometimes they're. And so it can be an interesting way to help the child know what analogy is. And totally unconsciously, by the way, one of the things I did when I was telling the fairy tale to my kids is I would always pause when there was a rhyming point when I would say, you know, like, snow White falls asleep. And I'd say, where did you. Where have you seen that before? And then they. They'd remember other. They'd say, oh, yeah, Sleeping Beauty also falls asleep. And then you don't even have to explain it. Just let them see the analogy. You know, especially if they're young, like six, seven. Just let them see the analogy. They're learning the language without you even having to explain it to them."}
{"episode_id":"SW - #345 - 2024-06-22 - Fairy Tales as the Music of the Spheres","start":2702.85,"end":2707.89,"speaker":"Moderator","text":"So let me be a little bit more pointed with this. Why publish a new version?"}
{"episode_id":"SW - #345 - 2024-06-22 - Fairy Tales as the Music of the Spheres","start":2708.77,"end":2769.03,"speaker":"Jonathan Pageau","text":"Oh, because I believe that there are things in the fairy tales that are appropriate for the context. So this is the great thing about stories like this, is that their wealth is so important, immense, that there are certain things that you can make shine that are relevant to the moment. You know, a simple example in our version of Snow White is there are two versions of the mirror. One is mirror on the wall. One is a mirror in my hand. And, you know, in our version, we made it a mirror in my hand. And if you saw the image of it and she holding the mirror in her hand like this, it's like, oh, okay, I understand one of the aspects of what that can apply to this narcissism and this black mirror that tells you who's the most beautiful. And so those are little things, and you don't betray the story at all you just tell the story of Snow White. But to make certain things salient, I think is important. Dirk."}
{"episode_id":"SW - #345 - 2024-06-22 - Fairy Tales as the Music of the Spheres","start":2769.59,"end":2806.48,"speaker":"Audience Member","text":"Thanks, Jake. Jonathan, thank you. I thought that was great, but more of a point of clarity, or a question for clarity. So what I heard you suggesting is that the. Let's say, let's call them the important aspects of fairy tales are attention, memory and transmission. It seemed that you were. At least, this is what I heard, that memory was not, or it was something separate. Is that a fair understanding of. Was there a delineation there? That. Oh, sorry, that meaning. Did I say memory meaning? That meaning was a different."}
{"episode_id":"SW - #345 - 2024-06-22 - Fairy Tales as the Music of the Spheres","start":2806.8,"end":2838.22,"speaker":"Jonathan Pageau","text":"No, but when I talked about attention, memory and transmission, I was just talking about the mechanism by which we have them, which is that fairy tales are not just about those three things, but the. The fact that attention, the way that humans pay attention, the way they remember things and then the way they retell them, is a beautiful way to understand why the fairy tales have come to us and also why they contain a pattern of consciousness in them. Because of those three aspects."}
{"episode_id":"SW - #345 - 2024-06-22 - Fairy Tales as the Music of the Spheres","start":2838.22,"end":2841.06,"speaker":"Audience Member","text":"But are those in your mind the meaning?"}
{"episode_id":"SW - #345 - 2024-06-22 - Fairy Tales as the Music of the Spheres","start":2841.14,"end":2866.35,"speaker":"Jonathan Pageau","text":"The meaning is there, but usually you don't. How can I say, an illiterate grandma is not going to tell a story because it's meaningful, right? Like, not in the way that we think meaningful. You know, when you think about it, like when you're telling a story around the fire with your kids, you know, you're not thinking about, like, how meaningful is this? You want them to love it, you want them to pay attention, you want them to be enthralled, you want them to follow along."}
{"episode_id":"SW - #345 - 2024-06-22 - Fairy Tales as the Music of the Spheres","start":2866.35,"end":2878.85,"speaker":"Audience Member","text":"You know, but you might. I mean, so where do you see the pedagogical implications of that? When you're putting the fairy tales forth? What do you see as the. The highest end."}
{"episode_id":"SW - #345 - 2024-06-22 - Fairy Tales as the Music of the Spheres","start":2879.25,"end":2879.65,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #345 - 2024-06-22 - Fairy Tales as the Music of the Spheres","start":2879.65,"end":2884.45,"speaker":"Audience Member","text":"Of that transmission. Right. Of this thousand year old."}
{"episode_id":"SW - #345 - 2024-06-22 - Fairy Tales as the Music of the Spheres","start":2884.45,"end":2884.93,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #345 - 2024-06-22 - Fairy Tales as the Music of the Spheres","start":2885.73,"end":2894.45,"speaker":"Audience Member","text":"Should the. Should the teacher care about the meaning at all? Or is that not the important aspect of the telling?"}
{"episode_id":"SW - #345 - 2024-06-22 - Fairy Tales as the Music of the Spheres","start":2894.53,"end":2897.65,"speaker":"Jonathan Pageau","text":"Like when you use the word meaning? What do you mean?"}
{"episode_id":"SW - #345 - 2024-06-22 - Fairy Tales as the Music of the Spheres","start":2897.73,"end":2918.11,"speaker":"Audience Member","text":"Well, I mean it in the sense of what you did. So you took us through the images themselves. Not necessarily that the. Maybe the kindergarten teacher would do exactly what you did with us, but maybe to some extent to draw out applicability."}
{"episode_id":"SW - #345 - 2024-06-22 - Fairy Tales as the Music of the Spheres","start":2918.51,"end":2919.35,"speaker":"Jonathan Pageau","text":"Yeah. Right."}
{"episode_id":"SW - #345 - 2024-06-22 - Fairy Tales as the Music of the Spheres","start":2919.35,"end":2924.51,"speaker":"Audience Member","text":"And so I'm just wondering what the pedagogical import of that."}
{"episode_id":"SW - #345 - 2024-06-22 - Fairy Tales as the Music of the Spheres","start":2924.59,"end":3021.06,"speaker":"Jonathan Pageau","text":"So the first thing I would say is that in the same way that I don't think you would ask what the pedagogical import of learning to play the piano is. It's the same here. That is learning the grammar of being is not. It's not a like that is beyond the specific application. It's like learning how to. Learning how to play well with your friends is more than pedagogy, right? It's learning to be human. It's learning to be. To dance in that pattern. And so the fairy tale is like a tuning fork for a person in terms of meaning. So it actually, in some ways it's more than its applicability. And participating in the fairy tales precedes the application. The applications can be great, but the applications are always secondary and they can be fun. You can actually have fun with kids because you can do it as questions instead of doing it as a teaching. You can ask the child, why did Jack do this? Why did Snow White do this? You know, why did Snow White. Why was Snow White. Why is it that she let the queen in? You know, and you can do it that way. And then the child will be forced to think about it in their own context and they will, they will find applications. You can teach the applications too. But I think, anyways, I think that the, the music of the spheres aspect precedes the simple pedagogical aspect, if that makes sense. Thanks."}
{"episode_id":"SW - #345 - 2024-06-22 - Fairy Tales as the Music of the Spheres","start":3022.82,"end":3047.79,"speaker":"Audience Member","text":"Alex. Thanks for your talk. The most difficult part about coming up here is not doing what Jake just said. So I'm just going to ask the question, are fairy tales, Is the purpose of fairy tales different for adults than for children? And. Or is there something different adults are supposed to get out of it than children are?"}
{"episode_id":"SW - #345 - 2024-06-22 - Fairy Tales as the Music of the Spheres","start":3048.43,"end":3139.62,"speaker":"Jonathan Pageau","text":"No, I think, I think, yes. I think adults can get more out of different things, out of fairy tales. And it has to do in some ways with the play. So, you know, it's the same with music, right? It's like when you start with a child, you say, just play the piece, do the different exercises, and they learn the exercises. And then as you get older, at some point, then you can listen to a fugue and you can notice the great things that Bach's doing in taking you out of the pattern and then hinting at it and teasing you and then bringing you back, and you can actually more consciously see what's going on. And I think that that's what adults can do that now. And it's actually fun. Especially the fairy tales, you know really well as a child and that you knew and to as an adult now go back and say, I'm going to take this seriously. And all of a sudden you can see these beautiful things. They can unfold riches in a more conscious and intellectual way that can be Quite, quite fun and more than fun. But that can actually reveal to you some deep mysteries, actually even about scripture. By the way, there are some things that I've understood in scripture that I understood because I was reading fairy tales that all of a sudden I was like, oh, that's one of the things that's going on. And. Because it's close, but it's not. And so it makes you think of the scriptural story differently and it kind of, it reflects back on it and you think like, what's it? Why is it different? Why is it the same? And then you get these insights."}
{"episode_id":"SW - #345 - 2024-06-22 - Fairy Tales as the Music of the Spheres","start":3139.94,"end":3140.3,"speaker":"Moderator","text":"Yeah."}
{"episode_id":"SW - #345 - 2024-06-22 - Fairy Tales as the Music of the Spheres","start":3140.3,"end":3154.66,"speaker":"Audience Member","text":"And that, that makes a lot of sense for kids. Is there something. Because you mentioned at the end of your talk, there's things they see that maybe it's harder for you to see as an adult. And just any more about that, that there's things that."}
{"episode_id":"SW - #345 - 2024-06-22 - Fairy Tales as the Music of the Spheres","start":3154.66,"end":3155.82,"speaker":"Jonathan Pageau","text":"I'm sorry, I didn't understand that this."}
{"episode_id":"SW - #345 - 2024-06-22 - Fairy Tales as the Music of the Spheres","start":3155.82,"end":3158.5,"speaker":"Audience Member","text":"That the students are seeing or the children are seeing. That's."}
{"episode_id":"SW - #345 - 2024-06-22 - Fairy Tales as the Music of the Spheres","start":3158.74,"end":3235.95,"speaker":"Jonathan Pageau","text":"They'll see it implicitly. They'll see it implicitly by their attention. It's like a child loves something. And if a child. A child. Children love fairy tales. You don't have to explain the fairy tale to them, especially now when they're super young. They just love to hear them. And so it's like, rejoice, like rejoice in that. It's wonderful. They love the stories, you know, and then as they get older, then you can tease out the applications. You know, you could. I mean, it would be a great idea, for example, for an education program, program to go through the fairy tales, let's say three times in the curriculum. You have them in kindergarten, first grade, you just read them to the kids, you play with them. You know, you have them memorize them. You do them as poems, you do them as plays. You just get them to do them. And then, you know, maybe at around like, I would say like 12 years old, then you go back into them and then you see what fruit that those patterns have produced. And then, you know, like senior year of high school, then ask a senior to analyze a fairy tale and to do it like the structure of it and show how its literary references to be able to demonstrate how, you know, how the variability and how it looks like this myth or it looks like these other things. You know, I think that would be a great way to do fairy tales."}
{"episode_id":"SW - #345 - 2024-06-22 - Fairy Tales as the Music of the Spheres","start":3236.35,"end":3236.99,"speaker":"Audience Member","text":"Thank you."}
{"episode_id":"SW - #345 - 2024-06-22 - Fairy Tales as the Music of the Spheres","start":3240.44,"end":3279.33,"speaker":"Audience Member","text":"Thank you again for your talk. I really appreciate your caution that we over moralize story and particularly with fairy tales, take that approach, but instead take a ontological approach to understanding how reality works. But I'm curious to understand, particularly for those of us who are tasked with ordering the loves of children, cultivating virtue in children. Can you say a bit more about why that approach is more effective than an over moralistic approach that I think is more common in a modern sense?"}
{"episode_id":"SW - #345 - 2024-06-22 - Fairy Tales as the Music of the Spheres","start":3280.77,"end":3372.83,"speaker":"Jonathan Pageau","text":"I mean, I think you've answered your own question. You know, it's like you can't. The world is made of love. Dante pretty much demonstrated it to us like it's built out of care. And I think that it's somewhat, it's a way that we can, it's something that we can argue quite strongly today with the new developments in cognitive science, that the world is actually made of care and that the orders of cares are the orders of identities. Like there's almost no, there's no difference between the identities of things, their purposes, and the hierarchy in which we engage with them. Right? The fact that we care about them or not. And so, you know, if you can get, you know, and everybody knows that, right? If you can get a child to love something, then you've done, you don't have to do any more work. That's it, they'll do it themselves. And that's what like, I grew up, I did a lot of homeschooling with my kids and we were kind of around homeschool people and that was the case, you know, in the right context, like a homeschool school kid that loves something, they'll just like, they'll take off and you'll have to stop them. Like, you'll have to say, all right, stop reading now. You know, that's enough. Like put that, no, that book's too old for you. Don't read it. You know, it's like, it's like I'm fighting with my 16 year old about which he's like, I want to read Dostoevsky. I'm like, can you read C.S. lewis instead? Like, let's wait until you're in your 20s to read Dostoyevsky. You know, it's like that's the kind of thing that the love will produce, right? Is that so point you have that the child would just take it on their own."}
{"episode_id":"SW - #345 - 2024-06-22 - Fairy Tales as the Music of the Spheres","start":3372.91,"end":3379.63,"speaker":"Audience Member","text":"So in just presenting that the truth of reality, you think that's sufficient to cultivate the virtue and love for that reality?"}
{"episode_id":"SW - #345 - 2024-06-22 - Fairy Tales as the Music of the Spheres","start":3380.11,"end":3405.32,"speaker":"Jonathan Pageau","text":"Well, the stories are made to be loved. Who doesn't like the story of Snow White? Who doesn't like Jack and the Beadstock? When you're 7 years old and you don't have to Know why? It just catches the kids, especially if they're not ruined when you. With telephones, you know, but if you have a kid with a bit of a healthy mind, then those stories will catch them. No doubt about it. Thank you."}
{"episode_id":"SW - #345 - 2024-06-22 - Fairy Tales as the Music of the Spheres","start":3406.36,"end":3427.64,"speaker":"Audience Member","text":"You began to touch on this a few questions ago or your answer to a few questions ago in talking about how fairy tales have affected the way that you've read scripture. And so my question is fairy tales are often more enjoyable to read than scripture. So how can we learn to read scripture like a fairy tale?"}
{"episode_id":"SW - #345 - 2024-06-22 - Fairy Tales as the Music of the Spheres","start":3427.72,"end":3501.11,"speaker":"Jonathan Pageau","text":"Yeah, no, I think that's a, that's a great question. And I think that at least is. This is a lesson that I, I learned hard in my life with my kids because I love scripture. You know, it's like I, I live in scripture. And so I thought, you know, tell them fairy tale stories, we'll tell them Bible stories, and they just all kind of go to together. For some reason, the Bible stories were a harder sell, you know, And I think that, I think that in some ways you could say that the, the fairy tales can be a way of initiating people into the language of scripture. And so they're kind of like a narthex or like an entrance to, to the church. Right, because. Because they have certain fantastical elements that are exaggerated. And so, you know, obviously the, you have dragons, you have giant beanstalks that go up to the sky and giants and all this stuff. There's some of that in scripture too, but not in as much of a salient manner. And so I think that when your kids are quite young, the fairy tales can kind of help them and then slowly move into scripture stories later. You can still tell some of the scripture stories when they're young, but I made the mistake of just starting in Genesis. Like, don't do that. Seriously, don't do that."}
{"episode_id":"SW - #345 - 2024-06-22 - Fairy Tales as the Music of the Spheres","start":3501.27,"end":3509.75,"speaker":"Audience Member","text":"You know, so that's for a child, but for an adult who maybe doesn't, you know, read scripture in a very like, academic."}
{"episode_id":"SW - #345 - 2024-06-22 - Fairy Tales as the Music of the Spheres","start":3509.75,"end":3649.11,"speaker":"Jonathan Pageau","text":"Right, in that sense. Well, for sure. I think that the fairy tale is a better model for how to read scripture than the way that the modern scholar tells us to read it. You know, the way that the modern text scholars tell us to read scripture makes you hate. Why would I read this? It's just, it's just, it's just a historical text about something that is actually not saying what it's actually saying, but it's hiding all these political things or whatever nonsense. You know, it's better to, you know, the Bible itself is a great, like, if you pull away from it and you're able to kind of get out of the way that the modern Bible scholars have told us what the Bible is. It has this amazing pattern from the beginning to the end. You know, it starts in a garden, it ends in a city. A city with a garden inside. It has this great sweeping structure that moves right through and you. But you have to be able to kind of pull out a little bit. And you know, this is my. Will be controversial for some of you. But what can help us is the more fairy tale like stories around scripture sometimes times. A lot of the legends can help you see that. Like a lot of the extra biblical traditions, if we don't take them at the same level as scripture, but sometimes it can help us See now there's this amazing story in the Golden Legend about how Seth goes back into the Garden of Eden and takes a shoot from the tree in the garden and then takes it out and plants it. And. And then that tree is used to make the Ark of Noah and then it's preserved to the ark and then that tree becomes the staff of Moses and then that tree, etc. Etc. Becomes the cross. And you think like that's this crazy story. Obviously that did not happen, but it's really useful for you to help you understand the meaning of all those things, things of all those elements in scripture, you know, and then at the end of the world, at the end, the tree of life that's planted in the heavenly Jerusalem. And so that's the great pattern of that story. And so there are all these interesting like Midrash or extra biblical stories both in the Christian and Jewish tradition that can really help you see the fairy tale element that's already there, kind of hidden in scripture."}
{"episode_id":"SW - #345 - 2024-06-22 - Fairy Tales as the Music of the Spheres","start":3650.71,"end":3651.35,"speaker":"Moderator","text":"So we have."}
{"episode_id":"SW - #345 - 2024-06-22 - Fairy Tales as the Music of the Spheres","start":3651.52,"end":3651.84,"speaker":"Audience Member","text":"Thank you."}
{"episode_id":"SW - #345 - 2024-06-22 - Fairy Tales as the Music of the Spheres","start":3651.84,"end":3658.88,"speaker":"Moderator","text":"Thank you. So we have three more people. I think we can get through the three. We're a bit over time so we can make it quicker. I think we can get through these last three."}
{"episode_id":"SW - #345 - 2024-06-22 - Fairy Tales as the Music of the Spheres","start":3659.44,"end":3662.8,"speaker":"Jonathan Pageau","text":"I'll keep it very short. What do you think is the relationship."}
{"episode_id":"SW - #345 - 2024-06-22 - Fairy Tales as the Music of the Spheres","start":3662.8,"end":3665.28,"speaker":"Audience Member","text":"Between fairy tales as the music of."}
{"episode_id":"SW - #345 - 2024-06-22 - Fairy Tales as the Music of the Spheres","start":3665.28,"end":3684.39,"speaker":"Jonathan Pageau","text":"The spheres and learning or teaching mathematics? Yeah, well, it should be related. I'm sadly of those people that was made to hate mathematics in my life and I was just told that it was just a bunch like. So what happened?"}
{"episode_id":"SW - #345 - 2024-06-22 - Fairy Tales as the Music of the Spheres","start":3684.39,"end":3685.27,"speaker":"Moderator","text":"Sorry, continue."}
{"episode_id":"SW - #345 - 2024-06-22 - Fairy Tales as the Music of the Spheres","start":3685.35,"end":3685.91,"speaker":"Jonathan Pageau","text":"Okay."}
{"episode_id":"SW - #345 - 2024-06-22 - Fairy Tales as the Music of the Spheres","start":3688.55,"end":3689.35,"speaker":"Moderator","text":"We'Ll talk later."}
{"episode_id":"SW - #345 - 2024-06-22 - Fairy Tales as the Music of the Spheres","start":3689.35,"end":3730.02,"speaker":"Jonathan Pageau","text":"It was. It was just a. It was. So are you. Are you. It was. It was just a bunch of things that I had to learn, you know, by heart. And so I never. My brother though is different from me. I remember he he kind of developed a very mathematical mind and he's very close to me in my thinking. He wrote a book on symbolism and he kept telling, he keep even until today. He'll tell me like no, math isn't what you think. You know, it's something else. And so. But there clearly is when you see how Kepler approaches these patterns, like these cosmic patterns, you know that it's definitely related. So hopefully all of you make your kids love math and not hate that for my sake at least, you know."}
{"episode_id":"SW - #345 - 2024-06-22 - Fairy Tales as the Music of the Spheres","start":3731.14,"end":3749.78,"speaker":"Audience Member","text":"Hi, I picked up a copy of Snow White for my family and for my kids school and people were so impressed by the quality of storytelling and the artwork that they asked me if I could get like a set of classroom for a classroom set. So when is that going to be available? Yeah, like six months, one year, two years."}
{"episode_id":"SW - #345 - 2024-06-22 - Fairy Tales as the Music of the Spheres","start":3749.86,"end":3812.68,"speaker":"Jonathan Pageau","text":"I know it's, it's been a very, it's been a learning curve is the best way to say that. You know, I hope there because we sold out the first edition and the person that was running the publishing company that I own, it's sad to say she just wasn't the right person and I had to let her go and because we literally oversold 1,000 copies and we didn't have the books. So now there might even be people in this room that are waiting for a book and they've been waiting for like three, four months, five months. It's crazy. And so we have ordered books now, they should be there in a month and so we should reopen the sales. But this is also a long term project. We don't want to rush it. So we have two more books that are being illustrated right now, Jack and Rapunzel. And so we're going to put those out in the fall probably. So the distribution aspect of it will. Hopefully we'll find a solution as these kind of come out. But the quality we want to maintain, like world class quality, that's our, that's our first goal."}
{"episode_id":"SW - #345 - 2024-06-22 - Fairy Tales as the Music of the Spheres","start":3813.32,"end":3817.08,"speaker":"Audience Member","text":"Will there also be extra copies to say God's dog to purchase and also."}
{"episode_id":"SW - #345 - 2024-06-22 - Fairy Tales as the Music of the Spheres","start":3817.32,"end":3861.89,"speaker":"Jonathan Pageau","text":"Yeah, that's also a problem. We also sold out those books. We sold out all our books. I don't know what to say. And we just. They're excellent. Yeah, well thanks. Yeah. We're also doing, we're also doing graphic novels for those who don't know. I. The two graphic novels. One, it's called God's Dog and it's basically it is in some ways what was asked before. It is a way of telling, of telling a Tolkien style epic, but with the biblical world and taking all the fairy tale elements in the Christian tradition that people want to ignore and just putting them all in one story. So we have like giants and the Leviathan and St. George and you know, like just. And dog headed men and all this kind of crazy stuff. So it's coming."}
{"episode_id":"SW - #345 - 2024-06-22 - Fairy Tales as the Music of the Spheres","start":3862.61,"end":3870.85,"speaker":"Audience Member","text":"Okay. And also, are there other people who are doing this? If we want to provide resources for classrooms that you'd recommend that are doing."}
{"episode_id":"SW - #345 - 2024-06-22 - Fairy Tales as the Music of the Spheres","start":3871.33,"end":3873.29,"speaker":"Jonathan Pageau","text":"The similar things that I'm talking, that."}
{"episode_id":"SW - #345 - 2024-06-22 - Fairy Tales as the Music of the Spheres","start":3873.29,"end":3875.09,"speaker":"Audience Member","text":"I'm trying to do because this seems very unique."}
{"episode_id":"SW - #345 - 2024-06-22 - Fairy Tales as the Music of the Spheres","start":3875.49,"end":4009.14,"speaker":"Jonathan Pageau","text":"I think that it's coming. I don't know if it's. I think that it's going to happen very fast. I was, you know, I knew two years ago, I had an inside from Disney insider from Disney tell me that Disney was making Snow white for the 100th anniversary of Disney. And when I heard that I thought they're not, they can't do it. They can't make Snow White. They just are not allowed to. And so they, and so, and that's exactly what happened. They just basically refused to make Snow White as they're making Snow, Snow White. So it's like she's, you know, there's no prince, there's no kiss, there's no dwarves. It's like, what story are you telling? I don't know. It's not Snow White anymore, you know. And so, and so that was one of the, one of the impetus for making, for starting the series was to, was just this wake up call to realize that actually people are dropping these stories. So let's just take the, take the flame, you know. And I think that we're going to see that happen pretty soon because that's the future. I don't know what to say. It really is, you know, and this is something about, by the way, about Disney Snow White that people forget. Is that the idea that Disney Snow White is just this old fashioned story and this old fashioned movie is hogwash. That is not what was going on when Disney made that movie. They were, it was the raging, it was the end of the raging twenties. It was all jazz and all crazy and drug use. And the animation studios that were popular were doing crazy hallucinatory kind of, you know, and so when Snow White, when Disney made his version of Snow White, it was a desire to recapture the traditional story. And he won, he won the attention game. And I think that that's where we are now. And I think that all you people here, here, that's the edge that you have because people have forgotten the Iliad oh, my goodness. People don't know that story. It's like, tell that story. It's an amazing story. There are so many stories now. Everybody's forgotten them. It's like, tell the story and people will love it because it's amazing. So the opportunity is immense."}
{"episode_id":"SW - #345 - 2024-06-22 - Fairy Tales as the Music of the Spheres","start":4010.58,"end":4045.63,"speaker":"Audience Member","text":"Hi. Two quick question. Two quick questions. I run a K through 8. I read the Snow White. I thought it was amazing. I noticed two patterns that I wanted to ask you about. When Snow White's going through her purification journey, you have those beautiful words about the thorns, her journey. And then the book ends that way with the villain enduring her own purification. But I noticed that the literary pattern was repeated. Could you tell me a little bit more about that? Because I want to pass it on to the students at my school properly."}
{"episode_id":"SW - #345 - 2024-06-22 - Fairy Tales as the Music of the Spheres","start":4046.83,"end":4077.08,"speaker":"Jonathan Pageau","text":"Well, it's a long. It's going to be a long story. And so it's. Because what happens at the end of the story in our version of Snow White is that the witch ends up in the dwarves cottage. So she leaves the. She actually leaves the castle and she's kind of forgiven by Snow White and she leaves the castle and she ends up living in the forest in the. In the. In the dwarfs cottage. And so that's a promise of her story. So it's not. The story isn't over."}
{"episode_id":"SW - #345 - 2024-06-22 - Fairy Tales as the Music of the Spheres","start":4078.04,"end":4088.68,"speaker":"Audience Member","text":"Okay. I just really enjoyed. And then the romance that's blossoming. The words that you use. It spoke to me of Song of Songs, do not stir love before it's time. Was that."}
{"episode_id":"SW - #345 - 2024-06-22 - Fairy Tales as the Music of the Spheres","start":4088.84,"end":4090.36,"speaker":"Jonathan Pageau","text":"Yeah, that was definitely on purpose."}
{"episode_id":"SW - #345 - 2024-06-22 - Fairy Tales as the Music of the Spheres","start":4090.52,"end":4091.04,"speaker":"Audience Member","text":"Okay."}
{"episode_id":"SW - #345 - 2024-06-22 - Fairy Tales as the Music of the Spheres","start":4091.04,"end":4103.05,"speaker":"Jonathan Pageau","text":"So one of the things we wanted to do. One of the things we wanted to do in the. In the. The. In the. In the fairy tales is actually use. Use scripture to solve some of the narrative problems."}
{"episode_id":"SW - #345 - 2024-06-22 - Fairy Tales as the Music of the Spheres","start":4103.29,"end":4110.37,"speaker":"Audience Member","text":"That's what I saw. And I want to teach it to the kids, but I really wanted to make sure I was on the right track or."}
{"episode_id":"SW - #345 - 2024-06-22 - Fairy Tales as the Music of the Spheres","start":4110.37,"end":4199.54,"speaker":"Jonathan Pageau","text":"You're definitely on the right track. Because I really believe that actually, like I said, it's a. Scripture is. Scripture is higher than the fairy tales. And they actually offer some solutions to the fairy tales that. Because there are some narrative problems in the story and some of the postmodern people pointing it out, you know, we get annoyed with it. But sometimes they might have a point. It's like, you know, what gives the right of the prince to kiss Snow White? Like, what is going on there? It is a little odd, you know, so. And so what we did in our version is that. And the prince meets Snow White at the outset in the castle and he's attracted to her, and he's a little too forward with her. And he says, come with me. I'll take you into my kingdom. Basically a rapture. I'll take you away. And he comes to kiss her, and she says, do not awaken love before it's time. Which is quote from the Song of Songs. And then at the end of the story, then he basically remembers. We don't even say that he remembers, but she told him what to do, right? She. She's the one who told him what to do when that would happen. But it's like. But it's scripture that is kind of giving you the key. We do that a few times in the story. There's like, especially with the apple, too. We tried to kind of show how the story of Adam and Eve is actually. Actually the key to that, to the. To the story."}
{"episode_id":"SW - #345 - 2024-06-22 - Fairy Tales as the Music of the Spheres","start":4199.7,"end":4203.62,"speaker":"Audience Member","text":"I thought it was magnificent, and I've been waiting for something like this. So thank you."}
{"episode_id":"SW - #345 - 2024-06-22 - Fairy Tales as the Music of the Spheres","start":4203.62,"end":4205.54,"speaker":"Jonathan Pageau","text":"Well, thank you. I'm happy. Thank you."}
{"episode_id":"SW - #345 - 2024-06-22 - Fairy Tales as the Music of the Spheres","start":4207.22,"end":4226.4,"speaker":"Moderator","text":"Well, Jonathan, what a great way to kick off symposium. Talking about conversations start with story. Makes a lot of sense to me. We really appreciate your time here, and we hope you have a chance to be with us and stop by some of the breakout sessions. Some of them are quite relevant to this, and we'll make sure that we get you into one of the sessions on mathematics."}
{"episode_id":"SW - #345 - 2024-06-22 - Fairy Tales as the Music of the Spheres","start":4226.4,"end":4250.68,"speaker":"Jonathan Pageau","text":"All right. If you enjoyed these videos and podcasts, please go to the symbolicworld.com website and see how you can support what we're doing. There are multiple subscriber tiers with perks. There are apparel and books to purchase. So go to the symbolicworld.com and thank you for your support."}
