{"episode_id":"SW - #070 - 2019-11-06 - Kanye West - The Fool and the Inversion","start":0.72,"end":1037.37,"speaker":"Jonathan Pageau","text":"The first time I heard Kanye west on Jesus walks in 2004, there was something about the way that he spoke about Jesus and the way that he approached things in a manner which he was using a kind of gangster language about hustlers and gangsters and all of this. But he was strangely flipping it in a manner to bring it almost into a strange gospel song. The first time I heard that, I started to pay attention to Kanye west. And I have been paying attention to him from afar, from a certain distance since then. And so I was not completely surprised to see what is happening with him. Recently though I am. Can I say this? I am happy to see my attention pay off. And so I'm going to try to explain to you what's going on to the extent that I can understand in terms of Kanye's new album and in terms of this strange social moment that we're in, how it all fits together and how when the world is upside down, we need to pay attention to the fools. And now is the time to pay attention to someone like Kanye. This is Jonathan Peugeot. Welcome to the symbolic world. So I just got back from Chicago. I was in Chicago for the weekend giving a talk at St. John Kansius Church. I'll be putting those talks up as soon as they're ready. And there was something of a strange coming together of elements that I was going to Chicago during that time, that on Sunday this traditional church was celebrating a feast called Christ the King. And that Kanye west that just put up his album called Jesus is King, all of this and that Kanye is from Chicago and talked about Chicago all the time. All of these elements were kind of coming together. And so in my talk, I discussed Kanye and the relationship to sacred art. You'll have to watch that talk to get the full relationship to sacred art. But I thought it would be important to go into what, what is going on, because it's happening now. This is the moment that this album came out and that Kanye is making waves in the culture. So why do I say that we need to watch the fools? I've made several videos about this. That we are living in a world that is upside down, where the exception has become the rule, where the margins have become king. We, the aesthetics of the carnival are all around us. The spinning, this turning, the entertainment mode. Everything about our world is. Is carnival esque. And usually it is the fool which brings us to that moment is the fool, the clown, all of these types of characters that bring us into this upside down world of, of spinning and entertainment and of excess. But my contention for the past few years has been if the fool is the one who turns things upside down, then the fool is also the one who turns things right. And that is why for the past 10 years, for the past decade, I have been watching for these fools to appear on the horizon. And we saw some of them in the last few years. People like Milo Yiannopoulos, people like Gavin McGinnis, who had all the imagery of the fool. People who were somewhat in who had come into a kind of excessive culture. You know, Gavin was the founder of Vice Versa. And all of a sudden he becomes a Christian and starts to become more conservative. There are several characters like that. Like I said, Milo was also one of those characters, but Kanye was one that I've been watching for a very long time. When I heard for the first time the song Jesus walks in 2004, I was really surprised at the way that he was able to use the aesthetic of gangster rap with a certain talk about violence and gang related violence and hustlers and all this, but then somehow flip it in a manner which is to say that Christ is always with the lowest, is always walking with the lowest. And there was something about the way he did that that made me want to pay attention. So I have been watching him from afar for a very long time. When I saw that he married this. When I saw that he. At some point I saw that he was like dating a stripper. And then he married Kim Kardashian. And I was reminded of stories in moments of inversion where the prophets are asked to marry a whore. There's the story of King David, who is very much that holy fool. You know, he's an entertainer. King David was an entertainer. He was the youngest of his peers. He was the smallest one. He also, he had a gang of thieves and ruffians with him. He pretended to be crazy. He did all these things. He also married other people's wives. And so King David is a figure to understand. The holy fool is really a figure to watch. And I would say pay attention because my brother Matthieu is currently, it seems, writing a book about King David to help us understand this moment in our culture. But so I, we've been. Matthieu and I also, with me, has been watching Kanye, my brother Matthieu, to understand is he possibly this fool that's going to flip, that's going to go in a way to the bottom and is going to become this extremely inverted character, but. But then he's going to flip back up. And so there was a Point where I was even. I couldn't pay attention to Kanye too much because his last albums were so. Were so crass and so vulgar and so blasphemy, you know, blaspheming, calling himself God and saying that he's Jesus, basically. And so he really went to the end. He went right to the edge where he married a woman. That is exactly the image of this. This whore who became famous for making a sex tape and who was, you know, famous for being famous, represents all this excess, all this sensuousness. And so then when last year, when Kanye kind of went crazy and then went into the asylum, my focus started to pay attention to him even more. The fact that he saw supporting Trump as a form of ultimate rebellion, all of that, just everything about that seemed that it was something to pay attention to. And so finally, these Sunday services really does mark a transition, and I think it's a transition. It's not the only transition we've seen in the past few years, but it's one which I think is important because it does represent that flip from someone who went all the way to the bottom of pop culture and now is flipping. There is a. One of the things I've been telling you guys about is about the problem of entertainment and the problem of reducing culture to entertainment and what that does to people. Ancient culture, what we call culture. Ancient culture was participative. Stories were participative. They were your stories. You people. You know, people would come and tell stories around fires. They would have a poetic meter in which to tell ballads and stories and romances of the famous characters in your story. The same for the stories in the gospel. You. It was the same for music and dancing. They had folk dancing and music and music and dancing were actually participative. There are some little remainders of that in things like square dancing, where the dancing is not just you dancing, you know, just to show off or to. To. To be in your own little world or to seduce somebody, but rather to participate in bringing people together and manifesting the unity that exists among people. And so dancing can play that role, and it doesn't play that role so much anymore. But what I wanted to get people to understand is that when we see things like cosplay and we see things like fan fiction and, you know, kind of Star wars, crazy Star wars fans who dress up as characters who are trying to live in those worlds, what we're seeing is that hunger for participation. We see the same with Harry Potter and, of course, with Marvel Comics. All of this that people have this desire to participate in a story, but you can't. You can't participate fully in that story. It isn't your story. And someone pointed out to me recently that not only is it not your story, but that story is actually owned by people. It is a trademark. These stories are trademarked, which are owned by people. And so your desire to participate in the. That story becomes very shady because it is. What does it end up being? Buying merch, Buying the products, consuming the products. Now, ancient stories, like religious stories, were those that you ended up plunging into and being part of. And so what we're seeing is in Kanye's new album, what we're seeing is him realizing that music without purpose ends up being. Leads you to nothing. And there's a quote in one of the songs. I'm probably going to. I'm going to paraphrase it, because I don't have it in front of me, where he says, let the demons know this is a mission, not a show. And I think that that's the flip. I think that that's the flip that's happening, which is that people are coming to the end of entertainment culture. As entertainment culture is becoming overwhelming. I mean, we have more movies, more TV shows, more video games. We're just drowning in entertainment. But that drowning in entertainment also marks a tipping point where all of a sudden, we are saturated. We know people are. People are drunk on entertainment. And so as you reach the end of that, as you reach the bottom, the only way to go is to move towards purpose and to move towards arts culture that brings together, that has the purpose of being. Making you participate in the story. So when you look at Kanye's Sunday services, you can see that that's what's happening. Instead of having a performer and an audience, he's setting things up in a circle where all the singers are in a circle together and they're looking at each other and they're singing in a manner which is. It is communicative, which is trying to create unity amongst the people that are doing it. And so although it's still a show and it's very awkward, and a lot of the things that Kanye says in his album are extremely awkward. You know, it's a mix of praising, but then there's always these weird moments of boasting and these weird moments. There's a place in one of the songs where he. He complains about the irs, and. And he. He said that's why he charges so much for his products, because if he didn't, then his family would starve. It's like, okay, Kanye, we don't. We don't feel sorry for you. But I think it's important to see it from. As a broader phenomena. Even though I don't think that you could see Kanye as some kind of a leader, some kind of someone that you need to pay attention to in terms of the. The quality of his message. You could say you mostly have to see what's going on and see what he's doing and. And what he's manifesting as a marker in a social pattern. As we see the social pattern manifest itself, as we see this moving towards this culture, moving completely towards bread and circus, and then realizing that man cannot live by bread and circus alone. That's the shift that we're seeing. And we shouldn't be surprised that it's the fool who brings about that flip. And some of the things that have been happening have been crazy. I mean, to watch Kim Kardashian baptize her, get baptized herself and baptize her children in the Armenian Orthodox faith, you know, and to watch Kanye west, who has had devolved into this extremely crass person, all of a sudden have this desire to create worship music, that is a social marker, because when things start to fall, when things. For a change to happen, it has to happen at the bottom. And that is very difficult for people to understand. The spark comes from the top of the hierarchy, but the change happens at the bottom. And so when you watch. When you watch, for example, the rise of Christianity in Rome, you can understand that the first to convert to Christianity, when there's an actual revolution, when there is a change in the structure of things, when there's a renewal for good or for bad, that is, when there's something changes, paradigms, the spark starts at the top, but the shift happens at the bottom. And that's why Christians were the poorest of the poor, were slaves, were women, were all the lower parts of society, and they're the ones who brought about that shift. And then all of that connected together in terms of heaven and earth. You can see it from, for example, like the fact that very strong moments in culture, like Dante, who wrote his poem in a secular, in a common Italian language, rather than writing it in Latin, because he was. He was at that point of transition. He was. He is one of the characters that marks the transition from the Middle Ages into this new age. And there are many examples of that. And so that's also one of the reasons why you always have to watch the. When things are getting Shady. When things are getting crazy, you have to look down, you have to look at the bottom and see what spark in the darkness is going to start to shine. And I think that that's one of the things we're seeing now. We're seeing this flip happen. It's something that I've been looking forward to for a long time that I've hinted at, that I've told you about. And so I think we need to continue to pay attention. And I would say be careful. You. In the sense that Kanye west is a trickster, Kanye west is a fool character. And you know, he, he can bring about. He can manifest this shift, but he is a shifty character. Don't put your trust on him because he can go either way at any point. He can, he can completely change and go in another direction. And, and I would, that wouldn't be surprising either. But rather we do need to see the. That the desire for participation is real in our culture and worship celebration. Realizing that that is actually what culture is pointing to, the desire to celebrate things. Now you can celebrate dark things. You can celebrate one of the things that, for example, since the advent of rock and roll, it's basically been a celebration of sexuality. But you sometimes darker things than that as well. But, but that is really what music ends up being. Now the question is, what are you celebrating? And once you understand that, you can have something like music which is a celebration, but then becomes a participatory thing and becomes a participatory thing which is celebrating the highest, that's when you realize that the ultimate purpose of music and of culture is worship. Just depends what you're worshiping. But if you can align that worship towards the highest thing, then you are. You have the possibility of creating a new stability for the mass, a new. A new ground to stand on, you would say. And so I think keep paying attention to what's going on. I'm telling you guys for sure, with this happening, this whole Kanye west thing. 2020, put on your seatbelt, guys, because 2020 is going to be a crazy year. And who knows what direction it's going to go. But pay attention because things are about to speed up. I hope you enjoyed this episode of the Symbolic World. The Symbolic World is edited by Justin Ward and it is based on a series of videos that you can find on my YouTube channel, Jonathan Pageau's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course, leaving a review on itunes. Everybody knows that's the best way to get the podcast out there to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon Pajot videos as well, and on subscribestar, all those links you can find on my website or in the show description. So thank you and I will see you soon."}
