{"episode_id":"SW - #052 - 2019-08-24 - Faith and Art","start":0.4,"end":54.76,"speaker":"Jonathan Pageau","text":"On this episode of the Symbolic World podcast, I will play for you a panel discussion I had at Wycliffe College at the University of Toronto. The panel was called Faith and Art, and it was with Phil Irish, a contemporary visual artist, and Gloria Kim, who is a cinematographer. And the discussion really surrounded about how to integrate faith with art, how can a Christian make art? And I think that this discussion is very important because when you listen to the different approaches, you will really find the radical difference between modern art, contemporary art, and the liturgical approach, which I am representing in this discussion. And so I think that it ends up being a very interesting dive into how deep the differences are in the traditional way of looking at art and the modern way of looking at art. And so I hope you enjoy."}
{"episode_id":"SW - #052 - 2019-08-24 - Faith and Art","start":68.04,"end":71.72,"speaker":"Jonathan Pageau","text":"This is Jonathan Peugeot. Welcome to the Symbolic World."}
{"episode_id":"SW - #052 - 2019-08-24 - Faith and Art","start":82.4,"end":396.91,"speaker":"Steve","text":"Just like to welcome you on behalf of Wycliffe College and Imago to our Faith and Arts evening. I hope this will be the first of many opportunities for people to gather to explore the dynamics of faith and the arts. Tonight, we are privileged to have three wonderful Christian artists to share a little bit about how faith informs and affects their art forms. Afterwards, we are inviting everybody to continue on to Nuit Blanche, the public art exposition here in the city. Just by ways of introduction, I want to introduce each of our panelists today. So on the far right, we have Jonathan Pageau. Jonathan graduated with honors from painting and drawing program at Concordia University in Montreal during the late 90s. Quickly disillusioned with contemporary art. Sorry, Phil. He discovers icons and traditional Christian images along with his own spiritual journey. Rekindling his love of art through the study of traditional form. Jonathan develops passion for wood carving. While living in Kenya for several years, he also discovered the properties of a certain type of staleite called the Kissy Stone. Having studied Orthodox theology and iconography at the University of Sherbrooke since 2003, Jonathan has been carving different types of liturgical objects. His carvings have been commissioned by priests, bishops, lay people in the United States, Canada and Europe. His work is also represented by major liturgical art companies including Damarius and Robitaille in Canada and New World Byzantine Studios in the United States. He's also the editors and contributors of the Orthodox Arts Journal and also teaches icon carving with Hexameron, nonprofit organization dedicated to the sacred arts. So I'd like to welcome Jonathan here. Gloria Kim was born in Seoul and is based here in Toronto, and she comes from a long line of media makers. With a degree in English lit from the U of T. She has worked as a journalist at McLean's. She attended Ryerson's Image and Arts and the 2008 Canadian Film Centre's Director's Lab. Her short film Rock Garden Not a Love Story is described by Adam Egoen as absolutely beautiful has won numerous prizes including the CBC Canadian Reflections Award. Her CBC film the Auction premiered at the 2010 Sprocket's TIFF and won Best Short Film, the Audience Choice Award 2012 Short Film Showcase and the Children's Journey Prize Seattle Film Festival for Children and is now part of the John Van Duser Film Collection at the Tiff Bell Lightbox. Her other major works have won numerous golds and Bessie's the Marketing Awards 1 Club. Her OAC commissioned work why Do I Dance has almost a million views on YouTube since April 2012 and she was in the 2009 TIFF Talent Lab. So I'd just like to welcome Gloria Kim here today. And last but not least, Phil Irish. For Phil, painting has become a way of exploring the world, stimulating the imagination and sparking deep exchange with others. He earned his Masters of Fine Arts from York University, Toronto and his Bachelor of Arts in Fine Arts in English Literature from the University of Guelph. Exhibitions at public museums, artists run centers and commercial galleries including the Oakville Galleries, Tom Thompson Memorial Gallery Gallery Joyce Yahunda Angeli Gallery AKA Artists Run Center. His contributions to the Francophone International Painting Competition was exhibited at the National Gallery of Canada. La Monif d', Art, Quebec City's biannual featured his work as having a group of exhibitions across Canada and the United States. He has developed his new work during residencies in Newfoundland at the Sylposium in by Saint Saint Paul, Quebec and as the City of Kitchener's Artist in residence. Irish applied his painterly vision to a web based artwork for Oakville Galleries. In 2007 he was shortlisted for the Kingston Prize, Canada's national portrait competition. Phil lives with his family in Elura, Ontario. So thank you Phil for coming out tonight. I'd just like to introduce also our panel moderator for this evening, Patricia Patty. Patricia Patty serves as a Communications Director here at Wycliffe College and she has a deep, long passion for for the arts and how that intersects with faith. And she's more than happy to be up here exploring a very important topic with our guests tonight. So thank you Patricia for being willing to do this tonight."}
{"episode_id":"SW - #052 - 2019-08-24 - Faith and Art","start":396.99,"end":397.47,"speaker":"Patricia Patty","text":"Thank you."}
{"episode_id":"SW - #052 - 2019-08-24 - Faith and Art","start":397.47,"end":398.27,"speaker":"Steve","text":"Thank you everybody."}
{"episode_id":"SW - #052 - 2019-08-24 - Faith and Art","start":402.43,"end":472.55,"speaker":"Patricia Patty","text":"So thank you Steve for the introduction and thank you everybody for coming out tonight to engage with our panel on this wonderful, rich, deep topic. And I'm sure we're all going to go home with much to ponder and reflect on tonight. And thank you again to our panelists. We're going to start with kind of a general question to get our panel warmed up, and then I'm going to have a question for each of you pertaining to your own particular art form. And then we're just going to get into some discussion, and I hope that you'll feel free to just talk back and forth and engage with one another, and hopefully we'll have some time for some questions at the end. So, just to begin with Eugene Peterson, I'd like to start with a quote by Peterson. He has said that instinctively we recognize that there's more to beauty than what we can discern with our senses. Instinctively, we recognize that there's more to beauty than what we can discern with our senses. So what do you think about that? True. Not true. Do you agree? Disagree."}
{"episode_id":"SW - #052 - 2019-08-24 - Faith and Art","start":474.39,"end":474.79,"speaker":"Gloria Kim","text":"Phil?"}
{"episode_id":"SW - #052 - 2019-08-24 - Faith and Art","start":476.07,"end":528.25,"speaker":"Phil Irish","text":"I'd agree. So if beauty is just something in the senses, then that's just thinking about things like rhythm and color and pattern, which that's what a formalist artist might really be leaning into. All those things are important. I love that. But I think we use beauty to also talk about meaning, to talk about kind of patterns in life that something might evoke for us. So all of those things start to reach beyond just the senses, right? You bring your memory, you bring your mind, you bring your experience, you bring your suffering and your hope, all of that. So. So a deeper layer of beauty, I think, would touch all of those things."}
{"episode_id":"SW - #052 - 2019-08-24 - Faith and Art","start":529.45,"end":530.57,"speaker":"Patricia Patty","text":"What do you think, Gloria?"}
{"episode_id":"SW - #052 - 2019-08-24 - Faith and Art","start":531.13,"end":561.28,"speaker":"Gloria Kim","text":"I think of beauty as connection. I mean, for me, what's so important in art is feeling some kind of connection. And maybe that's super simplistic, but I do think that without that, it's hard. I mean, that's how I perceive beauty, and it's something that moves me and makes me feel presence and source. So that's a really, really big, important thing."}
{"episode_id":"SW - #052 - 2019-08-24 - Faith and Art","start":561.28,"end":570.52,"speaker":"Patricia Patty","text":"For me. There's very much a sense that it engages the spirit. Right. Jonathan, what do you think?"}
{"episode_id":"SW - #052 - 2019-08-24 - Faith and Art","start":571.72,"end":682.45,"speaker":"Jonathan Pageau","text":"Yeah, I like the way Gloria presents this notion of connection. I think that's a good way to understand beauty is when you look at something and you see that the things fit, that somehow things fit together, that it should be that way. And so what it does is that it actually points us to truth. There's something. There's a relationship between beauty and truth, and it has to do with how things are coming together in a manner which intuitively is right. And I think that that. That is something that can Be anagogic, that it can help us to understand God, that it can help us to understand the way that God created the world, that brought things together, this notion of fitting together in a manner that is good. And so I think that beauty can actually be a portal for many people, especially in a world that is so random and somewhat ugly. You know, the world of, you know, strip malls and concrete. I think that this apparition of beauty can really be a surprise that can remind people of this deep connection that we have. You know, we always. In the Orthodox Church, there's this trope that everybody repeats that is somewhat from Dostoevsky but is really from Solzhenitsyn, which is that beauty can save the world, that beauty will save the world. And to understand it in that way, that it will save the world because it reminds us, that it shows us how deeply connected things are together. That's how it can save the world. So I totally agree with you with."}
{"episode_id":"SW - #052 - 2019-08-24 - Faith and Art","start":682.45,"end":693.46,"speaker":"Patricia Patty","text":"Peterson, with Eugene Peterson. Good old Eugene. Okay, I'd like to give each of you an opportunity to speak, to tell us a little bit about the medium in which you work. And we're going to start with you again, Jonathan, if that's okay."}
{"episode_id":"SW - #052 - 2019-08-24 - Faith and Art","start":693.62,"end":694.02,"speaker":"Phil Irish","text":"Sure."}
{"episode_id":"SW - #052 - 2019-08-24 - Faith and Art","start":694.1,"end":714.69,"speaker":"Patricia Patty","text":"So you carve icons. And I understand that the process of painting an icon is almost a liturgical process, that certain prayers are said before the painting and even during the process that certain music is played. What about carving an icon? Is that a spiritual act of worship for you?"}
{"episode_id":"SW - #052 - 2019-08-24 - Faith and Art","start":716.29,"end":811.33,"speaker":"Jonathan Pageau","text":"I think that it can be. And it also sometimes is not what you talked about, this way of making icons. It's a very. It's somewhat idiosyncratic. It's a very new thing, this idea that you say certain prayers before and everything. It's a very recent phenomena that things are done this way. Not. I would say that most professional icon carvers don't do it that way, because when you do it for a living, you're doing it all the time. And so you wake up in the morning and you go to the workshop, and then you carve icons. And so there are moments where really you do feel like everything is coming together, and you have this prayerful spirit, and you look at the saint that you're carving or this image of Christ, and you. You can feel the connection developing as the figure is appearing. And there's this process. But other times, just had a fight with my wife or someone said some horrible thing on Facebook that I can't get out of my mind. And so then it just becomes a job, and we have to be Careful. Because sometimes I have had the surprise of people tell me that this icon is so full of grace. And. And I know that when I carved that icon, I had no grace. I was a complete wreck when I was making it. And so we have to trust that in our humble, by the grace of God, that sometimes these things happen. God can use us, even if we're."}
{"episode_id":"SW - #052 - 2019-08-24 - Faith and Art","start":811.33,"end":814.77,"speaker":"Patricia Patty","text":"Not saints, in all our human frailty."}
{"episode_id":"SW - #052 - 2019-08-24 - Faith and Art","start":814.77,"end":815.21,"speaker":"Jonathan Pageau","text":"That's right."}
{"episode_id":"SW - #052 - 2019-08-24 - Faith and Art","start":815.21,"end":815.81,"speaker":"Gloria Kim","text":"Exactly."}
{"episode_id":"SW - #052 - 2019-08-24 - Faith and Art","start":816.29,"end":838.77,"speaker":"Patricia Patty","text":"Awesome. That's amazing. Thank you for sharing that. Phil, you specialize in big, bold creations, and it's been said of your collaged paintings that they assert the need for transformation. I'm wondering what that means to you. And is that impression something that you consciously set out to create when you make your art?"}
{"episode_id":"SW - #052 - 2019-08-24 - Faith and Art","start":841.33,"end":973.71,"speaker":"Phil Irish","text":"Yeah, so I used to make. Well, maybe I'm doing some of these again, but kind of rectangular paintings in formats that close to what you might expect. I was always kind of playing with it and pushing it, but I was going through a point in my life with a lot of turmoil on a lot of layers. And I began to make painted surfaces, but then cut them up and collage them back together again. So this act of taking something that is kind of stable, that you can attach meaning to in a certain way, and then to break that thing and have broken things all over the place and then to pick up those parts and recombine them together in a new way, that became the visual language that really excites me. And I've been working in that direction for the last five years or so. And so the idea of transformation is critical. So, I mean, you can still see that as a viewer, when you walk into the space, you can see, oh, this was a part of this, and this has a cut through it. And I wish I could see the other half of this, but it's gone. So you get a very clear sense of fragility and sometimes even violence of something breaking. And yet the way I put them together, there's a kind of rhythm and energy and life to it that feels. Yeah. So I was thinking about this. Like, things fit. Like they fit together. There's a kind of wholeness to them. And yet another aspect of it is that you feel like you could still move some pieces so they haven't come together to an extent that they feel timeless and frozen. They feel like this could continue to change. It's beautiful, but it's broken, and it can still keep changing. And that, for me, reflects my sense of life and also of faith. You know, some things, but some things are broken. And how do you find hope and where are we heading? And can you start to see that in the work, but without it being a closed answer?"}
{"episode_id":"SW - #052 - 2019-08-24 - Faith and Art","start":974.03,"end":975.23,"speaker":"Patricia Patty","text":"A fixed thing?"}
{"episode_id":"SW - #052 - 2019-08-24 - Faith and Art","start":975.23,"end":978.67,"speaker":"Phil Irish","text":"Yeah. It's provisional, in a sense."}
{"episode_id":"SW - #052 - 2019-08-24 - Faith and Art","start":978.75,"end":979.39,"speaker":"Gloria Kim","text":"Okay."}
{"episode_id":"SW - #052 - 2019-08-24 - Faith and Art","start":979.55,"end":1002.29,"speaker":"Patricia Patty","text":"Okay, thank you. And, Gloria, I've watched some of your short pieces on Vimeo, and I was really struck by the contrast in them between beauty and the provocative. And I'm wondering if you could talk to us for a minute about that tension as a filmmaker and what do you see as being your primary motivation?"}
{"episode_id":"SW - #052 - 2019-08-24 - Faith and Art","start":1004.77,"end":1118.52,"speaker":"Gloria Kim","text":"Well, I mean, that's interesting, because when I started making films, it was really. Because, like, I talk about connection and beauty, and I really wanted to connect. Like, I wanted to. I think when. Okay, just as a human being, you know, you walk in this world, you feel like a freak. You feel disconnected from everyone else. And. Well, I did, and I just. What I wanted was to kind of say, like, this is who I am. And I see you, and I know you feel kind of the same things that I feel, maybe at different times. And a lot of times, we just don't talk about that stuff, right? All the stuff that maybe whatever it is that we're going through in our days. And for me, art was a way of talking about stuff and connecting people to stuff that we don't normally, in polite conversation, talk about, like, at a party or, you know, whatever at a bar. So that was always kind of my motivation. And then I ended up like, because when you're making work and you're trying to convince people to give you money to make work, you have to. There has to be some kind of, like, whatever it is that you're kind of pushing the envelope on. You have to be able to kind of justify that, right? And say, like, look, there's this audience, or I'm serving some. Some kind of thing where people will want to see. And so the stuff that I ended up making, like, my first film that I did for cbc is like a trans fantasy fable, and there's a really, really rabid niche LGBTQ audience. And so I got funding for the film, and then it ended up doing really well."}
{"episode_id":"SW - #052 - 2019-08-24 - Faith and Art","start":1118.82,"end":1118.98,"speaker":"Patricia Patty","text":"But."}
{"episode_id":"SW - #052 - 2019-08-24 - Faith and Art","start":1119.13,"end":1239.6,"speaker":"Gloria Kim","text":"But what I really wanted to talk about was identity, right within that culture and that subculture, and who are we? And can we accept ourselves even if we are a freak or the way that the rest of society sees us? I mean, everything I've done has been kind of around, like, okay, how do I find funding for this? Because it's an incredible, incredibly expensive medium. It's very labor intensive. There's a lot of gear like, it's just creating the landscape of any film is expensive. And then how do I say what I want to say around? Whether it's like that story or. I did a little children's story, but it was like the story of, you know, like, it was like an immigration story. So that was kind of like the political angle that I could find the funding for. But also it was really a story about a little girl who sees her parents for the first time as people. Right. Because that was what I wanted to talk about. Right. So it's just kind of like it's. I don't know, like that. Like, I thank you for saying my work is provocative. That's great. Awesome. And I have been told that before. And. Yeah, I just. I don't know. Like, I just like to talk about stuff that maybe people I don't know might be a little bit uncomfortable talking about. But I don't know. Like, I guess because, yeah, it's that whole thing, like, when you are an artist and you come from an artist's heart and you feel so deeply about everything and, you know, you walk in the world and you can't pretend not to feel right. Like, I think that's the reason why I'm always like, oh, like, I see this story and I see you and I see your humanity and let's put a. Let's create a story around it."}
{"episode_id":"SW - #052 - 2019-08-24 - Faith and Art","start":1241.12,"end":1316.37,"speaker":"Patricia Patty","text":"I'm struck by each of you. I mean, I have this sense of awe around artists, people who make their living full time as artists. And I think it's easy to put people like you on a pedestal. But as you talk, you all are really so honest about sharing the nitty gritty of what it's really like to engage in your art. So I'm just wondering if you could talk for a minute, just as a of part panel, about that contrast between creating, like, recognizing you spend your days, you make your living creating things that are beautiful or reflective of truth or that are intended to inspire people. And yet you have this other side of life that's about paying the bills and, you know, dealing with the kids or fighting with your spouse or those things. So how do you come to grips with those two sides of, you know, what life is for you as artists?"}
{"episode_id":"SW - #052 - 2019-08-24 - Faith and Art","start":1317.97,"end":1357.34,"speaker":"Phil Irish","text":"One thing I love about being an artist is it touches. It grows out of everything that you're excited about in life. Right? Like there's, you know, my family shapes my work, my faith shapes my work. All of those things feed in, you know, you're curious about something and then you're reading about that thing and all these things you're reading about tie in. And I'm a real sketchbook keeper. And there's all these things that I, you know, in all, you know, sometimes you put something in there that just seems irrelevant. And then a little while later you look back and you realize that feeds. That's feeding this question that's becoming some new. Some new project. Right. So."}
{"episode_id":"SW - #052 - 2019-08-24 - Faith and Art","start":1358.86,"end":1360.82,"speaker":"Patricia Patty","text":"So everything kind of becomes fodder."}
{"episode_id":"SW - #052 - 2019-08-24 - Faith and Art","start":1360.82,"end":1405.74,"speaker":"Phil Irish","text":"Yeah, yeah, yeah, yeah. I mean, I. Another side of it is that I also teach studio somewhere. So the money question is daunting. Sometimes I've made pretty good money, sometimes less. But the kind of family relationship money question is a little bit taken care of. Since about five years ago, I took the precarious roller coaster down a notch. And so my family's happy about that."}
{"episode_id":"SW - #052 - 2019-08-24 - Faith and Art","start":1405.98,"end":1407.1,"speaker":"Patricia Patty","text":"Took an academic job."}
{"episode_id":"SW - #052 - 2019-08-24 - Faith and Art","start":1409.75,"end":1439.12,"speaker":"Phil Irish","text":"Well, I don't know, just. Yeah, I mean, so some of the turmoil maybe of your question is. And that has. What does that allow me to do? I mean, that's allowed me to make some crazier things, which is good. So it's like, yeah, it's given a certain kind of freedom in a certain way to make things that aren't stressed about that money question day to day. So anyway, there's a little confession for you."}
{"episode_id":"SW - #052 - 2019-08-24 - Faith and Art","start":1441.2,"end":1442,"speaker":"Patricia Patty","text":"Jonathan."}
{"episode_id":"SW - #052 - 2019-08-24 - Faith and Art","start":1444.08,"end":1535.48,"speaker":"Jonathan Pageau","text":"No, I didn't. I didn't actually. I don't feel like I decided that I was going to be an icon carver. I never actually decided that. I think no rational person could decide that in Canada of all places. I was kind of. I kind of. It kind of happened to me just very. I was. Long story. I was in Africa for several years, for seven years. And it's. When I came back, I was looking for work and I just. It felt like every project that I was starting was never working. Nothing was kind of panning was coming. And I had this secret prayer that I could be making liturgical art, but I never thought it would ever happen. So I was kind of doing it on the side, trying to survive psychologically as I was trying to find work and putting up little websites, writing emails. And then after about a year and a half of just not nothing coming up, I was in prayer and I was like, what is this? Like, God, what is it that you want from me? I don't know. I came back to Canada. I thought this was the right thing to do, but then nothing is happening. And. And it's like it dawned on me that I had slowly accumulated about $10,000 of commissions for carving. And so that was the only Thing in front of me. It was the only thing I had. And I said, okay, I have. Here's a step. I'll just take that step. And I just took one step at a time and that's it. I just never stopped since. And in terms of money."}
{"episode_id":"SW - #052 - 2019-08-24 - Faith and Art","start":1537.65,"end":1538.17,"speaker":"Jonathan Pageau","text":"I've seen."}
{"episode_id":"SW - #052 - 2019-08-24 - Faith and Art","start":1538.17,"end":1620.89,"speaker":"Jonathan Pageau","text":"Miracles constantly, just constant miracles. I've gotten checks in the mail from people I don't know, three times someone has given us a car just non stop. We'd come to our house and find bags of clothing on our porch, and we have no idea where it comes from. And so it's just been like, I think there's a truth that if you kind of. I mean, I don't think everybody's called like that, like that God kind of shows you a path and you kind of have to go or else you're in trouble. It's like I felt like that's what it was. Like God was saying, okay, this is the step you have to take and don't worry and I'll take care of you. And, you know, and that's what happened. And it doesn't stop the fact that I'm still like the Israelites in Egypt in the desert. Like, oh, constantly I would be looking at my bank account and thinking, this is absolutely insane. I have three kids, what am I doing? And then just some crazy miracle. Like, I've had people call me and I owe like a certain amount of money and someone calls me and said, you know, I was praying and God kind of nudged me to send you this check. And it was just the exact amount that I owed. And it was just this constant thing. So you. I think that. I think that when you. I do, I've come to believe, even though in my darker moments, I don't actually believe it, but I can say that if you trust God, that things are gonna be okay."}
{"episode_id":"SW - #052 - 2019-08-24 - Faith and Art","start":1622.25,"end":1628.49,"speaker":"Patricia Patty","text":"It does sound like an affirmation of a call. Do you feel called to your filmmaking, Gloria?"}
{"episode_id":"SW - #052 - 2019-08-24 - Faith and Art","start":1628.49,"end":1733.5,"speaker":"Gloria Kim","text":"100%, yeah. I have often said it's my faith journey, like, very definitely. I mean, I was always a writer. I always wrote when I was a little kid. And I liken it to channeling. You're basically. You're connected to source, and source is basically telling this story through you. And you're the instrument, really. Right. Like your experience and your. Whatever, your body is the instrument through which the story is told. So obviously it's situated in me as a Korean Canadian woman. So that kind of story kind of really flows really easily for me. But definitely the filmmaking aspect of things like I found directing and, like, out of a writer's block that came out of a trauma that ended up helping me find my voice. And every step of the way, like, every film I've ever made has been nominated for awards, won awards. You know, I've always had funding for my films. And, like, I am also a very big believer that if you trust, if you just keep walking the path and yes, it's a very scary path. I think we all are like, yes, I see you nodding your head there, my friend. Yeah, it is a kind of terrifying thing. You really are kind of just basically making the leap and you're saying, okay, God, catch me. I hope you're gonna be there, because I'm jumping. And I've definitely made a lot of choices like that, which I think, like, maybe more sensible people wouldn't make, but I think."}
{"episode_id":"SW - #052 - 2019-08-24 - Faith and Art","start":1734.38,"end":1736.3,"speaker":"Patricia Patty","text":"But it's an act of faith."}
{"episode_id":"SW - #052 - 2019-08-24 - Faith and Art","start":1736.78,"end":1738.86,"speaker":"Gloria Kim","text":"It's 100% an act of faith."}
{"episode_id":"SW - #052 - 2019-08-24 - Faith and Art","start":1739.18,"end":1746.7,"speaker":"Phil Irish","text":"It's a great way to be alive. Right. Like all the parts of our stories. Right. All the complexity of that, and it makes the work deep."}
{"episode_id":"SW - #052 - 2019-08-24 - Faith and Art","start":1746.7,"end":1747.02,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #052 - 2019-08-24 - Faith and Art","start":1747.34,"end":1750.75,"speaker":"Phil Irish","text":"So what a joy to be able to live that way, to be able."}
{"episode_id":"SW - #052 - 2019-08-24 - Faith and Art","start":1750.75,"end":1764.39,"speaker":"Gloria Kim","text":"To do everything that was put in me. Right. To be able to use everything that I was given. That's how I feel when I make films. So I, you know, I have no regrets."}
{"episode_id":"SW - #052 - 2019-08-24 - Faith and Art","start":1764.71,"end":1774.31,"speaker":"Patricia Patty","text":"Wonderful. How does your faith inform your art? This question for all of you. How does your faith inform your art, or vice versa? How does your art inform your faith?"}
{"episode_id":"SW - #052 - 2019-08-24 - Faith and Art","start":1775.03,"end":1775.29,"speaker":"Gloria Kim","text":"How."}
{"episode_id":"SW - #052 - 2019-08-24 - Faith and Art","start":1775.36,"end":1779.68,"speaker":"Patricia Patty","text":"How does it influence if that's easier?"}
{"episode_id":"SW - #052 - 2019-08-24 - Faith and Art","start":1784.32,"end":2064.33,"speaker":"Phil Irish","text":"Yeah. I think that it's a very rich thing. It's also a very subtle thing. So sometimes you get that question and people are looking for a very one to one. This illustrates that. Right. And so that's. That's what's tricky about that, is to try and figure out, okay, how really do I understand that, you know, part of it is about the mystery of God and things you don't know. So much of art is following a question, and my faith is kind of like that too. Where you. One of my sort of repeated thoughts to myself as I'm working is just to trust the process. Trust that good will come out of the things that you're making, both in terms of the visual effect of it, but also how it will touch people. Yeah. I might tell one story that is maybe a little more explicit, but it's an interesting story that's also about crossing boundaries. So I guess one of the dangers. Okay. If I make something that's really faith explicit, am I Going to alienate an audience. But on the other hand, art is beautiful at crossing boundaries where because you're not saying something in a cliche way that people that think they're turned off by faith because you're coming at it from a different angle, it can really open doors. So anyway, I live in a small town and there's a woman there who is a tarot card reader. And so she travels around and she realized that a bunch of places are making these decks of cards where the cards are made by artists instead of being kind of traditional cards. So she thought, why don't we take our small town and we all make a card and I'll sell these decks all over the world. So she's calling up different people and so she calls me up and I have a little moment of feeling uncomfortable, right? It's like, okay, tarot card, what's going on? How are people seeking plans for their future? What's guiding what? What's going on there? I don't really know what's going on. So maybe I'm kind of compelled to say maybe it's not my thing, maybe I'm not going to do that. But on the other hand, what I'm hearing is, okay, there's like 40 people from my village who are creative people who are getting together to talk about a space spiritual thing and make stuff. Am I going to be the person who's got all the answers and I'm going to say no to that, or am I going to be the person that like Jesus eaten with all kinds of people crossing boundaries, there's an opportunity, right? So what I ended up doing was I made a card and it is the seven of pentacles shows a guy leaning on his hoe looking at a plant and the plant is bearing fruit and the fruit is coins with pentagrams on them. And considering whether he's going to harvest or not or fertilizer or whatever. I can relate to the theme, right? Like productivity and where you at? It's a good theme. I can relate to that. So I replaced the pentacles with actually a squash plant has these five pointed flowers. So I replaced the pentagrams with flowers and fruit, different stages of fruiting from squash. And then I replaced the gardener with a Jesus figure from a Fra Angelico painting, which is one that I love, where Mary Magdalene mistakes Jesus for the gardener. So the gardener looking at the plant is actually the gardener from the resurrection. So there are all these different things going on in it. It's multi layered. I think it's a really interesting painting. So it ends up being in this context where people are talking about these other things. So I imagine somewhere around the world tonight, someone's maybe dealing out some tarot, and they're looking down, going, like, what's Jesus doing in my tarot deck? And it's led to some really good conversations and so on. So, I mean, that's kind of a. That was. That's a whole faith journey to do that. But it also just shows that act of just letting go. Right. Like, I can't control the meaning of that piece. It's going to mean different things to different people. It's out in the world, and you can't just make a firm message. It's just something that came authentically out of me, and I shared it with a group of people, and that's what you can do."}
{"episode_id":"SW - #052 - 2019-08-24 - Faith and Art","start":2065.37,"end":2087.92,"speaker":"Patricia Patty","text":"Thank you. Phil, you mentioned letting go of your art once it's out in the world. Is that a hard thing to do as artists? Like, understanding that people are going to interpret your art differently than maybe what you intend them to take from it? What do you think, Jonathan? Is that maybe as an icon?"}
{"episode_id":"SW - #052 - 2019-08-24 - Faith and Art","start":2087.92,"end":2089.92,"speaker":"Jonathan Pageau","text":"I'm probably the wrong person to ask Carver."}
{"episode_id":"SW - #052 - 2019-08-24 - Faith and Art","start":2089.92,"end":2090.64,"speaker":"Patricia Patty","text":"It's not."}
{"episode_id":"SW - #052 - 2019-08-24 - Faith and Art","start":2094,"end":2186.19,"speaker":"Jonathan Pageau","text":"I make. The objects that I make are made in a language. It's very different. They're made for a community, they're made within a community, and they're made to serve a community. And so when I make an image, I'm making it in a manner to connect with people who already, although I've never seen that icon, will know the tropes of the language and will know what we're referring to. So there's this common language that's happening. And so when I make something, I know who I'm making it for. That is, I have someone who writes me or calls me and says, I'd like you to make this for me. And they'll tell me a bit of their story. I'm going to give it as a gift to someone. Or my child's being baptized, and I want something to remember. Or there's something. There's a story. And so when I'm making that image, I'm making it for someone. And so I'm so happy when to see it go, because I know that I'm going to send this object in that person's life, and it's going to participate in their life. And if it's for a church, that it'll participate in the church. It'll be part of the architecture. It'll be Part of the liturgy, part of that community. It'll be an image that will enter into a community. And so it's more. So I'm not. So I don't have that type of fear, because. Yeah, because it's a different. It really is this communal art."}
{"episode_id":"SW - #052 - 2019-08-24 - Faith and Art","start":2186.83,"end":2192.71,"speaker":"Patricia Patty","text":"In fact, an icon is meant to be like a window to a deeper reality."}
{"episode_id":"SW - #052 - 2019-08-24 - Faith and Art","start":2192.71,"end":2193.07,"speaker":"Gloria Kim","text":"Right."}
{"episode_id":"SW - #052 - 2019-08-24 - Faith and Art","start":2193.15,"end":2193.87,"speaker":"Patricia Patty","text":"Is that correct?"}
{"episode_id":"SW - #052 - 2019-08-24 - Faith and Art","start":2193.87,"end":2194.79,"speaker":"Jonathan Pageau","text":"Hopefully, yeah."}
{"episode_id":"SW - #052 - 2019-08-24 - Faith and Art","start":2194.79,"end":2195.35,"speaker":"Patricia Patty","text":"Okay."}
{"episode_id":"SW - #052 - 2019-08-24 - Faith and Art","start":2195.35,"end":2195.95,"speaker":"Gloria Kim","text":"Okay."}
{"episode_id":"SW - #052 - 2019-08-24 - Faith and Art","start":2196.59,"end":2199.63,"speaker":"Patricia Patty","text":"So there is no risk of it being misinterpreted?"}
{"episode_id":"SW - #052 - 2019-08-24 - Faith and Art","start":2199.63,"end":2202.59,"speaker":"Jonathan Pageau","text":"Oh, of course there's a risk of it being misinterpreted."}
{"episode_id":"SW - #052 - 2019-08-24 - Faith and Art","start":2204.67,"end":2205.95,"speaker":"Phil Irish","text":"Because not everyone has the code."}
{"episode_id":"SW - #052 - 2019-08-24 - Faith and Art","start":2206.03,"end":2248.6,"speaker":"Jonathan Pageau","text":"That's right. Exactly. I mean, the language of iconography has been used to do all kinds of insane things. Make icons of random people or put Harry Potter with a halo or all that kind of stuff. I mean, obviously it is possible, but when I make something, usually I engage with the person I'm making it with. I rarely have something that I just make and then sell. It's always an interaction. And so, yeah, so at least I haven't yet felt that I'm sending something out to just be misused or just be a strange thing for them."}
{"episode_id":"SW - #052 - 2019-08-24 - Faith and Art","start":2249.48,"end":2265.98,"speaker":"Patricia Patty","text":"Okay. I did want to ask you all later at some point about that idea of, you know, how much is your ultimate audience or public for your artwork in your mind as you are creating that piece?"}
{"episode_id":"SW - #052 - 2019-08-24 - Faith and Art","start":2268.38,"end":2321.36,"speaker":"Gloria Kim","text":"Are you asking now? Yeah. I mean, like, I think audience is really important in the terms of, like. I mean, when you're making, like, the kind of media that I make, you constantly think of an audience because you're constantly thinking of selling and you're constantly trying to convince somebody, yes, this is worth putting money into because you're gonna get some money back. So there is that. So you're always kind of describing the audience. I mean, I think the nice thing about. I mean, when I think about art and, like, what I do and making films versus, say, making advertising, because I've also done that. Is that with films, it's a conversation, right? It's like a conversation, and you don't know where it's going to go. And you're hoping that someone's going to hear part of it and, like, understand part of what you meant and the heart of what you meant. But it's always a dialogue."}
{"episode_id":"SW - #052 - 2019-08-24 - Faith and Art","start":2321.36,"end":2321.56,"speaker":"Phil Irish","text":"Right."}
{"episode_id":"SW - #052 - 2019-08-24 - Faith and Art","start":2321.56,"end":2385.29,"speaker":"Gloria Kim","text":"And I think that's the really wonderful thing about art, is that it is a dialogue, and it's very. Like, it can go anywhere and it sparks things and, like, it does things like put a halo on Harry Potter and, you know, all of those wonderful things. And that becomes part of the general Conversation and like it just grows beyond that and symbology has become this huge thing that's everywhere and like, you know, you're talking about pentagrams, but you're right, it's like, you know, like from a flower, like five pointed flower. Whereas with something like advertising, it's very much, this is the exact audience, this is their income, this is the messaging. They call it messaging. You know, not that there's anything wrong with advertising, you can make a good living, just. But it's just really like very one sided. Right, it's like manipulation. Yeah, well, yeah, yes, one could say that. Yes, definitely."}
{"episode_id":"SW - #052 - 2019-08-24 - Faith and Art","start":2385.29,"end":2386.09,"speaker":"Phil Irish","text":"It's a one sided."}
{"episode_id":"SW - #052 - 2019-08-24 - Faith and Art","start":2386.09,"end":2451.16,"speaker":"Gloria Kim","text":"Yeah, yeah. And it's just an arrow pointing one way. Right. And there is really no mistake. Right. So that is what I think is so wonderful about art. And even when you're thinking about audience, you're, you know, you might have an ideal audience in mind. Like I have a feature that I'm making that I'm going to be shooting in the next three weeks and I have kind of, yes, the audience is going to be women. It's going to be, you know, probably women who are like more left leaning, liberal, but you know, also like for me the ideal audience is like women who have been through certain kinds of experiences and certain kinds of trauma and who have a need for a certain kind of a message. But then you're also like, I hope other people, like, I hope men see it as well and like sympathetic men see it. I hope like unsympathetic men see it. You know, like, I hope, you know, there's just this message that you're hoping. Yeah, that I'm hoping that will open there. But it's like, it's like a heart opening for me. Like as opposed to, I mean there is a specific message."}
{"episode_id":"SW - #052 - 2019-08-24 - Faith and Art","start":2451.16,"end":2451.48,"speaker":"Phil Irish","text":"Yes."}
{"episode_id":"SW - #052 - 2019-08-24 - Faith and Art","start":2451.48,"end":2453.72,"speaker":"Gloria Kim","text":"But really it's about opening the heart for me."}
{"episode_id":"SW - #052 - 2019-08-24 - Faith and Art","start":2453.72,"end":2472.21,"speaker":"Patricia Patty","text":"Right, so let's talk about that idea, a little bit of you. You called it manipulation. But what is the power of arts to move people toward faith, do you think? Jonathan, what do you think? What is the power of moving of art to?"}
{"episode_id":"SW - #052 - 2019-08-24 - Faith and Art","start":2472.61,"end":2504.79,"speaker":"Jonathan Pageau","text":"I think that when we talk about messaging, I think that we are kind of the heirs of the rationalistic world. We have this idea of what's the message. But we talked about beauty at the beginning. And I think that beauty is the greatest thing that we can bring to the contemporary world because there is such a lack of beauty. And I always tell people, you know, when tourists come to a city and where do they end up visiting? They end up visiting these Old churches."}
{"episode_id":"SW - #052 - 2019-08-24 - Faith and Art","start":2504.79,"end":2505.15,"speaker":"Phil Irish","text":"Why."}
{"episode_id":"SW - #052 - 2019-08-24 - Faith and Art","start":2505.23,"end":2575.98,"speaker":"Jonathan Pageau","text":"Why do they visit these old churches? Because there's something. There's something different. There's some vision that's there which is different than this banal kind of McDonald's world that we. That we live in. And I think that that's what we can offer. And so I. Of course, I. Coming from my perspective, I really do see that in the Christian tradition, we have so much. We have so much wealth. We have 2,000 years of this wealth. And so it's not hard to just to look back and to see all that. This whole musical tradition. We have an architectural tradition, we have a visual tradition, and we have an iconological tradition. All these images, these patterns of images which go. Relate to the Bible, which also relate to the liturgy, which relate to the songs, which relate to the architecture. This massive pattern, you know, and then the whole liturgical year, this whole way."}
{"episode_id":"SW - #052 - 2019-08-24 - Faith and Art","start":2575.98,"end":2578.58,"speaker":"Jonathan Pageau","text":"Of living to celebrate different things in."}
{"episode_id":"SW - #052 - 2019-08-24 - Faith and Art","start":2578.58,"end":2661.29,"speaker":"Jonathan Pageau","text":"The life of Christ all through the year, you know, different colors, different. This whole. Just this gigantic artwork, you know, this. You know, when Wagner talked about this idea of, like, the perfect work of art, the total work of art, well, he was wrong. Like, it's not the opera, because when you're in the opera, you're not in the work of art. You're watching it. But in the Christian liturgical art, you're inside and you're singing and you're in the space and you're participating in that story, and you're celebrating Christmas and Theophany and Pentecost. And so that, to me, that kind of beautiful pattern is what we can bring to the world because it's lacking. We have nothing to celebrate anymore. And so that's. I mean, that's one of the reasons why I ended up going towards something which might feel hermetic to a certain extent, as, like, making icons very hermetic. But I don't see it that way. I really see it as plunging back into this giant story. Not just the actual carved icon, but it's just one piece of the whole kind of liturgical tradition of the Christian tradition. And I think that that giant package is something which can surprise the world with beauty."}
{"episode_id":"SW - #052 - 2019-08-24 - Faith and Art","start":2662.41,"end":2663.29,"speaker":"Phil Irish","text":"So. Yeah."}
{"episode_id":"SW - #052 - 2019-08-24 - Faith and Art","start":2664.49,"end":2707.61,"speaker":"Patricia Patty","text":"Thank you. Thanks, Jonathan. Phil, I'd like to ask you this question, and it was something that Gordon Gloria kind of touched on. It was about the idea of, you know, I mean, she referenced specifically Christian films and talked about, you know, a certain level of quality. But I'm wondering, when Christians make art, there is definitely the potential for a prophetic truth speaking to occur, but is there a danger of Using the arts as a cover for just religious propaganda. And if so, is that ever a temptation for you, for any of you really? And if so, what do you do with that temptation?"}
{"episode_id":"SW - #052 - 2019-08-24 - Faith and Art","start":2710.89,"end":2745.92,"speaker":"Phil Irish","text":"Part of what I was thinking about when you were talking about advertising and talking about that firm message and about a category called Christian art, which can be awful. So I mean, what makes it awful? I mean, on the one hand, I mean, partly it's just a lack of ambiguity. Right. It's trying to be so earnest with the message that the struggle and difficulty of life gets taken out. Right."}
{"episode_id":"SW - #052 - 2019-08-24 - Faith and Art","start":2746.08,"end":2746.48,"speaker":"Jonathan Pageau","text":"So."}
{"episode_id":"SW - #052 - 2019-08-24 - Faith and Art","start":2749.29,"end":2810.32,"speaker":"Phil Irish","text":"I don't know. Milan Kundera in the Unbearable Lightness of Being, he describes kitsch as being the denial of shit. So that's his word for it. But he kind of runs through the whole. He runs through a whole story that actually deals with Genesis and you know, all kinds of stuff comes in there, but it's this creating a picture that anything negative cannot be in, always has to have. Sure, there can be negative, but it all has to get tied up nicely. So I feel a lot more room for ambiguity. And I think that's also part of the mystery of God. I mean, I can't pin it down. This love that calls to me, the life of Jesus, all of this I love, but it's beyond what I can name, clearly. So part of what I try and do in the work is point that way, but with a kind of humility where I'm not trying to pin it too tight."}
{"episode_id":"SW - #052 - 2019-08-24 - Faith and Art","start":2811.84,"end":2817.12,"speaker":"Patricia Patty","text":"It's the idea of in order to appreciate the light, we have to have shadow. Right?"}
{"episode_id":"SW - #052 - 2019-08-24 - Faith and Art","start":2817.92,"end":2839.7,"speaker":"Phil Irish","text":"Yeah. I mean, it's just what is believable to us as well. Right. Like, I love the fact that in the Gospels you get this whole gospel narrative, but you don't actually see the moment when Jesus rises from the dead. Right. They had. So iconoclasm is another topic."}
{"episode_id":"SW - #052 - 2019-08-24 - Faith and Art","start":2839.7,"end":2839.98,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #052 - 2019-08-24 - Faith and Art","start":2840.3,"end":2857.78,"speaker":"Phil Irish","text":"Where do images fail us? I think that's a moment when any image you could make would fail you. So there are other gospels written, non canonical gospels that are written later that do describe it. And it's like a bad movie, but the way they handle it is brilliant."}
{"episode_id":"SW - #052 - 2019-08-24 - Faith and Art","start":2857.78,"end":2857.94,"speaker":"Patricia Patty","text":"Right."}
{"episode_id":"SW - #052 - 2019-08-24 - Faith and Art","start":2857.94,"end":3032.89,"speaker":"Phil Irish","text":"You get before. You get after. The moment of actual transition is not described. And so there is, at the heart of it, there's mystery. Right. And I think that's a brilliant artistic expression of what not to show and what not to be. I mean, the gospel's clear. It's also weird, Right. But it. I think that's really useful. Another thing I was thinking about, just talking about audience is I mean, you guys are an audience. I don't know if you're gonna. I've got some bikes in the car. I'm gonna go bike around, see Nuit Blanche tonight. But that ambiguity is also an invitation to you as a viewer to interpret the work that you encounter. So that's actually something I look forward to in my audience, is that they will bring their life to bear on the work. And sure, sometimes I might be horrified at something someone interprets, but other times, they're beautiful. I remember this one time I made this image with this life jacket and this note. I did a series of life jackets that had silk screened on them. Safety warnings. Because actually, if you buy a life jacket, they have these weird safety warnings on them. And so this one was a child's life jacket, and it said, notice to parents. This life jacket is not a substitute for parental supervision. So I had this painting of the life jacket with this text, quite small in the bottom. And, yeah. So a woman comes up to me and she says, that's my favorite painting in the show. And let me tell you that when I was a kid, I got out of the house and I crawled across this fresh tar that was put on the road, and I'm covered in burns. And she pulls up her and shows me burns on her. Like, there's no way that I could have thought about that when I made that thing, right? And yet. How beautiful, right? It had a really deep recognition for her that she. I mean, she was passionate about her life and about parenting and about what kids go through, and she's just looking at this pretty simple image that I made. So that's partly why I make it, right, is that you make something and you just hope it will touch people, but also that they will have the creativity to make something out of my starting point, in a sense. So you guys should feel that freedom. You don't have to just go. I mean, it's useful to go, okay, what did the artist intend here? That's useful, except you can't ultimately answer that question. So another way to ask it is, what in the culture does this thing connect to? That's a great way to view work, right? And then to let yourself have the freedom to go as deep as you can within yourself to make something happen when you're looking at that work and to share that with your friends is beautiful. I love viewing art with other people and engaging it. That's maybe a different way to think about audience, but that's okay."}
{"episode_id":"SW - #052 - 2019-08-24 - Faith and Art","start":3032.89,"end":3052.92,"speaker":"Patricia Patty","text":"Well, talking about looking at art with other people I mean, Nuit Blanche on Tonight. And part of what we wanted to do was to have some questions about the theme of art in the city. So let's start there with why is public art important?"}
{"episode_id":"SW - #052 - 2019-08-24 - Faith and Art","start":3054.76,"end":3116.37,"speaker":"Phil Irish","text":"Yeah. So I guess the question is, what does public mean? I would say just because you do something in public doesn't like. I wouldn't say public art is any art that happens in public. Yeah. So when I think about how to define public art, it's tricky in that. Okay. So one definition might be it's the kind of monuments that tell the story of a people. Another actual monument. Yeah. Or metaphorically running out from that. But. Yeah. So another way would be who's paying for it? Right. Because lots of things happen in public space. I'm not sure that makes it. I mean, otherwise everything is public art. And it's not maybe a useful term, but the TV is paid for by all kinds of grants. Right. So you're fighting for these grants. So then that becomes public art. Right. Because it's public purse. Yeah, yeah, yeah, yeah."}
{"episode_id":"SW - #052 - 2019-08-24 - Faith and Art","start":3116.6,"end":3116.76,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #052 - 2019-08-24 - Faith and Art","start":3116.76,"end":3117.64,"speaker":"Gloria Kim","text":"Is it all art?"}
{"episode_id":"SW - #052 - 2019-08-24 - Faith and Art","start":3118.44,"end":3279.28,"speaker":"Jonathan Pageau","text":"You know, it's so funny. I have such a different perspective on that. I don't care if something is art or not. I think that that's irrelevant. Is it interesting? And what's its purpose is what I ask. And so that, to me, that's been. That, for me, that's been the way to kind of deal with that question. To me, the art has no value, actually, in itself. It's. Actually, I have a much more traditional vision of art, which is that art is the skill to put things together. That's what the word means. It just means the capacity to bring things together. So you have the art of cheese making and the art of, you know, the art of painting and the art of architecture, the art of rhetoric. So that's how I view art. And so the art itself has no value. It's what you're doing with it which has value. And that kind of click for me was one of the major clicks, because I feel like I abandoned. I kind of let go of an idol, which is this idea that I should be making art. It's like, actually, no, I shouldn't be making art. Maybe I should be making things with art. But what. And so the answer in terms of public art, I think that in that case, what you were talking about, you can kind of understand how public art can have a function in society. It can have a function which is to bring people together. Hence the monument, which tells a story of a people, a church is Public art in the sense that people actually gather in the church to worship together. And Banksy can in some way be public art in the sense that there's also room for the questioning of those structures, the questioning of those identities. Yeah, yeah. And so. And so the. Right. And so the whole group of people who are. So graffiti actually has a. You can. If you understand the purpose of graffiti, then you can say that there's an art of graffiti which is to poke at, you know, so let's say the church or the monument is there to establish the identity of a place or a group or a people or a story. And then the graffiti artist is the one who comes to poke at it. And you need both, right? You need the king and the holy fool. They both have a function in this kind of the totality of things. And so that's how I see art. So for me, I would think that Jesus is both. Jesus is everything. He's the king and the holy fool."}
{"episode_id":"SW - #052 - 2019-08-24 - Faith and Art","start":3280.88,"end":3299.69,"speaker":"Patricia Patty","text":"We've got time for probably just one or two more quick questions. So I'd like to ask you this. How can public art work for justice, do you think? And maybe you kind of started to hint at this a little bit with your discussion of Banksy and what he's doing with graffiti."}
{"episode_id":"SW - #052 - 2019-08-24 - Faith and Art","start":3299.69,"end":3338.45,"speaker":"Jonathan Pageau","text":"And there's memory. I think that we all understand that one of the aspects of public art is to be an embodiment of memory. And so we see things like Holocaust museums, you see Holocaust monuments or monuments that both. That can celebrate an accomplishment, but we also have monuments that can also help us remember the more scandalous aspects of. Of our past. And so I think that if we can understand it that way as this embodiment of memory, then, of course, I think public art can definitely play a role in reminding us of the question of justice."}
{"episode_id":"SW - #052 - 2019-08-24 - Faith and Art","start":3339.89,"end":3349.48,"speaker":"Patricia Patty","text":"So how can we, as the faith community, do more to support the creation of public. Public heart?"}
{"episode_id":"SW - #052 - 2019-08-24 - Faith and Art","start":3353.32,"end":3353.96,"speaker":"Phil Irish","text":"What's that?"}
{"episode_id":"SW - #052 - 2019-08-24 - Faith and Art","start":3354.52,"end":3368.76,"speaker":"Jonathan Pageau","text":"You don't have an answer to that? I have an answer to that. Have beautiful churches. How about this? How about your church should be more beautiful than your house? At least. At least. If your church is at least more beautiful than your house, then that's a start."}
{"episode_id":"SW - #052 - 2019-08-24 - Faith and Art","start":3372.12,"end":3561.29,"speaker":"Phil Irish","text":"I think. Yeah, there are lots of ways to engage. Engage the city around you. I really like this. Just back to the monuments a little bit. But the shift from. I've been thinking about the Sir John A. MacDonald Monuments being controversial and some being taken down or moved, Right? Like, why should this one monument stand for our national unity across time? Right? So it's a Justice question, right? Does that really represent our ideals at this time? So the public art tonight is really temporary, and that allows a certain kind of risk in what the stories are being told. So you'll go out and you'll find all kinds of different perspectives, including some real justice issues. So if you go to Nathan Phillips Square, part of City hall is draped in burlap bags from Ghana that are talking about global trade and refugees and how does our economy work? And looking at these questions that concern us as Christians looking for a more just world. So it's taking that architecture that talks about authority and organization and rationalization, and it's making it kind of confront something different. So there are lots of opportunities for this kind of making of art. So what are the resources you have? You have people in the church that have gifts, and how do you empower them? How do you maybe help them to have the resources and money to be able to do ambitious things? You also have buildings, right? Like, I mean, this building is almost on the root, right? Like, is there a way that you can project something on the building wherever you are? Just look at what resources you can have that go beyond, you know, to meet people on the street. Right. As opposed to. I mean, I love what you're saying about making churches awesome. So people want to come in and feel the story. But another part of it is how do you take something to where people are already that makes them think differently about the world they're in and also think differently about their stereotypes, maybe about faith. Right. So art can. There's certain messages that people get about what Christianity is all the time. We were talking about this earlier, and it's a straw man. It's a false impression of what we're about. Or at least maybe some corner of faith is like that. But it's a simplified thing, right? So when we make something that bypasses that and people have this kind of. Whoa, this is not setting off my reactionary bells. There's something else intriguing here that's different. But to be able to do that in a public space and a public conversation without them having to come on our terms, I think is really powerful."}
{"episode_id":"SW - #052 - 2019-08-24 - Faith and Art","start":3563.26,"end":3618,"speaker":"Jonathan Pageau","text":"Thank you for listening to the Symbolic World podcast. As you know, this podcast is, for now based mostly on my YouTube videos, which I am transferring into audio format. Please go ahead and visit my YouTube channel. There are more videos there on different subjects that I'm not going to put into audio. And please share this to your friends. I know a lot of people know about the YouTube content, but not so many people know that this is also a podcast, so share it to your friends, share it on social media. And if you can, feel free to support this financially as well by going to my Patreon page, which is Peugeot Videos. Strangely, you can go there and you can support it at any amount that you want. A month for all the patrons. I do a monthly Q and A live Q and A in which people can ask questions in the chat, and I try to have a more personal connection with people. The YouTube comments have become difficult to follow and to answer."}
{"episode_id":"SW - #052 - 2019-08-24 - Faith and Art","start":3618.16,"end":3619.04,"speaker":"Jonathan Pageau","text":"I'll see you soon."}
