{"episode_id":"SW - #210 - 2021-12-28 - Richard Rohlin - The Search for the Holy Grail - Part 2","start":0.72,"end":31.68,"speaker":"Jonathan Pageau","text":"So, hello, everybody. I am with Richard Roland, who at this point doesn't need any introduction. And we're really excited to go into our second part of the Grail symbolism. We did the last video with a really great reaction. And so, Richard, take it away. Let's start us off. This is Jonathan Peugeot. Welcome to the symbolic world."}
{"episode_id":"SW - #210 - 2021-12-28 - Richard Rohlin - The Search for the Holy Grail - Part 2","start":41.5,"end":137.11,"speaker":"Richard Rohlin","text":"So, yeah, a lot of people really liked the last video. We also got a little bit of just a small amount of controversy that was sparked by the last video as well, which is always exciting to see. And I want to reiterate that one of the reasons, actually, I recorded a podcast episode about this with somebody recently, and then when we got to the end, we realized that neither of us had hit the record button. Oh, no. So now there's just a lost conversation out there. And it was when I was over the guy that I was recording with. He's a priest. He was really, really upbeat about it. And really, you know, he's just like, listen, if this conversation isn't good enough for us to enjoy, then there's no point in doing it. So don't feel bad about it now. We have a cool lost episode. But anyway, more about that maybe in the future. But one of the things we were talking about is one of the reasons that I'm so interested in the Arthurian stories, in the Grail, particularly, but in really all the Arthurian stuff. I mean, I've got entire bookshelf over here, just mostly Arthurian stuff, two or three shelves, is because I think that the Arthurian, I don't know, you want to call it a mythos or a cycle, or. Because, you know, it's like a group of legends. There's no canonical, definitive. This is the authoritative Arthur. Um, but it. It kind of contains within itself everything that's good and noble, but also everything that's a problem about being a Western person. Right. And I really want to say that both the good and the better in there. Um, I hope that, you know, as we're doing these Grail videos, I mean, I'm a Western person, you know, I'm not anti Western. I'm just trying to sort of deal with where I am in the world and in history. And I found the Grail legends to be really helpful to do."}
{"episode_id":"SW - #210 - 2021-12-28 - Richard Rohlin - The Search for the Holy Grail - Part 2","start":137.35,"end":139.11,"speaker":"Jonathan Pageau","text":"What was the controversy? I don't even know."}
{"episode_id":"SW - #210 - 2021-12-28 - Richard Rohlin - The Search for the Holy Grail - Part 2","start":139.67,"end":203.74,"speaker":"Richard Rohlin","text":"Some people. Some people were like, oh, well, you're just. You're just, you know, all these, you know, things. The west is terrible, blah, blah, blah. You know, because we got into the end, you know, there's. There's this whole school of thought, which I tend to agree with, that traces the origins of the Grail legend to the Fourth Crusade and the Holy Mandalion and the Shroud of Turin and all this stuff. Right. So obviously that stuff is. It's a little. Still a little historically painful. If it wasn't historically painful, the Pope wouldn't have apologized for it. You know, this last week, I think he's making a tour of like Crete and other places. So it's still very historically painful for a lot of people. And my point in bringing that stuff up is not to like, make a thing out of it. It's just to say, historically, if that stuff didn't happen, we wouldn't get the Grail story. Right. Like, the one thing, all the stuff flows out of this sense of ruptured communion, and of course also these debates about communion itself, which kind of manifest in the west right around the time that the Grail legends kind of become a thing."}
{"episode_id":"SW - #210 - 2021-12-28 - Richard Rohlin - The Search for the Holy Grail - Part 2","start":203.98,"end":205.3,"speaker":"Jonathan Pageau","text":"Okay, I see what."}
{"episode_id":"SW - #210 - 2021-12-28 - Richard Rohlin - The Search for the Holy Grail - Part 2","start":205.3,"end":511.82,"speaker":"Richard Rohlin","text":"Yeah, yeah. So I just, you know, just want to kind of put that out there when I'm talking about this stuff is because I really do deeply love it. Especially, especially the story we're going to talk about today, which is Chretien's Story of the Grail. And it's got a French title, which I'm not going to try to embarrass myself to a native French speaker by saying, but. But anyway, so it's. It's the story of the Grail and it is the first Grail romance. So before this, there are no Holy Grail stories as such. And I would just want to point out that this Grail story is not exactly the version that people remember, because the version that people remember has like these Indiana Jones and Monty Python layers on it. But ultimately it goes back to. For English speaking people, usually it goes back to Sir Thomas Malory's La Morte Darthur, which has basically the final form of the French version of the story, which is like the Lancelot Grail Vulgate cycle. That's what Malory is working from. So that's what most of us actually know. This comes a long time before that. It's the first ever Grail romance. And I think it's also in many ways the most symbolically insightful. But I just want to point out that this story is a really beautiful story. It's weird, it's rich, it's wonderful. So don't just like sit down and read this to like strip mine it for symbolic content or something like that, because there's always a danger for people like us to do that. But this is, I mean, the story, just the beginning of the story, just the first three or four pages. I'm going to be reading today out of this edition. By the way, this is the complete Romances of Chretien de Troyes. It's translated by David Staines, I think is how you say his name. You can find this on Amazon. It's a pretty good translation. One of the things I like about it is the fact that it's a prose translation, which I'm not generally a big fan of doing, although I have done some of these myself. I'm not generally a big fan of doing verse to verse translations from other languages because it's just very difficult to pull off the effect of the normal verse. And so in that case, what I would rather have is like a really good prose translation that would then support my attempts to go back and kind of wrestle with the poetry in the original language. So anyway, this is a good translation. And I just want to say that my interest in the Grail legends and the Grail stories actually begins with sort of an encounter in the liturgy that I had. And it was this beautiful 6am Divine liturgy. There was a Greek church near my house. And one year during the Nativity fast, in fact, we're just a couple of days as we're recording this, the day after the two or three year anniversary of when this happened. Okay, the day after the. It was a 6am liturgy for St. Nicholas. So that was yesterday, you know, for us. And I was, I was in the church and it was this, you know, it's this beautiful sort of basilica style church. It's one of the best churches in the North Texas area. It's totally dark, just lit by candles. And there was like one chanter, just really, really good Byzantine chanter. And it was just him and maybe one or two other people with him. And they were doing the whole service. And it was during the Cherubic hymn. And you see the, you know, they're coming up the center of the church with a gift. And as they're doing this, you know, I see, here's the altar server bearing the taper and the deacon with a patent and the priest with the chalice. And everything is dark and there's light and there's lights and incense and everything. And I just sort of had this flashback to reading this romance and just this realization. It's like, this is. I'm in the Grail chapel right now. Like, what is happening? And some Other things that. Some other pretty incredible things happened later that morning. But for me, that was the moment that kind of tied it all together. There was a moment of intuition during the liturgy, and then that's kind of what all of this came out of. So there was a English occultist named A.E. waite who wrote a. Wrote a book called. I think it's called the High History of the Holy Grail. And it's pretty interesting, actually. I think it's called the Holy Grail History, Legend and Symbolism. But maybe. Maybe he also wrote a book called the High History of the Holy Grail. Anyway, Waite is an occultist. He was, you know, theosophist. I don't really recommend anybody go and read his stuff. I think he's sketchy as heck, but. But he was part of this group of people in England, and most of them were, like, sort of, you could say, disaffected Anglicans. Sort of felt like the. The mystical aspects of Christianity were missing from their church. And this is all tied up with the whole movement of Celtic Romanticism. Right. Which is to say, you know, it's tied up with nationalism, Celtic Romanticism, basically. Celtic Romanticism is the idea that Celtic people as a race. Okay. And I put that in scare quotes as a race are they're, like, more naturally intuitive and spiritual and wild and free and all this stuff. It's like, you know, like Enya's first album, basically, and."}
{"episode_id":"SW - #210 - 2021-12-28 - Richard Rohlin - The Search for the Holy Grail - Part 2","start":515.34,"end":516.7,"speaker":"Jonathan Pageau","text":"Oh, that's hilarious, man."}
{"episode_id":"SW - #210 - 2021-12-28 - Richard Rohlin - The Search for the Holy Grail - Part 2","start":516.96,"end":517.68,"speaker":"Richard Rohlin","text":"Um, I actually."}
{"episode_id":"SW - #210 - 2021-12-28 - Richard Rohlin - The Search for the Holy Grail - Part 2","start":517.76,"end":524.08,"speaker":"Jonathan Pageau","text":"It was also, like. It was a nationalist moment in Revenge of the whole, like. Of the. The Anglo Saxon."}
{"episode_id":"SW - #210 - 2021-12-28 - Richard Rohlin - The Search for the Holy Grail - Part 2","start":524.16,"end":536.32,"speaker":"Richard Rohlin","text":"Yeah, it was like. It was like a thousand years too late, but it was like this sort of, like, revenge for the. The Anglo Saxon invasion, where you had all of these Anglo Saxons, you know, suddenly saying, well, we got to get back to our Celtic roots. Right."}
{"episode_id":"SW - #210 - 2021-12-28 - Richard Rohlin - The Search for the Holy Grail - Part 2","start":536.48,"end":536.96,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #210 - 2021-12-28 - Richard Rohlin - The Search for the Holy Grail - Part 2","start":537.28,"end":596.12,"speaker":"Richard Rohlin","text":"And so that's. That's what a lot of this was tied up with. And so one of the things that people started trying to search for, and there's still people who are hung up on this today, is this idea of, like, reconstructing or finding, like, this lost Celtic liturgy. Yeah. This idea that there would be a Celtic expression of Christianity that would be authentic to the British Isles in a way, that Latin Rite, Roman Catholicism, and then also Anglicanism as something that developed out of that. Yeah. That would be authentic in a way that those weren't. Yeah. And so these guys looked back to the Grail story, and they looked at it and they said, oh, look, it's so liturgical. There's chalices and, you know, it's the body and blood of all this stuff. It's. It's so liturgical. This legend must actually be about the true Celtic, lost Celtic liturgy. And all of these stupid continental romancers turned it into this adventure story, and they got it totally wrong. So a lot of the guys hated the romances because. And what I would like to say is these guys are."}
{"episode_id":"SW - #210 - 2021-12-28 - Richard Rohlin - The Search for the Holy Grail - Part 2","start":596.36,"end":623.91,"speaker":"Jonathan Pageau","text":"But that's interesting that. It's interesting that they would see the Grail legend as a nostalgia for the lost Celtic Christianity in general. Like that when the Anglo Saxons brought in the Latin Mass and kind of imposed Rome on, let's say, on the British Isles, then that would have been like they would have lost something, and that would be a memory of that in King Arthur, because King Arthur is from before that time, like, obviously."}
{"episode_id":"SW - #210 - 2021-12-28 - Richard Rohlin - The Search for the Holy Grail - Part 2","start":624.23,"end":744.7,"speaker":"Richard Rohlin","text":"And, yeah, that whole thing is a complicated question. And I'm actually working on putting a new podcast together for Ancient Faith, which will hopefully be all about the history of the English conversion, but I haven't had another podcast. Are you serious? I haven't had time to work on it this fall, but I'm hoping that maybe January, February, that'll drop. So keep an eye out for that. And if you. If you like. Because that whole question of conversion, the conversion of the Anglo Saxon peoples, is really interesting to me, but basically, I think these guys are. They have the right intuition, but they totally misread the romances because in some senses, they're blinded a little bit by this sort of, you know, this Celtic romanticism. Right. So what I want to basically try to demonstrate by doing a close reading of Kritian's Romance is two things. One is that the structure of the story itself, or at least those parts, the story really has two parts that are. They're connected by a medieval technique called interlace, which is basically where you have threads of two stories that move in and out of each other at multiple points. This is very common in Arthurian stories, which is why if you've ever sat down and you've just tried to read in Arthur, and you're like, oh, it's Christmas, and we're at the court, and then a little white dog runs in, and he's followed by, like, three stags and a princess who's weeping. And then some guy goes to deal with that problem, and on the way, he gets challenged, and then we learn about this night that. And it's like. It's like, why can't we just stick with one plot thread? Right? But it's because these. These plot threads are interlaced, so they kind of weave in and out of each other. And you just have to sort of like, set aside your modern thread, three act narrative expectations and kind of just hang on. So this story has basically two threads like that. One is about Percival and the other is about Gawain. But at least the Percival part of the story is fundamentally structured according to the pattern of the Divine liturgy. And I think this is absolutely indisputable. The second thing that I want to try to prove is that everyone has been reading this story in completely the wrong way."}
{"episode_id":"SW - #210 - 2021-12-28 - Richard Rohlin - The Search for the Holy Grail - Part 2","start":745.27,"end":746.95,"speaker":"Jonathan Pageau","text":"Or at least everyone has been."}
{"episode_id":"SW - #210 - 2021-12-28 - Richard Rohlin - The Search for the Holy Grail - Part 2","start":746.95,"end":815.33,"speaker":"Richard Rohlin","text":"Everyone. Everyone. I'm the first one to get it right. Jonathan, you guys heard it here. Now, let me, Let me. I'll nuance that a little bit. I like to say that provocatively because it gets people's attention. But everyone believes that the story is unfinished and that Percival never finds the Grail. And everyone in the Middle Ages believe that, which is why I have a book right here. I have a book right here that has all of the medieval continuations of the person. So everybody was unsatisfied with the way that the story doesn't end and they tried to write their own continuations of it. Right. But what I want to argue is that if you read the text closely, you will see that Percival actually does succeed. He actually does achieve the Grail. So let's talk a little bit about the story. So Percival, we don't actually learn his name until about halfway through the poem. In fact, he doesn't learn his name until about halfway through the poem. Percival begins totally without identity. He only knows himself in relation to his mother. And so when he's first asked, what's your name? Somebody asked him, what's your name? He says, well, my name is Dear son, because that's what his mother calls him. Or in relation to, to the. To his servants who call him dear Master. He says, like, it's like, well, what's your other name? Well, my other name is Dear master."}
{"episode_id":"SW - #210 - 2021-12-28 - Richard Rohlin - The Search for the Holy Grail - Part 2","start":815.33,"end":815.61,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #210 - 2021-12-28 - Richard Rohlin - The Search for the Holy Grail - Part 2","start":816.41,"end":912.73,"speaker":"Richard Rohlin","text":"He doesn't know himself, though, in relation to his father. So this is a very important detail in Percival's story. His father is a knight who died in battle due to a grave injury to the loins. Okay. And the reason that his mother will not tell him who he is, won't tell him his name or who his father was is because she doesn't want him to become a knight. She doesn't want him to grow up and die the same way that that his father did. So, so the other hint that we get about Percival's identity is his clothing. So clothing, the putting on and taking off of garments. And often we're told that they're garments of coarse hair or garments of skins in this story, like, very literally, explicitly. That's very important to pay attention to as you read this romance, not just with Percival, I'm going to give some examples of that, but also with the other, like the side characters as well. We're told when he's. His clothing is first described, we are told that he dresses like a Welshman, which is not a compliment as far as Kratian is concerned. Ideas. He's sort of like, dressed in, like, buskins, like, you know. You know, he looks. Looks like a rustic, right? Yeah, he's rustic and by his activities. So his. His hobby, the thing that he likes to do is he has this javelin and it talks and spends a whole lot of time about talking about him. Like he's walking along, he's throwing the javelin north, south, east and west towards every point of the compass. And the idea, I think here is that his identity is scattered and it's focused. Right now, I said, and I gave reasons for this in our previous video, but I said that essentially this poem follows the structure of the Divine Liturgy. And you could say."}
{"episode_id":"SW - #210 - 2021-12-28 - Richard Rohlin - The Search for the Holy Grail - Part 2","start":912.73,"end":922.53,"speaker":"Jonathan Pageau","text":"Wouldn't that also make sense if you're saying that his identity is scattered or that that's. Would also. The idea of his father dying from an injury in the loins would definitely go with that."}
{"episode_id":"SW - #210 - 2021-12-28 - Richard Rohlin - The Search for the Holy Grail - Part 2","start":922.61,"end":1272.36,"speaker":"Richard Rohlin","text":"Yes. Right. Yeah. Those two things are really, really closely connected. So. And I think that the. You could say the liturgical structure of this poem, you could chalk it up to two things. One is there does seem to be lots and lots and lots of evidence that the Grail legends developed at least partially out of Byzantine liturgical commentaries like that of Saint German. I mean, there's an explicit connection there. But also I believe, and I think that you believe that the liturgy is the shape of everything. Right. So whether or not you can demonstrate that Krytian ever spoke to somebody who'd seen a Byzantine divine liturgy, although he almost certainly had, because all his patrons were these crusader families. But whether or not he'd actually seen like, an Eastern rite, divine liturgy or read that kind of a commentary, I think because the structure of the story, so fundamentally symbolic and cosmic that it's. It's unavoidable. So if we wanted to sort of look at this through the lens of liturgy, we can see this different liturgical commentators talk about the way that we are before we come together for these Synoxus, before We come together for the gathering, right? Which is not just a gathering of us as a people, as a. Like a congregation, but it's also a gathering of our scattered identity. We've been out in the world. We've been pulled this way by this thing and that way by that thing. And we're just all. We're all scattered and dissolute and all of these things being pulled together when we decide we're going to enter into the church. And so what we see is that at each part of the story, Percival has these changes that come up, come with a movement up the. You could say, like a movement up the ontological hierarchy, right? So everything's a mountain, right? Or a tree, right? So as he moves up to each level, he has to change clothing. He has to be given a set of instructions for how to behave himself on the next level. And then what we see happening in the story is him doing or not doing that well, depending on the case. So in this case, he begins with a totally scattered loss of identity. And then he's off in the forest. He's playing with his javelin. He's doing all this stuff. And suddenly he hears some knights riding through the bushes, like in the forest, right? And he's in the forest sauvage, so that the savage forest, the wasteland. The wild forest. The wild forest. And as he hears the knights coming, he actually thinks that they're demons because of the sound they're making. It's a big scary sound. He's never heard anything like this. And this is actually where we find out how much Kritian or how much Percival knows about God. Which is really important because he doesn't know much. He's been taught the creed. He's been taught the Our Father. And he's been taught that he's supposed to make the sign of the cross when he hears something coming or when something scares him, to frighten the demons away. But he says, I'm not going to make the sign of the cross. Instead, I'm going to wait here. And when the demons appear, I'm going to strike them with my javelin and kill them. So that's his. His attitude. And when he sees the knights come through, he sees them and he immediately changes his mind. He says, I have sinned grievously to call them devils. Because my mother told me no idle tell when she said to me that angels were the most beautiful creatures there are. Except God, who is the most beautiful of all. Here I behold the Lord God. I believe, for one of Them is so beautiful that the others, so help me God, have not attempted this beauty. So he thinks he sees the most beautiful night. And the other nights with me thinks I must be seeing God and his angels. So he's very confused. He doesn't know what he's dealing with. And basically the knights set him straight and they explain, well, we're not gods, we're not angels, we're knights. And Percival is like, what is a knight? I've never heard of this before. So they had start having this conversation. And this is when things get really interesting because he walks up to the knight on the horse and he looks at the knight's lance and he says, what is that you're holding and what's it for? Now, it starts with a lance. This is really important because that is the first thing in the grail procession that we're going to talk about in a minute. Yeah, yeah. And so the knight explains to him what the lance is and what it's for. And then he said, looks at the shield, which is shaped like a dish, and he says, what is that and what is it for? And he starts going through all of their stuff until he gets to their armor, their hauberks. And when he gets to their hauberks, the question he asks is not what is that and what is it for? But he says, how does that serve? Right? That's his question about the knight's gear is how does it serve? And this is. So this is the question that he's asking when he's faced with, you could say, the next thing on the ladder of ontological hierarchy. So he goes back to his mother and he questions her. He learns that the first time about his father, who is this crippled knight who was pierced through the thighs, who could not defend his lands or his fortune. So when King Arthur Pendragon died, they lost everything. He had to be carried on a litter because he couldn't ride his horse, all this stuff. She sees that she cannot dissuade him from his intent to leave home now and become a knight. And so Percival's mother gives him a series of instructions, and she laments the fact that he'll probably be killed because he doesn't know how to fight. But she gives him a series of instructions. And the instructions that he gets at each level of the ontological hierarchy are very important. The first instruction he's given is to give aid to any lady he meets. Okay? This is important part of chivalry. And this comes with a proviso that he's allowed to accept any token that he's given from a lady up to a kiss. But if a lady tries to give you anything more than a kiss, Percival, you gotta say, yeah, it's very delicately put in the poem. Second thing he's supposed to do is to ask the name of any man who shows him hospitality. Because she says, and I quote, this is from the poem, it is by the name that we know the man. Now, Percival still hasn't been told his name. We don't even know his name. He's just called the young man at this point in the poem."}
{"episode_id":"SW - #210 - 2021-12-28 - Richard Rohlin - The Search for the Holy Grail - Part 2","start":1272.36,"end":1272.84,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #210 - 2021-12-28 - Richard Rohlin - The Search for the Holy Grail - Part 2","start":1273.08,"end":1319.16,"speaker":"Richard Rohlin","text":"So we don't know him and he doesn't know himself. The third thing he's told is that he's to stop and pray at a church or at any church or chapel that he comes across. And Percival doesn't know what a church or chapel is because he's never seen one before. And so he's told that this is a place, quote, filled with relics, treasures holy, wherein they offer up the body of Jesus Christ. So already there's this foreshadowing of what the Grail is. All right. So keeping all of these things in mind, Percival doesn't yet have an identity. He doesn't have a name. He doesn't know how to act in the new world that he's entered into. And this introduces a theme that we see repeat itself over and over again in the poem, which is that as Percival climbs the ontological hierarchy, he always lacks the information. We could say he lacks the manners that he needs to move in that particular rung of the ladder."}
{"episode_id":"SW - #210 - 2021-12-28 - Richard Rohlin - The Search for the Holy Grail - Part 2","start":1319.48,"end":1353.49,"speaker":"Jonathan Pageau","text":"I just want to mention something that the structure that you're presenting, it's very powerful because even the idea that he's in the wild is part of it. Like, he's definitely all. Everything there is there to show that he doesn't have an identity. And so we. There are several stories where angels, like even in the Gospel, when the apostles come to encounter the pagans, and then they're like, oh, they. They bow down before them. It's because you can understand that wherever level you are, if you receive something from above, it can appear to you at first as being the highest thing."}
{"episode_id":"SW - #210 - 2021-12-28 - Richard Rohlin - The Search for the Holy Grail - Part 2","start":1353.57,"end":1353.93,"speaker":"Richard Rohlin","text":"Right?"}
{"episode_id":"SW - #210 - 2021-12-28 - Richard Rohlin - The Search for the Holy Grail - Part 2","start":1353.93,"end":1382.78,"speaker":"Jonathan Pageau","text":"That's the problem of idolatry itself, is that something comes from above. And so you're like, okay, this. That's the thing that appears to me it's the highest thing. And so, luckily for him, the knights were those that would render glory up, right? And say, no, it doesn't stop us. Like, maybe we. Like, in a way, they were Vehicles for him to go up the ladder. But they're able to place themselves properly, in a way, as true angels and say, no, it's like we're just messengers for something higher that you need to access later, let's say."}
{"episode_id":"SW - #210 - 2021-12-28 - Richard Rohlin - The Search for the Holy Grail - Part 2","start":1382.93,"end":1445.1,"speaker":"Richard Rohlin","text":"And that can help you understand why the flattened cosmology that most of us are working with most of the time today. Why, A. It's very difficult for somebody in that mindset to understand traditional Christian veneration. Right. Because you, you, you. You see something like an icon of the mother of God and you see us kissing it or, or hear the things that we're saying about her, and you're like, oh, you must think she's the highest thing. But we don't think she's the highest thing. There's something infinitely above her. Right. But, but. Because when you have this flattened cosmology, you're always liable to look at any bright thing that presents itself to your attention, as this is the highest thing now, which is why it's also, simultaneously, it makes you, you know, maybe a little paranoid about idolatry in that form. Yeah. Okay. It also makes you very liable to idolatry when, like a, A really great athlete or a pastor you really love, who's a really good preacher or something like that, when that person presents themselves. Right. Because. Because there's just, there's not room in your field of attention for a normal escalating levels, a normal hierarchy."}
{"episode_id":"SW - #210 - 2021-12-28 - Richard Rohlin - The Search for the Holy Grail - Part 2","start":1445.1,"end":1445.5,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #210 - 2021-12-28 - Richard Rohlin - The Search for the Holy Grail - Part 2","start":1445.82,"end":1808.8,"speaker":"Richard Rohlin","text":"So he has to rely on the advice that he gets from the guardian of each threshold, which is advice which he only ever sort of imperfectly puts into place. And you could say this sort of, for us, corresponds to the entrance into the church, both our entrance, you know, for the first time when catechesis begins, we take our first step up the mountain. Right. And so we're told that Percival is clothed by his mother in these garments of skin. They're specifically said to be garments of skin. He's dressed like a Welshman and he. And he crosses a river to leave his home. Nice. By the way, every time that he comes to a new, you could say like a new tier, a new rung in the ontological hierarchy. He crosses a river. So that's a just a very easy sort of symbolic key that you can look for in the story. Again, it's a very beautifully structured story. And so garments are very important in the story. And they signal the way that old and new things, identities are adopted or cast off their coverings. They're things that are used to both protect from danger, but also to confer identity. So in mystical terms, we could say we're in the narthex now. So Percival's first few encounters in the world of chivalry do not go smoothly. I'm not going to like, summarize the entire poem because it's pretty long. But essentially he meets a maiden, and instead of simply receiving her ring as a free gift, he misunderstands his mother's instructions. And he takes the ring, also a kiss, which actually causes a rift between her and her very jealous lover, who. Who believes that she has now been unfaithful to him. And it's a whole thing. She comes up later, she actually turns out to be Percival's cousin, which is super awkward. Percival also meets a particularly troublesome knight known as the Red Knight. The Red Knight has stolen. Guess what he's stolen. I don't remember what he's stolen a cup from Arthur's court, Guinevere's favorite cup. And as a result, the key, the court of Arthur has been thrown into silence. Okay, Everyone is sad. There's no more laughter. But it's silence. And again, silence and laughter and speaking too much or being silent too much. Those are like two of the main contrast in this poem. Okay, so he's stolen Arthur's cup. You know, watch for some of these themes as they come up. Again, there's a heavy silence laying on everyone, except for Sir Kay, who is the king's seneschal, his sort of foster brother, and who in this particular poem is a pretty awful person. And so he. He laughs and disparages Percival because of Percival's bad manners, which include riding his horse right into the king's hall. Cause he doesn't know any better. And this sets up a rivalry between Percival and Kay, which is one of the subplots of the story. So when the Red Knight stole the king's cup, he actually spilled or splashed the wine all over Queen Guinevere. So her honor has been insulted. And none of Arthur's knights are courageous enough to go out and challenge the Red Knight. And so Percival goes out and he sort of accidentally kills the Red Knight with his javelin. But he's unable to remove his armor because he doesn't understand how any of it works. So again, he has to ask somebody, how does this work? What is this for? How do I put this on? So somebody else comes along and helps him remove the armor and put it on himself. And this is the beginning of his chivalric career. So the beginning of Percival's career as a knight actually Begins with a rupture of communion around a stolen cup, right? And to get the cup back, he has to go out and become a knight. And so all of this is not without some regret he is actually sad about. He doesn't want to get rid of the garments of skin that his mother gave him, who actually puts his armor on over them rather than discarding them. This is another move up the ontological ladder. And this is accompanied by once again, the crossing of a river and the meeting of a new mentor. So you could say at this point he's gone as far as his mother's knowledge can, can take him, right? He's followed her instructions very imperfectly, but he somehow kind of stumbled himself a little higher up the mountain. It crosses this next river. And in this case it's the. The new mentor is a guy by the name of Sir Gornomand, who is also sometimes in the poem, he's just called the worthy man. The worthy man teaches Percival the ways of chivalry. He teaches him how to ride, how to fight, how to use his weapons. Once again, with every weapon, the question of how does this serve? Or who does this serve? Comes up. For each of the weapons, he also gives him a new set of instructions by which he is to live. And once again he's given new clothes. And he finally gives up the garments of skin that his mother gave him, which he'd still been wearing under the armor. And he's clothed in new. In new garments. So he's also given a set of instructions. Some of these are overlaps of the instructions his mother gave him before, but there's some new ones. So he's told now he has to always show mercy to opponents who surrender. He's told how to behave to maidens, which is just a repeat of the instructions his mother gave him. He's told to go to church and pray, also a repeat. But the fourth thing that he's told, and this is really critical for the story, is that he's supposed to be taciturn because this whole time he's just been asking, what's this? What's this? What's this? It's like my four year old son who just. We're out driving around doing errands yesterday and he wants to know why is that car different from this car? What are the speed bumps in the road for? He just has all these questions about all these different things, right? Which is really fun for me because I get to be all knowing for just a brief moment. But he's told if you keep asking all these questions, people will think you're a peasant, people will think you're a child. You need to keep your mouth closed and just ask a servant later. Don't keep asking all these questions, you're embarrassing yourself, etc. So at this point, we see Percival beginning to mature. He makes fewer silly mistakes and seems to know how to behave himself. He's been initiated into the chivalric world. He's not just a pretender or an aspirant to it. He has, in other words, undergone a baptism of sorts, passing out of the narthex into the nave as he's clothed in new garments and now ready and willing to face the challenges of this new level of reality in kind of a adult, mature way."}
{"episode_id":"SW - #210 - 2021-12-28 - Richard Rohlin - The Search for the Holy Grail - Part 2","start":1809.12,"end":1849.62,"speaker":"Jonathan Pageau","text":"And it's interesting that he loses the. The. Or he's asked to stop asking questions because you could understand it. Like his position in the wild. His position at the. At the bottom is basically a question like, who am I? What is this? You know, what's the. What are. What are all these things? He's. He's almost like inhabiting a kind of feminine space where he's asking questions. And so he gets initiated up. And then at some point they're saying, okay, so now you have to stop being that lower part. You kind of have to engage at a higher level. But I can already see how that it's interesting that he would. The fact that he would not be able to recover that at the end is what would do him in or something."}
{"episode_id":"SW - #210 - 2021-12-28 - Richard Rohlin - The Search for the Holy Grail - Part 2","start":1849.62,"end":1899.01,"speaker":"Richard Rohlin","text":"You're getting. You're getting ahead. But yes, you're exactly right. That's. That's exactly the right intuition. Right? So Percival has some adventures. Most importantly, he meets Blanche Fleur, who is Sir Gornomont's daughter, the worthy man's daughter. He saves her, he falls in love with her. And in the middle of all this, he's saving the town that she's in from siege. And in the middle of all of this, there's one of. What to me is actually one of the most interesting and kind of evocative episodes in the poem. And I just want to put this out there to artists. I've actually written a poem about this particular scene because. And its importance to the rest of the story because I just find it incredibly evocative. If you are an artist, a painter, maybe an icon carver, and you'd like to help me with an illustration of this, maybe let's talk about that because I've never seen an illustration of the scene, but it's so. Well, let Me unpack."}
{"episode_id":"SW - #210 - 2021-12-28 - Richard Rohlin - The Search for the Holy Grail - Part 2","start":1899.01,"end":1900.81,"speaker":"Jonathan Pageau","text":"You've been inspiring me to make a lot of videos."}
{"episode_id":"SW - #210 - 2021-12-28 - Richard Rohlin - The Search for the Holy Grail - Part 2","start":1900.81,"end":1993.23,"speaker":"Richard Rohlin","text":"I know, I know, I know. Well, you gotta do this one, so maybe another one. You gotta do this one. So what happens is that he comes to this city which is under siege, and he delivers it. But while he's there, he sees a minster, right? Like a monastery church. And he says, oh, I've been. This is the first time he's come across a church. But he says, I've been told I should always go into one and pray. Right. And so he goes in because the town is under siege. There are no monks. There are no monks in the sanctuary. And he goes in and nothing is in good repair. We're told that the walls are cracked and bare, that the towers are roofless, that the buildings are naked to the elements day and night. So you have this image of Percival walking into. He's never been to a church before. He's told he's supposed to come here and worship God, and he walks in and there's no one there to meet him. And the church is desolate, the walls are cracked, everything is crumbling around him. And so he's just sort of sad and confused and he leaves. And this is going to be important later on in the story, but to me, it's just one of the most. I mean, if you wanted to sort of explain. I know there's a famous classicist who once said something like, modern people are barbarians living in the ruins of an advanced civilization. And to a certain extent, that image of showing up to a church and saying, I'm supposed to be here to worship God and to do a certain thing, and here I am. I mean, you and Bishop Baron were getting into this in a lot of your recent conversation about trying to recover cosmic Christianity."}
{"episode_id":"SW - #210 - 2021-12-28 - Richard Rohlin - The Search for the Holy Grail - Part 2","start":1993.63,"end":1999.16,"speaker":"Jonathan Pageau","text":"But you're saying that this experience of going into the church, finding it in, disrespecting many people."}
{"episode_id":"SW - #210 - 2021-12-28 - Richard Rohlin - The Search for the Holy Grail - Part 2","start":2000.36,"end":2042.45,"speaker":"Richard Rohlin","text":"Yeah. And there's no one there to show you the way. There's no one there because all those people are honestly. It's not their fault. Right. In the case of this, you know, all the monks and the nuns is actually two churches he goes into because there's a monastery and a nunnery in the same city. So it goes into the minister for each of them and finds them both in the state. Right. And so all the monks and the nuns, they're. They're gone because they are. We're told that they are frightened and wary. So these people are basically just trying to survive. The city's under siege, and so They've totally left the maintenance of the house of God to kind of look after themselves and try to hold whatever semblance of life they can together. Right. And I don't know, I just makes."}
{"episode_id":"SW - #210 - 2021-12-28 - Richard Rohlin - The Search for the Holy Grail - Part 2","start":2042.45,"end":2058.77,"speaker":"Jonathan Pageau","text":"You think of a certain moment in our, like, say, this moment right now. And I think, I mean, it's funny because you're right. Even sometimes, you know, you. Even people who go in, who. Who are interested in orthodoxy, you know, sometimes that's. That's even their experience, right?"}
{"episode_id":"SW - #210 - 2021-12-28 - Richard Rohlin - The Search for the Holy Grail - Part 2","start":2058.77,"end":2059.17,"speaker":"Richard Rohlin","text":"Yeah."}
{"episode_id":"SW - #210 - 2021-12-28 - Richard Rohlin - The Search for the Holy Grail - Part 2","start":2059.49,"end":2063.69,"speaker":"Jonathan Pageau","text":"They feel like, okay, this is not what I was told it was going."}
{"episode_id":"SW - #210 - 2021-12-28 - Richard Rohlin - The Search for the Holy Grail - Part 2","start":2063.69,"end":2142.82,"speaker":"Richard Rohlin","text":"To be, like, 100%. Well, and I want to say, like, for those of us who have had this experience at some point in our lives, right, of like, entering the house of God and finding it kind of vacant and empty and crumbling and being like, what's the big deal? Why is this really important? Right. It's not totally the fault of the people who are there. Like, maybe, maybe you could say, well, I wish every one of these people had the martyrs, courage to kind of push on through. But even the stuff that you and Bishop Barron were talking about, the kind of the denuding of a lot of the beauty of the Catholic tradition, right? A lot of those people who were pushing that stuff, I mean, there definitely was probably some malice on the part of some people, but I think a lot of people who went along with it, like the rank and file, just the normal prisoners, the people on the ground, they really thought this is going. Going to save them. Yeah, right. They really thought this is going to help them. Right. And so they were. They were already in kind of a, like, modernity, was. Was already so ugly and so strong and so imposing, and it's really easy to feel like we're just under siege all the time. And when you're in that mode, when you're thinking in that way, you can let the really beautiful things go. Anyway, so I just. I just find this particular moment, which I've never heard anybody really talk about or illustrate, but I find this particular moment in the story really, really vivid. So. All right, so to push on a."}
{"episode_id":"SW - #210 - 2021-12-28 - Richard Rohlin - The Search for the Holy Grail - Part 2","start":2142.82,"end":2145.94,"speaker":"Jonathan Pageau","text":"Little bit, this is also the first time that he goes into a church."}
{"episode_id":"SW - #210 - 2021-12-28 - Richard Rohlin - The Search for the Holy Grail - Part 2","start":2146.02,"end":2147.62,"speaker":"Richard Rohlin","text":"Yeah, first time he goes into a church."}
{"episode_id":"SW - #210 - 2021-12-28 - Richard Rohlin - The Search for the Holy Grail - Part 2","start":2147.86,"end":2156.66,"speaker":"Jonathan Pageau","text":"I mean, it makes sense too, that as he's coming from below, he would kind of encounter the brokenness and the fragmented part of what he's moving into, Right?"}
{"episode_id":"SW - #210 - 2021-12-28 - Richard Rohlin - The Search for the Holy Grail - Part 2","start":2156.74,"end":2195.76,"speaker":"Richard Rohlin","text":"Yeah. You could imagine somebody who, like, as you're coming up from below and you get into the Orthodox church and you're like, oh, I'm here now. Or the Roman Catholic Church or something. You're like, oh, I'm here now. And things are so beautiful. And then you realize that actually there's also brokenness and scandal, and there are bad bishops, and there are, you know, acrimonious parish council meetings. Right? All, you know, and just like, lots of people on the Internet who all have an opinion about how you should be, you know, living your life, even though they're not your spiritual father. Like, you know, you have all these different things, and the danger is to do what Percival did, which is he gets there and he's like. And he walks out."}
{"episode_id":"SW - #210 - 2021-12-28 - Richard Rohlin - The Search for the Holy Grail - Part 2","start":2195.84,"end":2196.8,"speaker":"Jonathan Pageau","text":"Yeah, what is this?"}
{"episode_id":"SW - #210 - 2021-12-28 - Richard Rohlin - The Search for the Holy Grail - Part 2","start":2196.96,"end":2662.81,"speaker":"Richard Rohlin","text":"Yeah, like, what is this? What's happening? Right? So at the end of all of this, before he marries Blanche Fleur, he decides he needs to return to his mother. And we get a little detail here. When he had. When he'd been leaving and crossing over the river, he looked back over the bridge and he saw his mother pass out, but he just kept going anyway. And so suddenly, that recollection kind of stings him a little bit, and he's like, oh, I should go see if mom is okay. You know? And so he. He goes back to. So he leaves the town that he had saved. And by the way, we're told that he leaves in a procession, like unto the Day of Ascension, which. And intends to bring his mother back so that she can take the veil. He wants to bring her back to this town he's in so she can become a nun, and he can be here with his girl, and they can all kind of live together. People watching your channel probably know this, but that's not a bad thing in the Middle Ages, when you're like, I would like my mom to become a nun. He's not saying, I want to put her away so she's not in my way anymore. Like, this is a good thing. Like, it's a. You know, especially if you're like, a noble lady and then you become a nun, you're usually in charge of the monastery. So it's like, in other words, he wants his mom to be looked after and comfortable and to live this life of beauty and rest now that he's delivered the city from. From siege. But we're told that this is like the Feast of Ascension, which I think just brings back to mind that. That icon that the. The fresco of the Virgin of the Pyrenees, right, With a. The Mother at the center, right in this. In this image of Ascension that we talked about last time. And there seems to be echoes of that here. And of course, there are a lot of scholars who think that that's one of the main origins for Chretien when he's writing his romance. You know, just a nice image there. But Percival can't go home again, or at least he can't go home again easily. Not the same way that he. He left. So he comes to a third river. And of course, the thing is that his house is on the. His home is on the other side of the third river. So it's not totally clear. Is the third river a different river or is it the first one again? Right, this is the third river, the third liminal moment in the story. But this time, Percival can't see a way to cross. So he meets a man fishing in the river. There's no bridge, but he meets a man fishing the river, who tells him go up the road where he's going to find lodging and a way across the river. This turns out to be the castle of the Fisher King. And this is where the real adventure of the Grail begins. So the Fisher King sits on a bed in the middle of his castle. He has some kind of a wound in his loins as a result of which he cannot get up from his bed, which is exactly the case for Percival's father. And in fact, we find out at the end of Percival's story that the Fisher King is his mother's brother. So he's Percival's uncle. In the Middle Ages, to be a maternal uncle is as close, or in some cases actually closer than being a father, because if somebody is your sister's son, he can't legally inherit anything that you have. And so he's got no reason to kill you to take your stuff, and he's got no reason to. And so what it means is, like, there's usually a very strong bond of love because it's like a strong bond of loyalty without threat of usurpation, you could say. So that's who the Fisher King is, but Percival doesn't know that yet. And of course, the Fisher King is the same wound as Percival's father. So it's like a deliberate kind of recapitulation. So while he's in the Fisher King's castle, he sees a strange procession. They're sitting at the table, they're eating, and the door opens and in comes first a squire bearing a lance, the tip of which is not merely bloodied, but actually bleeding. Right. Because of course, when you stab Jesus, Jesus wounds the lance, right? And so. So the, the tip of the spear is not merely Bloodied, but it's bleeding. And Percival wants to ask, what's the purpose of the lance? He wants to ask the question that he had asked the knights when he first met them, which is, how does it serve? What's it serving? Who's it serving? And this is what Percival does when he encounters something new beyond the knowledge that he has from his previous identity, something beyond the tier of the ontological ladder which he's used to inhabiting. He wants to ask, what's it for? How does it work? And then, just as he's about to ask, he thinks back to the advice that the worthy man gave him, which is, don't ask too many questions. People will think you're a peasant. People will think you're a child. So he doesn't ask. And the procession continues. And there are two more young men come out bearing tapers and candelabra, a total of 10 candles. And they're followed by a virgin, a young maiden, who bears in her hands a grail, which is a wide, shallow, covered dish, we're told, large enough to serve a pike or a lamprey. In other words, it's a very large dish intended for serving fish, which is an obvious Eucharistic symbol, as anyone in the Middle Ages would have known. Yeah. Percival is unaware of its contents, though, because it's covered. But the most striking thing about the Grail is that it shines brightly with its own light, just like the grail that the Virgin holds in the image in the Pyrenees shines brightly with its own light, so brightly that it far outshines the large candelabra which preceded it. And once again, Percival is just dying to know what all of this about. The Grail is clearly special. It's holy, it's valuable. But there's no clear indication as to why the procession is happening or why it's happening now. So the question he wants to ask is, how does this serve? Who is it serving? Percival wants to know. But again, he thinks back to the worthy man's advice, and he doesn't ask. And once again, as the table before him is being filled with these unimaginable delicacies, the grail passes before him again, the lance, the whole procession. And once again, he wants to ask the question, who's it serve? Once again, he keeps his mouth shut. And by the way, he's also not observed any of the other pieces of advice he was given. He doesn't ask the name of the man who shows him hospitality. If he did, he'd find out it was his uncle. If he'd asked that a great deal of trouble would have been saved. So he decides to wait until the next morning and ask the servants. But when he awakens the next morning, the castle is totally empty and the chance to ask the question has been lost. So the very next person that he meets is the maiden whose ring he stole back at the beginning of the story and whose life he unintentionally ruined. She tells him the story of the Fisher King, that he was a king, a noble wounded by battle, in battle by a lance which pierced him through both of his size thighs, which is the same story he was told about his father. She excitedly questions Percival because she assumes that he is asked the question, who, how serves the Grail? Whom does it serve? And when she finds out that he is not asked, she becomes distraught. She mocks Percival. And it is this moment is when Percival's true name is revealed, which he has not known up to this point. Of course, his mother had once told him, by a name you will know a man. And now for the first time, Percival comes to real self knowledge. But it's a deeply painful self knowledge. So if we want to follow our liturgical reading of the story, we see this third river, which may or may not be the first river, kind of symbolizes the third and the final barrier to Percival's ascent up the mountain. It's the veil drawn over the Holy of Holies. It's the rood screen, the iconostas which seems to bar the way to the mysteries. And given the dependency of grail legends, like I said on, on the, the Divine Liturgy, the rituals of the Christian East, I don't think it's surprising here that the grail procession, as many, many scholars have noted, is basically identical to the great Entrance, which is when the patents and the chalice are brought out accompanied by tapers and incense. And if there are enough clergy serving, one of them will also carry a knife. Yeah. Which we call the spear or the lance, which is used to divide the body of Christ. Yeah."}
{"episode_id":"SW - #210 - 2021-12-28 - Richard Rohlin - The Search for the Holy Grail - Part 2","start":2662.81,"end":2665.13,"speaker":"Jonathan Pageau","text":"Which is something I think a lot of people don't necessarily know that."}
{"episode_id":"SW - #210 - 2021-12-28 - Richard Rohlin - The Search for the Holy Grail - Part 2","start":2665.13,"end":2666.29,"speaker":"Richard Rohlin","text":"Right. Yeah, yeah, yeah."}
{"episode_id":"SW - #210 - 2021-12-28 - Richard Rohlin - The Search for the Holy Grail - Part 2","start":2666.29,"end":2672.85,"speaker":"Jonathan Pageau","text":"Actual utensil that is used to cut the. It's actually used in the liturgy to pierce the bread."}
{"episode_id":"SW - #210 - 2021-12-28 - Richard Rohlin - The Search for the Holy Grail - Part 2","start":2672.85,"end":2673.17,"speaker":"Richard Rohlin","text":"Is."}
{"episode_id":"SW - #210 - 2021-12-28 - Richard Rohlin - The Search for the Holy Grail - Part 2","start":2673.33,"end":2675.13,"speaker":"Jonathan Pageau","text":"Is definitely related to the lance itself."}
{"episode_id":"SW - #210 - 2021-12-28 - Richard Rohlin - The Search for the Holy Grail - Part 2","start":2675.13,"end":2760.66,"speaker":"Richard Rohlin","text":"It's related to the lance. It's the spear. Right. So you have silence and speech and laughter all playing a crucial role in this tale. In a lot of ways I didn't have time to get into as they do in most Arthurian stories. Actually, you Need a. You need a link back to your Merlin story that you told like two years ago. Because I think it's time that people got that back in their consciousness now. Now that we've seen a lot of things happen over the last two years, it would be good to remind people of that story. So here's the thing. There's a time to keep silent before a mystery. But this is not the kind of silence which Percival has been enjoined to practice by the worthy man. His silence might be characterized by the old adage, often repeated to me by my father because I'm a talkative person. Right. That light is faster than sound. That's why everybody looks smart until they open their mouth. So this is the silence of somebody who has been embarrassed before, somebody who's looked foolish, looked childish before, and has spent the rest of their life from that moment on trying to prove that they should be taken seriously. For some, you know, there's lots of examples of this happening in the poem that people. People can go and read for themselves. But the source of Percival's childishness and his naivete is his lack of a father. Right. Somebody who could have taught him the use of arms and most importantly, would have given him his true name, conferring identity upon him. And in the castle of the Fisher King, Percival is really close to healing this wound. All he has to do is to ask the right question."}
{"episode_id":"SW - #210 - 2021-12-28 - Richard Rohlin - The Search for the Holy Grail - Part 2","start":2760.98,"end":2767.82,"speaker":"Jonathan Pageau","text":"Yeah, but the question is basically, what is it? And what's its reason? It's like, it's basically the ontological question."}
{"episode_id":"SW - #210 - 2021-12-28 - Richard Rohlin - The Search for the Holy Grail - Part 2","start":2767.82,"end":2773.32,"speaker":"Richard Rohlin","text":"Yeah, right, right. Which is the fundamental question that Percival asked when he was down here."}
{"episode_id":"SW - #210 - 2021-12-28 - Richard Rohlin - The Search for the Holy Grail - Part 2","start":2774.28,"end":2789,"speaker":"Jonathan Pageau","text":"Yeah, that's what makes you go up the ontological hierarchy in the first place. Like, right, You're. You're amongst a bunch of stuff. And then you ask. You kind of see this stuff coming together and then you ask, oh, what is it? What is it for? And once you do that, then you can jump up a level."}
{"episode_id":"SW - #210 - 2021-12-28 - Richard Rohlin - The Search for the Holy Grail - Part 2","start":2789.08,"end":2789.4,"speaker":"Richard Rohlin","text":"Right."}
{"episode_id":"SW - #210 - 2021-12-28 - Richard Rohlin - The Search for the Holy Grail - Part 2","start":2789.4,"end":2909.02,"speaker":"Jonathan Pageau","text":"That's how you. That's actually, you know, even in the most immediate way, that's how we move from levels, from levels of reality. You know, to use the basic example that everybody mocks you for using all the time. Now it's like this. It's the same question with, like, you have a bunch of parts of something, like parts of a chair. And then you have to ask, like, what is this? When you see them coming together, what is it for? And once you know that it's for sitting on, then you've jumped up a level. Like, you've actually gone Up a level in an ontological hierarchy. Of course, it's not the same as all the way up to the Grail, but he can understand this as an image of how reality works and how things. How things come together and how they kind of move up, you know, into. Into. Into reality. And that in a way, you can see that when you go up, you have to. You kind of have to assume the level that you are, and you have to stop asking the question at first. Only when you reach the next level that you have to start asking questions again. But if you ask questions when you're right, think about it like if you master something, you have to master it and you have to live it. If you. If you keep asking questions, you're not. You're not. You're not mastering it. But once you read when you reach the next level, then you have to be willing or capable of asking questions again. But in this story, it seems like it's like a cycle where he seems to. Like, it's as if he comes back home. But now his home is like a higher version of his home, you could say, but he's just not totally able to. To get there. Like you said, maybe because he lacks a father, he doesn't have that identity confirmed upon him. He's not capable of asking the right question to kind of connect with his. Because it's. It's clear that his uncle, his father, that's. It's related. It's trying to get you to see that there's something pretty much the same thing is going on, right? And the mystery that he saw at the beginning with the different objects that he asked about is the same mystery now he's seen, but at a higher level. And now he can't. He can't pierce it. So why do you say that? It's a success."}
{"episode_id":"SW - #210 - 2021-12-28 - Richard Rohlin - The Search for the Holy Grail - Part 2","start":2909.58,"end":3013.79,"speaker":"Richard Rohlin","text":"So if he'd asked this question, he's told the Fisher King would have been healed. Instead, ruin comes upon his family. His mother has died. The young maiden whose life he's ruined turns out to be his cousin. The land suffers as a result. So in Divine Liturgy, the very last thing that we say before communion begins to the laity, right, Is the holy things are for the holy. Yeah, It's a challenge. It's a warning. It's a statement about who these mysteries are for. They are for those who put on Christ. We say, one is holy, one is Lord Jesus Christ. Right? Who are these for? These are for little children. They're for people who have put on Christ. They're for those who have come to be fed. And not just to be fed, but we don't. In our church, we don't pick up. We don't pick up the elements and feed ourselves. We are fed with a spoon, right? I have. I have four children. I've got another kid on the way in January, right. Like I fed lots and lots of kids with spoons, right? It's messy sometimes, but it's necessary, right. And so to receive communion is self knowledge. It's the ultimate. It's like the only real self knowledge, right? To find yourself in Christ, it heals the wound of our Father Adam. And it bestows upon us a name that no man knows is what St. John says. Excommunication, though, is also a kind of self knowledge, right? It's anyone who has experienced the pain of ever being denied communion or, or either as a catechumen, you know, catechumens depart, right? Chase you out of the church or. Or a penitent knows this really well. So at this first time, and here's the thing people always miss, is that he gets a second chance. Okay? But at this first time, Percival fails to achieve the Grail. He fails to enter into the healing of communion because he can't come to it as that child."}
{"episode_id":"SW - #210 - 2021-12-28 - Richard Rohlin - The Search for the Holy Grail - Part 2","start":3014.03,"end":3018.67,"speaker":"Jonathan Pageau","text":"Yeah, he can't. Yeah. He can't make himself small again at the level where he is so that he can."}
{"episode_id":"SW - #210 - 2021-12-28 - Richard Rohlin - The Search for the Holy Grail - Part 2","start":3018.67,"end":3163.54,"speaker":"Richard Rohlin","text":"Yeah. And so there's a lot that happens at this point in the story. He has some more adventures which sort of culminate in him righting the wrong to his cousin, right? So he sort of solves all of that problem. And the narrative passes on to some of Arthur's knights, in particular. Gawain. I'm not even going to talk about that stuff in the story today. When we meet Percival again. When we meet Percival again, we find him a lost and broken man. He spent the last five years wandering in the waste, looking for the lance and for the Grail. He's looking for healing and communion and he can't find his way. He has forgotten everything. He's forgotten God. He's forgotten the laws of chivalry. He's even forgotten his own name. And when next we meet him. Percival has spent these last five years pursuing one adventure after another. Never stopping at a chapel to pray, we're told. Never paying attention to the favor or the needs of ladies, we're told. In short, pursuing deeds of arms, but never attending to the things that either his mother or the worthy man had instructed him to do. And this culminates one day he's riding along, and he sees three unarmed knights along with some ladies walking through the woods. And they stop him and they say, sir, don't you know it's unlawful to wear arms on this day? And he says, what's today? What's special about today? And they said, this is Good Friday. This is the day on which our Lord Jesus died. You're not supposed to go armed today. He said, well, I don't know who Jesus is, and I don't know what Good Friday is. And so they tell him. They tell him, well, go back through the woods, that direction. We've tied knots on the ends of branches to show you the way. And you'll find a hermitage. And go into that hermitage and ask the hermit, and he will tell you what to do. So Percival follows these instructions. He follows the knots on the branches until he comes to the hermitage. And he meets the hermit. And he starts telling the hermit his whole story and asking, what's this all about? And what the hermit does is he begins by catechizing Percival. He catechizes him by telling him. And we get the whole thing. He explains the entire creed to Percival, which had been taught to Percival, but he'd never been taught what it meant. So he catechizes Percival, and then he tells Percival who he is. He tells him his name. He tells him who his father was. And then he reveals the fact that he is also Percival's uncle."}
{"episode_id":"SW - #210 - 2021-12-28 - Richard Rohlin - The Search for the Holy Grail - Part 2","start":3163.7,"end":3166.82,"speaker":"Jonathan Pageau","text":"But the hermit, the hermit is a fisher king."}
{"episode_id":"SW - #210 - 2021-12-28 - Richard Rohlin - The Search for the Holy Grail - Part 2","start":3167.31,"end":3193.28,"speaker":"Richard Rohlin","text":"I'll be a little apophatic here and say what the poem says, which is the fisher king is Percival's uncle and the hermit is Percival's uncle. Are they the same person? Yeah. So, hold on. I was trying to pull up. I was trying to pull up this passage because it's really, really beautiful. The worthy man. Which, by the way, the hermit is also called the worthy man. So he's like every mentor, right?"}
{"episode_id":"SW - #210 - 2021-12-28 - Richard Rohlin - The Search for the Holy Grail - Part 2","start":3193.28,"end":3194.96,"speaker":"Jonathan Pageau","text":"Yeah. All joined together."}
{"episode_id":"SW - #210 - 2021-12-28 - Richard Rohlin - The Search for the Holy Grail - Part 2","start":3195.04,"end":3288.08,"speaker":"Richard Rohlin","text":"Yeah. Misfortune has fallen you of a sin for which you are ignorant. And he finds out the reason that he failed to ask the question was because he left his mother when she died. And so he talks about all this, and he says, here's what he says. Here's what he says. Okay. Foolish were you not to learn who was served from the bowl. The man who is served from it was my brother. So he's not the fisher king, but he's kind of the fisher king, my sister. And his was your mother. As for that rich fisher king, he is, I believe, the son of the king who is himself served from the bowl. So talking about the bowl, what's in the bowl? He asked, what's in the bowl? And he's told, what is in the bowl is not a salmon or a pike or a lamprey, but rather a single sacred wafer carried to him in the bowl. We know he sustains and nourishes his life. Such a holy object is in the bowl, and so pure in spirit is he himself, that in this life he requires no further nourishment than the host that comes from the bowl. So there's all kinds of stuff going on here. But at the end of it all, he catechizes first of all. And at the end of catechism, he says now that he's told him who he is and he's told him why bad things have happened to him. And he's told him what the grail was and what its purpose was. Gets to the end of the poem, and here's what we're told. He says, stay with me for the next three days and eat what I eat. Well, you have to read between the lines here. It's Good Friday, three days from now is Easter. Eat what the hermit eats. In other words, fast with me."}
{"episode_id":"SW - #210 - 2021-12-28 - Richard Rohlin - The Search for the Holy Grail - Part 2","start":3288.96,"end":3293.8,"speaker":"Jonathan Pageau","text":"So Percival saying, you will get what you will get. Come from the Grail."}
{"episode_id":"SW - #210 - 2021-12-28 - Richard Rohlin - The Search for the Holy Grail - Part 2","start":3293.8,"end":3317.39,"speaker":"Richard Rohlin","text":"Yeah. So Percival is catechized. He fasts. And we're told that on Easter Day, thus Percival came to know that God was crucified and died on. On the Friday. And on Easter, Percival received communion with a pure heart. And then we're told here the tale says no more of Percival."}
{"episode_id":"SW - #210 - 2021-12-28 - Richard Rohlin - The Search for the Holy Grail - Part 2","start":3317.55,"end":3319.03,"speaker":"Jonathan Pageau","text":"Okay, you've totally convinced me."}
{"episode_id":"SW - #210 - 2021-12-28 - Richard Rohlin - The Search for the Holy Grail - Part 2","start":3319.03,"end":3348.57,"speaker":"Richard Rohlin","text":"That person, that's the end of his story, finds the gray, so he finds the grail. But how does he find the grail? He has to come to it broken. He has to come to it, like, just totally emptied of who he is. And to come again as a little child and to sort of say, who am I? Why am I here? What is this thing? Right? And then he's catechized, and then he fasts, and we're actually told he puts on the hair shirt that the hermit is wearing. You know, again, it's a change of garment, a change of identity, where he."}
{"episode_id":"SW - #210 - 2021-12-28 - Richard Rohlin - The Search for the Holy Grail - Part 2","start":3348.57,"end":3356.89,"speaker":"Jonathan Pageau","text":"Puts back the hair shirt from the beginning, but now it's a penitential accent. It's the opposite of the hair shirt received from Adam and Eve in a way."}
{"episode_id":"SW - #210 - 2021-12-28 - Richard Rohlin - The Search for the Holy Grail - Part 2","start":3356.89,"end":3370.49,"speaker":"Richard Rohlin","text":"So isn't that interesting that the garment of skin become, like, at the beginning, it just sort of becomes this identity of death. But then later, when you put It. You can. You can take that death on yourself. And so by remembering your death, it becomes transformed into life."}
{"episode_id":"SW - #210 - 2021-12-28 - Richard Rohlin - The Search for the Holy Grail - Part 2","start":3371.21,"end":3377.88,"speaker":"Jonathan Pageau","text":"That's amazing. I mean, it's amazing also. It's like he discovers that the Grail is not the one, in a way, is not the one cup."}
{"episode_id":"SW - #210 - 2021-12-28 - Richard Rohlin - The Search for the Holy Grail - Part 2","start":3377.96,"end":3378.8,"speaker":"Richard Rohlin","text":"Well, that's the thing."}
{"episode_id":"SW - #210 - 2021-12-28 - Richard Rohlin - The Search for the Holy Grail - Part 2","start":3378.8,"end":3382.16,"speaker":"Jonathan Pageau","text":"It's not the cup that he saw in the. In the castle, basically."}
{"episode_id":"SW - #210 - 2021-12-28 - Richard Rohlin - The Search for the Holy Grail - Part 2","start":3382.16,"end":3470.76,"speaker":"Richard Rohlin","text":"Yeah. In this poem, it's not. In this poem, the Grail is not the idea of the cup of the Last Supper. That comes from Brother de Boran, which is. Which is later. And that's definitely the most successful version. But in this, it's a dish that holds the Eucharistic host. And so when we're told that. And then literally a page later, we're told, on Easter, Percival received communion with a pure heart. And here the tale says no more of Percival. Like, you have to look at that and say, he made it, you guys, right? He discovered his identity. He's discovered who he is. And this. This idea. I mean, one of the things you have to always keep in mind when you're reading medieval literature is that man is a microcosm. So by healing Percival, all these other people and things that he's interacted with, which in the story are basically sort of externalizations of his lack of identity and his attempt to sort of climb the ontological ladder, all that stuff is actually fulfilled and healed. Right? And that's why the mentor is like. The mentor feeds and clothes him. So it's the mentor, the hermit feeds and clothes and becomes his mother. He's referred to as the worthy man, right? So he becomes the worthy man, but he's also the brother of the Fisher King. So it becomes, you know, so he's like every. Every sort of culmination of all the thresholds, right. Are sort of gathered up in him."}
{"episode_id":"SW - #210 - 2021-12-28 - Richard Rohlin - The Search for the Holy Grail - Part 2","start":3470.76,"end":3538.66,"speaker":"Jonathan Pageau","text":"So what's so interesting, like, what really fascinates me about what you're saying is also, if. If what you're saying is, is. Is real, like, if you're framing it properly, it also shows the manner in which the. Like, the esoteric, like the kind of theosophist and the occultists, they were always looking for another mystery. Like, they. They had the sense in which the Christian mystery was not enough, and they were looking for these other mysteries. And a lot of the esoteric stuff that went around the Grail was this idea that there is this other initiation, there's this other mystery that we can access that is hard and that it's hidden, but you can see that in. At least in Percival, at least in this version, it leads up to communion as being the highest mystery, as being that which culminates his whole life into this moment, where. Because it also. There is this sense in which while he's going around, he doesn't know who Christ is, but his mom says. His mother says to go into a church, but he hasn't been properly catechized. He doesn't understand the mystery of Christ. And so it kind of all culminates into this last moment."}
{"episode_id":"SW - #210 - 2021-12-28 - Richard Rohlin - The Search for the Holy Grail - Part 2","start":3538.98,"end":3553.47,"speaker":"Richard Rohlin","text":"And we're told. I mean, lots of beautiful little details here at the end, right. When Percival first comes to. Starts walking down the path. And I would love to know if you have a take on the. The knotted tree branches that line the path."}
{"episode_id":"SW - #210 - 2021-12-28 - Richard Rohlin - The Search for the Holy Grail - Part 2","start":3553.71,"end":3554.19,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #210 - 2021-12-28 - Richard Rohlin - The Search for the Holy Grail - Part 2","start":3554.27,"end":3558.75,"speaker":"Richard Rohlin","text":"It's mentioned multiple times. And I still don't totally understand, like, what's the significance of that?"}
{"episode_id":"SW - #210 - 2021-12-28 - Richard Rohlin - The Search for the Holy Grail - Part 2","start":3559.15,"end":3567.51,"speaker":"Jonathan Pageau","text":"Well, you can understand it. You can understand it the way you understand a prayer row. Right. So you have to understand, like, that's."}
{"episode_id":"SW - #210 - 2021-12-28 - Richard Rohlin - The Search for the Holy Grail - Part 2","start":3567.51,"end":3571.75,"speaker":"Richard Rohlin","text":"So obvious once you say it. I'm like, oh, gosh, it's a. Well, a prayer rope, a rosary. Like, it's."}
{"episode_id":"SW - #210 - 2021-12-28 - Richard Rohlin - The Search for the Holy Grail - Part 2","start":3571.75,"end":3577.15,"speaker":"Jonathan Pageau","text":"Yeah. So prayer ropes and rosaries are like little worlds that connect, that are connected together. Right. So it's like you."}
{"episode_id":"SW - #210 - 2021-12-28 - Richard Rohlin - The Search for the Holy Grail - Part 2","start":3577.15,"end":3579.47,"speaker":"Richard Rohlin","text":"But also like a progression, Right? You."}
{"episode_id":"SW - #210 - 2021-12-28 - Richard Rohlin - The Search for the Holy Grail - Part 2","start":3579.47,"end":3585.19,"speaker":"Jonathan Pageau","text":"You progress up a hierarchy, and then you have higher steps and then you keep moving. Yeah."}
{"episode_id":"SW - #210 - 2021-12-28 - Richard Rohlin - The Search for the Holy Grail - Part 2","start":3585.19,"end":3602.93,"speaker":"Richard Rohlin","text":"And so what. What happens as he moves along? We're told that as he walks past the knots, he felt his very heart sighing because he knew that he'd sinned against God. And he was sorry. And in tears, he made his way towards the forest. And when he reached the hermitage, he dismounted and disarmed. So disarm means he took all of his armor off."}
{"episode_id":"SW - #210 - 2021-12-28 - Richard Rohlin - The Search for the Holy Grail - Part 2","start":3602.93,"end":3603.33,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #210 - 2021-12-28 - Richard Rohlin - The Search for the Holy Grail - Part 2","start":3603.33,"end":3621.69,"speaker":"Richard Rohlin","text":"Right. Ties his horse to a tree, and he enters the hermit's dwelling. And it says in that small chapel, he found the hermit and a priest and a young cleric. This is the truth. Who were beginning the service. The sweetest and most beautiful that may be said in Holy Church. So he shows up at the beginning of Mass, right?"}
{"episode_id":"SW - #210 - 2021-12-28 - Richard Rohlin - The Search for the Holy Grail - Part 2","start":3621.69,"end":3622.13,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #210 - 2021-12-28 - Richard Rohlin - The Search for the Holy Grail - Part 2","start":3622.29,"end":3709.32,"speaker":"Richard Rohlin","text":"Shows up the beginning of Mass, which is what? That's the Grail procession, Right. So he shows up at the chapel and it's happening again. And this time he falls to his knees and the hermit sees him weeping and comes over to him and he. He says, and Percival wants to receive communion. And the. The hermit tells him, you have to make your confession first before you receive communion. Right. And so that's what. That's what initiates the conversation between them, the exchange Percival's reclaiming of identity, it's through his act of confession, which becomes a repetition of his catechesis. And his repentance culminates in, you know, fasting, praying, receiving communion. So it's. I mean, there's all these just really beautiful details in here and there's a bunch of stuff in the story that I haven't even talked about. There's a lot of things I still haven't really understood, though they seem to be symbolically significant. Like there's an intuition that there's something there. But. But also some of it is just. Some of it is just like every detail in this poem is significant. And to try and summarize it and explain my overarching thesis about it is very difficult if you keep getting hung up on all the granular levels. One of the things that comes up over and over again in this poem is the symbolism of the cloak. People have cloaks that they put on that they take off, that they give to other people at certain times. Right. Which is really interesting. So."}
{"episode_id":"SW - #210 - 2021-12-28 - Richard Rohlin - The Search for the Holy Grail - Part 2","start":3710.61,"end":3728.93,"speaker":"Jonathan Pageau","text":"But it certainly has to do with the garmented skin and then the different clothing that he has at different levels. And the armor also, it probably is all related. You have to look at in what condition, in what moment do they remove the cloak and what does it imply."}
{"episode_id":"SW - #210 - 2021-12-28 - Richard Rohlin - The Search for the Holy Grail - Part 2","start":3729.17,"end":3765.73,"speaker":"Richard Rohlin","text":"Yeah, yeah. So there's just a lot of stuff. A lot of stuff in this story. And of course, there's a whole Gawain portion of this. So what's interesting is that Gawain in this poem, and that's the part of the poem that's not finished. Gawain in this poem isn't looking for the grail. He's specifically looking for the lance. So if I had to sort of like, fan fic us up a little bit, and I feel like I'm justified in doing so because everyone in the Middle Ages did. I would not have grail. I would not have Gawain continue searching for the grail. I would have him find the lance. And so you'd have like, sort of the. Percival finds the grail, Gawain finds the lance. And that's how I would end the. That's how I would end the romance."}
{"episode_id":"SW - #210 - 2021-12-28 - Richard Rohlin - The Search for the Holy Grail - Part 2","start":3765.81,"end":3779.27,"speaker":"Jonathan Pageau","text":"That makes sense. Like, you're right, but it makes sense. Especially if the idea that Percival does indeed find the grave Raya. So the Gawain would find something equivalent to the lands. But let's say in terms of maybe something about the crucifixion or something in that."}
{"episode_id":"SW - #210 - 2021-12-28 - Richard Rohlin - The Search for the Holy Grail - Part 2","start":3779.35,"end":3787.67,"speaker":"Richard Rohlin","text":"Yeah. So that might be a fun. That might be A fun project to take up one of these days is to try to do my. Do my own. They're called the continuations. I could do my own."}
{"episode_id":"SW - #210 - 2021-12-28 - Richard Rohlin - The Search for the Holy Grail - Part 2","start":3787.67,"end":3789.35,"speaker":"Jonathan Pageau","text":"The definitive continuation."}
{"episode_id":"SW - #210 - 2021-12-28 - Richard Rohlin - The Search for the Holy Grail - Part 2","start":3789.35,"end":3798.08,"speaker":"Richard Rohlin","text":"Definitive continuation. Right. So, yeah. All that to say whether or not you think Percival found the Grail. He found the Grail. He did. Because he received communion."}
{"episode_id":"SW - #210 - 2021-12-28 - Richard Rohlin - The Search for the Holy Grail - Part 2","start":3798.08,"end":3798.72,"speaker":"Jonathan Pageau","text":"There's no doubt."}
{"episode_id":"SW - #210 - 2021-12-28 - Richard Rohlin - The Search for the Holy Grail - Part 2","start":3798.96,"end":3799.6,"speaker":"Richard Rohlin","text":"Exactly."}
{"episode_id":"SW - #210 - 2021-12-28 - Richard Rohlin - The Search for the Holy Grail - Part 2","start":3800.32,"end":3826.58,"speaker":"Jonathan Pageau","text":"So, all right, so Richard Rowland. Revolutionizing. But not just revolutionizing, but just proving to all the modern scholars that you know what he was doing. And yeah, you know for sure. Percival found the Grail. And so, yeah, so thanks. We will continue on. There's no stopping this conversation. So is there something you wanted to tell us. Tell everybody before we. We let them go."}
{"episode_id":"SW - #210 - 2021-12-28 - Richard Rohlin - The Search for the Holy Grail - Part 2","start":3827.3,"end":3900.33,"speaker":"Richard Rohlin","text":"I don't know when this will drop, but we're currently in the Advent season or the Nativity fast. If you're Orthodox Christian, I would just tell everyone, keep your eyes open and your ears open. Right now there's this tradition, like a. Sort of like a folk superstition that on Christmas Eve, and this is also true, this whole idea of Halloween and other. The night before, like Good Friday as well. Like the night before a really holy day. Right. Is a day when like the. The barriers between worlds are like, really thin and stuff can slip through and bad things could happen, but also good things could happen. And what I would just say is be really attentive during the season and pay attention because things are going to. And I think, especially if you're a Western person, I think Christmas, I mean, I think we all know Christmas is bigger than Easter in the West. It just is. Right. Whether or not that should be the case in a certain way, I think, like, there's a particular Western genius to the way that we celebrate Christmas. Like some of those old Christmas carols. And I've been posting a bunch of them on Facebook. Like, those things are a symbolic gold mine and I don't think you can really beat them."}
{"episode_id":"SW - #210 - 2021-12-28 - Richard Rohlin - The Search for the Holy Grail - Part 2","start":3900.73,"end":3905.05,"speaker":"Jonathan Pageau","text":"Yeah, the Christmas tree is so awesome. You can't. Yeah, not a lot of stuff."}
{"episode_id":"SW - #210 - 2021-12-28 - Richard Rohlin - The Search for the Holy Grail - Part 2","start":3905.92,"end":3917.52,"speaker":"Richard Rohlin","text":"Yeah, no, we have a. There's a particular Western genius for celebrating Christmas. And what I would say is just be. Just be really attentive to the things that are happening, the patterns that are manifesting this season. And of course, at the end of it all, look for Christ."}
{"episode_id":"SW - #210 - 2021-12-28 - Richard Rohlin - The Search for the Holy Grail - Part 2","start":3917.76,"end":3989.67,"speaker":"Jonathan Pageau","text":"All right, thanks, Richard. And so, yeah, I think that's true. We probably will drop it just before Christmas. So I wish all of you merry Christmas as well, and we'll see you in the new year. I hope you enjoyed this episode of the Symbolic World. The Symbolic World is based on a series of videos that you can find on my YouTube channel, Jonathan Pedro's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description and so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course leaving a review on itunes. Everybody knows that's the best to way way to get the podcast out there to get it heard. And if you want to get involved you can also support the podcast financially going to www.thesymbolicworld.com support or else on Patreon the pageau videos as well and on Subscribestar all those links you can find on my website or in the show description. So thank you and I will see you soon."}
