{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":0.48,"end":15.68,"speaker":"Fr Stephen De Young","text":"If you're willing to accept, as pretty much anybody in the field of philosophy of mind does, that there are levels of consciousness below human consciousness, then it's just an assertion without evidence, that there can't be anything above."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":16.08,"end":111.5,"speaker":"Jonathan Pageau","text":"Yeah, no, you're right. It's also because you notice agency on yourself, like psychic. You can notice that there are things acting on you that are constraining you and that are directing your. Your movement and your attention. So it's like, well, why wouldn't that. Why wouldn't I use the same structure I've been using all the way down to now? Explain what's above. Let's say I don't know. This is Jonathan Peugeot. Welcome to the symbolic world. So, hello, everybody. I am very excited and happy to be back with Father Stephen DeYoung. We've been trying to get to talking for a while, but it was always being put back. But I'm excited that it finally happened. And most of you watching this know Father Stephen. He is a priest in the Orthodox Church. He's also the host of the Lord of Spirits, which is a podcast most of you that are watching this will also know about. He's also written several books which I have here, great books, Religion of the Apostles, which I was able to read before and give my. My opinion on. He. He published God as a Man of War, which I'm reading right now, and the whole Council of God, an introduction to your Bible. And so you've been extremely prolific, Father. It's crazy, I know. I think it's because you don't sleep. That's what I. That's the legends we hear."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":111.66,"end":118.62,"speaker":"Fr Stephen De Young","text":"Yeah, well, yeah, I don't sleep much. It is true that part of it is that I don't sleep much, but I do sleep some."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":119.05,"end":127.45,"speaker":"Jonathan Pageau","text":"What did you think about the success of Lord of Spirits? Because it's. It's been a wild ride. I. The. The fans of Lord of Spirits are really into it, and. And it's. It's wonderful to see."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":127.85,"end":204.51,"speaker":"Fr Stephen De Young","text":"Yeah, yeah, it's. I mean, Father Andrew and I were aware that there would be an audience for it. I think at first when we talked to Ancient faith Radio, they were not as sure as we were that there was an audience for it. They thought it was gonna be kind of a little niche thing maybe, but there's a. Much bigger. There's been a much bigger audience for it than I initially thought. And we've had people from all different Christian traditions, non Christians, listening to it. Some people who I never suspected would be endorsing and Promoting a podcast of mine, endorsing and promoting it in various places. So, yeah, it's been pretty amazing. But I think even though it's different than a lot of things on ancient faith radio and different than just a lot of, in general, sort of religious podcasts, I think it's addressing things that people have been at least aware of. It sort of the fringes. Right. Of their ideas. Right. And it's sort of taking those. Those ideas seriously and sort of connecting them in a way that I think is. I think that's what's attracting people. I don't think it's the dulcet tones of my voice or I'm sure it's."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":204.51,"end":264.35,"speaker":"Jonathan Pageau","text":"Some of that and also your cultural references. But I think there's a zeitgeist. There's a moment. I think also there's a strange. Some of it I don't think anybody controls, which feels like the materialism that was ruling just maybe 12 years ago or maybe 15 years ago, the really harsh kind of New Atheist material has been broken. And now people are scrambling to figure out. And it's as if there's a space in their mind now to understand ideas that would have seemed completely ridiculous to them, such as the idea of agency above humans. The notion of these patterns and the fact that these patterns have a kind of agency on phenomena like all of these types of thinking is something that for most people I know because I can see that people are surprised at themselves and they're like, I never thought I would be able to believe this, but it's also because they did understand it. And so I don't know if you've noticed that as well."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":264.59,"end":327.45,"speaker":"Fr Stephen De Young","text":"Yeah, I mean, I have, and it was kind of inevitable because that hard materialist view has a real contradiction at its core that eventually was going to break it because, for example, the New atheists would be all about materialism. But then when they gave an account of history, and particularly the history of religion, they have religion with agency. Right. Religion caused people to do this. Religion caused people to do all these atrocious things. Religion caused. And it's like, well, wait a minute, hold on. Religion is ideas. It's not a thing that exists. Right. And so if there is this agent called religion in history. Right. I mean, you could call that God. Right? Like that it's not just humans. It's causing humans to do things. And so that basic contradiction meant you had to. You had to accept the antithesis of their presupposition in order to accept their presupposition."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":327.53,"end":356.71,"speaker":"Jonathan Pageau","text":"Yeah, yeah. Well, there's so many blind spots in the new atheist thinking, you know, just in terms terms of the way in which they get to their value system or the way they, they pretend like they don't have hierarchies, but then as soon, as soon as they blink, they're back into, into these, these hierarchies, their own hierarchies. It's a, it's actually astounding to watch and it's difficult for people that are still in that mode to point it out because it's a blind spot. They can't see it as you, you, you point to it, but it's as if they, they don't know what you're pointing at."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":356.95,"end":399.74,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. And it's, you really have to push, like that contradiction I pointed out, you have to push on their own terms. A lot of times we've opposed people with those ideas by just loudly applying the other idea. Right. Or arguing for the other idea as opposed to showing, okay, let's take your idea seriously and what you're telling me and follow through on it. And does that actually work? Right? Like where, where does that end up? Is it end up someplace self contradictory and then it's sort of, you know, St. Boniface chopping down the tree. Right. It's like, you may not believe my religion, but yours clearly has just fallen apart. Right. Allow me to offer you an alternative."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":399.74,"end":468.12,"speaker":"Jonathan Pageau","text":"Right, yeah, definitely. There's also, there's also something else. There's something else interesting because as people are studying now the question of consciousness and of agency and all of these issues are becoming, coming to the fore in terms of trying to figure out, you know, how what's the relationship between science and human perception. All of these questions, people end up in a strange position as well where all of a sudden now it's the materialist or the naturalist that is reducing agency and conscious and self consciousness, at least to humans. And so humans become this extremely particular thing in the entire universe that they can perceive this like wonderfully, completely anomalous thing and also happened to be the strange anomalous thing out of which all meaning is see coalescing towards. And so it's almost without knowing it, it's very religious, although it's a humanistic religion. Whereas the way we try to posit it is to say, no, there's a scale and there are consciousnesses and agencies that exist at different levels. That seems, even in a naturalistic point of view, it seems more reasonable that that would be the case."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":468.44,"end":480.98,"speaker":"Fr Stephen De Young","text":"Yeah, they're having to revert to a much earlier version of the philosophy of mind. Right. They're having to go back to, like, Hegel saying that animals are basically just little machines, right?"}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":481.22,"end":481.7,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":481.94,"end":498.79,"speaker":"Fr Stephen De Young","text":"Process inputs. And, like, they don't have any kind of awareness. They don't have any kind of. You know, and philosophy of mind has gotten way past that. I mean, I. I reference Nagel's paper all the time on Lord of Spirits. What is it like to be a bat? Right. But we kind of take. It's like something to be a bat, right?"}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":498.95,"end":499.35,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":499.35,"end":518.47,"speaker":"Fr Stephen De Young","text":"And that means there's some kind of consciousness there. Right. And if you're willing to accept, as pretty much anybody in the field of philosophy of mind does, that there are levels of consciousness below human consciousness, then it's just an assertion without evidence that there can't be anything above."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":518.79,"end":542.3,"speaker":"Jonathan Pageau","text":"Yeah, no, you're right. It's also because you notice agency on yourself. Like, it's like you can notice that there are things acting on you that are constraining you and that are directing your. Your movement and your attention. So it's like, well, why wouldn't that. Why wouldn't I use the same structure I've been using all the way down to now? Explain what's above. Let's say I don't know."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":542.54,"end":580.93,"speaker":"Fr Stephen De Young","text":"Right. And part of it, I think, is a devotion to a particular understanding of freedom and free will. And that's deeply tied into Western theological notions of guilt and choice and accountability. Right. And the whole Western view of sin as being purely transgression. And so if the more you say a person's choices are affected by things greater than them. Right. Forces sort of above them, then that, if you have those presuppositions, means. Well, that makes them less accountable for their actions. And we're not gonna be able to then ascribe guilt."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":581.33,"end":581.73,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":581.73,"end":630.24,"speaker":"Fr Stephen De Young","text":"The person for action. And so those constructs are falling apart, but you don't necessarily need those other constructs, especially in a Christian context. In a Christian context, where we're not about assessing who is a good guy and who is a bad guy, as much as that's ingrained in our culture. And every Marvel movie is the good guy and the bad guy. Right. And the good guy wins. Yeah. Right. But we're about trying to help redeem people from those forces. Right. Christianity has always taught this. There are these forces abroad in the world. They enslave people. People get locked into and controlled by these passions. And we're trying to free them from that, not hold them accountable for their actions. Right. Like in this Guilt and punishment sense."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":630.96,"end":669.2,"speaker":"Jonathan Pageau","text":"I want to. The biggest reason why I had. I had you here was because I wanted to talk a bit about the image of the Son of Man. It's one that been bringing up more and more in my talks. I've been. I've been kind of alluding to it as a possible way to help people, even secular people, understand the relationship, what man means or what. What is it the heavenly man could be. So I know that you've studied that quite a bit in terms of also understanding it's how it leads into, or it's a. It's a kind of hint of trinitarian theology in the Old Testament. So maybe you can. You can kind of take us through the line of these glimpses in the Old Testament and how they ultimately lead to the Incarnation."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":669.28,"end":705.44,"speaker":"Fr Stephen De Young","text":"Yeah. So probably I'll have to couch this a little. And people will be familiar with this who listen to Lord of Spirits. But if you haven't, this is one of the most shocking things I say, right. Which. The idea of a God having multiple hypostasis is not original to the doctrine of the Trinity. This was commonly held by every culture in the ancient world. Right. They understood that. And in fact, for them, the number of hypostasis, the number of embodiments or localizations or whatever term you want to use in English. Right. Of that God was potentially infinite. Yeah. You could make one. That's what idolatry is."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":705.44,"end":705.8,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":705.8,"end":817.17,"speaker":"Fr Stephen De Young","text":"You're making one. Right. In this particular place for this God. And you know, the ancient Egyptians noticed that when they were worshiping Rey in his temple at the idol, the sun did not disappear from the sky. Right. So they understood that there were multiple sort of coexisting localizations of this one God. So the doctrine of the Trinity is a particular teaching regarding this, that the God who created the universe, that God has three hypostasis. Right. Exists eternally in three hypostasis and always and only three. You can't make more. You can't write. Even though the Israelites tried with golden calves and other things. Right. So the doctrine of Trinity is not this new thing never before heard of, that just drops out of the sky. Right. With. With in the fourth century, right. After a long period of development or anything else. And so you see this idea that the God of Israel has more than one hypostasis, more than one person reflected in the Old Testament, even though it's not sort of narrowed down completely in the mind of the writers of the Old Testament text or even the Jewish Texts that come, quote, unquote, in between the Testaments, they're all sort of aware of this, but how they work that all out is very different. And so the Son of Man in Daniel is one sort of critically important one. And it's the one that becomes Central during that Second Temple period, from about the 5th century B.C. to the 1st century A.D. when you read Jewish literature addressing it, they're all coming back to Daniel. They're all coming back to the Son of Man. Who is this?"}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":817.49,"end":817.85,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":817.85,"end":864.94,"speaker":"Fr Stephen De Young","text":"Because this is clearly the second hypostasis. Who is it? Where did he come from? What's happening? So what Daniel does in that text is he kind of remixes part of the BAAL cycle. So in the culmination of the BAAL cycle, BAAL is enthroned by his father, El. And so the depiction of the ancient of days in Daniel is very clearly drawn from the way El was traditionally depicted. But the big remix happens with the Son of Man, that it's not baal, it's not another God who has now exalted himself to the pantheon. When Daniel says it's one like a Son of man, it's. It means this is a human."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":865.66,"end":866.06,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":866.46,"end":900.79,"speaker":"Fr Stephen De Young","text":"This looks like a human to me. Right. But he comes riding on the clouds. And the Cloud Rider was one of Baal's titles, because he was. And there are other parts of the Old Testament where that imagery gets picked up and attributed to Yahweh. Right. So the psalm we read in the Orthodox Church at Vespers, right. At the beginning, it talks about, he makes the clouds, his chariot, he walks on the wings of the wind. Right. That's picking up that veil imagery and applying it to Yahweh. Later in that same psalm, it talks about Leviathan, who he made to sport in the waters."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":900.79,"end":901.23,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":901.39,"end":931.05,"speaker":"Fr Stephen De Young","text":"And that's again, a kind of a rift because BAAL defeated Leviathan. That was like his big claim to fame is I fought and defeated this chaos monster. And that depicts Yahweh, like, playing with him like he's a pet, like this is his puppy or something. He doesn't have to fight it. It's like a little to, you know. But here that imagery is all being applied to this human figure. Right. And because of the remixing of Ellen Bale, you have a father son element brought in."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":931.13,"end":931.93,"speaker":"Jonathan Pageau","text":"Yeah. Okay."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":931.93,"end":933.77,"speaker":"Fr Stephen De Young","text":"In the relationship of the two figures."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":934.33,"end":936.65,"speaker":"Jonathan Pageau","text":"And you see this already in the Jewish writers."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":936.89,"end":937.37,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":937.45,"end":941.61,"speaker":"Jonathan Pageau","text":"The New Testament, that they're. That they have this father son discussion, let's say."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":941.61,"end":977.02,"speaker":"Fr Stephen De Young","text":"Yes. Oh, yeah, yeah. And so for example, in the latter portions of the Book of Enoch, the Son of Man is explicitly identified as the Messiah who is going to come. You have. Even when this is condemned eventually in Jewish circles, rabbinic Jewish circles, in the middle of the second century, before this, it was referred to as the idea of there being two powers in heaven. And the word powers, there is exousia that we often translate as authority. But the idea is that someone who has exousia can operate independently."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":977.42,"end":977.98,"speaker":"Jonathan Pageau","text":"Okay."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":978.3,"end":980.94,"speaker":"Fr Stephen De Young","text":"They're not under anyone else's authority."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":981.1,"end":986.22,"speaker":"Jonathan Pageau","text":"Right. They're not. They're not dependent. Yeah, they're not dependent. Like a soldier would be dependent on a general or something."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":986.3,"end":1022.74,"speaker":"Fr Stephen De Young","text":"Right, right. So the idea would be, rather than there just be, there's God and then the angels obviously are under his authority. Right. All the other created beings are under his authority. That there are two in heaven who operate with that kind of authority. And then there was. There were different ideas. Most of the major things we consider trinitarian heresies from the early church are really extensions of those Jewish hypotheses into Christianity. So there are Jewish sources in there who say, well, this must be just like the highest ranking angel. Right. And you find them using the same text that the Aryans use later."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":1022.98,"end":1023.54,"speaker":"Jonathan Pageau","text":"Mm."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":1023.94,"end":1050.48,"speaker":"Fr Stephen De Young","text":"Right. Or Philo. Philo was basically a semi Aryan. He believed that the. The logos and wisdom were sort of produced by God out of his own essence. Right. So you find these things that show up in later Christianity within the Jewish speculation already beforehand. But when it's eventually condemned, and the first records we have of this on the Talmud, even though it happened in the second century when Christians were expelled from the synagogue. Yeah."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":1050.48,"end":1056.6,"speaker":"Jonathan Pageau","text":"Also you think the idea is that when the Christians were expelled from the synagogue, they also banned these types of teachings."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":1056.6,"end":1090.14,"speaker":"Fr Stephen De Young","text":"These. Yeah. And there's a really good book by a Jewish scholar, Alan Sagal, called Two Powers in Heaven, that talks about this in the second century. And in the Talmud, there are two different answers to this problem in different places. So in one place it talks about they have this problem with Rabbi Akiva, who lived at the beginning of the second century and was part of the Bar Kokva rebellion, he becomes this huge figure in rabbinic Judaism. But it was sort of well known that he had believed in two powers in heaven."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":1090.22,"end":1090.78,"speaker":"Jonathan Pageau","text":"Okay."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":1091.18,"end":1101.78,"speaker":"Fr Stephen De Young","text":"So in one of the tractates of the Talmud, they want to rehabilitate him. So they say, well, yeah, he thought that at first. He got corrected. Yeah."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":1101.78,"end":1102.22,"speaker":"Jonathan Pageau","text":"Okay."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":1102.22,"end":1116.33,"speaker":"Fr Stephen De Young","text":"Right. And the way it's phrased in the Talmud that he got correct is that he later said, one is for mercy and one is for judgment. Now, that sounds obscure, what that means. Yeah, but it's referring to the thrones that are set up in Daniel."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":1116.73,"end":1122.25,"speaker":"Jonathan Pageau","text":"Yeah, the two. I mean, you see those. You see in Christian iconography, you see those two angels, the red and the blue angel."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":1122.65,"end":1140.9,"speaker":"Fr Stephen De Young","text":"Right. The two. The two thrones are set up. And so what is the ancient days? What is the Son of man? Right. And so they say. Well, Akiva later said, essentially a kind of modalism. Right. That God manifests himself as an old man to show mercy. It is a young man for judgment, for rigor."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":1140.9,"end":1147.18,"speaker":"Jonathan Pageau","text":"Yeah, yeah. They brought it down to, like, the. The two hands or the. The two sides, let's say."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":1147.34,"end":1147.7,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":1147.7,"end":1149.02,"speaker":"Jonathan Pageau","text":"Interesting. Wow."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":1149.02,"end":1163.82,"speaker":"Fr Stephen De Young","text":"And then the other explanation is, is there's a story that recounts this rabbi who, through kind of Merkava mysticism, has this vision of heaven, and while he's there, he sees this angel sitting down."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":1164.16,"end":1164.4,"speaker":"Jonathan Pageau","text":"Right?"}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":1164.88,"end":1179.76,"speaker":"Fr Stephen De Young","text":"And so since he sees the angel sitting down, he says, oh, this angel must have authority. And so he believes in the two powers in heaven. And then he's, like, sent into exile on the earth and condemned forever. And the angel gets flogged. Apparently."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":1181.52,"end":1203.4,"speaker":"Jonathan Pageau","text":"They're sitting down. Sat down on a throne. It's like that's the thing people aren't used to. They don't understand the imagery of what it means for someone to be sitting and someone to be standing. We do in the Orthodox church. We have a better sense of it because in theory, we stand in the church. Not much anymore, but that at least, was the original idea. Yeah. Wow. Interesting stuff."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":1203.4,"end":1211.88,"speaker":"Fr Stephen De Young","text":"Yeah. So even the tell, it offers these two different sort of resolutions to it. Right. In terms of who this figure was."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":1212.84,"end":1222.24,"speaker":"Jonathan Pageau","text":"Because the figure also appears in Ezekiel, but in the Merkabah itself. Like, Ezekiel sees one as a man."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":1222.64,"end":1248.04,"speaker":"Fr Stephen De Young","text":"Right. And so there's. Well, there's this tension all the way through the Old Testament. So in the same chapter, in Exodus, at the beginning of the chapter, it talks about Moses speaking to God face to face. It literally says mouth to mouth in the Hebrew as a man speaks to his friend. And then a few verses later in the same chapter, Moses says, oh, I want to see your glory. And God says, no, you can't see it and live. You're like, well, wait a minute, right? They were."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":1248.36,"end":1249.32,"speaker":"Jonathan Pageau","text":"They were talking."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":1251.88,"end":1308.13,"speaker":"Fr Stephen De Young","text":"What is happening? Right? And so there's. There's. There's a tension to the Old Testament of no man can see God. No one could see God and live. And then there's all these stories of people seeing God. Yeah. You know, and St. John takes that at the end of the prologue to his Gospel, says no one has seen God at any time. That's not a retcon of the Old Testament. Like, just forget all those stories. They're now not canon. But you said the second part of that is. But either the unique God or the only begotten God who is at the side of the Father has made him known. So he's saying it was this divine Son, it was this second figure who people were seeing all through the Old Testament. And the Father is the one who remained unseen. But this was already in there. Right. And this connection of him, particularly to humanity. Right. In a way that the ancient days was not right. That the, the Father was not right."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":1308.13,"end":1374.59,"speaker":"Jonathan Pageau","text":"Exactly. And so that in our, let's say, in the orthodox tradition, we have a very particular preservation of that because it seems like, although, how can I say this, the idea, for example, that the cr. That the man Jesus Christ created the world, for example, you find that in some, in some texts you see that in Saint Maximus he has some crazy sayings, you know, when, while he was on the cross, he was creating the world, like all these types of contradictions. But for sure, in the, in the iconography, it was preserved very attentively. So until the 14th century, when you see God represented anywhere in, in the Old Testament, it's always Christ. And so when you see the creation of man, you see Christ and it's Jesus Christ. Right. It's, it's, it's not a. It's like a. It's not that pre incarnate Logos, it's the man Christ who is creating the world. And it seems like it's a continuation of that image of the Son of Man. The idea would be something like, although in terms of time, it doesn't make sense for us, but that ultimately doesn't matter. The idea is that what they saw, what Daniel saw, was Jesus Christ at the side of God the Father."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":1374.59,"end":1410.47,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. And the time problem is because of the type of creatures we are. Right. We were talking, you know, mentioned Nagel. What is it like to be a bat. Right. Animals don't experience time the same way we do. Right. There are all different ways in which their consciousness is different. I was recently watching a thing about a dog that had to have a leg amputated. And animals adapt to that kind of thing almost instantly. Humans go through all kinds of. Right. Because we have a different kind of bodily awareness than an animal has. Right. So an animal is just, I Have three legs now. Okay, Right."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":1410.47,"end":1411.39,"speaker":"Jonathan Pageau","text":"Yeah. There's no morning."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":1412.51,"end":1429.55,"speaker":"Fr Stephen De Young","text":"Yeah. Learn to run on three legs. And that includes the experience of time. And so we want to apply our experience of time to, for example, angelic beings. So this comes up a lot with Lord of Spirits stuff because it's, well, when did the angels fall?"}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":1429.63,"end":1430.59,"speaker":"Jonathan Pageau","text":"Yeah, Right."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":1430.59,"end":1450.99,"speaker":"Fr Stephen De Young","text":"It's sort of like, well, what time is it in heaven right now? Like, what time zone are they on? Right. We're projecting, right. Our experience onto beings that are not like us, whose consciousness is different than us and who experience time in a different way. And there's this huge break point as soon as you try to get to God."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":1451.23,"end":1451.71,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":1451.95,"end":1496.26,"speaker":"Fr Stephen De Young","text":"You know, and so time and space are really attributes of created things. Right. And we've been taught in Western theology even, Right. We talk about omnipresence, you know, well, God's everywhere created things early, in one place, at one time, but he's in all the places all the time. Right. That's not really what that means. Right. You read Father Duometry. Staniloy is really good on this in his Orthodox dogmatics, Right. He has talks about God's attributes being supra essential. So it's equally true to say God is everywhere and to say that he's nowhere. Yeah. And that basically what we mean is these spatial categories don't apply to God. These temporal categories don't apply to God when we say he's eternal."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":1496.74,"end":1497.22,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":1497.38,"end":1502.58,"speaker":"Fr Stephen De Young","text":"Right. And so when we talk about Christ before."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":1504.26,"end":1505.86,"speaker":"Jonathan Pageau","text":"Yeah, before the Incarnation."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":1505.94,"end":1528.56,"speaker":"Fr Stephen De Young","text":"The Incarnation, that's presuming that Christ as God experiences time the way we do that. There was this before and after and over and over again in our dogmatics and our hypnography and everything, it talks about how Christ took on our human nature. Christ became in without change or alteration. And I don't think we take that seriously enough."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":1528.72,"end":1540.24,"speaker":"Jonathan Pageau","text":"Yeah. We have this idea that because we say things like Christ ascended into heaven and his body is there next to the Father, but now we think that that's in time. It's like, well, wait a minute."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":1540.96,"end":1558.89,"speaker":"Fr Stephen De Young","text":"And that's a place. Yeah, yeah. And that was, you know, sorry, Calvinists. I got to get one of these in here. Right. That was the Calvinists. It wasn't Calvin himself, but that was the Calvinist's whole argument against Luther on the Eucharist was it can't be Christ's body because Christ's body is in heaven."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":1559.05,"end":1559.41,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":1559.41,"end":1562.17,"speaker":"Fr Stephen De Young","text":"Yeah, it's in that place. So it can't be all these other places."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":1562.17,"end":1585.75,"speaker":"Jonathan Pageau","text":"It can't be in all these other places. Yeah. What's going on? What's going on? Yeah. So there's an interesting idea, which is something like when Christ ascended into heaven, he ascended into heaven from the beginning. Like he ascended into heaven from forever, like from beyond time, let's say, like, that there is no. That he entered into that Christ's body is in God."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":1585.99,"end":1586.39,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":1586.39,"end":1589.83,"speaker":"Jonathan Pageau","text":"Yeah. It's not limited by time or space, ultimately."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":1590.07,"end":1600.57,"speaker":"Fr Stephen De Young","text":"Right. It's not a question of time and change that we experience. There are points where these realities enter into the realm of human consciousness. Yeah."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":1600.57,"end":1601.85,"speaker":"Jonathan Pageau","text":"That's the best way to explain it."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":1601.85,"end":1622.13,"speaker":"Fr Stephen De Young","text":"There are points in. In our history, in our human history where the fall of certain angelic beings entered into our conscious experience. There's a place where Christ's incarnation entered into our conscious experience. But it's not that it wasn't true before that. Yeah. Right. That's why he's the Lamb slain before the foundation of the world."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":1622.13,"end":1624.21,"speaker":"Jonathan Pageau","text":"Yeah. I've been quoting that verse a lot these days."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":1625.41,"end":1638.04,"speaker":"Fr Stephen De Young","text":"Right. I mean, that's. So that these things are eternally true, but they enter into time and space. Right. And our experience in a particular way. Yeah. Because of the type of beings that we are."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":1638.12,"end":1757.1,"speaker":"Jonathan Pageau","text":"And so I want to. I want to propose something to you, and I want to know what you. What you think about this, because one of the reasons why I've been thinking about this question of the Son of Man is because we have this. It's a technical problem almost. It's a technical problem right now in terms of the transition into people understanding. The notion of principalities or the notion of higher forms of agency is that there's a sense in which there's always a difficulty or an ambiguity where people will want to say, what's a projection of the human psyche, let's say. And you see that even in the ancients, you'll find texts where they'll say, are the gods the creations of men? You know, or. Or vice versa. Like, what's the relationship? Because the gods are in the image of man, you could say. And also the things they manage, like cities, like the aspects of reality that they manage are related to us. Right. So even in the Greek idea of Poseidon, like Poseidon is the God of the seas, but he's. It's always related to how it affects troubles or helps us as humans. And so what I've been thinking about is it's. There's a sense, and you see that in the narrative of Scripture, which is something like, although these angels are above us, ultimately they are meant to serve us, that ultimately, to the extent in which we are in Christ, who is the Son of man, who is the divine man, then we will rule over the angels. And so it seemed to me that the notion of the heavenly man, the Son of man, even if for people who don't necessarily would even come to believe that that's Jesus Christ, let's say, who just have this idea of a heavenly man or a man with a capital M, would be a solution to the technical problem of agency above us is that it's mirrored through human man consciousness. And so the question of whether their projections of the psyche or existing above us becomes moot in this notion of Adam Katmon or, you know, universal man or heavenly man as we find in these kind of traditions."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":1757.5,"end":1801.51,"speaker":"Fr Stephen De Young","text":"Yeah, yeah, well, and that's. That's built into. I mean, Hebrews straight out says that, right. That the angelic spirits were created to serve us, to minister to us. But that's, that's built into. But this is something we've lost. This is built into what's going on in Genesis 3 with the fall of the devil. Because what you find when you read the fathers closely, if you get rid of Milton, we don't need any puritans. Milton's one of the better ones, but we don't need him either. But the devil fell. All the fathers have jealousy and envy, right. And it's not jealousy or envy of God somehow, it's jealousy or envy of humanity."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":1801.59,"end":1819.64,"speaker":"Jonathan Pageau","text":"Yeah, that's something that most people don't think, but it's definitely. It's there. It's weird because it's there in the Islamic tradition too. Like, it's actually, there's a story where the devil's asked to bow before Adam and then that's how he is cursed. So it seems like it was probably coming out of these Christian traditions at the time too."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":1819.8,"end":1880.24,"speaker":"Fr Stephen De Young","text":"And it, it makes less sense in Islam because they don't have Christ like you were just talking about. Yeah, right. Because the destiny of man is not just like, you know, you're going to stay a corporal and man's going to. Humans are going to get made sergeants. Right. He's going to get promoted over you. It's the destiny in Christ of being united to God in a way that the angels are not right as Hebrews, again, like reiterates. Right. And so that is built in there. But even the language used by somebody like Plato, when he talks about the gods being allotted their various places and things that they're in charge of, he Describes them as shepherds. They were appointed to shepherd the people. And he says for a time they did it as gentle shepherds. And then for him, something changed. For him, there's this golden age, the age of Cronus, when that was true. And then after that, things changed. Right. But he acknowledges that's not the way it is now with the gods."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":1880.32,"end":1880.64,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":1880.64,"end":1941.23,"speaker":"Fr Stephen De Young","text":"And you read Homer and you quickly see that's not. Yeah. They're feuding and fighting with each other and switching sides in battles. And, you know, and so they've. They've become. They've become something different. And if you read Eusebius's demonstration, Eusebius of Caesarea, his demonstration of the gospel, he sort of goes all in on this in terms of this being what the gospel is about, is about these spirits, rebellious spirits who are assigned to the nations. He talks about how they were assigned to lead. And he's picking up on Saint Dionysius here, too. They were assigned to lead the nations to God. Right. To lead them to Christ. But they did not. They led them somewhere else. And so now new spirits like the saints are now replacing them who will lead humanity to God and to salvation, to becoming like God. Right. And to sort of accomplish that, that destiny. So it's not just leapfrogging in a hierarchy that's set up artificially. Yeah. It's an ontological difference."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":1941.47,"end":1965.84,"speaker":"Jonathan Pageau","text":"So man, as this point, you could say this anchor between the visible created world and the invisible has an advantage ultimately, you know, because the pinnacle of that would be Christ. You could say the pinnacle of that connection would be Christ. And then that center becomes. Has an advantage over the incorporeal beings even, because it kind of spans all the hierarchy itself."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":1966.4,"end":2054.06,"speaker":"Fr Stephen De Young","text":"Right. So you read the celestial hierarchies of Saint Dionysius. Right. And these aren't like races or species of angels. Right. That looks at ways because they don't reproduce. Right. That's not. The idea is they have different jobs. They have different tasks that they're performing in these different ranks. And the higher the rank, as it's described, the closer they are to the throne of God. And so the more they participate in the grace of God because God empowers them to fulfill sort of their job assignment, their role that he created them to play. But angels don't get, like, promoted up that ladder. Like, well, you did a really good job as an angel. We're going to try you out as an archangel, see how you do. Right. You know, maybe you'll be a throne someday. Right. Like, that's not how it. Right. How it works. They have this job, whereas humanity, because in Christ our shared human nature is perfectly united to God, right in the person of Christ. Because of that, humanity can make infinite progress in the grace of God toward God. There's a potentially infinite. Because the distance is infinite between God and any creature. We can make infinite progress toward God, which is something the angelic powers can't do. And that invoke jealousy in some of them and rebellion in some of them."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":2054.06,"end":2120.65,"speaker":"Jonathan Pageau","text":"And so what's interesting to me, especially like this doctrine or this notion, is that in some ways it makes sense of creation. I've always thought that the notion of theosis helps us understand the reason for creation. Because I remember when I was younger, I was told something like, you know, God created us for us to submit to him and, and glorify. Like that's our job. Like we're there. So God creates the world, and the world is there to worship Him. Basically. There's something. I mean, there was something unsatisfying about that. Like really God creates. So God creates the world to worship him. I. I guess, I mean, I mean, he is God, so he deserves it. I'm not saying I don't want to take away from God, but the notion that there's rather this, like, it's almost like a love story, you know, where God creates the human person in order to then bring the human person back into Him. To the extent that that, that's possible, that that seems like a much more. And that we do the same with creation. We could say that it's also kind of our job to do that with creation makes. Just. Makes it a far more beautiful story."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":2120.97,"end":2123.61,"speaker":"Fr Stephen De Young","text":"To me that that's. It's God's love."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":2124.17,"end":2124.61,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":2124.61,"end":2203.25,"speaker":"Fr Stephen De Young","text":"He has no needs, but out of love, he created humanity to share his life with, to share his divine life with. And this undergirds in the Old Testament all of the language of Israel as sort of his wife. And then the language of the church is the bride of Christ. Because we have to go back to the social structures of the time, right? Which were a man would become established, right? He would create a life for himself, right? He would have a life, he would have property, he'd have a place. And then he would marry a woman and bring her into that. And then they would have children, and those children would share. They would share that life together. And so he's using that cultural imagery to explain God has created this world, right? He has this life in himself and he creates humans and brings them in to Share it with them. And so it's not. God demands worship. If you refuse, he's going to be very angry at you and torment you eternally for it. Right? It's God created you out of love. He's extending that love to you. He wants to share his life with you. But he also leaves you free. Right? There's a right of consent. He leaves you free to reject that if you want to and cut yourself off from it if you want to, which is a very different picture."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":2203.41,"end":2275.96,"speaker":"Jonathan Pageau","text":"And so where do you. Because this has been, I guess, like there's a. There's you guys talking about this in terms of this different vision of. I guess it's a. It's also in some ways a restoration after the materialism we've been through, this vision of divine council, you know, this idea of these hierarchies of intelligences, all of this. A lot of people are going back to that. People always quote Michael Heiser, but even, even people that are kind of completely on other tangents. I've noticed that David Bentley Hart has been going at that too. You know, saying. Saying basically Paul is talking about angels like he's Paul, all that. Paul's talking about his angels all the time. And people seem to have forgotten that. So it seems like this is. Give me your impression of this, because it seems like there is. We're talking about this idea of re enchantment. There's this moment of re enchantment, but it seems to me that there's a. That the re. Enchantment isn't always good. Let's say that although this moment in. In the breakdown of materialism is offering us the possibility of. Of seeing these mysteries once again, it's also a space of flooding in, of. Of all these demons, basically, that the demons are flooding into. So I don't know if that's something that you've noticed or that you've thought about in terms of the. The current moment."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":2276.45,"end":2365.26,"speaker":"Fr Stephen De Young","text":"Well, I don't think they ever actually went away. I don't think closing our eyes and pretending they weren't there. You know, you look at the history of mass murder and genocide in the 20th century, all over the world, they were there. And I don't think pretending there weren't any spirits really protected us from them. If anything, the opposite, right? There were spirits at work in different places at different times, moving people and masses of people. Right. So in one way, I think just being aware is better than being in denial. Right. Of the reality. The problem is, I think. So we've lost Sort of a spiritual technology, you might say, a spiritual technique. Know how that we used to have. Right. That because we understood these things, so we understood when we sense that there was this maligned spirit at work in a group, in a place. Right. In a nation or something, we sort of knew how to exercise it and how to invite in another, better one. Right. And you see this as the. As the Roman Empire was Christianized, right? They acted this out very literally, you know, Saint Cyril of Alexandria taking the bodies of martyrs and having them reburied where pagan temples used to be. This was very much, very much acted out. And I think we've. We've lost that know how is our biggest problem. Even as we're becoming aware, right. We may become aware like there's something wrong here. There's something, you know, there's a spirit moving. This is."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":2365.26,"end":2365.46,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":2365.46,"end":2388.83,"speaker":"Fr Stephen De Young","text":"But we don't know how to make that switch. And that's even true. I mean, just to take a particular case that we mentioned recently on Lord of Spirits. With technology. With technology. This has been true throughout history. Every time we first discover something, our first use for it is pretty much evil, right. So we learned how to split the."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":2388.83,"end":2390.59,"speaker":"Jonathan Pageau","text":"Atom, make a bump."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":2390.59,"end":2412.97,"speaker":"Fr Stephen De Young","text":"Right. And the second atomic bomb that gets dropped wipes out more than 50% of the Christians in Japan. In Nagasaki, it was the most Christian city in Japan before. More than half of the Christian population of Japan was there. Wiped out. Right. By a bomb. The Internet, I don't remember how old you are, but I was there back in the old days when it first started, and it was mostly pornography right away."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":2412.97,"end":2413.57,"speaker":"Jonathan Pageau","text":"Yeah, right."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":2413.73,"end":2439.03,"speaker":"Fr Stephen De Young","text":"It's a pornography distribution system and now social media. Right. And all of these things, our first use for them is evil. But we used to know down the road how to make the move. Right. How to banish the spirit that was, you know, that maybe helped us find the technology before we were ready for it and how to then put it to a better use. And now I don't think, think we know how to do that anymore."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":2439.51,"end":2544.89,"speaker":"Jonathan Pageau","text":"Yeah. Because that narrative is there. This is something I've been reflecting on quite a bit. It's there very much. In Scripture, you have a sense in which even in the Bible, you know, even without looking at the extra biblical traditions, you have a sense in which technology comes in with the fall of Cain and Cain's descendants are the ones, the ones that develop technology, and that brings us down to the Flood. But then you have a sense in which the ark is also a technology and that it covers. You could Say Cain's technology, right. It becomes, it raises it up and becomes a vehicle for preservation through the flood. And then you see the same with the question of the temple and the tabernacle. And the temple, like, you know, it's. I think it's Bezalel. When the, when he's named as one of the ones who creates the tabernacle, his name sounds like the darkness of God. And then he's called an artificer, which is the only other place in the Bible where that word is used, except for Tubal Cain. So it's like they're clearly linking him to Tubal Cain, but basically saying like, we're going to redeem this process, you know, and if you add the Enochian traditions into that, then it becomes even clearer that there's a sense in which this taking of that's like reaching up and grabbing a pattern of reality and then pulling it down into the world. You can see that as having sex with this, with the demon, like the different ways to image that. Right. But it's like you take from above and you bring it into yourself. And then usually the result of that is a giant, it's a giant body that is very powerful, that destroys. It's as if people have forgotten that and now it's so out of control. You think that technological progress is a good in itself, which is just the craziest thing in the world to think that."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":2545.21,"end":2582.43,"speaker":"Fr Stephen De Young","text":"But that's. Well, I mean, you look at American politics, right, we have two parties, one of which is just completely technocratic neoliberalism. Technology will solve all our problems. And the other one is technology drives the free market. And so it's good for commerce. So it's good. Right. So there's no sort of descent on the technological. Innovation will always be good. We'll always move in a positive direction. Yeah. But even though now there's this awareness, more awareness coming, awareness without the tools to do something about it, just causes everybody to get black pilled."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":2582.43,"end":2583.47,"speaker":"Jonathan Pageau","text":"Right? Yeah."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":2583.47,"end":2584.99,"speaker":"Fr Stephen De Young","text":"Realize how horrible everything is."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":2585.55,"end":2588.03,"speaker":"Jonathan Pageau","text":"You just lay down and sleep."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":2589.79,"end":2629.55,"speaker":"Fr Stephen De Young","text":"You know? And I mean, really. So if, I mean, if you're in a form of Christianity that doesn't have any relics, you can't go bury them in the pagan temple. Yeah, right. If you don't have any holy water, you can't come and bless your house. Right. And so even our Christian practice, and this isn't just a pitch for the Orthodox Church, Right. Because there are other churches who do have some of these things and there are a lot of people in the Orthodox Church, especially in North America, who are practicing in a very materialistic way, shall we say. But we've lost a lot of those tools, or at least we think, or we think, you know, the priest coming to bless the house is just like a nice thing he does when he comes and visits once a year."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":2630.02,"end":2702.34,"speaker":"Jonathan Pageau","text":"Yeah. They don't see it as, let's say, a manifestation of authority over something like a pattern that's there. It's like installing a new pattern of authority which comes from God and is brought into the place. And it makes. Like, I always try to translate this stuff for secularists so they can kind of understand why sprinkling holy water would change something. And it has specifically to do with the idea that if you have a pattern that is out of control and it has a life of its own, then you need authority in order to change it. You can't just change it. You can't. There's no way to just change things without something else taking its place or another story, another vision, another pattern coming in and taking its place. And that means ritual, it means authority. It means actual action. It's not something that just happens in your mind. It has to be played out in the body as well, of the place. So it's not. This isn't like just mumbo jumbo, because I know that a lot of people will listen and think, well, this is just mumbo jumbo. Like, why would sprinkling water on something change it? Because patterns change with authority. That's how it works. Right."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":2702.34,"end":2765.24,"speaker":"Fr Stephen De Young","text":"Well, and part of this is confession. I watched part of you talking to Douglas Murray, got super frustrated about this. And stop. The guy is too Protestant to be a Christian. Um, he's. The. The. The idea that we have that's been bequeathed to us by particularly Puritan Protestantism, that. That what's important is ideas, and that ideas precede practice has broken all of this for us. Yeah, we have this idea. Well, you have these theological ideas. What makes you a Christian is that you accept that they're true. So if I gave you a true false test, you'd put the T's and F's in the right places, Right? Now, you're a Christian because you believe that these certain things are true, and then you come up with practices to reflect your beliefs. Right. And that's exactly backwards. Right. But ideas and beliefs emerge from practice, emerge from a way of life. Right. And a way of being in the world."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":2765.24,"end":2765.64,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":2765.64,"end":2775.95,"speaker":"Fr Stephen De Young","text":"And so, I mean, if you took a time machine back to ancient Athens and said to them, so you believe there's 12 people up on this mountain. Like, we could go there right now. Right."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":2775.95,"end":2777.11,"speaker":"Jonathan Pageau","text":"You wouldn't find them. Yeah."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":2777.11,"end":2783.51,"speaker":"Fr Stephen De Young","text":"And they govern all of human destiny. And they. Right. You actually believe that that's true. They look at you like you were crazy."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":2783.51,"end":2784.19,"speaker":"Jonathan Pageau","text":"Yeah, that's right."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":2784.67,"end":2819.91,"speaker":"Fr Stephen De Young","text":"Right. Because that's not what it meant to be an Athenian was to hold certain beliefs. Right. What it meant to be an Athenian was to have a connection to that piece of ground that your family had worked for generations outside Athens. Right. And that Athens was the center of your social and political life. Right. And part of that was the worship of these particular gods, Athena and Hephaestus. Right. And all of this. But all of that emerged. And so they would. If they were able to answer you, they would say, well, no, you need to move here and you need to come and share our life. Right. And you need to live the way we live, participate in our festivals. Participate."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":2819.91,"end":2820.31,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":2820.79,"end":2821.35,"speaker":"Fr Stephen De Young","text":"And then."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":2821.83,"end":2824.07,"speaker":"Jonathan Pageau","text":"Then one day you'll be able to see the God. Let's see."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":2824.63,"end":2935.25,"speaker":"Fr Stephen De Young","text":"Yeah. You'll understand what all this is about. Yeah, right. You'll understand what all this is about. And this is a problem with the way a lot of Orthodox churches do catechesis. Because the way we do catechesis is, well, here's the dates of the ecumenical councils and here's. The Orthodox Church believes this and this and this. And we try to convince people outside the Orthodox Church or outside of Christianity to believe that this is true. Whereas what we need to be doing is. And what I try to do at least is even if a guy shows up and he's like, I've read this giant stack of books on the Orthodox faith and I've watched every Symbolic World video, and I'm on board, I agree 100% with everything. Right. I'm still going to make him attend the church for a year and become part of the community and start fasting and feasting with us and getting to know everyone and all that. Because even those things that he says he accepts now will. He will relate to in a different way at the end of that year. Right. And so that way of life, the idea that ideas emerge from that and they make sense in that context. We do this with the moral teaching of the Church all the time, too. We try to throw the moral teaching of the Church at people who are completely outside the church. We're in a context where it doesn't make sense. Well, why can't I do that? Right? And it's like, well, there's a thousand things that would make sense to you if you were relating to the world in a different way. Yeah. Right. And so, yeah, from outside throwing me. Throwing a bunch of water around your house, trying not to ruin any electronics. Right. Doesn't look like this would be beneficial to you in any way, but it becomes meaningful within a context of relationships. Right. And a way of living and being in the world that that person doesn't share yet. So it's not going to make total sense to them yet."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":2935.25,"end":2953.37,"speaker":"Jonathan Pageau","text":"Yeah, that makes a lot of sense. Well, Father, thanks. Thanks for your time. This was a great discussion. And there are still people watching this that don't listen to the Lord of Spirits. You have to check it out. And also don't forget, Father Stephen also has. Are you still writing your whole Council of God blog as well? Are you still."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":2953.53,"end":2957.61,"speaker":"Fr Stephen De Young","text":"There hasn't. There hasn't been anything recently. I've been focusing on books."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":2957.89,"end":2958.13,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":2958.13,"end":2959.89,"speaker":"Fr Stephen De Young","text":"But there will be sporadic things."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":2960.21,"end":2961.01,"speaker":"Jonathan Pageau","text":"But it's still there."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":2961.33,"end":2966.13,"speaker":"Fr Stephen De Young","text":"Yeah, it's still there. You can find a blog book review a few months ago, so."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":2966.21,"end":2980.53,"speaker":"Jonathan Pageau","text":"And get the book for sure. So. So we will definitely. I mean, I'm sure we will have other chances of. Of having conversation and I hope one day I'll be able to meet you in person. That would be nice because this zoom thing is at some point it. We have to move into real spaces."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":2980.53,"end":2982.45,"speaker":"Fr Stephen De Young","text":"Yeah, absolutely."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":2982.93,"end":2983.73,"speaker":"Jonathan Pageau","text":"Thank you, Father."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":2984.07,"end":2984.71,"speaker":"Fr Stephen De Young","text":"Thank you, John."}
{"episode_id":"SW - #261 - 2022-11-01 - Fr. Stephen De Young - The Son Of Man","start":2984.95,"end":3046.92,"speaker":"Jonathan Pageau","text":"I hope you enjoyed this episode of the Symbolic World. The Symbolic World is based on a series of videos that you can find on my YouTube channel, Jonathan Pedro's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is. It's quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course, leaving a review on itunes. Everybody knows that's the best way to get the podcast out there to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon the Pajo videos as well and on subscribestar. All those links you can find on my website or in the show description. So thank you and I will see you soon."}
