{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":0.4,"end":16.44,"speaker":"Jonathan Pageau","text":"It seems like there's a good reason to talk about this just because it happened with it yesterday or a few days ago. If you followed this story about the Google employee who declared Lamda, one of the AI bots, to be sentient, the."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":16.44,"end":70.23,"speaker":"Jordan Hall","text":"Silliness with which such a large fraction of our collective intelligence was effusively oriented towards something is just evidence of the ease by which a relatively mediocre AI, if improperly deployed, could take advantage of our lower natures and the decadence, corruption, and otherwise profane aspects of the paperclip maximizer in which we live to further the process of converting us all into paperclips. This is the problem that I see. It's less a problem of sort of like, everything's hunky dory, but we accidentally create, you know, Terminator 2 or something like that. It's more like it's all part of a reciprocal narrowing that we call civilization and that we're living within, and we need to actually find our way out of that in general."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":82.23,"end":85.58,"speaker":"Jonathan Pageau","text":"This is Jonathan Pedro. Welcome to the symbolic world."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":85.73,"end":85.97,"speaker":"John Vervaeke","text":"World."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":95.73,"end":139.63,"speaker":"Jonathan Pageau","text":"I think, like, one of the things that I think is going to be important in this conversation is that. Is that it's going to be. When I listen to Jordan, when I listen to you speak, sometimes I don't understand what you're saying. And I think part of it is just terminology. You have a whole set of terms that are different from the ones that I use. And I've learned to know John's terms, and so I kind of understand. Understand what? When he says something, I know I kind of have a background to what he said. It's what he's saying. Whereas you. Sometimes I hear you say something, and you. And the conversation continues, and I'm like, I didn't. I didn't get. Like, I didn't understand what he's referring to there. And so I think that we'll have to be like, at least you'll have to be generous with me in this conversation. Sometimes I'll stop you and say, I don't know what that means. Like, I don't know what that. What that term means."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":139.79,"end":161.27,"speaker":"Jordan Hall","text":"Well, maybe I can't even broaden it. My sense is. I've been contemplating this conversation is that we'll actually want to be consciously moving quite slowly because the thing that we're dealing with is, in some sense, the most esoteric thing possible, and language itself isn't going to be an adequate tool for addressing it."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":161.51,"end":162.47,"speaker":"Jonathan Pageau","text":"Yeah, that makes sense."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":162.79,"end":170.63,"speaker":"John Vervaeke","text":"So we've got to listen to each other but follow the logos. So that's going to be. It's going to require all of our virtuosity and virtue."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":172.23,"end":232.86,"speaker":"Jonathan Pageau","text":"And so I guess, I mean, this conversation, I guess was sparked by a discussion, Jordan, that you had with a few other people on rebel Wisdom about Egregores. And I think that the notion of egregores has been kind of floating around. I've been seeing different people talk about it also because everybody seems to be reading Tomberg's meditations on the Tarot right now, which I'm reading at this moment. And he also talks about Egregore's as well. And this spawned several articles on my website from people that are kind of in my mind space, you know, talking about my. The way I talk about higher beings and challenging it, trying to figure it out. And so that's what at least sparked my interest in having a conversation about this, which is to try to understand agency at transpersonal levels. What does that mean? Is there agency? Is there consciousness? Can we perceive it? How do we participate in that? That's the thing that interests me very much these days. And I think it also, I mean, John, I know it's part of your work and Jordan, with that conversation, I saw that you were definitely thinking about it."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":233.18,"end":302.3,"speaker":"Jordan Hall","text":"Yes. Well, I would say something like this question, this category question simultaneously is radically under considered in the. I would call it maybe conventional wisdom within the sort of the. To the degree to which people are thinking about how to act in the world, very few of those who have agency in a sort of material sense at least consider this category properly or even at all. In most cases, to the degree to which this category has any degree of reality, it's obviously significantly impactful. So that's a high asymmetry. I think frankly, maybe of the three of us been more along the lines of the mainstream, meaning up until relatively recently, these sorts of notions popped into my head, but I didn't think about them that much. And then over the past five to seven years, increasingly found myself frankly obligated to contemplate them more deeply. And so I'm coming in as a bit much more of a novice, I would imagine, in the category. So you can see I'm maybe representing almost more of an audience than a contributor, but motivated, participatory audience."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":303.42,"end":462.49,"speaker":"John Vervaeke","text":"So I mean, where I'm coming at this, I mean I recently published three papers with Dan Chappie and important academic journals, really exploring distributed cognition. That's what it's called. In 40 Cogsci. This has been talked about deeply in 4E Cocci especially the work of Chalmers and Clark. For a long time Ed Hutchins work on cognition in the wild where he talked about the distributed cognition the dynamical system that navigates a ship was in the 80s. This topic has been part of one of the fourth E is extended and part of calling cognition extended is exactly the idea of distributed cognition and dynamical systems. And I think we should pay more attention to that. Very often fine grained working out around it. And it is being worked out. One way I would recommend right away is that I would challenge the word egregore which I think is a bad term, an infelicitous term in that it already misframes the phenomena we are trying to talk about because it's based on the idea of aggregation which is a completely bottom up understanding of the phenomena. That's what aggregation means. I draw a bunch of things together and something emerges from them. And the problem with that purely bottom up model is it only gets half of the story. That is actually the case in distributed cognition. This is something Jonathan and I have talked about and Jor and you and I have talked about it to a degree too. To degree to which these things take on a life of their own and are properly understood as hyper agents. That's my term. Or spirits. That's Jonathan's term. And I'm not using that term prejudicially at all. We have to really understand the top down element from the very beginning. And I think the degree to which we try to have these purely either bottom up or top down models of these kind of phenomena which are the great temptations is the degree to which we are falling into a we're starting off on the wrong foot. In a fundamental way. I tend to prefer the term hyper agent which is analogous to Morton's idea of hyper objects. And so it has already has a good provenance and it captures the discourse around the agency of the collective intelligence found within distributed cognition. Those are the three terms I would like to put at the front. Hyper agency, collective intelligence, distributed cognition. And put them within a framework that is not just bottom up but also equally top down. That's my first proposal."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":463.77,"end":489.35,"speaker":"Jordan Hall","text":"My sense is I'm coming at it almost in the direction of a blind man feeling the landscape and trying to notice what the different things are in the landscape. And I'm not quite sure what's there. And it seems like there's probably a number of distinct kinds of things that are not all the same. But it might be useful to Discern the distinctions and some sense of, like, what would you call it? The bestiary? What's a collection of beings called? Definitely don't want to call it a pantheon, but you know what I'm saying?"}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":489.35,"end":492.31,"speaker":"John Vervaeke","text":"A collection, a beastiary or a taxonomy."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":492.31,"end":624.75,"speaker":"Jonathan Pageau","text":"Yeah, taxonomy, yeah. And so I think that the way that I. Because I've been thinking a lot about this egregore and also I've been provoked and kind of challenged by my own. The people that follow what I'm doing and are thinking in similar terms as I am. And one of the things that they've noticed is that there are certain, let's say there are collective beings or like hyper agents, the way that John talks about that seem to have, let's say, have more logos that seem to be teleologically structured. Let's say the navigation of a ship, for example. So the navigation of a ship will have a clear hierarchy and there'll be a captain who will, let's say, be the top of the. Of the way that the direction that it's going, he's going to manage the others. But they're all working together and paying attention to the same telos. And so they're able to function as a. As a body, you know. But there are also versions of these beings that seem to be something like headless. And this is what some of my friends have pointed out to me, and that they seem to be more. They seem to pop up and disappear. And so you see that the type of being that Jordan was talking about in his discussion about these. These weird morality codes that rise up online and then start to manage the way that people act, they seem to be these headless beings, but they are. They act upon the group. They have causative power. And so they look like that's why there's something of a monstrous effect. And that's why these people. I'm going to have a conversation with them as well soon. But why they said maybe the term egregore is good for these types of manifestations, which are these, like a mob, for example, that they did swerving. And then people pop up. Like if you look at Tiananmen Square is a great example of this. When it was happening, you had this mob of people, and then all of a sudden a leader would pop up and then people kind of start to follow that leader for like an hour, and then someone else would scream somewhere else. And then people would just be moving from head to head and they couldn't find clear direction and really is like this. So it does have a kind of agency, but I mean you would say something like a demonic agency. It doesn't have a clear telos, let's."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":624.75,"end":750.67,"speaker":"John Vervaeke","text":"Say that's where I'd want to challenge it. I think I like the distinction and I now see how I would respond. I'd say if you want to reserve egregore to those things, those processes that are self organizing but are not autopoetic, then that is exactly where the boundary of agency is lost. Tornado is self organizing. And that to me is what's happening in Tiananmen Square. You're having a social tornado, but it is not autopoetic in that it does not self organize in order to seek out the conditions that produce, promote and protect its own existence. Whereas I take it that hyper agencies do. An example of a hyper agency that clearly does this is a bureaucracy. Bureaucracies in fact often become totally just self perpetuating entities that have been. They self organize for this telos. But the autopoetic element takes over and sometimes to horrific degrees. That's in Kafka. Right. So I'm now seeing a continuum. But to me the line where we ascribe agency is precisely the line of where the self organization has passed properly into being autopoetic. And when there is no evidence for autopoiesis, we should not ascribe agency. And when we can ascribe very sophisticated self organization, and if that's what people want to point to with the the term aggregor, then I think it's a good term for that phenomena and I'm willing to accept that correction. But for me, I'm interested in the capacity for reality to produce hyper agents because they to me have a significance for our understanding. We have always understood our agency in relationship to some kind of hyper agency. To me, I think that's part of your point, Jonathan. Right. Human beings have always understood ourselves in terms of hyper agents. And so I think the current discovery of hyper agency has a spiritual potential and significance that the discovery of just these social self organization does not have."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":751.07,"end":770.37,"speaker":"Jordan Hall","text":"Okay, let me throw something in that just came up and I'm not sure this is a good idea, but it occurs to me that to the degree to which this conversation has a capacity to be an embodiment or a manifestation of one of these kinds of beings, that would be the self referentially proper way to guide its directionality."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":770.53,"end":771.01,"speaker":"John Vervaeke","text":"Yes."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":771.09,"end":776.85,"speaker":"Jordan Hall","text":"What being is endeavoring to express itself to these particular humans? So we can take it as a applied experiment."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":776.93,"end":777.57,"speaker":"John Vervaeke","text":"Excellent."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":778.37,"end":796.18,"speaker":"Jordan Hall","text":"Something that I noticed that this particular one seems to have as a orientation is precision. And as you were talking about the distinction between a tornado and let's say something else, I wanted to get very, very close because that line is actually a very subtle line."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":796.42,"end":796.9,"speaker":"John Vervaeke","text":"Yes."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":797.06,"end":817.89,"speaker":"Jordan Hall","text":"If I zoom in at the edge of a tornado, there actually is a shift in the probability of Brownian motion at the event horizon of the causal structures of air molecules. That is what produces the autocatalytic characteristic."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":818.05,"end":818.53,"speaker":"John Vervaeke","text":"Yes."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":818.61,"end":831.49,"speaker":"Jordan Hall","text":"Distinction between autocatalytic and autopoetic is the fine point and I'd be interested to see if it's worth spending time trying to get down there. Although it is of course a tremendous rabbit hole and it may implicate the whole question."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":832.05,"end":915.82,"speaker":"John Vervaeke","text":"Well, I don't want to trespass on Jonathan, but since I think the question is directed towards me, for me, the autocatalytic, and this is of course what Kaufman says, it might be necessary, but it's not sufficient for life because an autocatalytic process is in some sense perpetuating itself, but it is nevertheless not seeking out the conditions that have to obtain. My evidence for that is tornadoes will move onto terrain that immediately destroys them. As Jonathan was saying, the self organization is starting to coalesce into, you know, something that might do something around this leader and then it shifts to this leader and then it shifts to this leader. Right. And so. Well, to my mind, there is not enough top down. And that's why I wanted to emphasize in the aggregor, I'll use that term now to refer to these social self organizations, if that's okay. There's not enough top down to attribute cognition. Because I take it that what we're trying to talk about, when we're talking about things like when we are invoking terms like spirit or what I try to invoke, like hyper agent, is we have something that has a capacity to not just self perpetuate, but to self promote and self protect. And that in that sense we want to sort of equally attribute cognition and something like a life to it."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":916.14,"end":981.17,"speaker":"Jonathan Pageau","text":"Okay, so me, the other thing I'd like to bring into this, what you're saying, John, is what would be the difference between, let's say, so we have the notion of a being that is properly organized towards the telos and structures itself hierarchically in a way that seems to give it agency. Then we have these momentary beings that kind of shift from one way to the other and don't seem to be able to do that. And then you have something, what I would call something like parasitic processes, let's say. I see that more easily within oh let's say the mobile. So the mob is a good example like at a social level. And that an addiction would be a good example at a personal level where you have a process that is self perpetuating, that has all the mechanisms to preserve itself. But then is. Can ultimately be the demise of the. The structure that holds it together can ultimately kind of break, can kill you. Like so you can have an addictive pattern within you that is doing all these things. But then it ultimately could, could act against the body that's holding it together."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":981.49,"end":1060.75,"speaker":"John Vervaeke","text":"It's funny, as you were saying that I immediately thought of parasitic processing. So I think I'm really catching your perspective, I hope. Yeah, I think the idea of something like a self organizing process that is parasitic but is nevertheless self destructive of what we might call it substrate. I'm trying to use tombs very neutrally here. Yeah, I think that's right. But since I coined the term with Leo, I guess I can speak to its provenance. The intent of parasitic processing is it's actually something that is destroying agency. That's one of its defining features. It insinuates itself into the agency of. Well, in the case we originally talking about, of an individual cognizer takes on a life of its own, but at the expense of the agency that it is dependent upon. And so for me, I think what that calls for then, I mean I feel what's happening is we're being called to like a continuum in the taxonomy. We've got aggregors and then we have hyper agents. And now there's this in between thing. To me it doesn't cross the line, the threshold into hyper agency because it's like an addiction. It's ultimately, it's a twist in the potential for agency that is being actualized as the self destruction of agency. If that makes any sense."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":1060.75,"end":1121.91,"speaker":"Jonathan Pageau","text":"Yeah, well, one of the reasons why I'm trying to bring that up is just because I'm also trying to account for the iconography. Let's say that is one of the reasons why demons are represented the way they are. Like if you look at the way demons are represented, they're always represented as hybrid monsters. That is they're represented in a way that they have no definite identity, but they can nonetheless act on you. And they act on you in a manner that wants to, like you said John, to destroy your agency, to destroy your, your being. Basically. They want, the humans ultimately want to feed off of you until you die. And so they're actually represented visually. If you look at the way they're represented in, in medieval art in a way that seems to represent this problem that we're talking about. So they're like, they're, they're egregors in a way, because they're like this mismatch of, of beings. You know, they're like a fish mixed with a human mixed with, you know, with the tail and all these weird things. But then it also is able to act upon you and in a way that's violent."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":1121.91,"end":1122.07,"speaker":"John Vervaeke","text":"Right?"}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":1122.07,"end":1125.51,"speaker":"Jonathan Pageau","text":"They're sticking forks with you. They're, they're, they're basically torturing you."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":1125.51,"end":1139.07,"speaker":"John Vervaeke","text":"Ultimately, I like where this is going. I like the. How we're getting this, this articulation of the continuum that is trying to be birthed in the taxonomy. I like this a lot."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":1140.36,"end":1220.5,"speaker":"Jordan Hall","text":"So let me throw some more parameters, or would you call that sort of like edges, shape one is something like closure thermodynamics, closed system, disconnection, separation, and in particular, something like the metaphor of death. So if I consider, for example, an animate body. Let's just go with a rabbit that's hopping about as a being, and then it's a dead rabbit. Something has happened, a discontinuity has occurred. The physical body and the components that made up that physical body are now subject to a completely different regime of dynamics. They've now become thermodynamic in characteristic. In fact, a more fundamental notion, I think of parasitic process, which is there's a gradient of possibility or a stored capacity that has been developed up by the organic being, which is now a feedstock for a completely different set of regimes that are in fact, in relationship with the rabbit, are in fact, bottoms up, they're bact and predators and parasites and whatnot that are going to decompose that stored energy which is living precisely in the gap between what was at one point a autopoetic process and is now transitioned. Okay, that's one, two. The confusion that arises when something of that sort. Let's just go with the bunny that died for a moment. Happens to be made up of human beings."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":1220.82,"end":1221.46,"speaker":"John Vervaeke","text":"Aha."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":1221.62,"end":1262.4,"speaker":"Jordan Hall","text":"The difference between a tornado and the mobile is the tornado. It was made up of air molecules. The affordance of air molecules for engaging in cognition in a meaningful way is quite small. Whereas the mob is made up of human beings. The affordance of human beings for engaging in cognition is relatively quite high. We may ascribe to the mob a level of cognition that is in fact not properly happening at the mob, but is what happens when something that was alive is now in this parasitic process dynamic, but its subcomponents are in fact fully functioning cognitive agents. That creates a little bit of a confusion about what's actually going on."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":1263.28,"end":1280,"speaker":"John Vervaeke","text":"I see. That's really interesting. That's really interesting. Yes. You're saying there's a great temptation for we have to be very careful of a category in a classical sense, a category of mistake of misapplying between the species and the genus. Yes."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":1280.08,"end":1377.41,"speaker":"Jordan Hall","text":"And if you take the notion of short term and long term or what's it called, global optimum and local optimum, and apply that against the choice making landscape of a cognitive agent. So let's go with a mobster. Effectively, what's happening when we refer to the notion of disconnection or separation is we're reducing the scope of self that is actually in the context of making choices. What had been a larger self, a greater being, is now made up of a very field of smaller selves that are making choices in the basis of a much smaller scope of capacity, which is they're oriented towards local optima because they're orienting towards local optima, they're in fact degrading the landscape that had included a global optima is the whole wholeness of the autopoetic beingness. But because these are in fact functional cognitive agents, there's a substantial amount of activity that's going on that looks in fact and in fact is cognition. So they're shaping the landscape in a potent way. So really looking closely at what's going on and inside that gap gives us a lot of insight. In fact, by the way, it may be like a 10,000 year long thermodynamic process that is constantly eating up the feedstock that emerges in the context of ordinary human. How humans come together into wholeness. And what is possible in the context of humanness as a source for parasitic process. And every time that source comes together, endeavors to reach a more whole basis, it actually provides a niche for this parasitic process. This goes back to your demons."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":1377.41,"end":1397.93,"speaker":"John Vervaeke","text":"I think that's brilliant. So if I hear you right, you're proposing that the demonic is actually a case where there's a degradation of the hyper agency into parasitic processing. And we can understand parasitic processing in terms of how it's undermining the cognition of the individual agents. Did I understand you correctly?"}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":1398.22,"end":1399.34,"speaker":"Jordan Hall","text":"Certainly a piece of it, yes."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":1399.74,"end":1403.98,"speaker":"John Vervaeke","text":"Well, if I'm missing an important. Please, please, please tell me something along."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":1403.98,"end":1438.87,"speaker":"Jordan Hall","text":"The lines of the. How do we say this? The notion of tornado. So the idea of there being a, an eddy or A standing wave or a strictly causal dynamic that provides a niche where this degradation process holds the relationship in kind of a medium. There's a. How do we say this? This is. I haven't quite got it. Like I can almost feel it. But there's something at the level of the top down and then the level of the bottom up and then the relationship that feels like it's all part of the context."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":1438.87,"end":1487.74,"speaker":"John Vervaeke","text":"Well, let me try something that was missing out of what I just said that I'm now hearing you say is. You were talking about like there's something like. My point was the aggregor is completely bottom up. Right. That's what I was arguing. And then we've got the demonic and what I heard you saying is the demonic is now a disproportionate relationship between the top down and the bottom up in which the balance that is found within the hyper agent is being lost. Because right. The top down is now in a self destructive process of undermining the individual cognition of the, of the component people. That's what I, that's what I heard you saying like. Like there's a top down. Instead of the balance between the top down and the bottom up there's a misalignment and the top down is now imposing and infecting the lower processes."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":1487.82,"end":1572.73,"speaker":"Jonathan Pageau","text":"So the idea would be something like let's say the system or the hyper agent is trying to be too. Is trying to fill up too much space is not leaving enough. Because you need a little messiness on the edge for things to work. And so if you're there not careful, it will create it or give the opportunity for these, give reason for these parasitic processes to kind of appear. But I don't see. I can kind of see it. I can see it. I can see it mythologically. Sorry, this is my problem. Like I think in storage. So I can see it mythologically which is that a good example is. You know in the Bible there are these laws about how to till your field. You till your field but you have to leave the corner of the field untilled and you have to leave that for the stranger. So you have to leave it for the processes that aren't part of your hyper agent. You could say you kind of have to leave a little bit of room on the edge for a buffer between. But if you're not careful with those corners they can start to impose themselves. If you try to till them too much then they come back like a revenge. They come back like. And if you leave them too big then they Also kind of, they tend to want to eat your system. I don't know if that makes sense. Like you have to be careful because no hyper agent can fill up all of its. Like the world isn't. The world has all this chaos on the edge. So you can't fill up the world with the system. It will always leave a remainder."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":1573.21,"end":1613.63,"speaker":"John Vervaeke","text":"So the way that's coming to mind, first of all what came to mind is Kafka. Precisely. Because what happens in the bureaucracy is it becomes a parasitic process that drains sovereignty and individual cognition away. That's the horror of the Kafka ass. So bureaucracies are, this is Max Weber, they're supposed to be bottom up error signal and then top down prediction sort of mimicking aspects. But what happens is you get the bureaucracy just being the top down discharging of blame and not any upward tick of error correction. And you get the horror because the line of communication has just become unidirectional. Yeah."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":1613.87,"end":1623.31,"speaker":"Jonathan Pageau","text":"And a bureaucracy that's too strong will produce corruption. It will necessarily produce corruption. That's what happens in a bureaucracy that is too pervasive."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":1623.71,"end":1706.18,"speaker":"John Vervaeke","text":"Exactly. And so what comes to mind is Kars idea where the hyper agent is oriented towards the infinite game. Right. Whereas the parasitic process is engaged in a finite kind of game. Because what it's trying to do is get some sort of final closure to. Right. Because. Because it's. I'm sorry, I'm stumbling here but because it's parasitic, because it's self destructive, it can't be an infinite game player. Do you get what I'm trying to get at? It can't. Whereas leaving the corners of the field is that there's going to be stuff beyond the game and we're going to have to. One of the things we have to do as we play the game is change the rules by how which we play the game. Because it'll be the stranger. Right? That's the game. Right. But the finite game says no, no, no, that's the top down bureaucracy. We can encompass this completely. And when you look at parasitic processing within individuals, what's typically happening is reciprocal narrowing until they get to like. It can't be any other way than this. It can't be any other way than this. Sorry, I'm just trying to like rock what you said. But I got a powerful sense of, right. That there's an inability of parasitic processing. The demonic, I mean but this, this is, you know, this Jonathan, this is like Dionysus. Evil is ultimately totally parasitic on the good. Right. It pretends to help itself existence, but it can't actually play the infinite game."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":1706.26,"end":1738.76,"speaker":"Jonathan Pageau","text":"So you. But if you think, think of it like in a person in terms of let's say a fast binge pattern, right. Where someone is on a diet. A diet binge pattern where someone tries to make, create a top down pattern of being in themselves. Where they're, they're like I'm going to lose weight, I'm going to do this, I'm. That they make it so strict that the opposite happens because a parasitic process sets itself up. Then you find yourself at two in the morning eating a tub of ice cream. And it's like that is. And you know it's destroying you, but it's like there's something else taking over your will. Yeah."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":1738.92,"end":1761.72,"speaker":"John Vervaeke","text":"Because what's happened is instead of a dynamic right between bottom up and top down, you're getting a vacillation. You get the top down, right. The Kafka esque. And then you get the bottom up explosion of impulsivity. That's the binging. I lose all agency. And then I. Right, and, and you're getting that going back. And that's typically what's happening in parasitic processing."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":1762.44,"end":1887.12,"speaker":"Jordan Hall","text":"So it comes up for me there. And so I'm noticing two things. One is symbolically I heard John reference the notion of changing the game. And so that landed for me was perhaps a orientation or an invitation to shift the game that we were engaging in. And I noticed that I felt something, how do I say? Strong perhaps or certain clarity when Jonathan was orienting us in the direction of the mythological. Part of the invitation, I would say is to shift more into a mythological poetic, artistic, religious, mystic mode. Okay. The other one that came up as I was myself doing that was I was. The word golem came in and it spoke to something like there's a kind of part in humans, we might call this the mind or the ego that has as one of its characteristics both a capacity and in some sense a propensity to take itself as the whole. So this is that thing where you don't actually have relationship with proper relationship with wholeness. And I'm wondering if this is that delicate balance of the four cornered field, the Scylla and Charybdis on either side of that very delicate balance. But actually it takes itself and presents itself as representing the whole. But in fact it certainly can't. And this is what gets you in real trouble. That feels like the two sides of the coin. One side of the coin is the real actuality of the lived delicate balance. Of relationship with the actual lived whole and particular. I'm not sure if this is a commonplace thing. I think it may in fact be a precisely human thing, but we'll see the challenge or the risk of a particular aspect of human wholes. Again, I'll say things like mind and ego that will endeavor to present themselves as in fact actually being a whole and therefore get in the way. And this is that sort of mob problem, like the demonic capacity, something like that. So there's a bunch of things there that maybe we can play with."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":1887.36,"end":1956.04,"speaker":"Jonathan Pageau","text":"Well, there's definitely, let's say in the image of the demonic hierarchy, you have the devil as being, as pride being the sin of the devil. That is definitely there. The idea is that what the, the devil says is, I am, I am God, right? I am God. And so comes into conflict with the whole because he wants to be the totality of all things in himself, let's say, and not participate in something bigger than him. And that is what leads to the two. So in terms of what we're talking about, in terms of the flip between one side and the other, Saint Maximus the confessor talks about sins of the right hand and sins of the left hand. And he says the first sin is always the sin of the right hand, that is its pride, self sufficiency, all of these types of sins. And then those secretly lead to sins of the left hand, which are, you know, passions falling apart, you know, you know, all these thoughts that you can't control. And so you have this movement from one to the other. But it is rooted in the idea of not, let's say, a being, not participating in a greater whole, but wanting to just exist as itself, like as this kind of self perpetuating thing."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":1956.28,"end":2048.63,"speaker":"John Vervaeke","text":"So that I think this is a good move because participating, like what's the participatory relationship? Right? And so, you know, Levinas makes the famous distinction between totality, which is what the bureaucracy is trying to do, or what the passion is trying to do also, and infinity and right. And so the totality is the idea that this can be, this can be grasped, this be closed upon, right? Whereas the living thing has the proper relationship to infinity in the sense that the living thing has a capacity for evolution that the parasitic processing thing doesn't have. Right? Like this. This is the sense I'm getting, in fact from Maximus. I'm reading him right now. I'll use mythological language as Jordan invited us. If God was to completely remove. He can't, I get it. But if he were right and the Demons were allowed to run completely free. They would disappear in an instant. Right. Because they would reciprocally narrow to nothing. They don't actually, they do not have a. In fact, the defining feature of them, I would put it to you, is they're incapable of evolution. They're incapable of. Right. That movement that is constitutive of life, which is the participation in infinity without ever claiming to have a totality. And so the thing I see in the mob is exactly that feature. It may be self perpetuating and so therefore it's different than the pure egregore, but it can't evolve. Or I would put it this way, if it starts to evolve, it precisely ceases being a mob and becomes a proper hyper agent."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":2048.94,"end":2049.06,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":2049.06,"end":2059.9,"speaker":"Jordan Hall","text":"And just to hold that little piece right there is that. There's a. That thing I brought in earlier about the fact that we don't want to be confused. So the mob, we have a very, very nice term actually. There's a distinction between evolution and development."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":2060.46,"end":2061.18,"speaker":"John Vervaeke","text":"Yes, yes."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":2061.26,"end":2067.18,"speaker":"Jordan Hall","text":"Development is the exploration of a potential that is already present in a closed domain."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":2067.42,"end":2068.3,"speaker":"John Vervaeke","text":"Yes, yes."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":2068.54,"end":2084.24,"speaker":"Jordan Hall","text":"So the mob in fact can develop meaning. It has a period of time whereby it can in fact expose a novelty that was already imparted into the reality that it was. That it was at the moment of its being. Y actually being connected to a wholeness and therefore is incapable of evolution. Right."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":2084.24,"end":2086.4,"speaker":"John Vervaeke","text":"Yes, yes. Yeah."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":2086.4,"end":2086.84,"speaker":"Jordan Hall","text":"Okay."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":2086.92,"end":2125.16,"speaker":"John Vervaeke","text":"Jonathan, doesn't this resonate, I mean, at least in some deep ways? I mean, like I said, I'm doing lecture Divine on both Dionysus and Maximus right now and. That's right. And I'm in sections both where they're wrestling with. Right. The existence of evil. And they're both making the argument that, you know, evil is kind of pure self destructiveness and like Jordan says, it has a capacity for development because it's not completely self existent, although it pretends to be. Yeah, right. But if it was to. If it was completely unconstrained by the love of God, it wouldn't. It wouldn't. It would actually like completely self destruct. Like I don't think I'm imposing that on them when I'm."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":2125.16,"end":2126.36,"speaker":"Jonathan Pageau","text":"No, no, no, I think you're right."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":2126.52,"end":2126.96,"speaker":"John Vervaeke","text":"Yeah."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":2126.96,"end":2168.15,"speaker":"Jonathan Pageau","text":"So a good. I think so. The way that I like to think about it so would be something like the constitutive elements of an egregore. Let's say there are these parasitic patterns, parasitic structures, but they could have the possibility of being more than what they are. It's just that they aren't they're self, they're looking at themselves. And it's called devolving because of that. So an addiction is a good example. So every addiction is based on a true desire which could lead you into something more. But because it closes itself off and then, then acts as this weird self existent being, then it, then it becomes parasitical and tends to destroy the higher agent."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":2168.31,"end":2179.67,"speaker":"Jordan Hall","text":"So now we have to bring in the notion of selling your soul. The addiction captures the actual vitality of a living being."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":2180.07,"end":2180.55,"speaker":"John Vervaeke","text":"Yes."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":2180.63,"end":2229.76,"speaker":"Jordan Hall","text":"And it enslaves it whips right. It drives that living being. It actually will extinguish it. But in the meantime it will actually tap into whatever degree of evolution that living being actually still has left in it. If you imagine your classic let's go with Jim Morrison, somebody who I have a connection with a vital genius connected to wholeness in a particular way and ridden by a demon that pushed the being into a self destructive local optima extraction of what was available in terms of a short term burning brightness that generated an energetic flow of capacity that was extracted by the demon until of course the underlying host died, at which point the demon also evaporates or in this case has to find a new host."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":2229.76,"end":2231.36,"speaker":"Jonathan Pageau","text":"Find a new host. Yeah."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":2232.72,"end":2239.98,"speaker":"Jordan Hall","text":"And many of us may in fact be associated with that. So there's a very interesting. Now we get into a very interesting place to begin exploring what that looks like."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":2241.81,"end":2268.98,"speaker":"Jonathan Pageau","text":"But I think you're right. The idea of selling your soul is. That's exactly what it is. It's like, I mean you could say that every time that you see a good in itself or that you try to attach yourself to a good in itself that isn't leading you to better higher goods, that isn't placing you in a system of higher goods. Let's say then you are somewhat selling your soul or you're letting your soul be captured by something which will feed off of it."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":2269.06,"end":2272.9,"speaker":"Jordan Hall","text":"Anything. Anytime you profane the sacred, you're selling your soul."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":2272.98,"end":2319.51,"speaker":"Jonathan Pageau","text":"Yeah. And so you can understand like it's a country, for example, could have that, that problem where they get caught up in one specific aspect of what it is to be a country and then they kind of revolve around that and then it captures the soul of the country. So. And then it ends up, it can end up just devouring it. I think you saw that in communist countries and I think you probably see it now. Let's say in America you can see how entertainment has become, let's say this massive weird parasitic thing that is devouring everybody's attention and is in some way blinding them to higher goods in which they can participate. It's kind of capturing the soul of even a country. And there are different forms of that, I think."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":2320.15,"end":2436.32,"speaker":"John Vervaeke","text":"So is the demonic in this sense? Sorry, you two can keep exploring the mythological. I'll try and play that game. But I keep coming back to the biological. Maybe we're trying to actually get bios and mythos and logos to talk to each other here, but the metaphor that's coming to mind for these kinds of things is like a virus, although viruses can evolve. So that's where the analogy breaks down. But I'm trying to get almost something like a computer virus is what I want that can infect and spread and replicate, but it's completely dependent. It's asymmetrically dependent, but it can't ever become a bona fide program that does anything useful in the world I'm trying to get at. The reason I bring it up is because there's a real debate, and I don't mean just academics doing their typical hairsplitting. There's a real debate about whether or not viruses have agency. That's why I'm bringing up that as the analogy, because. And there's a real debate about whether or not they're actually alive precisely because they. They're sitting on that boundary. Right. They sit right on this gray line between agency and non agency and between living and non living. And I feel like we're wrestling with a deeply analogous problem with the demonic or whatever we want to call this meddling thing is. Right. Is it perhaps also that. Because for me, the notion of hyper agency, I think, is very well developed, and I think the notion of aggregation is very well developed. You can use cybernetic systems, et cetera, et cetera. Right. But this intermediary thing, it seems like it's difficult for us precisely because it's falling between the living and the non living, the agentic and the non agentic. Like a virus. Right. And I'm just wondering if we're struggling because we are bringing categories to bear on it that it definitionally eludes. Right. Like I'm just."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":2436.56,"end":2442.8,"speaker":"Jonathan Pageau","text":"No, I think. I think. I think you're right. But I think that your understanding of in between is extremely important."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":2443.44,"end":2443.84,"speaker":"John Vervaeke","text":"Right."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":2443.84,"end":2494.74,"speaker":"Jonathan Pageau","text":"And if I. If I bring about the image of the chimera, like the way that the chimera is represented, the demon is represented as a chimera. And so this is the in between space. This is the problem of the in between space, the problem of transitions. Right. All this all this issue. And so I think that this is what the virus represents. By the way, John, you know that Jacques Derrida in a famous interview said that everything that he's ever done is about a virus. Everything that he's ever done is about virology because exactly of that point, which is that the virus is a. The virus is a living dead. It's like a zombie in a way, like this in between character. Because we. And then when we focus on, tends to deconstruct the identities. It tends to actually kind of devour parasitically the different identity that it's attached to."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":2495.06,"end":2515.94,"speaker":"John Vervaeke","text":"Yes, yes, I've forgotten that. Thank you for reminding me. I was thinking of Burroughs. That language is a virus from outer space I was thinking of. Which was, I guess is very Derridian also. But thank you for that. Yeah, I did know that, but I had forgotten that. That's a fantastic remembering. Yes, there is."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":2515.94,"end":2584.46,"speaker":"Jonathan Pageau","text":"So I think that one of the reasons why we're seeing this now is that on the one hand we have a system, let's say a system of control, that control of information, which is the Internet, which is also the states moving into things like digital identity and digital control. So we have these systems happening so we can notice this top down thing that is coming down strong. But at the same time we also have this deconstructive mode in the culture. This idea of destroying, of breaking down identities of these parasitic behaviors. And so I think that those two extremes happening at the same time are possibly the thing that is making people able to perceive these hyper agents again, which, because you can see they're pressing down on us, we can kind of see it happening in a way that, because you think like who controls Twitter, for example, it's like, well, no one actually controls Twitter. They get taken up by these ideological things that come back down. But you couldn't point to one person and say this person controls, let's say, the narrative right now. It's happening organically for sure."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":2584.78,"end":2603.84,"speaker":"John Vervaeke","text":"But that was always the case to my point. Language is a virus from outer space. That was always the case for language. Nobody controls it, nobody runs it, there's nobody in charge of it yet. But it evolves and it changes and it has a life of its own in powerful ways. We are all asymmetrically dependent on the languages that we know in powerful ways."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":2604.56,"end":2706.52,"speaker":"Jordan Hall","text":"I think the point Jonathan's making is something like, because we're in a moment where a whole category of hyper agents are in the process of dying inelegantly, it's Easier to notice that that's what's happening. The bunny is no longer just sort of maybe it's no longer maybe sleeping. The rot has set in quite significantly. There's a certain stench and a certain awareness that if you touched it, maybe something bad would happen to you. You don't want to eat it anymore. It's definitely not a healthy thing to be connected with. Simultaneously, the game is afoot to see what new kinds of hyper agents might want to step in and integrate us so neatly into their body. And so both the sort of decaying dead body of the hyper agents of the past sort of collapsing Titanic like into the ocean and maybe pulling us down with them is present very viscerally as are all the various kinds of the previous simplicities of the ways that you would go about solving basic problems in life, like going to the grocery store are no longer obvious and simple. And so, oh, I have to think about it, what's happening. Oh, and it kind of pushes the mind into a greater and greater awareness of what's happening. And because this novelty is there, there's both an awareness of the moment of geez, if we don't make some of us, we don't make choices in a certain direction, then we will be brought into a new kind of thing, probably kicking and screaming. And also, well, now's the time if we would like to have something be slightly different. You couldn't have done it in 1977, there's no chance of that. But now you can, because the space of transition is upon us, that kind of thing. So I think those are bringing into the surface this awareness and the mythopoetic is activating it within us. Say hey guys, this is sort of one of those times."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":2706.84,"end":2812.15,"speaker":"John Vervaeke","text":"I agree with that. I think that's a good point. So thank you for that. I guess I would want to say. I would. The point I was trying to bring out, I think is then needs to be brought into proper relation, which is. I wanted to indicate that it has always been the case that there have been things that nobody's in charge of, language, culture, et cetera, et cetera. And that we have lost a cognitive cultural grammar in order to talk about them. That is also part of the problem. I agree with you, Jordan, you know I do. That we are now in a time of accelerating rate of complexification. I like this almost mythological idea of hyper agents becoming zombies. This is a term actually used of certain distributed cognitive systems, the zombies in between the viral entities and they're infecting us. And that makes us aware of them. But I also think we've lost a way of talking and thinking and conceiving of hyper agents that is also part of the problem. I think that for many people, and this is no backhanded criticism to Jonathan, who I consider an important friend, but for many people, they are not willing to take up the ancient language, the ancient languages. I keep coming back to language as a metaphor here, ancient languages by which these hyper agents were properly related to and lived with, if I can put and lived through. And so I don't deny everything you said that there's something happening here, but I also think there is also an impoverishment on our side of our capacity to enter into a proper receptivity of these entities that is also making everything much worse. Sorry, that ended it very well."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":2812.31,"end":2818.15,"speaker":"Jordan Hall","text":"If I wanted to monopolize the game of hyper agency, then I would impoverish the language of humanity."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":2818.47,"end":2821.15,"speaker":"John Vervaeke","text":"Yes, yes, yes. Yeah."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":2821.15,"end":2851.57,"speaker":"Jonathan Pageau","text":"And there's also something which I think is happening which is also part of this, which is that as we notice, I mean, let's be honest, like as we watch Christianity die, let's say one of the things that's happening is that there, it's leave, it's giving the space for these competing hyper agents to appear like Jordan was talking about. Basically you have all these beings rushing in and now fighting amongst each other to figure out who's going to take over."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":2852.85,"end":2855.33,"speaker":"John Vervaeke","text":"Aren't they all often just zombie Christianities?"}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":2855.75,"end":2979.68,"speaker":"Jonathan Pageau","text":"Yeah, that's right. Well that's what I think that what I was coming to is the idea of Antichrist. Like I, I think that this is something, it seems like Christians had perceived at the outset that the idea that in the moment of its death or in the moment that Christianity would, would, would fall apart, like there would be this spirit of Antichrist which would appear, which would be a strange remainder, a strange parasitic version of Christianity that would, that would appear and would kind of take over the space. And so even if you look at the like weird neo pagan type things that are coming in, they're all framed as strangely anti Christian at the same time, you know, so you, at least in the west for sure, I mean, I don't know about another place, but in the west this is what seems to be happening. But then now the thing is that now these small little beings are appearing and manifesting themselves and people are noticing them. And the fact that a lot of people haven't noticed these beings before, let's say, means that now they're fascinated by them. Like they're fascinated by them. Like, I even like, I think the whole psychedelic thing, a lot of it has to do with that. It's like people, they, they, they take these psychedelics, they encounter these intelligences and they become fascinated. No matter what it is that they encounter, they have no way to. They don't discern these beings that they're encountering. They just encounter them. And there seems to be something of that going on which is like, if I can have people join these little weird subcultural groups and become extremely passionate about it, because they are looking for hyper agency. They're looking for ways to participate in common stories and in common. But there is no way for it to. They all appear these parasitic things and they're all devouring people's attention and, and whether it be like Star Wars, Jedi culture or crazy political activism, like all of it is the same. It's like these little parasitic processes that are taking up people's attention and driving them towards separation, at least like social division. For sure."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":2979.92,"end":3228.28,"speaker":"Jordan Hall","text":"We should throw Baudrillard into the mix. We brought his buddy Jacques in. We might as well bring in Baudrillard. We talk about simulations, simulations in simulacra. Right. But I would like to point out maybe two things to help expand. One is, yeah, I'll say it's actually two parts to the same thing. I don't know that we are really properly in relationship with the degree to which humans have been living in these sort of dead, decaying, no longer wholesome contexts. I would say something like. And I'm going to make this proposal, I would say something like 98%, 95, 85% of all of history has been the history of human beings being in this game of being like in the mob, meaning the thing. They are not living a living whole being system. They are in fact participating in the development, the exploration of the sort of extraction of the decaying body of something that they're part of, which lasts hundreds or thousands of years at an arc. So we've been living in a period of momentary eruptions of I think, guess the word probably is properly spirit in some very specific sense, which then provides a temporary, of course, in a human arc, hundreds of years or thousands of years temporary sort of body to be slowly decayed. And that as a consequence we actually get very confused. We mistake the game of playing mob mobster for the game of actually being in connection with wholesome reality. Because our metaphors and our references are still pulling examples of the same thing, just maybe at a larger scope or a different period. Of its death. And here I'll call out specifically two guys who I've got a lot of reference to. One is Carol Quigley, another is Peter Turchin, who talk about the rise and fall of civilizations. And Quigley, I think, did the best job because of the period of time when he was writing, which was when a civilization is born. Let's go with Rome on the Palatine Hills, just barely pushing back against the Celtic invasion. There's a point at which a certain kind of, let's say, codes or generator function, a moment of evolution, occurs in a period of absolute crisis. This then creates what he called the expansive principle, that once that is born, there's almost like the whole story of Rome for a thousand years is locked in. At that point you have this arc through which it deploys, it develops, it explores the space that is born more or less in a generation, and it expands to the degree to which that expansive principle gives it power, the ability to extract power and concentrate it on itself. It just expands. And of course, it explores the edges and the fringes because it's using human beings as cognitive agents, and it becomes a sort of demonic principle, expanding on the backs of those who are brought in more and more and more into the body of Rome. I'm noticing that as a really interesting metaphor or mythopoetic Babylon, right? But it's already dead. There's a point at which it will appear, by the way. Quigley very specifically says, when you think you're in a golden age, you're actually at the point at which you're eating the seed, that you're consuming the last vital energy. And then by the time you realize you're in the decline, the civilization is actually passed into the point of its inevitable death. It just may take a while, depending on how much it can continue to consume, how much can it eat, how much energy was contained within the reservoir that it stayed. And so if we imagine that that's the story, it's only actually at the edges. It's only in moments of true gathering when, geez, when spirit is present, that the upwelling comes. But for the most part, for the whole of civilization, we've actually been living in dead things. And we've built the mindset of parasitism so deeply into our grammar, into our sensibilities, that we're going to have to be extremely careful not to take a simulation of something that seems like a really good copy of the real thing as the real thing."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":3228.6,"end":3235.27,"speaker":"John Vervaeke","text":"So you've got a version of the fall to speak mythologically Right."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":3236.23,"end":3292.86,"speaker":"Jonathan Pageau","text":"So. But the thing, the question is. So. So Jordan Peterson, the way that he talks about it, he says. He says something like, you're right. That's how it works. But the only way to do it is to go down into the belly of the whale and resurrect your father. Because the problem with the way you're saying, the way that you're saying it is that you can't manufacture the kairos moment that will cause the monumental change. You can't manufacture the moment of expansion. You can't make it up. It's something which kind of. Which happens in a revelation, you could say. And so until that revelation happens, it seems like even though maybe what you're saying is right, the only thing to do is to try to breathe life into the forms that have been given to you. Because. Or else what?"}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":3292.94,"end":3293.74,"speaker":"Jordan Hall","text":"I disagree."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":3294.7,"end":3304.38,"speaker":"Jonathan Pageau","text":"Or else you have all these, like, 60s, like, cults. Like, you have all these weird. You have all these, like, little. Definitely a bad idea, you know, so. So what. What else then?"}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":3304.54,"end":3305.42,"speaker":"Jordan Hall","text":"All right, you ready?"}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":3305.58,"end":3306.34,"speaker":"Jonathan Pageau","text":"Yeah, go for it."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":3306.34,"end":3323.76,"speaker":"Jordan Hall","text":"Jordan. This is fresh or not fresh. It's ancient. So I was really thinking about this after reading that essay that was the sort of the precursor of this conversation. And I was sort of sitting with what may Pagio's point of view on the top down. Emanation, I believe, is the term you use."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":3323.84,"end":3324.32,"speaker":"John Vervaeke","text":"Yeah."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":3326.64,"end":3383.41,"speaker":"Jordan Hall","text":"And the theme that kept coming up for me was a question of creation and the notion of the moment of creation. And I couldn't help but continually find myself in a circumstance where I was finding. Taking the perspective. It just showed it for me as obvious that the moment of creation is omnipresent. It is not operating in what would be Kronos. It's not operating in time as we understand it in that fashion. And so the possibility of kairos is always present. One does not manufacture kairos by any stretch of the imagination, but one becomes affordant to the possibility of perceiving and playing with the kairos that is always present for what it is, where what it is. Right. And that is sort of the beginning and the end of the story. So you certainly definitely don't try to create a cult. Right. But beyond comprehension, a terrible idea. But simply dancing with the presence of the kairos that is always present is the only ethical, only proper thing to do anyway."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":3383.65,"end":3471.27,"speaker":"Jonathan Pageau","text":"No, but I agree with you. That is, I agree in the sense that I agree that. So the way that I would say, say it is that the only thing you can do is become a saint, like that's actually the only thing you can do. The only thing you can do is transform your passions, transform yourself, transform your life, and that then you will become in a way that Christ says, you know, become a tree and then the bird will land in your branches. But that has to happen. And so I agree, but there are different levels of that. Like there are different levels of kairos. Let's say I can play that role, but I'm not going to start a new religion, right? I can play that role within the story that has been given to me and I'm not going. And so even, let's say, even if you take for example, Christ, he's not making a new thing up, you know, what he's doing is he is coming into the Judaic tradition. And then if you believe what he was and what he said, he's basically breathing life back into it and showing us the brightness of what was there. Like kind of giving life to something which was given to him. And so I think that that's the only thing we can do at each of our levels. Like, I think it's the same even with Buddha. Like Buddha didn't make something up like he was coming into an ascetic tradition. He looked at the different ascetics and he gathered that in and then he transformed it or represented it in a way which was full, let's say."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":3472.15,"end":3523.33,"speaker":"John Vervaeke","text":"Well, I want to respond to that. I mean, Christianity isn't Judaism and Buddhism isn't Hinduism, right? So there is something that's going on there. I agree with you, we shouldn't be making a religion. But I'm wondering about part of Morton's point about hyper objects is that they force us into a kairos, right? I do think the kairos is upon us. And I thought both of you were saying that earlier. There's a sense in which we know that something is changing here because all of these entities are now. The plausibility of the existence of these entities is now prominent where it was not 20 or even 15 years ago. That seems to me to be an important marker about the fundamental levels of our ontology. So I do think the kairos is."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":3523.33,"end":3526.89,"speaker":"Jonathan Pageau","text":"Upon us, but we're not going to direct it. Like I don't think. No, no, we can't."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":3528.17,"end":3724.22,"speaker":"John Vervaeke","text":"But I agree, I agree not trying to direct it. That is exactly to confuse. That is exactly to think it's all top down. Neither are we just supposed to passively wait. That's just we have to figure out the proper proportional participation. And that's what I Mean by Right. I don't know if we have the language for that right now, for the concepts of it. So one of the things we can do is. I agree with you, Jordan. I don't disagree with, you know, we've been playing the sort of the extraction model of civilization and we can't do that anymore. We're at another kairos, which is we're global and we can't just have an extraction mentality. So two things are pushing on us. We have the advent of the reality of the parasitic entities and the hyper agents. And we have the fact that civilization now encompasses the globe, which it never had before. And so there's no outside. We can't extract and move on. We can't wait. Right. And so for me, I want to sort of bring it back around to what is it for us to enter into proper relationship with these hyper agents and these parasitic agents? I mean, there's a biblical truth here. I thought, yes, we don't direct the kairos, but our decisions matter to the kairos. Sure, right. And so how can we virtuously and with virtuosity participate in the largely virtual medium in which the kairos is presenting itself so that we can discover the proper relationship to the emerging ontology? If I can put it that way, that, to me is the question. Like I am interested as a scientist in all of these ontological questions. But what comes back to me is, and I think this is what Jordan is saying, and I think maybe you're saying it too, Jonathan. We're at a kairos. The kairos is upon us. And yes, and I get it, the historical kairos is situated against the eternal kairos. But that's exactly just to put the question is how do I enter into a proper relationship to this emerging ontology so that I can have some trust that I'm being virtuous in relationship to it? I mean, the problem with, I mean, now going to dynamical systems when they're in criticality, right? Small differences matter in the way that they never mattered before. Very small differences, like when civilization sort of rumbling along, the chances that anything you or I do can make any difference are very small. But when a system becomes hypercritical like it is now, in both senses of the word, by the way, small actions can have huge differences. So I feel a tremendous responsibility. And the question that comes from me is, okay, but how can I exercise virtuosity grounded in virtue about this? Because for me, Jordan, that's the way of stepping out of the all too human repetition of the extractor function of civilization and trying to get to something more primordial."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":3726.74,"end":3789.4,"speaker":"Jordan Hall","text":"There's a lot that just happened there. A number of different things. Let's see. One, I would say the first thing that popped out very sharply for me was this phrase did not make something up. I think this is quite important to really focus on that. That phrase like to make something up. For me, it speaks to that notion of golem, it speaks to that notion of simulation to be sure it did not make something up. And I would say even more powerfully, to make something up is precisely this mistake of mind taking itself to be the whole. So category error. Don't do that ever. Bad idea. So then it's like, what does it mean to simply be kind of making choices or to act in right relationship with the Kairos in some sense? That's all there is to it. So that's all we're talking about. What does it mean to simply make proper choices in the context of making proper choices? And so to express the logos with humility and integrity is very different than to make something up."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":3789.56,"end":3792.04,"speaker":"John Vervaeke","text":"Yeah, yes, yes, yes."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":3792.92,"end":3793.72,"speaker":"Jonathan Pageau","text":"Quite the."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":3793.72,"end":3864.78,"speaker":"Jordan Hall","text":"I would say opposite, but not even the word opposite. It's not the proper. It creates the wrong frame. It's not. The word opposite isn't even part of the story. And if we think about the. If we think about the magnitude of the notion of creation itself in relationship with the epiphenomenon of human civilization, that which is possible in the context of simply expressing the logos properly in Kairos is not a historical event. We can't sort of measure it against historical events. That's nonsense. It's like saying you can't stack two grains of sand upon the other. All that has happened in the long arc of human history is as nothing in relationship to the potential that is embedded in the creation itself. So to the degree to which even a small number of people come to a capacity to speak the logos or express the logos with integrity and humility, then we literally have no possibility of understanding exactly what might follow, nor should we endeavor to do so. Ours is not to understand it, ours is simply to endeavor to do it as well as we can. Again, with tremendous humility. That's what came for me in response to that last little bit."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":3865.09,"end":3902.51,"speaker":"Jonathan Pageau","text":"I mean, I think your point is very powerful. And I think that it talks about this idea too, of the seed. You know, this image, for example, of the Ark is a good one, because you think, you know, the ark, Noah's Ark, is just this little dot in an ocean of Breakdown and chaos and everything falling apart. But that's it. Like, that's all we can do is to, let's say, manifest the seed and then that will grow with time as the shift happens. Then it really is, in a way the only thing we can do."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":3903.39,"end":3957.81,"speaker":"John Vervaeke","text":"Right, Okay, I get that, but I still want to press the Socratic point, which is the virtuosity and virtue of the logos in relationship to the hyper agents. These are virtues and virtuosities that we are not properly explicating and cultivating right now in our culture. Right. Like, here's the emerging ontology. This is reality saying, I'm going to break into everything you thought you made. That's what's happening, right? That's what the hyper objects and the parasitic entities are doing. And I like this idea that they're degradations of the hyper agents, the in between. I think that's beautiful. But then, okay, how do I ex. How do I not exercise? That's the wrong word. How do I participate in the virtuosity and virtue of logos with these aspects of my ontology, given that they are eruptions into what has been a stable on top? The ontology is being state destabilized."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":3957.81,"end":3958.05,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":3958.05,"end":4022.64,"speaker":"John Vervaeke","text":"Etc. Right. And so, you know, this comes up. It comes up for me in my practices. Yeah, right. Like how? What is it like? Or what is it like to exercise? I keep saying exercise to practice. That's the word I want to practice the participation of the virtuosity and the virtues of logos with respect to the emerging aspects of the ontology. That to me, like I say, this is not an abstract problem. This comes up for me, Alexio Divina in Philosophical fellowship. This comes up for me in dialectic into dialogos. And that's what I think I want. Like, sorry, I'm getting too passionate, but that's the part that I really want to bring into prominence. We have a kind of. You might not agree with me on this, Jonathan, but to my mind, it looks like we have a profound ignorance about this. And first of all, we have to admit the ignorance. That's Socrates. And then secondly, how are we going to respond to it? How are we going to respond? I'll stop."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":4026.85,"end":4053.17,"speaker":"Jonathan Pageau","text":"So, I mean, I think that the surprise is maybe that in this world of kind of breakdown, one of the problems that happens is that the person who's trying to humbly express logos will appear as a thorn at first and then might not make it. I don't know what to say. Might not make it. You know, Might just be there to plant the seed and might not make it into the Holy Land, you know."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":4053.59,"end":4053.95,"speaker":"John Vervaeke","text":"Well said."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":4053.95,"end":4067.83,"speaker":"Jordan Hall","text":"Oh, yeah. Well, I would say that this is. This is a very. How would I say. Yes. In fact, it seems quite likely that making it to the whole land is not part of the. Not part of the gig, not part of the plan. And that's okay."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":4067.91,"end":4068.79,"speaker":"Jonathan Pageau","text":"That's okay."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":4072.07,"end":4080.06,"speaker":"Jordan Hall","text":"So this is another. Okay. I think I feel that what was happening earlier more clearly. Okay. Not make something up."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":4080.53,"end":4080.85,"speaker":"John Vervaeke","text":"Yes."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":4081.01,"end":4105.49,"speaker":"Jordan Hall","text":"Which is to say something like, what is. What is real? Being in relationship with what is real. Right. One is not creating, one is not the Creator. One is being in relationship with what is real, and one is allowing the creation to flow through. So there's maybe two or three. There's several moves that come up that seem to be proper. One which is clearly incredibly challenging is merely perceiving reality for what it is."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":4106.06,"end":4106.46,"speaker":"John Vervaeke","text":"Okay."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":4106.46,"end":4122.3,"speaker":"Jordan Hall","text":"Yeah. So where I want to go with that, and I'll say a little bit more, but I want to hold this because this is what feels like the most meaningful at this moment, is the nature of reality, which is transcendent. Which is to say that there is a. This is very much connected to Jonathan. I think some of the things that were in that essay. Not words."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":4122.62,"end":4123.1,"speaker":"John Vervaeke","text":"Yeah."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":4123.26,"end":4128.94,"speaker":"Jordan Hall","text":"That which is. Is not that which we can say. And yet it is not without order."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":4129.34,"end":4129.66,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":4129.66,"end":4161.18,"speaker":"Jordan Hall","text":"There is a sort of necessity or a proper order to being, which is intrinsic to being, and that we can discern. And this, of course, is invariant under transformation, to use a contemporary geometric language, and provides a ground against which we can orient our choices, regardless of the fact of chaos in the larger sort of actual human context. So that's a big piece of. Maybe it's the only piece."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":4161.5,"end":4205.18,"speaker":"Jonathan Pageau","text":"You're right. You're so right. Because one of the things that happens when you orient yourself properly in a world of chaos is that it really does. It shines brighter, actually, probably, than in a world where all things are going their own way. And so it actually can really act as a transformative agent for good and ill. Like, people will hate you and then some people will love you. But it can't. I mean, a good example would be that if you're in a corrupt world and you decide you're going to tell the truth, you will have an effect. There's no way around it. They might kill you, they might get rid of you. All of this might happen, but you'll have a transformative effect because that light will shine in the darkness. There's no way around it."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":4205.26,"end":4385.08,"speaker":"Jordan Hall","text":"Yeah. So, John, flipping it to the language of virtue. There's two ways of being in relationship with virtue. One, something along the lines of a conservation law of evolutionary process. An inadequately large number of blind people feeling around in a maze will find their way through the maze. They may remember it, they may try to write it down and say, hey, left, right, right, left, left. That's how you get out. That's the human beings living in cultures, surviving and dying and discovering the things like humility and courage and integrity. If you have those woven deeply into the nature of your culture, you're going to be more likely to live well than others. Right. It's sort of that perspective, that way of looking at it. The other way of looking at it, of course, is you simply turn on the light and you look at the maze and you notice there's actually a structure to the maze and there's a way of noticing just how to get through it without having to go through the process of searching, groping with your eyes closed and your hands out. And this is what I was referring to earlier, right. So the proposition is that both of these are accurate, both these are very valid ways, and that there's something like our capacity now. Where we are now as humans is we can be aware of that and we can say, okay, there is actually a beautiful, almost like a hint, a clue to this thing, virtue, the virtues that is hard worn. We can look back at the history of history and say, okay, here's where these things have shown up. Here's the edges and the parameters and the shapes of the things. But now we actually are in a process where we can, and I would say must, turn on the light. And we have to, in fact, become capable of perceiving that, use the evolutionary process to kind of act as a scaffold and a support. But step to the last, you know, that next step that is available, which is beyond what's available through trial and error, because we haven't got any time left to engage in trial and error. We have to become really significantly virtuous. And the best way to do that is to actually have a much better sense of the nature of what the underlying intrinsic order is that has been constantly rediscovered and rediscovered and rediscovered. And then, Jonathan, something that keeps coming up for me, and I think this is very much connected to a stream that I've noticed coming from you, and I'll say it in a very different way because it creates a space. I spent a lot of time last year with the Hawaiians and they taught me substantially about the validity and importance of. Of restoration for them politically, but also from a point of view of lineage, from the point of view of a culture that spent a lot of time figuring out how to actually create a way of holding perception of reality and making effective choices. Well, and as they taught me their language, I discovered that it didn't have a whole lot of the corruptions that the language that I was taught as a child, namely English. So something very powerful also about restoration. And then, John, you and I've been spending a lot of time restoring English and in some sense Greek."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":4385.96,"end":4386.44,"speaker":"John Vervaeke","text":"Yes."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":4386.84,"end":4397.56,"speaker":"Jordan Hall","text":"And rediscovering for me, like, as just an ordinary kind of secular Western capitalism, suburbs kid, what the word faith maybe really means. Right."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":4397.56,"end":4397.84,"speaker":"John Vervaeke","text":"Not."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":4397.84,"end":4437.83,"speaker":"Jordan Hall","text":"Not the seventh order derivative of propaganda faith that has been sort of loosely insulated and integrated into my mind, but what it may actually mean and therefore a restoration to its proper place. This notion of healing or bringing back into wholesomeness the restoration of the lineages that were developed in integrity in relationship with actual reality and did their living best to build structures that would hold and transmit that capacity to thrive in relationship with reality into the future is a profound and I would say, fundamental movement and sits to the right hand of simply turning on the light."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":4438.39,"end":4626.74,"speaker":"John Vervaeke","text":"I agree with this profoundly. I think what I need to do is bring a concrete in. I was involved in philosophical fellowship practice, and what you do is somebody reads a text very slowly and then somebody picks out. The first reader usually picks out a phrase. You chant the phrase and then you do what's called kind of speech, precious speaking. Anyways, the point is, in this practice, you're not speaking to the text. You're addressing the. You're trying to presence the perspective of the author. So you're trying to actually presence the perspective of the sage so you can enter into conformity to the perspective of the sage, not just taking information from their propositions. This is a way of trying to bring about a transformative relationship to texts so that they have a capacity for transformation other than just information. Now what happens is people, and this is part of what I teach people to do. We were reading a passage from Simone de Beauvoir, and what starts to happen is other people start to. They start to speak things that you can't think about the text. And they. They start to become the voice of Simon in a way that's hard to explain because you get a sense of, wow, that's all there and I didn't see it. And the other people are speaking it and everybody's doing this, and then there's a pivot point. And I did this deliberately and provocatively because I've been doing it in my practice where people. I don't just talk about, you know, I don't just talk third person. I shifted to second person address. And I said, simone. And a couple of. One other person picked it up. Lehman picked it up, and he immediately started doing that. Right. And two other people said they wanted to do that. They wanted to do that. They wanted to take an I thou rather than an I it or an I me, which is how all the discourse was going. I it, I me. They wanted to take an I thou. And they were choked. They couldn't do it. They couldn't do it. And I said, well, challenging the choke is where I'm finding most of the transformation. And I'm saying, I'm not claiming that I'm sort of, you know, resurrecting Simone de Beauvoir, but I'm also not just talking to her text. I'm trying to do something else. Right? And what it is, is, for me, what happens is the logos of her text is present, and it conveys something that was both universal and particular about her. And I'm trying to address that and trying to. Right? And people said, it's uncanny and it's weird, and I'm really, you know, and there's part of me that's like, yeah, it's uncanny and it's weird, but it's also, if I stay behind that choke point, I don't get the full impact of the process. Right? There's. And I thwart the capacity to internalize Simone de Beauvoir. Right. And for me, that would be a loss because she has a particular understanding of the female perspective that I think is valuable for a lot of people. And I'm not advocating for this."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":4627.38,"end":4643.42,"speaker":"Jonathan Pageau","text":"Do you think maybe that. I mean, this might be. Might seem a little torturous on my part to say this, but do you think that maybe the choke came from the fact that people didn't think that Simone de Beauvoir is worth praying to? Maybe that's just where the choke came from."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":4643.42,"end":4728.44,"speaker":"John Vervaeke","text":"It was like, no, it could have been. I thought about that. But the people were very honest, and, in fact, they wanted to talk about why they were choking. And it was more towards something we talked about earlier. It was the liminality of this, the in betweenness they wanted to say. Like, Simone is. You know, I got a strong sense of the presence of the perspective because I make a distinction between the presence of the perspective and the full blown presence of the person. Right. And they said, but that it was. That that was uncanny for them. And they didn't want to speak it precisely because it would disturb the sort of stability of their categories. That was the sense I was getting. It was introducing them to a third way in which things are real, neither subjectively nor objectively. There's this other way. They're real. The way Lerman talks about in her book How God Becomes Real. And that third way of things being real was deeply disturbing to them. So I'm using this as to say, I think if we try to enter into dialogos with these emerging aspects of reality, we're going to be encountering this third way in which things are real. And people find it very, very challenging. I understand what you're saying too, Jonathan, and I think. I'm not denying that that can also be a possibility. I don't think that was the case in the particular instance I was in."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":4729,"end":4771,"speaker":"Jordan Hall","text":"Yeah, I would just invoke that piece. We Westerners, particularly Americans for the past, probably the totality of our being for the past 200 years or so, have been unreasonably reckless with regard to this particular question. So I'm noticing the importance of what Jonathan's presenting. Okay, so creating proper boundaries. And we're entering into a space. John is pointing out, hey, there's this place, there's this way of being in relationship that is real and important and present to the moment that we're in. Jonathan is saying, yes, by the way, we know a lot about this place. Be very careful when you enter that way."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":4771,"end":4797.59,"speaker":"John Vervaeke","text":"Yes, yes, yes. That's exactly my point, though. In fact, if that's what Jonathan is saying, that's exactly my point. That's what I'm trying to get at with virtuosity and virtue, the proper care of this third way in which things are real. Because I agree with you, just flinging yourself into it is extremely foolish. Right? Yeah, that's the point I'm bringing up. That's exactly the challenge I'm posing."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":4797.67,"end":4883.7,"speaker":"Jonathan Pageau","text":"Because there was a moment like this at the end of the 19th century, you know, when we have all these occultists that are very present. So you have this moment where all of a sudden people started to notice that they could engage with these. These beings and they could, they could, they could have seances, they could manifest them, they could get together and then, you know, someone would. Would channel something else. And they became very fascinated by that because it was like, hey, something's Happening. This is cool. It's like kids playing with a Ouija board, right? It's like, hey, look, this is actually doing something. And so. And I think that that's, that's maybe my, my reservation towards this type of behavior is that that just because something happens and that things. You can engage these, these types of beings or these types of residues of beings, let's say. Yes, I think that there's a danger in that. And this is. I talked about that in terms of fascination with this, how people become fascinated by the fact that all of a sudden they're able to perceive these, these, let's say, hyper agents and higher beings. And so because of that, they lack the discernment and knowing why would I engage and how. And what is the proper way to do so? Is it just out of curiosity? Is it just out of, you know, what is it that I'm trying to accomplish and am I just trying to have some spiritual experience? Is this aimed towards a higher good? And so those are all the questions that I would definitely ask."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":4884.26,"end":4938.12,"speaker":"John Vervaeke","text":"I agree. And just to give you probably not complete reassurance, but at least some. That is all part of what is going on in these practices, right? Those questions are asked deeply and seriously. But yeah, I do worry about the sort of potential polarity here, which is a foolish fascination or kind of a. And I don't mean this necessarily religiously, a fundamentalism that says, no, no, there is no change to our ontology possible. Those are the two things we're trying to sail between here. And that's for me, I think we need. Sorry, this is almost funny to say, but we need sort of new virtues or at least a reinventio of some of the older virtues. I don't know quite what I'm saying, but like how to properly. We like orient in that is the thing that I'm bumping up against."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":4939.08,"end":5010.99,"speaker":"Jonathan Pageau","text":"Or maybe we need something like a fullness of virtues in a sense that Jordan talked about, which is that there's a manner in which we've noticed a degrading of the words that we use. We've noticed the degrading of words like faith, words like beauty, words like truth, you know, and so we've noticed that happening where now beauty just becomes pleasure, you know, where faith just becomes believing in something unreasonable. So we have these weird transformations that have happened over the past 500 years. And so by recovering the actual highest version of these terms and of these meanings, then we run less a danger of going astray, let's say. And it's there. And I think, John, you know, that that's why, like I go back to at least the authors, the Christian authors that I think have captured the highest version of Christianity in their work. It's like. It's like St. Gregory, St. Maximus, you know, these are the saints that seem to have had the highest vision of what it is that these virtues or the way in which we can embody this reality in the world today is. And so. And the same with the philosophers, like, you know, going to the Neoplatonists, going back to Plato. These are the ways that we can. We can do this."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":5011.15,"end":5105.22,"speaker":"John Vervaeke","text":"And I'm trying to do that. So. And Jordan's right. I like the Latin term inventio. To discover and also to create. But the work I've been doing and the conversations I've been having about trying to reintegrate phenomenology with the theory of the forms so it doesn't become this abstract notion, but becomes this process, the eidetic induction of literally trying to practice finding the through line. Through line in our intelligibility. That's what I mean about. And if you're right, that is in a sense of recovery of Plato, but it's a recovery of Plato that benefits from things after Plato like phenomenology. Right. And Marleau Ponty. Right. And so I'm very much trying to do that. I guess what I'm asking for. And it's. It's too great of an ask. I get it. But I'm trying to see how that. How that can be brought into the proper dialogos relationship to. Because I agree with you. I too, that's again, why, like you, I'm exploring Neoplatonism so deeply. But how can we get a proper understanding of the orders of agency, if you want to put it that way, so that we can avoid just, you know, the foolish fascination, which is rampant, but also the opposite, which is rampant, which is. No, no, no, no. Everything is fine. You stay with the ontology we've always had. Just work harder, Boxer. Just work harder. Right. And so sorry. I'm hoping this is being helpful. I feel for like me like I'm moving forward in this conversation. I hope the two of you also feel that as well."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":5105.38,"end":5149.17,"speaker":"Jonathan Pageau","text":"Definitely. Before we're. Because I said we go until two. If you have a few more minutes. It seems like there's a good reason to talk about this just because it happened with it yesterday or a few days ago. If you followed this story about the Google employee who. Who declared lambda one of the AI bots to be sent. And so, I mean, asking about its sentience, I think is irrelevant, at least to me, the actual sentience of the program. But the idea that, let's say that there's a scandal related to that. There's a scandal which is finding media attention related to someone saying this, getting fired or getting suspended because they are saying this. Have you put any thought into that, into what's going on right now?"}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":5149.49,"end":5304.51,"speaker":"John Vervaeke","text":"Yeah, I have. I mean, first of all, my whole career has been these pronouncements. Minsky famously said in 1967, within 10 years, computers won't even be keeping us as pets. My response to any of these claims are initially skeptical. When the first versions of these came out, like, what are their names? One is Jurassic and the other, what is it, CPT3 or something? Look, look, it passes the train. All you do is just take the two of them and have them talk to each other for one minute and they spin off in really weird shit really fast, right? So there's a problem with, you know, human beings interacting with these things and saying, ah. Because human beings have a tremendous capacity to find salient. Find sentience in things that might not properly be sentient. Right? And so that, to my mind, first of all, that's not the right test, right? The right test is for us to actually have them talk to each other and see if it goes off, because that is much more powerful because they very quickly, reciprocally narrow into weirdness. And that is the way of telling whether or not you've got a simulation in the sense that Jordan was saying, or you've got an actual instantiation. As a cognitive scientist, that's my first response. I want to see the correct test, and I especially don't want to hear the test of somebody that might have been involved in the creation of this because they're going to be heavily invested. This is not a good scientific test. That being said, we might come to the day where that's the case. However, I doubt that it's going to be the kind of machines that are being offered right now. Because there's good reason, I think, to believe that for there to be real intelligence, general intelligence, you have to be embodied, you have to be properly social, you have to be emotional, et cetera, et cetera, et cetera. The fact that our categories for terms like sentience are so impoverished that everybody freaks out, that's, to me, the thing to really pay attention to here. Why isn't it that we get like, oh, well, here we've got a. Well Thought out understanding of intelligence and sentience and consciousness. Let's discuss it and bring it to bear on this problem. No, no, no. We freak out. We create some sort of crypto conspiracy theory. And for me it's like if this is what it claims to be, it is a scientific discovery and should be responded to in that fashion. The worst people to ask are the creator of it, the media and the politicians. This is properly a scientific question and I would want to ask, I want journalists."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":5304.91,"end":5308.35,"speaker":"Jordan Hall","text":"Somewhere in that mix is just general purpose makes things worse."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":5311.55,"end":5332.57,"speaker":"John Vervaeke","text":"As a cognitive scientist, I have suspicions about it because generally these machines are completely syntactic in nature and they work in terms of probability distributions, which means human beings can easily comport themselves and they will perform fantastically. But it's very quickly, easy to reveal monstrosity. Doesn't mean there isn't real progress being made there."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":5332.57,"end":5335.69,"speaker":"Jonathan Pageau","text":"By the way, Jordan, do you have something to say about this?"}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":5336.09,"end":5336.89,"speaker":"Jordan Hall","text":"Yes, I do."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":5336.89,"end":5337.61,"speaker":"Jonathan Pageau","text":"Go for it."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":5338.09,"end":5615.1,"speaker":"Jordan Hall","text":"So maybe a way of putting it would be something like it's this thing that we've been talking about a lot, the simulation and the naming that I said that maybe we've been living 85% of our lives as humans, as civilized humans, for the past, say, 30 or so thousand years in a simulation. I'm going to say that that is a paper clip optimizer, if you're familiar with that notion from AI. AI has this metaphor of a risk of what happens if you produce a super intelligent AI and task it with the responsibility of producing the most efficient maximum number of paperclips and it accidentally converts the entire Earth into nothing but a floating cloud of gravitationally bound paperclips. So a paperclip maximizer. This is basically all that happens is when you yoke intelligence separate from sentience and sapience, or soul to a narrow local optimization function. So we just describe civilization in more or less that same fashion. And it is that mob, it is that unconscious, it is the egreg words in that, that sort of variation that we sort of were brushing on a little bit, you know. So I would take, not the opposite, I would take another perspective on this most recent, how would you call it, fad. That's not bad. Fad's not bad. The silliness with which such a large fraction of our collective intelligence was effusively oriented towards something is just evidence of the ease by which a relatively mediocre AI, if improperly deployed, could take advantage of our lower natures and the decadence, corruption and otherwise profane aspects of A paperclip maximizer in which we live to further the process of converting us all into paperclips. This is the problem that I see. It's less a problem of sort of like everything's hunky dory, but we accidentally create, you know, Terminator 2 or something like that. It's more like it's all part of a reciprocal narrowing that we call civilization and that we're living within and we need to actually find our way out of that. In general, can I, can I loop a little bit of this last piece about let's Just say prayer the way you described it, Jonathan, like you said, perhaps they didn't want to pray to Simone. A few years ago, I found myself in an interesting conversation with a variety of different folks from the North American indigenous community, different bands and tribes. Somebody said something I thought was quite nice. He said that in Silicon Valley there's a phrase that has, how would you call it, has obvious currency, which is information wants to be free. And he said to his people, nothing more absurd could possibly be uttered that information is quite often extremely dangerous. And the proper thing is to have the proper people holding the proper competencies in a proper way in support of what is in fact a wholesome way of life. In some sense, it's obvious we don't want to give the keys to the nuclear codes to literally everybody. But this is true in general, if you really think about it all the way through. This capacity to be humans in relationship with being and to speak meaning in world is profoundly powerful. And AI just happens to be an example of that profound power. But the whole point is, the whole thing is profoundly powerful. And learning how to enter into right relationship with that capacity, particularly since we're in media stress, none of us are grown ups and yet all of us have capacity, is quite meaningfully important right now. And so what I would propose is to take the thing, that sort of practice that you were talking about, John, dialogos. And for almost everybody, the safe place to practice dialogos is like with your wife or with your child around ordinary life, like the simplest, most basic, ordinary, wholesome human experiences. Practice dialogos there until you're very good at it. Then consider the possibility of moving into more sort of potent practices of dialogos. By the way, you won't be able to help it. It will simply enter more and more and more into your life. But the more it's grounded to ordinary life, the more it's grounded to how we are just making the choice that's in front of you better, the more it's able to be in service to ordinary life. And then it is woven back into livingness and not in the space where we bring things into sorcery service from the top down."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":5615.5,"end":5615.98,"speaker":"John Vervaeke","text":"Yeah, yeah."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":5616.22,"end":5626.94,"speaker":"Jordan Hall","text":"Wrong top, by the way. From the simulated top down, which gets in the way of our relationship with the top. And that, like, that distinction strikes me as being sort of a fundamental distinction at this moment."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":5627.26,"end":5631.9,"speaker":"John Vervaeke","text":"Which. The distinction between sorcery and theurgia or the distinction you made in practice?"}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":5632.22,"end":5683.77,"speaker":"Jordan Hall","text":"Yeah, the distinction of practice. The distinction of weaving our potency in relationship with meaningfulness within relationship with life. The actual. The real, actual life that you're living moment to moment. Bring it into service of that first and keep it at that level of scale. And don't do the source's apprentice thing and avoid the source apprentice thing at all costs. Once you've become capable of bringing a higher degree of beauty and life and aliveness in the relationships that are directly in front of you, then expand, you know, build that capacity. If, by the way, that is yours to do. This goes back to the notion of living kairos properly. If it turns out that your moment of living kairos properly is to bring something in service to the Logos in a powerful way, then do what is yours to do. But probably still practice, you know, to do it artfully in a very powerful way."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":5684.49,"end":5724.45,"speaker":"Jonathan Pageau","text":"No, I think that that's probably. At least for me, that's probably a great way to finish this. I think you're totally right. And I think it does wrap up a little bit. All the things that we're saying. That is that we have a certain amount of capacity to affect the world. And that. That is especially like, if we think of hyper agents, for example, like the closest hyper agent you'll have to deal with is your family. Like, that is the closest one that you have with you. And it's like you can build that into something that isn't parasitic and that is. That is together in a higher. In higher participation. Then I think that it's like, maybe that's the best thing you can do, you know, apart from."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":5725.09,"end":5727.25,"speaker":"Jordan Hall","text":"I would actually say one. One thing closer."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":5727.41,"end":5727.89,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":5727.89,"end":5732.37,"speaker":"Jordan Hall","text":"For almost all beings alive today, the closest hyper agent is yourself."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":5732.37,"end":5762.65,"speaker":"Jonathan Pageau","text":"Yeah, exactly. I was actually going exactly there and say, apart from like bringing all these broken processes within you together in yourself. Like then. Then after that, like you said, it's with your close, close people. So. So, guys, thanks for this conversation. I definitely would like to continue it and to have more because I think that this is the question that everybody is thinking about and everybody's asking. So I need some time to think about what we talked about today, but I would like to continue if you agree."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":5762.97,"end":5764.81,"speaker":"John Vervaeke","text":"Well, then I'll end with a provocation."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":5764.89,"end":5766.25,"speaker":"Jonathan Pageau","text":"Go for it. Provoke us, John."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":5766.25,"end":5817.28,"speaker":"John Vervaeke","text":"The advice that you both made is good advice. The problem is that, again, I think we also need to get people into relationship with people other than their family and their friends. This is the notion of fellowship and that we need that. And we need part of the fellowship. And to use your language, Jonathan, we need part of the fellowship is the communion of the saints and that they have to be part of the family, too, in some way. If Plato and Socrates can't enter and be part of my family, then I'm kind of doomed in a way. So I don't want to. I'm not rejecting the advice you gave, but I'm turning it into a provocation. Granted, what you said is correct, Jordan, and I agree with John, and I think it is right nevertheless. Right."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":5817.52,"end":5823.44,"speaker":"Jordan Hall","text":"Well, there's a very beautiful way of synthesizing that, which is to remember that the word family means those who love most."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":5823.84,"end":5825.04,"speaker":"John Vervaeke","text":"Yes. Right."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":5825.04,"end":5831.67,"speaker":"Jonathan Pageau","text":"All right, well, that's great. And I'll give my last provocation to you, John. I'll say that's why I tell people, go to church."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":5834.47,"end":5837.91,"speaker":"John Vervaeke","text":"Well, okay, so I'll stop talking. I just want to say thank you."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":5838.15,"end":5841.43,"speaker":"Jonathan Pageau","text":"Yeah, thanks to both of you. This has been wonderful. And we'll definitely set up."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":5842.15,"end":5842.71,"speaker":"John Vervaeke","text":"I really."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":5842.87,"end":5845.59,"speaker":"Jordan Hall","text":"That was me saying yes to any future conversation."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":5845.59,"end":5846.31,"speaker":"Jonathan Pageau","text":"All right, great."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":5846.47,"end":5859.98,"speaker":"John Vervaeke","text":"Me. Me too. I really found that there was a tripolar thing between us that really gave a powerful field of exploration. I really felt the logos coming into the conversation very powerful. So just thank you both. Thank you very much."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":5860.22,"end":5863.06,"speaker":"Jonathan Pageau","text":"All right, well, thanks, and we'll talk again."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":5863.06,"end":5864.3,"speaker":"John Vervaeke","text":"All right, take good care."}
{"episode_id":"SW - #239 - 2022-06-29 - Jordan Hall and John Vervaeke - Egregores, Mobs and Demons","start":5864.78,"end":5926.82,"speaker":"Jonathan Pageau","text":"I hope you enjoyed this episode of the Symbolic World. The Symbolic World is based on a series of videos that you can find on my YouTube channel, Jonathan Pageau's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by, of course, leaving a review on itunes. Everybody knows that's the best way to get the podcast out there, to get it heard. And if you want to get involved you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon the Pageau videos as well and on SubscribeStar, all those links you can find on my website or in the show description. So thank you and I will see you soon."}
