{"episode_id":"SW - #095 - 2020-03-22 - How the Lord's Prayer Contains All of Creation","start":0.48,"end":1487.06,"speaker":"Jonathan Pageau","text":"So one of the things I have been trying to communicate to you guys is that the world manifests itself through a pattern, a basic pattern that I trace in different ways. Talking about the mountain in Genesis, Heaven and earth, the kind of the pattern that you'll also find in St. Gregory of Nyssa's Life of Moses, that you'll find as well in my brother's book, Matthieu's book, the language of creation and different aspects of reality tend to manifest different parts of that pattern. But there are some things which manifest the whole pattern in a very concise way. And this is very much the case in many of the things that are talked about or the things that are taught to us by Christ. And so today, what we're going to do is we're going to look at the Lord's Prayer itself, the way that Christ taught us to pray. And I will try to show you that the Lord's Prayer, just like the mountain of Moses, just like the Garden of Eden, follows the same pattern. This is Jonathan Peugeot. Welcome to the symbolic world. Now, in Scriptures, there are two versions of the Lord's Prayer, but we're going to choose to talk about the version in The Gospel of St. Matthew, which has the longer version, which is the one we mostly know in the way that we pray in churches. In a way, it doesn't really matter, because the version that's in St. Luke has the same elements as in the gospel of St. Matthew. It's just that in the Gospel of Matthew there tends to be a multiplication which. Which can help us see the pattern even more clearly. But it's still all there in the Gospel of Luke. And so the prayer starts with. Everybody knows the prayer. I hope that you know the prayer. The prayer starts our Father, who is in heaven. Of course, when we talk about heaven, it's very important not to understand it as the sky, just as the sky. In Scripture, it talks about the heaven of heavens, the notion that there is a heaven above the heavens, which contains all the heavens. And it really is the first heaven in Scripture, in Genesis. In Genesis, there's already there is the first heaven. When it says God created heaven and earth, and then there's a lower heaven, the firmament, which is akin to heaven, but is lower, let's say, on the ontological hierarchy. The heaven in Scripture is really the invisible, fully invisible place, the place of principality, you would say. And you can see that the relationship between the Father and heaven, it has to do with the idea of the source. You know, the source. The Father is the Source of the family in the sense that he sends the seed. And the seed is that which creates the. The family with his wife. And so too, the Father sends his seed, which in this case is the Word. And the word comes down and is that which creates the entire world. And so this relationship between Father and heaven is, of course, completely coherent in the sense that you as a child also, you know, it's very intuitive. Your Father is above you when you're a child and you look up and you see your father. And so the notion that you would look up and that the things which are above you, the heaven itself would be akin to the Father. Also, like I said, the fact that your identity comes down from your Father. He names you, he gives you your first structure. He is your first authority. And so in that sense, God as our Father, because we all originate from him, is a completely normal analogy. And so we say, our Father who is in heaven and hallowed be your name. And the name is related, of course, to the idea of God himself. The Name is that which points to something. And so we glorify God's name. We glorify the manner by which he manifests himself. And the name of God is also, in a way, the Logos himself. That is, that when God names himself, when he says, I am the one who is, we can understand that as Yahweh in the Scripture, we can understand it as the. The divine Logos, the manifestation of God. And so God manifests Himself firstly by his name, by showing us who he is before he. Actually ontologically, before he creates things. We first, the highest aspect of God, you could say something like, is his name? Because it is the first thing that can help you look up and understand that there's something about. And so we hallow, we glorify, we lift up. We want to acknowledge how high his name is, how high this encounter we have with God, how high it is, we place it above in the heavens, and we put it together with God. So you have the Father, Heaven and the Name, all above, okay? So you have to keep that spatial symbolism in mind. That's really the key to so much. To so much symbolism in order to understand how it lays itself out. So you have the Father, you have the Heaven, you have the Name, and then it says you, kingdom come. And so what exactly is a kingdom? A way to understand a kingdom is to understand the kingdom as the scope of the reign of a king. So all that which is under the rule of the king is his kingdom. And so you can understand, imagine the king above everything. And then whatever it is that the king rules over his land, his people, the identity of his people, all of these things. Imagine it like a mountain now again as a pyramid or as a mountain. All of these things are the kingdom of God. And so we first lift up, right, we lift up God the Father, Heaven. And then we say we want your kingdom to, to come. We want the world to be under your rule. We want the world to manifest in an orderly manner the fact that it is connected to you, to the Father, to heaven, and to the name. Okay? Keep also the name in mind because that's also part if we want to understand how the Lord's Prayer is actually a cosmic image, which although ultimately it applies to God, it also shows us the pattern of reality. Because you can also understand the kingdom of something as whatever it is that it names. And so I'm going to use the same example I use all the time. You can imagine a cup, and so you can imagine that the cup has a kingdom, okay? So the cup, the cup, ness of the cup is up there. And whatever falls under its cupness, whatever specific examples of cups, whatever varieties of cups, whatever, you know, all the multiplicity which is contained in the cup is the kingdom of the cup, okay? But now we're talking about all of reality. And so we, we are talking about all of reality as being this kingdom which manifests the name, the identity, the, the, the, the heaven which is above, okay? And so then it goes on to say, you will be done on earth as it is in heaven. So now we have the coming about of the first lower term we have now on earth as it is in heaven. And so we, we, we've, we've shown the entire pattern already. We've already kind of stretched the entire world out. We say we start with heaven. We have heaven above, we have the Father, the Name, and then we have the kingdom of the Father which manifests him itself. We have the will of the Father, because the will and the kingdom is the same thing. The capacity for your will to manifest itself in the world is the rule that you have over the things around you. And so whatever influence you're capable of having on the world, that is your rule. Like you are a little king, let's say a king of your house. And you want your rule to your will to be done in your house so that it doesn't fall into chaos, it doesn't fall into disorder, that it doesn't fall into transgression. It, you know, that you don't have everything upside down. And all the clothes on the ground and all of this. And so you want your will to be done in your house. And now ultimately, cosmically, we want God's will to be done in earth as it is in heaven. And this, this, this idea of on earth as it is in heaven, this is the point. I often talk about the world as this mountain. You can imagine the point as the mountain, heaven above the mountain. And then the point, the place, place where heaven and earth meet. That is what this is talking about. On earth as it is in heaven, as a reflection of that which is above, that which is below becomes an image of that which is above. And we see that in many places in scriptures when it talks about how God is hidden in all of creation and in the tradition of the Church, this whole idea of the logi, this, this notion in Saint Maximus the Confessor that I've talked about so many times, that everything in the world has an essence, has something which is above its phenomena necessarily as the cup. Again, you know, the cup, ness of the cup is not contained in the physical cups. You can't get to physical cup just by. To the essence of a cup just by the physical cups. It kind of jumps up above all the multiplicity. And so, you know, that is a visible. But the ideas of the Logos is that even behind that there's an essence which is unknowable to a certain extent that you can't totally define. It's not its definition, it's kind of behind the definition. That which gives birth to the definition. And that is all of these things are how God reflects himself in the world. And so your will, your essence, your energies. When we talk about energies in the Orthodox Church, we are talking about God's will. And so we say, your will, your energies, your. Your will be done on earth as it is in heaven. And the world becomes the body of God in a way, the world becomes the kingdom of God. All of these expressions that you find in scripture, that is what it is talking about here. So you already have this thing stretched out, and so now it talks about give us this day our daily bread. And what's interesting about this phrase is that there are many ways that it's been translated because the word that's used for daily is something like trans, you know, something like trans essential bread or something like that. Some, some people call transubstantial bread or trans essential bread. And this notion that the bread, it's a word that is, it's almost like a neologism. But no matter how you understand it you can kind of understand it as the bread which comes down from heaven. You have to understand it as the mana that's in the Old Testament which God sends down from heaven. And. And is that which feeds us. And the importance of bread is. Bread is very important as well, because bread is exactly this connection between heaven and earth. That's what bread is. Bread is seeds. It's a seed that you mix with water and then you have bread. Just like the entire cosmos is the word of God which comes down on the primordial ocean of creation and pulls reality out of it. Bread becomes an image of this actual meeting. And so this call for bread is a call again for the rule, for the kingdom, but in a manner which shows us that we are dependent on this, that we live through this, that we need it to exist. Without this bread which comes from heaven, we cannot exist. We will die, right? And so it becomes our daily bread, or it becomes our trans. Essential bread, this idea of something which brings us higher in that sense. And so it all fits into this nice pattern of the world. And so coming down from heaven once again, you have the name, you have the will, you have the kingdom. And you also have this bread which. These seeds that come down and connect with the water of the world. And. And you mix it together, you cook it, and you've got that which sustains us, okay? The meeting of heaven and earth. That's what bread is all the time. And then it goes on to say, and lead us not. Oh, sorry. Then there is. Forgive us our trespasses as we forgive those who trespass against us. Another translation. Forgive us our debtors as we forgive those who are indebted to us. Both of those are the same thing. And now you can understand it as. The word trespass is a good word because you can understand it. Now imagine now the mountain again, or I've talked about the mountain often can be represented as a path. So you have this path which leads you up to the point where heaven and earth meet. And then you have the trespasses, you have the things you do, you have the aspects of yourself which step off the path, which go down the path, or which are not, you know, don't hit the mark, you know, don't hit the center. Kind of don't totally manifest the will of God in the world. So those seeds that will that kingdom, there are ways that we act in which we step aside from that. And so you can imagine it as the bottom of the mountain now. So you have heaven, you have earth, you have this mountain in the middle of the kingdom. And then you have the place where we kind of are down at the bottom of the mountain. We're stepping off into the wilderness, we are stepping on thorns. We are. There's all this imagery in scripture about the trespass where we miss out, right? And so we ask God to forgive us our trespasses so that we can go back up, so that we can participate in the kingdom, so that we can eat the bread, so that we can do his. All of these things are all the same in terms of what they're talking about. And we also say, as we forgive those who trespass against us. That's really important because now it's showing us. Until now we've had the horizontal move, right? We have all the things coming down from heaven. We've had our response, which is to ask God to bring us up by forgiving us that all the things we do that are, are stepping aside from what we're supposed to be and where we're supposed to look. But now it manifests on the horizontal, which is that this moving up is a coming together as well. And I've talked about this all the time, this notion that there's a vertical move and a horizontal move. That is the communion of the saints, the existence in love, the well fittedness in love is that which manifests the kingdom of God. And so for the mountain to hold together, there has to be this thing coming down from above which manifests the essence and the wills. But there also has to be a coming together at the base in order to stay connected to the top. And so we ask God to forgive us. And then we forgive those around us so that we stay in communion with those around us. We love those around us just as God loved us. And without that, we. Without us loving our neighbor, without us forgiving the trespasses of others, we cannot participate in this upward movement because the upward movement is the coming together of the lower parts. You know, for a cup to exist, it has to glue cold together. If you throw it on the ground and it smashes into pieces and it's not holding together, you are no longer manifesting the essence of the cup. You're no longer manifesting the kingdom of the cup. It's. It has to come together for the essence of the cup to appear. You know, we see Christ talk about that all the time. He says, or two or three are gathered together in my name, then I am in the middle of you. Okay? So in the name, in the name. We have it in this as well, holy be your name, the will of God. When we gather in the will of God, in the name of God, then Christ is at our center. Christ becomes our head, becomes the top of us. Okay, all of this is talking about how reality lays itself out. And then finally we have the last part, which is really the lowest part. And it talks about, you know, lead us not into temptation or lead us not into trial, let us not fall into trial. Different ways of translating it. In a way it doesn't matter, because it. It's. It's one step lower. So you have this idea of the trespass, and then you have the things, the dark things on the side that are. That are calling us, you know, all these dark principalities on the outside. All these. These things that are pulling us apart from each other, that are tempting us, that are. That are like a stumbling stone, that are a trial, that are all these things that are going to bring us away from the name, from the kingdom, from the. From the will of God and is also going to separate us from each other. And so we want God to not let us fall into this outside darkness. We want God to keep us in the light where his will is being done and where we are loving our neighbors. All of this is completely coherent. And finally, and deliver us from evil. And that is, of course, the. The final. You could call it the upside down at the edge. You know, the. The devil himself, who is the separator, who is the divider, the one who is the accuser of all of these images of evil, are on the very fringe of the world and are accusing you so that you fall away, so that you get pulled away from the kingdom of heaven, from the kingdom of God. And so you can see how the prayer itself is a repetition of the pattern of creation and the fall in Genesis. It is a repetition of almost all the stories in scripture. It has the same pattern. And from starting from above, showing us the world in between and how the world falls apart on the edge, and what we need to do in order to stay connected to each other and also stay connected to God. But like I said, this prayer obviously is ultimately about our relationship with God and our coexistence as the church and as the body of Christ, all these things. But it is also a pattern of reality. Every identity, every smaller identity is also participates in this pattern. And so in order, I keep using the cup, but it's such a good, a good way, a good, good example, and it's an easy one because I keep using the same one, use different example of the same thing. And so you have the. The. The identity of the cup which is up in heaven. It is invisible. It is a. It is an essence. It is beyond the multiplicity. And it has a name. Its name is the place where it comes together in itself. And you want, in order to be able to participate in cups, you need the kingdom of the cup to come down on, you know, pieces like ceramic or like paint or like whatever your cup is made of. You need the kingdom of the cup to come down and manifest its will, you know, on earth as it is in heaven. If the will, if the will, the identity of the cup, the name of the cup, and the will of the cup is not manifesting itself properly in the world, then you're going to have a cup with holes. You're going to have a cup that, you know, that is a weird shape, that is hard to drink from whatever it is. You want the kingdom of the cup to manifest itself fully in the world. And then you get to the. The. You have to have some flexibility towards the exceptions. You don't. You can't be completely rigorous in terms of the essence of the cup because the essence of the cup is too high anyways. And so there is no pure cup in the world. And so each cup will have something which will not be perfect. And so you have to be forgiving as well. You have to be understanding. You have to be able to recognize the essence of the cup and the multiplicity. In a way, you forgive the little trespasses of the cup. You don't want to be too severe, or else you won't drink anything because nothing actually manifests the full essence of it. And finally, you don't want the cup to be destroyed. You don't want the thing that's going to knock it off the table to break it on the ground. You don't want the person who's gonna come in and steal the cups from your house. You don't want that to happen. You want the kingdom of the cup to participate appropriately. And so I'm afraid that some people might think that I'm being somewhat blasphemous when I'm using a cup as an example. But I think it's very important to understand the manner in which reality functions as a fractal pattern. When we talk about how the glory of God is hidden in creation, that everything in the world manifests God, that's not an arbitrary thing. It's not an emotional thing. It's not a. I feel like God is manifesting himself in the world, He. It is an actual objective reality. It's a true thing which you can participate in, which you can see, and which manifests itself at lower levels everywhere in the world, pointing up towards the absolute version of it, which Christ reveals to us in this prayer that he has given us. And so as. As Lent is, you know, moving on, as we are hopefully trying to spend more time in prayer, some time fasting as well, for most of you watching this, I imagine, as well, and trying to refocus ourselves, we can remember as we pray the Lord's Prayer. It's good to pray at least every day, to remember how beautiful it is, how much it not only brings us into the presence of God, that it not only is the prayer that Christ gave us, the ultimate prayer in a way, but it isn't the ultimate prayer because it also shows us the very structure of creation and the very manner in which God interacts with the world. So I hope this was helpful for you and everybody. I just want to thank you for your support. Thank you for all these people that are helping me out. You know, I told you that we're going to start a blog very soon. Things are right in process right now. People are writing articles, people are editing articles, and very soon my website is going to become a platform for writing. You're going to see some people you've seen on my channel before. You're going to see J.P. you'll probably see Alistair Roberts, you will see Nicholas Cotar as well, and a whole bunch of other people who I'm really excited for you to discover. So everybody thanks again and I will see you very soon. I hope you enjoyed this episode of the Symbolic World. The Symbolic World is edited by Justin Ward and it is based on a series of videos that you can find on my YouTube channel, Jonathan Pageau's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course leaving a review on itunes. Everybody knows that's the best way to to get the podcast out there, to get it heard. And if you want to get involved, you can also support the podcast financially. Going to www.thesymbolicworld.com support or else on Patreon Pajo videos as well and on subscribestar all those links you can find on my website or in the show description. So thank you and I will see you soon."}
