{"episode_id":"SW - #379 - 2025-03-02 - You’re Not That Different From Your Political Opponents","start":0.16,"end":1147.5,"speaker":"Jonathan Pageau","text":"It has nothing to do with the ideology behind it. It has nothing to do with the idea that, oh, these religious people, they made this happen and it's because of religion. Well, if you think that, then you'll be ignorant to the way in which your own ways of thinking and your own excesses could bring about the exact same thing. And sometimes, especially now, sometimes worse in both ways, because of technology and because of the power of, of technology, now we have access to way more excesses on each side. This is Jonathan Peugeot. Welcome to the symbolic world. One of the accusations that you heard from the new atheist in the past few decades is of course, how horrible religion is and how religion has done these things like the Inquisition, like the witch hunts, the witch burnings, the oppression of difference, the oppression of minorities, the oppression of other religions. All of these types of accusations that you hear that religion is part of it. But what if I told you, or what if we consider that in fact all of these behaviors are actually just aspects of human behavior? They're aspects of the, of the human microcosm, of how humans interact with each other, and that they can be found everywhere and anywhere at every single time. And so I think that this way of understanding, which is that there are certain patterns of being and those patterns of being, they play themselves out in people, they play themselves out in societies, and they are just reflections. And they're reflections of usually the symbolic pattern, which is the way in which the multiple and the one join together. They are reflections of how it is that multiple people can participate and, and become one at a higher level, that is a societal level, the same thing in yourself. That is how all these thoughts, how all of these body parts, how they can all join together and be one person, that most of the things that people criticize religion for, they are simply aspects of the symbolic pattern applied to different spheres. And so sometimes those aspects, they go wrong or they become excessive, you know, and then they have to be balanced out with other aspects and that those can happen, by the way, at both sides. You know, we, we accuse, for example, religion of being oppressive and harsh and judging and witch burning and, you know, inquisition and stuff like that. But you have to remember that the Nietzscheans or that Nietzsche and his followers accuse religion often of being the opposite, of being too weak, of being too open, of being forgiving, of being, you know, know, of being this kind of weak man's vision of, of reality, of, of not being active enough and not being vital enough and not defending one ourselves enough. And so which one is it? You Know, is it the one or is it the other? The truth is that it's both and that it's both, not just for religion, but that it's both for every single different aspect of human reality. And so a way to understand it is think of it as your body, right? And so your body. There are parts, there are aspects of your body which are there to defend you from the dangerous outside aspects, right? They're there that are there to defend you from germs, from bacteria, from things that could harm your body. But there are also aspects of your body that are there to include things from the outside. And so you're eating stuff all the time, so you're taking things from the outside and, and you're bringing it into your body and then that th. Those things are becoming parts of your body. And so your body has to find a kind of balance between the capacity to engage with the outside in a positive, fruitful way, you know, for opportunity to manifest itself. And your body also has to have mechanisms which stop the bad stuff on the outside from contaminating you and from killing you, to be honest. And that, that very structure is one that happens also at a level of a group, at a level of society. Now, at the level of society, there are aspects of that society. And now the aspects will often become embodied. They'll become embodied in personalities that will play different roles. Now new, those personalities will be contained in you. So you will also have aspects of your personality that will be exploratory and that will be looking for new things, that will be trying to figure out new opportunities. And you'll have aspects of your personality which will be cautious and will be wary of things that could hurt you and, you know, things that could endanger you. And so you'll be scared at night, you'll be scared in the dark. You'll be cautious in places that you don't know the people. Um, but you'll also have aspects of you that will be extroverted when you're meeting new people and will go out to them and greet them and talk to them and see in them if there are some precious things that can make your world more than what it was before. Now, different people will have different. A different balance of these different aspects. And a society will have different people that play those same roles in the society. Some people that will be more cautious of that which can endanger and destroy and contaminate, and some people that will be more exploratory, more open, more, you know, looking out to see how it is that we can include things from the outside in order to make us stronger and to make us more. And that will. All these levels, these balances will play themselves out in a society that is that sometimes it'll be more manifested of certain aspects, sometimes there'll be less. And sometimes that can go too far in yourself. Sometimes you can, you can be too cautious and then that will have consequences. Sometimes you can be too open and that will have consequences. And the same thing happens with the society. Sometimes societies can be too cautious and then that will constrict them and close them off. And sometimes the society can be too open. Think of open society that the George Soros organization. And then you will basically start to drown or you'll start to, you know, you might cease to exist in either one of those excesses. And, and that is really the way to kind of understand it. And so, so for example, like when it's funny because, you know, in the 1960s, for example, there, there the people in the, in that time, they accuse the religious people of being pearl clutchers, right? And so this idea of trying to protect what's a pearl clutch, a pearl clutcher is someone who grabs their pearls and is afraid of losing them, right? Is afraid of losing this precious thing and has a kind of gut reaction to protect their precious thing in order to prevent it from being destroyed or being taken or being stolen from the outside. And so the, the, let's say the hippie secular types accuse the religious people of being pearl clutchers, that is puritans, moral, you know, moral puritans, you know, people who are just trying to protect their values, protect their, their moral codes, even if they don't totally understand them. And that there is an excess in that. So because of that, they're prude. They are, they're kind of, you know, they have this kind of finger wagging aspect to them. And, and they have, you know, a kind of judgmental attitude towards everything that is around them, et cetera, et cetera, et cetera. Now what's funny now is that of course we see that now it's the secular people that are doing that. And the same types of behaviors are appearing in the secular world. And so you have people that are canceling others because of purity motifs. We're trying to protect our group from, from a kind of infection of ideas that would be, you know, that would destroy us. And so we have the same type of pearl clutching motif. We have the same kind of puritan behavior. So the people that go online and cancel others, the people that go Online and accuse everybody of, you know, you know, the excesses, for example, of the, of, of cancel culture. These are actually the same kind of people that were accused of being finger wagging puritans in the religious sphere before. They're just modes of being. And so they're now the same types of people. You know, the vegan. The what? I remember a few years ago, she kind of disappeared. Remember the vegan teacher? You know, she was a Sunday school teacher. She was the cliche of the church lady. And so the vegan teacher and the church lady are the same. You know, it's like this and you know, this kind of, this, this like being annoyed and judgmental and trying to moralize people into certain behaviors, all of this is just modes of being. And so you can see the same, for example, in the, the kind of openness aspect as well. And so you could say that you can also accuse, for example, certain aspects of our society today of being too open, of including so many things that you're drowning, that you're basically self destroying. Because if you drink poison and if you take too much alcohol or you take too many drugs, or you're not careful of what it is that you put into your body, it can lead you to death. And so this can manifest itself at different level. You, you know, and so if you think about, I don't know, some Irish village a few hundred years ago where everybody was too drunk and that this was seriously causing problems in this, in this society, you know, now we have people on fentanyl, you know, like fentanyl zombies in our cities and you know, an excess of homeless people and that it's, it's encroaching on the capacity for the cities to hold together. And so the patterns will manifest themselves in the same way at different levels. And then some people will say, you know, back in the days of that little Irish village, I say Irish, it could have been any, any place. But let's say this little Irish village, some people have said, you know, like their life is hard. You know, a hard man working hard, just let him be like, let him have his little pleasure. You know, there's no point in, in, in finger wagging them, you know, life's difficult enough, let them live their life and therefore continues. And then you would have in the same town or in the same city, the finger wagging lady or the finger wagging guy who's trying to impose a rule or a moral code. And that person is neither good nor bad. Sometimes you need, you know, a vegan teacher type in order to bring things back to order. Sometimes it's annoying and that person goes into. Is excessive and pushes too hard and then tries to take all the fun out of reality. And that's when you want there to be a kind of dance. And that's really the way to understand how it is, is that all these different aspects of the world, you know, from the person that the canceler. Because sometimes you actually do need to cancel people. You know, that's what jail is for. That's what. When someone breaks the rules you have, there has to be consequences. And for all intents and purposes, that's a kind of canceling. When you put someone in jail, you're canceling them from society for a certain amount of time. Now that is absolutely necessary for any society to exist. And you need that in yourself too. You need that. You need the discipline, you need sometimes to be able to say, you know what? You know, now's not the time to just hang out and to relax. Now's the time to get up and do the dishes, to, you know, clean the house or to, or to get to work, to answer those emails or whatever it is. But then you also need someone at some, some aspect of yourself to at some point say, all right now, that's enough now, go sit down with your friends now. Have a drink now, let's have a nice time together. Let's play a game. Let's do that. And so you need that in your, in your world. And so the, the. And you see, it's like, and it's, and it's kind of annoying and like, I've probably played that game before where people say Spanish Inquisition, you know, the Spanish Inquisition, this horrible time when the, the society was completely against these, these people that didn't fit and you know, accused them and murdered them and did all these things. And it's like, yeah, you know, and you know, people say, yeah, but it's nothing compared to the Gulag. You know, the Gulag was the worst. And no, it's nothing compared to the, to the Nazis and the Nazis that put people in concentration camps. And it's like. And then other people say, well, it's nothing compared to the American prison system where it's like 1% of the population is in prison and etc, etc. Like, you know, the truth is that these patterns exist all the time everywhere. And that's, and that we have this balancing act. And for example, the very fact that in certain quarters of society we only see, especially now we see that like it can help you see where we are in the world, it. We only see the moments when there was constriction on the outside. Like, we only see the moment when the society became very strict and tried to exclude people from it. We only see that as negative. And we for some reason can't remember or can't see the moments where the opposite was true. The moments where things were let loose way too much and that, you know, people stopped having children, people started to work only to do only things in order to have pleasure or to, you know, to kind of. And, and moments when society falls apart, like at the end of the Roman Empire, of course, and. But there are different times that, that happened as well in our society. Some of those times, you know, are very close to the moments where we, we consider things like the Spanish Inquisition, you know, it's like the Renaissance courts, for example, or even later, you know, the, some of the Enlightenment courts were very chaotic, you know, and, and were very open and anything was possible. And they let all kinds of behaviors into their courts, kind of immoral and dangerous behaviors which led to the breakdown of the cohesion of the society. So there are many times when there have been excesses of one or the other on each side. But it's mostly important to be able to understand this as a structure. And why is it important to understand as a structure? Because we want to be able to recognize when it is that certain behaviors, the finger wagging lady or the canceling or the putting people in jail is a necessary part of society and when that's okay and also be able to recognize when that goes too far and when it becomes a prison state, when it becomes a kind of totalitarian type of regime. And we also have to be able to see that it has nothing to do with, with the ideology behind it. It has nothing to do with the idea that, oh, these religious people, they made this happen and it's because of religion. Well, if you think that, then you'll be ignorant to the way in which your own ways of thinking and your own excesses could bring about the exact same thing. And sometimes, especially now, sometimes worse in both ways because of technology and because of the power of technology, now we have access to way more excesses on each side. Both the kind of dangerous, cancel, destroy, destroy people's lives side, you know, with the, with surveillance and also, I mean, we haven't seen it in a while, but you know, the idea of a, of a, of a extermination policy that would happen today would be very easy to implement compared to, you know, in The Middle Ages with technology. And so the same with the, the kind of openness and this capacity to engage in behaviors that tend to, that tend towards pleasure, that tend towards openness and to exploration and all of that. Now there's way more possibility of that. And so we have to be attentive and see how these are just modes of being in society. And it is not very useful to simply point out the ones that are in the camp that we don't like to simply point out that, you know, the inquisitional types that are religious or areligious, you know, or the kind of decadent type that is either, you know, the decadent popes of the 16th century or whether it is the decadent, you know, diddy party types that exist now that they have nothing to do, like I said, with the, the world in which you're involved, they're just modes of being that can become out of control. And so we have to be attentive to that in ourselves, in our societies and all around us. And hopefully that will also first of all make us more perceptive of what's going on. And it'll also hopefully make us more humble because you've got that inside you as well. And you have these different aspects of being inside you and you have to be careful not to let one or the other take over, you know, and so it's like there's not much difference between a, you know, between an inquisition person in terms of society and your ocd, you know, obsessions. And there's nothing, there isn't that much difference between the same, like the, the tendency in the society, the kind of more pleasure seeking or exploratory aspect of a society. And you're also desire to kind of explore new things and to see new things, but then also sometimes to let yourself go and not be, not be disciplined. So hope this was useful. Thanks again for your help. Thanks for your attention. Don't forget you can go to the symbolicworld.com and you can become a member anytime. We have free members that have access to our community there. And also there are paid members with different tiers, different perks for different people to support what it is that we do. So thanks everyone for your attention and I'll talk to you very soon. Bye bye."}
