{"episode_id":"SW - #254 - 2022-09-21 - God Save The King","start":0.16,"end":12.04,"speaker":"Jonathan Pageau","text":"With the passing of Queen Elizabeth ii, I would like to look a little bit at the legacy that she has left behind, to look a little bit at the symbolism of monarchy itself and."}
{"episode_id":"SW - #254 - 2022-09-21 - God Save The King","start":12.04,"end":26.08,"speaker":"Jonathan Pageau","text":"Maybe have a few thoughts on the new king, our new king as a Canadian, Prince Charles iii. Some things that the people in the symbolic world, few thoughts that hopefully will. Will be things that we need to pay attention to in the next."}
{"episode_id":"SW - #254 - 2022-09-21 - God Save The King","start":37.98,"end":41.5,"speaker":"Jonathan Pageau","text":"This is Jonathan Peugeot. Welcome to the symbolic world."}
{"episode_id":"SW - #254 - 2022-09-21 - God Save The King","start":51.74,"end":999.43,"speaker":"Jonathan Pageau","text":"So whether or not you agree with the notion of monarchy or constitutional monarchy, I think that most people agree that Queen Elizabeth II was a very impressive person. She had a very impressive demeanor. The way that she was able to engage with people all through her life, the manner in which, you know, different from her own children, was capable of avoiding scandal and in her own life as well. And I think that for many people, she will be missed. And so right now, we. A lot of people are talking about the transition, whether or not this will be an opportunity here. Here in Canada, especially, you hear people saying whether or not this is an opportunity to question the monarchy, to question the institution, if it would be a good time for Canadians to get rid of the constitutional monarchy as the source of our government. And I want to talk a little bit about some of the symbolism of monarchy, let's say, some of the negative aspects and some of the positive aspects that you find in Scripture, but also in history. In Scripture, monarchy is presented actually in a double way. On the one hand, in the Book of Samuel, it is presented as something which at the outset would be negative, that the people are clamoring for a king instead of worshiping God or instead of depending on God. So it's as if they want to put a king in place of God. And because of that, Samuel warns them that the king will take their children, you know, will. Will take the best of them to fight in their wars and as. And. And their daughters as wives. And so there's a sense in that, that the king can become a place of attention, which could take away from the attention that we need to put on God, because it's a kind of. It's a place where all the attention meets at the top. But there is also another testimony in Scripture about the king, which is that in the Book of Judges, you have all these prophets that come, but the prophets come and go, and there are these cycles of prophets, and the prophets come, and then something happens and the prophets go, and then things turn into chaos. Sometimes the prophets bring about a kind of chaos or a kind of confusion because of people making Promises that they can't keep. And so there's a sense in which, in the Book of Judges, the stories that you have there are very much related to the difficulty of. Of heaven and earth connecting together and how they tend to disconnect, especially in the idea of making a promise which is untenable. You know, you have that story that is similar to the story of Beauty and the Beast where, you know, a father promises to sacrifice his daughter. And then it's like this crazy thing that. That he does, this crazy promise that he. That he makes. And so there's many images of that. Of course, the story of Samson is also about the difficulty of joining heaven and earth, represented in many extreme images. And then it says in the Book of Judges, constantly, like, there was not yet a king in Israel, as if now the king can also be seen as a hook or an anchor which can join heaven and earth together properly if. If it's done right. So you could see. Say that you could also see in. In general, as something like how God transforms the fallen institutions and the fallen structures into something which can also function for his glory. So although Samuel says the reasons why you want a king are the wrong ones and that a king will be dangerous to you, nonetheless, the king, King David and King Solomon are the ones who build the temple. And the temple becomes an image of a further image moving towards the new Jerusalem, the heavenly Jerusalem, which comes to the end of Scripture. And in Christianity, we also have a sense in which the king is a possibility, a place where heaven and earth can hook together. If the king is submitted to God, if the king receives his crown from the bishop, if the king submits his worldly authority to a higher spiritual power. But even in Christianity, there's always a danger, which is that by giving so much power and authority to one person, there is, of course, the danger that that can be misused and that they can take it for themselves, become prideful, and then act in their own name rather than acting under the will of God. The crown that they've received from above. You could say that they have to receive the crown from above. There's a tendency to want to take that crown for ourselves. But the image of the king is nonetheless an image which is used without any apology in Scripture to speak about a way to understand the role that God has in the world and also a way to understand Christ. One of the aspects of Christ is to understand him as a king, as an emperor. And there are many images in the tradition which use that image. And so the king just like any worldly manifestation is a position is an image that can be ambiguous or they can have two sides. If those sides, if the position is not oriented properly, is probably the best way to understand it. But one of the things that the king and the royalty can do is act as a visible point above multiplicity, which is able to gather attention and is able to make us recognize that we participate, that we are one, that we are together, that we share an identity. And so we could see that, for example, the crown in the UK has acted that way very much. And you see it also not just in the uk, but in other countries that still have royalty, that when there's multiplicity within the people. So if in the UK you have Ireland, you have Scotland and then you have England, but you also have Wales. And so you have all these cultures that exist and have a very long and fraught history together, but they are all able to recognize in the royal family something which is not bound in all these small provincial conflicts. Often that happens through the royalty actually being a joining of the different tribes. Right. So when we talk about, you know, the idea of marriage alliances as joining people together, we sometimes think that it's strange and superstitious and that this is like, why is it that, you know, some king marrying some princess from some land is going to join people together? Like, why is that happening? Well, it is because their children will not have only one identity. Their children will have an identity that is joined together and contains more identity together. And so that will reflect itself not just in their biological DNA or whatever, but will manifest itself in also their allegiance and their attention. That is, their attention will be something like a joining of two possible allegiances into one. And so the children of the union will transcend the multiplicity that is down below. And so that is of course the ideal. It doesn't always happen that way. They're obviously like in every human system there are times where it goes astray and that it doesn't do that. But you can understand at least the principle of why something like that would be useful. So you could imagine like the difference between mixture. So all these royal families in Europe were all non national to a certain extent, because they were all marrying amongst each other and they were like a, they were like a transnational people, but that also had allegiance to their nation. That is, the king is beyond the squabbles that can happen between the, between England and Wales, let's say, between the different, the different cultures, but that he is responsible for those squabbles. And so Therefore is engaged, let's say from above to trying to reconcile them and trying to bring those, those differences together. So that is obviously a role that the King has played in history and that still plays, I think, I think that the British crown still actually plays that role today and joins together in a kind of allegiance all the English speaking nations, you know, that have their history in their connection to the crown. So that is something that can help us understand it and also it can help us understand why often these royal, in the modern world especially a lot of these royal characters have played more ritual roles, that they have ritual function rather than a direct state function. And we tend to think that sometimes that's useless. What's the point? Why do we put all this money into having these people or this person at the top that actually isn't making the laws, that isn't involved in the, in the laws, but it becomes ritual because it is in a way a manner to bind our attention and to bind our allegiance and to bind all these things together towards a person. And that happens like in church, it happens in processions, it happens in parades, it happens in the ceremonial person at the top giving honor to other people, knighting people, doing all this kind of stuff which, which seems like a, it can seem to some people at least like just superstitious nonsense, but is a manner in which they bind the nation together and give a direction and give quality to what it means to be, you'd say in the British Commonwealth, something like that. And this is something which, for example the ceremonial aspect of a ruler is something which has happened many times in history before in the Byzantine heavy empire, in the Byzantine state, let's say it was customary or it's something that happened quite a few times where there was a separation between the ritual aspect of the emperor and the legislative or more state related aspect of the emperor. Sometimes that would be separated into two people. So there would be kind of co emperors, one who would be in Constantinople and would, would participate in the church services, the liturgies, the processions, all these, all that, what we could call pageantry but which was there to participate in the identity of Byzantium and to gather people into that identity. And then there was someone else who was more kind of the practical emperor who was involved in deciding where to go to war and you know, to deal with all that, that kind of stuff. So when we see that the British crown has become almost only ceremonial, I think that we don't necessarily have to think that that is only bad that it actually has a Function, which is not just purely economic. It has a function that has to do with identity itself. Now, as we come to this transition and we move towards King Charles iii, you know, a lot of people have many criticisms to offer to the royal family and to the children of the Queen. But there are a few things to think about in terms of this King Charles, who is attaining the throne right now. Of course, he does have scandals in his life. You know, the whole story with Princess Diana and then is cheating on her and his other relationship, all this stuff. There is, of course, that there is. There are some people also that find that he lacks the kind of backbone and the kind of presence that would be needed to replace someone like Queen Elizabeth ii. But there are also other things to think about now in terms of the symbolic world people. It's interesting to remember, for example, that Prince Philip, his father, was born Greek Orthodox and became Anglican later in order to marry the Queen, but also kept a relationship with the Orthodox world. And that relationship seems to have been passed down to his son. And so King Charles has a very profound relationship with some of the elders on Mount Athos and gets advice and travels there. Maybe he won't do it so more, but used to travel there quite a bit in order to engage with the monks at Mount Athos. And so he has a deep sympathy for that. That is also where he met, for example, the iconographer Aiden Hart, when they were both in Athos. And at the same time, King Charles has a sympathy for traditionalists or perennialist authors. There's a video going around that people have been passing around and being surprised. You know, this is something that I've known for very long time, but I. But I understand why some people are surprised to realize that he, that he has been a supporter, financial and just in terms of giving his approval to many of the perennialist efforts, the journals, the conferences. And also he started a school in London called the Prince's School of Traditional Arts, which is trying to restore traditional vision of art. Aidan Hart is a professor there, and the school is run, though, is run by Sufis. And so this is also where, on the one hand, there is a positive aspect to his relationship to perennialism, that is that he does seem to at least care about the notion that there are principles manifest that are manifesting in the world, that there are eternal patterns and eternal, let's say, realities that infuse the world of manifestation and that hold it together, that traditional religions are part of that. All of that seems to be. To be the case. But at the Same time, there is a danger in perennialism, which I've mentioned. And I think that we can actually see the danger of perennialism in this case, which is that there's a danger in that perennialism actually does the opposite of what the first authors of that group wanted, which is that the first authors of the group wanted something like to show the transcendent principles behind the different religions, but that you also should embody one particular path and that you should be engaged in one. One particular path. But when you talk like that in public and when you put those ideas out like that in writing, there's a manner in which people will start to act as if they are beyond the traditions. They'll start to compare religions, and they'll have all these journals and things of comparative religion that will take up more and more space. And at some point, they will start to act as if they themselves are above religion and that they can look at all these religions and kind of compare them and judge them and see what's good in all of them. And so that leads to something like globalism and a kind of relativism. And I think that that seems at the same time, although it's very fascinating to see how it seems like that the King Charles's perennialism seems to, at least to a certain extent, have led him into the arms of the World Economic Forum and to these kind of global agendas and this kind of global soup that seems to be manifesting itself like this kind of global moving towards something like a world government or something like that. He seems to have been on board. Now, I don't know to what extent he is. To what extent he is just superficial in his allegiance to these things. This is something that we will see in the next few years, but I think it is definitely something that we should be paying attention to and watching and seeing, being able to recognize whatever good comes out of his kingship and also be attentive and be able to recognize what is dangerous and what moves towards the kind of postmodern slosh, you know, whatever that is setting itself up. And so at the end of this, all I can say is, indeed, the Queen is dead. God save the King, and may he be worthy of that title."}
{"episode_id":"SW - #254 - 2022-09-21 - God Save The King","start":999.43,"end":1006.03,"speaker":"Jonathan Pageau","text":"I hope you enjoyed this episode of the Symbolic World. The Symbolic World is based on a series of videos that you can find."}
{"episode_id":"SW - #254 - 2022-09-21 - God Save The King","start":1006.03,"end":1009.19,"speaker":"Jonathan Pageau","text":"On my YouTube channel, Jonathan Pedro's YouTube channel."}
{"episode_id":"SW - #254 - 2022-09-21 - God Save The King","start":1009.19,"end":1018.69,"speaker":"Jonathan Pageau","text":"You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion."}
{"episode_id":"SW - #254 - 2022-09-21 - God Save The King","start":1018.77,"end":1021.73,"speaker":"Jonathan Pageau","text":"I will put a link to that in the show description."}
{"episode_id":"SW - #254 - 2022-09-21 - God Save The King","start":1021.81,"end":1034.29,"speaker":"Jonathan Pageau","text":"And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course, leaving a review on itunes."}
{"episode_id":"SW - #254 - 2022-09-21 - God Save The King","start":1034.29,"end":1036.31,"speaker":"Jonathan Pageau","text":"Everybody knows that's the best way to."}
{"episode_id":"SW - #254 - 2022-09-21 - God Save The King","start":1036.46,"end":1061.42,"speaker":"Jonathan Pageau","text":"To get the podcast out there, to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon, the Pageau videos as well, and on subscribestar, all those links you can find on my website or in the show description. So thank you and I will see you soon."}
