{"episode_id":"SW - #407 - 2025-09-05 - Heather Pollington - Rapunzel and the Evil Witch","start":0.16,"end":59.17,"speaker":"Laura Diaz","text":"Tucson, the Weight is Over Mediweight Loss. They're officially open on North Oracle Road. That's right. No more counting down the days. You can walk in right now and start your journey to a healthier you. Hey, it's Laura Diaz from iheartradio and you can trust me. This isn't just another weight loss clinic. I know that because it's where I lost weight safely with real medical support. GLP1 medications. You can see them everywhere online right now. But the truth is your health shouldn't be a DIY project ordering these meds without the professional guidance. It can lead to dangerous mistakes, wrong doses, no oversight and serious risks at mediweight loss. I got the same medication but with a customized plan, weekly check ins and a licensed physician guiding me every step of the way. And the cost? The same as those risky online options. Tucson, your moment is here. If you're ready to take control, feel better and lose weight the right way, mediweight loss is ready for you. Walk in, get started and see real results. Call or visit mediweightloss.com to learn more and book your free consultation today."}
{"episode_id":"SW - #407 - 2025-09-05 - Heather Pollington - Rapunzel and the Evil Witch","start":59.25,"end":109.18,"speaker":"Jonathan Pageau","text":"That's mediweightloss.com Rapunzel and the Evil Witch is officially available right now. It is not in pre sale. It is not a pre order. It is in the warehouse. You can just go to rapunzelbook.com and you get the book. We have a new distribution system which has just been amazing. People are getting their books in a few days. All the pre sale and pretty pre order books have already been shipped. People already have them and so this is the third book where a lot of the symbolism is going to come out. It's our celebratory tone. The third book in the series of the Tales for once and ever illustrated by Heather Paulington. This is where the symbolism is going to start to show, where the characters are going to are going to repeat. So I'm particularly excited about this book and the continuation of this series and so go to rapunzelbook.com now and you can just get the book get it in a few days."}
{"episode_id":"SW - #407 - 2025-09-05 - Heather Pollington - Rapunzel and the Evil Witch","start":109.2,"end":109.36,"speaker":"Heather Pollington","text":"So."}
{"episode_id":"SW - #407 - 2025-09-05 - Heather Pollington - Rapunzel and the Evil Witch","start":109.51,"end":156.04,"speaker":"Jonathan Pageau","text":"So thanks everyone. Hello everyone. I'm here with Heather Pollington. As many of you know, we are getting ready to put out our third fairy tale book. We've already sent it to some people in a kind of quick pre sale and the reactions have been really great. We're quite excited because in some ways it feels like this book has been the culmination of the last two in terms of storytelling but also in terms of the art, Heather is the one who's illustrated it. And it feels like Snow White was like practice for this one. It's hard to believe because Snow White was so beautiful, but people are just being, are amazed. I've been just amazed at what has been going on in the art of this book. So we're quite excited to present it to you. And so, Heather, thanks for, thanks for coming to talk about it with me."}
{"episode_id":"SW - #407 - 2025-09-05 - Heather Pollington - Rapunzel and the Evil Witch","start":156.2,"end":157.4,"speaker":"Heather Pollington","text":"It's good to be here."}
{"episode_id":"SW - #407 - 2025-09-05 - Heather Pollington - Rapunzel and the Evil Witch","start":169.14,"end":172.58,"speaker":"Jonathan Pageau","text":"This is Jonathan Pedro. Welcome to the symbolic world."}
{"episode_id":"SW - #407 - 2025-09-05 - Heather Pollington - Rapunzel and the Evil Witch","start":182.98,"end":194.74,"speaker":"Heather Pollington","text":"Yeah, I'm really excited it's coming out because I think I worked on it for about a year on and off. So it's been a long time coming. So it's good to see now that we're here and we can share it with everybody."}
{"episode_id":"SW - #407 - 2025-09-05 - Heather Pollington - Rapunzel and the Evil Witch","start":195.29,"end":279.97,"speaker":"Jonathan Pageau","text":"Yeah. And I mean, one of the things we're trying to do and people I think can see in the images is we're really trying to be deliberate about what we're doing about the images. And so that's why obviously it means that we can't just put these out every month or something. We have to put out one or two a month. But it's because we also want them to be, to be absolutely excellent in every way. And so we spent a lot of time talking about how to. Let's say, one of my dreams from the very beginning of the art that I was making was in some ways to integrate medieval and Byzantine style tropes into popular culture. And so I was doing that, you know, making T shirts, trying to figure out how to do that. We did that a little bit in the first God's Dog with Kord, trying to have a few tropes and stuff. And when I met Heather, I found an amazing partner in this particular crime. Like she was all, all in. And she also had the. She was able to see things almost like through my eyes. And I could. I was always amazed at what she was coming up with. And in this particular book, we really, we really hit, I think, a high note on that. And I think it's going to be an example for people of how to, how to do that in some ways. So we thought we would go through some of the work that she's done, some of the, you know, some of the decisions that she's made. And we're going to show you a lot of the illustrations of the book. So it's going to be great."}
{"episode_id":"SW - #407 - 2025-09-05 - Heather Pollington - Rapunzel and the Evil Witch","start":280.37,"end":460.89,"speaker":"Heather Pollington","text":"Yeah. So just before I show the images, I just wanted to talk a little bit about my journey to Rapunzel. So it was, it was in 2013, when I was working for Disney and I did this film called into the woods, and that was the main set that I worked on. And I really fell in love with the Rapunzel story as an adult because obviously I'd read it as a child, came back to it and got really interested in the. The design of the tower and things like that. And then shortly after that, I had my daughter, and when she was about five, we were reading Rapunzel together from the library, but it was like a new edition. And the ending of that book, I think I told you about it, Jonathan had the prince and Rapunzel not getting married, but Rapunzel lived next door, is his engineer at the end. So I think we know that's kind of an extreme, you know, solution. But what I was finding, I was kind of asking myself, why is this happening in culture? Why are these fairy tales being messed around with? And I think there was a couple of reasons. I think the sort of the feminist criticism of these stories, they. They did kind of have some justification in the way that the stories are presented in the 20th century because they tended to be, you know, the princesses weren't very well rounded. They tended to be presented sort of through the male gaze, as they would say. But I also found that a lot of the other versions of Rapunzel that had been around for the last 10 years were kind of. Had been kind of emptied out. And I had this vague memory of childhood where the prince actually became blind and it seemed to disappear. So there was two aspects that were missing from. For me, and this is around kind of five, 10 years ago, the prince going blind had disappeared and the cabbage had kind of disappeared and replaced with a flower or, you know, through various versions of the tale. And then surely after reading that, the Rapunzel as engineer, I happened upon one of your videos called the Symbolism of Hair. And I was just really impressed with how you'd managed to recover the sort of traditional tale, but also kind of answer to the modern concerns with some of the fairy tales. And I thought that was really enlightened. So I was intrigued by your reading of Rapunzel. And then obviously, when we started working together, this opportunity came up, and I really wanted to see if I could kind of speak to what you were doing in a visual way, therefore, kind of uncovering, like, traditional ways of presenting story, you know, from medieval artists, from iconography, and seeing if that could answer to some of the kind of issues today in the sort of. In the visual landscape that we find ourselves in."}
{"episode_id":"SW - #407 - 2025-09-05 - Heather Pollington - Rapunzel and the Evil Witch","start":461.29,"end":576.61,"speaker":"Jonathan Pageau","text":"Yeah, I mean, it's funny because I think that your concern is really the same concern that I have, which is I do think that some of the feminists and postmodern critiques of the 20th century version, like you said, like, some of the. Even some of the Disney stuff wasn't completely off. You know, those movies are still beautiful, but they do have a tendency. And the fairy tales are far more subtle. I think the old fairy tales are far more subtle. And in our version of Rapunzel, we really have the two characters going on their own transformational arc, and they both in some ways have something lacking in the way that they're being and the way that they're acting, and they have to kind of recover. They kind of. And the prince even more in this version. In some ways, the prince in our version is a little weak and is a little. And isn't really doing what he should be doing. And for that reason, he kind of has to. He has to learn a pretty rough lesson, you know, before they're able to be together. And that's what both. Both. It's like as if they both have to learn a lesson before. Before they. They come together. And so. Yeah, yeah, yeah. That. It's. I mean, I. I didn't. It's funny because the story of Rapunzel, the Disney version, the Tangled version, you know, they. There are some things they did in that. Which were. Which were good. There were some ideas that they had in order to kind of make the story make sense that were fine, but there are also a lot of decisions that made it irrelevant. Like the question of hair in the story was. Just lost its meaning. You didn't even know what the meaning of her hair was. In the Tangled version, they kind of use it as a plot device. You know, she does all these funny things with it, but it. It lose it. It lost its. It lost its sense because the. The prince isn't even there because he's attracted to her. He's there for accidental reasons, and he's there because he wants to steal a crown. All this stuff. And. And so what. What. What's going on? Like, what is the hair actually."}
{"episode_id":"SW - #407 - 2025-09-05 - Heather Pollington - Rapunzel and the Evil Witch","start":576.69,"end":615.97,"speaker":"Heather Pollington","text":"Yeah, yeah, yeah. I was also interested because one of my favorite novels is called. It's called Jane Eyre, and it's seen as a kind of early feminist novel in English literature, and that has actually the same pattern in it that the male protagonist has to become blind before he can actually marry the female protagonist. So I was interested in this idea that seems to be elsewhere, you know, in. In the kind of psychology and the storytelling and how that might relate to Rapunzel. So I just noticed that and thought there is a connection. And you seem to. You seem to answer to. To all of these things. So that was really exciting."}
{"episode_id":"SW - #407 - 2025-09-05 - Heather Pollington - Rapunzel and the Evil Witch","start":616.29,"end":639.89,"speaker":"Jonathan Pageau","text":"Yeah. And it's. I mean, and it's like this story just. It just tags on in some ways to the Snow White story in a really interesting way. It's like the opposite of Snow White, but a lot of the same tropes and questions are being dealt with, like the question of superficial beauty or the question of external beauty and the difference between internal beauty. And there's also the fall and the thorns. Like, there's just so much going on."}
{"episode_id":"SW - #407 - 2025-09-05 - Heather Pollington - Rapunzel and the Evil Witch","start":640.27,"end":640.59,"speaker":"Heather Pollington","text":"Yeah."}
{"episode_id":"SW - #407 - 2025-09-05 - Heather Pollington - Rapunzel and the Evil Witch","start":640.75,"end":658.67,"speaker":"Jonathan Pageau","text":"You know, we. That's. In some ways, people will see when they read it. They'll see. I even treated the story of Rapunzel and Snow White almost as opposites, almost as. Here's an excess on one side, here are excesses on the other side and how they. They answer each other. Definitely excited to see how people. People reading it and seeing what they think."}
{"episode_id":"SW - #407 - 2025-09-05 - Heather Pollington - Rapunzel and the Evil Witch","start":658.83,"end":674.02,"speaker":"Heather Pollington","text":"Yeah, I don't. I don't think that you explicitly explained that to me, but we kind of. I instinctively did some things in the visuals that. That. That helped that association. So hopefully people will find that as we go along. But shall we have a look at some?"}
{"episode_id":"SW - #407 - 2025-09-05 - Heather Pollington - Rapunzel and the Evil Witch","start":674.02,"end":675.82,"speaker":"Jonathan Pageau","text":"All right. Yeah. Let's get some of the images."}
{"episode_id":"SW - #407 - 2025-09-05 - Heather Pollington - Rapunzel and the Evil Witch","start":676.38,"end":896.61,"speaker":"Heather Pollington","text":"So here's our title. As you can see, it's in. In the same style as the. As the Snow White book we did. It was important. We had that continuity. And I just wanted to share these really early sketches that I did. I don't normally show sketches, but I think it's important to see the. The narrative of making a book like this because people always see the finished version, but things can start quite loose. And I think my intention here was really just to find the characters we see now Rapunzel here as she is in the tower. And then I was figuring out how she might look at the end of her arc. And then also just doing some samples on the prince's hair and his crown that has some of the details from Snow White's dress, because he's actually her son. So figuring out all those details without worrying too much about the sort of illustration compositions. And the biggest challenge in this book was developing the witch because she's obviously a character that's come from the Snow White book, but we're seeing her many years later, and she's very much transformed and just very loosely thinking about how she might have changed how her kind of vanity and love of jewelry might be transformed into, you know, new styles by her situation. Because now she's a witch living in a cottage. She doesn't have access to jewels anymore, so she's making necklaces from bones. She still has her headdress, but it's a different shape, and it's ornamented with, like, a spider's web. So. So we're just trying out all those ideas at the beginning in a very loose way. And then, like I said before, I definitely wanted to look into the same kind of styles that we'd used in Snow White, and largely because in the style of iconography offers you a series of devices for telling stories in a very direct way. Like, you know, you talked many times about how, you know, perception is primary, and iconography tends to lend itself to kind of an aesthetic of perception. So we can. We can play around with scale, we can play around with color, we can play around with different perspectives to tell our tale. But obviously, with the icon tradition, that is intended for a particular purpose, and we needed to find something that would work in the world of fairy tales. So in my research, I happened upon the Palec tradition, and I told you about it straight away, didn't I? It was very exciting to discover, and I'm sure if there's any listeners who are familiar with Russian art, it will be very familiar to them. But the story of Palek is that it was a place in Russia that had a huge history of icon painting, an amazing tradition. But in the 20th century, for various political reasons, they weren't able to make icons anymore. So they turned their skills to making lacquer boxes with these incredible fairy tale illustrations on, and there's many, many beautiful examples. So I looked to that initially because it's. It was. It was the same rules as iconography, but it was a much more kind of florid and whimsical style that was suitable for a kind of much more fantastical universe that we were trying to create."}
{"episode_id":"SW - #407 - 2025-09-05 - Heather Pollington - Rapunzel and the Evil Witch","start":897.25,"end":993.69,"speaker":"Jonathan Pageau","text":"Yeah, there was, in some ways, it took the basic tropes of iconography. The way that space is laid out, you know, the way that the clothing is done, lighting is done, but almost as if it was in a dream. You know, there. There is this. You can see it in the images that you picked. There's a whimsical, and there's an excess which is made possible. You know, all of these mountains, ranges also all of a sudden become, like, stretched out. You know, there's all this smoke and the clouds, and it's really beautiful. You know, some of the. Some of the solutions that these artists came to are really quite stunning. And so how can we integrate it? And it was. For me, it was important that we tried to integrate as much as we could from that style, but also keeping some of the best aspects of 19th, early 20th century illustration, you know, more sensitive faces. Because in icons, there's less emotion that can be read in faces. We're so used to reading emotions in faces in Western art that I thought we. Especially for children's books, we kind of need to still see something in the faces. And you'll see, I mean, Heather came to some pretty beautiful synthesis here. Also, the thing we need to say is that from the moment of Snow White to Rapunzel, you started studying actual icon painting. And so that made a difference in terms of some of the solutions you were able to tap into because you started to master some of the. Especially some of the clothing tropes, you know, some of the folds. Because it's very complex. It's not. Takes a while to be able to master those styles."}
{"episode_id":"SW - #407 - 2025-09-05 - Heather Pollington - Rapunzel and the Evil Witch","start":994.1,"end":994.62,"speaker":"Heather Pollington","text":"That's right."}
{"episode_id":"SW - #407 - 2025-09-05 - Heather Pollington - Rapunzel and the Evil Witch","start":994.62,"end":994.98,"speaker":"Laura Diaz","text":"Yeah."}
{"episode_id":"SW - #407 - 2025-09-05 - Heather Pollington - Rapunzel and the Evil Witch","start":994.98,"end":1091.48,"speaker":"Heather Pollington","text":"I've been studying for nearly three years now with Aiden Hart. And yeah, I mean, it's. It's been an amazing experience. And. And like you say, just a much through that course, a much better understanding now of the. And getting familiar with the language. It just made it easier to draw. So, yeah, I've been a bit on. A bit on a bit of a journey myself, so. But I'll show you the first piece I did. So each of these books has what we call a frontispiece. And I wanted to start with that because, again, it's the first thing that you see in the book. And it kind of establishes the tone of the book, the character. And it was a way for me to see what's the style of this thing. And you'll see on the left is like my first sketch for the frontispiece. And I've been looking at lots of palette books, and I almost made her hair into ornament. And then afterwards, I realized that actually the ornamentation went too far and I kind of lost a little bit of her character. So what you see on the right was a solution of that. And it's somewhere between mannerism and naturalism in terms of the figures. And then we've got more stylized ornament on the outside because, as Jonathan was saying, it was kind of important to keep the. A figurative aspect to the actual characters in there in terms of their facial expression. But in terms of what was surrounding it, but we could go really stylized. So that was the first image that I made and Jonathan really liked it, so I basically carried on."}
{"episode_id":"SW - #407 - 2025-09-05 - Heather Pollington - Rapunzel and the Evil Witch","start":1092.44,"end":1106.65,"speaker":"Jonathan Pageau","text":"Yeah. And I love how we went to the kind of anthropomorphic sun and moon too. That's a great, that's such a great thing in the Palec images. I mean, it's there in icons, but in the Palec images it's, it's quite remarkable."}
{"episode_id":"SW - #407 - 2025-09-05 - Heather Pollington - Rapunzel and the Evil Witch","start":1107.37,"end":1117.37,"speaker":"Heather Pollington","text":"Yeah, that's right. I really love those and I was able to integrate them into most of the images. So you see how the sun and moon change over through the different scenes."}
{"episode_id":"SW - #407 - 2025-09-05 - Heather Pollington - Rapunzel and the Evil Witch","start":1117.93,"end":1131.53,"speaker":"Jonathan Pageau","text":"And I love how you did this intertwining of thorns and hair. It's such a great, such a great. Sometimes Heather comes up with these solutions that I never would have thought of. And when I see them, I'm like, oh, this is so right. It's just like, it's just perfect."}
{"episode_id":"SW - #407 - 2025-09-05 - Heather Pollington - Rapunzel and the Evil Witch","start":1133.41,"end":1205.28,"speaker":"Heather Pollington","text":"Okay, so this is the opening page and I was looking at this this morning and remembered actually that the image that you see on the left here was actually taken from a mosaic in Sicily of Adam and Eve after the fall. And obviously, like, I don't know how conscious you were of this, Jonathan, but I think when I read this opening passage, I couldn't help thinking about it because you've obviously got a situation where you've got a woodsman, they're poor, she's pregnant, you know, it's exactly like Adam and Eve after the fall. So I look to that image and then, you know, you've obviously also got a garden, a snake in the form of the witch, and like a fruit in form of the cabbage. So even though there wasn't a. There was an echo of it, if you know what I mean, of that scenario that I, that I wanted to kind of hint at maybe in a subtle way. So, and, and obviously here as well, you see the, the witch for the first time. And, and so this is moving on from the sketch, how she's, how she's transformed through time. Yeah."}
{"episode_id":"SW - #407 - 2025-09-05 - Heather Pollington - Rapunzel and the Evil Witch","start":1205.28,"end":1266.86,"speaker":"Jonathan Pageau","text":"And some of the things to, to call out, because at first we don't say it straight out who she is. We kind of you, if you're paying attention, you'll discover who she is as you read the story. But you know, some of the visual decisions, for example, to use the belt, like the belt was one of the things you said you decided to do to, if you paid attention to the Snow White book, you recognize that kind of free flowing belt from one of the, from one of the queen images. So, and the same with the little. The little cabin at the top, you know, the little dwarves cabin. And so again, we don't say that it's the dwarves cabin in the story, but for the children. We're hoping that the kids that are attentive will start to pick up. I already saw someone on. On X posting images of their family. They read Rapunzel and they said, we finished Rapunzel. And we all immediately went back and you can see the kids, you know, with like, puzzled looks, going through Snow White and through Jack, trying to. Trying to. Because I guess they had this sense that there was something going on and then going back and finding all the details. So it's fun."}
{"episode_id":"SW - #407 - 2025-09-05 - Heather Pollington - Rapunzel and the Evil Witch","start":1266.86,"end":1314.81,"speaker":"Heather Pollington","text":"That's so good to know. Yeah. People are actually looking for it because there is quite a lot there, I think, between the books. Okay, so the next image. So this. This is kind of like the eating of the fruit moment where he's picking the cabbage. And at this point we've got the. The witch in the background as a shadow because he can't really see her. And then his wife dreaming of the cabbage, and we see the little baby that's growing inside her. So this. I think this one was influenced by more by medieval manuscripts, you know, because it's got that decorative border, and I want. I really wanted to show the garden kind of elevated and flat here behind him. So it's quite a weird composition, but."}
{"episode_id":"SW - #407 - 2025-09-05 - Heather Pollington - Rapunzel and the Evil Witch","start":1315.85,"end":1335.11,"speaker":"Jonathan Pageau","text":"It'S such a great solution. I mean, people looking, you can see the border of the garden comes down and then becomes, in some ways, you know, kind of flips and then becomes horizontal and then becomes the bed in which she's sleeping. It's such a. It's such a simple, elegant solution, but it's quite. It's quite powerful."}
{"episode_id":"SW - #407 - 2025-09-05 - Heather Pollington - Rapunzel and the Evil Witch","start":1336.47,"end":1337.03,"speaker":"Heather Pollington","text":"Yeah."}
{"episode_id":"SW - #407 - 2025-09-05 - Heather Pollington - Rapunzel and the Evil Witch","start":1337.35,"end":1365.06,"speaker":"Jonathan Pageau","text":"And so. And then the trope is. The trope for us was really emphasizing in some ways the fact that it really is a sin that the. That the man and the woman are engaging in, and a sin in the technical sense, in the sense that the woman in some ways has this desire for the cabbage. And even though they start to see the consequences, they start to understand what the consequences might be of them taking this cabbage. They do it anyways, and then they kind of have to pay the price."}
{"episode_id":"SW - #407 - 2025-09-05 - Heather Pollington - Rapunzel and the Evil Witch","start":1365.86,"end":1378.26,"speaker":"Heather Pollington","text":"That's right. And I think if you look at the flowers on the outside, I drew them in a way that kind of suggested alarm. Like they're kind of prickly and, like spreading out because something uncomfortable and bad is happening."}
{"episode_id":"SW - #407 - 2025-09-05 - Heather Pollington - Rapunzel and the Evil Witch","start":1379.54,"end":1415.98,"speaker":"Jonathan Pageau","text":"And one of the things I wanted to catch in this, which, you know, when you read these stories, often there are some narrative elements that aren't, to me, that are there hidden in the story, but they're not made explicit. And so sometimes for modern readers, you can't actually see the narrative. The narrative logic. So one of the things that I. I did in. In my book is basically the witch, when she says, if you take my cabbage, I'm going to steal your child. It's as if she doesn't totally mean it at the beginning. She's just saying that to say, like, get away from my cabbage patch and if I see you again, I'. But then he comes back."}
{"episode_id":"SW - #407 - 2025-09-05 - Heather Pollington - Rapunzel and the Evil Witch","start":1416.46,"end":1416.82,"speaker":"Heather Pollington","text":"Yeah."}
{"episode_id":"SW - #407 - 2025-09-05 - Heather Pollington - Rapunzel and the Evil Witch","start":1416.82,"end":1437.5,"speaker":"Jonathan Pageau","text":"And then she thinks, what? This guy's willing to trade his child for a cabbage? What a horrible parent. So I should take their ch. I should take the child. I would make a much better parent than that. Obviously, she's wrong, but you can almost see there's the. There's. I wanted to, like. I wanted you to be able to see how in her, from her point of view, the logic of taking her child was. Was arrived at, you know."}
{"episode_id":"SW - #407 - 2025-09-05 - Heather Pollington - Rapunzel and the Evil Witch","start":1437.74,"end":1477.47,"speaker":"Heather Pollington","text":"Yeah. Yeah. The next one is her eating the cabbage. And I think I mentioned to you I was drawing this when it was Lent and I was fasting. So I was really thinking about that when I was drawing her just, like, laying into these cabbages. And I tried to put that look on her face, you know, like she wasn't really aware of what she was doing. And we have the detail of her covering the bump with the cabbage because it's almost like she's forgotten about the pregnancy."}
{"episode_id":"SW - #407 - 2025-09-05 - Heather Pollington - Rapunzel and the Evil Witch","start":1477.71,"end":1507.32,"speaker":"Jonathan Pageau","text":"Yeah, it's great because with the previous image, you see the baby kind of through her belly, which is a iconographic trope that you see often in some of the images, especially at the. When. When Mother of God meets her cousin and you see, like, the two babies kind of greeting each other. And so I thought it was a great. It was a great idea. And this is so simple. Just show the cabbage in front of the baby and it says everything you need to say about what her decision is."}
{"episode_id":"SW - #407 - 2025-09-05 - Heather Pollington - Rapunzel and the Evil Witch","start":1507.48,"end":1508.04,"speaker":"Heather Pollington","text":"Yeah."}
{"episode_id":"SW - #407 - 2025-09-05 - Heather Pollington - Rapunzel and the Evil Witch","start":1510.68,"end":1513.64,"speaker":"Jonathan Pageau","text":"This is one of my favorite images, I have to confess."}
{"episode_id":"SW - #407 - 2025-09-05 - Heather Pollington - Rapunzel and the Evil Witch","start":1513.72,"end":1530.9,"speaker":"Heather Pollington","text":"Oh, really? I did this about four times. This is about that. Yeah. This is about the fourth attempt, I think, to get it right. And I think you had asked me to get the balance right between kind of creepiness and tenderness."}
{"episode_id":"SW - #407 - 2025-09-05 - Heather Pollington - Rapunzel and the Evil Witch","start":1530.9,"end":1531.3,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #407 - 2025-09-05 - Heather Pollington - Rapunzel and the Evil Witch","start":1531.3,"end":1555.6,"speaker":"Heather Pollington","text":"Which is quite difficult. But, yeah, I wanted her to be, you know, nurturing that baby in a way. But if you look at the. The witch herself, you know, the. The baby is playing with this bow necklace, which is pretty sinister. And then you've got this owl in the background, which is obviously pretty terrifying coming towards you."}
{"episode_id":"SW - #407 - 2025-09-05 - Heather Pollington - Rapunzel and the Evil Witch","start":1556,"end":1575.76,"speaker":"Jonathan Pageau","text":"Yeah. And with the blonde hair, it just works so well. You just really see she does look like she's holding this little golden cabbage, because that's how she kind of calls her, like my precious golden flower. And she kind of plays with the Rapunzel name and the way you did the hair in this one really, really works well."}
{"episode_id":"SW - #407 - 2025-09-05 - Heather Pollington - Rapunzel and the Evil Witch","start":1575.76,"end":1612.37,"speaker":"Heather Pollington","text":"Yeah, so you've got these cabbages in the border, and then. So you've got 1, 2, and then 3 is the actual hair itself. They're almost like the same motif triangle. And this is also the introduction of. Of Rapunzel really being just seen for her hair, because that's what's going to happen in the story. And the witch starts that. She sees the golden hair and that's what she's looking at. And then, you know, the prince continues seeing the hair. So, yeah, I wanted to establish that idea early on. So the next one is."}
{"episode_id":"SW - #407 - 2025-09-05 - Heather Pollington - Rapunzel and the Evil Witch","start":1612.37,"end":1643.75,"speaker":"Jonathan Pageau","text":"The one thing I want to say maybe for people to notice, is that in this book, Heather really tried to make an effort to integrate the pages together. So, you know, in the Snow White book, we had sometimes little details on the text page, but for this one, there really is a. A thought of how the ornament on the left page and the ornament on and the image on the right page go together. You'll see in some of them that it's actually quite integrated in really interesting ways. So. Yeah, that's also one aspect that really increases this book."}
{"episode_id":"SW - #407 - 2025-09-05 - Heather Pollington - Rapunzel and the Evil Witch","start":1644.87,"end":1664.3,"speaker":"Heather Pollington","text":"Yeah, yeah, I think I really tried to do that. In fact, I think I really learned from what Eloise did in Jack, you know, because she's so good at doing spreads. And I really wanted to continue that into this book in a. In a slightly different way, in a more kind of ornamental way, but in a. In an approach that was more holistic."}
{"episode_id":"SW - #407 - 2025-09-05 - Heather Pollington - Rapunzel and the Evil Witch","start":1666.54,"end":1738.19,"speaker":"Jonathan Pageau","text":"Yeah. And so this is. This is for people. So in some ways, what we. We have this progress in the story where in some ways the witch obviously keeps taking Rapunzel more and more into the forest, kind of more and more hidden. And we kind of have it in steps where she built this. This. This little tower at the beginning, this little kind of tall house at the. At the outset. And this is the. This is the first one. And she. She creates this circle of magic, circle of protection around the house, which is what makes her hair grow, because that's also an issue with the story and Rapunzel. Is that obviously fairy tales are great because they don't have to. You don't have to explain it. But for modern readers, like, why does she have long hair, for goodness sake? You know? And so we kind of made the. The fact that she's. The witch is trying to protect her with this dark magic is also making her hair, which analogically makes sense, because that's what hair's for. Right. Hair is there to protect you, it's there to protect your body. And so it makes sense that her hair would be growing. And in some ways, the fact that she's trying to isolate her and protect her is creating this thing that she has, which is also going to attract at the same time. It's doing both at the same time. So it's quite deep."}
{"episode_id":"SW - #407 - 2025-09-05 - Heather Pollington - Rapunzel and the Evil Witch","start":1738.19,"end":1753.23,"speaker":"Heather Pollington","text":"That's right. And it's called the Circle of Protection. But we see also the. The witch's belt is going around the circle. And that's another reference to Snow White, isn't it? Because the belt was one of the things that, you know, kind of strangled her."}
{"episode_id":"SW - #407 - 2025-09-05 - Heather Pollington - Rapunzel and the Evil Witch","start":1753.39,"end":1753.95,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #407 - 2025-09-05 - Heather Pollington - Rapunzel and the Evil Witch","start":1754.99,"end":1764.91,"speaker":"Heather Pollington","text":"And so it's that thing how protection can be oppressive. So it's, it's, it's. It's a kind of guise, isn't it, The Circle of Protection."}
{"episode_id":"SW - #407 - 2025-09-05 - Heather Pollington - Rapunzel and the Evil Witch","start":1764.91,"end":1796.05,"speaker":"Jonathan Pageau","text":"And I love this image. I love this image. There's. There's something also with the colors in this particular book. I think the color is. The coloring is. It's more subtle. Like, there's a subtlety to the coloring. And. Yeah, this is really beautiful. And I think the fact that you've also mastered a lot of the iconographic flowers and iconographic leaves and everything, it makes all of the. All of the. The trees more like ornamentation than even in the white. So."}
{"episode_id":"SW - #407 - 2025-09-05 - Heather Pollington - Rapunzel and the Evil Witch","start":1796.37,"end":1798.31,"speaker":"Heather Pollington","text":"Yeah. So here's another tree."}
{"episode_id":"SW - #407 - 2025-09-05 - Heather Pollington - Rapunzel and the Evil Witch","start":1798.63,"end":1817.99,"speaker":"Jonathan Pageau","text":"Yeah, this. I love this image. This is. Yeah, I love. I love when my daughter saw this particular image. They really. I don't know why. I mean, for me, I mean, it's a beautiful image. But I've shown several. My both daughters really love this. This image. They really kind of said, wow. And there's something dreamy about. About what's going on here, too."}
{"episode_id":"SW - #407 - 2025-09-05 - Heather Pollington - Rapunzel and the Evil Witch","start":1818.63,"end":1856.14,"speaker":"Heather Pollington","text":"Yeah. Maybe it's a less is more thing, because with this particular passage, we meet a boy called Zoran, who's not. He's not a really big part of the story. And so I didn't really want to show him because we're going to see the prince later. So it was a bit like, how can I illustrate something without really showing it? So my solution was let's do a kind of portrait of a tree and have the characters just kind of tiny in silhouette. So, yeah, I'm kind of surprised people like it because it doesn't. It doesn't really show the action that much, but maybe it's more intriguing in that."}
{"episode_id":"SW - #407 - 2025-09-05 - Heather Pollington - Rapunzel and the Evil Witch","start":1856.14,"end":1902.5,"speaker":"Jonathan Pageau","text":"Yeah, there's something. There's something about it. And I think it's also. I mean, it comes close to what it is that I wanted to suggest in the book. Because one of the things I wanted to suggest in the book is, in some ways, Rapunzel has this moment with this boy who takes her up into a tree. And so she kind of goes up high, and then she also has. But she experiences it as a kind of freedom, you know, a little taste of freedom. And then the witch basically uses that and then turns it into a prison. She's like, oh, you like. You like growing up in the tree, did you? Well, I'll put you up somewhere, you know, where you'll always get to have the same view. It'll be wonderful. You'll be, you know. And so she kind of flips her. Her desire for freedom and that experience of elation into. Into a prison."}
{"episode_id":"SW - #407 - 2025-09-05 - Heather Pollington - Rapunzel and the Evil Witch","start":1903.38,"end":1978.23,"speaker":"Heather Pollington","text":"That's right. So now we're seeing the inside of the prison. And, yeah, I think this one started. It's obviously a. An iconic image from Rapunzel. You've got to show inside the tower. But originally I did it in the daytime, and then I think when I was coloring in, I was listening to a Martin Shaw book. Martin Shaw, and it was called, I think, Smokehole. And he was talking about this mythology of something called the Moon palace. And he described it as a place where you can see everything, but there's no connection. And there was something about that that I just thought, well, that's what I'm drawing. So I decided to turn it into the moon tower, and I changed it into kind of nighttime. And I think it really suited the mood that she's isolated and lonely. And it's also a portrait of an inclination that you see a lot these days where people want to raise their daughters, you know, in isolation, you know, with. With an emphasis on the intellect and reading, but not actually giving them access to life experience. And so I definitely wanted that to come across. Yeah."}
{"episode_id":"SW - #407 - 2025-09-05 - Heather Pollington - Rapunzel and the Evil Witch","start":1978.23,"end":2036.86,"speaker":"Jonathan Pageau","text":"And this is really, I think, where you start to see. There's an image in the Snow White book where you see Snow White, you know, as she's being punished, you could say, like, her punishment is to be cast out. And you see her in the house of the dwarves, you Know in kind of rag type clothing and she's cleaning the house. So she's working hard. She's in this little kind of dwarf prison. And it's so wonderful to see how it's the opposite of this. You know, in this one, you know, she's basically. She's been now put. Because she's not a princess, right? Rapunzel's not a princess, she's a commoner. But now she's put in this beautiful, you know, tower, you know, everything she want, you know, she's in this beautiful kind of castle like tower. And she has, you know, she has all of these externals but she's lonely and so, and she has nothing to do. And so she's like the really. It's just, I just find it fascinating. And she's wearing beautiful clothing and she's got her beautiful hair, so it's. Yeah, yeah."}
{"episode_id":"SW - #407 - 2025-09-05 - Heather Pollington - Rapunzel and the Evil Witch","start":2036.86,"end":2057.6,"speaker":"Heather Pollington","text":"And I think that's a really good point about Snow White because that connection to the earth. And so in this case I drew Rapunzel with, she's not even touching the ground. Like she's actually got her feet on her own hair and she's, she's elevated up, away from, from the world basically. Yeah."}
{"episode_id":"SW - #407 - 2025-09-05 - Heather Pollington - Rapunzel and the Evil Witch","start":2057.6,"end":2098.67,"speaker":"Jonathan Pageau","text":"I love just simple solutions that you've done where you have, at the bottom of the image, people can look you, you kind of have the hair swirling around her and then you actually put the trees there as if like her, her hair is like on top of the trees. And so it's. This is, I mean these, that's why iconographic type images, you know, especially if you use them with a little more fantastical, you know, I mean if you're making images for religious purposes, there's a limit to what you can do. But if you use the logic of the iconographic image and then you push it a little more, you can come to some really wonderful formal solutions that are, have so much narrative depth."}
{"episode_id":"SW - #407 - 2025-09-05 - Heather Pollington - Rapunzel and the Evil Witch","start":2099.15,"end":2106.31,"speaker":"Heather Pollington","text":"Absolutely. I mean it's just as a language, it's just really a gift to work with, which is why I love drawing."}
{"episode_id":"SW - #407 - 2025-09-05 - Heather Pollington - Rapunzel and the Evil Witch","start":2106.31,"end":2140.45,"speaker":"Jonathan Pageau","text":"In it, which is why we people, I mean, I think most people watching this are already convinced of this. But you know, when, when I sometimes describe the Renaissance as a, almost like an artistic decadence, this is what I mean is that it's actually quite limiting. It limits what's possible instead of opening it up. Whereas the, the, the, the medieval style had so much possibility in terms of how you could use IM to render something. And then the Renaissance just like narrows it to this snapshot type of composition 100%."}
{"episode_id":"SW - #407 - 2025-09-05 - Heather Pollington - Rapunzel and the Evil Witch","start":2140.53,"end":2244.89,"speaker":"Heather Pollington","text":"Yeah. I mean, it's all completely story driven. So any point you want to make, you really have the tools there to do it. And you're not limited by naturalism. I mean, people will have noticed seeing all of these images, really. I don't largely use naturalistic color. The color tends to be more driven by emotion or drama. Some of it's naturalistic, but yeah, not much. In fact, the next one, I think is probably the most naturalistic image that I did. And that's the green forest. And here we see the external tower for the first time. And this is really drawn as the prince's point of view. So he's encountering Rapunzel, he's in the forest, and all he's seeing really is the hare and the witch and the tower, and he's hearing her voice. And so I've done some musical notes there to, to indicate that he can hear the music. And the design of the tower took, again, took a few goes. Because the Rapunzel tower is quite iconic in this kind of timber, you know, German design. We see it in lots of places and I didn't want to do that and we discussed it and I ended up doing like a mother of pearl room at the top. But I think the whole actual, the whole design was influenced by the Jack and the Giants book because you've got like three steps there of articulation. You've got like the rough rocks and then you've got the stones and then you've got the kind of mother of pearl, you know, articulated mother of pearl, part of the top."}
{"episode_id":"SW - #407 - 2025-09-05 - Heather Pollington - Rapunzel and the Evil Witch","start":2245.53,"end":2299.01,"speaker":"Jonathan Pageau","text":"So, yeah, it's so amazing because we didn't talk about this at all. Like, I didn't say, hey, why don't you make the tower using the same structure as in the Jack book, Like as these three tiered kind of heavens. And then. But then it makes so much sense, like the. Because for those who haven't read the Jack book, the final castle that he goes to is like this golden mother of pearl crystal castle. And so you can see it especially in the image you showed before. And the next one we'll see, like, you really get this sense that this is what's, what's going on here. So it's. Because I also make, in the Rapunzel book, you know, I make a reference, I connect the harp to Rapunzel. And so there's a little bit where in some ways there's. The story of Jack is being told in the Rapunzel book and you realize that there's A connection between the. The singing harp and Rapunzel. So it all. It all just makes so much, so much sense that you did this."}
{"episode_id":"SW - #407 - 2025-09-05 - Heather Pollington - Rapunzel and the Evil Witch","start":2299.64,"end":2395.49,"speaker":"Heather Pollington","text":"Yeah. And. Yeah, interesting you say about the singing heart, because the window there, which is a circular window, is kind of like the voice, you know, like a mouth. And so that explains the design of the window as well. So it's really about music and height and hair. So in the next image, we. When the prince encounters Rapunzel for the first time. And I had a feeling here that I wanted to do a kind of repeat image of the one I did in Snow White, where Snow White encountered the prince in the palace and they. They met each other. And you saw different narratives. He was climbing up the ivy, they were meeting in her room. And I wanted to do. I love. I loved the format of that and thought, wouldn't it be great to do something like that in Rapunzel? But with the Rapunzel Tower, it's so small, I felt like I had to kind of expand the architecture and kind of like a net, like pull it out and then also make that window much bigger so you could really see what was going on. So this is quite a fantastical layout, really, but. And showing the kind of simultaneous narrative of them meeting maybe over 24 hours. They encounter each other, then they meet. And then in the last one, it's obviously, they've fallen in love. And Rapunzel, at that point, you can hardly see any of her except her hair. And that's really what she becomes to the prince. From this point on, that's what he falls in love with."}
{"episode_id":"SW - #407 - 2025-09-05 - Heather Pollington - Rapunzel and the Evil Witch","start":2396.29,"end":2428.35,"speaker":"Jonathan Pageau","text":"Yeah. And I mean, I love how, again, in terms of the difference between Rapunzel and Snow White, in some ways, Snow White, you know, she warns the prince that it's not the time, like, this is too soon when he tries to kiss her. But Rapunzel, in some ways, you know, she's so alone. Like, she's just so hungry, you know, the witch has made. Has put her. By trying to overprotect her, in some ways, she's put her in more danger of the very thing that she doesn't want to happen to her."}
{"episode_id":"SW - #407 - 2025-09-05 - Heather Pollington - Rapunzel and the Evil Witch","start":2428.35,"end":2442.54,"speaker":"Heather Pollington","text":"That's right. She falls in love with the first man who comes her way, and she's got no tools to discern whether he's suitable or not or what his intentions might be. So, yeah, she's. She's. She's more vulnerable than she would have been otherwise, I think."}
{"episode_id":"SW - #407 - 2025-09-05 - Heather Pollington - Rapunzel and the Evil Witch","start":2442.7,"end":2443.18,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #407 - 2025-09-05 - Heather Pollington - Rapunzel and the Evil Witch","start":2443.42,"end":2445.06,"speaker":"Heather Pollington","text":"The next one is, by the way."}
{"episode_id":"SW - #407 - 2025-09-05 - Heather Pollington - Rapunzel and the Evil Witch","start":2445.06,"end":2476.28,"speaker":"Jonathan Pageau","text":"That image, it's like that's the most. The one before that, it is the most. It's like the most Disney. It's the most Disney one. Like in the sense that it is like. I think I love in some ways how. Because we know in the story that we also show the negative elements of this kind of romantic moment. We both show how it comes together at the end, but is also there are some challenges and difficulties. I think it means that it was, it was great to show it though. Like there is something that every 11, like 10, 11 year old girl will look at this and be like, oh, wow."}
{"episode_id":"SW - #407 - 2025-09-05 - Heather Pollington - Rapunzel and the Evil Witch","start":2476.44,"end":2496.56,"speaker":"Heather Pollington","text":"Like, yeah, that's a really good point. I think when I first read the story, I knew there was some dark moments and I did really want to grasp the opportunity of doing something that was light and romantic and you know, just for the contrast, but also to have that moment because, you know, many of us have a romantic soul and, and want to see that."}
{"episode_id":"SW - #407 - 2025-09-05 - Heather Pollington - Rapunzel and the Evil Witch","start":2496.56,"end":2565.11,"speaker":"Jonathan Pageau","text":"So, yeah, I think that's okay. I think that's what's great about these stories, that in some ways you, you, you can show something in, in its fullest sense and then also, then show the consequences in the fullest sense. And like, you can. I think that's what's great about it. It's like it's not just one thing. There are all these things happening in the story and even you could think that a child or even adult reading it in different moments or different moods would pick out certain things more like, would be attentive to certain things more than others and would come at the end. And like my wife read it, it was super interesting and she said, oh, there's some elements in the story that are kind of similar to our relationship, let's say. And I thought, yeah, I think you're right. And she told me what it was. I'm like, oh, that's not the same as what I thought. You know, I had other, other tracks that I thought it was similar to our relationship, but I didn't, like, I didn't push it because I thought it's all there. Like there's all these things that you can, that you can pull and you can see as reflecting. And the same could happen with Snow White or with Jack. You know, there, there are these threads that you can notice that they connect to your, to your life. So I love that."}
{"episode_id":"SW - #407 - 2025-09-05 - Heather Pollington - Rapunzel and the Evil Witch","start":2565.35,"end":2611.09,"speaker":"Heather Pollington","text":"Absolutely. Yeah. The next one is, I mean, the composition of this is quite bonkers, but I just knew elements that I needed to have in there. And so the idea is it's the prince's dream and you can See, again, like he's grasping the hair and he's covered by the hair because that's how he's perceiving Rapunzel. But the reality of what's happening in that window is quite different. And she's obviously under threat from the witch. The witch is closing in on her and so are the thorns. But he's not done anything about it yet. So, yeah, it was bringing all those two things together. And the other thing, for those that are attentive, is that you'll notice he's sleeping in the Snow White castle."}
{"episode_id":"SW - #407 - 2025-09-05 - Heather Pollington - Rapunzel and the Evil Witch","start":2611.97,"end":2614.77,"speaker":"Jonathan Pageau","text":"Oh, yeah. See, I didn't even totally catch that."}
{"episode_id":"SW - #407 - 2025-09-05 - Heather Pollington - Rapunzel and the Evil Witch","start":2616.21,"end":2621.57,"speaker":"Heather Pollington","text":"Yeah. So you might recognize that setup from the Snow White book. So."}
{"episode_id":"SW - #407 - 2025-09-05 - Heather Pollington - Rapunzel and the Evil Witch","start":2621.73,"end":2663.77,"speaker":"Jonathan Pageau","text":"Yes. Yeah. And that's for us, that it's all there in the story. What's wonderful in the Rapunzel story is that you can also show the image of the. Of the man who is a little too taken up by externals and then also isn't willing to make the right sacrifices, you know, and so that's how we present him that he. That he should have rescued her from the tower. Like, he should have figured out a way to do that. And he is a prince, after all. He probably has the means to. To get her out of the tower, but he just kind of just keeps going to see, you know, and then is. Yeah, and so. So then, yes, he's gonna have to pay the price for that. So."}
{"episode_id":"SW - #407 - 2025-09-05 - Heather Pollington - Rapunzel and the Evil Witch","start":2664.09,"end":2666.33,"speaker":"Heather Pollington","text":"That's right. So this is just before the prince's."}
{"episode_id":"SW - #407 - 2025-09-05 - Heather Pollington - Rapunzel and the Evil Witch","start":2666.33,"end":2666.65,"speaker":"Jonathan Pageau","text":"Fall."}
{"episode_id":"SW - #407 - 2025-09-05 - Heather Pollington - Rapunzel and the Evil Witch","start":2669.69,"end":2681.05,"speaker":"Heather Pollington","text":"But he goes on a bit of a journey. And I think this was an interesting aspect that you introduced to the story that we may not know from the original. And that's his interaction with a hermit."}
{"episode_id":"SW - #407 - 2025-09-05 - Heather Pollington - Rapunzel and the Evil Witch","start":2682.65,"end":2717.44,"speaker":"Jonathan Pageau","text":"Yes, this is something I've completely added to. Completely added to the story. But it's because we have this hermit, Char, who is there in the Jack story, you know, who's the. In some ways the kind of puzzling. The puzzling character that. That asks the riddles of Jack and also sells him the meat, beans and everything. And this character is going to continue on. So I wanted him in some ways to meet. I mean, if it was a woman, it would have been like an old crone type character. And in some ways, that's what the hermit is acting as, you know, as someone who is helping the prince reflect on his decisions and. And kind of see what. What's actually going on."}
{"episode_id":"SW - #407 - 2025-09-05 - Heather Pollington - Rapunzel and the Evil Witch","start":2719.04,"end":2719.68,"speaker":"Heather Pollington","text":"That's right."}
{"episode_id":"SW - #407 - 2025-09-05 - Heather Pollington - Rapunzel and the Evil Witch","start":2720,"end":2805.13,"speaker":"Jonathan Pageau","text":"And I love how you have that. Like, I don't say that because he's blind. So the prince doesn't see what the hermit's doing. He just hears what the hermit's doing, and he just hears the flax being transformed into thread. And so, you know, in the image, you see what he's actually doing. And I just. I just love those little details where if you're not paying attention, you can miss it, you know? And then later, in the neck, in the future stories, you might remember, wait a minute. There was something going on in this early story that we didn't say, but is happening, so good stuff. Oh, and by the way, let's go back to that one, too. And this is actually one of the examples where Heather really fell in love with kind of the cave iconography that you see in the Palec style, but also just in icons in general. And there were some really beautiful images of people in caves that had this little, little encompassed sense with the opening. And so she said, look, because in the original version, I wrote it as, like, a cabin. And she's like, oh, we have to make it a cave. And when she said it, I'm like, yeah, obviously we have to make it a cave. It's so much better. And so we just went and made it a cave. And I love how you did it because you also add a little bit of naturalism through the way the light appears on the inside of the cave opening, which just adds just a little bit of. Of magic to the image, which I love."}
{"episode_id":"SW - #407 - 2025-09-05 - Heather Pollington - Rapunzel and the Evil Witch","start":2805.29,"end":2816.97,"speaker":"Heather Pollington","text":"Yeah, thank you for changing that, I think, because I'd already drawn two cabins, I saw the cave reference and just thought I really got to do that. So it was really lovely to draw."}
{"episode_id":"SW - #407 - 2025-09-05 - Heather Pollington - Rapunzel and the Evil Witch","start":2817.13,"end":2822.09,"speaker":"Jonathan Pageau","text":"So, yeah, now this cave is going to continue on in the story. So that's great."}
{"episode_id":"SW - #407 - 2025-09-05 - Heather Pollington - Rapunzel and the Evil Witch","start":2824.49,"end":2899.3,"speaker":"Heather Pollington","text":"So this is a sort of resolution image. And this is the prince finding Rapunzel again. He hears her voice once more, and he finds her behind the cabin. And, yeah, I just absolutely love drawing this. I think one thing to mention is how Rapunzel's been transformed from the early images. So in the frontispiece, for example, you know, she's very idealized. She's very young. She's got tiny feet. And I wanted to draw a different version of Rapunzel here. She's older, she's been through childbirth. She's become a mother. She's sort of. She understands what it is to be kind of grounded and, you know, involved in the earthly tasks. And so her feet are actually bigger on purpose here. And there's two reasons, obviously, to make her look more connected to the earth. But the other thing is that after pregnancy, especially if you have twins. Your feet actually get slightly bigger physically as well because the bones have to spread to carry the weight. So I wanted to draw her just as a much rounder figure, you know, much more real character at this point after her transformation. So that was important from my side."}
{"episode_id":"SW - #407 - 2025-09-05 - Heather Pollington - Rapunzel and the Evil Witch","start":2899.78,"end":3076.2,"speaker":"Jonathan Pageau","text":"Yeah. And it was, it was interesting because this is a great, A great suggestion that you made also, so people know how we kind of do this, because I do write the story, but then we look at it together, Heather and I, and sometimes she'll give me these suggestions. And so what I wanted was in some ways, the prince. So my vision of the Rapunzel story is that the prince is too seduced by her external appearance. Obviously, you know, she's beautiful. You know, she's up there in the tower. He can just go see her, get everything he wants. And it's like he. He basically is blinded already, you know, by. He can't really see her. And there's the scene where the witch is behind the hair. So basically she cuts the hair off and now she's. When he goes up the tower, he sees the witch and then he falls. And I really had this intuition that in some ways that's actually something that can happen to any everyone. Like, it's something if you're not careful. Like if you, let's say a man who falls in love with a woman and then doesn't get to know her for who she is, like, doesn't love her for the person that she is, at some point he's going to face an old woman. Like, at some point he's going to come face to face with someone that has lost that beauty. And if you haven't dealt with it properly, then you're going to fall. Like, you won't be able. You'll in some ways be in a difficult situation. So what I wanted is that when he finally comes and sees her, in some ways she's lost some of the external beauty, but then he loves her nonetheless because he's also been through this whole. This whole process. And a lot of people, that's what happens. A lot of men, like when their wife has a child because of everything that it puts her through and all of the difficulty that it brings and in some ways seeing their, their wife in more difficult, vulnerable situations. You know, it's obviously when a woman has a child, she, she, she's. She doesn't. She can't take care of herself as much. She's not as you know. And so I thought, like, this is something that happens to a lot of Guys, So it has to be in the story, right? He can't see her. He's blind. He can't see her for, actually too long, as she has these children, and he can't interact with her anyway. So I wanted him to kind of come to her and see her as this. This woman that in some ways has lost some of her beauty, but he still loves her. And Heather was like, yeah, but, you know, we need to add a little detail. And so she said, you need to say that he can see her. Her, like, beautiful green eyes. And I thought, oh, that's a great idea. Like, it's such a simple idea because it connects. It connects to her voice, too, because that's how he finds her again. It's hearing her voice again instead of her hair. So anyway, so I just thought it was an interesting idea. And then I went back in the story, and then we added, I think, the green eyes in the story in certain parts to kind of tie it together so that when he sees her emerald kind of green eyes, he recognizes her. So."}
{"episode_id":"SW - #407 - 2025-09-05 - Heather Pollington - Rapunzel and the Evil Witch","start":3076.2,"end":3092.97,"speaker":"Heather Pollington","text":"Yeah, yeah, that's right. And kind of connects to the cabbages as well, I suppose, doesn't it? Yeah, yeah, yeah, yeah. It was important that it. I think the first reading, I felt. I felt a bit sorry for Rapunzel, and I thought, there's got to be something there that's, you know, that he can grab onto."}
{"episode_id":"SW - #407 - 2025-09-05 - Heather Pollington - Rapunzel and the Evil Witch","start":3095.13,"end":3129.59,"speaker":"Jonathan Pageau","text":"But it's. It's. I think. I think it's super interesting. I think from a woman's point of view, you've been able to help me think about things that I wouldn't have completely. Because in some ways, you. You brought up in our conversations. In some ways, how is it that an. Because we have the. The old hag right as the. And she's. And I. You kept saying, like, is there some beauty that we can find in an older woman? Like, you know, is it. Does an older woman just become an old hag? And that's something that we've in some ways worked into the story. People will see in the future how we tried to work that back into the story, how there is in some ways."}
{"episode_id":"SW - #407 - 2025-09-05 - Heather Pollington - Rapunzel and the Evil Witch","start":3129.83,"end":3224.13,"speaker":"Heather Pollington","text":"Yeah, I think I'm trying to answer to the accusation that these things, first of all, too simplistic. And second of all, you know, I do hear friends of mine, female friends, will say it's either the maiden or the witch, you know, and that's the problem for women in fairy tales, that you've got these two extremes. And, you know, in the culture that we're living in now, it's obviously you're still obsessed with the maiden. It's like, you know, I see 50 year old women now trying to look like 20 year olds and there is no kind of dignity in the mother or you know, the matriarch or, you know, these kind of older forms that you find in fairy tales. And so through our discussions, what I was trying to do is like, yeah, revisit it. Is there a way of again, staying true to the original stories but finding those, those more nuanced characters and kind of exploring these different identities for women? Because I know that they're there and, and, but I think they kind of been edited out over the years. And so, you know, I'm obviously, I'm a middle aged woman and so I'm reading them and thinking, well, I'm not a maiden anymore, but I want to find interesting kind of characters. We had the widow queen in Snow White and now we've got the witch and we're going to see what happens to her. But I just think it's about presenting different possibilities for women. As we see in, you know, traditional Christianity, you've got, you've obviously got the mother of God, but then you have the female saints, you know, and they're, they're all different and interesting and it's like how, how does that then relate to the fairy tale world?"}
{"episode_id":"SW - #407 - 2025-09-05 - Heather Pollington - Rapunzel and the Evil Witch","start":3225.74,"end":3237.5,"speaker":"Jonathan Pageau","text":"Yeah, I think, I think that, that, I think that's right and I hope that we are able to capture that and people will see because that we're not done with the, with the witch. She's, she's, she has a whole part of her story that still needs to be told, so."}
{"episode_id":"SW - #407 - 2025-09-05 - Heather Pollington - Rapunzel and the Evil Witch","start":3237.74,"end":3238.94,"speaker":"Heather Pollington","text":"That's right. Yeah."}
{"episode_id":"SW - #407 - 2025-09-05 - Heather Pollington - Rapunzel and the Evil Witch","start":3239.66,"end":3280.96,"speaker":"Jonathan Pageau","text":"And I love the colors. Like this is such a, like it has this kind of fall colors and you know, the late day kind of end of day and the sun, I love the sun is just kind of chilling. The sun's just relaxing. Because there's a great image earlier on where you see when the prince is going up the tower where. Or the queen, the witch is going up the tower where the sun looks very worried. Oh yeah. Has this like worried look, I think. Yeah, it's, it's that one. Yeah. And you see like, oh no. You know, I love that. And so I love the fact that at the end of the story the sin is just. The sun is just, just, it's just, just relaxing with them and he's just happy."}
{"episode_id":"SW - #407 - 2025-09-05 - Heather Pollington - Rapunzel and the Evil Witch","start":3280.96,"end":3350.46,"speaker":"Heather Pollington","text":"Happy. Yeah. Yeah. Okay, so this is the final image of the book. And yeah, I suppose this is both of them at the end of their kind of story arcs. And you've got the princess kind of found a humble profession, starting life, you know, stitching and mending things. And she has the twins, and you can. I tried to draw her here in a state of fulfillment, and I wanted her looking directly at the reader because I really wanted it to be about, you know, a contrast between this position and when she was in the tower on her own. It's like, they're poor, but she really does have everything. It's like a. Hopefully a kind of image of completeness. And even though she's lost her, you know, kind of initial youthful beauty, there's still a beauty in motherhood, which is like the sort of beauty of sacrifice or something like that that was trying to capture in her. Even though her hair's kind of shorter and messy, you know, hopefully it's. It's a lovely image to end with."}
{"episode_id":"SW - #407 - 2025-09-05 - Heather Pollington - Rapunzel and the Evil Witch","start":3350.78,"end":3382.05,"speaker":"Jonathan Pageau","text":"Yeah, I. It's funny, I found myself surprised that this. It was one of my, if not my favorite image of her, because I think you were able to capture exactly what it is you're saying. You know, she. She looks. She obviously looks like someone who has become wiser. You know, she's been through a lot. She has this look where she. She has this look where she's looking at us with a lot of. Of like. Almost like an inside joke. Like, she has this inside knowledge that she's communicating with. With her look."}
{"episode_id":"SW - #407 - 2025-09-05 - Heather Pollington - Rapunzel and the Evil Witch","start":3382.13,"end":3382.38,"speaker":"Heather Pollington","text":"And."}
{"episode_id":"SW - #407 - 2025-09-05 - Heather Pollington - Rapunzel and the Evil Witch","start":3382.69,"end":3425.76,"speaker":"Jonathan Pageau","text":"And. And. But then you can also see she has just a beautiful little smile, and you can tell she doesn't care that her hair is a little messy and that she has got patches on her clothing. She's like, no, this is what I've chosen. Like, this is actually the life that I. That I want, and I love it. So I think. I think it's a great. I think it's such a great representation of her. And. Yeah, and in some ways, it does show this really positive aspect of family and motherhood and. Yeah, but the prince, though, you can see that he. He. He's not as. As. He's not as content. There's a little bit of. You can see that he has a bit of. Of a worry in his eyes. There's something going on."}
{"episode_id":"SW - #407 - 2025-09-05 - Heather Pollington - Rapunzel and the Evil Witch","start":3425.92,"end":3426.32,"speaker":"Heather Pollington","text":"Yeah."}
{"episode_id":"SW - #407 - 2025-09-05 - Heather Pollington - Rapunzel and the Evil Witch","start":3426.32,"end":3439.76,"speaker":"Jonathan Pageau","text":"You know, and so. Yeah, but his story is not over also. And so Heather's already thinking of the next book when she made this. Made this. This. This little portrait of the. The prince working on his. On his sewing here."}
{"episode_id":"SW - #407 - 2025-09-05 - Heather Pollington - Rapunzel and the Evil Witch","start":3440.49,"end":3453.17,"speaker":"Heather Pollington","text":"Yeah, that's right. So this is our. Yeah, this is the COVID So the book's going to be available pretty soon, I think, on general distribution. Is that right?"}
{"episode_id":"SW - #407 - 2025-09-05 - Heather Pollington - Rapunzel and the Evil Witch","start":3453.17,"end":3576.34,"speaker":"Jonathan Pageau","text":"Yeah. And so in the next few weeks, I think mid August is when it's going to be available. People can pre order. What we've done is obviously we did like an actual pre sale where we had a thousand books and we sold them in like 24 hours, 26 hours. We sold all the books. But now what we've done is people can still pre order. And the reason to pre order is that I recorded an audiobook for this. And we also made like a little family worksheet that people can use to interact with their children about the story. And so those will be offered for people who get it in pre order. And our new shipping system has been amazing. One of the reasons why we started with the 1000 books was to test out our new distribution system. And, and I mean, some people were getting the book on the same day, which was crazy. And then some people got it the next day, two days, but really just a few days before people got the book, especially in the United States. So we're so happy that we're here. We finally have been through all our difficulties. We, you know, we are set for the future. And so Rapunzel in some ways marks the, the new beginning for, for the press. So you can go to rapunzelbook.com and pre order your book and you'll get it. As soon as the books are in the warehouse, they will ship it to you with the audiobook. I really enjoyed reading it. I actually then I read it and I had so much fun reading it. And then even some people said, oh, when you read it, there are some things about the story that I didn't realize were there because of just the intonation of the way I read it. So I thought, okay, wow. So now I just, I read all of our fairy tales and so I really went back and I read Snow White and then I read Jack. And also I also read the next book that's coming out in the fall, which is Little Red Riding Hood. So I read that. And so, yeah, so I can't wait for people to see it and I can't wait for people to tell us what they think and Heather to maybe finish off and tell us what it is that your final thought, let's say, of your experience of making it. And we'll move on to the next book after this."}
{"episode_id":"SW - #407 - 2025-09-05 - Heather Pollington - Rapunzel and the Evil Witch","start":3578.02,"end":3651.89,"speaker":"Heather Pollington","text":"Gosh, it's just always a bit of a dream. You know, you embark on something, you don't really know how it's gonna turn out. Even though you have intentions. And so, you know, I'm sitting here at the moment in my studio surrounded by all the Rapunzel reference that I used, but it really turned into something unique, I think. And so it's always a surprise at the end when you look back and think, oh, it's that. But that's why it's such an interesting process, because there's the things that you think you're going to do, and then there's a whole subconscious level that, you know is doing something else as an artist. So you get to learn about yourself as well when. And other understanding. And maybe, you know, like, you say things I might have picked up from you, it wasn't totally conscious of, but that made. Made it. Made their way into the images. So, yeah, it's always an interesting experience and more so because I get to collaborate, you know, with someone like you, and we. We kind of keep up the communication through the process. It's not like I receive a manuscript and then we never speak again. It's like there's a constant evolution. And, yeah, it's just been. It's been great. So I'm looking forward to doing the next one."}
{"episode_id":"SW - #407 - 2025-09-05 - Heather Pollington - Rapunzel and the Evil Witch","start":3652.77,"end":3723.89,"speaker":"Jonathan Pageau","text":"Yeah. Yeah. So the next one in this series is the Valiant Little Tailor, and that is actually being illustrated by Eloise right now. And, you know, it's a giant killing story, so she's really. A lot of the. The solutions she came to in the first in the Jack book are now kind of taken. Like, they're just being multiplied. And so the images we've been seeing have been coming out are really wonderful. And then the one after that will be Sleeping Beauty and Heather will be illustrating that. So we're working on the next two, and I can't wait. And for people who don't know, the Rapunzel book is where the stories start to merge together, where you start to see how the Jack book and the Snow White book are related to each other. But that's just going to increase and a lot of these characters are going to come back, are going to repeat. And so. And they all have their own little transformational arc. So this is. I'm getting. I'm excited because in some ways, this is where the. Let's say, the risky part of our endeavor is going to start to pay off. We're going to start to see how people react to all of the threads kind of coming together. So, yeah, I'm excited."}
{"episode_id":"SW - #407 - 2025-09-05 - Heather Pollington - Rapunzel and the Evil Witch","start":3724.13,"end":3724.77,"speaker":"Heather Pollington","text":"That's right."}
{"episode_id":"SW - #407 - 2025-09-05 - Heather Pollington - Rapunzel and the Evil Witch","start":3724.93,"end":3729.17,"speaker":"Jonathan Pageau","text":"And, Heather, thanks for. Thanks for putting your heart into this. It's. It's Much appreciated."}
{"episode_id":"SW - #407 - 2025-09-05 - Heather Pollington - Rapunzel and the Evil Witch","start":3729.33,"end":3733.65,"speaker":"Heather Pollington","text":"Oh, thank you. It was, it was a real privilege to do so. Thanks very much."}
{"episode_id":"SW - #407 - 2025-09-05 - Heather Pollington - Rapunzel and the Evil Witch","start":3734.13,"end":3754.89,"speaker":"Jonathan Pageau","text":"All right everyone go to rapunzelbook.com and and get your book. Thanks everybody. Bye Bye. If you enjoy these videos and podcasts, please go to the symbolicworld.com website and see how you can support what we're doing. There are multiple subscriber tiers with perks. There are apparel and books to purchase. So go to thesymbolicworld.com and thank you for your support."}
{"episode_id":"SW - #407 - 2025-09-05 - Heather Pollington - Rapunzel and the Evil Witch","start":3755.53,"end":3814.79,"speaker":"Laura Diaz","text":"Tucson the Weight is Over Medi Weight Loss they're officially open on North Oracle Road. That's right, no more counting down the days. You can walk in right now and start your journey to a healthier you. Hey, it's Laura Diaz from iheartradio and you can trust me. This isn't just another weight loss clinic. I know that because it's where I lost weight safely with real medical support. GLP1 medications. You can see them everywhere online right now. But the truth is, your health shouldn't be a DIY project ordering these meds without the professional guidance. It can lead to dangerous mistakes, wrong doses, no oversight, and serious risks. At mediweightloss, I got the same medication, but with a customized plan, weekly check ins, and a licensed physician guiding me every step of the way. And the cost? The same as those risky online options. Tucson, your moment is here. If you're ready to take control, feel better, and lose weight the right way, mediweightloss is ready for you. Walk in, get started and see real results. Call or visit mediweightloss.com to learn more and book your free consultation today."}
{"episode_id":"SW - #407 - 2025-09-05 - Heather Pollington - Rapunzel and the Evil Witch","start":3814.79,"end":3883.89,"speaker":"Announcer","text":"That's mediweightloss.com looking for your next go to Smoke Shop. Stop scrolling. I've got you. Headshop.com is the number one online smoke shop already trusted by over 100,000 happy smokers just like you. They've got it all. Dab rigs, vaporizers, glass bongs, smoking pipes, even THCA flower all in one place. Need a new daily driver? Grab a smooth glass bong long or a classic smoking pipe. More of a concentrate fan. Their DAB rigs, E rigs and wax accessories are designed for smoother, harder hitting sessions. And yes, they've even got legal THC flower. Best part? Every order ships fast and discreet, which is why thousands of smokers keep coming back. So don't waste time hopping between shops. Shop the best in dab rigs, vaporizers, glass bongs, smoking pipes and thca flower right now@headshop.com the number one online smoke shop, headshop.com has what you need. Check it out today. Oh, and because you're listening right now, you get 10% off your next order when you use the coupon code HSHOP at checkout. Go to headshop.com now and smoke smarter."}
