{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":0.16,"end":62.37,"speaker":"Laura Diaz","text":"Tucson, the weight is over Mediweight loss. They're officially open on North Oracle Road. That's right. No more counting down the days. You can walk in right now and start your journey to a healthier you. Hey, it's Laura Diaz from iheartradio and you can trust me. This isn't just another weight loss clinic. I know that because it's where I lost weight safely with real medical support. GLP1 medications. You can see them everywhere online right now. But the truth is your health shouldn't be a DIY project ordering these meds without the professional guidance. It can lead to dangerous mistakes, wrong doses, no oversight, and serious risks at mediweight loss. I got the same medication but with a customized plan, weekly check ins and a licensed physician guiding me every step of the way. And the cost the same as those risky online options. Tucson, your moment is here. If you're ready to take control, feel better and lose weight the right way, mediweight loss is ready for you. Walk in, get started and see real results. Call or visit medweightloss.com to learn more and book your free consultation today. That's mediweightloss.com we just did like into."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":62.37,"end":84.33,"speaker":"Jonathan Pageau","text":"This seminar on the gospels where we spend a whole week, four hours a day talking about the gospel and saying we're just going to go into the gospels and then say what we, what we see there. And at some point someone commented, I think it was even Dennis Prager. He's like, why is it we're like three, three quarters of the way through this and no one has said the things that I usually hear from Christians, from a certain branch of Christians I like. Well, because it's not there."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":84.41,"end":85.05,"speaker":"Fr Stephen De Young","text":"It's not."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":85.45,"end":90.09,"speaker":"Jonathan Pageau","text":"It's like it's. I mean, yes, you can maybe get it through St. Paul, but it's not there in the Gospels."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":90.09,"end":116.59,"speaker":"Fr Stephen De Young","text":"Yeah, yeah, yeah. I've gotten some feedback and there have been some reviews posted. The book where people are saying like this reading of St. Paul fits with Jesus a lot better. Right. There's not this sort of split anymore. The fact that reading him in context, all of a sudden he sounds a lot more like he's saying the same things Jesus did. No one comes to Jesus and says, you know, what must I do to inherit eternal life? And Jesus says nothing."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":118.27,"end":122.63,"speaker":"Jonathan Pageau","text":"Yeah, God's already chosen. If he has it, then, you know, whatever."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":122.63,"end":133.99,"speaker":"Fr Stephen De Young","text":"What are you gonna do? God's good. It's a free gift. Just accept. Right? Like that's not. He talks about commandment keeping and then know adds to that sell everything you ever give it to the poor. Yeah."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":145.91,"end":206.88,"speaker":"Jonathan Pageau","text":"This is Jonathan Pedro. Welcome to the Symbolic World. Hello, everyone. I'm here with the great father Stephen DeYoung. Many of you have seen him on my channel before. He's also looking more like Santa Claus these days. I noticed. And so, Father Stephen, as you know, he is one of the hosts of the Lord of Spirits podcast, the whole Council of God. He's also written several books. He was on the Symbolic World Summit. We put up a discussion that he talked about the bodily resurrection guided by Frederick Nietzsche, which was really amazing. And Father Stephen is now publishing a book on St. Paul. And so I thought it would be a great opportunity to actually talk about St. Paul. I don't. I don't talk about St. Paul that much on my channel, at least not explicitly. So I thought it would be. It would be a great opportunity. So, Father Stephen, thanks for coming. Coming on."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":207.2,"end":209.12,"speaker":"Fr Stephen De Young","text":"Yeah, my pleasure. My pleasure."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":209.2,"end":227.21,"speaker":"Jonathan Pageau","text":"And so until now, you've talked a lot about, you know, you've tried to connect a lot of things to Second Temple Judaism. You know, you tried to try to create the sense of continuity between the Old Testament and the New Testament. It's been very fruitful. And so how does this fit into writing a book about St. Paul?"}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":227.77,"end":388.69,"speaker":"Fr Stephen De Young","text":"Yeah, well, so St. Paul and his epistles and the interpretation of them is sort of at the center of most of the disputes within contemporary Christianity. When you. When you get down to the core and that's. I mean, depending on where people watching this are, they may have immediately had different things pop to mind. Like. So they might have had. Well, yes, you know, Martin Luther's interpretation of St. Paul basically was the Reformation and is sort of what separates Protestantism from Roman Catholicism or Orthodoxy. Or they might have thought about what St. Paul says about women in ministry as being a split Right. Between more progressive and more conservative forms of. Of Protestantism, or. And on and on and on. When you trace these things back, it comes back to St. Paul. And I think the biggest problem in terms of how Saint Paul is used in all these discussions is that very rarely, if ever, are we reading St. Paul as a Jewish man, specifically a Pharisee living in the first half of the first century A.D. yeah. His epistles have been kind of disassociated from that. So that we now read. In fact, Luther's reading is basically to read him over against the Judaism of the first century. Right. That he represents this criticism and even an attack on Judaism of the first century. And. Or the text gets isolated in and of itself due to Sola scriptura and other things where it's just sort of like, oh no, these are words beamed sort of directly from God. We don't have to worry about when it was written, where, to whom, why, right? But when, when we understand St. Paul as the historical person he is, then what he's saying suddenly makes a lot more sense, is a lot less nebulous. There's still questions, of course, right? Because we're in a different context today. How do we apply what he was saying then, in that context to our context today? But that's a very different discussion than presenting radically different views of what he even said."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":390.69,"end":398.09,"speaker":"Jonathan Pageau","text":"Hello everyone, this is Annie Crawford inviting you to join me this January for a symbolic world reading of Till we."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":398.09,"end":399.97,"speaker":"Laura Diaz","text":"Have faces, the book C.S."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":399.97,"end":419.56,"speaker":"Jonathan Pageau","text":"Lewis calls far and away the best I've written. Till we have Faces is Lewis's modern retelling of the myth of Cupid and Psyche, a mysterious tale of dark idolatry, classical enlightenment, and the shocking discovery of true religious vision. In our four week online course together."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":419.64,"end":421.92,"speaker":"Laura Diaz","text":"We'Ll explore what CS Lewis has to."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":421.92,"end":433.96,"speaker":"Jonathan Pageau","text":"Show us about the nature of myth, the dangers of love, the limits of reason, and the secrets of genuine re enchantment. This is a book, an author and a class you won't want to miss."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":434.77,"end":495.74,"speaker":"Laura Diaz","text":"Tucson the Weight is Over Mediweight loss. They're officially open on North Oracle Road. That's right. No more counting down the days. You can walk in right now and start your journey to a healthier you. Hey, it's Laura Diaz from iheartradio and you can trust me. This isn't just another weight loss clinic. I know that because it's where I lost weight safely with real medical support. GLP1 medications. You can see them everywhere online right now. But the truth is, your health shouldn't be a DIY project ordering these meds without the professional guidance. It can lead to dangerous mistakes, wrong doses, no oversight, and serious risks. At mediweight loss, I got the same medication but with a customized plan, weekly check ins, and a licensed physician guiding me every step of the way. And the cost? The same as those risky online options. Tucson, your moment is here. If you're ready to take control, feel better, and lose weight the right way, mediweight loss is ready for you. Walk in, get started and see real results. Call or visit mediweightloss.com to learn more and book your free consultation today. That's mediweightloss.com."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":499.18,"end":516.78,"speaker":"Jonathan Pageau","text":"And so what are some of the examples? Let's say of the fact of considering his context and the fact of considering the tradition in which he was embedded. You know, give me at least one or two examples of how that enlightens the text and help us see it in different light."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":518.22,"end":561.27,"speaker":"Fr Stephen De Young","text":"Well, one of the biggest examples in terms of more contemporary readings of St. Paul is that there's this phrase that St. Paul uses, works of the law, which would really be translated more like works of the Torah. And just in general, the fact that we now translate it as law rather than Torah already skews the picture a great deal toward a kind of view of. Kind of legal legalism and that kind of thing. But it's works of the Torah has been interpreted since Luther in the Reformed and Protestant tradition as just meaning good works."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":561.51,"end":561.99,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":562.23,"end":695.16,"speaker":"Fr Stephen De Young","text":"Doing good things. Right. Trying to do things to please God. Right. And therefore St. Paul's criticism of that has taken to be this quote, criticism of doing. Trying to do good and trying to please God in your life. Whereas it becomes increasingly clear. And Matthew Thomas published his dissertation on this, where he went back to not just the scripture itself and St. Paul's context, but went back to everyone in the second and third centuries who comments on St. Paul and found that every single one of them understands works of Torah to mean the specific commandments that separated Jews from other people. So circumcision, keeping kosher. Right. The things that. That were sort of boundary markers for the Jewish community. When you read St. Paul with that in mind and understand that he's saying, look, you aren't given the forgiveness of sins by being Jewish. Right. You aren't given the promises of Abraham by just being biologically descended from him. He points out, you know, Esau is biologically descended from him. Ishmael is biologically descended from him. Right. The Moabites are biologically descended from his family. That. That's not a guarantee. Then not only does what he's saying make more sense when you read it, but you could also see that his positive picture of what faith is is really something more like faithfulness. Right. That it actually includes that he's actually encouraging people to try to do good and please God in their life. He's actually encouraging people to. To struggle to keep the commandments and to repent when they don't. Right. This is not something he's making a break with. This is something he's reinforcing over against a view. A sort of identitarian view."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":695.48,"end":695.96,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":696.44,"end":698.6,"speaker":"Fr Stephen De Young","text":"Of. Of what religion is."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":699.16,"end":801.74,"speaker":"Jonathan Pageau","text":"Yeah. I think your insight is wonderful. That's what I've been meditating on that for a while that it seems like one of the ways you can twist the words in the scripture is that it's actually simply something like excessive focus on a concept. You have a, you have a concept that's there and then you, you, you onto, like, you ontologize it. You make it the structure of reality itself. And so you say something like, there's a text about works and faith. And then you say, well, works actually just means anything that you do. It's actually complete. It's actually, it's almost metaphysical. Like it's, it's like all things that you do are empty. And all you can do is. Is let's say, receive from God something. And it's like, and, and downstream from that, if you follow the line, then you end up with things obviously like double predestination and all the crazy things that end up happening in Protestantism. Because it's like, it's not that it's not there in the text, it's that you've, you've isolated it, you folk hyper focused on it to the detriment of all the other things that St. Paul and Christ and the other writers say. And you've made it like a kind of jewel, like, you know, like a center point around which the entire scripture turns, let's say. And it made me realize to what extent tradition is important because you could do that in many places in the text if you wanted to. You could say everything has to be interpreted in the light of this text. So now this text becomes like the center of the world. And now every other text is relativized by based on that. It's like this is the metaphysical center of the Bible. And so it's like, it's a weird trick that people play because it actually can be a little convincing when you think of it at first. You're like, well, it does say that, doesn't it? Right, it says that. And so."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":801.82,"end":812.46,"speaker":"Fr Stephen De Young","text":"Yeah, right. And the argument to make that sound reasonable is you get something like, well, you have to interpret the difficult passages of scripture based on the parts that are clear."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":812.62,"end":813.62,"speaker":"Jonathan Pageau","text":"Clear, exactly."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":813.62,"end":845.61,"speaker":"Fr Stephen De Young","text":"Of course, the parts that are clear are the parts that I sort of already agree with and seem to fit what I believe. Yeah, the hard parts are all the ones that seem to disagree with that that I then explain away in favor of the ones. Right. That agree with me. That's obviously, it's super problematic, you know, if, especially if you're from a Protestant background where the scriptures are your sole source of infallible authority, that becomes A huge problem because there's no way to sort of correct yourself ever."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":846.24,"end":906.68,"speaker":"Jonathan Pageau","text":"No. And it really is. And people can be really become self deluded. It's not, it's not also like, how can I say this? It's in, in some ways it's, it's a factor of reality, right? You, when you're dealing with reading scripture, but not just reading scripture, like even your experiences in everyday life, sometimes there's something that shines really brightly, right? You have this experience and then it shines brightly. And the danger is to say, now this is the, the key to all of reality. And now like you said, I basically make it the focus. And I, and I relativize everything because of the insight that it brings. So you can imagine like Luther, you know, struggling with confession, you know, going over and confessing every time and you know, realizing that his thoughts are coming back and like he would want to go to confession every two seconds. And he's like, no, this can't be. And then has this insight, you know, God has saved me through faith. And then it's a real insight, right? It's like a real insight. But then it, you, you kind of bear, you kind of focus in on it and then it becomes the, the thing by which everything else exists."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":907.08,"end":908.68,"speaker":"Fr Stephen De Young","text":"Yeah, it becomes the gospel."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":908.76,"end":911.48,"speaker":"Jonathan Pageau","text":"Yeah, it becomes the gospel. That's a good way of thinking about it."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":911.72,"end":942.17,"speaker":"Fr Stephen De Young","text":"Yeah. And one of, one of the things in getting feedback from the book, and I hadn't particularly thought about it this way, but one of the ways that it's hit people is part of what's happened downstream from some of those readings of St. Paul is that it's very hard to get that reading of St. Paul out of Christ in the Gospels. The things Christ says in the Gospel."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":942.17,"end":976.47,"speaker":"Jonathan Pageau","text":"Yeah, it's so interesting because we just did, we just did like into this seminar on the Gospels where we spent a whole week, like two hour, four hours a day talking about the Gospel and saying we're just going to go into the Gospels and then say what we see, what we see there. And at some point someone commented, I think it was even Dennis Prager, he's like, why is it we're like three, three quarters of the way through this and no one has said the things that I usually hear from Christians, you know, like that, from the, from a certain branch of Christians I like. Well, because it's not there. It's not, it's like it's. I mean, yes, you can maybe get it through St. Paul, but it's not there in The Gospels."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":976.47,"end":1035.91,"speaker":"Fr Stephen De Young","text":"Yeah, yeah, yeah. And, and so I've gotten some feedback and there have been some reviews posted the book where people are saying, like, this reading of St. Paul fits with Jesus a lot better. Right. There's not this sort of split Right. Anymore. And that split, you know, Muslim apologists and Jewish apologists, insofar as there are Jewish apostle apologists, because they don't proselytize. Right. But they're doing sort of counter missionary stuff. Right. They make hay on that perceived difference. Yeah. Right. To say, like, how come St. Paul seems so different than Jesus according to you? Right. And so the fact that reading him in context, all of a sudden he sounds a lot more like he's saying the same things Jesus did. No one comes to Jesus and says, what must I do to inherit eternal life? And Jesus says nothing."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":1037.59,"end":1041.95,"speaker":"Jonathan Pageau","text":"Yeah. God's already chosen. If he has it, then, you know, whatever."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":1041.95,"end":1052.79,"speaker":"Fr Stephen De Young","text":"What are you going to do? It's a free gift. Just accept. Right. Like that's not. He talks about commandment, keeping, and then, you know, adds to that, sell everything. You ever give it to the poor."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":1052.87,"end":1081.5,"speaker":"Jonathan Pageau","text":"Yeah, yeah. That's very interesting. And so, and so what is your, you know, I, I'm. See, I'm. What, what is your take on the relationship between St. Paul and a lot of the other stuff you talk about? Because that interests me, because I see in some of the texts where he's clearly talking about hierarchies of angels, he's clearly talking about principalities and, you know, and so I'm wondering what if you brought that out in the book at all?"}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":1081.66,"end":1099.22,"speaker":"Fr Stephen De Young","text":"Yeah, well, yeah. And this is part of the caricaturing of St. Paul. Right. So. And, and it doesn't start. I want to be fair, Martin Luther wasn't trying to do a caricature of St. Paul, but he was very much reading St. Paul in terms of his own experience."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":1099.54,"end":1100.1,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":1100.5,"end":1111.78,"speaker":"Fr Stephen De Young","text":"And so he presents Pharisaic Judaism as having been this sort of legalism, which is how he perceived the Roman Catholic Church of his own day."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":1112.11,"end":1112.51,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":1112.59,"end":1157.13,"speaker":"Fr Stephen De Young","text":"Kind of reads that back into them, that there's sort of these dry legalists. Right. Who think you earn salvation by keeping commandments, keeping torah. And then St. Paul is that sort of radically, radically opposed to that. And then St. Paul, though, is coming out for Martin Luther, coming out of that background and rejecting it. Right, and rejecting it. And so what that leaves out on the table is all the mystical experiences St. Paul describes having."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":1157.29,"end":1157.85,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":1159.05,"end":1290.77,"speaker":"Fr Stephen De Young","text":"Right. His discussion in First Corinthians 15 about angelic bodies. Right. Like celestial Bodies. All that gets sort of left aside to the point that I'm not going to name names, but a non Protestant biblical studies professor once recently, when asked about this, was. Was asked about St. Paul and mystical experiences and practicing mysticism, and gave the answer, well, no, he was a Pharisee, so he wasn't into all that. Right. Which is just the acceptance of this kind of caricature. And so that has gone unexplored and where it is explored in. I mean, I really. You know, this may rub some of your audience the wrong way, but I really think the idea of the west is a fiction. So I hate saying Western Christianity, but it's sort of the only convenient term to group together Roman Catholicism and traditional Protestantism. So it's what we're stuck with. But in Western Christianity, in medieval Roman Catholicism, basically, this sort of schism developed between, on one hand, Scholasticism and on the other hand, mysticism. Like they were pulled apart. And you see that really radically in the person of Thomas Aquinas, where he has this profound mystical experience and stops work on the summa. Right. Because it just seems worthless to him after what he's experienced that's pulled apart. And so I think that gets read back into St. Paul too. This idea that he either had to be this kind of scholastic theologian, you know, Romans is a systematic theology. Da, da, da, da, da. If he's that, then he can't have been serious about mystical experiences."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":1290.77,"end":1291.21,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":1291.21,"end":1355.34,"speaker":"Fr Stephen De Young","text":"Right. And so I'm amazed at how many people don't realize, for example, that in the Book of Acts, after the road to Damascus, Christ appears to St. Paul twice in person at different points in his life. And he describes other. In his epistles, other mystical experiences he's had. Yeah, but that doesn't fit with the. Oh, well, the road to Damascus is just describing his conversion. Right. That's where he got saved and. Right. As if Christianity and Judaism were separate religions. And AD 35, where you convert from one to the other. Yeah, but. So, yeah, all. All of that gets left on the table. Everything having to do with the demonic gets left on the table. That makes it very difficult to understand his view, for example, why he's trying to go see Caesar."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":1355.82,"end":1356.38,"speaker":"Jonathan Pageau","text":"Mm."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":1357.75,"end":1364.47,"speaker":"Fr Stephen De Young","text":"Right. Who during much of his ministry, is Caligula. Later on is Nero."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":1364.71,"end":1365.19,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":1365.35,"end":1393.17,"speaker":"Fr Stephen De Young","text":"So these aren't even like, quote unquote, good emperors. Right. These aren't like philosopher emperors or something who you can reason with. Right. But he sees them as being humans like everyone else. The problem is sort of the demonic power that stands behind Rome that stands behind the emperor, that the emperor is sort of embodying. But if you preach the gospel to the emperor and he accepts it, that would pry him loose from that."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":1393.33,"end":1393.89,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":1394.13,"end":1398.13,"speaker":"Fr Stephen De Young","text":"And now the emperor receives the Holy Spirit and that would transform literally the whole world."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":1398.61,"end":1401.17,"speaker":"Jonathan Pageau","text":"Yeah. Which is, which is what happened ultimately."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":1401.17,"end":1404.77,"speaker":"Fr Stephen De Young","text":"Yes. Right. St. Constantine is the payoff of St. Paul's mission."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":1405.09,"end":1426.65,"speaker":"Jonathan Pageau","text":"Yeah. It's interesting to think about what he said, because it's funny, I never had thought about it the way that you, that you had. That you. That you said it. Which is the idea in some ways that St. Paul was trying to do what ended up happening, you know, in the church. Like, he understood this idea of the importance of principalities in the world and how they. They come down. Let's say they come kind of come down on."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":1426.65,"end":1427.37,"speaker":"Fr Stephen De Young","text":"On. On."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":1427.37,"end":1443.41,"speaker":"Jonathan Pageau","text":"On reality. And, and he understood that, like, it's not. It wasn't just about saving individuals, but there was this sense that we could. If we could save a nation in some ways, you know, by removing this. This influence from. From. From evil spirits or something."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":1443.97,"end":1455.33,"speaker":"Fr Stephen De Young","text":"Yeah. And that, that would, that would then transform things. So. Yeah, that when that gets left out, what you have is always just trying to convince people to join his religion and see things his way."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":1455.57,"end":1455.97,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":1455.97,"end":1461.09,"speaker":"Fr Stephen De Young","text":"And then exercise whatever the power they had to try to force other people to do likewise."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":1461.09,"end":1478.73,"speaker":"Jonathan Pageau","text":"Yeah. So in some ways he understood that the. In some ways with, you know, with, with Saint Dionysus the areopagite later would. Would inscribe, which is there's a relationship between the divine hierarchies and the hierarchies in the world. Like they, they lay themselves out in similar structures, you could say."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":1479.37,"end":1570.23,"speaker":"Fr Stephen De Young","text":"Right. And. And that the nature of humanity is to sort of synergize. Right. And he gets into this, I mean, famously in Philippians 2, 13, 14. But that human activity. There is human activity, there is a human will. There is, you know, sorry, Calvinist friends who are monitor just. But the nature of that activity is to participate in and bring into the world, to be guided by spiritual wills and energies in reality. And so it's not sort of independent. There's this kind of St. John Cashin. This is how he connected Pelagianism and Nestorianism. That Pelagianism, which is a kind of modern monergism that separates human activity from God's activity and demonic activity. It has its stand. Human activity sort of standing by itself. That, that is a kind of Nestorianism because it's pulling apart. Ultimately you have to pull apart Christ. Right. It was who is human and divine. And that's the exact opposite of what, what St. Paul is teaching."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":1570.47,"end":1571.03,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":1571.03,"end":1589.59,"speaker":"Fr Stephen De Young","text":"So you, you kind of, you can't understand human ethics apart from a sense of spiritual warfare. And since ancient politics is ethics writ large at the level of community, you can't understand that apart from spiritual warfare."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":1589.59,"end":1590.11,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":1590.67,"end":1680.34,"speaker":"Fr Stephen De Young","text":"So the emperor, the governor, whoever else they are embodying and bringing into reality the will of certain spiritual powers. And that's going to transform things in one way. And if those spiritual powers are replaced with the Holy Spirit, that's going to naturally transform things the other way. But it's not a question of. Part of the problem then is we as modern people, even a lot of modern Christians, then impose on it this idea that, well, our modern way of doing things is better. So why didn't God, like miraculously reveal that to them? Right. Like, and I've said this before on Lord of Spirits, and I know people don't like people talking this way, but I'm sorry, one of the stupidest things I ever heard at an academic conference was, and this is self criticism because it was an orthodox theologian, we could put scare quotes around the election criticizing the Council of Nicaea for not abolishing slavery in the Roman Empire. Right. Which is just so anachronistic and bizarre. Right. Like these bishops could just take a vote and change the means of production, like in the Roman Empire in the early 4th century. And what would they have changed it to? I mean, I guess capitalism. I guess like modern capitalism, because that's perfect and flawless. It has no issues from a Christian perspective."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":1682.58,"end":1836.69,"speaker":"Jonathan Pageau","text":"Yeah. I mean, it also, I mean, this whole question of slavery. Oh man. I don't like to talk about it too much because it's definitely controversial, but I think in some ways people don't, they don't think out the reality of how the world functions. And in some ways the way, I think that the early Christians and St. Paul and the people there. Exactly the way that you said. In some ways there is no such thing as freedom in the way that we think of it. There is no such thing as not being bound or submitted to higher authorities that act on us and that, you know, that bind our behavior. So the idea that there are these like just completely free individuals that don't, that aren't. We don't like the word owned, but to some extent owned by higher powers in some ways, like we can't. We. You cannot avoid that. What Christianity and in Judaism before and the ancient Israel did before with was mostly to call on people to act properly with the people that were under them. It was to say, you have to. Christ is saying, it's not that I'm going to free you in the sense that you won't be bound to like some higher will, that will that will bind your behavior, but that those that are there should be treating you in the, as if they're acting towards me. That is what the call has always been. And so, you know, when Israel was freed from Egypt, it's like it was freed from Egypt in order to then be bound to God, like in order to be bound to his law, to his, you know, and so they, they were making themselves slaves to God after being freed from Egypt. The idea that, that we're completely free is, is wrong. And so the, the approach of like we right now like are owned to some extent by our states. If you try not to not pay your taxes and see what happens. Like the, an ancient serf was, what he owed to his Lord was far less than what we owed to the people that own us. Right now we give up way more to our overlords than the people like the serfs that we consider slaves in the Middle Ages. So we have to be very cautious, I think in the way that we understand these things. The cosmic vision makes you see that it's more about how a steward of reality has to treat that which it stewards. Right. So it's like a leader or a chief or someone who acts on others has to treat them in the spirit that God has given them with love basically. That's the, that's the key that Christians offer."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":1837.17,"end":1841.97,"speaker":"Fr Stephen De Young","text":"Right, Right. Well, yeah. And of course the whole slavery discussion is another one that runs right through St. Paul."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":1842.05,"end":1842.45,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":1842.45,"end":1929.23,"speaker":"Fr Stephen De Young","text":"Because of what he says about it. And yeah, just in the real world, right. You have a whole economy in the Roman Empire that's based around slavery and that's not a good thing. St. Paul never says slavery is a good thing. He tells Philippine, you can't claim to own your brother in Christ, but that's on an individual basis. Right. And so yeah, the approach Christians took starting with St. Paul was right, here's how we could live within these institutions, corrupt, sinful, flawed as they are. Right? Here's how we could live in a God pleasing way within them. And then when the opportunity comes, then we will change them. But even when we have the opportunity to change them, you can't just do that with one vote. Right. Like this is going to take a lot of time. And so you end up with a world in which Christian societies are the only societies in this view of the world who have ever abolished slavery. Other than that slavery is universal. Yeah. But that takes time and function to do it. If you're, you know, a mature, thinking adult, you should be able to understand that. That you can't just overhaul the economy of a global empire overnight."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":1929.55,"end":1953.76,"speaker":"Jonathan Pageau","text":"That there are degrees, like, you can see it in some ways, like taking what St. Paul said, you know, how to treat your servants, how to treat people that are under you, became the pattern by which then that structure transformed. Moving into the Middle Ages. Like, you would have much preferred being a serf in the Middle Ages than, you know, a slave in the Roman Empire."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":1953.76,"end":1954.2,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":1954.28,"end":1987.66,"speaker":"Jonathan Pageau","text":"Because you actually did have rights. You were bound to the land. There were things that your lord was not allowed to do. He couldn't chase you away. He had to take care of you. He actually had to take care of your needs. All of these things were a complete transformation and were in some ways the beginning of what we now believe authority is for. Like, we, we. We believe that our state is there in some respects to care for us, you know, like a father or like, you know, take care for. Of our needs. Whereas that was not the case for the Roman slave. They were basically just animals like that that could be killed and, you know, disposed of whenever they needed to."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":1988.22,"end":2005.23,"speaker":"Fr Stephen De Young","text":"And the most basic elements were immediate. Immediately, immediately from St. Paul on. Right. You can't use your slave sex for your sexual gratification. That's kind of huge."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":2005.71,"end":2006.19,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":2006.19,"end":2074.74,"speaker":"Fr Stephen De Young","text":"For enslaved people in the Roman Empire. Right. I mean, that, that freedom for being raped. Right. Is pretty big. Right. Including children who were slaves. A lot of dark stuff happened in the Roman Empire. Yeah. It's one of my problem with both of the gladiator movies is they're kind of presenting Rome as this sort of idyllic dream that people had, and it was kind of a dream of domination and violence. I'm sorry. Yeah. You know, as. As Livey said, they created a wasteland and called it peace, you know, but, but, yeah, so those things were overnight. Those things were, oh, well, there's going to be a process by which you have to stop sexually abusing your slaves. It's like, no, that ends now. Right. And, you know, beating them to death ends now. And, you know, but changing the institutions. Right. Someone coming up with the idea of wage labor was not going to happen overnight. Right. Getting everybody on board with it. And, you know."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":2077.62,"end":2150.75,"speaker":"Jonathan Pageau","text":"And so there's a. There's a text. I forget where it is. I'm Horrible. I'm not a chapter and verse guy, but there's a wonderful text in which St. Paul talks about how Christ is ascending at this moment. Like he's ascending the hierarchy of principalities and he's. He's like dominating the principalities. And it's a. To me, that text is wonderful because it, you know, when you think about the situation, which Paul was right, both in his own, you know, Jewish world and, you know, compared to what the Romans, how the Romans were treating themselves, the fact that he could foresee that, it seems amazing to us now because all of it happened, right? Christ was secretly ascending the hierarchy and dominating these principalities. And at some point the fruits of that, like you said, became visible, you know, in the transformation of the Roman Empire, you know, and, you know, you can really realize that if you read. When you read St. Paul from our point of view now, we can kind of. We can kind of make the mistake and think the Christians had already won. But in fact, it was really a powerful insight that he had that this was. In some ways, he could see that it was going to happen."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":2152.1,"end":2179.46,"speaker":"Fr Stephen De Young","text":"Right? Yeah. So in his mind, Christ had won. Right. And now for him, this is coming out of his reading of the Old Testament and the way in which Yahweh, the God of Israel, led the people of Israel in battle. Right. It was very clear. He's the one who's winning the battle. He's the one who's winning the victory. And then he shares the spoils. You know, his people sort of come in after."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":2180.63,"end":2181.91,"speaker":"Jonathan Pageau","text":"Right. And."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":2182.31,"end":2302.58,"speaker":"Fr Stephen De Young","text":"And collect the results of the victory and come and occupy the territory. But he's the one who's gotten one. And so St. Paul applies that really to. To Christ. He's won the victory. And so now what he's doing is going in. He's not really. I mean, there were battles. There were still skirmishes after the. The war is basically over, right? There's still skirmishes and battles and things that happen. But that's how he sees things. And again, he doesn't have this disconnect between material reality and spiritual reality, right? So the spiritual reality is playing out in material reality. So when he goes to Thessaloniki and he gathers a Christian community there, that Christian community is sort of an outpost. And everyone who's drawn into it and out of the broader world of Thessaloniki, that's dominated by this spirit that they called Aphrodite, which is a spirit of lust and sensuality and sexuality, is breaking the power that that spirit has over Thessaloniki. And then when that's ultimately completely broken. Right. Then Christ replaces that spirit in the hierarchy with one of his own appointees. Right. Saint Demetrius comes and is now part of the new administration. Right. Under new management. But that's not just this hypothetical thing. We're like, oh, now Saint Demetrius is the patron saint of the Thessaloniki. Right. For St. Paul, this is a very real thing that is happening. Yeah. These spirits are being removed and replaced with. By Christ with his own people who will shepherd the world and the things in it in the way they were supposed to."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":2303.46,"end":2318.39,"speaker":"Jonathan Pageau","text":"And so do you. Yeah. You think, you see that St. Paul was really already talking about this in his epistles, that he is intimating that the. The. The saints are replacing these principalities."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":2318.63,"end":2370.45,"speaker":"Fr Stephen De Young","text":"Yes, yes, absolutely. Yeah. And. And he sees them on a lower level. This is. I know we talked about this once before, but in terms of how I understand what he means by baptism for the dead, that this is. Has to do with patron saints. Right. That's replacing the gods of this family. Right. That's replacing the. The. These spirits actually. Right. That. That's an ontological reality. And so that's why often some of our Protestant friends will say, oh, well, the federation of the saints and stuff, that's like paganism and all the pagan gods and polytheism. And it's like. Well, no, we believe that. That ontologically actually happened. Those spirits actually got replaced by the spirits of the righteous made perfect."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":2370.77,"end":2419.67,"speaker":"Jonathan Pageau","text":"Yeah. And it seems. I mean, you can see it. It's intimated by Christ. I think one of the. The mistakes people make is that they. Because they have this idea of eschatology, which is something like, you know, you know, in the future, that is that, like, when everything's over, then we will reign with Christ and will be like, you know, and so some people can kind of accept that, and they don't totally. It's hard to understand exactly what it means for them. But the idea is that. No, that is that this is happening. It's happening already. That it is. The kingdom of heaven is already there and that there is an eschatological reality in which all of that will be. Will reach its finality, you could say, or be revealed in its fullness, but that the saints are already ruling with Christ, you know, right after his. His resurrection."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":2419.91,"end":2459.19,"speaker":"Fr Stephen De Young","text":"Yeah. And this is the influence of Puritanism, that. That's where this comes from. Right. Which is a rejection of monarchy, a rejection of hierarchies. And so they recast hell as a hierarchy with the devil at the top. Like, look at Milton, who's a puritan. Right. So now evil has a hierarchy, the pagan gods have a hierarchy, but then that gets done away with by Christ in terms of this sort of blessed peaceful anarchy, Right. Where all of these authority structures are taken, are not replaced, but taken away. Yeah, right, yeah."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":2459.19,"end":2473.11,"speaker":"Jonathan Pageau","text":"And then it's God, it's God above and then a bunch of free anarchic individuals here below that are kind of freely associated with each other, but there's no hierarchy amongst them and there's no hierarchy left in the world."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":2473.4,"end":2479.64,"speaker":"Fr Stephen De Young","text":"And any one of them who tries to take power is sort of being like the way they've now recast Satan."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":2479.96,"end":2520.37,"speaker":"Jonathan Pageau","text":"Yeah, yeah. But the thing that's funny because in some ways that's actually true. It's true that if you try to take power, usually that's what ends up happening, but that's not how it manifests itself in the Christian tradition. You know, it's like that there's people who. It's not that people are taking power, is that they're receiving it. Right. That's where we have this idea of apostolic succession. You know, we, we would someone self declaring themselves a bishop or a priest today is as much excommunicated, you know, although it's happened, obviously we know it's happened but, but it's still, we, we view that as a serious, a serious issue. That is not the right way it should happen."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":2521.25,"end":2631.28,"speaker":"Fr Stephen De Young","text":"Right, right. Because we would see that as exercising. And this is, so this is the core, I think if you want to isolate what St. Paul is saying in terms of salvation in the Gospel. The core of it is this idea of faithfulness, but not just a kind of general universal faithfulness. So there is that level, there's that level at which everyone, every human is called to, you know, put off sexual immorality, put off idolatry, right? So there's a common put off, lies put up, right? But then for St. Paul, every person receives their own gifts from the Holy Spirit and has their own particular calling from God, right. His is to become, you know, the apostle to the Gentiles. The emperor is calling us to be emperor, right? The, the governor is calling us to be emperor, right? And, and you know, St. Peter's calling us to be an apostle, right. To, to the community in Jerusalem and then in Rome, right. So every person has their own particular calling and it is faithfulness not just to that broad calling but to that particular one that is where you find salvation, right? So it's, it's in the particular time and place where God has placed you and the gifts he's given to you, you're called to fulfill this role. Right. And so wherever that role is in the hierarchy. Right. Wherever that role is in terms of the esteem of other people, it is through fulfilling that role that you find that you find salvation. And this cuts against, again, that puritan kind of generalizing thing where it has to be the same for everybody."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":2631.77,"end":2632.09,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":2632.25,"end":2656.33,"speaker":"Fr Stephen De Young","text":"Which is, which is why a lot of St. Paul could totally understand St. Simeon the Stylite, but most Christians today can't understand St. Simeon the Stylet. Why is it good for him to sit on a pole and be covered with bugs and be filthy and. Right. Receive this wisdom from God. Right. This just seems totally bizarre."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":2656.57,"end":2657.05,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":2657.78,"end":2665.54,"speaker":"Fr Stephen De Young","text":"To people today. But St. Paul could totally understand that. No, he's like Ezekiel who wandered around naked, you know."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":2665.86,"end":2666.54,"speaker":"Jonathan Pageau","text":"Yeah, yeah."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":2666.54,"end":2676.5,"speaker":"Fr Stephen De Young","text":"The Jewish people for a year. This is this weird radical calling that this one person has gotten from God and no one else should do that, but he needs to do that."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":2677.62,"end":2807.72,"speaker":"Jonathan Pageau","text":"That is such a great point because you definitely see that all the time where people use this Kantian imperative idea about reality and they apply it everywhere. They have this idea that, you know, you know, if everybody did what Saint Simeon or if everybody became a monk, then it means that there'd be no more human. So obviously monasticism can't be what God wants because, you know, God said be fruitful and multiply. Therefore, if, if there are monks, it has to be like against God's will. And like you said, the, the, there is a way in which there are, there is a hierarchy of callings. And that hierarchy of calling leads apophatically towards the kind of self sacrifice as you move up. But what it does, it does the opposite of what people think. It actually yields the world. It's like the monastery yields families downstream from itself. Not directly, not the monk himself, but the fact of monks and the fact of care. Crazy characters like Saint Simeon or the, you know, the hermits that live in caves, you know, down the mountain from them are like fruitful large families that are living faithfully. That's what, that's what it yields. That's what, in some ways, that's one of the things that understanding hierarchy can, can do, is to help you understand how the, the, how the world kind of proceeds down, how when you have characters that shine, that become these examples that they, they, they open up, they open up the world. Right. And, and all of that makes, how can help you make sense of so many things. You know, like the idea that Christians believe that the Highest ideal is something like a. Someone who, like Saint Simeon the stylite or, or I say Moses the Black, you know, that, that, that, that are let themselves be killed by bandits or you know, do all these kind of stuff that are very extreme. That downstream from that is actually nations that defend themselves. Like now, downstream, that is actually like healthy, you know, nations that are able to. Or, or it doesn't mean that it has to happen at. How can I say this? Like the apophatic yields fruit. It doesn't make the whole world stop to disappear. Like, it doesn't, it doesn't like swallow the world into it. I don't know if that makes sense. I'm kind of on the edge here on my thinking."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":2807.72,"end":2810.76,"speaker":"Fr Stephen De Young","text":"Well, right. But it also doesn't make everything the same."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":2811,"end":2811.8,"speaker":"Jonathan Pageau","text":"Yeah, yeah, yeah."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":2811.8,"end":2914.46,"speaker":"Fr Stephen De Young","text":"And everyone the same. Right. We have. This is one of the wonderful things I think about orthodox iconography as an object lesson in this. You look at Byzantine iconography and on one level, all the saints kind of look the same. Right. In terms of the style and everything. Right. Like there's definite patterns. Right. But on the other hand, they also are all different. And that's important because they show us a thousand different ways to follow Christ and be faithful to one's calling. Right. So you're not being called. All Christians aren't called to just, you know, adopt the same mode of dress and attire and way of speaking and tone of voice and all these. Quite the opposite. Right. Quite the opposite. There are people who are called to different things and pride struggles against that mightily because we all want to have the callings that get more prestige and more thanks from other humans. You know, people want to be priests, they don't want to be church janitors. Right. Like aspirationally. But there are times where the things the janitor does are more important to the life of the community than what the priests might be doing that day. You know, there's a lot of, there's a lot of that. But that could be mistaken, as the puritans did, for there being something wrong with someone trying to exercise God given authority."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":2914.7,"end":2983.65,"speaker":"Jonathan Pageau","text":"Yeah, yeah. And I think that Christian hierarchy and the way that Christ sets it up is in some ways I've always thought that it's the solution to hierarchy, you know, because. Because there's a sense in which we actually, we can't avoid hierarchy. We need it. There's no way around it. Even your actions are organized hierarchically. Even your perception is organized hierarchically. You just can't avoid it. But the vision of the relationship between the people who are in authority and those that follow them. You know, in some ways it's like a self sacrificial authority. And what that does is it actually grounds hierarchy in something which feels. Fills the world. Right. It fills the world with. And so the, the leader is there, the people serve the leader, but the leader gives himself. Right. Gives himself down to the people that serve him. And that seems to be the way the world works. It actually seems to be the way that, that, that reality functions and that Christ has revealed that to us in a very powerful way. But we always fall back on the old models of obviously of power. But that's not what Christ showed us."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":2984.05,"end":2987.01,"speaker":"Fr Stephen De Young","text":"Right, right. And it's, it's sacrificial on both sides."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":2987.25,"end":2988.13,"speaker":"Jonathan Pageau","text":"Yeah, that's right."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":2988.13,"end":3008.78,"speaker":"Fr Stephen De Young","text":"Yeah. And you know, as much as it's, it's very easy for us to point to, well, yes, our leaders should be more self sacrificial. It should be more Christ like that. It's true. Right. I as a priest should be much more Christ like than I am. But most of us struggle more with the other side of that."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":3008.78,"end":3013.5,"speaker":"Jonathan Pageau","text":"Yeah. Especially in, especially like in America, especially in North America. We struggle with the other part."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":3013.82,"end":3052.6,"speaker":"Fr Stephen De Young","text":"Right. Because even if there are situations, right. There are situations where. Not with my bishop. My bishop is wonderful. It never makes mistakes. But you know, certain times I have been around certain other bishops who of course I won't name. Right. And I've got a PhD in biblical studies and they'll say something about the Bible that I know is just not true. Right. Or just not correct. Right. Or needs a lot more nuance at least. Right. Shall we say."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":3052.84,"end":3056.92,"speaker":"Jonathan Pageau","text":"The actually aspect of Father Stephen is just burning inside."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":3057,"end":3091.82,"speaker":"Fr Stephen De Young","text":"They are above me in the hierarchy and so I have to muster the humility to say nothing. Right. And not, not try to correct. Right. And, but that you don't need a PhD to have that experience. Right. The first time your spiritual father gives you advice that you don't like, you have that experience, right? Of well, no, this seems right to me and I know the scriptures say the way that seems right to me has its end in destruction. But, but what he's saying seems wrong to me and so I don't want to do it, you know."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":3093.26,"end":3122.72,"speaker":"Jonathan Pageau","text":"Yeah. And there are so many beautiful examples in our tradition of people who find themselves in unjust, even sometimes unjust situations and through a kind of wisdom and a kind of way of having reverence towards the authority without necessarily giving into the immoral aspects or whatever they're Able to transform the situation, you know. You know, without rebelling. You could say rebelling explicitly, like without trying to take over authority. Revolution. Revolutionary thinking."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":3123.04,"end":3145.02,"speaker":"Fr Stephen De Young","text":"Yeah, well, yeah. I mean, you think of David's men standing there with him saying, like, look, you've already been anointed king. God has anointed you king. He's trying to kill you. Right. Just take him out. We'll say it was self defense. Right. Like he's trying to kill you."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":3145.18,"end":3145.74,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":3146.22,"end":3150.62,"speaker":"Fr Stephen De Young","text":"You know, and there's no, you know, that's."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":3151.82,"end":3161.14,"speaker":"Jonathan Pageau","text":"Yeah, it's pretty amazing. Yeah. There's so many. There are so many powerful, you know, stories of. There are so many powerful stories of that. I forget. I think it was."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":3161.14,"end":3161.62,"speaker":"Fr Stephen De Young","text":"Is it."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":3161.62,"end":3209.57,"speaker":"Jonathan Pageau","text":"I forget. I think. Is it Saint Elizabeth? I, I'm. I'm. It's horrible. You know, the, the, the. The story of, you know, certain corrupt priests who are acting. Oh, St. Francis has done this, like, in the, in the Western tradition where he. Somebody asked him, like a priest is living with a woman, and he says, you know, what about this guy, you know, you know, he's leaving with a woman. And Francis, like, gets down on his knees and kisses his feet and says, I'm not worthy, you know, to even be in this person's presence. And it's like, then the, this whole image of St. Paul saying, like, you know, putting coal on someone's head, like basically shoving coal on their head. It's like, man, can you imagine that. That priest then like, going back home after that and like, having a serious decision to make about what his life is going to be, you know, so there are beautiful moments like that."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":3209.97,"end":3239.02,"speaker":"Fr Stephen De Young","text":"Yeah. Yeah. So that's. Yeah. And again, you know, talking about taking St. Paul as historical context. Right. That the idea of some kind of anarchic situation or sort of, it's just. Everything is just between me and God or, you know, it just is ridiculous. Right. It's absurd."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":3239.82,"end":3279.12,"speaker":"Jonathan Pageau","text":"There is this accusation, Father, that I've heard, you know, from different circles, that in some ways we're the Church of St. Paul. Right. You know, this idea also coming out of different. Supposedly the idea of different Christianities that would have existed at the time, that the conflict between St. Paul and St. Peter was actually more than what we think. You know, I've even heard people say that Simon the Magus is actually Peter. You've heard these, these, these, these legends, these ideas that modern scholars have. You know, and so how do you see, I think, in rereading St. Paul in his context, you know, how do you see him as an more of an extension of Christ is the way you talked about it."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":3279.52,"end":3405.5,"speaker":"Fr Stephen De Young","text":"Well, I mean, the big problem there is that there's this assumption that again, because of the caricature of first century Judaism, that St. Paul is somehow anti Judaism. And so when you look at St. James and you look at St. Peter who are very clearly practicing Jewish Christianity, meaning they're still keeping the Torah, right? They're, they're still keeping kosher, they're still doing all those things that therefore, and, and, and if you then misread St. Paul to be saying all those things are bad and you should stop doing them, then it seems like there's this obvious dichotomy. But if you actually read St. Paul, he literally never says they're bad and that people should stop doing them. And he and his Epistle to the Galatians is basically him explaining and helping circulate the epistle that St. James sends out in Acts 15, which is to say that the, the Christians from the nations, because that's what gentiles means, right, are to enter into the Christian communities, to enter into the church as whoever they are and remain that. So if you're a Greek, right, you become a Christian Greek. If you're an Egyptian, you become a Christian Egyptian. If you're a Syrian, you become a Christian Syrian, you don't become Jewish, right, in order to become Christian. But St. Paul is also very clear over and over again. And you have to do a lot of twisting around to get around some of these passages, frankly, you have to do the whole, well, clear, unclear thing, right? So here he's clear that, you know, usually the places where they say he's clear, places where he's talking to Gentiles and telling them these things don't apply to you. He's talking to non Jews and saying these things don't apply to you, which every Jewish person at the time and every Jewish person today would agree with, by the way."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":3406.94,"end":3445.59,"speaker":"Jonathan Pageau","text":"Yeah, yeah, yeah, right. This, is, this, is this, is this going to be a little more controversial? Sorry, you feel free to answer or not. So, you know, there was, there did come a time, you know, in the later centuries where there were more explicit canons and rules against the practicing of the Jewish feast. For example, you know, we don't, we don't practice the Sabbath and there are certain, you know, there certain rules later that made it that we wouldn't, you know, like even I think our pascha can never be on the same in, in the, in the Orthodox."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":3445.59,"end":3447.51,"speaker":"Fr Stephen De Young","text":"That's not actually true, but that's not true."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":3447.51,"end":3447.87,"speaker":"Jonathan Pageau","text":"All right."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":3447.87,"end":3450.99,"speaker":"Fr Stephen De Young","text":"Okay. Yeah. Some of these things are misnomers. Yeah."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":3450.99,"end":3477.28,"speaker":"Jonathan Pageau","text":"All right. Okay. And so how would you, I mean, I mean, I'm trying to, to think about it like, maybe think about it in like a modern sense. So if you were, let's say if you were Jewish today and you converted to Orthodox Christianity, do you think there is. Would be room for, for people still maintaining some of their Jewish practices? You know, because this is the whole Spanish Inquisition question here."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":3477.68,"end":3483.6,"speaker":"Fr Stephen De Young","text":"Right. So there are actually a bunch of variables there to consider."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":3483.92,"end":3484.56,"speaker":"Jonathan Pageau","text":"Okay."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":3484.56,"end":3558.02,"speaker":"Fr Stephen De Young","text":"Right. Now I do have to say, and I'm not going to out anybody here, but there are cases in our own day of people who were religiously Jewish. So it's relatively rare that religious Jews convert to Orthodox Christianity, secular Jews. Right. And so there's two different issues there. Right. So a secular Jew who hasn't been practicing these things, hasn't been keeping kosher, hasn't been practicing any of these things, who joins the Orthodox Church. The Orthodox Church is not going to say, oh, well, you need to start doing all these things. Right. But if you have a religious Jewish person. Right. The question is, is the, does the Orthodox Church tell them, well, you need to stop, you need to start eating double cheeseburgers with and put bacon on them to boot. Right. You need to start doing these things or stop doing those things and, and change. And again, without outing anybody, I could tell you there are cases of this in the present day Orthodox Church where bishops have encouraged those Jewish Orthodox Christians to continue in those things."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":3558.1,"end":3558.74,"speaker":"Jonathan Pageau","text":"Okay."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":3560.02,"end":3565.62,"speaker":"Fr Stephen De Young","text":"The bigger issue there with individual conversions though is the life of the community."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":3566.26,"end":3566.82,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":3567.3,"end":3598.39,"speaker":"Fr Stephen De Young","text":"Because then you've got one person keeping kosher in an Orthodox Christian community that isn't because no one else there is Jewish. That causes problems, you know, after that coffee hour on Sunday at the Pascha feast at the. And so it's important, we think very individualistically as water people. Right. And the, the Torah is not designed to be practiced individually."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":3598.79,"end":3599.27,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":3599.48,"end":3611,"speaker":"Fr Stephen De Young","text":"It's designed to be practiced as a community. And from the Jewish side, you have to have 10 adult Jewish males to have a Jewish community and to put these things into practice."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":3611,"end":3611.72,"speaker":"Jonathan Pageau","text":"Right, Right."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":3612.68,"end":3681.74,"speaker":"Fr Stephen De Young","text":"So to me, the question becomes more if, and this would be wonderful, like let's say tomorrow the Chief Rabbinate of Israel converts to Orthodox Christianity and comes into the Patriarchate of Jerusalem. This would be a wonderful miracle. Right. If this were to happen. Because if they did that, you'd have this mass conversion of Orthodox Jews. Right. To Christianity in their communities where you have a community that is entirely made up of Jewish Orthodox Christians. Right. I suspect that it would look a lot more like 1st century Jewish Christianity and that there would be significant parts of the Torah that they continued to keep. Possibly like keeping kosher and those kind of things. Right. That would continue. But the key thing here is. And this is what, this is what really makes these discussions controversial is that we're thinking like Protestants. We're thinking like Protestants in the sense that both of that universalization and in terms of we make everything about like, well, does that mean you go to hell?"}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":3682.14,"end":3682.54,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":3682.54,"end":3697.66,"speaker":"Fr Stephen De Young","text":"Are you saying Jewish people have to keep kosher or they go to hell? Yeah. Are you saying it's like, go ask a Jewish person, Right. Are you keeping kosher? Because if you don't, you won't go to heaven."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":3697.9,"end":3698.38,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":3699.74,"end":3704.22,"speaker":"Fr Stephen De Young","text":"They'll laugh at you. Yeah, right. That's never how it worked."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":3704.38,"end":3705.26,"speaker":"Jonathan Pageau","text":"Yeah, yeah, yeah."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":3705.59,"end":3737.52,"speaker":"Fr Stephen De Young","text":"Right. It is much more like. And this should be understandable to Orthodox Christians, right? Because we have the same thing, if we're honest, within Orthodox Christianity, just like in Orthodox Judaism, there's levels of observance. Of course, we have people in our church who keep the fasts very strictly, and we have people who don't keep them at all. And everything in between. And you have Jewish people, even who identify as Orthodox who keep kosher very strictly."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":3737.6,"end":3738.32,"speaker":"Jonathan Pageau","text":"Yeah, yeah."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":3738.4,"end":3741.04,"speaker":"Fr Stephen De Young","text":"And who don't keep it at all. And everything in between."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":3741.12,"end":3741.8,"speaker":"Jonathan Pageau","text":"Everything between."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":3741.8,"end":3757.61,"speaker":"Fr Stephen De Young","text":"Yeah. Right. And so those things are functioning the same kind of way, Right. As the traditions we've received as Greek Orthodox or Russian Orthodox. And those aren't identical, right?"}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":3757.61,"end":3799.89,"speaker":"Jonathan Pageau","text":"Yeah, yeah, yeah. I mean, what about. I mean, I guess one of the questions is circumcision. You know, I do have. I have some friends that have Jewish ancestry, you know, practicing Jewish ancestry, and, you know, they decided to circumcise their son even though they are Orthodox. And that was an example of a place where I was. I was kind of wondering in my, you know, I'm not, of. I'm not a rigor. I'm not a rigorist. And so I thought that it was a, that it was appropriate, you know, to kind of, to respect that, that tradition if they, if, if it's something that came all the way down to them. But I wondered. I'm like, I wondered what some of the, the ecclesiastical authorities would think about that."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":3800.05,"end":3824.01,"speaker":"Fr Stephen De Young","text":"Right. Well, so if I was, If I was that person's spiritual father, and this wasn't a case where I felt like I needed to punt to the bishop, Right. Which with difficult cases that's the right thing to do, by the way, if you're a priest. That's. But what I would want to know is why."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":3824.97,"end":3825.37,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":3826.57,"end":3883.2,"speaker":"Fr Stephen De Young","text":"Why? And if they told me, like, well, this is what makes them a child of Abraham and an heir to the promises of God, that would be a problem. Right. Like that. As opposed to their baptism. Right. If they said to me, this is the ancient tradition of our people given to us by God. Right. And we think this is a good thing and here's what it represents to us. Right. And they had a thoroughly understood view of baptism in addition to that. Right. And they were baptizing the baby too. Right. And everything. I think that would be a place where it would be salutary. Right. Because we have to deal with the fact that, like, St. Paul has St. Timothy get circumcised."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":3883.6,"end":3884.08,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":3886.16,"end":3909.93,"speaker":"Fr Stephen De Young","text":"Right. I mean, we really. When it comes down to it, if you're really going to deal Honestly with St. Paul, you have to deal with the fact that not only did he take a Nazarite vow at one point, but he went and paid for the animal sacrifices at the conclusion of a bunch of Christians taking Nazarite vows. Animal sacrifices, including a sin offering after the ascension of Christ."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":3910.41,"end":3911.37,"speaker":"Jonathan Pageau","text":"Yeah, yeah."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":3911.45,"end":3925.31,"speaker":"Fr Stephen De Young","text":"Right. This is just the reality. There were those Jewish Christians in the first century. They included many of the most notable apostles, like St. James and St. Peter, who continued to practice these things. So there was a Jewish Orthodox Christianity in the first century."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":3925.71,"end":3951.53,"speaker":"Jonathan Pageau","text":"Well, when you see, like, when you see that, it says that the. That the apostles and the disciples went to the temple. It's like, what. That's what happens at the temple. So if they were going to the temple all the time, it meant that they were participating in these. In these rituals. There was no. It seemed like there's no. It's a little different when it says they went to the synagogue, then you could kind of. You can kind of. But when it says they went to the temple, it's like that's what was going on there."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":3951.53,"end":4054.08,"speaker":"Fr Stephen De Young","text":"Right. And it makes everybody uncomfortable, of course, but we have to be honest with that and record with that. And I think the way we reckon with that is those were things given to the Jewish people. Right. Until the temple was taken away. Yeah. And then God took the temple away. And so that was no longer a part of this. Yeah, it was everywhere else. The way Christianity was practiced was additive. So they went to the synagogue on the Sabbath. Right. And then there was a gathering just of the Christian subset of the Jewish community on the Lord's Day, which actually started at sundown. But this is where that gathering started. And that was centered around the Eucharist. Right. Which was a sacrificial thank offering. Yeah. And so it was seen as this is. Right. This additional ministry. Right. With its own Christian priesthood and its own things. And then it went from being a supplement to being the thing. But, you know, you mentioned the Sabbath, interestingly. Go ask a Jewish person if Gentiles should keep the Sabbath. They'll tell you Gentiles aren't allowed to keep the Sabbath. Right. And I would also point out that in Christian countries, actual Christian countries, where they don't name the days of the week after pagan gods, the name of that day is still the Sabbath. Right. And then the name of the day after that is the Lord's day."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":4055.16,"end":4062.92,"speaker":"Jonathan Pageau","text":"Yeah, I mean, it is still. It is still for us, because Sabbath. Because Sabbath is also Saturn. Like we still have Saturn to Saturn day."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":4063.16,"end":4065.28,"speaker":"Fr Stephen De Young","text":"Well, yeah, so we go. Yeah, we also."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":4065.28,"end":4083.35,"speaker":"Jonathan Pageau","text":"Do we also have the idea that that Saturday is the Sabbath day, Although it's. It's a little. It's. It's like once removed, but it's still there. Yeah, definitely. Yeah, definitely. I mean, this is really fascinating. It'll be interesting to see how people react to some of the things you said in the comments. And so, Father, on a good day."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":4083.35,"end":4086.71,"speaker":"Fr Stephen De Young","text":"I get called both a Judaizer and an anti Semite at the same time."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":4086.71,"end":4162.18,"speaker":"Jonathan Pageau","text":"There you go. Yeah, I've seen people kind of, kind of call you that. I think, you know, it's interesting for me to think about that because it seems like in the evacuation of Christianity from popular culture, there is no other solution besides going back and reconnecting things together, you know, because we. It was understandable that in like the year 1600 in Serbia or something, that we just were baking. We're just soaking like we're soaking in all of this tradition. Everything is there. And so there isn't maybe as much a need, for example, even for people to know the scripture, like to know all the Old Testament stories, like, you know, some villager and he. It wasn't something that was that. That was needed for their. For their spiritual life, maybe a little bit, but not. Not as much as now. Now we almost have no choice to really kind of re dive back into the cosmology of the first century to help people kind of see how it affords a world for us at this moment. And strangely enough, this is what I also believe is that we are in a moment with these weird artificial intelligence things happening with all of this kind of technification of our reality."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":4162.21,"end":4162.37,"speaker":"Fr Stephen De Young","text":"We."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":4162.52,"end":4186.12,"speaker":"Jonathan Pageau","text":"We are in a world where the. Actually the cosmology and the vision of principalities and. And, you know, the council of God, all of these images that were there in the first century, they are actually the thing we need to understand right now in order to understand the world we live in. And so there's a strange. There's these strange threads kind of being. Being pulled together where we. We just have to be more deliberate about this stuff today."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":4187,"end":4262.74,"speaker":"Fr Stephen De Young","text":"Yeah. I think one of the major functions of tradition has been to preserve context. Right. So one example of this that I've used a lot before is. And I know not all orthodox churches do this every Pascha, but the knocking on the doors, the lift up the heads, oh, ye gates. Right. Which we understand quote from a psalm, we understand this to be connected to the harrowing of Hades. If you go back to the psalm, you can kind of see how that works. It looks like this weird allegorical reading of it. But now, since in the 1960s, we dug up the city of Ugarit and have read the BAAL cycle in Ugaritic, we. We now know that that psalm is referencing the BAAL cycle. And so what the psalm was talking about in its original context was Yahweh descending into the netherworld to defeat baal. And so now we've taken that and applied that to the harrowing of Hades in Christ's resurrection. And so that all fits together and makes sense now."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":4262.9,"end":4263.34,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":4263.34,"end":4271.46,"speaker":"Fr Stephen De Young","text":"Right. Now, for centuries, they didn't need to read the BAAL cycle. They didn't need tradition had preserved that interpretation of the psalm."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":4271.62,"end":4272.26,"speaker":"Jonathan Pageau","text":"Yeah, yeah."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":4272.26,"end":4282.18,"speaker":"Fr Stephen De Young","text":"Liturgically. Right. But now we've come into an age where we have a lot of people, even our fellow Christians, going, well, that tradition of yours just seems weird and arbitrary."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":4282.18,"end":4283.42,"speaker":"Jonathan Pageau","text":"It makes sense. It's arbitrary."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":4283.42,"end":4287.54,"speaker":"Fr Stephen De Young","text":"Where are you getting that? Right. Where are you getting that? That's just some tradition somebody made up sometime."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":4287.7,"end":4288.38,"speaker":"Jonathan Pageau","text":"Yeah, yeah."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":4288.38,"end":4316.52,"speaker":"Fr Stephen De Young","text":"And so now, simultaneously with that, we've had these finds like the Dead Sea Scrolls and Ugarit. Right. And going back into the text and uncovering that original context, which to me, when you. The more you understand it, the more you see the bait, what it is that tradition has been preserving. Right. And it all kinds of falls, kind of falls into place."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":4316.76,"end":4364.96,"speaker":"Jonathan Pageau","text":"Yeah. And I think, at least for me, that's one of the greatest roles that you're playing is because a lot of these texts, these old, ancient texts have been used to attack Christianity. Right. People, they. They discovered all These, These ancient texts, and they're saying, well, here's another vision. Like, here's something that you didn't know, and it's, it's actually undermined the. The Christian message. And I think one of the greatest things you've been able to bring is to say, no, actually, it's very opposite. It actually enlightens. It actually illuminates the. The text and, and ground it and, and shows us how what we thought about it traditionally until now was right all along. You know, and like I said, even though we had lost the explicit connections, you know, tradition has preserved it, and now we can. If we can draw the explicit connections, that's great. But it was already there, you know."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":4365.04,"end":4411.39,"speaker":"Fr Stephen De Young","text":"Right, right. And so, yeah, and I. And I think that's. That's part of, you know, people are talking now because of that article about people coming into the Orthodox Church, and they want to try and make it all about masculinity so they can try and make it into this weird alt right thing. Yeah, but in my experience, I mean, the people who. Bluntly, the people who are, like, looking at your content and then coming and listening to Lord of Spirits and then coming into the church, what I hear from them a lot more, the ones who are coming from sort of evangelical backgrounds is not like, oh, I wanted to be supermanly, but more that, you know, oh, now all of that sort of makes sense."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":4411.63,"end":4425.95,"speaker":"Jonathan Pageau","text":"Yeah. The deeper, the deeper connection, the sense of like a whole. Well, of possibilities, of understanding that are. Is more than just up here, but it's like, it's this. This grounded. It's a. It offers a cosmos, is what it does. In some ways."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":4426.19,"end":4434.67,"speaker":"Fr Stephen De Young","text":"Yeah. XYZ never made sense to me, but now I get it. Yeah. Right. And that's. And making those connections is very attractive to people."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":4435.23,"end":4448.19,"speaker":"Jonathan Pageau","text":"Yeah, I totally agree. I totally agree. So, Father, what are you hoping, let's say, if you could redo. If you could bring it to one thing, what are you hoping that this book's going to do? This book on St. Paul? Like, what are you hoping that it can help people understand? Mostly, yeah."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":4448.75,"end":4489.51,"speaker":"Fr Stephen De Young","text":"Honestly, my biggest goal, the best compliment I could get after somebody reads it, and I've said this a couple times before, is that people feel like they know St. Paul better as a person after reading it, because it's structured like a biography. But also there's commentary on the epistles, there's a new translation of the epistles. One. One person who read it, who has a PhD in history, told me that when they were reading the Translation, they said, oh, this sounds like it was written by the person you were talking about."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":4491.35,"end":4491.75,"speaker":"Laura Diaz","text":"Right?"}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":4492.23,"end":4494.07,"speaker":"Fr Stephen De Young","text":"Like in the first part of the book, Right?"}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":4494.07,"end":4494.55,"speaker":"Jonathan Pageau","text":"That's right."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":4495.59,"end":4534.7,"speaker":"Fr Stephen De Young","text":"I took that as a great compliment. Right. That, that I think is my biggest goal. Right. Is. Is to try to bring people into sort of contact with St. Paul, the actual person. Right. And so these other things, like I said, saying, oh, well, wait, now I see how Jesus and St. Paul fit together. Right. Or I see how St. Paul fits into the rest of the Bible. Or oh, wow, this makes a lot more sense of the Old Testament than the other way of trying to write. Those are all sort of icing on the cake to me afterwards."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":4535.34,"end":4555.74,"speaker":"Jonathan Pageau","text":"Wonderful. Well, Father, thanks for everything you do. And everybody. Check out the book. I don't have a copy. I was supposed to have one, but I think the mail, our mail has been on strike and so I was supposed to have a copy that I could show you. But we'll post a link to it in the description so you can all get it and hopefully this is once again. We'll talk again, Father. As usual, I'm pretty sure."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":4556.39,"end":4557.59,"speaker":"Fr Stephen De Young","text":"Yeah, I'm sure at some point."}
{"episode_id":"SW - #376 - 2025-02-07 - Fr. Stephen De Young - St. Paul the Pharisee","start":4558.63,"end":4621.44,"speaker":"Laura Diaz","text":"Thanks, Tucson. The weight is over. Mediweight loss. They're officially open on North Oracle Road. That's right. No more counting down the days. You can walk in right now and start your journey to a healthier you. Hey, it's Laura Diaz from iheartradio and you can trust me. This isn't just another weight loss clinic. I know that because it's where I lost weight safely with real medical support. GLP1 medications. You can see them everywhere online right now. But the truth is, your health shouldn't be a DIY project ordering these meds without the professional guidance. It can lead to dangerous mistakes, wrong doses, no oversight and serious risks. At mediweightloss, I got the same medication, but with a customized plan, weekly check ins and a licensed physician guiding me every step of the way. And the cost? The same as those risky online options. Tucson, your moment is here. If you're ready to take control, feel better and lose weight the right way, Medi weight loss is ready for you. Walk in, get started and see real results. Call or visit mediweightloss.com to learn more and book your free consultation today. That's mediweightloss.com."}
