{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":0.16,"end":59.17,"speaker":"Laura Diaz","text":"Tucson, the weight is over Mediweight loss. They're officially open on North Oracle Road. That's right. No more counting down the days. You can walk in right now and start your journey to a healthier you. Hey, it's Laura Diaz from iHeartRadio. And you can trust me. This isn't just another weight loss clinic. I know that because it's where I lost weight safely with real medical support. GLP1 medications. You can see them everywhere online right now. But the truth is your health shouldn't be a DIY project ordering these meds without the professional guidance. It can lead to dangerous mistakes, wrong doses, no oversight, and serious risks at mediweight loss. I got the same medication, but with a customized plan, weekly check ins, and a licensed physician guiding me every step of the way. And the cost? The same as those risky online options. Tucson, your moment is here. If you're ready to take control, feel better, and lose weight the right way, mediweight loss is ready for you. Walk in, get started and see real results. Call or visit mediweightloss.com to learn more and book your free consultation today."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":59.25,"end":65.65,"speaker":"Fr Stephen De Young","text":"That's mediweightloss.com these sort of elaborations are essentially a way of doing commentary."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":65.97,"end":66.53,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":67.25,"end":75.49,"speaker":"Fr Stephen De Young","text":"Of fleshing out the story to sort of interpret and apply it. And they weren't worried about this. You'll find what are basically anachronisms."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":75.81,"end":76.53,"speaker":"Jonathan Pageau","text":"Uhhuh."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":77.02,"end":111.15,"speaker":"Fr Stephen De Young","text":"Right. So we're talking about a story about Abraham that happened in, you know, circa 2000 BC and the. The added details are clearly stuff from say, the third or fourth century B.C. which is when. Around the time the text is written. And scholars treat this like, oh, they let slip when this was written. See, they're trying to convince us that Moses wrote this. But look here. They messed up, right? Not at all. That was not only not a mistake or not a problem, that was kind of deliberate."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":111.31,"end":111.79,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":111.87,"end":115.23,"speaker":"Fr Stephen De Young","text":"They were taking that story and bringing it into their own time."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":126.91,"end":130.59,"speaker":"Jonathan Pageau","text":"This is Jonathan Pedro. Welcome to the Symbolic world."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":135.77,"end":136.01,"speaker":"Fr Stephen De Young","text":"Foreign."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":140.65,"end":183.11,"speaker":"Jonathan Pageau","text":"Hello, everyone. I'm here with a. A character that is quite known to all of us. Father Stephen DeYoung is with us again today. This is great. We are offering a new class for Symbolic World. It's the first time that Father Stephen will be giving a class for Symbolic World. It is going to be on the Nephilim and jubilees. But today what we want to do is to give a little bit of a framing for why it matters. Like why this, this why Looking at these old second temple text and these Strange stories that are added to the Bible. Why? Why? It's not just about fascinating stories to discover, but why in some ways it's a. It's a kind of theology in storytelling and a theology in liturgy. So, Father Stephen, thanks for talking to me."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":183.67,"end":185.43,"speaker":"Fr Stephen De Young","text":"Absolutely. It's good to be here."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":186.07,"end":192.07,"speaker":"Jonathan Pageau","text":"So tell us a little bit first about, about what's the, what's the idea of the class and then, and then frame this discussion for us."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":192.39,"end":269.48,"speaker":"Fr Stephen De Young","text":"Yeah, so the class is really going to be about the Book of Jubilees, which is a piece of Second Temple Jewish literature. It's one of the most important ones, probably the first one people think of, maybe the Book of Enoch or 1st Enoch. But Jubilees has had an ongoing relevance. It's a little more sub rosa. You don't find people debating it as openly or that kind of thing. You're not going to find as many patristic quotes of people talking about the Book of Enoch and who wrote it and that kind of thing. But Jubilees is the very rare Second Temple Jewish text that you'll still find, for example, linked on Jewish websites, even Rabbinic Judaism, although they have a kind of weird relationship with it, but it has kind of lingered around and it has an afterlife into the medieval period in terms of elements of it. So that makes it in particular kind of important. And it does deal with the origins of the Nephilim and people get excited when I talk about giants. So we went ahead and put that in the title to remind people that that's going to be."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":269.56,"end":271.56,"speaker":"Jonathan Pageau","text":"We will be talking about the origin."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":272.68,"end":367.95,"speaker":"Fr Stephen De Young","text":"So get excited. But so it's going to be about the text. And what, what Jubilees really is is it's sort of an expanded retelling of the Book of Genesis and the first part of the Book of Exodus. So it's framed as. Here is the vision that Moses had and the experience that Moses has when he's on Mount Sinai for the 40 days from which he is going to compose Genesis and the part of Exodus leading up to him being there. So it includes, you know, the basic framework of the biblical stories of Genesis, but then also includes sort of expanded details, even whole other story elements and narrative elements that aren't there in the received text of Genesis. So that's, that's really what it is. That's what we're going to be covering. We're going to be discussing not just the traditions surrounding the Nephilim, but those. And then also these other traditions surrounding the patriarchal narratives about Abraham, Isaac and Jacob and Joseph creation, the Fall all of those things. And even with the frame story and some of the latter part of the text, some traditions about Moses himself and his prophetic role and experience."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":369.71,"end":376.75,"speaker":"Jonathan Pageau","text":"So why does that. Why does that matter? In some ways, it's bringing us to our discussion today. Why would we want. Why would we care about these stories?"}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":376.99,"end":500.54,"speaker":"Fr Stephen De Young","text":"Yeah. So this. This isn't just sort of the subject of antiquarian interest. Right. People who are just kind of interested in that. You know, this is the kind of thing you'll like if you like this sort of thing. But. But this is an example, and hopefully one of the main things I want to bring out over the course of the course is I want to sort of help teach people to understand a different way of doing theology than the modern way. We're all used to the modern way, right. Which is sort. And by modern, I don't even mean all modern theology. I mean sort of academic modern theology. Right. Where people do papers and present papers, and you have citations of this and that Bible verse, this and that church father, this and that other theologian. That's not how they did theology in Second Temple Judaism, including the New Testament. And that's not how the Fathers did theology. That's certainly not how people of the ancient near east, even before that, did theology. The theological texts we find, whether we're talking about Jewish texts, whether we're talking about pagan texts, whether we're talking about later Christian texts, they're explicitly Christian, take a variety of different forms in different genres. You get. You get narrative texts, you get ritual texts that describe the practices of the people the way they're living. You get poetic texts like the Psalms. The most quoted book in the New Testament of the Old Testament is the Psalms. Yeah. So the New Testament is driving most of its Old Testament theology from poems and hymns and songs. Right. Not from some kind of statement, arguments and statements. And so there's. There's this vast variety of texts, and I think one of the things that's afflicting the modern American, and I'm using America broadly to include our Canadian friends."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":500.62,"end":502.3,"speaker":"Jonathan Pageau","text":"To include us, yes."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":503.1,"end":504.22,"speaker":"Fr Stephen De Young","text":"See, I'm inclusive."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":504.46,"end":505.1,"speaker":"Jonathan Pageau","text":"There you go."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":509.26,"end":538.9,"speaker":"Fr Stephen De Young","text":"Or we could say modern Anglophone. Right. Orthodoxy, now I'm excluding the French, but anyway, is that we sort of don't appreciate this variety of ways of doing theology within our own orthodox tradition, and that that modern academic way is really a small recent minority of ways of writing and understanding and thinking theologically."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":540.74,"end":612.85,"speaker":"Jonathan Pageau","text":"Yeah, yeah. And then somewhat some people, they see theology really related to certain theological controversies, and that's where A lot of the theological thinking, or modern theological, at least the one that I see the argumentative type of theology comes from, which is that, you know, you take the conflict with St. Gregory Palmas, you take the conflict with the early councils, and then you kind of. You kind of build theology around that. But there is a. An aspect of living theology. Right. Which is the aspect of participation that we are in, and that is more in the liturgical text and the images that are proposed in the icons. You know, I was thinking about how in. In. During Holy Week, there are all, you know, especially in the funeral service, there are all these beautiful exchanges like this. You have the Mother of God, you know, telling. Asking her. Her son to. To resurrect, and there's all of these images that are brought about and this discussion that's happening, which is not in the Bible, like there's a. There's a discussion, you know, happening between the Virgin and Christian in our."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":612.85,"end":613.13,"speaker":"Fr Stephen De Young","text":"The."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":613.13,"end":634.69,"speaker":"Jonathan Pageau","text":"In our liturgical text, which is added to the. The Bible, but is not there just to add details or to some ways go against the Bible or to, you know, this kind of Protestant thing. But it is in some ways to do a type of theology which is participative, you know, and so maybe tell us a little bit about why, like, what that is and why that matters."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":634.85,"end":646.54,"speaker":"Fr Stephen De Young","text":"Yeah, well, and. And someone getting into an argument about, well, did Christ of the Theotokos actually exchange those exact words? Would be completely missing the point."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":646.62,"end":647.66,"speaker":"Jonathan Pageau","text":"Yes, exactly."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":648.22,"end":662.94,"speaker":"Fr Stephen De Young","text":"Right. It would be just right. Like, right over your head completely. But there's also. There, I want to add, though, I think in a lot of cases, that's a very reductionistic way of viewing the. The ecumenical councils, for example."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":662.94,"end":663.42,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":664.19,"end":681.07,"speaker":"Fr Stephen De Young","text":"When you actually read more about the ecumenical councils preparing for the second Ecumenical Council, say Gregory the Theologian is writing poetry about the Holy Trinity, you know, and a lot of the Fathers. A lot of what we have are homilies. And rhetoric is an art."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":681.47,"end":681.95,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":685.23,"end":726.85,"speaker":"Fr Stephen De Young","text":"The art of oration. And you read about the councils. They're singing hymns, they're bringing in the relics of martyrs into their midst while they're having these deliberations. So it wasn't sort of this, you know, academic debate taking place between Arius and. Right. His opponents. Necessarily. Right. In. In most cases, you have to go a lot further forward to hear that. But. But, yeah, I. I think a lot of people now are arriving at some fundamental misunderstandings. So I got asked, one of the 83 hats I wear now is that I'm a marvel Rivals Twitch Streamer."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":728.21,"end":730.93,"speaker":"Jonathan Pageau","text":"I'VE heard. I've heard about that. I've heard of those."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":731.17,"end":745.33,"speaker":"Fr Stephen De Young","text":"So while I'm playing this video game, people come on and ask me questions. And a lot of times the questions I get asked because the sort of folks who like watching people play video games on the Internet are people who spend a lot of time on the Internet."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":745.82,"end":746.14,"speaker":"Laura Diaz","text":"Yes."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":746.62,"end":767.38,"speaker":"Fr Stephen De Young","text":"And so whatever the sort of Internet social media theological controversy du jour is, tends to come up. I get asked about it in these streams, and one of those recently has been about the fate of unbaptized infants, apparently."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":767.38,"end":768.46,"speaker":"Jonathan Pageau","text":"Okay, yeah, yeah."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":769.26,"end":856.29,"speaker":"Fr Stephen De Young","text":"And there are apparently some people who identify as orthodox, you never know online, but who are trying to argue for a certain Western view that even the Roman Catholic Church doesn't hold anymore, apparently. And people are asking me and pointing out to me, like, well, what about this cynic sari and statement on this day here that's getting quoted? And what about this quote from this local council in the 17th century over here? They, they seemed to say maybe, like, you know, and my response to them was, right, well, hopefully you've never had to experience it, but why don't you go read the funeral service for a child? Read what we actually practice. What do we do when this happens? Right. And what are our practices? Right. I said, if you read that, I think you'll find that they're very clearly teaching the opposite of what these other people are saying. But notice I use the word teaching there. Right. And they're not teaching in this kind of didactic way. They're not laying out sort of these logical propositions. They're singing hymns because someone's child has died."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":856.45,"end":857.01,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":858.61,"end":884.85,"speaker":"Fr Stephen De Young","text":"And they're practicing certain things because this horrible thing has happened in the life of the church. And so we have to kind of reorient our whole idea of theology. And it's not conducive to social media debates. I don't think people are going to be able to. Well, here's an icon of this. Therefore you're wrong. Right."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":886.75,"end":887.47,"speaker":"Jonathan Pageau","text":"That's hilarious."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":890.83,"end":891.23,"speaker":"Laura Diaz","text":"So."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":891.79,"end":983.19,"speaker":"Fr Stephen De Young","text":"Right. Because it's sort of a different way. Right, right. Of thinking. And what, and, and what brought me to this is ultimately have it, you know, getting a PhD in biblical studies and studying the Bible. Right. At a certain point, you have to. I mean, what is the New Testament? The first five books are a series of narratives, and then the rest of it are letters written from apostles to particular churches dealing with particular situations that they're having in very particular ways. Right. Like St. Paul saying, hey, you know, return my cloak When I come, right, like naming people specifically, you know, I'm glad I only baptized these particular people. Well, oh yeah, these people, right. Like, it's this very particular thing about the particular lives of particular people. And sometimes when I say that, people will say, well, are you saying they're just irrelevant then to us today? And I'm like, no, right. That doesn't follow. There's this idea that unless it's just these timeless, logical propositions of truth, that it's not relevant because we haven't learned how to appreciate this wealth of, of theology and theological experience. Right. And how to take that and interpret and apply it."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":983.35,"end":1068.03,"speaker":"Jonathan Pageau","text":"Yeah, yeah, yeah. And so how do you say, how do you see, first of all, obviously I, I, I agree with you because, I mean, I think it would be obvious for people to see that I agree with you because my whole world is not that world. Like, my whole world is the other world, which I tend to then want to formulate that there is a need for some of it. Like, there's a need for some of the kind of structured theological, a little bit more debate type thing. But it definitely is because I see that because it's not my tendency, my tendency is really to live in the more imagistic aspect of the life of the church, you know, But I, but I think it is important to help formulate that for people. Like, why it is that these are the types of, this is the theology we live in. Like, the theology we live in is a theology of prayer. Like, it's a theology of encountering saints, encountering God, encountering Christ through the stories, through, through the, through the liturgical action. So maybe in terms of like the Book of Jubilees, for example, without using examples from that book, what, why do we have these stories that pop up? Like, what function do they play? What do these stories do in, to help us, let's say, how do they help us to, to live a fuller life in Christ."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":1068.99,"end":1079.19,"speaker":"Fr Stephen De Young","text":"Right? So essentially what produces texts like the Book of Jubilees in the Second Temple."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":1079.19,"end":1081.64,"speaker":"Jonathan Pageau","text":"Period is."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":1083.56,"end":1129.04,"speaker":"Fr Stephen De Young","text":"The same thing that we're always doing with the biblical text, which is we're trying to interpret it and we're trying to apply it. Right? We're trying to, and interpretation is a step toward applying it, right? Meaning. Interpretation is not, oh, there is some meaning. This text has a meaning that is out there somewhere, right. And we have to figure out the correct method to derive it. Right. Like analyzing the grammar or a more pious sounding version of this is, well, we need to just find a holy person, because the Holy Spirit will kind of whisper that secret meaning in their ear, and then they can tell us, you know, heathens. Right."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":1129.6,"end":1130.56,"speaker":"Jonathan Pageau","text":"Us humans."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":1133.29,"end":1220.73,"speaker":"Fr Stephen De Young","text":"But neither of those is really how this has. This has worked in the past. Right. And so people are hearing these stories in the Second Temple period. They're primarily hearing them in the context of the synagogue, and they're asking questions and they're trying to understand these stories and what they mean. And so the sort of elaborations, and they're sort of narrative elaborations, which is what throws us a little as modern people. But these sort of elaborations are essentially a way of doing commentary, of fleshing out the story to sort of interpret and apply it. And so sometimes. And they weren't worried about this, you'll find what are basically anachronisms. Right. So we're talking about a story about Abraham that happened in, you know, circa 2000 BC and the. The added details are clearly stuff from, say, the third or fourth century B.C. which is when. Around the time the text is written. And scholars treat this like, oh, they let slip when this was written. See, they're trying to convince us that Moses wrote this. But look here, they messed up, right? Not at all. That. That was not only. Not a mistake or not a problem, that was kind of deliberate."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":1220.89,"end":1221.37,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":1221.45,"end":1224.81,"speaker":"Fr Stephen De Young","text":"They were taking that story and bringing it into their own time."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":1226.17,"end":1226.57,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":1226.73,"end":1262.66,"speaker":"Fr Stephen De Young","text":"In a way that made it relevant to and spoke to the life they were living, you know, in the. In the Persian and then Greek province of Judea, you know, in a very different situation than Moses was in or Abraham was in. And that. That is. Is sort of learning to make that move is a big part of what's required to apply any. To interpret or apply any of the. The tradition, any of our heritage."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":1263.14,"end":1263.54,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":1263.7,"end":1270.42,"speaker":"Fr Stephen De Young","text":"As Orthodox Christians, whether it's the Scriptures or the fathers or the. The councils or the hymns or the. Right."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":1271.14,"end":1414.59,"speaker":"Jonathan Pageau","text":"And people, it's. It's. It's important for people to understand because it might seem harder to see at the outset, you know, that we actually, in the orthodox tradition, we have several examples of that that come way after the Book of Jubilees. Right. The book of Jubilees is something that was written before. Before Christianity appeared on the scene. But we have versions of that, and I've appointed to them often in terms of iconography, which is what I know the best. You know, a good example is, of course, the inclusion of St. Paul in the Ascension or the inclusion of St. Paul at Pentecost. These, The. Everybody knows that in the Bible, St. Paul is not there at the Ascension and is not there at Pentecost. But this is a narrative detail or an imagistic detail which is included in the tradition in order to help you understand something that has theological significance, which is that this is not just an event that happened at this time. This is the Church. Right. This is an image of the relationship between the Church and Christ or the relationship between the Holy Spirit and the development of the Church. That's a little example. But in iconography, there are plenty of examples. If you see, for example, Christ standing on doors when he is in being baptized with snakes coming from under the doors, you think where the. What is happening in that image? But you realize this is a liturgical prayer from the, the blessing of the waters that is brought into the image of the, of the, of the baptism of Christ in order to help you understand what is happening when Christ is being baptized. You know, how Christ's baptism is in some way the sanctification of all of creation and the sanctific of all the water. So these are a few examples of what? Of, of orthodox examples. These are the ones that I know the best because they're from iconography. But there are many, many examples of extra biblical traditions that are narrative or imagistic details added to the, the story in order to make. To help us participate better and understand better what is going on in the original story. So I don't know if there are some examples that, you know in the. Because I'm more, I'm more imagistic. But there are, I know in the liturgical prayers and, and things like that. There are plenty of versions of that."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":1415.23,"end":1431.89,"speaker":"Fr Stephen De Young","text":"Oh, yeah, yeah. Well, and, and even so, the, the St. Paul, his inclusion. And in the Synaxis of the Twelve Apostles, St. Paul is there. Yeah. That's very important for how we interpret the book of Acts, for example."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":1431.89,"end":1432.37,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":1432.53,"end":1473.57,"speaker":"Fr Stephen De Young","text":"Because there's this whole episode at the beginning, remember, where St. Peter kind of steps up and they cast lots and they choose St. Matthias, who this discussion is in no way demeaning. He is an apostle of the 70. Right. He's a saint. But the text, what possible way of reading Acts is that? That was actually an incorrect move. Ah, interesting that it was actually St. Paul who Christ chose to replace Judas among the 12. So somebody proposes that, they say, well, wait, but it doesn't explicitly say that in Acts."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":1474.37,"end":1474.73,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":1474.73,"end":1576.01,"speaker":"Fr Stephen De Young","text":"Just tells this story. But then you look at the icon of the synaxis of the twelve apostles, you look at who the twelve apostles are on an iconostasis, you look at Pentecost, where St Matthias was and St Paul wasn't, and St Matthias is not in the icon and on and on. All of a sudden, you see. Well, that interpretation is sort of encoded, is borne out here. That interpretation of the Book of Acts is born out here in the iconographic tradition. Right. In other hymnographic traditions. One thing I noticed this year at Pentecost, in our liturgical tradition, that I never noticed before, which amazed me and which I've never seen referenced in any of the mostly bad discussions about this. So obviously there's. Every year we get this raft of. Oh, isn't it horrible that the hymnography of Holy Week blames, quote, unquote, the Jews for being complicit in the death of Christ. Right. For handing Jesus over to the Romans to be crucified. And I only noticed this year, and I don't know why I never noticed this before, but in the liturgics of Pentecost, it explicitly says that when the Holy Spirit came upon Jerusalem, the Holy Spirit purified the Jewish people at Jerusalem above the sin of having been complicit in the death of Jesus."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":1576.89,"end":1577.29,"speaker":"Jonathan Pageau","text":"Really?"}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":1577.69,"end":1583.93,"speaker":"Fr Stephen De Young","text":"Yes. So blood libel lasted 50 days, according to our liturgical tradition."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":1586.41,"end":1588.57,"speaker":"Jonathan Pageau","text":"I. I guess I never noticed that. I mean."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":1588.97,"end":1613.7,"speaker":"Fr Stephen De Young","text":"And then was forgiven again. That's not. There's not sort of this statement, Right. The statement made in Holy Week, you know, about the Jews or. Well, we're just talking about the people in Jerusalem and just at that time, there's none of that is, like, spelled out. Right. But neither is it all sort of spelled out that way on Pentecost. Right?"}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":1613.7,"end":1614.5,"speaker":"Jonathan Pageau","text":"Yeah, of course."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":1614.9,"end":1672.02,"speaker":"Fr Stephen De Young","text":"It's just poetically described. The Holy Spirit comes and purifies the people of the blood of Christ. Yeah, right. And so, yeah, I've never heard that brought up. Right. I'm, of course, going to start bringing it up when people bring up the Holy Week thing. Right. So, like, is this one finite group of people for 50 days who had this. You know, but obviously that's very. That that's one hymn in the Pentecost hymns. But that's pretty transformational if we pay attention to it. Right. Of how we understand that earlier hypnography, which. And that earlier hypnography is part of how we understand the biblical stories, Right. Of. Of Christ's death, suffering. And. And so there's sort of a chain reaction. Right."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":1672.02,"end":1672.38,"speaker":"Jonathan Pageau","text":"But."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":1672.38,"end":1679.72,"speaker":"Fr Stephen De Young","text":"But the liturgics are interpreting that and preserving this interpretation, this way of. This way of reading."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":1680.04,"end":1680.72,"speaker":"Jonathan Pageau","text":"Yeah, yeah."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":1680.72,"end":1704.08,"speaker":"Fr Stephen De Young","text":"Right. Which is. Which is why I don't, like, sometimes when people Talk about tradition. And they talk about. It's like oral tradition. Like it's. Oh, there's all this secret stuff that just like when they make you a bishop, they take you into a back room and they tell you all the, you know, all the stuff, right. That we don't write down, that we don't tell anyone. Right. Like it's, it's this oral content, you know."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":1704.08,"end":1706.76,"speaker":"Jonathan Pageau","text":"Right, yeah, it's just content as opposed."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":1706.76,"end":1714.66,"speaker":"Fr Stephen De Young","text":"To just us having received away of reading and interpreting and applying and understanding. Right. These texts."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":1714.98,"end":1795.25,"speaker":"Jonathan Pageau","text":"Yeah, yeah. And in some ways, you know, the example, I mean, to me the example that's the most crying and the most obvious is the. Again, I go to the iconography because that's what I know, but it's the cross at the skull of Adam, you know, at the bottom of the cross. Right. And so this is not mentioned in the Bible. But you know, the tradition from which it's taken helps you understand everything about what salvation is. It helps you understand what it is that Christ is doing on the cross. It encompasses the descent into Hades in that little, even in that gesture by just having the skull of Christ with the blood of Christ kind of dripping onto the skull. You know, it contains the anastasis in it. There's all of. It's such a deep, deep image. And you know, even for the most kind of biblical, you could say biblical purist, you know, that what's, what's being shown there is the is. Is the best vision of what it is Christ is doing on the cross. Even for someone who wouldn't like the fact that these traditions exist, it's like theologically this is explaining to you what salvation is. And so, you know, the fact that this is also encompassed in the story as like this detail that isn't mentioned in scripture. It's actually there to help you understand what's going on when Christ is dying on that cross."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":1796.43,"end":1839.89,"speaker":"Fr Stephen De Young","text":"And before the iconography, because before Christ's death, right, Those traditions were preserved in some of these Second Temple narrative texts, right. The Greek and Aramaic lives of Adam and Eve that describe like Adam's repentance after he goes and he sits on this hill, the opposite paradise. And they've placed sort of traditionally they've placed paradise in Jerusalem, where Jerusalem is. Right, right. And so he's on this hill outside Jerusalem, right. Looking back at what he's lost, right. And repenting. And that's where he ends up being buried. Right. And again, this is not sort of a pre Christian. He was literally buried there."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":1840.21,"end":1849.13,"speaker":"Jonathan Pageau","text":"Wait, so what okay, so this is. I did. I didn't know that this was actually there. What? When. Which actually, this is the. In the. The life of Adam and Eve, the Greek."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":1849.13,"end":1859.3,"speaker":"Fr Stephen De Young","text":"There's a Greek life of Adam and Eve and an Aramaic life of Adam and Eve. Eve that talk about this. Yeah. Goes. And rep. He stands. He stands the Jordan river for 40 days."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":1859.46,"end":1860.18,"speaker":"Jonathan Pageau","text":"Uhhuh."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":1860.26,"end":1877.14,"speaker":"Fr Stephen De Young","text":"As part of his repentance. Because they've placed paradise where Jerusalem is. Right. He's looking at what he lost. And you can see the connection there because this is being written by people who have kind of. But not really fully returned from exile."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":1877.38,"end":1878.1,"speaker":"Jonathan Pageau","text":"Right. Yeah."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":1879.02,"end":1886.46,"speaker":"Fr Stephen De Young","text":"Right. And so Jerusalem represents what they lost for their sin. Right. And so they're connecting that experience. So they place Jerusalem there."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":1886.7,"end":1894.62,"speaker":"Jonathan Pageau","text":"Yeah, yeah. That was in Jerusalem that some of the. The people there explained that. That this was part of the tradition, that it was where the Garden of Eden was."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":1894.7,"end":1910.87,"speaker":"Fr Stephen De Young","text":"Yeah. And then this hill outside is. Is where Adam ends up dying and being buried because it's as close as he can get. Right, Right. And that's why it becomes known as the place of the skull. It was his skull. That's right."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":1910.87,"end":1923.35,"speaker":"Jonathan Pageau","text":"But. Oh, yeah, you're blowing my mind now because I thought. I mean, I thought it was called the place of the skull and that there was this. This kind of tradition that came later, that this is where Adam was buried. But I didn't know that it was a pre Christian."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":1923.35,"end":1938.52,"speaker":"Fr Stephen De Young","text":"No, that's a pre Christian. That's why it was called the Hill of a Skull. Yeah. And so when they point out that that's where Jesus is dying. Right. That's connecting it to all those traditions. That's bringing to mind all of those traditions. Oh, that's wild in the narrative."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":1938.84,"end":2010.71,"speaker":"Jonathan Pageau","text":"That's amazing. Yeah. And then it also makes you realize that sometimes, like. How can I say this? Like, you could say. I mean, it's powerful how you realize that some of these traditions, you also have to be careful to take them to. To take them to metaphorically, like, they. Sometimes they're actually capturing something. It's hard to know how God reveals himself too. Right. In terms of. Because when you go to Jerusalem, you descend into the chapel. Right. There's a chapel underneath the cross. And there's this. There's this, like, opening there. And that's where they say, like, that's where Adam's skull was. If you look at the opening, it actually has the shape of the opening that you see in especially the earlier icons where they show Christ on the cross with Adam's skull. It has this, it's kind of like. It has this, this kind of shape. And so it's really fascinating to realize that how, like sometimes you think, you know, you, you, you see it more in a mid rash way where it's like, okay, we're just kind of. I think sometimes it is like we're telling this, this detail of the story in a poetic way to help you understand what it is. But then, you know, I guess sometimes it connects a lot, a lot more to the actual way that things happen than we think."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":2010.87,"end":2018.08,"speaker":"Fr Stephen De Young","text":"Well, that, well, and, and that's part of. We've lost the ancient understanding of sacred geography."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":2018.24,"end":2019.04,"speaker":"Jonathan Pageau","text":"Yeah, yeah."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":2019.68,"end":2059.37,"speaker":"Fr Stephen De Young","text":"Where we've turned geography just into this material physical thing. And then sort of spiritual reality is this other thing. But for example, the Acherusian Lake, Lake Atrus you find all over Greek myth, you find in Greek philosophy. So it's, it's the lake that's formed by the river Styx in Hades. And that water, of course, causes you to forget everything, right? In your life. Sort of represents oblivion. Right. Plato sort of repurposes it. Because Plato has this sort of reincarnational view."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":2059.53,"end":2060.05,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":2060.05,"end":2086.34,"speaker":"Fr Stephen De Young","text":"And he thinks that souls pass through the Atrousian Lake and forget their former life before they start a new one. Then this gets repurposed by Christians. So in some early Christian apocryphal writings, they'll talk about people in Hades who are saved through the prayers of the saints, get baptized in the Atrusian Lake."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":2086.98,"end":2087.54,"speaker":"Jonathan Pageau","text":"Huh?"}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":2089.22,"end":2096.4,"speaker":"Fr Stephen De Young","text":"These stories. Right. But here's the thing. You could go on a cruise of Lake Atrus, right?"}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":2096.4,"end":2097.4,"speaker":"Jonathan Pageau","text":"Exactly. Yeah."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":2098.92,"end":2113.96,"speaker":"Fr Stephen De Young","text":"You could go there right now, right? And if you asked an ancient person, you're like, wait, this is the lake? They'd be like, yes. And you'd be like, we're not in Hades. We're alive. How can. Right."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":2114.2,"end":2196.7,"speaker":"Jonathan Pageau","text":"Yeah. And that's, it's so, man, it's so hard for modern people. Like, for me, even me, like I'm the Mr. Symbolism, you know, that breaks my, it just breaks me when I, But I, I know, right? For example, like a simple example of that is that, you know, the, the moon. The moon is a good example, right. So it's like the moon that you see, that's the moon that's described in all the, the, the, the text, right? It's, it's the moon where the, the, the, the, the circle of the moon where above it, you know, all things become kind of unchanging. It is that same moon. But then there, there's also an aspect of it Which. How can I say, there's an aspect of it which you can break away from its meaning and its mythological participation. And then if you don't have the eyes to see, right. It's just a. It's just a rock floating in space that has. It has nothing on it. And I think that's the thing with how. How to find that connection there. You know, we talk about enchantment or enchanted world. There seems like the. The saints or the holy ones, they're able to. To live in that world where, you know, you could imagine the story of a saint where there would be some encounter at that lake which would be mythological in scope. But for me, I go there and I'm like, man, you know, it's like it's just a lake, right?"}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":2196.7,"end":2201.14,"speaker":"Fr Stephen De Young","text":"Well, that's. That's true of sort of everything and everyone."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":2201.3,"end":2202.34,"speaker":"Jonathan Pageau","text":"Right? I agree. I agree."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":2202.34,"end":2244.58,"speaker":"Fr Stephen De Young","text":"But it's still like when I. When I walk down the street, right. Most people don't pay any attention to me, right? Like, there's not. Like, they don't know who I am. They don't know that I've written books. They don't. They don't know who my wife is and how she feels about me or my family and the love. Right. You just encounter. Right. Things in the world. But there are all these elements to the reality of what these things are. And none of that's fake. Right? None of that significance is. All that safety is real, is just as real as the physical materiality of it. It's just not immediately available to us most of the time."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":2245.22,"end":2252.98,"speaker":"Jonathan Pageau","text":"Right? Yeah. And it's not available to people who aren't participating also in the story. It seems something like that they're gonna."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":2252.98,"end":2255.94,"speaker":"Fr Stephen De Young","text":"Look at the Eucharist and see bread floating in wine."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":2256.18,"end":2258.54,"speaker":"Jonathan Pageau","text":"Yeah, yeah, yeah. That's right. That's right. That's right."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":2258.54,"end":2278.86,"speaker":"Fr Stephen De Young","text":"And not see anything more than that. Right. And not experience anything more than that. So this is. I mean, this is part and parcel of the whole world being sacramental. But the saints are. Are attuned to and able to see the significance of people and things in a way that most of the time we have shut off."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":2281.02,"end":2281.42,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":2281.42,"end":2311.23,"speaker":"Fr Stephen De Young","text":"Right. And that's. That's part of. And what that comes down to, ultimately, is love. That's really part of what love means. Right. The difference between the way I encounter most people I encounter and actually loving them. Right. Is seeing who they are and their significance and their importance. Right. And. And their relationship to God and to other people in a way that I usually don't and it's when I come to understand and see and appreciate that, that I could actually be said to be loving them."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":2311.79,"end":2383.14,"speaker":"Jonathan Pageau","text":"Yeah. The, the. The. I think the way that I remember getting to this, in a way that I tried to make as practical as possible was the idea. I call it like my grandmother's cup, right? So it's like, imagine my grandmother gave me this cup, right, that, that before she died and. And it was passed on to her from her. Her ancestors or whatever. And then I have this cup that I use, right? I drink out of it, but I put it in my cupboard and in some ways I'm the one who sees it. I see it, like when I open the cupboard, it. It jumps at me and pops out of me. A stranger would come into my house and couldn't tell the difference between the cups and. But to say that there is no difference is wrong. To say that the salience and the shining aspect of that cup, to say that that doesn't exist is a lie. Because that's how everything exists, right? Everything that I reach out to use in the particular moment is shining to me towards that purpose. But it's just sometimes it's harder sometimes to extend it out and to kind of understand it on a cosmic level or to understand it at a larger level. It's. It's more easy. It's easier to be cynical about that."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":2383.86,"end":2416.76,"speaker":"Fr Stephen De Young","text":"Yeah. Well, I think. I think in our modern age, we've played this trick on ourselves. And this is. I mean, this is something I said way back when we were first starting to do Lord of Spirits. We made a trade. We traded that. We traded that sort of spiritual wisdom and way of viewing the world for a much greater scientific understanding of the material world."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":2416.84,"end":2417.8,"speaker":"Jonathan Pageau","text":"Yeah. For power."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":2418.12,"end":2439.49,"speaker":"Fr Stephen De Young","text":"And we did get that. We do have a much better understand. Right. We have microwaves. It does work. It is true. Not that science is bogus. It's real. It works. Right. We're talking on the Internet right now. Yeah. But we gave up this other thing."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":2439.73,"end":2440.61,"speaker":"Jonathan Pageau","text":"Yeah, yeah."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":2440.93,"end":2455.01,"speaker":"Fr Stephen De Young","text":"And having made that trade makes that other thing hard to recover. Having seen the moon landing makes it harder to look at the moon and see the moon the way ancient people saw it."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":2455.09,"end":2455.57,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":2455.86,"end":2457.54,"speaker":"Fr Stephen De Young","text":"That's why people deny the moon landing."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":2458.02,"end":2494.43,"speaker":"Jonathan Pageau","text":"Right. No, I totally agree that that's also part of. In some ways, why now? There's a awkward. There's an awkward resistance that's happening kind of in narrative form. Like I've talked about how the flat earth stuff is part of that too. When some ways there is an intuitive Return to the narrative part of, of reality. But it's, it's kind of, it's still mixed with the scientific meaning of the scientific understanding. And so it's kind of confused, but it is pointing in some ways to people's desire to recapture the, the mythological landscape or the sacred landscape once again."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":2494.75,"end":2506.35,"speaker":"Fr Stephen De Young","text":"Right, yeah. Young Earth creationism, same thing. Now you'll get the comments, but. Right, but so young earth creationists like Ken Ham, I'm talking about like that, that."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":2506.35,"end":2507.55,"speaker":"Jonathan Pageau","text":"Yeah, yeah, that, that level."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":2507.55,"end":2535.66,"speaker":"Fr Stephen De Young","text":"Not just someone who thinks the Earth isn't that old. That's not what I'm talking about. I'm talking about like someone like Ken Ham. Their response to, well, science has proven that this Genesis story is nonsense is not to say, well, no, you're reading it wrong and here's what it's really saying and here's the real significance. It's to say, no, it doesn't. Science proves it's true. Which is."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":2535.66,"end":2543.81,"speaker":"Jonathan Pageau","text":"And also it is a scientific text. It's literally describing scientific categories, which is such a diminishment of that text. My goodness."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":2544.2,"end":2567.56,"speaker":"Fr Stephen De Young","text":"Right, and so you don't recapture that ancient wisdom. Right. You're just doing it now, a deformed, incorrect version of science. Right. So you're losing the good parts of science and not gaining the other. So it's sort of the worst of all possible worlds, right? To be caught in that."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":2568.04,"end":2607,"speaker":"Jonathan Pageau","text":"Yeah, yeah, yeah, yeah, yeah, that's right. And so I don't know why I'm tempted to ask you because I never heard you talk about this, but, like, this is. I think, I think, I think I never hear you talk about this. But what, what do you think this is? Because I think this is all related. I think that what's going on with the UFO thing is based. Is related to this. Like, there is in some ways a. There's a kind of sacred landscape or a weirdly distorted version of sacred landscape that is pushing itself back into our perception and it's being, it's being interpreted or it's being kind of assimilated in all kinds of strange. In strange ways that are still kind of hybrid scientific and all this stuff, right?"}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":2607,"end":2744.75,"speaker":"Fr Stephen De Young","text":"Yeah. And. Well, and I think that that's going on with the use of psychedelics, right? They're not going back to the pagan use of psychedelics, right, to have divine visions. Right. They're trying, trying to interpret those experiences scientifically. Right. And yeah, I mean, I think I've heard atheists say, right, like, well, aliens putting life here. That would be believable because that could be explained scientifically like so Prometheus. Sure. But like God, that's ridiculous, right? Yeah, it's a way of quasi scientizing spiritual experiences. And that's why you get a lot of the UFO stuff is on this fringy New age spirituality. Right. It's, it's trying to, to acknowledge the validity of those sorts of experiences without deviating from the, the realm of science. Yeah. I think conspiracy theories ultimately come from the same thing. Right. Now, obviously people conspire, like groups of people get together and decide to do things and keep it a secret. Right. Like that happens. So I'm not saying like all conspiracy theories are false, but in a lot of cases, people encounter evil in the world that is clearly beyond just. Oh, a group of humans all made the same bad choice at the same time. Right. It's clearly. And evil at a level higher than the human. But if you don't have any spiritual sense of evil, if you think the idea of a demon is ridiculous and silly, then what do you have? Well, this must be, you know, some larger, you know, there's people getting together in Europe and, you know, or the Bilderbergs or whoever. Right. And they're, they're all doing this behind the scenes and. Right. Rather than just saying, well, no, there, there are demons influencing people. Right. And influencing masses of people to do terrible things, you know."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":2744.83,"end":2835.53,"speaker":"Jonathan Pageau","text":"Yeah. And I mean, obviously like you said, there, there, there can be, there can be a mix of both to some extent. But in some ways, especially to understand some world events and some of some things that are going on, the only really way to truly understand it is to understand that there are kind of higher than human intelligence that are acting on us because that, that especially because of how, interestingly, how coherent some of the mythological images that are appearing through these, through these, these stories. So if you look at, you know, some of the ufo, that's why, I mean, one of the reasons why it's been important to talk about the Book of Enoch is because how a lot of the UFO phenomena connects with some of the images and some of the ways that the Book of Enoch talks about, technology talks about. I heard Jane Pasulka recently with, with Douthat, you know, the New York Times guy, Catholic guy where she was, he asked him, what, what are the UFOs, what are they? And she said, well, they're probably a bunch of things because on the one hand, there's this spiritual aspect of encountering these, these beings that don't seem to be totally human and Then on the other hand, there's this technology which seems to be real and seems to be very powerful. And I was thinking, don't you know that there's a connection between those two? And that connection is a very old one. Like, there's always been this old connection that in some ways technological progress has always, not always, but has often been seen as related to some kind of spiritual influence on the world."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":2836.41,"end":2887.44,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. And that pattern that humanity gets, knowledge, technological knowledge, before we're ready for it, the first use we always put it to is evil because we lack the spiritual wisdom to use it correctly. It's just borne out. And the, the example I give is, you know, the US splits the atom. Right. Hey, carbon neutral power, endless supply of electricity for everyone. Right. Like, this would be great, but no, not only do we turn it into a weapon, but we drop that weapon on a city that kills the numerical majority of the Christians in Japan. Yeah, we drop it on the most Christian city in Japan. There's something going on there. Right."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":2887.6,"end":2889.28,"speaker":"Jonathan Pageau","text":"There's something else going on there."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":2889.6,"end":2931.31,"speaker":"Fr Stephen De Young","text":"It's not just a question of. Right. You'll get the folks who are like, well, though they dropped it there because there weren't any prison camps with US soldiers near there. It's like, yeah, that's because that's where the Christians were. The Japanese imperial government didn't trust the Christians. So. But, yeah, so that's just a very modern example. Right. When we get technology, we instantly do the wrong thing with it. And it's worse today because the ancient past, there was a possibility eventually we'd develop some spiritual wisdom. And now, as we were just talking about, that's much more difficult for us to do."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":2932.19,"end":2958.21,"speaker":"Jonathan Pageau","text":"Yeah, yeah. And so maybe to kind of close this off, give us a sense, maybe help people understand why. For example, reading the book of Jubilees, you know, looking at these old texts, looking at these old extra biblical traditions, what is it that they can offer us as modern people? Like, how can they help us regain this, this more wisdom, focused vision of the world?"}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":2958.53,"end":3039.83,"speaker":"Fr Stephen De Young","text":"Yeah, well, as. As we've been talking about at one level, sort of methodologically studying Jubilees, if you take this class, for example, one of the goals is, we're going to help you learn how to read this kind of text, learn how to read and interpret and apply this kind of text, how these kind of texts are structured, how they work, how they teach us theology, that kind of thing, which will then equip you for other texts. Right. To do the same thing. And Jubilees in particular, has a lot to say about the patterns of life on earth. It's called the Book of Jubilees because it's structured around the Jewish calendar, so the sacred calendar, so understandings of how time is made, sacred understandings of, you know, why is the calendar important at all? You know, why are Orthodox people still fighting about the calendar today? Isn't that just, you know, whatever issues of the Nephilim, issues of how evil manifests itself in the world and why and how that relates to God, a big part of what's going on with the Nephilim, with the giants and Jubilees, is actually a kind of theodicy."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":3039.99,"end":3040.47,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":3040.63,"end":3083.55,"speaker":"Fr Stephen De Young","text":"A kind of ancient theodicy of. Of why does God allow these spirits to operate in the world? There are a number of particular things in the Book of Jubilees that make it particularly relevant, particularly interesting. But I'm hoping that on the whole, it'll also give some tools to people like we've been talking about that'll help them read other parts of the tradition, the liturgical tradition, other kinds of texts like these, and get the value out of them and greater understanding to try to recapture, actually recapture some of that spiritual wisdom rather than just going into science denial and constructing our own pseudoscience right off to the side."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":3084.84,"end":3157.85,"speaker":"Jonathan Pageau","text":"Yeah, yeah, yeah. And so, everybody, I am looking forward myself. I am going to take this class, and then on the last class, Father Stephen and I are going to have a discussion about. About the things that he taught. And so I will be following very carefully, and I'll be following the class. I can't wait to see, because I've read Jubilee. I read it a long time ago. I read Jubilees, like, 20 years ago. And so I am excited to go back into that text and to also see how it's. How it's relevant, especially, like you said, in terms of everything that's going on. You know, when St. Peter says, as in the time of Noah, it feels like, you know, we are. A lot of things happening in our society today are as in the time of Noah. And so it is. It is incumbent on us to understand what that means when St. Peter says that, what it is that he's talking about and how. How it's applicable to our world today. So, Father Stephen, thanks for everything you do. You know, I always feel like we're partners in. In. In. In interesting ways where we kind of. On these. These parallel tracks where things. Where you're doing all these things, I'm doing all these things, and I can see how they cross over, and sometimes I'M always. I'm like, like, like the thing you told me about Golgotha. I'm like, wow, I need to listen to your podcast more because that's amazing."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":3159.69,"end":3161.63,"speaker":"Fr Stephen De Young","text":"Well, thank God. Thank you, Jonathan."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":3162.1,"end":3183.14,"speaker":"Jonathan Pageau","text":"All right everyone, so sign up for the class and I'll see you there during the class. Thanks, Father. If you enjoy these videos and podcasts, please go to the symbolicworld.com website and see how you can support what we're doing. There are multiple subscriber tiers with perks. There are apparel and books to purchase. So go to thesymbolicworld.com and thank you for your support."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":3184.1,"end":3246.59,"speaker":"Laura Diaz","text":"Tucson the Wait is over Mediweight Loss they're officially open on North Oracle Road. That's right, no more counting down the days. You can walk in right now and start your journey to a healthier you. Hey, it's Laura Diaz from iheartradio and you can trust me. This isn't just another weight loss clinic. I know that because it's where I lost weight safely with real medical support. GLP1 medications. You can see them everywhere online right now. But the truth is, your health shouldn't be a DIY project. Ordering these meds without the professional guidance. It can lead to dangerous mistakes, wrong doses, no oversight, and serious work risks. At MediaWeightLoss, I got the same medication, but with a customized plan, weekly check ins, and a licensed physician guiding me every step of the way. And the cost? The same as those risky online options. Tucson, your moment is here. If you're ready to take control, feel better, and lose weight the right way, mediweightloss is ready for you. Walk in, get started and see real results. Call or visit mediweightloss.com to learn more and book your free consultation today. That's mediweightloss.com pack up though."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":3247.31,"end":3249.37,"speaker":"Jonathan Pageau","text":"Because Chevy SUV SUVs have the capability."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":3249.37,"end":3252.97,"speaker":"Fr Stephen De Young","text":"To take you to some incredible places like an adventure in the middle of."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":3253.61,"end":3257.37,"speaker":"Jonathan Pageau","text":"In the Equinox Active, an SUV that will help you get away with confidence."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":3257.61,"end":3270.61,"speaker":"Fr Stephen De Young","text":"Or head off for a night in the in Chevy Traverse with all the tech you need to stay connected. While the undeniable value of Chevy Trax will keep you moving from here to over here to way over here. Get to all the places you want."}
{"episode_id":"SW - #404 - 2025-08-19 - Fr. Stephen De Young - How to Read Extra-Biblical Texts Like Jubilees (and Why It Matters)","start":3270.61,"end":3275.05,"speaker":"Jonathan Pageau","text":"To be with Chevy SUVs. See Watson or O'Reilly Chevrolet."}
