{"episode_id":"SW - #382 - 2025-03-15 - The Resurrection of Logos (Reupload)","start":0.16,"end":62.05,"speaker":"Laura Diaz","text":"Tucson, the weight is over Mediweight loss. They're officially open on North Oracle Road. That's right. No more counting down the days. You can walk in right now and start your journey to a healthier you. Hey, it's Laura Diaz from iheartradio and you can trust me. This isn't just another weight loss clinic. I know that because it's where I lost weight safely with real medical support. GLP1 medications. You can see them everywhere online right now. But the truth is your health shouldn't be a DIY project ordering these meds without the professional guidance. It can lead to dangerous mistakes, wrong doses, no oversight, and serious risks at mediweight loss. I got the same medication but with a customized plan, weekly check ins, and a licensed physician guiding me every step of the way. And the cost the same as those risky online options. Tucson, your moment is here. If you're ready to take control, feel better and lose weight the right way, mediweight loss is ready for you. Walk in, get started and see real results. Call or visit mediweightloss.com to learn more and book your free consultation today. That's mediweightloss.com hello everyone."}
{"episode_id":"SW - #382 - 2025-03-15 - The Resurrection of Logos (Reupload)","start":63.57,"end":251.73,"speaker":"Jonathan Pageau","text":"There's a lot of stuff going on in the world and I realized that I have been making videos since 2016 and a lot of things have changed since then. We are in this moment when all, all of a sudden the churches are exploding. They don't know what to do. They have to build new churches. It's happening at least. And I know in the Orthodox church all over America, there's a transformation in culture that has effectively happened. And we can see it through all these signs. I saw it at the new ARC conference where people were not afraid at all to speak about their faith, about the importance of God as being the very root of our being and as the root of our civilization. The transformation is crazy. And I was going back into my videos and I noticed the very first talk that I gave with Jordan Peterson back in 2016 at the University of Toronto. And it was called the Resurrection of Logos. And in that talk I intimated the seed that was being planted. And I kind of could see that all of this was taking place back at, at the time in the hardest moment when it looked like everything was nearing collapse in terms of culture, where we were being completely overwhelmed by the monsters of ideology. And so I gave this talk trying to kind of help people see. And you have to think, I'm going to put this talk up now. And you have to remember that People had no idea about all the things that many of us are already now taking for granted, trying to help people understand the transformation in culture that we were seeing beginning at the time, and also warning people of the dangers. And now we can see that both the opportunities and the dangers have grown. And we are standing in a position right now where the danger of, you could call it too strong an identity or the danger of a kind of weaponized Christianity is really in front of us. But also there are true beautiful opportunities that have opened up and we need to be able to kind of engage with them in joy and in gratefulness. But I thought it would be interesting for you to go back and see this talk, which didn't get many views at the time, but is in some ways like a little moment of what was happening back in the day. And you can look at it now in retrospect and see what has actually happened. The funniest thing about it was I mentioned how Christian symbolism, usually when they, they're kind of weird people that do Christian symbolism talk about aliens and I kind of mock that. And now here we are in this world where all of a sudden talking about aliens has great symbolic import. But nonetheless, please enjoy this conversation. I know it was a lot of fun for me to watch it again, so thanks. Everyone. This is Jonathan Pedro."}
{"episode_id":"SW - #382 - 2025-03-15 - The Resurrection of Logos (Reupload)","start":252.21,"end":253.97,"speaker":"Jonathan Pageau","text":"Welcome to the symbolic world."}
{"episode_id":"SW - #382 - 2025-03-15 - The Resurrection of Logos (Reupload)","start":264.93,"end":302.15,"speaker":"Richard Rohlin","text":"Hello friends. This is Richard Roland and I am inviting you to join me for my new Symbolic World course, Tolkien and Universal History. In this course we're going to go over the deep mythological and universal history roots of Tolkien's legendarium and see how Tolkien sort of shows us a blueprint for reclaiming a legendary mythical Christian framework for storytelling. And in fact, we're going to even do some storytelling of our own. This is a five week course. It starts on March 3rd. We had to postpone it a week, which means there's a little more time for you to sign up and I hope to see you there."}
{"episode_id":"SW - #382 - 2025-03-15 - The Resurrection of Logos (Reupload)","start":304.39,"end":611.72,"speaker":"Jonathan Pageau","text":"Father Ted Thanks. I appreciate being here. I appreciate being in Toronto. It's a great town. Today I spent the day going to the museum and visiting, so I really enjoying the city. I'm going to start with a story. It's March 2015 and I'm driving. I'm going to pick up my children at some friend's house on a Friday night. And it's about half an hour drive, so I'm settling in and I'm listening to the CBC like I usually do. But that particular evening the content is not usually what you get on the cbc. So on the air is this University of Toronto professor. And what he's saying rings a bit off from what I usually hear on that show. At first, he's talking about religion and religious symbolism, and he's doing it in a way, let's say he's doing it without the usual smugness that we tend to hear when people talk about religion, especially about Christianity. And so here he is talking about Christianity, but I can tell he's not a priest or he's not a preacher. He's a psychologist, He's a scientist. And so as the talk unfolds, my. Let's say my attention heightens. And after a few minutes, just a few minutes, I just. I can't believe what I'm hearing as this Prof. Is going through stories of Adam and Eve, Cain and Abel, jumping to Shakespeare and Milton and Goethe, and then to Darwin and Nietzsche and Jung. And immediately I see what he's doing. He isn't just trying to communicate information. He's dancing across this wide variety of references. Because what he wants to do is he wants to bring out, he wants to trace this underlying pattern. And by doing so, he's trying to awaken something in his listeners. He's not just trying to get them to understand, which is what we usually hear when we listen to talks. No, he's trying to provoke, trying to shake people into experiencing how the world is built with meaning. So he talks about logos, which is truth, meaning expressed in word, this search for purpose. And logos transforms chaos and potentiality into being. And in opposition to this, lies, deceit, resentment, gradually dismantle the world and plunge it into. Into ever growing chaos. I mean, of course, he's taking this from the Bible, the Book of Genesis, from The Gospel of St. John, sprinkled with some phenomenology. But he's very clearly describing this process at all levels of reality, at the individual, the interpersonal, the social, political levels. And this interaction between logos and chaos is the main manner, we could say, by which the world is constantly sustained. So by this point, I am literally cheering in the car. I'm like. I'm hitting my steering wheel, and all I can think is, who is this? Who is this person talking? And why have I not heard of him before? Like, why is he not famous? I guess we don't ask that question anymore, right? And especially I'm like, how does he know this? You see? Like, so the attempt to help people see experience, patterns of meaning and religious symbolism, how it connects to all levels of reality, that's what I've been trying to do for years. That's been my goal in life. I would say in my carvings, in my articles, in my talks. And I would say there's only a handful of people that I know that I can relate to at that level. And it's not that people don't talk about religious symbolism. Actually, a lot of people do. But usually when you hear people talk about religious symbolism, at some point, you can kind of picture them in like a tin foil hat. And then, you know, soon extraterrestrials become part of the discussion. But not this guy. He's just as clear as can be. So when I get home, so I reach out to him and I send him just a little message, you know, just thanking him and expressing my surprise and linking him to a few articles I'd written, a few talks I'd given. You know, that was it. I didn't expect. I didn't really expect an answer. But then the next morning, I get a message thanking me for my message and pointing me to a few lectures that he had given more specifically on religion. I thought, that's pretty cool. Like, that's. That's nice, you know, this random Quebecer sending messages to him. But then about an hour and a half later, I get this call."}
{"episode_id":"SW - #382 - 2025-03-15 - The Resurrection of Logos (Reupload)","start":613.56,"end":613.96,"speaker":"Jonathan Pageau","text":"And."}
{"episode_id":"SW - #382 - 2025-03-15 - The Resurrection of Logos (Reupload)","start":614.92,"end":2180.36,"speaker":"Jonathan Pageau","text":"I can't do the Kermit voice. So anyways, my memories of that moment are kind of vague, but I think I probably acted like a 14 year old meeting Kanye west or something. And now his tone is one of surprise, maybe a bit of confusion. And his basic question, and he's been asking me this question ever since, is, how do you know this? Because he'd listened to my talk and he saw the relationship between what I was saying and what he was saying. In the talk, I had been talking about how logos organizes potential into experience, being. And so why am I telling you this? I mean, first of all, I'm telling this as an excuse because despite what Father Ted said, here's this carver who's standing amongst theologians and professors. So the reason why I'm here is because since then, Professor Peterson and I have developed this relationship. Some of you might have seen the interviews that we did together. But mostly I'm telling you this because I know. I know that it mirrors the story of so many people that are probably here in this room. And a lot of the people that might hear this on YouTube or in the podcast, I know that it mirrors. I know because dozens of people have told me of that experience. You know, I have this image. I don't know if people have seen it of Joe Rogan hearing Dr. Peterson talk for the first time and his jaw dropping, you know, and all of a sudden he sees religion in a completely different way. And I've even received dozens of messages from, I would call them in process, atheists who say, you know, my questions and my thinking have been tilted slightly in unexpected way. And that experience, I think, has been strongest for orthodox Christians like myself. In fact, I stopped counting the number of messages I received from priests asking me, so is Dr. Pearson orthodox or what? And to which I usually answer, no, he just likes Dostoevsky a lot. And there is even one clergyman who answered to that said, oh, yeah, he's Orthodox. He just doesn't know it yet. But this correlation has been persistent. So what is this connection? What made the connection between a traditional Christian like myself and Dr. Peterson so obvious, so immediate? And all of this, I believe, resolved around the notion of Logos. The language of Logos is the underlying language of Christianity. Of course, we know the first vision of Logos in Christianity comes from the Gospel of St. John. In the beginning was the Logos. The Logos was with God, and the Logos was God. He was in the beginning with God, and through him, all things were made. Without him, nothing was made that has been made. In him was life, and that life was the light of all mankind. That light shines in the darkness, and the darkness has not overcome it. And this vision of Logos would be continued and developed in the life of the Church, and especially in the seventh century. There was a saint. His name is Saint Maximus the Confessor. And he really brought this image of Logos, I would say, to its most detailed or most elaborate vision. And he did so by taking the notion of Logos that was in the New Testament, and he brought and united it with the best of what the Western tradition had already offered. He was able to prune, let's say, what had come from philosophy and join it with what the Christian message was so that it would attain some clarity and maybe some detail. And so Saint Maximus explains that all things have a Logos, which is its reason for existing, its purpose, and its origin all at once, and even its end. So it's all those things at once. And on top of that, each thing has a multitude of logi. That's a word you've probably never heard before. Logi is the plural of Logos. And so the logi, they're like the different qualities of things. So the blueness of the blue or the slowness of the slow, and all of these logis are brought together. They're woven together we could say, to sustain the existence of the world. It's really a map of meaning, to use Georgia's words. Now, these logi, these essences, let's say, of things, they don't exist independently in the same way that scientists believe things exist out there. Rather, they exist as they come together, as they are joined together in our encounter with the world in a pattern, we could say. So we could say, for example, that a sunset has a certain amount of logi, maybe even indefinite amount of characteristics of a sunset. But as they come together to be the experience of the sunset, that's how we experience reality. That's how we become into contact with reality. So all these qualities, let's say light, color, vertical, horizontal, and the things, the sun, the sky, the earth, all of these things. And I could go on, there's an indefinite amount of them. What's important in making that experience real is how all those logis are united. So. And in a way, they're united within us. And human beings, for St. Maximus, are seen as this laboratory where the whole world finds its cohesion. And he expresses it in the sense that the human being is a microcosm, you could say a condensation of the cosmos, the place where the cosmos comes together to make sense. And a good way to see it is that human beings actually participate, being in the image of God, they participate in creation. We see that in the book of Genesis. In the book of Genesis, God tells Adam to name the animals. And so by his Logos participating in a limited way, in the same manner that the divine Logos was the source of everything. And the human participation in this process is not a relativistic thing. It's not an individual thing. I mean, though it is flexible, it's nonetheless the most objective of processes, as Father Ted mentioned. And so we need to be cautious, though, because St. Maximus warns us that it's not just a philosophy or it's not just a technical description of the world. This is important because thinking that religious stories are exactly the same kind of encyclopedic knowledge of modern science is the wrong way to go with this. These logos, these truth about things, are categories of our engagement with the world. So maybe today we might call them phenomenological categories. And so the discovery of truth, of Logos is a personal journey. It's simultaneously a refinement of our understanding of the world, but at the same time, it becomes a refinement of our person. So to discover the true nature of things is to walk on a path of truth. So food is a Wonderful thing, and it's useful for life. But gluttony leads to our destruction. Wealth is useful to accomplish important things, but avarice rots the soul. So you see, it's not just a description of the world, it's a path that we walk as we discover the world. And so sin in this vision of the world, that horrible world, that horrible word that no one wants to hear. Sin isn't just the breaking of arbitrary rules, but it's in the misuse of the world. And that misuse of the world ends up being an untruth, ends up being a lie or something that's false, something that separates things from each other. It's found when things are not aligned with their purposes. So, for example, a person is not only a tool for my own gratification, a person is not just a tool so that I can advance myself in the world. And if I treat a person exclusively like that, then I will inevitably sin against that person. I mean, of course it doesn't mean that a person cannot act as a tool for my gratification. If I go see the baker and I get bread from him, he's the method by which I get my bread. But the baker is not just a baker, he. He is a full person, just as myself. So when we steal, or we lie or we cheat, it's because we're not considering the person facing us to be a full blown person, to be what they are according to their logos. But we see them only as limited things, only as tools. So this is true of people, of things and of actions. So I was thinking about. I was trying to think about the best example that I could think of to show this in terms of action. And I thought of giving the example of sex. So we did the metaphysics of Pepe. So I think we can get away with the metaphysics of sex, I hope. But it's a question that desperately needs to be answered today in our topsy turvy times, let's say. So what is the logos of sexuality? Well, it has many logi, many purposes. It's for the propagation of the species. I hope at least a few of you still think that, despite what many people would want us to believe, creates families and communities. It brings two people together in a type of communion, in an expression of love, and it brings pleasure. So those will be. Would be some of the logi. I'm sure we could find more, but those would be some of the logi that sex exists. And there could be more. But the idea in the vision of logos Is that all those things need to be brought together in a pattern of some sort for them to be a path towards Logos. So if we think of the different logi and we bring them together, trying to think of the word, what is that word? When all those things are together, I think we have a word. It's the sacrament of the Church. I'll let you figure it out, what it is when all those things come together. And so each of the separate purposes of sex that I mentioned, they're not wrong, they're fine, but they become alive when we bring them together. If we don't, then each separate purpose appears as a kind of falsehood. It appears as a kind of lacking. But that's not enough, let's say, for a truly traditional or a truly complete vision of sexuality. It cannot end there. It has to move towards the infinite. It has to move towards God. And so the ultimate Logos of sexuality is to be an image of the mystical union with God. I mean, it's to be an image of our union with that, with what is beyond us. I mean, in that image of the mystical union of God with the soul of Christ, with his church, the marriage of heaven and earth is a completely traditional image that we find in the Church fathers or in our tradition. And so that image of the ultimate union, the highest union with the infinite, then it comes back down into the multiple logi, all those other reasons for sexuality that I mentioned. And it fills them, it makes them participate in a transcendent purpose and becomes the very relationship that binds them together. And everything in our life can follow that process. Work, food, sleep, beauty. And to engage the world in that frame is to find light everywhere, to see life everywhere. The world is no longer made of the dead, lifeless dirt, the dead, lifeless material that we use to make things with. And as we become better as people, more truthful, more grateful, more free, as we come closer to one another in love. And by the way, that's what love is. Love is the manner in which all different things, all different people, all different intentions can join together and exist communion and can become one, while at the same time preserving the multiplicity. So as we follow this path, the hidden logi in creation, they shine through the world. And today we might say that they re enchant the world. And the world appears bright and full and not the deep gray and dead shadows we often live in. So that would be, I hope, a summary, let's say, of that path of Logos. But I haven't really explained what the source of my excitement was on that Friday night. Yet what the source of the excitement was that has caused all this flurry of attention to Jordan. And I can tell you I've been thinking about this now for months now. I mean, some of us and Jordan has been thinking about this for months now. And I think by now we can say that it's really not about gender pronouns. It's not. It's about something that is a lot bigger than that. And I think I can say confidently by now that it's about logos. The entire project of postmodernism, the last 30, 40 years of higher culture and higher education, has been a systematic assault on logos, to decenter logos, to deconstruct narratives and value hierarchies. So we are left slipping and sliding without purpose and direction. And now we've reached the end of what postmodernism has to offer. We can actually say that we've come to a point where postmodernism has won basically the cultural debate and a philosophy which decries the center and certainty has perniciously become the very center and unquestionable authority it despises. So everything is upside down, everything is inside out, everything is becoming its opposite. And all these inversions and chaos are not to be taken lightly. It has brought about a sterile age, literally sterile, as people are not having enough children to fill the society. I keep thinking that maybe they're missing a bit of foul senses. But it's also sterile in that it has brought about this narcissistic and fragmented culture. You see, they told us that the center cannot hold and how things fall apart. And now everybody is decrying the end of truth. All of a sudden everybody is saying that we're entering an age of post truth fake news. I mean, my goodness, they even used it as an argument against Dr. Peterson in the debate on gender pronouns. I mean, it's the postmodernist that heralded the end of truth 40 years ago. And now they're surprised to see the effect it has, how chaos does not discriminate, how it's turning against them, just as they turned it against their ideological enemies. They wanted to change the world to sand. Now they're surprised to find it slipping between their fingers. What is most surprising and what is most shocking to them is to find that now, having reached the end of their pursuit, having thought they had won, they see from within the decomposing residues of Western patriarchy, they see that there is a seed that's sprouting, that in the darkest place there is a flame that is lit. Logos Awakens the darkness has not overcome it. St. John promised us that. And my postmodern friends, if you had just paid attention to the stories, if you had just paid attention to the stories which are woven and in the fabric of our consciousness, these very stories you tried to deconstruct, you would have noticed that dawn always comes, that a seed is always planted. The Logos regains the center. Christ rises from the dead. And I think that's the excitement we're feeling right now, to find that small spark, that seed of a meaningful pattern surprising us in a collapsing world. And it's not just a pattern of meaning, but it's the beginning of a network of people. I mean, just in the past two years, there's a whole new strange group of public figures that's arising from the margins, people who are at least trying to figure it out, who are at least trying to think clearly and work out ideas, and people who are as different from each other as you can imagine, spanning across gender, race and cultures, even religious and atheists alike trying to figure it out. And yet the media and the activists, they scream hysterically, bigot, racist, sexist, Nazi. All the usual litany of attacks, and they're losing their minds. The sand is slipping out of their hand. And only two years ago, we would have probably collapsed before this attack. But now we look around and we find that there is a still, silent center in which to stand. There is an eye in the overwhelming hurricane. And we can finally say, we will not accept your frame, we will not accept your definitions. They are weak by the very process you use to deconstruct them, to deconstruct the categories. And we will speak for ourselves. What a relief. But it is a dangerous time. The time of transition, the time of chaos is a dangerous time, firstly because the enemies of Logos will ramp up their hysteria, totalitarian tendencies as Logos awakens. But it is also dangerous because, as Christ himself told us, the tares grow amongst the weak. The re centering of Logos is the reawakening of identity. So we can't avoid that. And that's a frightening thing, because if identity stops at the relative logi without aiming, without uniting itself to the highest of high, it can be murderous. And it has been increasingly murderous, just in the past century. And it is in fact the very murderous and genocidal tendency of identity which provoked the postmoderns to deconstruct identity in the first place. And there's a part where we can't blame them for that. I mean, in the shadow of Auschwitz, what Else can you do? So what will strive from this new sprout will depend on us, will depend on all of us. What will rise from this chaos? We've seen exciting but also frightening possibilities of what that might look like. I mean, will it be race again so that we inch towards genocide? Will it only be nation? So we're tempted to revisit the world wars? Will it only be gender? Will it only be class? In the scheme drawn out for us by Saint Maxim as the ultimate identity, the place where all meaning finds its resolution is the divine Logos, the source of everything. That is our trajectory as we walk the path of Logos, as we walk are transformed by truth. The finality is to be united with God. And I know that for some people, just the word God causes allergic reactions. And I'm sure people listening to this will be developing hives on their skin as they hear this. But maybe we can just think of it this way. For identity to be more than a weapon, it must reach its highest point in something that is beyond duality. And so finding, seeing our highest identity in God is finding unity with everything and the source of everything. And in terms of Christianity in particular, the identity with Christ is different from other identities because it's the identity with the cross, it's to identify with suffering. I mean, it's not the identity of a self serving power, but the identity of a self emptying power of power bound in love that empties itself out of love. It doesn't mean that we shouldn't struggle. It doesn't mean that we should just lay down and give up, that we should let our enemies destroy what we value most. Christ brought a whip into the temple after all. But what it really entails, what's important about it, and this is something that is echoed profoundly in what Dr. Peterson has been telling us, that we must first walk on the path of Logos ourselves. We must embrace our own suffering. In that truth, we must take up our cross. We must do so with the desire to first get rid of the lies which blind us, to straighten our own path. And in doing so well, that is how we will change the world. Saint Seraphim of Sorrow is known to have said, save yourself and thousands around you will be saved. As we walk on that path, as we strip away our own excesses rather than looking at the imbalances of others, as we strip away our bad habits and our narcissism, rather than acting like victims, the world will change and we will start to see and to experience Logos, to fully live within the patterns of meaning that constitute the world. If you take that journey, I guarantee that the universal patterns of meaning will manifest themselves so strongly in your life that at first you'll use the word synchronicity. But soon you'll have no other word to use besides miracle, and the postmodern chaos will vanish as wax melts before the fire. And logos, the very logos that rises from the grave, will fill your world and the world with life and light. Thank you."}
{"episode_id":"SW - #382 - 2025-03-15 - The Resurrection of Logos (Reupload)","start":2191.32,"end":2206.35,"speaker":"Jonathan Pageau","text":"If you enjoy these videos and podcasts, please go to the symbolicworld.com website and see how you can support what we're doing. There are multiple subscriber tiers with perks. There are apparel and books to purchase, so go to thesymbolicworld.com and thank you for your support."}
{"episode_id":"SW - #382 - 2025-03-15 - The Resurrection of Logos (Reupload)","start":2207.15,"end":2268.26,"speaker":"Laura Diaz","text":"Tucson the Weight is Over Mediweight Loss they're officially open on North Oracle Road. That's right, no more counting down the days. You can walk in right now and start your journey to a healthier you. Hey, it's Laura Diaz from iheartradio and you can trust me. This isn't just another weight loss clinic. I know that because it's where I lost weight safely with real medical support. GLP1 medications. You can see them everywhere online right now. But the truth is, your health shouldn't be a DIY project ordering these meds without the professional guidance. It can lead to dangerous mistakes, wrong doses, no oversight, and serious risks. At mediweightloss, I got the same medication but with a customized plan, weekly check ins, and a licensed physician guiding me every step of the way. And the cost? The same as those risky online options. Tucson, your moment is here. If you're ready to take control, feel better, and lose weight the right way, Mediweight Loss is ready for you. Walk in, get started and see real results. Call or visit mediweightloss.com to learn more and book your free consultation today. That's mediweightloss. Com."}
