{"episode_id":"SW - #155 - 2021-04-24 - March Q&A","start":12.56,"end":8741.34,"speaker":"Jonathan Pageau","text":"This is Jonathan Peugeot. Welcome to the symbolic world. We are live and so March Q and A. There's a lot of people who already sent some super chats. So. All right, so for people who haven't been here before, the way we do this is people who are subscribed to me at $10 or more get to ask questions in advance. And so I'm going to go through their questions and then at the end if I still have energy and time, I usually do. I think I've been getting better at it. I will then go through the super chats and then look at those. I sadly I can't answer questions directly in the chat just because, just the way I'm doing it now I already have like 40 questions and so I can't really. It's very difficult for me to follow the chat and so happy to see that some of my moderators are there. Jacob is there, Brad is there. Wonderful. Dorpur, Robbins, Neil is there. Wonderful. All right, and so we're ready to start. I guess I have a few things I need to deal with first. So what I'm doing in these months is because of the pressure on social media, what I want to do is I really want to encourage people to sign up to the website because if things go south and YouTube gets weirder then we will have people's emails and we can, we can still publish on Bitchute or on other platforms and still be able to stay in contact with you. So I'm really encouraging people to sign up to the website and you can go down to the bottom of the website. It's a free. You just write your email in there and then you'll start to get notifications when things come out. And that'll be helpful too as the website gets more interactive. I'm working on that now with a marketing company to have maybe forms on the website to have more content, more integration with the different articles that people are writing. All of that is, is happening. So sign up. And so all right, so what I'm doing to encourage people to sign up is I'm doing a raffle with, with some merchandise that I designed. So last month I was going to, I was raffling a, a six day of creation T shirt, nice gray T shirt and then also a, a little Griffin T shirt. And so the people who won Drum roll. I guess I can't do a drum roll. So the person who won the, the six day T shirt is named Odie. So I don't know, I don't know that it's just Odie. So anyway though, you'll get an email and for me to get your address. And the next person who won is named Lindsey Gale and him or her, I don't know if it's a man or woman won the Griffin T shirt. So next month, so sign up this month and then next month I'm giving like the jackpot. I, I'm even hesitating to raffle these because I want to keep them for myself. So the first one is going to be, it's going to be an all over print St. Michael T shirt, medium size. And so it's got the nice all over St. Michael and it's going to be a St. Michael, St. Michael theme. And then the second one is actually going to be a zip up hoodie with St. Michael on the back and with a nice little six days of creation on the front. So that's the big, that's the big one. All right, so, so sign up to the website and oh, as I, as I forgot to tell you. So what I'm doing just to make it fair for everybody, everybody who signs up gets one chance and then patrons, anybody who's a patron at any level gets two chances. So that's how I'm doing it. So there are a lot of things that are coming in the, in the pipeline, as you know, I guess the Jordan Peterson video came out and so this month we reached 100,000 subscribers and it's still going up 104,000. So thank you to everybody who subscribed, everybody who is involved in the symbolic world community. I'm really excited as to where this can go. And so I asked a lot of people what they wanted me to do for the 100,000 subscribers and I got some answers. Some of them sadly are impossible. The biggest one was for Matthieu to come and be on the website again or to be on YouTube with me again. And so I asked him just out of formality, but he didn't answer because I know he doesn't want to be on screen anymore. So maybe one day, who knows, but at least for now that's not happening. And so what I did is the next one was people asking about to do videos on Revelation. I started a series on Revelation. I did one on the mark on the sim, on the system of the Beast. Let's say there's going to be another one on the mark of the Beast that I'm working on now and maybe a third one. I'm not sure how I'm going to do it, whether a Patron on the video or maybe for everybody will be on the two women on the Whore of Babylon and the mother that. That flees to the desert. So. So it'll be like those three themes for Revelation. And I also did a live stream of my carving, which is a lot of people ask for that and I'm really surprised because I kind of, I said, okay, well I can do a live stream of carving. So I just did it and then I think like 10,000 people ended up watching it, which is really surprising. So I probably will do that again. I'm actually right now preparing a online carving class and so I've been super busy in the past few weeks putting it together. I filmed everything with three cameras and have just been editing non stop. And so it's almost ready. I think I'm going to drop it. Next week it's going to be a wood carving class. An icon of St. John the Foreigner, St. John the Baptist. We're going to start with that icon and I'm going to try to have three courses. One an icon of St. John, one of the mother of God, the mother Virgin Mary and then one of Christ in the center. It's called a deic. It's like the, one of the basic structures of iconography. And so we're going to. I'm going to do them separately. So three courses. So look out for that. Next week I think I'm going to, to drop it for people who would like to spend a lot of time with me, icon carving because I really film every step and I talk through them. So it's a lot of hours to learn to carve an icon. So I'm excited about all that stuff. So there's a lot of stuff. I'm sure there are things that I'm forgetting. Oh yeah, also the French podcast has been going for I guess maybe about a month, a bit more than a month. We have three episodes out. So if you speak French, go to the French channel, Jonathan Pageau Francais and sign up with JP Marceau. We started an introduction. We did an episode on Zombies and this one, the last one was on Heaven and Earth. We're going to just keep going with, with the themes, the symbolic themes. So yeah, so just a bunch of stuff going on and. All right, so here we go. So I'm going to. Usually I end like starting with the website and so yeah, so people support me, Support me through three platforms, the website and on Patreon and also on SubscribeStar. But there aren't a lot of people left on SubscribeStar. Because it's not a. It's not a great platform. All right, okay, so here we go with the website. So David Markham asks, do you think you'll ever team up with an icon painter, writer and create painted, carved icons? Yeah, maybe. I've been thinking about that. But what probably end up doing is I'll probably end up doing it myself if I end up painting them. But it's funny, I haven't really had any patrons ask for that yet. I'm kind of hoping one day someone will. So if ever that happens. If ever that happens, I keep reminding myself that I'm not taking any orders anymore. But in a few years, if someone asks for that, I will probably be happy to do it. So Nomad in Socks says, it was very helpful to me when you use the word decompress when referring to what you are doing, when you pull out the concepts of a symbol and then put them into a specific, relatable perspective for us, my question is, do you have any insight into the reverse of that process? What process is compressing these symbols in the first place? Did I even use that word? I don't remember using that word. I know I use the word compress a lot in the sense that the notion of compress, or at least the way that I understand when I talk about a compression, it means that imagine there are, Imagine your day. So you have a bunch of things that happen to you during the day, and actually there's an indefinite amount of things that happen to you during the day. But let's say there's a more definite amount of things that happen to you that you can actually pay attention to. All right, so out of that amount of things you can pay attention to, there's a number of things that you'll remember, right? And then out of those things that you remember, there are a number of things that you're going to use to put together into a narrative to tell the story of your day to your spouse. So that's the. That's how symbolism works. There's a compression of factuality into a symbolic structure. And so once you get to the story part, once you get to the part where you're actually telling the story of your day to your spouse, that has to be organized in a certain way for it to be interesting to that person. And so in that desire to organize the facts in an interesting manner, you'll end up with something which will have a universal symbolic structure. And, and the closer it is to the universal symbolic structure, the more your spouse is going to Remember what you said. And the. And the less it has, like, let's say the least participation in that pattern means that. That. That your story will kind of just float by or the person will find it boring, will find it uninteresting, or, or will just forget it right away. And so that's what I mean when I talk about compression is. Is that's how symbolism works. And so my contention is that that can happen at different levels. And so not just at individual levels, but it can happen at, let's say, national levels, at tribal levels, at different levels. This type of compression can have. And then they can also happen at a cosmic level. And that's what you find, let's say, in the early stories in Scripture is like a cosmic compression of facts that have taken, you know, huge, huge, huge amounts of information or rather extremely important information and has compressed it in a way so that we. We even thousands of years later can still attend to it and can still remember it. And so that has a certain effect on the way that you organize things and even the slant of the words or the concepts that end up shifting and moving in order to actually communicate the. The thing you're trying to communicate. And then sometimes being. Being a. Let's say being exact is not the best way to do it. That there are. There are actually other types of storytelling that are not exact in the way that we think of kind of scientific exactness which will be better to tell that story. And so that's what. That's my contention about. And so my contention is that resemble the store in Scripture are all talking about events. Like, none of them are just someone who says sat there and made it up. They're actually talking about events, but they're doing it more and more, especially as you move towards Genesis more and more in a compressed fashion, so that once you get to like, the creation narrative, you've got like the entire cosmos compressed into this one narrative, which is so full that you know that. That it's. It's mind blowing when you start to unpack it. And so, yeah, so maybe, maybe I use the word decompress when I explain it. And so when I'm explaining it, I am definitely doing a form of decompression in the sense that I'm picking apart this structure and I'm showing you aspects of it so that you can be able to see it, let's say, happen. All right, so Roxanne asks, what is the church's role in reforming the state? In Kansas City, the Heartland Presbytery sent a Letter to the Board of Police Commissioners asking that the police chief be dismissed. This seems to me to cross a line of propriety. Thank you, and may your Lent be blessed. And so the way to understand it is that there, there is a normal relationship between, let's say, religious authority and temporal power. Is probably the best way to describe it is that religion doesn't have. Is not supposed to, let's say, have means of coercion. Like they don't have police and that, don't have armies, they don't have swords, they don't have weapons. What they have is influence and authority, right? They have spiritual influence. And so it is. It is inevitable that at some point the religious authority will try to influence the political sphere through its means, let's say. And so it doesn't always happen in the best way, but that's the idea, is that they'll put pressure, a kind of spiritual pressure, a pressure also in their. In the fact that the people are attached to them, right? And so the trust that the people have for the religious authorities, the more the religious authorities, let's say, are, are straight or are right or on the right path, the more people will trust them and then the more authority they will have to press, to press down on the. The political authority. And so that's the way it happens that way. And then the political authority, what it, what it has is, it has, it doesn't have legitimacy in itself. It's only legitimacy is power. And when that's all the legitimacy it has, it tends to devolve into tyranny. But if it takes its legitimacy from the spiritual authority, that is really in the image of the Byzantine, let's say, the bishop that crowned the king, then it will have a more balanced capacity, let's say, to rule over the people, because it will obey the spiritual commandments. But it's really not, it's not weird, like, it's completely reasonable. It's like if the, if the political authority doesn't respect spiritual rules or becomes immoral, becomes corrupt and, and becomes tyrannical, then then they will lose the support of the Church and then ultimately they will also lose the support of the people, and then that. But then it can also go the other way, right? And so if the, if the spiritual authority becomes corrupt, then it'll lose the support of the people, and ultimately it will lose its capacity to influence the political sphere. And so these things happen in every direction, right? But ultimately the idea is that the body, or what's at the bottom, or the people, the mass, they act as a support, right? They are kind of like a body that attaches itself to the. To. To these different identities. And depending on how they act, they will trust or mistrust the authorities. And so it's a game really. And it's a game that's not always super. It's a game that can become disturbing and annoying, but that's the game the other game is, is a dangerous one. And so, I mean, if the police commissioner did something completely immoral, then in a way, in a normal society, it would be the Church's role to ask for the police commissioner to be dismissed. Because that's the role of the Church. The role of the Church is to point out the moral ideal that the state should follow. But of course, this can be corrupt and I don't know the specific details of the story. It can be corrupted. And of course. All right, so Pnuma asks any thought on the concept of Messiah? Ben Yosef, I mean, yeah, you could think, right, in Hebraic thinking or in Judaic thinking, there's the Messiah, the son of David and the Messiah son of Joseph. And it really is kind of two aspects of the Messiah in a way. You could say it's kind of like two opposite aspects of the Messiah where they kind of meet together. And they meet together in Christ, obviously in Christ. Christ unites both the Messiah son of Joseph and the Messiah son of David. But the idea is that you have one who is, you know, the, the king, the little one who kind of becomes the king, the surprise change, and then becomes the king and then establishes Jerusalem as the holy city. So he really is this image of the king. And then you rather have the Messiah son of Joseph, who is the one who is rejected by his people and then ends up in the foreign land and saves the foreigner. And so David, King David saves Israel, right? Establishes Jerusalem, saves Israel, whereas Joseph saves. First goes to the foreigner, becomes a foreigner, right? Becomes dressed up as a foreigner, and ultimately ends up saving the Egyptians to a point where he's not recognized by his own people. And then ultimately in the end, it all kind of comes together where he saves both the Egyptians and his own people. And so that's one of the reasons why you have all these stories, right? You have all these stories about this kind of eschatological image of how the Jews rejected Jesus and he went to Rome, he converted the Romans, he got dressed as a Roman. If you look at icons of Christ, he's dressed as a Roman, he is Messiah son of Joseph, he's disguised as a Roman, and he saves the Romans while his own people reject him. And then ultimately the. The idea would be that at the end there'd be this recognition that he was the Messiah all along, that he was their son all along. But, you know, I mean, who am I to tell the future? So. So, Gary Nuilia Nuila. Sorry if I'm pronouncing that wrong. Asked why is Wisdom, Sophia, personified as feminine? And so, well, gonna get him into trouble is what you're gonna do. But that's okay. That's okay. I don't mind answering this. And so you can understand, at least in the text, in the Old Testament text where it talks about Sophia, there is a sense in which it is the house. It's related to the house, the house of the Lord. And so there is this kind of. It is, at least in the Old Testament, it really does appear as a kind of feminine version or a feminine consort to the masculine aspect of God. And so you have this kind of call and response between this and. So you can understand it like that. You have the bottom part of the equation. You have the temple, you have the Ark of the Covenant. I talk about this all the time. You have the people, you have the church, the ecclesia, the gathering of the people. And then you have the glory of God which descends on. On that body, on that support. And so you can understand Sophia as this capacity to kind of build the house in that sense in the Old Testament. And so that's why it says wisdom build her house, right? Made the space, made the temple, created this space which is appropriate for the union with the divine. And so that's why Sophia is personified as feminine. But it's a very fraught question in terms of the. The modern interpretation, because some people have gone very far by identifying Sophia with the Virgin Mary and then pushing that very far and then having this idea of, like, how there's this. There's a fourth hypostasis of God and it becomes extremely fraught. And so I would say for now, those questions are probably best not to be pried down. Pride into too much. And I say that all the time. Like, there's something about the feminine which should not be uttered. There's something about the feminine which should remain a secret. And should remain, but not a secret in the. In the sense that we're hiding it from people. And the secret in the sense something which is kept for. For this, the intimate encounter and is not meant to be shown to the world and kind of exposed to the world. And so. And there are some things which, when they're shown to the world, become vulgar, become distracted. They. They become denatured. And so I think the whole mystery of the feminine in relationship to God is something of that, where it. It becomes denatured as soon as people start to talk about too much. Talk too much about it. So I need to now take my own advice and stop talking about it. All right. I know some say it's not true Christian doctrine, but what is your view on the symbolism of the Rapture? And so I think it's just not interesting. It's just not. It's just not Christian. It's not a Christian. It's not at all a Christian vision. I don't. Yeah, it's. It's. It's a total. It's a complete misunderstanding of. Of revelation, in my opinion. And it's also a very deep misunderstanding, a very deep misunderstanding in the sense of a misunderstanding of the narrative structure of the story. Because in that. In the narrative structure of the story, it doesn't really make sense, this idea that God will, like, take, you know, take the faithful up into the sky or whatever and that. It doesn't make a lot of sense, but there is this sense that we will be raised and we will meet Christ in heaven. Right. That imagery, all the imagery that's used to kind of. To create this rapture theology is completely appropriate. It's completely. It's very good to kind of understand this idea that we will rule with Christ in the heavens, that we will. That it is possible for those of us who are in him to enter into the heaven and to participate in the divine council and participate in the rule to be above and. And then now to have authority on what is below. And so all of that is real. It's just the Rapture is just kind of this superficial thing. All right, so Gardner brothers in Lord of the Rings, what is the symbolism of Frodo using Gollum as a necessary guide through Mordor, in spite of Gollum's constant deception and murderous resentment towards Sam? And so the way that I understand it is that really Frodo and Gollum are kind of like a mirror image, or you can imagine Gollum as what Frodo could become, this vision of a dead Frodo, let's say. And so that's what. That's kind of how I see Gollum. And so there is this. You could say that. You could say that. That there is a kind of. How can I say that? There's a wisdom in knowing yourself. Right. Or there's a wisdom in understanding where you can go. And I think that there's something of that going on there, which is really how. Because Gollum is dead and because he is, let's say, of Mordor, not directly, but let's say symbolically, he is. He is of Mordor, then he knows the way there. He knows the way to get to the dark place and to be able to. To get rid of the Ring. And so. And so there's something about that in terms of your own self that you can also understand, which is that if you are aware of your dark side, if you are aware of your passions, if you're aware of your weaknesses, if you are aware of your sins, really, then those sins can teach you something, right? They can actually teach you something about how to vanquish sin. If you know the process by which you sin, if you kind of become aware of it and you're able to follow it in the sense of. Not follow it in the sense of being led blindly by it, like falling into sin, but rather follow the process by which you sin so that when you get to the end, you can toss the sin into the pit rather than fall. Right? And so, of course, Frodo doesn't totally succeed that. But you can kind of understand how that can be applied to your life. You know, like if you have a bad habit, like I've talked about this before, to understand the mechanisms by which you end up falling back into this bad habit can help you, right, See it coming from far away and be able to follow it to its end and know before you come to the end, right, not to give in, but rather to throw the sin into the fire to. To vanquish on your passion. And so that's what I think it's about. All right. And so Blank asks, could you discuss the symbolism of Jeremiah 17. 9? The heart is deceitful above all things, desperately wicked, who can know it. How does this relate to Follow the Heart and to the prayer of the heart, etc. Also, if you want a short question, is your family Christian, Your parents, your wife, your kids, etc. Thank you for everything. And so how does that relate to Follow the Heart? And there's a better. Like that question. Your question is a little fraught in the sense that. That that verse is not. I don't know if that's the best translation for it because I know that there is. There's a. The word, I think, for deceit was something like tortuous in the sense of like, almost like A labyrinth, right. That's why it says, who can know it? In the sense that it's not necessarily a moral question. It's rather a question of. Of not of having this, like this tortuous aspect to the heart, which you can't. Which means that it's veiled or that you can't really know it. That's at least my understanding of that verse. But maybe I'm wrong, but that's what I. That's what I've learned about it. But there is your question. The basis of your question or the basic aspect of your question, I think is valid. And you can see it in the words of Christ, which is that Christ says, right. It's not what goes into the. To the body that is. That is evil. It's what comes out of the heart, which is evil. And you think, okay, so, yeah, so then how does that fit to following a heart and to the prayer of the heart, etc. And so the way to understand this is through fractals. It's through fract, Fractal, fractal. Nature of reality. And if you're interested in that idea, gave a talk about this. I forget what it's called. It was something about. It was. Was something like the mystical. The mystical nature of reality. I forget what the name of the talk was. It was a talk I gave in Seattle where I talk about this. And the idea is that you need to understand the heart as being a microcosm of everything. And so the heart, even the heart itself, is made of a little heaven and a little earth. And so you can understand that it's like there's the heart and then there's like the heart of hearts. You could say. And then I know how far you could go. The heart of Heart of hearts. And so every layer of the heart has a microcosm in it. It has an above and a below. And it also has a center and a periphery. And so you could have this idea that the serpent is in the garden, right? So even in the Garden of Eden, that's how it works in the garden. So the Garden of Eden has a tree and the image we show of it, right, with the. With the snake turning around the tree. But that snake turning around the tree is the same snake that's around the entire cosmos, right? It's the same snake, the Leviathan, that's at the bottom of the ocean. Even, you know, in scripture, he's actually described that way. And so you can imagine that that structure is also in your heart. That in your heart there's also this center. But then there's also the possibility of this periphery or this, or this deceitfulness or this, this labyrinth around that makes it. Makes it what it is, but also means that, let's say the danger of sinning starts in the heart. And so it starts in the heart, and then it actually kind of reverberates into reality, just like the sin started in the garden. And then because the world is a fractal structure, then the effects of the garden then reverberate out into reality. And so that's the best way that I understand it. All right, so David Flores asked, in the Cosmic Mystery of Jesus Christ, Saint Maximus discusses logi. It seemed to me that he was indicating that as we name, define, mediate with logoi, the logoi also do the same for us, similar to how a background defines a figure where the opposite of something gives shape to its antithesis. Is this a correct understanding of his view on logoi? So I would have to see, see, like, what it is you're talking about in terms of what he says. And so. But I would say, I mean, do the logo affect us? Of course they do, because these, these essences that exist in the world, you know, constitute us and constitute aspects of us and constitute aspects of the world in which we exist. And so they will definitely affect us as well. Right. It's not just us who, let's say name, but we also become. Then we live in this world of identities, and so we have to live with them. So I don't think that's what you mean, but I'm not totally sure how the idea of background defines the figure. I mean, there is this idea that identity always has an outside. So I don't know if that's what you mean in the sense that all identities necessitate that they are, let's say, manifested as in relation to other identities. So they always have an outside. So I don't know if that's what you mean. The outside would define the inside as well. So sorry about that if I don't totally understand. All right, since you will. So Josh the mover asks, since you will read this question, around the time that the old calendar commemorates Saint Patrick of Ireland, the question seems fitting. What is a proper, orthodox understanding of the concept of luck? Is it nothing more than a heretical superstition that denigrates the concept of grace? Or is there something more to it? Is luck a tiny miracle? So the way to understand luck is really the way. It is the idea of lots. It's the Idea of a breakdown in reason or a breakdown in causality. And this is what's difficult, I guess, is that the breakdown in causality, of normal causality happens below and above, right? Sometimes I talk about this like the upper, higher waters. And the lower waters is an image that you can understand. And so, for example. So luck or chance is used in games. It's used in games of chance to win money. It's used and it becomes. There's a passion element to it, right? This idea of giving yourself to luck or giving yourself the chance in a game of chance, for example, gambling, all of that stuff, there is something passionate about it and something which shows the lack of supremacy of the system. It's one of those things, the breakdown of causality, which shows how the system can contain everything. Because you can decide things and you can get things or you can lose things based on pure chance, based on no causality of your action. In the sense of. Right, in the sense of, like, I work, I dig a hole, and then someone gives me $5 to dig the hole. It's like that's a normal causality of reality. Whereas, you know, I throw. I throw a die, and then all of a sudden I win money. It's like there's no work there, right? It's like the. It's the end of work, let's say. But there's also a version of lot or luck or chance, which is above. And so. And it has to do with. In the Old Testament, it has to do with actually discerning the will of God. So the, the, you know, the Purim or something. I forget the name of them, but the, the breastplate of the. Of the priests, the. The Ephod had these stones that could be used to throw. They would throw the stones. They don't know exactly how they would do it, but they would use the stones in a way, in a kind of chance manner in which to discern the will of God. And then they would pick them. They would say, like, this is what God is showing us. In the same way in the New Testament, for example, they pick the new apostle based on lots of. And you see that also even today, someone told me, a bishop told me that in the Orthodox. I don't know if it's there in every Orthodox church, but at least in the Oca, when they're choosing a new bishop, they will deliberate and they will deliberate on who to choose. And if they all agree to choose one person for the next bishop, then they will just vote him in. But if they don't agree. And if they come at a. At a standstill, then they will actually use lots of. And it is the lots which will determine who will be the next bishop, really following what you find in Scripture. And so in that sense, then it becomes a breakdown of reason in the other way. It's like an opening up for the possibility that there are some forms of causality which cannot be contained in a higher way. Like there can be direct influences of heaven down onto the world without even following the normal levels of causality. And so that's how I understand the meaning of luck. And so it's hard sometimes to tell the difference, at least sometimes in your life, right? You know, you can meet. You can meet really bad people that have good luck sometimes. And so it still tells you about reality. Just sometimes you're not sure which way it's going. All right, so Nelson Justin Evans says, I am becoming a high school teacher at a public school. I aim to guide my students away from the modern nihilist materialist worldview by exploring its shortcomings through secular fiction. For example, hedonism in the brain, New world, illusion of subjectivity, subjective morality in Crime and Punishment. What do you think would be the most valuable themes, ideas for young people to mull over? I'd like our class discussions to plant a seed which may grow into a full faith in Christ later in their lives. I mean, I think it's. First of all, it depends your high school students. Because seriously, are you really going to have your high school students read Crime and Punishment? Because, man, that's some intense stuff. It's also very long. And so maybe, I mean, if you have great students, that would be awesome that they could read Crime and Punishment. Brave New World is, I think it's like a standard thing that people that you have high school students read. It's definitely. I think reading 1984 and Brave New World is a really important thing to do right now in our situation. And so definitely, I would say it's probably a good idea to. To have them read that. I think. I mean, I think that. I think that young people need to understand hierarchy just like everybody else. That's the thing that nobody understands, you know, and it's also kind of the solution to all the problems, which are not all the problem, but it's a solution to a lot of the problems that we're facing, which is that because we hold on to this equality thing, then everything is either in or out. And if it's in, then it's equal. And if it's out, then it's out. So we can't have this normal idea of a natural kind of hierarchy of things where some things exist on the margins and are kind of weird and are kind of off key, but they're there and we don't talk about them too much, we just kind of leave them there. And then we nonetheless try to focus on the virtues, on something which unites us, something which holds us together. And so I think that that's something that people, that young people need to understand. It will probably help them with their suffering because this is one of the things that is making people suffer, is that people have desires. And then, because even in their own life, they think that everything is equal, then they have a desire and they immediately identify with that desire. And. And then they're trapped. And so. But if you understand even yourself as a hierarchy, then you know that you can have crazy thoughts and you can have crazy desires and you can just kind of let them flow through and just move on, right? And you don't have to latch onto them and see them as identically important to your other aims, to your other desires, to your higher vision. So for sure, that's what I think people, young people need to understand. But, man, good luck. That's tough. Because it's tough. I have my own kids and it's. I'm seeing it happen now. Teenagers. And you know, one of my teenagers is just like right in there, like, struggling with those problems, struggling with all the problems of the stuff that we're seeing, you know, all the school stuff. It's all there. So it's everywhere. All right. So M. Tara Thomas says, just started reading your brother's book, and I must say, so far, on 30 pages in it is both very deep and readable. A most disconcerting concept. Question has occurred to me. Is, is the symbolic thinking contra rationality? Is it in dialogue or competition with rationality? It is not at all. It is actually symbolic thinking is extremely rational. It is very, very ra. It is quite rational. But it is rationality knowing its limit, you could say, which is the pattern of the symbolic pattern also includes the places where rationality breaks down. And so it's like a kind of meta rationality where it sees rationality, but it also understands. It also is able to see its limits. And in the, in the entire pattern, it's able to embody both the six days of work and the day of rest. You know, it doesn't just have the six days of work. It doesn't just have the rational. The rational, because the word isn't just made from rational, right? They're. They're. The irrational is part of the world. And so. And so I think that that's actually the value of what we're trying to propose, oppose is to be able to bridge the gap and help people find a way to kind of. To keep a rational capacity and. But just have it in its place and not don't. We don't. Not to oppose it. Not to oppose science or technology or to oppose. To oppose reason at all, but to also. But to understand where is its proper role and also what is its proper function. Like it has to be aims to some towards something which is beyond rationality. Because you can be very reasonable and use all your capacity for reason to create a virus that will kill all of humanity. And you can do it. You can use your reason to do that. You can use your reason to do all kinds of things. And so we're also trying to point to people that the purpose towards which rationality is. Is aimed, is super rational. It can't be rational. It cannot. All right, so Kathy Tubrin asks, can you discuss the symbolism of Matthew 10:34? Jesus did not come to bring peace, but a sword. Thank you. And so this is really where you have to understand Christ in His totality. And this is something which really is very difficult to do. I would say it's almost impossible to do. It's also impossible to see Christ in his totality because he is in a way, a. He is in a way, the place where all reality comes from, right? He joins everything together in Him. He. He joins all the. All the extremes into Himself. And so that is one of the extremes. And so, you know, there are other places where he says, I am your peace. Right? I am here. That he is the one who brings peace. You know that. That he's bringing a world where the sheep and the line will lay together. All these types of images are there in terms of Christ as well. But there's also a way in which the. In which he is a sword, he is a divider. And so a really simple way to understand it is that's what the Logos does. The Logos both unites and divides. And so you can see him from the side of uniting, and you can see him from the side of dividing. And sometimes you feel the dividing, and sometimes you feel the uniting, right? Sometimes you get cleaved, right? Sometimes Christ will cleave you, and then sometimes Christ will gather you together. And those two things are important. That's how reality exists. Reality is a Balancing or coming together of separation and union. You know, if you look at the story in the beginning, that's what God is always doing. He's separating heaven and he's separating the. The. The waters that he's separating earth from. From the waters. Then He. You know, it's like He. He's constantly separating things into their. Into their species. And so it's like separating and bringing together. That's how. That's how the Logos functions. But like I said, you can also just have the image of Christ who. Who. Who puts the goats on one side and the sheep on the other. Right? He puts those that will be separated and those that will be gathered together, but that's really how the Logos works. So. Okay. All right. So from Mikal. Do you think Christianity can be compatible with some kind of republicanism? You often present the hierarchy of a feudal kingdom as the best pattern of society. Yet there is an alternative pattern, a council gathered around God or the knights of the Round Table. What concerns me in mixing a government pattern with religion is that in the 18th, 19th century Russia, the Orthodoxy, was used as a tool for despotism, imperialism, and chauvinism, that's for sure. And so you can understand. You can. I think that you would. You can understand a kind of republicanism that would have a tendency towards unity, you could say. And so I think that, like the Orthodox shirts, that's how it's always been structured. It's like it's a council of elders with one elder that is recognized as being kind of the first among equals. Right? So there is a hierarchy, but that hierarchy is. Tends to want to express itself as a gathering together of the. Of the elders. And like you said, the Round Table is a perfect example of that. Where let's say King Arthur is. King Arthur is the king. He's the head. He's the authority. But. But because the union with his knights is so close, then he doesn't have to impose himself. And so this hierarchy looks more like a communion than it does a strict hierarchy in a kind of military sense. And so for sure, like, as soon. Let's say it this way, as soon as the government or the temporal power, as soon as it subjugates the spiritual authority and tries to make it just a tool of itself, then it's over. It's over. It's gonna fall. It's gonna. It's. It's just a question of time before it falls, because it's the wrong. It's the wrong order of. Of. It's the wrong order in the hierarchy. Right. And so Moses is above David. Right. Moses the prophet is above David. The prophet comes and the prophet tells the king what he did wrong. And the king has to repent or else God is going to smite him, the prophet. And so you see that in the example of King Saul, it's like King Saul sins and the prophet names another king. And so the prophet is the one who names the king. That's the proper hierarchy. But the prophet also doesn't have weapons. The prophet doesn't have an army. The prophet isn't a power in that sense. He has authority, he has influence, but he doesn't have the means. And so that's the relationship between spiritual authority and temporal power. That's the normal relationship. So when Peter I subjugated the church and made it a tool of the state, then he was just. The guillotine was down the line. Like there was no way around it. It was just a question of time before the guillotine came a chop in. Right. So that's how I see it. The only people who seem to get out of this are the English for some reason. How is it that the English do it? I don't know. They're able to kind of find these weird balances. I don't know what's going on with the English. All right, I think I'm done with. Do I have all the comments here? Yeah, I think I've got all the comments. For that, I'm gonna go into Patreon. So Patreon, I have a lot. There's a lot of questions. Patreon, I think, like 30 something. Hey, guys. Thank you. By the way. I'm really happy because I'm noticing people are making an effort to not write overly long questions. And I think just for the people watching and the people listening, I think that's. That's useful because sometimes when there's so much elaboration in the question, it's hard to have all these questions lined up. So. Thanks, people. All right, so Gerrit Widner asked the saying, spread abroad among the brethren, that this disciple was not to die. If Jesus did not say to him that he was not to die, Peter, but if it is my will that he remain until I come, what is that to you? John 21:23. So what does this mean for John? And in what way is it significant to the biblical pattern? Is John akin to the. So why did he. Why? Yeah. Okay. So he says to Peter that this disciple will not die. Yeah. Is John akin to the remnant of the church who will not fall away in the end times. It's a very mis. It's a very mysterious, mysterious verse. And it's a very mysterious verse. So a way to say it. This is the way, this is the way that I would say it, and I'm not going to elaborate too much, but this is the way that I would say it is. What Christ is suggesting is that the one who lies on the breast of the Messiah, the one who is on his heart, the one who is close to his heart, will not, if it is his will, he will remain until I come. It's similar to when Christ asks, will I find faith in the world when the Son of Man returns, Will he find faith in the world? It's similar to that, but it's even more pointed. It's like the one who remains close to the heart of Christ is the one who holds the world together with Christ, the one who participates in actually holding reality together by embodying, by being, by theosis, by being in the heart of Christ or close to the heart of Christ. And so I think that that's what Christ is talking about, but I might be wrong. A very, very mysterious verse. It, I think he's giving us hope that there, that there will still be saints until the end. And there kind of has to be in a way or else the world will, will fall apart. But it's weird because it's like, okay, so if the world is falling apart, it means that there are less saints. And so how many like, are there? You know, is there just going to be one like Noah, you know, like in the, like in the just before the flood, where there's just one left and, and then that's why the world doesn't get destroyed. I don't know. I hope not. Okay, so Julius. Bars. Dietes. Sorry if I mispronounce your name. Julius says, hey, Jonathan, hope all is well. My question is if by stressing the equilibrium between the bottom up and top down constitutional reality, one doesn't end up with a pantheistic system, would you agree for the primacy of spirit? And if so, then how, on a smaller scale, what is an angel of London if London were to burn. Thanks a lot and all the best. So yes, for sure there's a primacy of spirit. Right? Right. So meaning comes from above. Right. The voice of God comes from above. The breath of God comes from above. There is definitely a primacy. The world is held together by the logo. Right. And so there is, in order for the world to exist, there is an Anchor, like a heavenly anchor. That's, that's. So there is. That's why it's a hierarchy, right? Getting close to that while staying in the world. Getting close to that higher place, right? The highest it can go, let's say, like the, the, the higher that. The highest the chair can go before it. I don't know, like it becomes disembodied or whatever, that it remains embodied. But it's the closest to what it's supposed to be, right? That's the, that's kind of the aim or that's the point. So, yes, you're right. So what is an angel of London if London were to burn? Well, it's still the angel of London. It's like there is a manner in which things exist in their totality, in all eternity, right? There is a way in which temporal reality is not total. And so the fact that things in the world exist and cease to exist, or that bodies that communion, that the bonds of love that create higher, that manifest higher identity is the fact that these come and go in time doesn't mean that there isn't an eternal reality to that communion of love. And so that's. The angel of London is the principle of London. And the angel of London exists in all eternity in the mind of God. And, and even if London were to burn and will burn, everything comes and goes. That, that doesn't mean that there's. That that being doesn't have an ontological reality in the totality of everything. That's the best way I can explain it, I guess. All right. So, Erling Romer asks, you frequently make reference to the Neoplatonist school of philosophy without mentioning any concrete names or philosophical works. Having recently been blown away by studying the Aeneas by Plotinus, whose doctrine of three hapastasis in particular is so strikingly congruent with Christian teaching, I wonder if you could elaborate on your views on the merits and shortfalls of Plotinus or any other Neoplatonist. I get that the Neoplatons don't have nearly as fleshed out a story as Christianity, but do you also perceive any major flaws in the bare bones account of the hierarchy of being? And so I'm not an expert on Platinus, but I think that the way that I see it is that the way that I see it is that Christianity. It's almost there in your question. It's like Christianity embodied what for the Neoplatonists was almost like an abstract science. But an abstract science doesn't. The world doesn't Work that way, right? It's the hierarchy of beings. They are beings. They, they, they're modes of being that embody themselves in the world. And so ultimately this ends up, have, has ends up having to look like an actual hierarchy of beings. Right? And so it's not. You can't just have the philosopher sitting, you know, meditating on the mysteries of the cosmos. You need bishops and priests and sacraments, and you need people to congregate and to worship, and you need all these things which, which embody this metaphysical reality in the world. So you could say that ultimately is what Christ does and he creates this anchor by which, let's say, the best aspect of the Neoplatonists can now really be lived and embodied and not just be a kind of a philosophical, just a philosophical meditation. And so I, to be honest, I do not know how close or far the, the, the, the three, you know, divine hypostases are in Plotinus compared to Christianity. And I would probably be better if I didn't adventure myself there because I would certainly put my foot in my mouth and then I, there would be someone on the Internet to come after me and tell me then I'm wrong. And so all I think about the Neoplatonists is quite simple, is that whatever is good about them, I think we can use it and we can use it in the church. And like I've told you, I've said this before, like it is not rare to find in churches in the Mediterranean to find the Neoplatonists, the Platonists and the new Platonists represented in the narthex of the church. And so Plato, Aristotle, Plotinus and. And these different thinkers would be represented in the nartics of the church as people who came close, you know, and were able to imbibe some truth. But maybe we're missing the body, right? We're missing this incarnational aspect. So that's what I think about them. All right, so Jonathan Morgan asked, I've been thinking of the means of Incel, Chad and Stacy and noticed that there was a parallel to the story of Hephaestus the Net humiliating Zeus and Aphrodite. Is this a spirit's connection to make? And are the technically skilled but socially inept nerds of today related to the disfigured God of Smithing? Yeah, I think they are. I think they are. I mean, these are just patterns of being right. You can understand it like, it's almost like the joke of the guy with the big car, right? It's the joke of the need to compensate because you lack something. And so the idea that someone who is socially maladjusted or not good looking or not good with the ladies would throw himself into a way to prove his superiority in other manners in kind of these external ways, in these technical ways you could say, I think is something that is not surprising at all. But you know, it doesn't, doesn't mean that everybody who likes technology necessarily has that problem. But I think this, to notice it as a pattern, the idea of the nerd who's super good in technology but is difficult, has difficulty talking to girls, I think is a, I think it's really a pattern that exists. It's hard to avoid it. All right, so Richard Rowland asks what is the symbolism of meteors and especially things forged from them? You've talked a lot about the symbolism of the forge and of drawing up ore from beneath to make a tool. What about when it's done with a fallen star? My sense is there's something demonic about this and this is how Tolkien handles it in the Similarian. So I don't know about how Tolkien handles it, but I would say that for sure, it would be important. That is for certain. So we, we have to understand that that's what's in the cabal, right? That's in the, in the, the, the, the big black square in Mecca. There's a, there's a, there's a stone from heaven, right? That's there. And so I think that ancient people would have definitely seen these, these stones that come from heaven as being extremely important. And so like you said, the problem is asking yourself, did it? And this is actually a big, this is actually a question like this is, this is a real, this is a real puzzle for you, Richard, or for a people, is that what is the difference between an angel that descends to, to reveal the will of God and an angel that descends to reveal to humans some secret that they're not supposed to know, like what's the difference between the two, what's the difference between the Nephilim or the Watchers? And you'd say, and the vision of that Moses receives on how to build the tabernacle, for example. And so it's like, what's the difference between those two? And I think that, that it's, it's a, it is definitely is. It probably is a tricky, it's tricky to, to really to get that. I mean, I think, I think I know, I think I know what it is, but I'm not sure in terms of meteors, how that Could. So maybe you could say something like, if the meteor falls to earth, and let's say you use the stone of the meteor to like make an altar, let's say, or a throne. That would be something. But if you use it to make a weapon, then maybe that's the problem in terms of symbolism, maybe it's that. But I don't know enough stories of these fallen stones. All right, so Chase and Lindsay asks. Hey, Jonathan, I have a potentially silly sounding question, so please bear with me. In the instance that man came into contact with something like an extraterrestrial group of or people, the proper way, the proper way to act be to treat them as the foreigner or in a Christian context, as the gentile in relation to the Jew. By extraterrestrial I do mean flesh and blood biological beings like man, and not higher principalities like angels and demons. I understand this is a really silly question considering the real possibility that there be nothing like man spread across the heavens. But I'm curious for a serious answer, since I have been wanting to portray this kind of event in a story I have been working on for over a decade. I'm curious what the proper way to deal with such an encounter is in the context of Christianity. Would there be a proper way to trade with these beings or have relationships and marriages with them, or without creating giants or monsters? Dude, you're asking questions. Would it be a worthwhile effort to potentially invite such people into Christ? Or would the risk of inviting foreign gods be too great? Or we would just treat them as dog headed men and leave them alone? Thank you for any insight into this silly question. Well, it's not a silly question in the sense that it's important to understand it because it's floating around. It's floating around in the narrative sphere of our world. And so I think that it's important to understand, let's say, the way that the extraterrestrials are portrayed in narrative. And that has to do with the way in which they would appear to us, you know, if this. Something like that would happen. And so the way they are portrayed in narrative, it can give you a glimpse as to what they are. And the way they are portrayed in narrative is something like really is something like this, this. The kind of infinite stranger, the. The infinite foreigner. And so they are either represented as gods, you know, as these angelic beings that are coming to bring us light and to bring us knowledge and to. And to save us from ourselves, or they are represented as, as man eating crazy invaders from outer space who, you Know who probe you in places and they probe you from behind, right? All of that stuff, all of that symbolism has to do with the. This, the foreigner that comes, right? And so this, the idea of if you don't understand that there's a relationship, for example, between the alien abductions where people get probed from behind and the situation in the city of Sodom with the angels and lot, where it's like a weird reverse thing. But that relationship, that there's something to do with that kind of relationship and the stranger, because it's a non productive relationship, right? The extreme stranger has a non productive relationship with us. Us. And so that's how you would. That's how you have to see it. One thing I can tell you very simply, and it probably wouldn't be a surprise is that if that happens, that's just. That's it. That's the end of our world. Like our world's gonna end if there is. If that happens, our world's gonna end. And it doesn't mean good or like, it just means that that's what's gonna happen. And so it's like Apocalypto is actually a great movie to understand that. It's like if you have an encounter with something which is so far removed from you that you have no way, no frame, no way to frame it in any way, it's going to end your world. And so that's it. Sorry, it's like that's it. And there's a reason why it's portrayed like that in narrative is because people intuitively understand that it's going to end your world. And that might have positive and negative aspects, but that's definitely what's going to happen. So Dorothea asks, hi, Jonathan. I attend mass in the Catholic Church and last Sunday the mass readings were about King Cyrus, a reading from Ephesians, about mercy. The gospel reading was one with Nicodemus, with the famous John 3:16 line. I took it as a symbolism happens moment. As I was thinking for a while now, if one of the key problems in Jordan Peterson's relationship with God is his lack of belief in God's mercy in the absolution of sins. I would like to hear your thoughts. Thank you. I mean, I think you're right. I think you're right in the sense that if you listen to how Jordan portrays, like what it means to believe in God, it usually means conviction of your sin. Like that's what he's saying. Basically. He's saying that it's too heavy, right? It's Too heavy. Whereas God in Christ gives us this possibility of entering into his grace. It doesn't mean, of course, in orthodoxy, doesn't mean that you also don't have to take up your cross. You don't have to take on the weight of that. But there's also a way in which we are also relieved from that weight through. Through. Through. Through forgiveness. And so maybe. Maybe. All right, so Jeff Dunlop asks. It seems like feminists, with their newfound intolerance for sexually immoral men, are actually helping bring back monogamy. Yeah, I thought that. But won't monogamy destroy feminism? Aren't they doing this. Are they doing this intentionally? There's not a lot of stuff in that world that's happening intentionally. It's like. It's. It's. It's like the war of passions, you know, And. And. And people don't realize all the. Like, people don't realize all the. All the. The. The. Let's say the. The implicit. The. The. The implicit or not implicit, but let's say the side effects of what they're doing. And so I think we're seeing a lot of that kind of stuff that we're seeing a lot of that. A way to see it is like, the idea is that the world does lay itself out in a certain way. It has a certain hierarchy, has a certain natural way in which it kind of lays itself out. And you can push it. Like, you can go against it, especially when you get to the end of a system or the end of a world or the end of something. And so you can push against it, but at some point, it kind of snaps back. And sometimes it's funny to watch, like, you're seeing that in the very mechanisms of trying to break it. It ends up kind of turning on itself and then bringing it back, you know? You know, and so, yeah, there are more. There are more. There are more, like, more of these going on. Like, the. The whole question of transgenderism is part of this, where it's like the transgender question is. Is. Is actually bringing back both kind of Is. Is. Is putting back on the table traditional masculinity and. And. And traditional femininity in almost like an extreme way even. And so it's actually a very strange thing. It's a strange phenomena when things get so weird and loopy that all of a sudden these upside down start to flip on each other, and they. Then you can kind of pierce. You can kind of see normality representing itself in the distance. And I think that's what you're Seeing with this idea that there's something about the new, like let's say there's something in feminism which is almost like a puritanism, like a kind of desire for chaste, you know, for chastity and not objectifying women and not over sexualizing women. All of these things are there in that narrative. So it's a, it's an interesting, strange, interesting thing. All right, so Mika Mueller asked, could you explain more the pattern of or of ideas or bar pattern of ideas or barbarians descending from the north? I live in reading and I've been curious how that pattern has manifested through St. Herman. I understand that truth works top down. Is that connected to geography? And so the north has like a double symbolism. Like if you read Matthew's book, you'll see that it has a double symbolism. On the one hand it has a, an aspect of it which is light, you know, and that's manifest itself like in terms of the snow caps, right? You see the snow that's out in the north. But there's also an aspect of the north which is dark in the sense that it's the place where the sun doesn't go, you know, the sun doesn't go to the north. And so a good way to understand the north has to do with like extremes. That's the way that I understand the north. And so the barbarians that descend from the north represent kind of unleashed extremes. And so they come down and then they pillage and they take. But it's also, there's something about that which is almost like birds coming down from heaven, right? These rapacious birds that come down from heaven and kind of take things. So that's kind of how I see the barbarians coming from the north. But then there's also the possibility like if, so if the barbarians find a nest, if you're able to give them a nest, let's say, then they end up settling and they end up ruling. And so this is something which in history you'll see happens. It happens non stop if you pay attention, right, that the northerners descend from the north and they at first they pillage and they take and they take and they destroy. They cut heads off and they rape and they do all this stuff. And then finally someone gives them land in France, let's say, or, or, or someone asks them to settle in Russia, let's say, or let's say, you know, they come down north and then they end up settling in China, let's say. And so then, but when that happens, they become the rulers and so they become the aristocracy of the. They become the Norman kings, they become the, the kings of Sicily, the kings of Northern Italy, the kings of England, but also the kings of Novgorod, the kings of Moscow, and they become the new emperors of China. And then they go down, all the way down, and they end up becoming the emperors in India, for goodness sake. And so it's like, that's how it happened. But the thing is that these barbarians, they come down from the north, they don't have body. It's like they need body. And so they actually end up taking the body of whatever it is that they encounter. It's interesting, right? And so it's not like, let's say the Romans. So like the Romans, when they invade, coming from the, coming from where they are like, let's say more south, or not totally south, but let's say more south, they kind of, they kind of invade and then they, they strain. They, interestingly enough, like they, they, they kind of impose their structure everywhere. Whereas when the barbarians come down from the north, they bring a kind of, a kind of breath, but then they become Roman and then they become, they be. They join with, they become Russians, they become, they join with the Slavs, or they basically become Chinese or they become Indian. And so that's the fascinating thing about these, these barbarians that come from the north. At least that's how, that's how I understand them. All right, so Lucas Fernbach says, is there a kind of encyclopedia of symbols and their meeting? Maybe that would be a nice project for the community, or you could write one. I would totally pay for it. So thanks, Lucas, but I'm really not interested in encyclopedias of symbols, and I find them very uninteresting. I don't think I own one. I don't think I own an encyclopedia of symbols. I always find when I read those encyclopedias that they are very arbitrary. And so I'd rather understand it in terms of systems rather than isolate symbols and then try to show what they mean. Because symbols don't mean anything in themselves. They always mean something in relationship to other elements. So, for example, the same object can mean something completely different depending on what its place is in an image or in an area in a story. It has mostly to do with this kind of structure pattern which shows itself and embodies itself in different images. So that's how I see it. And so that's probably why I've never been interested in that kind of, that kind of stuff. So Nina Morris asks, do you think you have become a holy fool? I don't think that I'm surprised that you say that. I really don't think that I. That I have that that characteristic might have a little bit of it. It enough to understand it, maybe, but I don't think I'm a holy fool. So Anders Ralstadt asks, hi, Jonathan, how does the Gospels point to Christ filling the hierarchy of being? I get that the story portrays him as uniting a lot of opposites, but how does he fill all in all? I also get that the Logos is what holds everything together, but I do not grasp how Christ showed this as he did not explicitly incarnate or manifest every mode being. So you have to understand, in terms of narrative, first of all, a good way to understand is to understand how it's about categories of being. And so some categories are contained in other categories. So it's not like this explicit manifestation of every single possible category, but it's rather that, for example, if Christ manifests something like a king, then this whole image of the ruler is embedded in that aspect. Let's say, if he manifests something like the one who is cast away, right? And so he's crucified outside the city, then in manifesting that which is cast away, he takes upon himself all the imagery of the stranger, of the foreigner, of the criminal, of all of the imagery of that which is on the. On the outside. And so it's not like he has to necessarily embody every aspect of humanity, like I said, because of this fractal pattern. Then, as his narrative shows him filling up certain spaces of being, let's say you can, by analogy, notice that. Okay, but these other spaces fit in that one, right? And so, and so, like I said, the idea that he is out, he gets crucified outside the city has a huge amount of importance, okay? But ultimately, if you want to see the place where. Where he fills the hierarchy, it's in the crucifixion. That's really the place where he fills it the most. And it happens in a kind of simultaneity that is really hard to think about. So I've talked about this before, where, for example, he has a title, the title which is put above him. His name is written above his head, his role, his title as King of the Jews. But. But in that title is both the opposite, the irony, because it's supposed to mock him, right? It's supposed to actually represent the opposite of what is said on the title. But then it also is manifesting the fact that he's the king of the Jews at the same time. And so by actually manifesting opposites in simultaneity. That is one of the ways that Christ is manifesting everything at the time, same, the same time. It's really rather astounding that this can happen in the story and then on the cross when he dies. So Christ, I've said this before also, it said that he went down and preached to the souls which were imprisoned. So he goes down into shale, he goes down into death. But then when he dies, he also says, right, he says to the thief, think about that. He says to the thief, to the sinner, he says, today you will be with me in paradise. So even in that little bit of story, he takes the sinner, the one who's condemned to death, who is condemned, is the one who's supposed to go down into the prisons. And he says, it's almost like he's saying, I am going down with you in the prison, but don't worry, I'm bringing you way, all the way back up into the highest place. And it's all going to happen in this weird simultaneous, in this weird simultaneity. So he goes down into the prison and then he rips the veil of the temple. All happening at the same time. Right? And so those are just little aspects. But I mean like, my goodness non stop every, every story of Christ has that insane, like insane amount of, of, of opposites. Like maybe one day I should just go through the Gospels and just kind of take every single thing that Christ does and just show you just how much almost everything he does has this kind of just insane amount of opposites kind of coming together and this simultaneity of extremes happening in him. So yeah, it's pretty, it's pretty astounding. Hopefully that answers a little bit your question. But I can't, I can't do, I can't give you every example here, that's for sure. All right, so Jeremy Morgan asked. I was talking to an old country veterinarian who told stories about how they used to use maggots to treat wounds in cattle. Apparently they are good at cleaning the wound and removing dead bits. Yeah, this sounds like a creature associated with death and corruption being used to consume death and corruption. So what would be considered an inversion is that the symbolic structure of medicine in general or vaccines in particular, is there a better way to interpret that story? No, I think your interpretation is perfect in terms of the idea of using death against death, the idea of using an aspect of death to, to deal with another aspect of death. And so like, what would be what so an inversion of that is not. That is not that complicated. Like an inversion of that would be that it's seen, right? It seemed that the cow is there to either feed the maggots, right? That the cow, the existence of the cow is more. The existence of the maggots is more important than the cow, let's say, and that the purpose of the whole situation is so that the maggots can eat, let's say, the disease and live. Right? And so that would be an inversion. And so think about that as you wish and find your examples in reality of that kind of pattern playing itself out. All right, so Kevin Patterson says, given that intelligence and intellect dominate our competence hierarchies, what is the proper place for these faculties in the spiritual hierarchy? My guess is that it's related to the bottom of reality, under the mountain where metallurgy started. So that really depends what you mean. See, the word intellect and intelligence is a word that has lost its meaning. So the word intellect or intelligence is definitely a word that is used by Christian mystics all the time. That's what the word noose means. And so in Greek we have this idea of the intellect, the nous. And the nous is the pure spiritual faculty. You could say it is the faculty the person has to intuit reality directly and it can lead, let's say, if purified, then this intellect is capable of seeing the God, seeing the divine, the, the, the uncreated light, right? The glory of God. And so that is really what the intellect, ultimately, that is what the intellect means in the Christian tradition. Now, what you probably mean by intellect is something like reason or something like reasoning faculties. And so reasoning faculties is not the same as the intellect in the spiritual sense. The intellect is that which grasps directly. It doesn't deliberate. Right? Then lower down, in terms of reason, that's where there's deliberation. That's where there's a for and against. That's where there's action, reaction. That's where there's example, counter, example. All of these things happen in the world of, in the world of reason. And, and the world of reason is the one that is used to make things, to apply the insights down into the world. It's useful, but it's not the same as the, as the intellect. And so the. One of the ways, let's say in terms of spiritual practice, which, which might surprise people is that one of the ways to reach the intellect is actually to. To strip. The reasonable part is to snip is to strip, not to say that it's bad. But because we rely so much on reason and on deliberation and on thinking and on all of this stuff, there is an aspect of spiritual practice which is to strip that away, right, so that you can attain the direct intuition, you can see God. And so. And so that's why, for example, like if you read the Fathers, if you read the Hesychastic Fathers, right, you have to ignore your thoughts. You have to not be attached to your thoughts as you're praying. You have to let the thoughts, the logis moi, like these little thoughts, you just have to let them flow through and not, not grab onto them. And there are all these different practices which are meant to bring you into trans rational, like a meta rational, beyond the rational sphere. And like I said, it doesn't mean that rationality is bad, but that because it's so powerful, it can be an obstacle if you're not careful and you can get attached to it and think that that's all you are. So, yeah, so hopefully that helps you. So Alpha says, hi, Jonathan, I'm from France and I'd like to subtitle some of your videos in French to make them more accessible. A few months ago it was possible to do directly on YouTube, but the functionality is no longer accessible to the ordinary viewer. Nevertheless, I believe that it is possible to do it one way or another. If you're interested in me doing so. I really appreciate it, Teo. If you want to do that, that's fine, but I think you have to learn how to do it because like you said, you can't do it directly. What you would have to do is you would have to, I don't know how it worked, but you would have to translate the video using a subtitle file and then you would have to send me the file, completely done with all that, all the subtitles and the timestamps in it. So I don't know how it works, but if you have that, if you send me that, then I can go into the video and I can apply the subtitle, I can upload the subtitle file and then it'll work. So if you want to do that, I would be extremely grateful. But, but, but I don't know how it works. I just know that, that, that right now that's the only way to do it. All right, so EBE says, following on from the perspective on breathing that you explained in your video on the Jesus prayer, what, if any, connection is there to the fact that singing or speaking aloud occurs during an out Breath, should we connect these acts with dying, sleeping, sunset, etc. So no, you're close in the sense that you're right, that there's a meaning, but you shouldn't see it with dying or sleeping. You should see it as an externalization. And so there's a manner in which externalization is a form of dying in the sense that it's an emptying, right? But there's also a manner in which externalization is expression, right? It is manifestation. You can saying. And so you're right that you could say that expiring or blowing is a form of manifesting, right? And so it's like, of emptying yourself out into the world, not just in a negative way, right? So Christ, when Christ blows on his disciples, it's like he's extending himself onto them, right? So that's the same with when you speak, when you speak to somebody, you're. You're extending your intelligence into the person in front of you. And if we. And so. And if we do it together, right? So if we sing together and we sing the same thing and we sing towards God, then we become the same body. Do you see how that works? It's like because your extension is joining with the extensions of the other and is directed towards God, then we act together, right? We, we act with one mind, we act with one voice. And so it's not necessarily, it doesn't necessarily have to be understood as there is a relationship, right, between externalization and dying and sleeping and all of this. But in this case, you have to see it more in terms of the positive aspect of the body, the body as being the externalization of your. Your will or of yourself or of your being. I feel like when I answer with all these those words, I'm probably confusing people. Hopefully not. Hopefully. There are enough questions that I answer very simply and then a few questions that I answer in a way that is complicated. But I don't do it on purpose, I promise you. All right, so Dom Palermo asks, you mentioned potential discussion with the Bible Project guy, question of how the pattern of Scripture is the pattern of everything. Supposing you are primarily referring to the pattern of the Incarnation as seen as the emergence of the chair and the parable of the sower and the pattern of the flood, death, space, birth. Okay. Am I correct in presuming the main difficulty for people in drawing analogies with everyday things is that the power of sacrifice and resurrection of Christ, the divine Logos, therefore informs the essential spark foundational to the emergence of missiles and porn and idolatry if so, what say you of this problem? Is this a question of toeing the line of facts that we are not yet prepared to take in? So the power of sacrifice and resurrection of Christ, the divine lair Logos, therefore inform the essential spark foundational to the emergence of missiles and porn and idolatry. Okay, I understand. I kind of understand what you mean. I kind of understand what you mean. So the way to. I think the problem is that this is one of the reasons why I talk about monsters all the time, right? I talk about monsters all the time because that's where we are. And so it's very difficult for us to understand the pattern of the top of the mountain, but it's not difficult for us to understand the pattern of the bottom of the mountain, right? It's not difficult for us to understand the golden calf. It's not difficult for us to understand all the stuff that happens at the, at the, in the lower sphere, the thorns, the garments of skin, the, the, the, you know, all of this stuff is not difficult for us to understand because that's what we deal with. So that's one of the reasons why I actually, I actually talk about those things. And so, for example, let's say helping people understand the place of missiles and porn and idolatry could be a way to help them see that this is a pattern, right? And hopefully help them see that there's a higher aspect to this pattern, right? It does just that dark stuff. It actually points to something more. But maybe that's, that's. I don't know. Like, I don't, I don't totally understand why I. My sense of. A lot of the people who kind of see these patterns haven't yet or it's going to happen. It's just a question of time, I think. Haven't yet intuited that these are really the pattern of our, of our experience. But, but yeah, and so, but if you want to understand, like, I'm tempted to go there, this is something that will seem really weird to people, but there is an aspect of things like what you said. Let's say there is an aspect of the pornification of the world in general, right? Not just pornography proper, but let's say the pornification of the world, which is what Christ told us he was going to do or what Christ told us what was going to happen, right? One of the consequences of the Logos spreading out into the world. Imagine the light spreading out into the world. Think of it that way. So it's like the light is filling up the world and so the light filling up the world is revealing the world. And one of the things it does is it reveals all the dark stuff too, right? It reveals the mysteries. We have access to the mysteries of theosis. We. We have access to these mysteries which have been hidden from the beginning of time. But it's also at the same time exposing all the scandals, all the corruption, all the. And Christ said that that's what was going to do, right? That one of the things Christ has come to expose, the scandals. And so now that we see it happening, and now that every perversion, every dark, cold corner of the human psyche is exposed for all to see, of course we don't like that. We're not saying it's good. Christ said scandal must happen, but woe to those by whom it happens. But it's still Christ acting in the world. It's still happening. The story of Christianity is still happening. Even if we're seeing the scandal of it, we're seeing how the revelation of the world is. Is now, is now showing us the monsters, right? The monsters are the ones we see. So we just have to remember, like, just remember God in this moment and, you know, and hope that what Christ said to Peter about John, how he will, you know, if it's his will, that he remains, you know, until the end. And we hope that that's what's going to happen. All right, so Norm Grandin asks. Hi, Jonathan, thank you for all your recent videos. Your discussion with JBP was particularly touching and insightful, albeit hard to watch at times. Yeah, My question is, is there a symbolic connection between the division Cain, Abel, Jacob, Issa, Northern southern kingdoms, Right. And the split between Roman Catholic and Orthodox or even the ever increasing fracturing of denominations throughout the centuries? If one of Satan's descriptors is the scatterer and Christ gathers, is it fair to expect unification someday? Well, for sure. I mean, it is definitely fair to expect unification someday. It's right there, right? It's the heavenly Jerusalem which descends. It's an eschatological promise that one day there will be unification and there will be, you know, there will be the glory of God will rule directly in the world and all nations will be joined together. If you read the description of the New Jerusalem, it's pretty amazing. It says that in the New Jerusalem is gathered all the glory and honor of the nations. So it's like it's there in Scripture that that's the promise of the end, right? And so, yes, I think we have to be able to differentiate, let's Say the system of Antichrist or the system of the beast and the heavenly Jerusalem. And that's not that easy to do. I think it's possible, but it's not that easy to do. And hopefully that's one of the things I'm going to be able to help people do in these videos, in the next two videos that I'm doing as well. But I don't really see the split between Roman Catholic and Orthodox as related to Jacob Esau and Cain and Abel and northern southern kingdoms. I see it more in terms of Jews and Christians. That's for sure. That that story is related to Jews and Christian. That might be able to answer another one, a question that keeps coming back and that nobody for some reason seems to ever get the answer to. But the Esau or Edom in scripture and in Jewish tradition, and especially in Jewish tradition is really understood as Rome. Really understood as Rome. And so. Yeah. All right, so let's continue. All right. So Jason Gadawalt asked, what is the relationship between the apostles, St. Peter and St. John? And so there seems to be like an inner outer relationship between St. Peter and St. John. At least that's the way I understand it. There seems to be this idea that St. John is on the breast of Christ. St. John is the one that Christ loves, the one who knows the mystery, the one who talks about the unity of Christ with his Father, the unity of all us in Christ. That he really is the mystical apostle, I guess, and that St. Peter is the one who acts, is the one who is. Is, in a way, is the foundation stone, but he's also the stumbling stone. Like, he also has those two kind of weird roles. He seems to flip between one and the other. But he's more on the outside. He's more like the action, let's say. But there's an interesting thing. There's an interesting thing, and this is something that I know Jacob Russell has been thinking about for a long time. I don't know if he's ever going to write that article that he promised me or they didn't promise me, but that he suggested about the Christ, about John and Peter at the tomb and how, you know, like St. John. So I even forget now which one it is. It's horrible. But, like, one arrives first and then the other one goes in. He arrives first, but he stops and the one other one goes in. And so this is the relationship between Christ and Peter and has to do with the inside and the outside. So Bradley says that he should do that article on John And Peter. All right, go for it, Brad. All right. So Garcia says I am having trouble conceptualizing time. It seems that you have a cyclical view of history. When I hear you talk about technology and the Ark, it sounds almost linear, as if after every death or fall there is a rebirth and centering. It sounds like it all culminate in an end of history type thing, almost Hegelian. I can't help but think there's something that separates this from a Christian eschatology. And it's right in front of my face. Thanks for your time. So I don't know. I mean, definitely, I think that the time is cyclical. It's just not 100 cyclical. It's like a spiral, you could say, you know, it's kind of like that. And so there definitely is a. There definitely is like a bigger cycle. So there's are these cycles and it's kind of moving towards something, but like it's definitely cyclical because if you look at Revelation, the description of the holy city is also the Garden of Eden. It's a return to Eden. And so there is this return, but it's not just a return. It's like a return with a crown, you know, and that's something that Matthieu tries to bring about in his book, right? This idea of. Of like space crowned by time or time crowned by space, and that is like how things actually come together is that these. There's a transcending of this duality between time and space. But in a. In this. This aspect as in one becomes. Is kind of becomes the. The glory of the other is maybe the best way to say it. I don't see how else to say it. So. So yeah, so I don't know. I don't know if it's Hegelian or not. I think that it's probably not. It's probably not because it's like something, say if I talk about the idea of time crowned by space, it doesn't look like just a synthesis. There's something more. There's something more happening there. All right, so how many questions are left, man? There's a lot of questions. I told him. Mr. Pedro, when you were speaking to Dr. Peterson, I feel like we saw something akin to the foreign saving the familiar, the form of the spiritual person advising the psychologist, who would normally be the advice giver. So this suggests to me that your conversation had a very redemptive function for the world in particular, for those who paid close attention. Am I off base in seeing this pattern of ornamentation manifested here. Can you elaborate on the part of the pattern of ornamentation? I don't know if that's what's going on. I'm not sure. Definitely not ornamentation. So I'm not sure. I totally agree with the way you frame this, but I do hope that the conversation had a redemptive function, like in the sense that. I mean, I've been getting a lot of emails of people who seem to have been kind of moved and nudged closer to something more. And so I thank God for that, is all I can say. So. Hello Jonathan, I don't know if this is the best place to ask this, since your content is not merely apologetic and I really hope no one takes offense to my question. It comes from a place of sincerity and searching. So I'm a Protestant, but for the last few years I've really felt a draw to the Orthodox Church. So much so that I feel close to a point of conversion. One thing holding me back is the intercession of saints. I know perfectly well that it is not idolatry, but please tell me how it it is not inquiring of the dead as Deuteronomy speaks of. God is the God of the living. Yes, but is there further biblical support for the practice? If anyone watching or anyone else has an answer, please tell me. I don't make it to the stream as it airs, unfortunately, but I will both watch and read the chat later. Well, the answer is. The answer is pretty straightforward. And I mean, it might not be enough for you. You, but the answer is that they have eternal life. They're not dead. They're just not. That's really the. The answer. And, and so the idea is that because they're not dead, then it, then it becomes. This intercession of the saints becomes a way to show that the body is one, right? There are not there. There's only one head and one body. There are not two bodies. There isn't the body of the dead and the body of the living. There isn't the body of those still on earth and the body that is somewhere else. There's only one body and the body is an eschatological body. And so you could say something like the place from which the saints are interceding from us is something like the kingdom of God. It doesn't make total sense in terms of linear time, but the idea that the kingdom of God is already present with us and that the reality of the kingdom is the reality of the resurrection is already has inklings in our world is Something which is totally based on many of the things that Christ has said in terms of, you know, saying the kingdom of God is among you. The, you know, the, the. The idea that. That we are meant to be this body, and this body, like I said, is one. And so the idea is, it's. When you ask a saint to intercede for you, it's like you. When you ask your priest to intercede for you or ask your friend to intercede for you, you. It's only that having, let's say. Let's say, you could say something like having run the race and having made the good fight, then they become one of those who are considered to be the just. Right? And like it says in the Epistle of James, the prayer of the just is efficient. The prayer of the just has power because they embody Christ in a specific aspect of reality. And so that is also one of the reasons why we asked the saints to intercede for us is that they have shown by their life, by their works, by their. By their glory that they have embodied Christ, you know, to the extent that. That they can. And, and so they, they. They help us, you know, to participate in that whole pattern of being the body, of being raised up into Christ, you know, and being gathered together and given and given up to the Father. All of this is this kind of cycle of intercessory prayers where the saints pray for us and we pray for each other and we pray for our priests and the priest prays for us. And there's this. There's this kind of. This web of prayer which is happening all through the body of Christ, which is part of what holds it together, Right? Right. The intercession attention is how reality works, right? Reality works through attention. And so remembering the saints, naming them, asking of them to pray for us, and then praying for those that have departed, all of this and asking for the saints to pray for them. And this whole cycle is kind of like a huge web, right? Huge web of attention that is holding the body together, right? And that is that web of attention, that web of love is better. It's better to say love attention is just. Just because people aren't used to using that word. It's something maybe can surprise people a little bit to get them to think about this. But let's say the web of love is what. Also this is what will resurrect, right? This is what the resurrection is also about, or the kingdom. The resurrection into the kingdom. That's what it's also about. So hopefully that makes sense. All right. So Vic Serta asked, could you please talk about the sin of sloth? Acidia? I've been reading about the seven deadly sin, but this sin in particular is very disturbing since it seems different from the rest. Yes. And how can one overcome it? Thank you, Jonathan. So, yeah, man, I mean, the sin of acidia, that's the sin of us. Like, that's our sin, man. I would say that if there's one sin that represents the modern world is the sin of acidiya. Saint John. The Damascene. Saint John. No, Saint John of the latter. Sorry, Saint John of the latter says that it is, in a way, kind of like it's different from all the other sins. It's almost like all the sins can be. Can be kind of contained into the sin of acidiyya. So what is the sin of acidiya? What is it? I can use. Let me explain it in a way that. That is usual to the way I explain things. So maybe it can help you understand it if you've been paying attention what I'm talking about. So it's like the sin of acidity is something like the incapacity to pay attention. It's something like that, right. And so that's why it's hard to understand. If you don't kind of understand it that way, then you'll struggle to understand the descriptions of it. Because it's not just laziness, because the sin of acidiyya is also the sin of a busybody. It's the sin. So, for example, one of the descriptions of the sin of Asadiya is the monk in his cell who wants to see people, who wants to go out and talk to people. And so that's also the sin of acidiy. And like, you can imagine that someone who is sitting around and is bored, that's the sin of acidiya, who wants to see change, that's the sin of acidiyya, but also sloth in the most. In the more general sense, in the sense of laziness, of incapacity to do the things you need to do. All of that is the incapacity to pay attention. So the sin of Ashadiya can actually manifest itself as being extremely busy because you can't imagine being alone. Like you can't imagine stopping. You can't imagine, let's say, stopping in silence and prayer. And so your mind and your activity moves from one thing to the other. You always need to be distracted. Right? That's the sin of acidiyya. And so, like I said, it can manifest itself as this desire to Be constantly distracted. So the sin of acidiyya, I don't have it here, but the sin of acidiya is looking at your phone every five minutes. That's the sin of acidiya. Checking your phone is the sin of acidiya. Every time you can't help yourself to check your phone, you are manifesting acidiya, you know, every time you doom scroll Facebook, you are manifesting acidiya. Every time you. Every time you're bored and you're wondering what to watch, or you absolutely have to watch something, or you don't know what to watch because you don't know what to do, all of these are all acidiyya. So it's like the kind of overpowering fatigue that you get when you need to do something. Acidia is often called the demon of noon, the noon demon, the noonday demon, Right. And so one of the images people have of the demon of Acidiya is the guy in his late 40s, 50s, who all of a sudden leaves his wife, buys a sports car, and gets a young girlfriend. That's the sin of acidiya. It's the incapacity to hold attention. It's like, I need to be distracted, I need to change, I need a new car, I need new clothes, I need a new tv, I need. All of this is all acidiya. So it's like, if you want to understand the sin of our world, it's acidia. And what's the solution to it? You know, I mean, the fathers say it's patience, which is just really difficult for us, you know, stillness and patience, you know, a capacity to attend, capacity to pray, you know, because often a lot of these things are there to stop us from praying. So. Yeah, so good luck with that. But I'm saying, like, you notice that the examples are just streaming out of me because I am a slave of acidiyya, just like most of you as well. And I can see that. And so we need to develop discipline in prayer and discipline in solitude, the capacity to attend. All right, so Anjo Terpstra says, what is the symbolism of dividing of the garments and casting lots for the clothing in Psalm 22? So dividing of the garments has to do with the idea of losing the kingdom, right? And so the garments are divided, the kingdom is broken, the kingdom is scattered. And so you can imagine it as anything that has unity, that its body is broken, it's scattered. And so this dividing of the garments is a form of death. But the casting of lots for the clothing is a little different. Right? And so in this case, there really is this idea of the entirety of the garment, right? You see that especially in the story of Christ, where it's like the body of Christ. If you think of the garment as like, an extension of body, all right, then you have to see how fascinating it is that Christ on the cross, his garment is cast by lots. So it's like a breakdown of meaning, right? It's this. I told you about luck just before, this breakdown of meaning. This place where there isn't a coherence of causality. And then the body, through this breakdown of reason and coherence, goes to someone, and it goes to the Roman. One of the Roman soldiers. And so it's like. Yeah, that's the story of Christianity, right? The body of Christ moved outside and it's one. Like, it's one body. It's not. It doesn't. It's. That's the whole insistence on the fact that the garment is not divided because the church is one. And it's a mystery. Look, it's a mystery, dude. I'm not gonna tell you, but that's. Christians have always said that the body is one, the body is not divided. And so the church is not divided. The church is one. And so we look around and we see all these. These schisms and all this crap. And so we think, okay, so I don't. I can't. I don't know. You know, and then other people will just say that. That, you know, the whole. The body is always one, but it's just like, whatever my denomination. And so I guess that's a way to solve that problem. I don't think it totally solves it. There's something more mysterious happening, a kind of weird union of. Of opposites. I don't. I can't resolve it in reason, but there seems to be this. Yeah, that seems to be. What's going on in the history of the Church is this problem of the dividing of the garments, but also the whole, let's say the garment without a seam, which is cast and ends up being one, but given to the Romans. Right? All right. So Leo asks. I find J.K. chesterton to be the funniest and most imaginative thinker I've come across. Are you a fan, too? I am a fan of Chesterton. I haven't. Like, I haven't. I'm not an expert on Chesterton. I've read a little bit, and I've read, you know, parts and. And sections. But definitely every time I encounter Chesterton, I always find him surprising and witty. So Christian Sakura says, I've heard people like Tom Holland and Jordan Peterson struggle with the idea of the Christ event being the center of history, usually pointing as things at things so far away from him, like the dinosaurs or other solar system, that it could never be relevant to those things. At the same time, they seem to accept the permeating presence of hierarchy everywhere. Could you make a convincing argument from a hierarchy of moments or events in which Christ at the top and present all thought out it. All thought out it. In which Christ at the top and present all thought out it. I'm sorry, I don't understand your phrasing. I think CS Lewis tried to do this in his mystical dance at the end of Perelandra, but it's hard to translate out of its poetic language. Okay, so this is, this is really. It's difficult, it's difficult to explain this to someone, let's say this type of person. But it has to do with what I said before in terms of the union of extremes in Christ. And it also has to do with the revelation on the cross, the revelation that the lamb on the altar is that there. Okay, so it has to do with the fact that Christians, we now put the altar in the holy of holies, that there is a mystery which is shown in Christianity, which is that all reality is based on sacrifice. And, but the sacrifice that Christ offers is like all the sacrifices together. This is something. By the way, if you listen, I'm just going to keep plugging this podcast non stop, but if you listen to the Lord of Spirits podcast, Father Stephen and Father Andrew did one on the Atonement, which was amazing, where they talk about the two extremes of Yom Kippur, the two extremes of the Day of Atonement, which is this, this like goat going out to the edge of the world. And then this goat used to, to sanctify the holy place. Right? These two extremes. And, and what Father Stephen shows, which is totally right, is that Christ is both goats. He's both at the same time. And so it's hard because it's like there's so much, there's so much ignorance. There's so much ignorance now. And, and I wonder sometimes if it's not. If it's not a function of Christ himself. Like if, if Christ also didn't blind us or blind, blind some aspect of us to the mystery that he was revealing to us. And so we can't totally see all of it. We get these, we get these little parts of it, we get these sparks, we see these lights, but we, you know, it's like, it's this everlasting revelation where you constantly are like, oh, wait a minute. It's like he has all these aspects into it. So I see, for example, like, I have some glimpse of how Christ unites all these opposites. But then I know that there are some things I'm still missing. I know for sure. And so, you know, so I think it's very difficult to. It's very difficult to explain it, you know, and it's mostly what it's doing. Maybe if you can notice what it's doing, you notice what Christ is doing in the world. And if you can understand, for example, that Christ contains Antichrist. Like, even that. Like, if you can understand how Christ in his own story. So, like, what other character? For example? Like, so I don't know, maybe you can find one in the story. It's like, what other story is there? A character who chooses his own betrayer and rides that story out. Like, rides out being betrayed from within and then coming to the end of that. Right? And so it's like the idea that Christ prophesizes his own demise in terms of his own death, and he chose Judas. But then you can see that as a cosmic scale. So you can see that the decline of Christianity is part of the pattern. And I've said this many times before, it's like atheism could just come out of Christianity. It couldn't come out of anything else. Like this mass atheism, which comes and rises up and then destroys Christianity is part of the story. It's part of the non duality of the story which Christ is revealing. This is what makes him the center of everything, is that he also contains his own dissolution. It's like, what the heck, man? That story, I can't get over it. All right, okay. I need to keep going because I'm never gonna end this. All right, so AJ says, hey, Jonathan, I hope all is well. I'm having a hard time understanding the concept of the margin in respect to theosis. Would you say that sin is the margin in terms of human behavior? Because if so, Jesus told us to be perfect, right? Things like the garments of skin were revealed to have had a proper place in creation all along. But I don't see how this can be true of sin. I hope that makes sense. So, yes. Well, there's a difference between sin and death, which is very important, but there's also a reality which is that Christ became sin. You make sense of that one. Just make sense of that one. Christ became sin too, for us. And Christ turns That into glory, he turns sin, he turns death into glory. And that's the role of the margin. The margin is glory. I think I've said this several times. Like, if you. If you listen to my talk on. On Saint Ephrem the Syrian, I explain it, like, even in terms of. Of the word, like the garments of light. In scripture, the idea of the garments of light comes from the text which talks about the garments of skin. That's where it originates. So the garments of skin and the garments of light are made of the same stuff and not the same in the sense that that which is glory falls into this course, into this course, death. But then that which is death can then be turned back into glory. So you think of it of like your extensions. And so it's like your extensions can be dead, but they can also be your light. The way that you affect the world, right? The way that you. That you interact with, the way that you overflow into reality. Okay? And so that's the secret of the margin. The secret of the margin is that it can be turned into glory. And so it doesn't mean that marginal things are good in themselves. All these monsters, all these dark things, all these, these. These chaotic things. And that's not what I'm saying. Obviously not. Right. The garments of skin are the garments of skin. But there is. There is. There is a mystery, like I said, that the crown of thorns becomes a crown of glory. So, yeah, so Ron Wood says, what is the symbolic significance of depicting Christ's hair as long? With the language of iconography, is it possible, parallel to that of Samson's hair length? Perhaps it's long, because shorter hair length could be seen as nakedness in a way. I mean, you're right. It does have to do with Samson in the sense that Christ is described as being a Nazarite. Like, he's. He's described it. He's described as being a Nazarene. But I think that also is related to being a Nazarite in the sense that the tradition is that he was. He. He was dedicated, like, dedicated to God, just like the Nazarites in. In the. In scripture. And so, yeah, so I think I said the opposite. So then. So in. In the scripture, those that had made a Nazarene vow, or Nazareth Nazarite or Nazarene, they. They would keep their hair long and not cut their beard. And so I think that's why Christ is represented that way. All right, so Pod Jamal asked. Hi, Jonathan. I've heard you say that contrary to the popular and modern Belief Christians do not have a linear view of time. Is there in Christianity something like the four ages described in Hinduism? Do you think the idea of cycles of time in his room are in Hinduism are applicable in any way into a Christian worldview? Thank you for your work, as always. I think there's something of that. It's not the same, but there is definitely in Scripture, like you really do see this succession of falls in the Old Testament for sure. And so I don't know enough about the cycles in Hinduism to kind of say. But the one thing that happens for sure in Christianity is the surprise, right? It's the surprise of the New Jerusalem. And so in a way, it's as if there's a fall, but there's a covering of the fall every time. And so Christ becomes this covering of this fall. And like I said, he changes the fall into something else. He kind of changes death into glory. So in this last image of the New Jerusalem as the finality of everything really doesn't just. It's not just like the end, like the, the, the, the cycle ends and then it's restarted in like a seed form, you could say, which is something that you, that you can imagine in terms of a succession of cycles, but it's rather that the cycle ends and then what comes from above, what comes down is a resolution of the whole cycle. It's like a, it's like a synthesis of everything with the city on the outside and, and, you know, on this mountain with the city and then the tree and the rivers of life, you know, and so that's, that's maybe the difference or I don't know if it's a difference. I don't know enough about those cycles, but that's at least the Christian vision. All right, so. Arie Fisher. Hi, Jonathan. In wrestling with Christianity, I find myself constantly oscillating between space and time, where an identity and a level of confidence is established, only to then be thrown into question by the remainder. I'm wondering if this has to do with the problem of understanding with the mind versus the heart, as the mind works in logical categories which aren't necessarily exclusive. Therefore I was creating a remainder which comes back to bite. I don't know. I do kind of know that the level of certainty I'm looking for may not exist prior to making the commit area. Your question is very long. Just as with marriage, you don't do it because you calculated all of the wives in the world and determined the best one. Yeah, this does seems seem at odds with a lot of Christian, though, who insist that their story is the best and not just that they love it and it's compatible with them or whatever. Is that just because the religion is a higher reality than the wife and thus more qualitative? Sorry for the confusing question. I have to admit, Ari, I don't totally confuse. Understand your question. I'm confused man who sees so much value in joining the body but doesn't want to do so well, doubting it. All right, I'm not totally sure how to answer your question. There's a. There's something in your question about the idea of like a qualitative jump, you know, in the sense that something isn't made of all its parts. Because if you, if that's how you see it, then that's also how you end up with the. Like, let's say the. The problem of the remainder is. Is more problematic if you don't make that qualitative jump. But if you make a qualitative jump which is like this jump up in terms of hierarchy of being, then maybe that can help you. So I'm not sure if what I'm saying helps you. It's like you said, it's like you don't get married because you compare to all the wives. And then you've made all these calculations. Then you make. It's like you get married because you love or that you. You say that one. And so it's like that pointing that, choosing that, selecting. That's different. That's. It's this gestalt, right? This coming together and it. That has more to do with logos or with this capacity for things to kind of come together. And so hopefully that helps. And so it also has to do with. There's something about the way you look at the world too. And so there's something about how. How the Fathers will talk about how you need to not look at other people's sins. You need to not attend to other people's sins. And by not attending to other people's sins, there's something about the communion which will become more real in the sense that. I think I've talked about this before, because a person is made of an interminable amount of facts and an indefinite amount of realities that are kind of coming together. If you attend to the good things in the person, like if you attend to the good that that person has the image of Christ in them rather than all the foibles that surround it, then you are actually participating in making that being become that. Because it's subtle, but it's like as they interact with you and they see in your eyes how you see them or how you. You portray them, then they're called by that. They're called by that perception that you are having on them. There's a. There's like a. There's a shaping of reality which is happening. Happening as we love each other and we don't look at each other's foibles is we're moving towards. We're moving towards this image of Christ in all of us. And so maybe that's also about going in. Like, I'm not saying you have to avoid when people do horrible things like, like, especially if there's, if people. If there's really evil being done. But I'm talking about the little foibles and all these things, these kind of. These little imperfections, these annoying things that people do and say. So, yeah, hopefully that helps. Okay, so, JL There's a reason when discussing symbolism where all we are drawn to using analogies to furniture, also cutlery and kitchenware to help us for the point. Why is that? Is it that furniture is art that is mostly completely utilized in a world where everything else is monstrous, gratuitous, or decoupled from its original use? What is the symbolism of furniture? Why in almost every language other than English, the word for furniture is cognate to something like movables. Can you please tell my mom that you're not part of the intellectual dark web and that the intellectual dark web is run its course? So I can start by that I am not part of the intellectual dark web. I've never said that I was part of. Of the intellectual dark web. I never talk about the intellectual dark web. And the only time that I've explicitly really referenced them is on Twitter. I said that I have never considered myself part of this. This conglomeration of intellectuals. And as you said, it's over anyways. It was never something which was going to hold together because, you know, it was just not. It was just not. It was just not coherent. So. So hopefully that helps. Well, I think the reason why we talk about furniture or tools is because they're so close to us, like they're not us, but because they're caused by us, then we can see their being in a different way than we can see things in nature because we can more easily see their purpose. So I think things in the world also have purposes, but I think it's easier to. It's easier when I talk about beings that have human purposes because you can notice how intelligent Forms reality more easily when you talk about chairs and tools and cups and all these things, because they're extensions of human intelligence into the world more, more clearly, let's say. So Stu Gillespie Cook says, cats are girls, dogs are boys. Discuss. I'm not going to discuss that, Stu. I'm sorry. Shari Longoria. Jonathan, Hope you're well. I've been struggling to fully understand what it means that God spoke the world into being by using the word to create everything. As someone who is not very intellectually sophisticated and also infected with the materialistic worldview, how can I better understand how the logos created the universe? I hope this makes sense. Thank you for all you do. So, I mean, it's not that hard to understand. And so it's like, let's use a chair or let's use a cup. Let's use a cup. All right, so a cup is a bunch of stuff, right? It's a million things. It's a million aspects. There's an indefinite amount of aspects to the cup. And so it's not a cup or whatever it is that you're seeing. This thing, this, this thing has an, has a, has an indefinite amount of potentialities to it, okay? And the only. And so what makes it be is its name. It's, it's naming. It's a cup. It has a name, it has a purpose. And therefore you're able to. It jumps out of the. Not just the chaos of the actual object, but the chaos and all the chaos in which it is joined together, right? All of this chaos. And so that is why God creates the world through word, through meaning, because meaning is that which holds things together. Without meaning, things dissipate into potentiality. They dissipate into the million, the million aspects of it. That, that, that, that, that could be. And, and it's an indefinite. And when I say that, it's like, it's not even numerable. It's like it's, it's not, it doesn't have number. It's not that, like, there are so many aspects of this. There's an indefinite amount of them. There's no limit to the amount of aspects to this, to this, to this thing. And so, so that's how I hope that helps. It's like it's, it's, it's, it's, it really is how reality works. Like, reality is held together by meaning, held together by word, by name, by purpose. So. All right, all right. There are so many super chats. All right, let's do this. Let's do this. All right. I feel spry. So Francisco Caldas asks, do you see any conflict between Neoplatonism and Christianity? Well, Francisco, I answered that question. Hope you were listening. Same again, Francisco. For five euros, you normally praise the medieval times, but why do you think the Church became so corrupt as to trigger the Protestant Reformation? And so, I mean, there are plenty of reasons. It definitely. There's. It has. It's not just about corruption, because corruption isn't. Corruption is the cause for inner Reformation. Right. And so it's like corruption causes you to want to fix the corruption, fix the problem, but it's not really the problem. If the Reformation has to do with ideas, it has to do with a reforming of the very theology and structure of the Church and the authority of the Church. And so it's more than that, and it has to do with changes that occurred in the late Middle Ages in terms of thinking and a spirit of revolution which came. You know, it's hard to pinpoint exactly where it started, but there's a spirit of. There's a contest between the Pope and the kings, especially the King of France. So there's a contest between the Pope and the King of France, and there's a search to have power on the other. So you could say that maybe it starts with the Pope overreaching, you know, onto kingship. Right. In terms of the Holy Roman Empire, overreaching onto the Holy Roman Empire, and then the King of France kind of thing. Well, it's not going to happen to me. And then trying to put his hand on the Pope and control the papacy. And so this fight in the west, this struggle between spiritual authority and temporal power, is a struggle about how reality actually works. And once it gets reversed, once the king imprisons the Pope, once the king. Once the king kills all the Templars, like all the monks that were under the authority of the Pope, then it's like things have started to topple. And once they started to topple, then you get peasant revolts and you get the other stuff from below kind of come up because you've lost your legitimacy, and so it just accelerates. And the Reformation has more to do with that in terms of a refusal of the authority, but then also a breakdown of just the coherence of theological understanding, which then manifests itself in terms of princes, who use this to take power and to liberate themselves from whatever they want to liberate themselves from. All right, so Zed for 699 said, should I remain Catholic or become Eastern Orthodox? I know that's a loaded question. But I'd appreciate your insight, any insights you can offer. Thanks, Jonathan. I mean, become Orthodox. Like, I could just show you the me. I mean, I think, you know, I don't know your story. I have no idea what you're going through. I don't know what churches are around you, like, what's available to you. And so it's difficult for me to answer that. I mean, I can just answer and tell you that I do believe that Orthodoxy has preserved the fullness of the. The fullness of the mystical vision and the metaphysical pattern which underlies Christianity. But. But there's a lot of dark stuff going on in the Orthodox Church, you know, right now. So, you know, it's not a. It's all falling apart. It's. It's just maybe. I mean, I, I didn't. I. I'm exaggerating. I don't want to go too far with that. All right. All right. So. Mtarlo 215 for $20. Have you read Camille Palagia's Sexual Personae? And if you have, what did you think of it? No, I have not. I haven't read it. I probably will at some point. Just haven't gotten to it. It's not like my priority to read it, but I probably will to kind of understand because she seems to really be at the crux and the origin of all the. All the madness in terms of gender that we're seeing happening. So it could be interesting to get a sense of because she's also reacting to it. So it's like she was the spark. She was one of the people who sparked this kind of gender revolution, but she's also reacting. So there's something interesting to understand there. And so Louis Duras says, how did the story of Samson tie into the Gospel story? So you watched my last Q and A, and I said that Samson and Christ are very close. There are so many ways. I can't go into every single aspect of the story of Samson. And so a way to understand is that Samson is like an attempted Christ that doesn't succeed. A lot of the stories in the Old Testament are kind of like that, like they're an attempted Christ that doesn't succeed. So why do I say that? Because just like Christ, Samson tries to join himself with the foreign woman. And so Christ does that too. But Christ succeeds in a way that doesn't compromise him. So you could say that Samson is trying to find honey in the dead lion. That's what Samson is trying to do, and he succeed. But Then it turns against him and then he has. His hair is taken, his extension, his strength is taken by the foreign woman, which is what Solomon warned about, which is what Solomon warns about later. That's what happened when you give yourself to the outside, is that you, you get dissipated into the outside. That's the problem of the inside and the outside. I talked about this in the last Q and A too, in terms of the story of, of, of. Of Jacob's daughter and, and Hamor and his sons. And so, so, but, but, but Samson does a bunch of stuff like he, he takes this, the, the door of the city and he brings it to the top of the hill, right? So that's what Samson does. Samson tries to join the inside together. He tries to find a way to join the periphery and the center. But he does it in an awkward, kind of almost funny way, like a kind of absurd way, whereas Christ does it in a successful way. Christ does exactly that. Christ is crucified outside the city while being declared as king. He's crucified outside the city while entering into the holy of holies. He does all of these, these, he unites these extremes together. But Samson does it, but doesn't. He just doesn't succeed. And so he kind of points to Christ and there are a whole bunch of other places where he does, he does as well. And he also. So Samson also kind of uses the power of the foreigner against the foreigner, right? That's one of the things that Samson does. So he uses the jaw of the ass to defeat his enemies, right? And so, you know, this image of, sorry, the image of Balaam who is sitting on the ass, right? So Balaam, this prophet in the Old Testament, is sitting on his donkey and he's going to curse Israel. And the donkey is moving off of this, he's moving off the road like. So the donkey is moving off the path to save him and, and the donkey ends up saving Balaam. And so this is. And he speaks, right? The donkey speaks. So the speaking donkey, the idea of using the donkey to defeat your enemy, all of this, all of this gets resolved in Jesus's story. And like when Jesus rides on the donkey and to enter into Jerusalem, that's what's going on, right? That's what's going on is that, is that he is going to join himself to Hamor, like Christ is going to join himself to Hamor in a proper way, not in an improper way, not in the way that the daughter of Hamor, that his sons raped the daughter of Jacob and then Jacob there's this whole revenge sequence that goes about, but Christ is, by dying at the hands of the Romans and the Jews and also because the Romans destroyed Jerusalem, which is a tragic thing, but it's part of the story. Then Christ nonetheless, in secret manages to climb the hierarchy, hidden and take power, and then become the one who's throned in heaven. And then the Emperor converts and Rome converts. So is that enough symbolic interpretation for you? I just straying about like seven stories together in Scripture. Hopefully that helps. All right, so bitu zui 4,5 CHF says the Catholic argument against Orthodox is you can't know which council is infallible without the Pope. And receptionism is circular logic. What say you? I, I don't know. I don't know what to answer to that. Besides that. It's, it's like, it's one of those things where you could say the same, like the same thing is that, that the circularity of the Pope declaring himself infallible. I mean, how's that not circular? How is one circular but not the other? I don't, I don't know. I don't know how you, how you come to that interpretation. So. Yeah. All right, so Martha Immers says, why is Jesus crowned with thorns specifically? Is that he is cloaked in death or is it a division of the sacred inside and outside? So I've talked about this several times. It has to do with taking the result of the fall, which is thorns. Right. God said when you leave the garden, you will face thorns and then turning that into glory. He's turning death into glory. So he's making the result of the fall into his crown. And that's also why, that's also why Rome converts, guys. It's the same thing. The donkey, right? So the donkey converts. It's the impure. He turns the impure into his glory. That's what Christ does. All right, so Stephen Anderson for 1270 USD, what is your opinion on stained glass icons? I like stained glass images in their, in their proper place. They look weird and they look weird definitely in, in, in Orthodox churches where all the walls are painted and where you have, or you have like mosaics. I feel like the stained glass doesn't work there because the color is coming from the walls. And so if you're going to have stained glass, you shouldn't have like painted walls because then the images and the colors coming from the glass. But I mean, yeah, those, those, those windows at Chartres, you know, or at Notre Dame where all the great Gothic, French Gothic cathedrals Especially are just completely hard. You could spend your life looking at those and, and interpreting, you know, the, the iconography there. So Isaac Cheetham for $10 says, hi, Jonathan. I had never heard of theosis before, but the tradition came up under taught victory over sin and attaining divine nature while on earth. Have you heard this language before? Cheers. I mean, I don't know. Yeah, obviously theosis is participation. It's not attaining divine nature, which is not really possible. Or like participation, divine nature. Participation is the key, right? We become God by participation in the life of God. God. And so, yes, it does involve. It involves an aspect which is beyond even our own virtue in the sense that by participating in the sacraments, by taking communion, by being involved in the love, this mesh of love in the church that I talked about, then we are already undergoing theosis to a certain extent, but then it ends up being crowned in this victory over sin, victory over passions, victory over our distractions and our capacity to see the uncreated light or to see the glory of God and participate in that glory. So it has to do with. It does have to do with this, like, kind of coming together, right? Shedding the garments of skin the way that it's described in the. In the Fathers, and then, you know, coming into the holy of holies, entering into that secret place. It's a transformation of the person. It's not just a moral change. It's not just a forensic declaration. It's an actual transformation of the person and all, all their thoughts, their being, their, you know, their sense of themselves into. Into the person of God, into the. Into the life of the Trinity. You could say, all right, so Brian York, for $5, says the new Testament Epistle seems like a commentary on the symbolic gospels. Is this right? If so, why do the Gospels need commentary? Can they not stand alone? I mean, why do they need commentary? Can they not stand alone? I understand what you're saying, but that's the wrong way of understanding reality. It's like, you could say, I could go one more. I could say, why do we need the Gospels? Can't we just have Christ? Why do we need four Gospels? Couldn't we just have the direct words of Christ in one thing? Why do we need four? And so it's like the reason why we not only need or not need, why we rejoice in the commentary and why we rejoice in the commentary of the commentaries. That is, the fathers commenting on the commentary and the Gospels and then other fathers commenting on those fathers who are commenting on the Gospel. And the, and you know, and the Old Testament and all of this commenting, let's say, and this, this participation in each other's works is part of what the church is in the sense that it is this, this, this joyful multiplicity. Right. It's not like there's something like to imply, for example, like why does the gospel need the commentary? It really is a misunderstanding. What is this fullness that Christ is calling us into and wanting to see it like also in a puritan way, right, where it's only just about removing the garments of skin rather than thinking that, yes, there is an aspect of that, but there's also this idea that Christ fills up the saints, fills up the world and fills up, you know, fills things up. And so, yeah. All right, so Mike, Mike for 279 CD says, I live in Darval. Wish we could meet. I mean, maybe after Covid, you know, it's like, for sure, like our church has started again. And so I've been going pretty regularly to church and now because it was only 10 people, so I was going like every other week, but now that it's up now we're allowed to be more, then I'll probably be there a lot. And so if you guys want to go to St. Benoit de Nursy, which is my parish, and see an orthodox liturgy, but you have to reserve. That's complicated. So I probably shouldn't say that because you're supposed to reserve your place. So sorry about that. But anyways, once, hopefully if this Covid thing ever ends, then you can always come to church and I'll be happy to greet you in Montreal. All right, so Carlos Vaga for 499 USD says, thanks, Jonathan, for all the content you bring. You seem like you're on top of things all the time. Any advice on overcoming the spiritual sin of Acidiya? And so I think I answered that. Didn't I answer that about acidia? I mean, I would say for sure, at least being aware of it is important and distinguish and kind of recognizing in us that feeling, like irascible feeling like, like you need to change, like you need to change the channel, you know, like you need to, to, to. To move on to the next thing, to just be aware of it and maybe kind of take a moment of stillness and for sure developing a, a, a a practice of prayer. For sure, that's. That helps. That's for sure. All right, so Brandon Samuel 4.5usd said Jordan Peterson talks about a triad of culture and nature mediated by the individual. Is this a microcosm of the pattern of heaven, earth and man. Yeah, that's a good. It's not. It's not a bad way to understand that. If you understand culture as, let's say, the patterns of how society exists together and nature as this potentiality. And then man. Yeah, that's not bad. All right, guys, I probably need to end this. All right, all right. I'm going to skip to two because it's getting way too late. So the golden thread for 25. Sorry, for those that I have to skip the golden thread for 25 USD. David Kaylee has a great book out on Ivan Ilich, who he covered on his CBC radio show. Ideas about life as an idol and the corruption of Christianity, especially through its relationship to images, are worthy of an interview. I mean, yeah, I guess I could see that. I don't know about that. I probably would obviously disagree with that. All right, so Isaiah for $5 USD says, can you have Jay Dyer on your channel? Man, that's a big question. It's like, right now, I would say Jay and I, I think we're on good terms. At least I'm on good terms with him. I don't have a problem with him. And, you know, I think that. I think that I kind of thank God for all the things that he's doing. I'm seeing people convert, and I'm seeing that he really has. He. He really has a voice in a certain, let's say, area of the Internet or an area of culture. And so I really appreciate that. And. And I. Like I said, I thank God for that. And once in a while, like, I'll drop him a note if I see something I find interesting. Like, I'll share his tweets once in a while as well. But at the same time, like, I'm not. I don't know. Like, I don't. We still did have this massive thing, and he. And. And so I. It's like. It's like I don't. I haven't. I don't know. It's. For me, it's just kind of there. And I'm. I'm happy for what he's doing, and I'm happy to see people kind of talk about Christianity, but I also don't have the same approach as him. And the way that I talk about the faith is very different. Like, he's more polemical and looking at very technical questions of. Of. Of theology, which is not. I don't do that. And so. And even some of the things that he talks about to be Honest, I don't totally understand. Like, I'm not going to hide it there. I think he really does have a grasp on very technical aspects of trinitarian theology and, you know, the distinction between nature and energies and stuff. And so, and so I'm not sure, like, I don't know, it's like, I just, I'm not sure that it would be that our worlds need to really fit together. Like in terms of YouTube, I think that in prayer, like I pray for him and I pray for the people that he talks to that they come to Christ. But maybe I always had this idea that it's going to happen one day, but I'm not in a hurry, let's say, because things did get intense between us and it's fine now, but it doesn't necessarily mean that we have to, necessarily have to kind of to come together on YouTube, you know, I don't know. I'm sure that. And we'll see, like, just me saying that, let's see what happens. Like, let's see what happens with a lot of the people following him. Like if it's going to bring about what it's going to bring about, let's just even watch right now and watch what's going to come out of just what I said now and see what happens. So. All right, guys. So I think, I think I have to stop because it's like 11:30. So sorry for the few people that I missed in the super chats. Thank you for your time, everybody. Thank you for, for your attention and. Yeah, and pay attention. If people who are interested in learning icon carving, like I said, it's coming out probably next week. You'll, you'll see me. I might do a, like a live stream of me carving, wood carving and then talk about what I'm going to do in the, in the training. So look forward to that, everybody. Thank you for your attention. Don't forget to sign up to my. To my website as well and I will talk to everybody next month. So bye everybody. I hope you enjoyed this episode of the Symbolic World. The Symbolic World is edited by Justin Ward and it is based on a series of videos that you can find on my YouTube channel. Jonathan Pageau's YouTube channel. You can also get involved with. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course leaving a review on itunes. Everybody knows that the best way to get the podcast out there to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon Pajo Videos as well and on SubscribeStar, all those links you can find on my website or in the show description. So thank you and I will see you soon."}
