{"episode_id":"SW - #080 - 2019-12-14 - The End of the World and the Purpose of Laughter","start":0.8,"end":961.72,"speaker":"Jonathan Pageau","text":"So hello everybody who was here yesterday. First question. So most people hopefully were here yesterday because tonight is going to be the kind of the continuation of what we talked about yesterday. For those who weren't there, I'm going to give you like a 30 second rundown. We basically talked about the Garden of Eden in the work of St. Ephrem and St. Gregor of NYSE especially, and how the Garden of Eden is this ontological hierarchy. It's a hierarchy of being, a hierarchy of virtue, hierarchy of being, and it flows out into the world. It's basically the virtues of the garden go out into the world and the farther you are from the tree, the further you are from the glory of God. And that's the fall of Adam and Eve that move out. And so that's the shape of everything. The shape of a church, the shape of Mount Sinai when Moses goes up, the shape of the tabernacle in the Old Testament of the temple. All these have the same kind of shape. But today I want to talk a little bit about what happens on the edge. And the reason why I want to talk about that is because usually when I, usually when I talk about this subject, if I talk about it with people that aren't familiar with Christianity, that aren't in the church, usually I start at the edge because in our world today, it's a lot easier to understand the edge. But with you guys, I decided to start with the middle. And then we're going to move out and I'm going to talk a little bit about what it looks like when you come to the edge of things. This is Jonathan Pageau. Welcome to the symbolic world. In order to understand it, we need to. I'm going to revisit the story just a little bit, revisit the basic story, and I'm going to show you how it relates to other structures as well. Now, if you think again about the Garden of Eden and you think about the Fall, the way to understand it is if you understand it spatially, you have to understand the mountain going all the way. You could say down, down, down, until they reach the flood. So Adam and Eve and their descendants, there's this tumble and they. They fall. Cain and Abel, Cain kills Abel, there's another fall, and then Cain goes out, builds cities, builds weapons, and the world becomes more and more corrupted until God sends the flood. What happens before the flood? There's that strange verse in the Bible, right? The strange verse that says that the sons of God had children with the daughters of men and it produced giants, produced monsters. So on the edge of the world, we find the monsters. Now, if you think about going backwards, if you think about when the Israelites leave Egypt and they go back towards the Holy Land, a way to understand it is you can look at this story backwards. So Adam and Eve fall, they tumble, they move away from the holy place, and now they're actually going back to the holy place. So what are the things that they encounter? They encounter a flood, right? They cross the waters. And then when they come to the Holy Land, what do they encounter? Giants. You got to beat the giants. After you beat the giants, then you. Then you. They have several crossings in the story where they keep crossing these bodies of water to show you this moving back, you know, crossing these transitions and moving back towards the. Towards the Holy Land. Now, the ancients, in other cultures, in Greek culture, Roman culture, and other cultures, they understood the world pretty much exactly like that. So you have your. Usually they would have their own middle, their own center. In Greece, they had the belly button of the world, right? The Omphalos, they had this idea that they. They had the belly button of the world. And the more you moved away from the belly button, the more you had encountered things that you. That aren't like you. You start to encounter barbarians. And remember that the word barbarian most certainly probably comes from the notion of barking like a dog. So, bar, bar, bar. When you listen to someone you don't understand, you just hear noise, right? You have barbarians. And then on the edge of the world, what do you have? Monsters. Yes, thank you. On the edge of the world, you have monsters. If you look at ancient maps, you know, even medieval maps, that's how they would show it. They would show Jerusalem in the center, and then they would show the world. And on the edge of the world, there would be monsters. And monsters represented all kinds of different ways. People with their faces in their stomach, people with one foot, you know, people who. Who had dog heads and cannibals, all these. All these monsters that live on the edge of the world. Now, it's very difficult for people to think like that today, but like I said, this is just the shape of reality. This is how we encounter things. This is how everything unfolds. And so it's difficult for us to think of it in that kind of large way, but you can think about it in terms of anything. So imagine you have. I can take any object. A chair, right? You have a chair. And there's something about it that makes it a chair. There's the chairness of the chair, right? Something that Makes it that, you know, that it's a chair. So then you see different variations of chairs, right? And they will. Let's say, they'll congregate to the notion of chair. And slowly, as you move away, you could start to have. That's weird. Chairs, right? You could have a chair, maybe with three legs. Is that still a chair? Maybe. I don't know. Could be. What about a chair that doesn't have a back? Or maybe you have another category, like a couch. And then somewhere in between, there's this weird thing that you see in someone's living room and someone asked you what it was, you would say, it's a chair, it's a couch. I don't know. It's a mixture. It's a mixture between two things. You're not quite sure, you know, how it fits in terms of its category. And so that's what monsters are. Monsters are just things that don't fit in the category. Right. They're usually either too much of something, they're too big, too small, or they're a mixture with animals. Or else they have something about them which is off. Right. One leg, too many arms. You can just keep going. You can imagine they have many eyes. They have no eyes. They have whatever, like anything. You can. You can. You can continue to. There's an indefinite amount of possible monsters because there's an indefinite amount of exceptions between the chair and the couch. It would be a little bit more on this side, a little bit more on that side. And if you look at traditional monsters, if you look at a dragon, for example, in the icon on St. George, if you look carefully, you will see that a dragon is really just a mixture of different animals. Usually the dragon in the icon of St. George will have the head of a lizard. It'll have hairy legs often, and it'll have wings. And this is an animal that cannot exist. It cannot exist because it is undefined. It defies categories. Okay? And so you can understand it. That's, let's say, how the world works. And so once you understand that, then there's a lot of things about the way that traditional imagery or the way that the traditional world lays itself out. We talked. Yes, we talked yesterday about the notion of the narthex and the fact that they would put the Greek sages in the narthex. And you could say that those Greek sages are something like monsters. Monsters aren't always negative, by the way. Monster just means not sure. Not sure what it is, not sure how it fits. It's not. It's not. It's not, not properly integrated. And so you have these thinkers, Plato, we have Aristotle. And the church uses lot of the language of Plato and Aristotle. You have some fathers that say, like Saint Justin Martyr, who says that they're Christians before Christ. You have other fathers who say, what does Jerusalem have to do with Athens? Are they in, are they out? Well, they're kind of like in between. So what do we do? Put them on the edge, put them in the narthex. Neither inside nor outside. We can't totally put them outside because you put them outside, we'll have a serious problem. Because a lot of the words we use actually we take them from these people. Can't totally put them inside because obviously they weren't part of the story of the Incarnation. They didn't receive the Holy Spirit the way that we receive the Holy Spirit as we enter into the church. And so we have this buffer, right? This buffer in between. Now that buffer repeats itself at all the layers too, okay? And so, and you come into the temple, and if you come into the tabernacle and you want to go into the holy of holies, what do you see? You see a cherub. Now in Indiana Jones, when they show the cherubs on the Ark, they show these nice angels, you know, with wings. They're kind of bowed and they're very pretty. But if you read a description of a cherub in the Bible, that's a little different, right? It's a mix of an ox, a lion, an eagle, a man, and different descriptions in different parts of the different places in the text. Talks about God riding the cherub across the sky like a mount. You can imagine this creature with like the legs of an ox and the, you know, the wings of a. With wings and the head of a bull or the head of an eagle. You have this wild image of this hybrid creature that God is riding. And honestly, like, the cherub in the temple probably looked a lot more like a sphinx or like the Babylonian images you see of the bulls with the wings probably looked a lot more like that than the pretty kind of image that we, that we've come to see, especially in 19th century. Or the little babies, those little babies in the paintings. Nothing to do with cherubs. Very little to do with cherubs. There is an image of a cherub in one of the monasteries in Meteora. I think somewhere in one of the monasteries where they really do show this warrior standing with four wings and four heads, you know, this really intense figure of a defender, right? The cherub is defending the holy place. So you encounter these monsters going out. You can also encounter them in every transition in those places where it's not sure there's this little transition space. You know, then if you, if you. Once you realize that a lot of stories are going to start to make sense to you. A lot of stories that are not even in the Bible, like, why is it that a leprechaun guards a pot of gold at the end of a rainbow? Why does a garden. Why does. Why do dragons guard treasures? Why do monsters guard treasures? Because that's also part of it. They moving in or moving out, you'll find this buffer of in between. Okay? And so that's why in the west especially, that's why. What do we have on the outside of churches in the Middle Ages? We have gargoyles. I like that one. Because it looks like the Joker. You think it looks like the Joker. To understand the gargoyles, you really do have to understand the function of this intermediary space. Because the gargoyles, most of the gargoyles actually had a architectural function. They're water spouts. And so if you leave water on accumulate next to a building, what's going to happen, right? It's going to destroy the building, right? If you leave, the flood come right up to the gate, it's going to start to eat at the gate. What you do, you put a monster at the gate and then the monster chases the water away, keeps the water at bay. Okay? So a way, a way to understand it. A way to understand it is to understand it. You could understand it as a. Once you reach a certain level, you have a bunch of series of monsters, you could say, like different layers of monsters. So the first monster is, in the traditional way of understanding, the first monster is the person you don't know, right? You encounter some culture you've never met. Like, you see someone, a culture of something that you've never seen, you can't recognize them. You can't recognize them as part of your world. But behind them, there's another thing that you know even less. And behind that, there's a thing you know even less. And that keeps being represented as stranger and stranger, stranger and stranger and bigger and bigger monsters until you reach the leviathan, you know, that's at the bottom of the ocean that is there to. That could devour the world. You know, the snake, that's the snake around the world that you see in the ancient northern imagery or whatever, this final monster, right? That's at the ed. And so in The Middle Ages, for example, they would have these gargoyles on the edge of buildings, but they would also have these exceptions, these strangeness. They would also have it in manuscripts. And so the way that medieval manuscripts were set up is that in the center you would have text, and then on the outside of the text you would have ornamentation, and then you would have what we call marginalia. And marginalia is exactly that. It's bunch of strange monsters. So here is some example of medieval marginalia. And so in the. In the marginalia, there are hybrids. You saw them strange creatures, mix of animal and man. Inversions or animals. Often an animal will be riding some like, will be riding a man, or you have men fighting animals. Or you'll have, you know, this figure, the standing donkey, who's standing like a man, but is a donkey."}
{"episode_id":"SW - #080 - 2019-12-14 - The End of the World and the Purpose of Laughter","start":961.97,"end":962.17,"speaker":"Justin Ward","text":"Right."}
{"episode_id":"SW - #080 - 2019-12-14 - The End of the World and the Purpose of Laughter","start":962.17,"end":2862.97,"speaker":"Jonathan Pageau","text":"So all of these things happen on, on the edge. So on the edge of the manuscripts, on the edge of the. The church, you would have this, this marginalia. And in the marginalia, I'm not going to show you some of the images because I. I reminded myself that we were still in the temple. But there, there's in. In medieval marginalia, there's some pretty raucous city imagery. There's a lot of. There's a. There's some hint of obscenity. There's potty humor, all that stuff. Like, it's all there in the marginalia. Okay, and so there's also humor, right, that's also part of the margins. Is funny because none of you laughed when you saw that. But you have to admit that in a world, imagine in a medieval world of monks, and you open this book, and there we saw today, it was kind of funny to see that. You see this image of the Annunciation, and then under the. Under the image of the Annunciation, you have like some weird hybrid creature that's fighting another weird hybrid creature. And so it has that little. Okay, yeah. It's kind of surprising, you know, and I think, I mean, seems to me that it was supposed to somehow bring about a little bit of. A little bit of laughter. And so that's why I want to talk a little bit more about laughter. Because if I tell you a little, If I tell you about these monsters on the edge of the world and I showed this to you, it's pretty easy to understand. It's kind of intuitively makes sense. We understand it because we can have that experience. I always tell people, you can have that experience. It's harder today to have that experience in terms of Seeing something. But you can have it in terms of hearing. Because if I, as a, let's say, French, English speaker, if I hear Spanish, it's kind of familiar, right? It's not. It's not the same. It's kind of familiar. From what I know, you kind of make out some words, not everything. If I hear Russian, I don't understand the words, but I can kind of follow the rhythm, let's say, or the intentions. I get this descent. There's some. Can find some similarity. But if I hear, like Vietnamese, I don't know, it's just noise. I just hear noise. I cannot make out even the intentions in the, in the. So it is. It presents itself to me as chaos. And of course, in their experience, it's not chaos we're talking about. We're talking about this idea of this experience that we have, that we have with the world. They probably have the same experience with me. They hear me and they just hear chaos. But that is a real experience of how we encounter these layers, let's say, of knowledge and moving out towards this kind of chaotic fringe on the edge. And so laughter is part of that now. So there is a tradition. St. John Chrysostom, he has a few homilies where he goes right after laughter, and he tells us that Christ never laughed and that, that laughter. We have to be careful of laughter because it's dangerous. You know, where, where it leads us. And I remember the first time I read that, I was a bit shocked. He does go on to say that laughter is not evil in itself. Like, he, He. He's careful to. To say that, says laughter is not evil in itself. It's. It's dangerous when it takes over, right? So when you laugh uncontrollably. And so that is how we need to. At least as we look at the world moving out towards its edge. That's how we have to understand laughter. Laughter is a involuntary reaction in general. You can laugh if you want, but in general, laughter is an involuntary reaction to something, something that presents itself to you. And usually what it is, it's something which is, what do we. If you think of the basic things that we laugh at, what is. What are the. Think of not, not anything sophisticated, right? Think of the most basic things that people laugh at. What do we laugh at? What's the basic one? Falling, right? That's the first. Falling is the first thing that makes you laugh. What's the second? Accidents in general, including bodily accidents, Those are the. Those are the primary source of basic laughter. Falling and bodily Accidents, things that don't fit, things that are off, things that don't. Are upside down, you could say, right? And so it is this encounter with the edge. It's exactly that. Right on the edge are all these things that don't fit, all these things that are a little bit off. And this joining yourself with them will and will bring about that laughter. And so I think that that's probably why there is in St. John Chrysostom, for example, this desire to tell us to be careful of laughter. Because if you think of the wheel that I told you about yesterday, think of it as the. When I talked about it as being the human person, as being the soul, as being the image of the human soul. You start with the noose, then you have the soul in terms of the thoughts, the will, all of that. And then you move out towards things that become involuntary, you would say, or that go beyond your will. Your passions pull you out of yourself, they pull you away from yourself. And laughter is, you could say, the ultimate example of that, because something happens and makes you laugh and you don't totally control it. Now, I don't think there's anything. I don't think laughter is wrong, but I think it's interesting. It's very important to think about that, right? Because if you think about our world. So I forget how to pronounce his name. But Abba Poimon says that distraction is the root of all evil. Yesterday we talked about attention. We talked about remembering God. This notion of keeping attention in the heart, remembering God and laughter, is exactly that little moment of forgetting, that little moment where tumble into the outside, you could say. And if you look at the monstrous aspect or the strangeness, it presents itself at 21st, but it always is on the danger of tipping into something else, right? I always tell people, just think of clowns. Here's a question. Are clowns funny or are clowns scary? Not sure which one? Not sure. People can really tell me because they seem to be both at the same time, for some reason, they seem to kind of move into. Move into one, moving into the other. And in our cultural representations as well, they seem to kind of move in one into the other. So obviously, when you come to the ultimate edge, you get this image of the devil too. This image, especially in the west, the image of the devil is exactly that image of the strange mixture of a man with horns and a tail and hooves and all this. All this chaotic representation of a figure. I'm not going to leave it on there too long now, if you look at this edge. You could say you come to this moment of distraction, of laughter, all of that. Hopefully you can see that in general, this is pretty much where we are right now. Our society is obsessed with distraction. We are basically. Our whole world is focused on distraction, on entertainment. All our cultural forms have become entertainment. And that's really hard for people to understand that. There was a time when cultural forms were not entertainment, when folk dancing was there to bring communities together, when music was there for you to participate in, in order, you know, like we do in the liturgy. But even out in the world, it was a way for people to come together and participate in a. In a common language, in a common expression. All of this was what cultural manifestations were doing. Festivals, you know, different celebrations, all of that. That's what cultural manifestations were. We have pretty much not completely eliminated those, but we're getting very close to eliminating those. And all that is left of what we call culture is. Is entertainment, right? Movies, just the type of the music. The idea of sitting somewhere and listening to music alone, that is something that the ancients could never even have imagined. Why would you listen to music alone? Music is there to bring us together. So I want to be careful. I'm not saying. And it's important. I am not saying that there's anything wrong with any of these cultural expressions. I watch movies, I listen to music. But I do think that it's important to understand as a whole this moment in culture and to be able to speak to it, because it is this. We have come to the edge. We have come to the edge where we are obsessed with distraction. When you see something like attention deficit disorder become a disease, and, you know, even 40 years ago, 30 years ago, no one had ever heard of that, didn't even exist. And all of a sudden, everybody has attention deficit disorder. That is because we are lacking in attention. We have a social incapacity for attention. We have a social proficiency towards distraction. And everything around us is there to bring us along that road towards distraction. So the question is, how do we deal with that? How do we deal with. With the. With the upside down world? How do we deal with this world at the edge? And I think there are many ways to deal with it, but I think that it is also possible to see it through the lens of laughter a little bit. And to show you, I'm going to try to give you some examples to maybe help you see how we can get to it, because it's interesting. St. John Chrysostom, if you read his homily he has a homily in Matthew and a homily in Hebrews where he really goes after laughter. And he basically says, right, Nowhere in the Bible do people laugh. Like the only places where people laugh in the Bible is when Sarah laughs that she was told she would have a child. And so laughter is incredulity. And Christ says, woe to those that laugh or you will weep. And so he really lays it on. But I think that there is actually, there are in the Bible moments where there is laughter. And I want to show you some of those moments so that you can see how it fits in the, in the, in the system. You could say in this image, in order to understand this story, you have to understand, you could say the two sides of. I'm already going to reveal what I'm going towards, but I still have to say it or else you won't understand. You have to understand the two sides of nakedness. Okay? There are. You could say there's two removing of the garments. Talked about this idea of removing the garments. There's a removing the garments, moving towards the. Let's say moving towards the center, towards the tree, towards the garden. But there's another removing of the garments, right? Which is this peeking into the scandal, right? Seeing the scandal. That's one of the things that makes people laugh. If I show you the scandal, then that's part of the. Part of the laugh. It can also be part of the anger too. But you know, when Christ says everything will be revealed, he was also including this notion that all the scandals will be revealed as well. And so this notion of being shown to be naked, like in the story of the king, who the. The king. How do you call that story in English? The emperor with no clothes. There's an image of someone who is disrobed in a manner which exposes his stupidity, which exposes his. The fact that he is not worthy of being king. So he's being disrobed. And by the way, that is the function of the jester, right? That's always been the function of the court jester. So the court clown was there to disrobe the king a little bit to keep him humble, right? To expose some truths about him, some unfortunate truths about the king that would expose him a little bit so that he never thought that he was everything. And that was the role of the clown at the edge in general. That's maybe the positive role of all clowns. That's kind of what the positive roles of the can play is to be able to show that the emperor has no clothes to reveal the scandal. Okay, so this is the story of Christ in the garden. And this is the story, this image is, follows the same image as what I told you yesterday. The mountain, the Garden of Eden, memory, attention, it's all there. So what happens? Christ comes to the Mount of Olives and he tells his disciples to stay down there. And what does he tell them to do? Tells them to stay awake. Stay awake, stay attentive, remember. And Christ goes up on the mountain. Christ comes back down. What does he find? Finds them asleep, they've forgotten, they've lost attention and they. And sleep. If you want to get a beautiful image, what is sleep akin to in our tradition, death? So forgetting, losing attention and dying. So there they are, they're falling, right? Adam and Eve, right there, fallen at the, at the bottom of the mountain. Christ does it three times and he tells them, be attentive, stay awake, right? And they can't fall asleep. And then comes the flood, right? There comes the flood. And so the betrayer comes, the foreigners come, you know, the army comes, come to get Christ and they pull everybody and everybody scatters. But think about the wheel again, think about the wheel. Here's Christ at the scent, goes up to the top of the mountain, right? And he encounters an angel. He. He links up with the higher levels. He brings it all together, you know, and then going back down, everything scatters and everybody runs in their own direction. And in that moment, what happens in The Gospel of St. Mark, probably the text nobody likes to cite, it doesn't say who. Some people think it's St. Mark because it might be St. Mark, but Roman soldier grabs the tunic, St. Mark runs away naked. There's a joke in that story. It's a joke. I'm sorry, I hate to tell you. That's a joke, right? That is a joke. It's a little joke. In the most intense, one of the most intense moments in the entire New Testament, there's this little strange moment where someone grabs the disciples clothing and he runs out naked in the scandal of his abandoning his Lord. Okay, so you can see this structure, this pattern, okay? Now in our, in the Gospel there's also another. In the Old Testament, we see some examples of that. This example of what happens when we come to the edge and things turn upside down, right? And how does laughter participate in that? The best version is in the story of Elijah. In the story of Elijah, we have an upside down world, people of God. A king married a foreign queen. And this foreign queen brings with her foreign gods. And all of a sudden the prophets of God, they're the ones being marginalized, they're the ones being persecuted, they're the ones who have to hide in a cave. Upside down world. And Elijah, the. Thisbet. You know what thisbet means? Means the stranger. Here's this upside down world where all of a sudden the prophet of God goes to Israel, but he is. Appears as the stranger. Topsy turvy. Everything is upside down. How does Elijah deal with that? How does he manage that? He uses laughter. That's how he does it. He mocks the prophets of baal, makes fun of them because he sees how upside down everything is. And so all of a sudden, Elijah becomes the clown. Weird to think of him that way. But just imagine the scene. Imagine that scene when he's standing there with the prophets of baal, you know, and he's pouring water over his thing and he's like, oh, yeah, he's pouring water. And then the prophets BAAL are there trying to call up, call the fire and trying to get it to burn. It's not going. And Elijah just calls the fire down. And I mean, that's funny. It's a funny moment in the Bible, right? Yeah, it's a, it's a, it's a funny, It's a funny moment in the, It's a funny moment in the Bible. And that I think, is the possibility, I think, and I'm saying this with a little bit of trembling as I tell you, but I think that that possibly is the role of laughter in our time right now, in our, in our situation. And you see the same thing with some of the martyrs. You see the same thing with some of the martyrs where you, you know, this, the story of St. Lawrence. Does people know the story of St. Lawrence? St. Lawrence was tortured. Tortured. And he was put on the grill. And when they came to see that he was dead, he said, you should turn me over. That's right. That's humor. And so coming up to the edge, I think this is the place. This is something I've been thinking about for quite a long time. This is the place where possibly that laughter can be useful or can help us in this situation we are today. And if you don't see that we're living in an upside down world right now, I'm not going to explain it to you. Let someone else explain it to you. But it seems pretty sure that we are in that moment at this time. So I'm going to tell you one last story that I like a Lot. Some of you who watch my videos have heard the story. It's the story of Silence. The story of Silence is not from the Bible. It is an Arthurian romance. It's a, it's a, it's a, it's a little known Arthurian romance which is kind of. We've been rediscovered and I think it can help us understand this role. So in the story of Silence, this young woman is born in a world in the medieval world where the king has declared that women are not allowed to inherit. And so Silence, Silence's father, who wants his child to inherit, tells Silence, I'm going to raise you as a boy. So I'm going to raise you as a boy. And you have to be quiet about it. Don't tell anybody. So Silence is raised as a boy. And in the story, it's really, really fascinating because these two allegorical characters appear. There's nature and nurture. The medievals knew what they were talking about. And there's a debate between nature and nurture, whether or not Silence is acting the way that Silence is. And nature is telling Silence, this is a fraud. This is a scam. You're joking with yourself. This isn't. This is impossible. And nurture is telling Silence. No, you're doing fine. You're doing okay. Look at the way you're dressed. Look at the way you're acting. You're fine. Okay. So Silence grows up and Silence actually becomes a knight. It was a pretty valiant knight, actually, because Silence is such a valiant knight. He. I'll say he. Because in the story they actually use the male pronoun for Silence. While he's acting as a man, Silence is called to the king's court. And when Silence arrived in the King's court, the wife of the King sees Silence and becomes completely enamored with Silence and falls in love. In love, Falls in lust with Silence, tries to seduce Silence, but Silence, of course refuses the advances of the Queen. So the queen gets very angry. So what does she do? You know the story, you know the story of Joseph, right? Same story. So she tells her husband that Silas tried to rape her. And so the husband is so angry. But the problem is that Silence is such a great night and is so beloved by the court, the King doesn't know what to do, not sure how to deal with this situation. So he, the Queen says, well, there's this. There's a legend that says that Merlin has become wild. He's become a wild man. He lives out in the forest, very far away, and no one can Catch him. No man can catch him. No man is able to catch him. Only a woman could catch him. So send Silence out to get Merlin, and that way you get rid of Silence. He won't be able to accomplish the task, so he will be too ashamed to come back. Problem settled. So King sends Silence out to find Merlin in the forest. Merlin has become a total wild man. He is hairy all over his body. He lives in the forest and he eats roots and grass and he lives with the animals. Silence has to try to catch him and she sets traps for him. She. First of all, she puts. I forget the order of it. Yes. The first thing she does is she puts a jar of honey and then. No, she puts some meat out. Sorry. She puts some meat out. And so Merlin eats the meat because he gives in to his human. He wasn't eating meat. He was just eating grass until then. So he eats the meat and then she puts a jar of honey because she knows he'll be thirsty after he's eaten the meat. So he chugs this jar of honey, but obviously. And then after that she puts a jar of milk. So she takes a jar of milk, but that doesn't help. Drinking honey. Drinking milk. And then she puts a jug of wine. Chugs the wine. And then she's got him. But Merlin obviously is confused and he's like, how is it that a man could ever catch me? This has been. And then he looks at Silence and he starts to snicker. He kind of starts to snicker. And so silence like, I'm gonna bring you back. I need to bring you back to the. To the king's court. So he starts to drag Merlin back to the king's court. And on the way, they see a. They see a man whose child has died. And there's a priest who is sensing the tomb, and the man is there. And so Merlin is coming by, starts to laugh, and he's just laughing and laughing and silence. Like, this is completely unacceptable. How can you laugh as you see this. This horrible situation? And then Merlin continues. Comes to a place where there's beggars who are begging for something to eat and just begging for something to eat. And then Merlin just starts laughing and laughing and laughing. He's just laughing. And so that continues on. And they bring. They bring Merlin all the way back. There's a third one. And now, for some reason, I can't remember it, so they bring Merlin back to the castle. And then when Merlin comes in, he sees the king and he starts laughing. He just can't prevent himself. And the queen is offended, and she sends this nun that is her guardian, this nun that is with her. And the nun comes to Merlin to chastise him. And he looks at the nun and then he loses it. He's just on the ground and he can't stop. And the wife is also extremely angry. But then he laughs at the wife. So he's laughing at the king. He's laughing at silence. He's laughing at the wife, and he's laughing at this nun. And everybody is saying, what is going on? So the king tells Merlin, you have to tell us what is going on. Why is it that you laughed so much? This is completely unacceptable. First of all, why did you laugh at the. The beggars who were begging for food? And Merlin says, I laughed because they thought they had to beg for food. They thought that. That there was nothing but what they didn't know. They thought that everything was scarce. What they didn't know is that right under their feet there's a treasure that's buried there. They don't even know that the treasure is buried there. So the king sends his guards and they dig up, find the treasure. All right? So Merlin was right. Then he says, why did you laugh at that poor man who lost his son? And Merlin says, well, if the man only knew that that wasn't his son, and it was in fact the son of the priest, maybe he would have been laughing as well. So then they go and they check and they find out, and they discover that in fact, that is the exact situation. But then the question is, why did you laugh at us? Why did you laugh at all of us? And so Merlin says, well, I laughed. He laughed at himself, too. Merlin was laughing at himself. He said, I laughed at you, King. And I laughed at myself, because both of us have been tricked. And I laughed at silence. And I laughed at your wife and the nun, because there are some also that are tricking. The king says, you have to be clear. You have to tell me. You sure what you want me to tell you? So Merlin tells it. He says, first of all, he says, silence is a woman. And so, because Silent is a woman, the story about how she treated your wife is not possible. So the king is shocked, and he can't believe it. And he says, you know what else? The nun is a man. And so everything falls into place. And then silence takes on her role, takes on her position as a woman. Because the king declares that because of all this chaos, because of all this, then he. He will let women inherit and so he lets silence inherit. And it gets even better because he marries her, she becomes the queen. And of course, I won't tell you what the punishment is for the others, but it's very medieval. And so that story, to me, there are so many parallels to what is happening today. There's so many parallels about this topsy turvy world and the possibility maybe of laughter to point out the madness that we are surrounded by, point out the incongruity, the upside downness of the world. All right, and so I want to just show you one thing. Honestly, I try in my life to avoid politics, but I want to show you a tweet from someone, someone I don't even follow, right? And I want to show you the tweet, and I want to just read it and you'll see the possibilities of what we're doing. This is Matt Walsh, he's a Catholic blogger. So Matt Walsh says gender is a social contract. But I am a woman. Hear me war. But anybody can be a woman. But no uterus, no opinion. But trans women are women. But I demand women's rights. But men are women. But men are scum. But drag queens are beautiful. But appropriation is evil. So in the upside down world, in the fragmented world, what happens is that things that don't make sense don't make sense. They don't fit together. That's the whole idea of something which is a monster, something that's on the edge, something that is on the fragmented fringe. They don't fit together. All the gargoyles are different. They don't form a community of gargoyles. There's no community of gargoyles. Okay? And so as we look at the world and its, its upside downness and its madness, it is possible to show how those things don't fit together. And light, hardness, and let's say a joyful laughter can help us, because the other option is to become cynical. The other option is to become. To hide in a cave like the prophets in the story of Elijah. The other option is for us to pretend like we are not living in this mad world. And so this is just a hint. At least you can, hopefully, at least from my talk, you can understand and see the relationship between this hierarchy and the world of distraction, the world of entertainment, and also the world of. You could call it the tyranny of exceptions, the tyranny of the fragments. And that's. That's an image of the passions for our own self. Right? That's exactly what happens. We have all these things on our fringe. And when we give in to our passion, we give. We give in to the tyranny of our fringe. You could say it's a way to put it."}
{"episode_id":"SW - #080 - 2019-12-14 - The End of the World and the Purpose of Laughter","start":2865.13,"end":2930.11,"speaker":"Justin Ward","text":"I hope you enjoyed this episode of the Symbolic World. The Symbolic World is edited by Justin Ward and it is based on a series of videos that you can find on my YouTube channel, Jonathan Pageau's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course leaving a review on itunes. Everybody knows that's the best way to to get the podcast out there to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon Pageau videos as well and on subscribestar. All those links you can find on my website or in the show description. So thank you and I will see you soon."}
