{"episode_id":"SW - #125 - 2020-11-23 - Parasitic Storytelling","start":0.4,"end":834.56,"speaker":"Jonathan Pageau","text":"In several of my movie interpretation videos, I've documented the rise of propagandistic patterns in recent storytelling. The new intersectional ideal, coupled with the revolutionary patterns so common in Hollywood tropes, have merged together to create woke stories which use storytelling tools to impose an upside down pattern of reality. This happens through a desire to counteract the negative side effects of identity, such as exclusion and oppression of margins. And so, although the aims are understandable, there are inevitable side effects of going down that line. In order to fight stereotypes and traditional hierarchies, one creates characters and narratives which try to upend and counteract them. But what first looks like just counteracting them becomes mainstream and even expected. Creating stories with upside down stereotypes. So women must systematically beat up men. The exceptional must be better than the rule. The outsider better than the one inside the margin, must replace the center while remaining the margin. Things become upside down when, by social pressures and strange new taboos, these new counterintuitive stereotypes become an enforced, expected norm. This is Jonathan Peugeot. Welcome to the symbolic world. Many people have complained as they watch their favorite franchises being taken over by such practices. There are too many franchises to enumerate, from Star Wars, Men in Black, James Bond to different comic book characters video game series, the latest being the new Enola Holmes movie on Netflix. One of the complaints made by critics of these strategies is found in asking why the new intersectional thinkers don't just make up new characters and storylines rather than infiltrate and take over existing ones. By asking this, one ignores how contemporary woke activism is born out of a deliberately parasitic approach to being the activist type understands that the current narratives are in some respect, the vehicles of power and normativity. This plays out in the analogy between the human body and the body politic. And so, like a virus can destabilize the human body, so too the ideological parasite will destabilize the body politic. So although one can always, you know, openly oppose, the most powerful tool is by infecting structures and subverting power, thereby acting in complete coherence with the revolutionary worldview. This parasitic relationship is not an accident, but is the very pattern of how they think reality works and what they see as their place in the larger system. Normativity can only be subverted. It can only be deconstructed. I've discussed why postmodern thinkers see themselves as social viruses and infections, so I don't want to go into it too much here. What I mostly want to look at is how there is also a secret solution within this pattern of storytelling. We've noticed how the pattern of replacement has appeared in so many instances where the main characters represented as the normative ones are killed or humiliated, inverted or replaced. The strangest versions of this are those characters who happily cede their place to others, fitting in the intersectional worldview. So the strategy of those enacting these new story tropes is not so much for woke culture to give us new stories and characters, but to deconstruct and ultimately take over existing cultural forms and stories from the inside. If in religion we might not see a new religious figure, but rather see Christ represented as genderqueer in storytelling, we will not necessarily see a new superhero, but rather have Lady Thor replace a lazy, fat, self wallowing Thor. Just like any parasite. This pattern, of course, cannot hold, at least not for long. Just like any revolutionary approach to reality. What do you do when you win? What happens when all the superheroes and video game characters and science fiction franchises and even saints have been replaced by their woke selves? When a parasite kills its host, it can only move on to another host. But when it has devoured all the hosts and in its sight, then it will itself die. So parasitic patterns of storytelling must, by their very nature, reaffirm what they're attacking. They need their host to survive, for their story to make sense. They know they can't win without being seen as the losers. Just like the progressive thinker accuses the conservative or nationalist of othering, that is needing to identify outsiders and marginal identities in order to consolidate one's own identity through opposition to a dangerous outside, the revolutionary thinker must perpetually self other. This might seem like a paradox, but saying the revolutionary must practice a form of self othering means that the revolutionary must repeat, reenact, recast almost ritually stories and tropes which he or she or the category they're allied with is marginalized and oppressed by a system of order and identity. So they must be victims of an oppressive system. It is in their very identity that this is so. And there is even a reverse proportionality where the revolutionary voice becomes stronger as it is winning. It accelerates, perpetuates, ad nauseam, and almost hysterically, stories of oppression and marginalization. This was of course, true of communist regimes, where once the revolution has succeeded, it never led to the dissolution of the state touted by Marx, but rather led to the need of positing a constant and powerful counter revolution, always invisibly present and ready to impose the old hierarchies. And so, even as the revolutionary narrative is winning, it will nonetheless always represent itself as the victim. And so the paradox of holding the the revolutionary position is that one must constantly reposit and reenact the old order. In recent storytelling, the most successful of the new franchises have been those who manifest this pattern of replacement within their own story. So it's not just about showing an ideal world of diversity, inclusivity and celebration of the margin. One must first establish a somewhat normal body to then undermine it. So the first part of a series, the first movie, will seem to establish a somewhat traditional pattern of storytelling. But then when fans are attached to the characters, the parasite is let loose and the story is undermined. The pattern is flipped upside down, the main characters are humiliated, and so we experience the reversal in real time. This reversal is framed to act as a strange catharsis needed by Woke adherents to participate in and also partly alleviate the original sin of Woke religion. This was the case with the recent controversy around the Last of Us Part 2 video game, in which the main character from the first game is beaten to death in early stages of the game. But it was also what happened to the fans of Westworld. And it is the entire narrative arc of Stranger things, where an 80s boys club coming of age story is structured in a way to be overwhelmed and and taken over by a powerful female character. This could have been fine as a basic story, but this same pattern is repeated in micro levels of each narrative as well, ramping up towards the third season of Stranger Things, when feminine characters had taken up most significant action and relationships of power. One of the most important scenes in all of Stranger Things, one which acts as a microcosm of the whole series, is where we find the resolution of the arc of Bad boy Steve Carrington, presented as an insensitive but attractive and popular bully in the first season, the character is humiliated as the bad guy should, but he then goes through this own arc to become a more mature character. This buildup seems to be moving towards him, giving attention and entering in a relationship with his co worker Robin, but this connection is upended by intersectional considerations. Another recent example I happen to stumble upon is Netflix's Umbrella Academy, where the first season presents a story of a ragtag team of characters with positive and negative aspects and spoiler alert leads to the trope of someone destroying the world because of resentment. Yet the second season reduces all the male characters to bumbling idiots and indulges only the image of the pathetic father taking up the praise song of the oppressed classes rising up to defeat the system. Of course, the second season got much better reviews than the first, and so it is dangerous to be comforted when we see some glimmer of traditional story tropes appear. For what we should expect in the coming years are stories which establish a certain order in their opening stages, only to then undermine that order or once the story is on its way, this will be repeated in an almost liturgical fashion as woke culture spreads through society. As we watch this accelerate, the attentive person will have what some call a red pill moment and notice that the seeds of this were already planted long ago in many of the stories they once loved. And so, even as people cry for the subversive and revolutionary trope of woke ideas taking over Star wars, they will realize that the seed of this was in many respects an aspect of the story all along. Of course, the secret here, and the reason why I am going through the trouble of explaining this, is that there is also a silver lining in this. For those storytellers who are attentive, the need to recast the center as the enemy to defeat, to do it over and over means that the space of the center is always open. Because identity is inevitable and and because the stories that last are always those which manifest the pattern of the world, there are ways to recast the central figure. Once the deconstruction is finished, the margin needs the center to have something to rebel against, and in that, the smart ones on the margin will play a role in bringing it back. There are a few examples of this in history. The most infamous might be the decadent Satanic author and J.K. huysmans in the end of the 19th century, who wrote thinly veiled biographical novels about romping through degenerate Satanist circles of early modern France, only to pivot towards a conversion to Catholicism, and novels on the symbolism of Christian cathedrals, ending his life as a Benedictine oblate. There are also more modern versions in the mediocre film the Libertine, with Johnny Depp, a despicable iconoclast and libertine rides his excesses to a point where his entire life is falling apart, but ends his days converting to Christianity and defending the king. So for those watching the narratives, the story trope to look for and to engage with is the story of the return of the king, which of course happens at the end of Lord of the Rings, but more traditionally is also the resolution of the Robin Hood story, where an illegitimate and resentful king establishes a corrupt rule, only to be chased out when the Lionheart returns. More recently, this is also the resolution of the Black Panther movie where Tchallas cousin Killmonger is presented as a resentful revolutionary who wants to use power to destroy the current social structures. Although one can have sympathy for his cause and the suffering he endured, he must nonetheless die and make way for the legitimate ruler in the end. So as we see the continual ramping up of propagandistic storytelling, one must continue to pay attention to places where balance in stories appears and to those who can remember that this is our time, tell better stories. It's up to us. I know I will be trying, so I hope this was useful and thank you for your attention. I hope you enjoyed this episode of the Symbolic World. The Symbolic World is edited by Justin Ward and it is based on a series of videos that you can find on my YouTube channel, Jonathan Pageau's YouTube channel. You can also get involved There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in in the show description and so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course leaving a review on itunes. Everybody knows that's the best way to get the podcast out there to get it heard. And if you want to get involved, you can also support the podcast financially going to www.thesymbolicworld.com support or else on Patreon Pageau videos as well and on SubscribeStar, all those links you can find on my website or in the show description. So thank you and I will see you soon."}
