{"episode_id":"SW - #167 - 2021-07-24 - Frederica Mathewes-Green - How We Exist Together","start":0.4,"end":106.41,"speaker":"Jonathan Pageau","text":"So, hello, everybody. I am here with Frederica Matthews Green. Many of you probably have heard of her, have seen her. She really is a famous author. She has written several books. She is involved in many causes. She is really a light in the pro life movement. She has been involved also, just as an upstanding Christian woman that has been given ways for women and for people to see how we can live our life as Christians in the modern world. She is also very involved in ancient faith as well, has written many blogs. She's just all over the place. If you just Google her, you will see that she has done many, many things. And so I'm very happy to have her with us. We're going to talk a little bit about how it is as people that we can re engage the world with meaning, that we can kind of rediscover the shining aspect of the world, how we can do that. And I know she's got great insight about that. This is Jonathan Peugeot. Welcome to the symbolic world. Frederica, this discussion kind of started. It's almost humorous because someone pointed me to a Facebook post that you made, which was kind of like a little rant about the term re enchantment and how you didn't like that term. And it's true that we've been using that term. Like myself, Father Andrew, many people have kind of been using that term. And so I thought it was a little. It's probably a good place to start. Maybe you can tell us a little bit why it is that that word bothers you, and hopefully that'll be a springboard for a deeper discussion."}
{"episode_id":"SW - #167 - 2021-07-24 - Frederica Mathewes-Green - How We Exist Together","start":106.84,"end":170.51,"speaker":"Frederica Mathewes-Green","text":"Sure, yeah, I think it probably will be. I was just noticing that as much as I sympathize with the goal of re enchantment, and as much as I was very heartened by you saying that, it's inevitable, actually. It's reality. People have got to return to reality eventually. But I didn't like the term. I noticed I was avoiding using the term and I thought, why? So, yes, I did intend it to be a humorous, not a serious challenge. My objective was that I think the ultimate objection is it focuses on the world that needs to change, rather than we need to change. But the term re enchantment suggests that God created the world and then he enchanted it in a separate step, and that somehow it became disenchanted, and now we need to find the power somehow to re enchant it. I just question almost every step in that range there."}
{"episode_id":"SW - #167 - 2021-07-24 - Frederica Mathewes-Green - How We Exist Together","start":170.83,"end":193.05,"speaker":"Jonathan Pageau","text":"Yeah. It's almost as if. It's as if it's our role to kind of put the magic back into the world, rather than, like you said, like you suggested in the post, which is to transform our own, our own relationship with God, and that the transformation, the change in the way that we perceive the world is almost going to happen on its own, let's say, once that happens."}
{"episode_id":"SW - #167 - 2021-07-24 - Frederica Mathewes-Green - How We Exist Together","start":193.61,"end":244.79,"speaker":"Frederica Mathewes-Green","text":"Yes. I've long felt that when the time came that Christians were losing the right to speak in the public square, that we would see a resurgence of miracles. And that also would be very important for each person to know how to tell the story and of your own life in Christ and the things you've seen God do in your life. Because we need to be able to tell our story. You know, at 20 or 30 years ago, it was all about having our objective arguments in line, you know, our apologetics. We needed to be able to argue our cause logically, that time is over and we need to be humble and we need to rehearse it, give it a try, think through what would your story be? If you're giving an elevator talk to a non Christian, what story would you tell?"}
{"episode_id":"SW - #167 - 2021-07-24 - Frederica Mathewes-Green - How We Exist Together","start":245.03,"end":250.55,"speaker":"Jonathan Pageau","text":"Yeah, well, I think so. I'm going to make my pitch for the word. For the word, just to start us off and then we can go on."}
{"episode_id":"SW - #167 - 2021-07-24 - Frederica Mathewes-Green - How We Exist Together","start":250.55,"end":252.71,"speaker":"Frederica Mathewes-Green","text":"But wrong, wrong, wrong."}
{"episode_id":"SW - #167 - 2021-07-24 - Frederica Mathewes-Green - How We Exist Together","start":253.83,"end":333.89,"speaker":"Jonathan Pageau","text":"This is the pitch that I'm making. Okay. It really is in the meaning of the word, like almost the etymology of the word, which is that one of the aspects of modernity or the modern world has been to make us believe that the world doesn't have. Is not a song, that the world is not a pattern, it's not a poem, that it's kind of this weird arbitrary layout of facts that have. They're like billiard balls that hit each other and that have no meaning to them. And that meaning is actually put back on top of the world. And so in a way, the way that I kind of view the term re enchantment is almost the opposite of how you described it, which is. Is rather kind of reliving the fact that the world is actually patterned, that it is a song, it's a dance, it's a story. And that we need to dive back into stories. And the example you gave about, let's say, being capable of telling a good story, the good story of your own life, the good story of your own encounter with others and with Christ and with the saints. That's exactly what I'm talking about in a way, and not just tell it, but really kind of live the world as a story rather than, you know, this kind of Cold, arbitrary world that a lot of the. Let's say the materialists have wanted us to believe the world is. So that's my pitch for the word."}
{"episode_id":"SW - #167 - 2021-07-24 - Frederica Mathewes-Green - How We Exist Together","start":334.93,"end":365.82,"speaker":"Frederica Mathewes-Green","text":"I get now the thing about singing a song, because chant in French is literally song. So the world has been. Has a song in. Is within a song in chant. And we need to participate in that. Mostly that's what we need to do to recognize that this is reality and then find a way to sing our part in that song, to bring that hymn of worship to life in the world. Sound."}
{"episode_id":"SW - #167 - 2021-07-24 - Frederica Mathewes-Green - How We Exist Together","start":366.46,"end":438.88,"speaker":"Jonathan Pageau","text":"But I think that you're. I think that, let's say the resistance you have is appropriate in the sense of. Especially I think some of the images people were posting on the Facebook post were the best ones, which is Mickey Mouse as the sorcerer who is like enchanting the brooms and everything. And I think that's a perfect image to show the difficulty of how people tend to understand it, which is almost in really in the magical, in the bad aspect, which is that we as people have the power to impose a narrative on the world. And this is actually something that we've seen happen more and more in social media and just regular media, where there's a kind of wizard aspect where you see people trying to force a story on reality and try to make us believe things which are actually just this kind of imposed, reorganized things in an actually dishonest way to make us see a pattern forcefully. And I think that that really is the difficulty. And as Christians, we need to really discover the true pattern, the true song, which is there in the world, rather than as using human power to just kind of impose these narratives on the world. So that's kind of how I see it."}
{"episode_id":"SW - #167 - 2021-07-24 - Frederica Mathewes-Green - How We Exist Together","start":439.12,"end":484.54,"speaker":"Frederica Mathewes-Green","text":"You know, what I think is true is that the real pattern, the true pattern, is embedded in reality. And we are definitely being threatened and even coerced by stories that are not true. Like in the US the story that the whole country was founded in order to spread slavery. It's just not true. It's a heartbreaking story. Maybe you can tell. Is a story true or not? Does it create hope? Does it create joy and wonder? Does it make you love other people? Or does it make you hate them? There's some really elementary sorts of tests we can use to find out whether or not this is a true story, a true song. Yeah."}
{"episode_id":"SW - #167 - 2021-07-24 - Frederica Mathewes-Green - How We Exist Together","start":484.54,"end":531.54,"speaker":"Jonathan Pageau","text":"And also true stories have many sides that say, I've been trying to help people see that. For example, some of the great epics, you know, like the Trojan. Like the epics of the Trojan War like the Iliad, there's a way in which you can actually sympathize with all the different sides of the. Of the story, even in a conflict. Like, there's a. There isn't just this simple demonizing of. Of the other, but really a way in which. A way in which these. The different elements of the story kind of point to something bigger than what they are. And those have been always been the great stories. And the simple stories are those where it's so simple and clear, especially in the modern political narratives, like, okay, they're the bad guys. We just need to destroy them, and then everything will be fine."}
{"episode_id":"SW - #167 - 2021-07-24 - Frederica Mathewes-Green - How We Exist Together","start":532.66,"end":590.29,"speaker":"Frederica Mathewes-Green","text":"Yeah. I was going to ask you if you've seen Timothy Patitz's book, the Ethics of Beauty, and it begins with the story of the Iliad, the Odyssey. And he proposes that what used to happen is soldiers would gather and over the course of several days, someone would sing this long story to them. And it had the effect of healing trauma. That. That really was the. It was a kind of therapy to be first in the story, where there are good people and bad people, and good people do bad things sometimes and there's death. It's a very ultimate story. And hearing this beautiful song was a way to reorient themselves to a reality that had been chaotic and terrifying and to help them find that place of kind of an eternal beauty, how their own story fits into an eternal song. So I do recommend the book. It's Dr. Timothy Patiz."}
{"episode_id":"SW - #167 - 2021-07-24 - Frederica Mathewes-Green - How We Exist Together","start":590.44,"end":680.61,"speaker":"Jonathan Pageau","text":"Yes. He's been on my channel before, and we had a wonderful. We had a wonderful discussion about, you know, beauty as being really the foundation of reality. And I think in the Iliad especially, there are some scenes which do. They really do seem to do exactly that. You know, the meeting with the Trojan king to negotiate the body of his son is such an intense moment of almost. Even though it's said from. Told from the Greek side, there is this deep compassion even for your enemy, and kind of recognizing that he's still my enemy. And there's this anger and all of this is kind of going through, and there's no justification of the moral decisions that are made. It's just this participation in the difficult and painful story. And I think I agree that that would definitely be something which, if we understand it that way, that he can. That he could play a kind of healing role. And I think that's what the crucifixion is ultimately, really what that leads to. You know, when you look at our services during Holy Week, the intensity of the mourning. But Also this, this idea that we in a way are also those that crucified Christ, but that we're also mourning him, and that we also wish hope for his resurrection. All of this kind of, this jumble of pain and hope and even to a certain extent, guilt, but it's all kind of coming together towards this movement where it will be resolved in the resurrection."}
{"episode_id":"SW - #167 - 2021-07-24 - Frederica Mathewes-Green - How We Exist Together","start":681.01,"end":730.08,"speaker":"Frederica Mathewes-Green","text":"I wonder why it's so hard to tell the Christian story in a post Christian environment. Because I think what people, what non Christians expect the Christian story to be, is simplistic and sunny and artificially optimistic and that the happy ending is already is pre assumed before you begin the story in a way that is true. We do believe there's an ultimate happy ending. It's not in question. But the expectation is that Christianity is a shallow thing. And I don't really know how we, how we approach that. It is offered as a very shallow thing by, by Christians in America. I can speak for my own country. It's been simplified down to just a few words. How you, how you can be saved."}
{"episode_id":"SW - #167 - 2021-07-24 - Frederica Mathewes-Green - How We Exist Together","start":730.56,"end":781.75,"speaker":"Jonathan Pageau","text":"Yeah. And I think that participation is really the only way to experience that. You know, when you go through the services of lamentation, you know, they're long and you kind of, you get into this mode of you're tired and you're. But you're listening to these amazing songs of lamentation and then these little glimpses of call to resurrection, like kind of interspersed in the lamentations. And so you really, you really almost do feel like you're going through a morning which is leading to healing at the end. But it's not, it's not like just surfing over the pain or surfing over the trauma. It really is diving into it, but then giving these little. This like punctual hope that keeps growing and growing as we get to Holy Saturday and then finally kind of explodes into the resurrection."}
{"episode_id":"SW - #167 - 2021-07-24 - Frederica Mathewes-Green - How We Exist Together","start":782.47,"end":800.55,"speaker":"Frederica Mathewes-Green","text":"I just learned something too, from people on my Facebook group that I'd never heard this before. And I wanted to ask if you had about the crotalis, which is at that Friday night service, people would have little wooden gadgets that would make a clacking or knocking noise. A rattle."}
{"episode_id":"SW - #167 - 2021-07-24 - Frederica Mathewes-Green - How We Exist Together","start":800.79,"end":801.19,"speaker":"Jonathan Pageau","text":"Really?"}
{"episode_id":"SW - #167 - 2021-07-24 - Frederica Mathewes-Green - How We Exist Together","start":801.76,"end":815.28,"speaker":"Frederica Mathewes-Green","text":"Yeah. And they say it's because in the west you weren't allowed to ring any bells between Thursday, Thursday evening and Saturday morning. So in order to do the things that altar bells would do, they had these little placards."}
{"episode_id":"SW - #167 - 2021-07-24 - Frederica Mathewes-Green - How We Exist Together","start":815.44,"end":816.8,"speaker":"Jonathan Pageau","text":"This is on Holy Friday."}
{"episode_id":"SW - #167 - 2021-07-24 - Frederica Mathewes-Green - How We Exist Together","start":817.2,"end":862.71,"speaker":"Frederica Mathewes-Green","text":"Yeah, on Holy Friday. And but the thing is that kratalis is a Greek word. And so I think it was brought over from the Orthodox practice. And somebody wrote in and said he was visiting a Ukrainian Orthodox church in Canada, and they had, like, a whole box of these little wooden noisemakers that he said he thought they were probably a century old. So it's an interesting way that we bring not music, but sound. You know, we're inserting something that may not be a beautiful sound, but we're amplifying the experience through extra means, through incense, through music, through the light, everything that's going on. It's a full body experience."}
{"episode_id":"SW - #167 - 2021-07-24 - Frederica Mathewes-Green - How We Exist Together","start":863.59,"end":907.75,"speaker":"Jonathan Pageau","text":"But it could be, especially if it's on Holy Friday, it could actually be about death, because noise is usually related to death. If you think of how or the end, it's related to the end. You see it in Purim festivals, for example. These noisemakers are used in Purim, and it's a spinning noise. And it seemed it might have to do with. With a kind of the carnival aspect of the crucifixion, where. Where the crucifixion has everything in it. So there is an aspect of the crucifixion which is like the end of a world, like this end, and then this kind of moving into a new beginning at the same time that. That. That could possibly be why. But I'm really surprised to hear that. I'm actually kind of excited to know that that exists."}
{"episode_id":"SW - #167 - 2021-07-24 - Frederica Mathewes-Green - How We Exist Together","start":908.07,"end":918.88,"speaker":"Frederica Mathewes-Green","text":"Yeah. And they're very beautiful. You know, the find, they're very beautifully carved. So, yeah, it's another train of thought worth worth exploring."}
{"episode_id":"SW - #167 - 2021-07-24 - Frederica Mathewes-Green - How We Exist Together","start":919.28,"end":940.72,"speaker":"Jonathan Pageau","text":"And so a lot of your work has been, I think, about this kind of helping modern Americans, modern Christians, modern, even secular people try to plunge back into a world of meaning. And so what is some of the advice you give to people to help them reconnect to this meaningful world?"}
{"episode_id":"SW - #167 - 2021-07-24 - Frederica Mathewes-Green - How We Exist Together","start":941.29,"end":997.62,"speaker":"Frederica Mathewes-Green","text":"There's always a dilemma, and, you know, this is an orthodox Christian of wanting to offer people the small bits, you know, tradition that they are willing to take on at what hope will be a more complete journey, offering these little things that perhaps they can comprehend even before they're totally on board with everything. And yet you know that by taking a small piece out, you're giving them something artificial. I always felt that way even in my Episcopalian days. When I was in Episcopal seminary in the 70s, all of a sudden there was this new hymn. It was a very ancient hymn. It was used in the early church, and it was like it had been just rediscovered. And the hymn is Holy God, Holy, Holy, Immortal, have mercy on us. And as you know, we. We use this hymn a great deal."}
{"episode_id":"SW - #167 - 2021-07-24 - Frederica Mathewes-Green - How We Exist Together","start":997.78,"end":999.14,"speaker":"Jonathan Pageau","text":"Yeah, all the time. Every day."}
{"episode_id":"SW - #167 - 2021-07-24 - Frederica Mathewes-Green - How We Exist Together","start":1000.02,"end":1002.74,"speaker":"Frederica Mathewes-Green","text":"It's in every liturgical service and in."}
{"episode_id":"SW - #167 - 2021-07-24 - Frederica Mathewes-Green - How We Exist Together","start":1002.74,"end":1004.34,"speaker":"Jonathan Pageau","text":"Our daily, daily prayers."}
{"episode_id":"SW - #167 - 2021-07-24 - Frederica Mathewes-Green - How We Exist Together","start":1004.5,"end":1043.34,"speaker":"Frederica Mathewes-Green","text":"But at the time, I was like, wow, there's really something different about that prayer. It sounds more like a chant. It sounds more like an incantation to spin around on, enchant, incantation, as if God is present when you say these words. And my thought was, why haven't we been using this all along? If we know what the hymns and the prayers of the early church are, the visual arts of the early church, if these things are still known, why were they ever abandoned? And to bring it back in as this little wrapped up box that you can open up. Well, that was pleasant. And now we go back and we."}
{"episode_id":"SW - #167 - 2021-07-24 - Frederica Mathewes-Green - How We Exist Together","start":1043.34,"end":1112.33,"speaker":"Jonathan Pageau","text":"Move over to something else. I had the same experience once in my church, you know, God bless him. My pastor had met some Romanian Protestants who were still doing. Would still say, Christ is risen, Pascha. And then with the answer. And so he tried to get the Baptist church to do that. And it was just like this half. This half thing. And people were like, what is this thing? Like, what is going on? And so, like you said, it didn't have the kind of integrated or kind of. It ended up being a very superficial part. But what you said about invocation or incantation, I think is a very powerful insight that you have about the difference, the notion, a type of way of seeing the world, you know, this. This capacity to invoke and to, like, in the Jesus prayer, you have the same. The same movement, you know, where you kind of invoke the name and then there's this participation in, you know, in another person by kind of calling them, let's say. And this is something which is actually so intuitively right when we think about it, just for a moment, but we've completely lost these types of practices."}
{"episode_id":"SW - #167 - 2021-07-24 - Frederica Mathewes-Green - How We Exist Together","start":1112.89,"end":1135.78,"speaker":"Frederica Mathewes-Green","text":"I remember the little book by Father Roman Braga, a transcribed interview called the Interior Universe, Exploring the Interior Universe, something like that. But he said at one point a Jesuit priest asked him, how many times do I have to say the Jesus prayer before I can see the uncreated light?"}
{"episode_id":"SW - #167 - 2021-07-24 - Frederica Mathewes-Green - How We Exist Together","start":1138.82,"end":1141.78,"speaker":"Jonathan Pageau","text":"Yeah, yeah. You're missing the point there, my friend."}
{"episode_id":"SW - #167 - 2021-07-24 - Frederica Mathewes-Green - How We Exist Together","start":1142.1,"end":1145.94,"speaker":"Frederica Mathewes-Green","text":"Father Roman said. I told him, do not say that prayer anymore."}
{"episode_id":"SW - #167 - 2021-07-24 - Frederica Mathewes-Green - How We Exist Together","start":1146.5,"end":1149.54,"speaker":"Jonathan Pageau","text":"Oh, man. Going for the jugular."}
{"episode_id":"SW - #167 - 2021-07-24 - Frederica Mathewes-Green - How We Exist Together","start":1149.78,"end":1150.98,"speaker":"Frederica Mathewes-Green","text":"No, just completely."}
{"episode_id":"SW - #167 - 2021-07-24 - Frederica Mathewes-Green - How We Exist Together","start":1151.38,"end":1152.74,"speaker":"Jonathan Pageau","text":"Yeah, just stop, stop."}
{"episode_id":"SW - #167 - 2021-07-24 - Frederica Mathewes-Green - How We Exist Together","start":1152.98,"end":1154.82,"speaker":"Frederica Mathewes-Green","text":"Yeah, yeah, yeah."}
{"episode_id":"SW - #167 - 2021-07-24 - Frederica Mathewes-Green - How We Exist Together","start":1155.54,"end":1162.47,"speaker":"Jonathan Pageau","text":"He could have a software running that just says it, like automatically, and then like, it could be on a loop then like."}
{"episode_id":"SW - #167 - 2021-07-24 - Frederica Mathewes-Green - How We Exist Together","start":1162.47,"end":1191.82,"speaker":"Frederica Mathewes-Green","text":"Like prayer spinners they use. Exactly, yeah, yeah, just put it on a loop and get. Get enough up to 5,000. This is great in the minute now, you know, But I thought too. I've been thinking a lot about the way education teaches us to deal in abstractions. And kind of from early childhood, we are taught to think in abstract terms. I've been reading this. Are you familiar with this book, Cognitive Development?"}
{"episode_id":"SW - #167 - 2021-07-24 - Frederica Mathewes-Green - How We Exist Together","start":1192.14,"end":1192.62,"speaker":"Jonathan Pageau","text":"Nope."}
{"episode_id":"SW - #167 - 2021-07-24 - Frederica Mathewes-Green - How We Exist Together","start":1192.62,"end":1324.62,"speaker":"Frederica Mathewes-Green","text":"Or how about. This is the predecessor for many people. Orality and Literacy by Walter Ong. This is interesting because it's the results of the work of a neuropsychologist. Communist Soviet neuropsychologist in the 1930s. So it's like. But he went to these little towns in Uzbekistan and Kazakhstan, and he interviewed people who were. It was like a spectrum. Some of them had begun to become literate and most had not. And some were high in the social status, some were low. He just interviewed a lot of people and asked them questions. And when he said, I was going to, he was going to asked them. He showed them abstract images. Just a circle, a square, a triangle. Asked what they were. And those who had a little bit of education would say, that's a circle, that's a square, that's a triangle. The people who were illiterate would say, that's a mirror, that's a house, that's the moon, that's a stirrup. They recognized them as friends, in a sense, as things they already knew, as things that were part of the story of their lives. That they are participating in a story with all these other people, and they are enmeshed in all these touchable, tangible things around them. It seemed to me. It did not seem that way to the author, Al Julia. It did not seem to him that this was a good thing. Okay, we have to train them so they'll think logically and abstractly. And it intrigued me how he missed that they were capable of using abstract, categorical thinking. He would show them four images. There's a saw, a hatchet, a hammer and a log. And he'd say, which one doesn't belong? And of course, the right answer to say, the log doesn't belong. Nobody would say that. They would all say, you have to have the log or there's nothing for the saw and the hammer to do, to work on."}
{"episode_id":"SW - #167 - 2021-07-24 - Frederica Mathewes-Green - How We Exist Together","start":1324.62,"end":1325.42,"speaker":"Jonathan Pageau","text":"That's hilarious."}
{"episode_id":"SW - #167 - 2021-07-24 - Frederica Mathewes-Green - How We Exist Together","start":1326.14,"end":1433.86,"speaker":"Frederica Mathewes-Green","text":"The log is part of the story. And we'd say, a house and a wheelbarrow and a tree and a bird. The bird is the only one that's a living animal. They say, no, you need the bird. The bird will make a nest in the tree and it will be next to the house. Look, it's next to the house. And he will sing and People in the house will be happy. They just really resisted reducing things to abstraction. And I think maybe that's the sickness that we have. And one more thing, as he gets further along, he has like nine stages. He takes them through. One of the last things he does is he says, tell me about yourself. What do you like? What kind of a person? Some people are angry, some people are happy. What kind of a person are you? And they would resist that. And they would say, you have to ask the people who know me, how can I know my own heart? But they know me. They can tell you what I'm like. I think the sense of being enmeshed in a story, in a world where there are people who know you better than you know yourself, you don't define yourself, you don't make up your own profile. It is the circle of others around you who really know you. I think this is what people are hungry for, but they don't know it. And we are so heavily conditioned to think in terms of abstractions. One of them was a spectacle, a drinking glass, a water pitcher. And what was the last one? I don't remember. There were one of them that just didn't fit. And the man said, you can buy them all in a shop. So, you know, he was capable of thinking in abstract terms. But. Yeah, but it was real life that mattered."}
{"episode_id":"SW - #167 - 2021-07-24 - Frederica Mathewes-Green - How We Exist Together","start":1433.94,"end":1466.41,"speaker":"Jonathan Pageau","text":"Yeah, they didn't. They were. They tended, when presented with a series of things, they tended rather than try to find the excluded one, tried to web, to weave them together into a story. They actually tried to see how they communed with each other rather than the opposite. Which is, which is one of the diseases of the modern world. Like we, we understand health through disease. We understand things through their exceptions, things through that we try to. We almost have like an upside down way of understanding the world where."}
{"episode_id":"SW - #167 - 2021-07-24 - Frederica Mathewes-Green - How We Exist Together","start":1468.25,"end":1468.57,"speaker":"Frederica Mathewes-Green","text":"We."}
{"episode_id":"SW - #167 - 2021-07-24 - Frederica Mathewes-Green - How We Exist Together","start":1468.57,"end":1517.9,"speaker":"Jonathan Pageau","text":"Look at things that don't work in order to understand things that work. And that's how we kind of. We tend to analyze reality. And in terms of this idea of self naming, this is. If there's any disease that we have, it's self naming. The whole individual idea of, you know, and this, we kind of have a caricature of the will to power right now in our society where people can just declare themselves to be whatever they fancy themselves to be and not understand that your identity is actually, like you said, is supposed to be enmeshed within a network of human relations. And if it's not, then whatever identity you kind of self proclaim is going to make you miserable no matter what it Is because we're meant for communion. We're not meant to be these splendid individuals in isolation and kind of declaring our, our identity to others."}
{"episode_id":"SW - #167 - 2021-07-24 - Frederica Mathewes-Green - How We Exist Together","start":1517.9,"end":1520.82,"speaker":"Frederica Mathewes-Green","text":"You know, the temptation of autonomy."}
{"episode_id":"SW - #167 - 2021-07-24 - Frederica Mathewes-Green - How We Exist Together","start":1521.54,"end":1541.18,"speaker":"Jonathan Pageau","text":"And it really. That's the sin. It's like, that's the sin of Satan, it's the sin of Adam. It's the sin, it's the main sin is the sin of trying to be autonomous and to kind of be on top of things and not know. It's the, it's actually, that's the, that's the first sin. And then the other sins kind of come after, you know, all the, what we tend to think as sins, you know."}
{"episode_id":"SW - #167 - 2021-07-24 - Frederica Mathewes-Green - How We Exist Together","start":1541.34,"end":1615.25,"speaker":"Frederica Mathewes-Green","text":"You know what I. One thing I noticed in giving speeches and giving talks, because I don't always talk about orthodoxy, sometimes I'm talking about social things or sex and sexuality or pro life, obviously. I noticed that there was one word, if I said it, the audience would stop breathing and they would just freeze. And after a few times I realized it was really consistent and the word was loneliness. That if I mentioned loneliness, it was like people would. And it was like they were thinking, how did she know my secret loneliness? Yeah, yeah. And you know, I'm always encouraging people, if you're young, marry young, get married at 18, 19, 20, start having kids right away. I sure opposed that when my son was 19 and got married, I thought that wasn't a good idea. Well, now they're expecting their ninth child. His wife always wanted a big family and she's got one. And it's just so much healthier than the autonomy that goes on and on and on. And you marry at 30 and then you're trying to have children at 35. And yeah, we have an artificial idea of how possible that is."}
{"episode_id":"SW - #167 - 2021-07-24 - Frederica Mathewes-Green - How We Exist Together","start":1615.25,"end":1615.85,"speaker":"Jonathan Pageau","text":"Exactly."}
{"episode_id":"SW - #167 - 2021-07-24 - Frederica Mathewes-Green - How We Exist Together","start":1616.17,"end":1657.85,"speaker":"Frederica Mathewes-Green","text":"Can be bent and always be bent to do the things we want. I think the appeal of autonomy when you're young is almost overwhelming. And perhaps it's natural to some extent you need to define yourself as separate from mother and father and you need to set up your own little home. In our modern culture where youth extends into the middle 30s, what happens is that autonomy can work very well when you're young and attractive and sexy and not fat and, you know, there's so many things you have going for you, but everybody gets older and every year a new crop of 20 year olds is rolling off their belt, you know?"}
{"episode_id":"SW - #167 - 2021-07-24 - Frederica Mathewes-Green - How We Exist Together","start":1657.85,"end":1658.53,"speaker":"Justin Ward","text":"Exactly."}
{"episode_id":"SW - #167 - 2021-07-24 - Frederica Mathewes-Green - How We Exist Together","start":1659.17,"end":1661.57,"speaker":"Frederica Mathewes-Green","text":"And you're 25 and 30 and 35."}
{"episode_id":"SW - #167 - 2021-07-24 - Frederica Mathewes-Green - How We Exist Together","start":1661.57,"end":1664.53,"speaker":"Jonathan Pageau","text":"And 40 and you're competing with them too. Yeah, exactly."}
{"episode_id":"SW - #167 - 2021-07-24 - Frederica Mathewes-Green - How We Exist Together","start":1665.25,"end":1710.85,"speaker":"Frederica Mathewes-Green","text":"So the world keeps saying, you know, be young and sexy and independent and autonomous. But they don't show us the ones who are 40 and 50 and 60 and never married and are facing perhaps in their old age, being cared for in an old people's home where the people don't take jobs there because they love old people. It's not necessarily a pleasant or even a safe place to end your life. We've seduced. Our culture, has seduced people by these image of. Images of how great it is when you're young and piggybacking, maybe on what is to some extent a natural and healthy. When you're young and covering up and hiding from us the loneliness that sets in later on."}
{"episode_id":"SW - #167 - 2021-07-24 - Frederica Mathewes-Green - How We Exist Together","start":1711.09,"end":1805.94,"speaker":"Jonathan Pageau","text":"Yeah, exactly. I think that's so right. And I see it myself, because we were of those that I married pretty young. I married at 23, but we started having children later. You know, we waited quite a while. And it's only when your 40s. You're in your 40s and you know your third child is young, and you realize that you don't have the same energy that you did and you don't have the same kind of boyishness that you did, and you think, wow, you know, this would have been like all those moments in my 20s that I barely remember. I mean, I remember them, but they don't have the vibrancy of the time that I spent with my son when he was 2. Like, they don't have that vibrancy. And so, I mean, I don't say. I wouldn't say that I regret because I don't kind of, like, live that way. But I can understand why it probably would have been a better idea to really kind of consolidate that, because now our family is an amazing microcosm. Like, we love being with each other. We love spending time together. When we're at the dinner table, everything is nice and it's a nice time. But you think, oh, wait, that could have been. We could have had more of that and also longer. So anyway, so, yeah, I would encourage people to kind of break the norm and not. Don't let people seduce you thinking, oh, you're in school, you have to finish your school, you have to get your PhD and then you're 26 or whatever. That's a lie."}
{"episode_id":"SW - #167 - 2021-07-24 - Frederica Mathewes-Green - How We Exist Together","start":1807.22,"end":1811.54,"speaker":"Frederica Mathewes-Green","text":"I wrote an essay once that I titled, let's have More Teen Pregnancy."}
{"episode_id":"SW - #167 - 2021-07-24 - Frederica Mathewes-Green - How We Exist Together","start":1813.95,"end":1814.67,"speaker":"Jonathan Pageau","text":"That's amazing."}
{"episode_id":"SW - #167 - 2021-07-24 - Frederica Mathewes-Green - How We Exist Together","start":1815.23,"end":1838.59,"speaker":"Frederica Mathewes-Green","text":"I know. It was almost accepted by the New York Times. It just like, just by an inch. But it was published in National Review. But that was my thesis, that it's good to marry young and to begin having children young. But I said you have to let go of. There are three things you want and you have to let go of one of them. One is both of you are going to college at the same time."}
{"episode_id":"SW - #167 - 2021-07-24 - Frederica Mathewes-Green - How We Exist Together","start":1838.93,"end":1839.25,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #167 - 2021-07-24 - Frederica Mathewes-Green - How We Exist Together","start":1839.57,"end":1862.93,"speaker":"Frederica Mathewes-Green","text":"Another is you are living independently of your parents, might have to live in your parents basement for a while. And the third has to do with timing children that. That's. If you want to live in your own home and go to college at the same time, both in college, then what about having kids? That makes it much more difficult the way our culture is currently set up. Yeah."}
{"episode_id":"SW - #167 - 2021-07-24 - Frederica Mathewes-Green - How We Exist Together","start":1863.09,"end":1914.35,"speaker":"Jonathan Pageau","text":"And there's something. There's something about being poor which people nobody accepts. Like nobody wants to be poor, but it's actually being poor is not that bad if you accept it. I mean, I don't mean like poor in the sense you don't have anything to eat. But just being. Just living in an. We were poor for quite. I would say like now we're doing fine, but we were poor for a very long time and we just accepted it and it actually made us free. We could do a lot of things because we didn't have this thing pressing on us that we kind of need to prove to everybody that we have a new car, that we have a shiny this and a shiny that. It's actually easier to be poor in our world today than maybe it's ever been in the history of humanity. So I would say to not see that as the idea of like making all your money in your 20s and 30s. I don't see that. That's not necessary."}
{"episode_id":"SW - #167 - 2021-07-24 - Frederica Mathewes-Green - How We Exist Together","start":1914.75,"end":1986.99,"speaker":"Frederica Mathewes-Green","text":"We did that when I was 21, when we got married. That was just week out of college. And I had our first baby when I was 25. My husband was 30, 28, something like that. And we decided that we were going to live within his income as a junior pastor, which is very small, of course. And one of the decisions we made was looking up all the dietetic and nutritional information. We raised our children on powdered milk. Instead of buying a bottle of milk, we would buy powdered milk and mix it with water and big brown pitcher in the kitchen. And they grew up with that, so they accepted that. I remember we would go every week to McDonald's for lunch with my two friends and their two little daughters, the same age. When my daughter was a toddler, they would buy dinners or buy lunches for themselves and their children. And I would bring a sandwich and drink water and my daughter would have a plain hamburger and nothing else on the side. This is before Happy Meals. So it's possible. It's possible even when your friends have a lot more money, you can live within your budget."}
{"episode_id":"SW - #167 - 2021-07-24 - Frederica Mathewes-Green - How We Exist Together","start":1988.75,"end":2026.81,"speaker":"Jonathan Pageau","text":"But you have to accept it because bitterness can set in if you're not careful. And if you do it out of kind of resentment and frustration, it's not, not going to work. But if you just accept it, then it's actually quite freeing to live that way. I could never have become an icon carver if I hadn't. If both my wife and I had not decided that it was totally fine to be poor and to have an old beat up car and to, you know, not fix the windows because they should be fixed, but they can still survive for another few years. And you know, that kind of stuff, you just think, you just accept it and then, then you're free to do things that a lot of people wish they could do and then they don't."}
{"episode_id":"SW - #167 - 2021-07-24 - Frederica Mathewes-Green - How We Exist Together","start":2027.68,"end":2064.35,"speaker":"Frederica Mathewes-Green","text":"I felt like I actually got a kick out of it. I felt like I was outsmarting someone. You know, that's wonderful. Madison Avenue and all these other things and just looking and looking for the cheapest possible way to do things. And my kids got into the spirit of it. I taught them when they saw advertisements because we used to watch regular broadcast television as a family. When the advertisement came to the end, I would say, and what was the lie? Can you spot the lie? And so I train them always to look for the lie in any advertising. Where are they trying to trick you or to lure you in?"}
{"episode_id":"SW - #167 - 2021-07-24 - Frederica Mathewes-Green - How We Exist Together","start":2064.35,"end":2071.47,"speaker":"Jonathan Pageau","text":"Yeah, where they're trying to convince you that if you only you had this, then everything would be okay, would be perfect."}
{"episode_id":"SW - #167 - 2021-07-24 - Frederica Mathewes-Green - How We Exist Together","start":2072.35,"end":2169,"speaker":"Frederica Mathewes-Green","text":"So I think we're talking around the same thing over and over again. But for me, the big thing about orthodoxy is that it has that sense of being embodied and embedded and that we are part of an ancient story. And that me as an individual human, I don't matter if I'm plucked out of the context and put on another planet or something, that I am part of a community and that I try to help that community. And I get so much help from the community and from their support and their prayers. We are all embedded here altogether. I know that if I get older and I get dementia and I'm failing in other ways and I'm failing physically. I know there are people who love me, there are people who will take care of me. The next baby will be 15 grandchildren. We had three, our oldest had three, our youngest had three. But that one in the middle is, they're getting their ninth. I feel so embedded in a loving community. That I don't fear, I don't fear death. I know that I belong. And the myth of autonomy, I think, is what's breaking the heart of our fellow humans in America, many of our fellow Christians as well. When I look at the things that Orthodoxy offers, when I look at the things that converts say about what they like about Orthodoxy, it's always, I'm going to move my eyes over here because I've got a document here. I never learned how to share screens."}
{"episode_id":"SW - #167 - 2021-07-24 - Frederica Mathewes-Green - How We Exist Together","start":2169.16,"end":2170.64,"speaker":"Jonathan Pageau","text":"It's okay, I have to have a."}
{"episode_id":"SW - #167 - 2021-07-24 - Frederica Mathewes-Green - How We Exist Together","start":2170.64,"end":2216.67,"speaker":"Frederica Mathewes-Green","text":"Grandchild tell me how to do this. But the list of what people say when they become Orthodox, you're thrown in the deep end. You just have to live it. It's like they can't describe it. Direct contact, it's dynamic. You, you have to come and see firsthand, alive. Immediacy, I find that's the term I use the most. It's this quality of. It's just in your face. It's immediate. It's right there. You have to be there. Organic. Good old Warren Farha, I asked him what is the one word you'd use to describe Orthodoxy. He said, organic. Just sums up so much. Yeah, bodied. Immersion. You have to experience it. You marinate. It's active. It involves all the senses."}
{"episode_id":"SW - #167 - 2021-07-24 - Frederica Mathewes-Green - How We Exist Together","start":2216.99,"end":2284.45,"speaker":"Jonathan Pageau","text":"Yeah, but that, I think that's also, it's all these words are good to help people understand too. Like, the idea of marinating is good because we are so used to kind of immediate satisfaction that it's true that some people, you know, at first when they, they kind of come to the services, they're like, what is happening? You know, I don't know, like again and again and again and again. And they don't know like, where these prayers are going. That seems to be just like you said, thrown in the deep end where, where at first there needs, you need time to kind of soak in and, and, and kind of acclimatize and just slowly start to see the patterns. And not in a mental way, but really kind of all of a sudden starting to be inside the pattern. And at some point, sometimes you're not even thinking about it because you, you, you hear the prayers and the pair, the prayers do have a pattern. And then you know where it's going, but you're not even thinking about it. You kind of know what is happening and what is on, going, going. And then it slowly starts to, it slowly starts to become a, a background pattern to, to, to your perception. But it does, it doesn't happen immediately. You can't just like Go to a service, and all of a sudden you're like, oh, okay, I get it, I get it, I get it. I get it. Doesn't work that way."}
{"episode_id":"SW - #167 - 2021-07-24 - Frederica Mathewes-Green - How We Exist Together","start":2284.61,"end":2292.61,"speaker":"Frederica Mathewes-Green","text":"Oh, boy. Yeah. My first reaction to an orthodox service was it was weird and boring, and I want to get out of here. You know, just really."}
{"episode_id":"SW - #167 - 2021-07-24 - Frederica Mathewes-Green - How We Exist Together","start":2292.93,"end":2315.93,"speaker":"Jonathan Pageau","text":"And it's strangely formal and informal at the same time. And it looks super organized, but messy, really messy. And they're these kids crawling around, and. And it's like. It looks sometimes like the priest knows what he's doing, but sometimes it feels like no one knows what they're doing. But it's like. It's funny. It's hard to describe that to people. It's kind of strange sense of formality and informality, which is all happening at the same time."}
{"episode_id":"SW - #167 - 2021-07-24 - Frederica Mathewes-Green - How We Exist Together","start":2316.41,"end":2424.45,"speaker":"Frederica Mathewes-Green","text":"That is so true. I've tried in talking about tradition, because we're such a negative picture of what tradition means. They say, think instead about Christmas traditions. And now your Christmas traditions. You do them because you like them, because they're fulfilling somehow, and they knit the family together. You do them because they work. And the Orthodox traditions work in that sense. They have an effect. And you can't learn them all at once. That if you married into a family that has lots and lots of numbers, lots and lots of Christmas traditions, you wouldn't get it all. The first Christmas, it would take repeating. And I say, imagine they have red and green napkins that are now very faded, but they use them every year. And you might notice that last year Grandpa got a red one, but this year he got a green one. You might say, oh, you've broken your tradition. What you don't know is there's a tradition about the traditions. There's something that when you've marinated in it, you kind of know instinctively where things are little T and where things are big T. You really can't learn it except by doing it. So that's kind of the mystery about Orthodoxy. People who are in it tend to smile a lot, and they're very happy with it, but it's because they can feel it going to work on them. They can feel how it's changing them inside and making them more and more like the heroes that we have. There's so many 20th century heroes of the faith that we want to emulate and be like. It's like having baseball pictures, you know, posters on the walls of your bedroom and just wishing you could be like them. Or you want to hold the bat the way your hero holds the bat. It's a Wonderful family to be in. Yeah, you really don't realize that at first."}
{"episode_id":"SW - #167 - 2021-07-24 - Frederica Mathewes-Green - How We Exist Together","start":2424.77,"end":2493.95,"speaker":"Jonathan Pageau","text":"And there's something about the causality which is also sometimes difficult to understand, especially in our kind of psychological. Psychological psychologized world where, let's say, people are struggling with passion or struggling with the sin, is struggling with something, and they're like, well, how do I fight this? Like, how do I. How do I deal with this problem in my life? And they want to, like a direct road where they could just do these simple things and then they'll get through their problem. But in. In the kind of the orthodox tradition and faith, it's. It's like this whole process where as you improve your prayer life, as you are more involved, as you. As you remind yourself of God during the day, as you do the Jesus prayer and your little moments, all of this is working. And at some point you're like, oh, you know, that passion that I had, all of a sudden it's like it's cut in half. Or, you know that this thing that I was doing before, this bad habit, it's like, okay, it's gone. And I don't even know where I got the will to do that. It didn't come from me. It's just this. This kind of. This healing process that just kind of flows through you. So, yeah, it's difficult to describe that to modern people, because they want the solution. Like, I have a problem. Give me the pill. This is what I need to take to do this. And it doesn't work that way."}
{"episode_id":"SW - #167 - 2021-07-24 - Frederica Mathewes-Green - How We Exist Together","start":2494.75,"end":2543.11,"speaker":"Frederica Mathewes-Green","text":"Another part of that illusion, I think, is that they say people who are functioning under a high level of traditions, well, it makes you all be alike. It makes you all be little carbon copy figures. But it's actually the reverse. When they want that program that will fix them, they want something that might be useful to a million people, and they could just get in line and go through the steps and it would fix things. Orthodoxy is more radically individualistic than that. But the program that works on you is finding you at your deepest levels, at your most unique level, and it addresses you in a wholly unique way. You're not one in the line of a million people using a program. You're one in a line of one. And God knows you so much better than you know yourself."}
{"episode_id":"SW - #167 - 2021-07-24 - Frederica Mathewes-Green - How We Exist Together","start":2543.46,"end":2590.76,"speaker":"Jonathan Pageau","text":"Yeah. And because it's so. There's so much. Like, I've noticed that, like, sometimes I've noticed, for example, like, my attachment to certain saints, for example, can't completely explain it. I can't. I can't tell you why that I feel closer to this or that saint, but I can see it working in my life. Like I can see that that communion that I'm. That I'm living with is slowly changing me and transforming me and making me closer to. To in. Close to the image of Christ. And so it's like that for so many things because even the practices you can have in the church, there's so. There's so many that you. Unless you're like a monk, you know, you can't do them all. So you end up, through your discussion with your spiritual father, through all this, you end up finding something which looks like. Like you or you moving towards God. You could say something like that."}
{"episode_id":"SW - #167 - 2021-07-24 - Frederica Mathewes-Green - How We Exist Together","start":2590.76,"end":2633.36,"speaker":"Frederica Mathewes-Green","text":"Yeah. We are tiptoeing up to the question of the supernatural, which is simultaneously a very difficult thing to get across, but also something that non Christian, non believers, the nuns crave. They crave that. And that's why it's all about, are there little spells or charms you can cast on people? Are there potions? Is this a haunted house? They have a lot of. What they probably don't realize is an unhealthy attraction to the supernatural. And they don't understand that it is dangerous world. And that in Christianity you can do that safely and supernatural things do happen."}
{"episode_id":"SW - #167 - 2021-07-24 - Frederica Mathewes-Green - How We Exist Together","start":2633.68,"end":2634.16,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #167 - 2021-07-24 - Frederica Mathewes-Green - How We Exist Together","start":2634.48,"end":2672.59,"speaker":"Frederica Mathewes-Green","text":"Part of telling our story is to say, wasn't this incredible? You know, like the time that we were trying to vote on who our patron saint would be for the women's group. And St. Nina kept pushing her way over and over and over again. None of us knew who we're. She was. That one person began reading a short biography. The president of the Women's association of Sisterhood began to sob and just run with tears. And she didn't know why. She didn't even hear the story. So when we said, well, are we going to vote now? And my husband, the pastor, said, you don't get to vote."}
{"episode_id":"SW - #167 - 2021-07-24 - Frederica Mathewes-Green - How We Exist Together","start":2674.99,"end":2679.47,"speaker":"Jonathan Pageau","text":"It's pretty clear she's already said that she wants to do this, so give her the job."}
{"episode_id":"SW - #167 - 2021-07-24 - Frederica Mathewes-Green - How We Exist Together","start":2679.94,"end":2705.54,"speaker":"Frederica Mathewes-Green","text":"And so I got up to walk upstairs. I picked up one of the Sunday. This was Saturday. I picked up the Sunday bulletin and it was January 14th. It was the feast of Saint Nina. So things like that happen and you can just know. You get the awareness of when it's healthy and when it isn't. And as you are drawn on through healthy. Why do we call them supernatural? Right. What should we call that?"}
{"episode_id":"SW - #167 - 2021-07-24 - Frederica Mathewes-Green - How We Exist Together","start":2705.7,"end":2757.85,"speaker":"Jonathan Pageau","text":"Yeah, I don't like. You don't like the word re. Enchantment. I never use the word supernatural because. Because it has a. There's something about it which seems like an arbitrary thing which just kind of imposes itself on top of reality. You know, I just, I just say. I mean, I have my own way. People around what I'm doing. We say symbolism happens. Like the idea that the world is full of meaning and that this meaning is embodied in people, in persons. And so don't be surprised when the world coalesces into meaning meaning because that's actually how the world exists. And so it's not that miracles. When miracles happen, you. You shouldn't be totally surprised because the world actually exists through these patterns of meaning. And so that. So that's kind of how I say it's not. It's obviously not a traditional term, but patterns of meaning."}
{"episode_id":"SW - #167 - 2021-07-24 - Frederica Mathewes-Green - How We Exist Together","start":2757.85,"end":2758.45,"speaker":"Frederica Mathewes-Green","text":"Symbolism."}
{"episode_id":"SW - #167 - 2021-07-24 - Frederica Mathewes-Green - How We Exist Together","start":2758.53,"end":2785.7,"speaker":"Jonathan Pageau","text":"Yeah. But you could just say that miracles happen too. Like miracles happen because miracles are not arbitrary or not arbitrary things that you can't explain. They're rather the world coalescing towards meaning and showing the meaning in a bright and surprising way. It's like as if the pattern of reality appears to you in this shining manner. And so it's not at all arbitrary. It's actually the summit of meaning is when miracles happen."}
{"episode_id":"SW - #167 - 2021-07-24 - Frederica Mathewes-Green - How We Exist Together","start":2786.1,"end":2804.13,"speaker":"Frederica Mathewes-Green","text":"So enjoyable and so fun and so awe inspiring to participate in that. Like God is dropping little clues for you and seeing whether it's like how we look at children. I think God and the angels look at us. Oh, look, look, she understood that part this time. Oh, look, she prayed for."}
{"episode_id":"SW - #167 - 2021-07-24 - Frederica Mathewes-Green - How We Exist Together","start":2804.13,"end":2808.01,"speaker":"Jonathan Pageau","text":"That's an amazing way of seeing it. That's wonderful."}
{"episode_id":"SW - #167 - 2021-07-24 - Frederica Mathewes-Green - How We Exist Together","start":2808.41,"end":2948.45,"speaker":"Frederica Mathewes-Green","text":"That's something like we look at a sonogram and we see the baby and the baby has no idea, you know, that we're watching them. Yeah, I think that's what it's like with the. I was thinking too though about. I only use the term supernatural when I'm dealing with non believers because they know what the word means. I definitely wouldn't use it, but a cautionary tale I like to tell. But I'm blanking on his name. There was an extremely popular BBC series called Civilization, the first mini series. And it was, I guess late 60s and into the 70s that served something. Something who wrote and who narrated the whole thing. He had a sensitivity to supernatural things. He said when he went to. There was a certain village in Italy that he just felt evil. He just. It just felt horrible and murderous. He went to the island of Iona and he just felt the goodness. He felt the good spiritual presence there. Well, one time he was going to, you know, do some filming in a smaller Church in Paris in France, anyway. And he said as soon as we walked through the door, he felt an invitation. He felt that he was being invited to participate in Christian faith. And it lasted for several days, he said. But he. Vasily. He realized that if he accepted this invitation, there were things he would have to change in his life. And between the lines, as you read the autobiography, you can sense there was probably a lot of adultery going on. So he knew that he would have to change. And he came to the conclusion that he really didn't want to change. So he said after a couple of months, that invitation just faded away. So, wow, you know, today, decide who you will serve. You know, pay attention. Today, when you hear his voice, it says it's an exodus. I forget. Today, when you hear his voice, respond onto that voice, you may not get another chance. You might be like Sir Richard, whatever. And it would just fade away after a while. It's. It's said that on his deathbed, at the last minute, he became a Roman Catholic and received. So he waited till the very end. So did St. Constantine, I guess."}
{"episode_id":"SW - #167 - 2021-07-24 - Frederica Mathewes-Green - How We Exist Together","start":2948.69,"end":2955.58,"speaker":"Jonathan Pageau","text":"I guess it's not. It's not for us. We'll leave God. It will let God, you know, parse that out in the end, you know."}
{"episode_id":"SW - #167 - 2021-07-24 - Frederica Mathewes-Green - How We Exist Together","start":2955.74,"end":2958.14,"speaker":"Frederica Mathewes-Green","text":"But he might not have felt this."}
{"episode_id":"SW - #167 - 2021-07-24 - Frederica Mathewes-Green - How We Exist Together","start":2958.14,"end":2959.02,"speaker":"Jonathan Pageau","text":"Yeah, we don't know."}
{"episode_id":"SW - #167 - 2021-07-24 - Frederica Mathewes-Green - How We Exist Together","start":2959.1,"end":2993.41,"speaker":"Frederica Mathewes-Green","text":"I think if we keep choosing against the good over and over and over, we become more numb, less able to hear that invitation. We reach a point where we really don't want it. We really don't want God anymore. So you don't know yourself, really. You don't know when you might just become so numb, you don't care. So I think it's important, and I really should memorize that scripture better about today. When you hear his voice, don't delay, run toward him. You may well not get another chance. You may well not care. Next."}
{"episode_id":"SW - #167 - 2021-07-24 - Frederica Mathewes-Green - How We Exist Together","start":2993.41,"end":3020.9,"speaker":"Jonathan Pageau","text":"Yeah, once you. The next time. Exactly. Well, Federica, thank you so much. This has been really wonderful for me. Sometimes my conversations are. Tend to be kind of cold and intellectual, I have to admit, but I really enjoyed this. Really heartwarming and also just helping people remember how this is connected to our lives and our choices and the way that we commune with others. So thank you so much for your time. I appreciate it."}
{"episode_id":"SW - #167 - 2021-07-24 - Frederica Mathewes-Green - How We Exist Together","start":3020.9,"end":3024.58,"speaker":"Frederica Mathewes-Green","text":"Thank you. Jonathan, you're a wonderful interviewer. You're very easy to talk to."}
{"episode_id":"SW - #167 - 2021-07-24 - Frederica Mathewes-Green - How We Exist Together","start":3025.06,"end":3031.78,"speaker":"Jonathan Pageau","text":"And so if people want to access your writing, if they want to access what you're doing, what is the best place for them to go?"}
{"episode_id":"SW - #167 - 2021-07-24 - Frederica Mathewes-Green - How We Exist Together","start":3032.43,"end":3073.06,"speaker":"Frederica Mathewes-Green","text":"Probably my website, which is on The Ancient Faith website. It's Frederica, my name frederica.com like frederick with an A F R E D E R I C a dot com. And you will find all my books on Amazon. I have an author page there. On my podcasts going back to 2006 are on ancient Faith Radio pioneer. She's everywhere. She's everywhere. I'm not too hard to find, but I'm in the Smoky Mountains. My husband retired from the parish we founded in Baltimore and here I am at home with grandchildren around me and I couldn't be happier."}
{"episode_id":"SW - #167 - 2021-07-24 - Frederica Mathewes-Green - How We Exist Together","start":3073.38,"end":3080.7,"speaker":"Jonathan Pageau","text":"Well, I hope that we have a chance once all of this whole pandemic thing hopefully goes through, that we'll have a chance to meet again in person. That'd be wonderful."}
{"episode_id":"SW - #167 - 2021-07-24 - Frederica Mathewes-Green - How We Exist Together","start":3080.7,"end":3082.02,"speaker":"Frederica Mathewes-Green","text":"I would like that. Thank you, John."}
{"episode_id":"SW - #167 - 2021-07-24 - Frederica Mathewes-Green - How We Exist Together","start":3082.26,"end":3082.9,"speaker":"Jonathan Pageau","text":"Thank you."}
{"episode_id":"SW - #167 - 2021-07-24 - Frederica Mathewes-Green - How We Exist Together","start":3084.11,"end":3148.75,"speaker":"Justin Ward","text":"I hope you enjoyed this episode of the Symbolic World. The Symbolic World is edited by Justin Ward and it is based on a series of videos that you can find on my YouTube channel, Jonathan Pageau's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course, leaving a review on itunes. Everybody knows that's the best way to get the podcast out there to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon Pageau videos as well and on subscribestar. All those links you can find on my website or in the show description. So thank you and I will see you soon."}
