{"episode_id":"SW - #097 - 2020-04-10 - Timothy Patitsas - Beauty, Complexity and Ethics","start":0.32,"end":119.12,"speaker":"Jonathan Pageau","text":"So, hello, everybody. I am sitting here with Dr. Timothy Petitsa. Dr. Petitsa is a professor of ethics at Holy Cross and at Hellenic College. He is also now the interim dean at Hellenic College, which gives an undergraduate level degree of all kinds of undergraduate degrees. He's also teaching at the seminary Holy Cross, which is a seminary for priests. But I have him here today for a few reasons. One is that for months, for years, I would say since about 2015, people have been telling me, you have to talk to Dr. Timothy. You have to talk to him. And now, recently, because I'm making YouTube videos, I've had people watching my videos saying, oh, I can't read this article by him. I've read this interview with him. You have to talk to him. And we had a brief chance of meeting at an event in the fall, but now I have been into his book, which he just published, published, called the Ethics of Beauty. And I'm finding in it all the stuff that I love that I'm interested in that you guys who watch this are interested in. He talks about complexity. How about these new. Science of complexity is really bringing science and religion together. The inevitability of patterns, how beauty is important in the way we perceive reality and how we engage with it. So I'm really excited to get a chance to talk to him about his book and just about his ideas in general. This is Jonathan Pageau. Welcome to the symbolic world. Maybe, Dr. Timothy, you can maybe tell us a little bit about yourself, about your position right now and your journey, and then we can dive into some of what you wrote in your book."}
{"episode_id":"SW - #097 - 2020-04-10 - Timothy Patitsas - Beauty, Complexity and Ethics","start":119.92,"end":211.06,"speaker":"Dr. Timothy Patitsas","text":"Yes, thank you very much, Jonathan. And I also was really looking forward to meeting you at Saint Teacon's and heard so much about you. And, yeah, right now, what I'm. And your talk was so incredible at St. Tikon's that, yeah, it blew me away. It was so fantastic. But right now, I'm the interim dean at Hellenic College. So it's the undergraduate school in Brookline, Mass. And I'm wearing a hat of WVU because my nephew, Tino Kay, office goes there, and because I'm nursing a head colt and I have to keep my head warm at all times. So forgive me for appearing so casual, but, yeah, I'm the interim dean of our undergraduate school. We're trying to launch a revision of our core curriculum. We're in the process of discussing what that might look like. I hope we can get it done. We might not, but we have a number of good majors, undergraduate majors. It's an orthodox Christian Community. We certainly have about 50 slots a year open to undergraduate students because we don't want to grow so large that we overwhelm our sister school, our big sister, the Holy Cross Greek Orthodox School of Theology, the actual seminary. And it's a faith, really, a vibrant campus. There's a lot of. It's a very holy place, actually. And in a living sense, there's a lot of struggle there, but it's a holy place."}
{"episode_id":"SW - #097 - 2020-04-10 - Timothy Patitsas - Beauty, Complexity and Ethics","start":211.94,"end":333.32,"speaker":"Jonathan Pageau","text":"Well, I think for people watching these videos, people in their 20s, and then also people who are parents and looking at their kids, we're always looking for opportunities for people to get a grounding, a good intellectual grounding in the Christian tradition in the Orthodox faith. So I hope that people will look into Hellenic College. I know I will. My kid just turned 15 yesterday, and so we're starting to think about hopefully giving him some kind of ground to face the world with, a way of thinking. This is what I discovered in your book, which I love. I haven't gone through. It's very thick, but it reads really well. It reads very easily because it's a series of interviews that were done with Road to Emmaus Journal. If you don't know about this journal, it is great as well. It is run by Mother Nycteria. And here's one of the ones that Dr. Timothy did. There are interviews in there with Andrew Gould, with Father Suleiman Giustiniano, all people that I love and I think are really in the right position in terms of reawakening a sense of beauty and a sense of pattern in the world. And so it's done as a series of interviews, and it's very easy to read and very common sense. But it also dives into some very powerful ideas, you know, from the idea of architecture, how architecture is so important. I was in Boston just a month ago at a talk, and, you know, I brought up that exact point, that architecture is really the most important art because it disappears in a way, because you're living within it. It's the space within which you live. And so urban planning and architecture becomes the frame of your actual lived existence. So maybe we can start there, because you use Christopher Alexander and Jane Jacobs as some of the basis of the things you're talking about. So maybe you can explore a little bit with us the idea of the city as liturgy or the liturgical aspect of reality and how. How we engage with it."}
{"episode_id":"SW - #097 - 2020-04-10 - Timothy Patitsas - Beauty, Complexity and Ethics","start":335.08,"end":456.89,"speaker":"Dr. Timothy Patitsas","text":"Yeah, I do want to give a shout out to you. I just talked to Mother Nektarya this morning, and she said to say Hello. And how much she thinks about you and prays for you all the time. She and I are both spiritual children of Father Artemy Vladimirov in Moscow. So that's a big connection Mother Nekhtari and I have that's kept us close. She used to be a student here, and when she was, she would chase me around with a tape recorder, everything I said. And that's what got into the idea that I would just write the book as if it were a series of interviews with her, but we spent so many years editing, and she influenced the questions, added new questions and influenced all the answers, that even though she's part author. Oh, yeah. She is really a huge influence. And I think a basic premise of the book is that, you know, within these ancient liturgical systems, that, you know, a lot of secrets are kind of carried, waiting to be unpacked, you know, by later generations. And one of the ways that I actually started to write this book is a student asked me about a passage in Lars Tunberg which said that from the 4th century, east and West started to drift apart. The question of whether the sensual sins were the place to begin the spiritual struggle or the intellectual sins. And I had no idea what that meant, that question, and why it was that the east chose the sensual. It seems so. Or why Saint Maximus did so. I guess before I get to the Jane Jacobs thing, just. It's really my. I guess my operating idea has been to just treat the Church and really. And other repositories of ancient wisdom as if they're smarter than they look. There's stuff hidden in there that. It takes a lifetime. It takes a lifetime of getting ready before you can know what they're saying to you."}
{"episode_id":"SW - #097 - 2020-04-10 - Timothy Patitsas - Beauty, Complexity and Ethics","start":458.09,"end":492.68,"speaker":"Jonathan Pageau","text":"No, I agree, but I think there's also one of the problems. It's a problem and an opportunity is that there are some things that were just lived, let's say, in the ancient times and were taken for granted and so were not explored intellectually. They were just the water that you swam in. And so now with the Enlightenment and with this kind of alienated mode of being that we've had in one hand, we're alienated, but it's actually an opportunity to now look back into those systems and see them with, let's say, a distance, which can help us understand them in a different way."}
{"episode_id":"SW - #097 - 2020-04-10 - Timothy Patitsas - Beauty, Complexity and Ethics","start":493.81,"end":575.74,"speaker":"Dr. Timothy Patitsas","text":"Yeah, And I think people really underestimate the importance of. You mentioned Jane Jacobs, I think, a second ago, and city planning and her book, the Death and Life of Great American Cities. I mean, people like that book to get to this issue of Cities for what it says about urban planning. Sure. But in the final chapter of the book, she says, hey, there's this new kind of science. It's called the science of organized complexity. And so in 1961, she became the first person to reinvent a whole social science, urban planning, through the lens of this new science. I mean, she was so far ahead of her time. And so that was another major influence in my intellectual life. And I eventually met Jane Jacobs the last five years of her life. We were close and certainly went to her home many times. And, you know, I write about that in the book. And she had a huge impact on me, and she thought I was pretty keen, too, you know. So I say that because it's important if you're right, if you have someone of that stature who signs off on something, well, that really matters, you know, that's the ultimate kind of recommendation."}
{"episode_id":"SW - #097 - 2020-04-10 - Timothy Patitsas - Beauty, Complexity and Ethics","start":576.14,"end":589.66,"speaker":"Jonathan Pageau","text":"So did you feel like, for example, someone like her, do you feel like she was able to perceive the analogies between city planning and, let's say, the religious rituals or the sacramental life that the orthodox engage in?"}
{"episode_id":"SW - #097 - 2020-04-10 - Timothy Patitsas - Beauty, Complexity and Ethics","start":590.78,"end":703.33,"speaker":"Dr. Timothy Patitsas","text":"So it was like late 1999, I wrote her for the first time, you know, just. You can write any author you want. Just send the letter to their publisher, and the author will get it, anyone wants them. And that's when I laid out that I felt I had discovered that in that book, the Death and Life, that cities were really vast liturgies and that there were all kinds of very practical components of city order, as she discovered it, which looked just like liturgies, being the work of the people cycling through death and life. These patterns of death and rebirth, the love, the wonder, the emergent character, the openness to the radical openness to the unknown that was crucial for her in Cities. You know, she thought a city that stopped innovating wouldn't really be a city anymore. It would just be an overgrown, decaying settlement. So when I wrote her that, she said. I mean, in her first letter back, she said, this is the best. You know, you're the best interpreter of my work that I'm aware of, and you're showing me what my own work means. And then she did something else which was so interesting, and that's why I put it in this book. She said. I was startled. She said that you've grasped something that I was groping for in my forthcoming book, the Nature of Economy or the Nature of Economies. I always forget which it is. And I didn't know what she was talking about. It took some time. But she noticed first that if cities were liturgies, then by extension all self organized emergent systems look kind of liturgical. And you basically have a ready made reconciliation of science with religion. And it's a gentle reconciliation and it's sturdy."}
{"episode_id":"SW - #097 - 2020-04-10 - Timothy Patitsas - Beauty, Complexity and Ethics","start":703.57,"end":791.48,"speaker":"Jonathan Pageau","text":"Yeah. This is something that I've been really pushing, at least for the past few years, is to try to help people understand like the inevitability of hierarchy in complex systems and the inevitability of, when I say hierarchy, I mean the full hierarchy and also the engagement with the margin and the unknown and let's say the potentiality on the edge of that hierarchy and how everything is made that way. There is no exception to it. And that it helps us understand, let's say, neoplat Platonism in a more modern way. But then if you now bring the science of consciousness into the realm of also this complexity theory and you see how they interrelate with each other, how the inevitability of the conscious agent, as let's say, the frame of multiplicity and unity, how we bring things together in love through our conscious being, then all of a sudden you can see how the Christian answer to Neoplatonism is also there, which is the bringing into the incarnational practice. It's not just these forms in almost in an abstract way that kind of settle into the world, but rather the agent, the incarnate agent is, let's say, the fulcrum out of which this is happening. And so to me it just seems like, like you said, right now is a critical moment for Christians to to be able to expound this, for people to understand that this is what we've been talking about all along."}
{"episode_id":"SW - #097 - 2020-04-10 - Timothy Patitsas - Beauty, Complexity and Ethics","start":792.52,"end":861.14,"speaker":"Dr. Timothy Patitsas","text":"One of my students, her name is Georgia Williams, she wrote a beautiful paper arguing that what we call fractal, the fractal geometry of nature, really are the hierarchies. And once you understand that the hierarchies are really fractals, then you realize, well, well, Marxism collapses because Marxism is the idea that you could dispense with hierarchy in favor of a pure democracy with a small D. This pure equality of sameness and organic order is fractal. Therefore, in other words, it's hierarchical. And so you kind of have to junk that vision. Now, of course, in Plotinus and as well as in Dionysius, what? Because it is. These are divine systems. It really is the way, besides relating to God through the hierarchies up and down, we also all relate directly to God. And so we have both democracy and monarchy in the church. But the idea that you're gonna have. Just one of those, of course, is just death one of the most beautiful."}
{"episode_id":"SW - #097 - 2020-04-10 - Timothy Patitsas - Beauty, Complexity and Ethics","start":861.14,"end":942.41,"speaker":"Jonathan Pageau","text":"Images I've seen in your book. I was trying to get through as much as I could before our interview. But one of the most beautiful images that you had in there was this idea interpretation of St. Maximus. And this is something that just comes right into my thinking as well, which is that when we talk about the logi, it's not as if these logi exist as things or, you know, it's more the notion that the logi. The logi are Christ manifesting himself to. In a particular thing. So it's like in my particular reality, my own little hierarchy, hierarchical being. It's my vision of Christ, which is my logi. It's the way in which I can interrelate with Christ. And so it's the same with things as well. All things are a reflection of God or a reflection of an incarnational principle within their specific sphere. And so it. And so it actually, because a lot of people struggle with the idea of these logis existing independently. And it's like it's not that they exist independently. They exist as a communion of multiplicity which is constantly breathing in and breathing out, you could say, coming into the life of Christ. And the real reality is the divine Logos. There is no other reality besides that one. We just are able to participate in it, you know, at. At the level at which we can, which is what Saint Maximus is always saying."}
{"episode_id":"SW - #097 - 2020-04-10 - Timothy Patitsas - Beauty, Complexity and Ethics","start":944.01,"end":1019.41,"speaker":"Dr. Timothy Patitsas","text":"And Father Maximus Constance, who's the dean of Holy Cross while I'm the dean of Hellenic, he. He says. I think he stresses the idea that creative things are like mirrors, which their appearance is really their participation, their reflection of the Logos according to their individual Logos with a small l. But the thing that really helped me there was actually Wendell Berry. And I think it's hard to think of, you know, he's this western Kentucky farmer and the greatest spokesman for American agrarianism. And it was funny. I was at Jane Jacobs house one time and we were talking about him, and she didn't quite get the agrarian. The agrarian thing. But he really helped me with the logoi because he's always talking about the ways. The lost ways of farming, the lost ways of animal husbandry, the lost ways of community. And I began to see that the logoi were more like the ways. You know, it's about knowing. And then on the other side, it's the way in which Christ, as I say in the book, kneels down to wash the feet of every aspect of creation in a way that it can accept, it can understand, it can live to."}
{"episode_id":"SW - #097 - 2020-04-10 - Timothy Patitsas - Beauty, Complexity and Ethics","start":1019.97,"end":1061.34,"speaker":"Jonathan Pageau","text":"Yeah, and it's a perfect example because we always need to remember that baptism is identity forming. That's what baptism is. You wash what's not part of the thing, which is not, you know, you wash off the externals and then you name the thing, you know, the person comes out of the water, you name them. It's like it really is an identity forming thing. And so the image of Christ washing the feet of creation, I just thought was a beautiful image of how, of how on the one hand there is this power and authority of naming, but at the same time there's this love and care which is to grooming almost like to make sure that the thing has a form of completeness. So it's a beautiful image, really powerful."}
{"episode_id":"SW - #097 - 2020-04-10 - Timothy Patitsas - Beauty, Complexity and Ethics","start":1062.78,"end":1103.55,"speaker":"Dr. Timothy Patitsas","text":"It is, it's great. And you know, we have, I mean a couple traditions I've noticed is, I mean just in a living way is people do often take on some quality of the saint whose name they get at baptism. I mean, it's so obviously with time that like. Oh, of course. And then another tradition, at least we have in the Greek Orthodox world, and I don't know if maybe it's just universal, is that when your godparents put the oil on you that they also give you one of their particular charisms that you become literally their child. You will resemble them in some way like we do, much more so our own parents. And I've seen that a lot too."}
{"episode_id":"SW - #097 - 2020-04-10 - Timothy Patitsas - Beauty, Complexity and Ethics","start":1104.59,"end":1218.62,"speaker":"Jonathan Pageau","text":"No, I think that that seems like it's something that would be inevitable and it's hard for. It's so funny because those types of things, when you say them, that it's very difficult for materialists to understand how real and how inevitable these types of relationships are in terms of identity. It's as soon as you understand the inevitability of identity and how identities happen and how these multiplicities, kind of this potentiality comes into one and how we participate in that for others and how we all coexist. You could say all of a sudden it. Everything kind of makes sense. One of the images that you talk about which really hit me is when you talk about post enlightenment thinking and you know, I tend to be very anti enlightenment in my. Sometimes in my discourse just because we've had to. We grew up with the, we grew up with the, with the arrogance of the enlightenment. So we want to, you know, we just want to hit back. But I feel like the way that you talk about it as a reconciliation I think is is far more fruitful how in a way, the Enlightenment created the idea that the human person is outside of nature and is looking at things as this weird kind of disincarnated light. And you still hear that today. You hear people say things like, oh, it's just a social convention. It's just a social construct. Okay, so where are you standing for it to just be a social construct? Are you somehow above all of the natural world to see that these social contracts don't exist in reality? But as soon as you go back into the natural world, actually, and it's an interesting move, as soon as you kind of even take consciousness and put it back into the natural world, all of a sudden these things start to flip around and the notion of identity forming and the idea of communion, all of these elements start to make sense once again."}
{"episode_id":"SW - #097 - 2020-04-10 - Timothy Patitsas - Beauty, Complexity and Ethics","start":1222.95,"end":1270.59,"speaker":"Dr. Timothy Patitsas","text":"It's a great moment we're living in. And I think the book was. I wrote the book without an outline, without a plan. It just unfolded. A lot of things I discovered while writing, especially in chapter four, about what is the core of the spiritual path in terms of three concentric phases of healthy shame. And I think by the end of the book, because it just reached its logical conclusion in talking about Jane Jacobs and the science of organic complexity, because I realized that that is the beauty first approach to science. And what Jane Jacobs did in 1961 there, and that really should be, that book should guide university curricula. I mean, that is the book for me. She said, there's these three kinds of science and they each are good at something."}
{"episode_id":"SW - #097 - 2020-04-10 - Timothy Patitsas - Beauty, Complexity and Ethics","start":1271.55,"end":1271.95,"speaker":"Jonathan Pageau","text":"So."}
{"episode_id":"SW - #097 - 2020-04-10 - Timothy Patitsas - Beauty, Complexity and Ethics","start":1273.95,"end":1333.69,"speaker":"Dr. Timothy Patitsas","text":"She actually rescues and saves the Enlightenment because she shows that it surpassed itself in the discovery of organic complexity. And that's redeeming. And we do need reductive approaches in certain cases, making machinery and this and that. So all of a sudden you realize, well, we need all three kinds of science. But there's always has to be that priority for the beauty first way. Or as I, you know, we are so addicted as a culture to large quantity information and high potency information. And we have to train that out of ourselves because it's such a heady drug, and learn to appreciate high quality information. And that's what you get through complexity and through the beauty first way. So even though all three kinds of science matter, the beauty first way really has to govern your heart."}
{"episode_id":"SW - #097 - 2020-04-10 - Timothy Patitsas - Beauty, Complexity and Ethics","start":1334.22,"end":1349.42,"speaker":"Jonathan Pageau","text":"And in a way, what's interesting as well about this approach is that not only is it a way to kind of solve the Enlightenment problem, or rather re appropriate the Enlightenment, it also is a way to deal with the postmodern problem as well, you know, because."}
{"episode_id":"SW - #097 - 2020-04-10 - Timothy Patitsas - Beauty, Complexity and Ethics","start":1352.06,"end":1352.42,"speaker":"Dr. Timothy Patitsas","text":"To."}
{"episode_id":"SW - #097 - 2020-04-10 - Timothy Patitsas - Beauty, Complexity and Ethics","start":1352.42,"end":1439.04,"speaker":"Jonathan Pageau","text":"Talk about these patterns and to talk about us being immersed in this pattern, being part of the fractal. So we're not outside looking at the fractal, we are also within the fractal. And we're one of its instantiations, you could say, and an important one because we're the one who can then see the other instantiations of that pattern. That this is also an answer to the kind of postmodern deconstruction approach, which still also has almost the viewer as this weird external thing which keeps criticizing things for being constructed and tries to point to the logocentrism of things. And you know, in a way we're saying, not in the same way that Derda was saying, but we're saying, yeah, logocentrism is just inevitable. You just can't have reality without some kind of. Without this communion in essence, which appears as. But it's a bottom up and top down approach at the same time. That's what the complexity science is bringing to us is, is a more of a bottom up vision of it. As people who, like Dionysius or Saint Maximus, we tend to see it top down. But when you read Saint Maximus, you see that, no, he talks about the love of the Church as being the manner in which the Logos manifests itself. And it's like, yes, that's it. The communion of the parts bottom up is the same thing as, let's say, the top seed or the name coming down from above."}
{"episode_id":"SW - #097 - 2020-04-10 - Timothy Patitsas - Beauty, Complexity and Ethics","start":1439.04,"end":1529.23,"speaker":"Dr. Timothy Patitsas","text":"It's the same to drop a huge name. I mean, I don't know how famous he is, but he certainly ought to be Eric Pearl. You know, the Neoplatonist philosopher. I think he's out in LA at a university, but he would remind us when we studied with him at Catholic U, he said, remember that for Maximus, every instance of deification is a further instance of hominification. And so that unity of what you just said is there. I mean, I think the real issue for the west is what we now think of the West, Western Europe and the Roman Catholic and Protestant world is that everything is a war between nominalism and realism. And at the moment we're trying to let the Protestant nominalist movement have its full head. And nothing is real. Everything is somehow imposed by will or politics or oppression or hierarchical blah, blah, blah. And that war between nominalism and realism just cannot. It's fecund in a way. I mean, it has been fertile for us in many ways as the west, but it's also quite destructive and it's just not reality. And somehow in the east you overcome that division between, like you were just saying, between this arbitrariness versus this kind of fixedness that's oppressive."}
{"episode_id":"SW - #097 - 2020-04-10 - Timothy Patitsas - Beauty, Complexity and Ethics","start":1529.55,"end":1577.34,"speaker":"Jonathan Pageau","text":"Yeah, and I see that right now, even in my discussions with people. Like there's a Prof. Of cognitive science, John Vervecki at University of Toronto, that I'm having quite a few discussions with. And I think that he's also discovered in Maximus and Eurogenia how the top down and bottom up approaches are just the same, that it's a mistake. You can see them as opposite in the sense of perspective, but you don't want to see them as opposing each other, but rather as exactly as just the perspective from above and the perspective from below and they're joining together in love. That's how reality just. That's how reality works. There's no way around it. For every object and for every instance of every instance you can recognize needs to have that pattern within it."}
{"episode_id":"SW - #097 - 2020-04-10 - Timothy Patitsas - Beauty, Complexity and Ethics","start":1577.34,"end":1671.63,"speaker":"Dr. Timothy Patitsas","text":"You know, it's so funny that you mentioned love because, you know, everyone's trying to develop a system without explicitly accounting for love. And when Jane Jacobs turned her, you know, her heart towards, well, from the very beginning, she said in 1961, she said the reason we've, you know, destroyed our cities in the United States and England to an extent as well is that the people who were writing about cities, prescribing for cities, trying to improve cities, were to a man, and they were men, people who hated cities. And she says, you know, right there in 1961, she says, well, it turns out with this new kind of science that if you don't love something, you can never understand it. And I mean, that is so. That destroys the Enlightenment. That destroys. And then she right away picks up the pieces and the broken pieces and gives them back to you. She was really just the thing. The idea that Einstein was the great mind of the 20th century, forget about it. I'd much rather curl up. With all her writings she understood. And when she wrote about politics in her book Systems of Survival, she says explicitly, there's this missing ingredient which is love, without which we cannot have a civilization. I mean, our social justice people don't say that. They're just so anxious for revenge and reform. It's just a dead end street."}
{"episode_id":"SW - #097 - 2020-04-10 - Timothy Patitsas - Beauty, Complexity and Ethics","start":1672.67,"end":1730.07,"speaker":"Jonathan Pageau","text":"For sure. It's a dead end street. I always say love is really the balance between unity and multiplicity. That's love and that's the Trinity, the life of the very. The Trinity is the infinite instantiation of that, that balance between one and many and that's. And you can't have any identity without that, you know. And so I would like to get your opinion on what's happening now because you know, in terms of people who see patterns and see this pattern of civilization and the pattern of how things come together and how things are separate, we're living in a very strange time with this, with this virus and what it's doing to us. And I think that we need to be able to see it with that lens. And so I was wondering if you've had some insights on what we're going through right now."}
{"episode_id":"SW - #097 - 2020-04-10 - Timothy Patitsas - Beauty, Complexity and Ethics","start":1730.95,"end":1879.35,"speaker":"Dr. Timothy Patitsas","text":"Oh, I sure don't know. I mean it is really good because for one thing we don't know what we're going through. I mean it's, we're not sure whether this is an overblown reaction. What I'm gathering is that the full might of Western industrial power and scientific power, it's like a battleship that's slowly turning on this situation. In another month we're going to be drowning in surgical masks. We're going to be self testing twice a day for. And we are just going to drown in that, our materialistic abundance and let's do it, let's go for it. I think that's great, but it's such an unknown enemy and I think it's a good sign that people are trying to, to the extent they can stay home but while also trying to reach out to others by phone or whatever way people still have jobs, we're still trying to do it. Yeah, of course, the book that of course is ringing in my mind is Rodney Stark' the Rise of Christianity because he has a whole chapter about plagues and epidemics and how they impacted the growth of the church in the first three centuries. Another book I have in mind is the Grand Strategy of the Byzantine Empire. Because in the so called Plague of Justinian, some people think wiped out about 50% of the Byzantine Empire. And so much so that it's one of the few eras of human history where greenhouse gases declined because the farms grew over to forests and wild animals picked off the livestock. And that's loot facts. So certainly as a church or as a human race, plague has been with us and is likely to be with us. And certainly we're learning a lot through this. We're going to get sharper, we're going to get better, we're going to monitor things more closely. Someone is going to come up with faster ways to create vaccines for these sorts of things or you know, if it. If it really gets out of control and, you know, the. Half the congress and once the police all get, you know, this plague or something, and they can't, you know, we could just have a total collapse. Yeah, we'll see which one it is."}
{"episode_id":"SW - #097 - 2020-04-10 - Timothy Patitsas - Beauty, Complexity and Ethics","start":1879.51,"end":2074.67,"speaker":"Jonathan Pageau","text":"Well, one of the things that I've been noticing in terms of patterns of being, you could say with this. And, you know, you can think about it before it happened, but when it's happening, all of a sudden you're in it, and so you're really just seeing it play out is, you know, when you talk about the fear and the unknown, I think that that is really part of it. You know, it is part of the. The notion of an unknown agent or an. Or the idea of a. Of a subversive agent within a system. So you have something that is there, and you don't totally know where it is, what it's doing, but you know it's there. And so the fear of the subverted, the subversive agent is as important as the acts of the subversive agent as, you know, the disease itself, which is breaking down the bonds of society. The fear that it's causing is also, is. Is part of the disease. You can't. You can't strip it away from what the disease is. It's not just a biological thing. It stacks up in terms of phenomena, and as it reaches the social level, it's creating this fear of this unknown. And what it's doing is it's isolating us from each other. And so you can see how, in terms of a liturgical thinking, if you think of liturgy as communion and think of liturgy as this balance between the oneness and the many, and all of this, well, the subversive agent within the system is breaking apart, is fragmenting the system, you know, and so what can happen is that either the system can be consumed or the system will, like you said, or the system will then react and will try to reimpose itself, sometimes to the denterment of itself, sometimes in a balanced way. That's the question is that how is the identity of whatever systems we're part of going to kind of reaffirm themselves? Is it going to be a system? Are we going to find ourselves in a state of more control that's going to have more control over us? Are we going to find some balance? And then that's when, if you read some of the accounts that you talked about in terms of how the plague participated in the rise of Christianity, you'd see how the fact that Christians within plague settings continued to demonstrate love and continued to care for those who were sick and those who were suffering. That was, I think it was even Julian the apostate who had to, despite himself, acknowledge how the fact that Christians were doing this within plague times was part of the reason why the church grew and part of the reason why it became stronger. And so I think that at the same time, even though we're doing this kind of weird self isolation thing, there will be moments as Christians where we will have to transcend that and show the love of Christ within this difficult situation. In order for the bond of the church to survive and also for the system, I hate to say the system or the body of the church to thrive, we need to be able to show how the love of Christ can transcend the subversive agent that's breaking us apart. I don't know if that makes sense."}
{"episode_id":"SW - #097 - 2020-04-10 - Timothy Patitsas - Beauty, Complexity and Ethics","start":2075.33,"end":2185.2,"speaker":"Dr. Timothy Patitsas","text":"It does. I mean, the thing is though, that right now the martyric front line of all this are the doctors and the nurses. And I know, I've heard even here in Massachusetts, they're about to start running out of masks and gowns and things. And here we have all these great hospitals, so they are not going to abandon their posts. And if they start to become sick, then we really will have huge, huge issue, a society crippling type of thing. But they're the ones asking us to stay home. They're the ones asking us to don't play the hero. In a sense now we have to be careful there because we have Netflix now. And you just stay home and you binge watch or you do whatever. Some friends of mine have been joking that they're actually gaining weight. They stockpile all this food and then they're just nothing to do but eat it, you know, ahead of schedule. But they're the ones asking us to stay home. And yet at a certain point, like you said, we will have to just throw caution to the winds to minister to a neighbor or someone else. And that's what I mean. I would say that's what Christians have always done, but I know that now those Christian values. The hospital itself was invented in the 4th century in Asia Minor. It's a Christian artifact now. It belongs to all civilizations. Everyone has those, you know, when a new value emerges in the world, you know, through divine inspiration, in a sense, it immediately becomes the common birthright of all, to the extent they're able to live up to it. And so those are, you know, those are our Christians and our martyrs are these healthcare workers and other people in that. Yeah."}
{"episode_id":"SW - #097 - 2020-04-10 - Timothy Patitsas - Beauty, Complexity and Ethics","start":2185.67,"end":2278.67,"speaker":"Jonathan Pageau","text":"Well, one of the ways I think that at least for now, I mean, we're not. There's no. The crisis isn't here totally yet. But I think that for now, some of the things I've seen people do and that we've tried to participate in as well in my home is to identify the elderly people in our community that are really self isolating more than everybody else and who are trying to stay in their house and to see if we can be of service to them, to see if we can get groceries for them. If we can, if we can, we can do things to avoid them having to come to be in public where they're more in danger, let's say, of getting it or being affected by it. That seems to be a simple way to kind of help preserve the bonds. I think that that's the way that I see it is, that is to try to identify the way in which we can counter the fragmenting effect of the subversive agent and rather preserve the bonds. You know, I think the way a lot of people have been criticized, I've seen people criticize, you know, streaming the services and everything, people have criticized that. And I can understand that ideally that is not the best thing to do, but we need to do with what we have and try to help people, like I said, stay connected in the manner in which we can at the moment and always be. And if we're attentive to that and we're trying to look around us and instead of spending our time criticizing everything, looking around us and seeing what are the practical ways in my life and in the people around us where I can try to preserve those bonds, then we'll be doing the healing. We'll be doing the healing that we can as the body of Christ."}
{"episode_id":"SW - #097 - 2020-04-10 - Timothy Patitsas - Beauty, Complexity and Ethics","start":2279.87,"end":2408.28,"speaker":"Dr. Timothy Patitsas","text":"It's so crucial. The thing, of course, the great paradox of the ethics of beauty here, just to show it again, is that it starts off with a discussion of trauma and the way in which trauma disrupts liturgical communion. The way war is kind of an anti liturgy. And really it just always comes down to just what you said of strengthening those bonds, of finding the excommunicated and recommuting them. And in her one of the final book she completed, Jane Jacobs Dark Age Ahead, she writes with great pain about the Chicago heat wave of I don't know what year it was, late 90s, early 2000s, and the discovery so many people, so many elderly died that the CDC was tasked to figure out what happened. And one of the things that was Noted was that elderly who were socially isolated to begin with were much more likely to die in the heat wave when the power went out. And they were afraid even to open their doors for, let's say, a social worker or someone who came to help them. So. So she wrote about that with great pain. And we have to figure that out. And I follow the email. I'm on the email list of this Mrs. Frugalwoods. She's an apostle of frugality up in Vermont. And I recommend her email. It's really good. And she describes what, in her Vermont town of 400 people, how quickly they organized to have the volunteer drivers, volunteer organizers. And when someone needs something, call the organizer. Hey, I need this. The drivers go pick it up at the store. They leave it on your porch. There's no, you know, you can let it sit there for an hour till the, you know, the sunshine blows off the virus or whatever. But. So it's very important that we, that we try to stay connected. We are about to launch in today. We're launching into our experiment with distance education with our students at Holy Cross and Hellenic. So we're going to be very connected to our students, trying to figure out, hey, you didn't hand in your work yet. Getting all that organized, that is a huge."}
{"episode_id":"SW - #097 - 2020-04-10 - Timothy Patitsas - Beauty, Complexity and Ethics","start":2408.28,"end":2452.86,"speaker":"Jonathan Pageau","text":"That is definitely a huge step. And we're seeing everybody do that. It's a weird mix of frightening. And in a way, we're happy that technology is permitting us to do this, to even have this discussion and to do this. And I just have the fear that we're creating permanent patterns. We'll see, hopefully we're not, hopefully, that as these, as this wave, kind of, we ride this wave, then we will be able to reconnect in more direct ways. The danger is that it's so convenient that there might be a lot of residue of this kind of weird, disconnected connection that we. That we're setting up."}
{"episode_id":"SW - #097 - 2020-04-10 - Timothy Patitsas - Beauty, Complexity and Ethics","start":2453.74,"end":2510.43,"speaker":"Dr. Timothy Patitsas","text":"I hope that for what happens for universities, you know, because you could just have the world's greatest lecturer give a lecture and you don't need the other 20,000 professors of that topic. But I hope what that will, you know, create in us as professors is an ability to use the classroom time in ways that are more personal and challenging and problem solving. We try to do. In my social ministries class, we do an annual simulation of a kind of broken society, and the students have to fix it. And it's those kind of things. You know, universities should be stepping up their simulations, their war games, their internships, their. On the, you know, the professor, instead of giving a lecture, should just come in and write problem on the board. And, you know, so I think this could help us be better teachers."}
{"episode_id":"SW - #097 - 2020-04-10 - Timothy Patitsas - Beauty, Complexity and Ethics","start":2511.15,"end":2552.26,"speaker":"Jonathan Pageau","text":"Well, interesting. Take it, take it as. Take it as a challenge, for sure. And so how do you. Because, you know, I'm an icon carver, and so obviously my interest in this question of beauty and the question of the relationship between the very pattern of reality and in these, These systems that we create, that we engage in. I'd like to get a bit of your sense of, let's say, the state of liturgical art as you kind of see it, and maybe also how you see the capacity for Orthodox liturgical art to affect our culture, our modern culture. Right now. Big question."}
{"episode_id":"SW - #097 - 2020-04-10 - Timothy Patitsas - Beauty, Complexity and Ethics","start":2552.26,"end":2636.94,"speaker":"Dr. Timothy Patitsas","text":"But, yes, it seems like we're undergoing a renewal. It seems like it's been a long time, you know, it's been a very slow growing renewal, and I think the momentum is certainly on the side of better liturgical art, and people more and more aspire to that. There's much less aspiration for the completely unpattered novelty of, of the 60s and 70s. So what we're really missing is just enough practitioners, enough education, and then sometimes the money. Because a lot of times what's going on is that it's the small parish that is kind of insight rich, but resource poor. And they know that if you can get Andrew Gold to build your church, then, you know, you're cooking with gas now. I mean, that's the way to go. But they can't afford it, and they can afford him, but they can't afford to build the church. And so we're just waiting. It would be nice to borrow from the page of the, you know, for the Italian Renaissance, you know, it would be nice to have some deep pocket patron who would say, look, if you build with one of these guys, you know, if it's Peugeot you're. You're working with, you know, I'll pay half."}
{"episode_id":"SW - #097 - 2020-04-10 - Timothy Patitsas - Beauty, Complexity and Ethics","start":2637.1,"end":2640.7,"speaker":"Jonathan Pageau","text":"Right, yeah. You're saying we need Russian oligarchs, Is that what you're saying?"}
{"episode_id":"SW - #097 - 2020-04-10 - Timothy Patitsas - Beauty, Complexity and Ethics","start":2643.74,"end":2645.42,"speaker":"Dr. Timothy Patitsas","text":"I would prefer Italian bankers."}
{"episode_id":"SW - #097 - 2020-04-10 - Timothy Patitsas - Beauty, Complexity and Ethics","start":2645.42,"end":2748.35,"speaker":"Jonathan Pageau","text":"There you go. You prefer Italian bankers. That's hilarious. No, I agree, I agree. And I think one of the things that needs to happen, and I think this kind of falls back in your court as well. And not just your court, but all the seminaries in the United States is also the future priests need to have that part of their education. This is what I believe. I think that part of their education has to be a capacity to understand the importance of liturgical art and the capacity it has to affect Our being, especially in a modern world of strip malls and electric lines and all this horrible, ugly stuff, it seems like if the clergy, as we get more clergy, if the young clergy is at least attentive to that and cares and know that it's important, then we're slowly going to. It's not going to happen, you know, tomorrow, but we're slowly going to build a culture of beauty back into, you know, because we. We have to also understand the madness that we're coming out of. You know, we're coming out of the communist regimes were coming out of the fascist states, were coming out of a church. The Orthodox Church was beaten to the ground. And so it's not just everything is now taking life again. And so the arts also have to find their place in that and in America, in a world of practicality and in a world of budgets and thinking in terms of the bottom line, it's. It seems like it's a tougher step to take to really consider the liturgical arts as part of what we need to bring into our communities as well."}
{"episode_id":"SW - #097 - 2020-04-10 - Timothy Patitsas - Beauty, Complexity and Ethics","start":2748.99,"end":2861.75,"speaker":"Dr. Timothy Patitsas","text":"You know, Jane Jacobs, sort of bring her into everything, but she's just so great. She said beauty is not to be had for the asking. You try to build beautiful things, but sometimes it's not evident for a generation or so whether you've hit the ball out of the park or. Or kind of. Kind of whiffed. And so it's. You know, it's. There is some dimension of which it really is a miracle when some. Whenever anything beautiful gets made. But she also. She also. And I think Alexander was like. And Wendell Berry too. I think probably the answer for a lot of churches is to. Is to build a really beautiful small chapel somewhere, because that does not have the same, you know, the same complications of fire escapes and whatever. Whatever in your main church. And if you're. If your parish isn't ready financially or educationally to build its parish church the right way, at least if these small side chapels off in the country or even just across the street or in a different part of the city can be done, well, that's enough. I think that should be counted as a giant victory. I mean, enough for now. A parish priest is essentially. I mean, besides everything else that he is, he's the mayor of a small village, and he's got to keep that community together. As you said, quoting Maximus, to the extent that it's able, it's possible. I think a beauty first way is accepting of limitations. And we're doing the best we can, but we're not that good right now."}
{"episode_id":"SW - #097 - 2020-04-10 - Timothy Patitsas - Beauty, Complexity and Ethics","start":2861.99,"end":2912.37,"speaker":"Jonathan Pageau","text":"But I think also the easy accessibility of the cheap option is also hurting us in the sense that one of the things that I recommend people is to don't get everything right away. Everybody, they want Hagia Sophia right away. And so if you want that, then of course, then you'll get prints all over the church and you'll get these massive prints that you just glue on the wall and everything. Because it's. Because you can get all the icons or you can buy a series of all the icons and it'll cost you a few hundred dollars and you're done. And so you have to think more simply that we need to start get one good icon and if you're going to buy a painted icon, get a good one and then just slowly build from there instead of going all out and getting all the cheap stuff."}
{"episode_id":"SW - #097 - 2020-04-10 - Timothy Patitsas - Beauty, Complexity and Ethics","start":2913.17,"end":2962.51,"speaker":"Dr. Timothy Patitsas","text":"You know, it would be worth studying St. John the Baptist, the Rocourt parish on 17th street in Washington D.C. i mean, that is, it is such a perfect church inside. And you just wonder, how in the world did that happen? I don't know the history, I'm sure it's recounted on the website, but how they were able to. But it's a challenge. I mean, I certainly know bad art when I see it and bad architecture, but I think as I've gotten older, I've gotten a lot less critical and judgmental of it. Partly because we know that the bad stuff won't last. You know, the next generation will not preserve that thing."}
{"episode_id":"SW - #097 - 2020-04-10 - Timothy Patitsas - Beauty, Complexity and Ethics","start":2962.51,"end":3000.06,"speaker":"Jonathan Pageau","text":"And that's a great thing about understanding complex systems as well, is that you realize that there's an actual natural process by which ugly things get eliminated and beautiful things get kept. You know, it's like when they decide which building they're gonna make a parking lot out of in the city, they're not gonna destroy that, you know, 300, 200 year old Neo Gothic church. They're going to, you know, get that ugly building, that ugly block of cement. I say that, but it's happening in Europe, sadly as well they are. Because the cost of maintaining these buildings is difficult. There are some churches in Europe that are getting bulldozed, right?"}
{"episode_id":"SW - #097 - 2020-04-10 - Timothy Patitsas - Beauty, Complexity and Ethics","start":3000.06,"end":3053.1,"speaker":"Dr. Timothy Patitsas","text":"I mean, if you lose the faith entirely, I mean, it's hard to keep, you know, beauty. It's, it's. And of course there's something in the West a kind of. And Marx saw this and he condemned it. He saw that in a bottom line culture that nothing was sacred and nothing was going to withstand that. And his answer was a kind of violent rejection of just Everything that had led up to that point. My point is that just the quality of our own. If you can fall in love with a beautiful account of the life of St. Seraphim, of Seraphim, you have changed imperceptibly and invisibly. The world situation. You're different. And that's going to radiate out and change the world. It's going to impact the world at any rate."}
{"episode_id":"SW - #097 - 2020-04-10 - Timothy Patitsas - Beauty, Complexity and Ethics","start":3053.34,"end":3108.27,"speaker":"Jonathan Pageau","text":"Yeah, I agree. I agree. And I think that we need to see that also, that acts of beauty, just like acts of love in an interpersonal way, that it is like these little stones that fall into a pond, and you don't know the ramifications of what they have. And so we need to kind of just advance. You know, I just make one icon at a time, and I send them out into these families, into these parishes. And it's. To me, it's a great joy to know that I'm gonna be. That I'm actually participating in someone's life through this act. I'm creating something which is part. You know, I'm communing with them in a way by giving them an object that they will have in their prayer corner that they'll partner, give to their niece who's getting baptized, or whatever it is they're going to do with this icon, that it's not just an object of consumption, it's not just something that you consume, but it's something that you participate in."}
{"episode_id":"SW - #097 - 2020-04-10 - Timothy Patitsas - Beauty, Complexity and Ethics","start":3110.43,"end":3172.84,"speaker":"Dr. Timothy Patitsas","text":"Yes. And it's better to make one good one than five bad ones. Of course, I think in Orthodox cultures, or just. In just any mature culture anywhere in the world that. I saw an interview with a Dalai Lama. Is that how he pronounced it? The Dalai Lama? They had opened a disco near the base of his. And they asked him at the close of an interview what he thought about that. And he took him a while to understand the question, and then he just laughed because he understood that these insubstantial things, they serve their purpose. They have their place. It's just that those of us who are called to do something more enduring have to work a little harder and do our jobs. And they can coexist because, like I said, the one is transitory and the other, it's forever."}
{"episode_id":"SW - #097 - 2020-04-10 - Timothy Patitsas - Beauty, Complexity and Ethics","start":3173.48,"end":3198.31,"speaker":"Jonathan Pageau","text":"Yeah. And that's one of the things that once you understand hierarchy properly, you understand that there's always a fringe. You actually shouldn't get rid of the fringe. It's there, it has a problem, it's problematic, but it's not going away. It's just part of how reality unfolds. There's a narthex, there's a fringe, there are gargoyles on the outside of the church. It's just part of the pattern. You just don't want to confuse which place things have. Right, right."}
{"episode_id":"SW - #097 - 2020-04-10 - Timothy Patitsas - Beauty, Complexity and Ethics","start":3198.31,"end":3217.35,"speaker":"Dr. Timothy Patitsas","text":"What we try to do is take those lower things and elevate them to the supreme value. Even that was interesting for a while, but I think it's important when we are moved to create those higher things, to marshal the support financially and politically and whatever, perish politically and do those higher things and let them endure."}
{"episode_id":"SW - #097 - 2020-04-10 - Timothy Patitsas - Beauty, Complexity and Ethics","start":3219.91,"end":3293.25,"speaker":"Jonathan Pageau","text":"All right, Dr. Timothy, this is a great conversation. I'm going to finish reading your book and I'm hoping that if you want to, I would like to engage on some other aspects of it once I get through. And. And I think also we're going to see some interesting discussion in the comments section and I really encourage everybody to get it. Like I said, it looks really thick, but it's very nice to read because it's kind of a in between a conversation and a scholarly book. It's not just totally conversational, but it's also not. It doesn't have all these footnotes and it's not constantly. It's not technical. And so it's very much. It follows the pattern of what it's talking about, which is the idea of beauty and the idea of narrative and pattern and how this is related to communion and relationship. And so the fact that it's an interview also participates in its meaning. So I looking forward to diving into it even more and check out Hellenic College, everybody, for yourself, for your kids, because we need good places to learn. And with Dr. Timothy there, you know that it's going in a good direction. At least that's what I think for my kids."}
{"episode_id":"SW - #097 - 2020-04-10 - Timothy Patitsas - Beauty, Complexity and Ethics","start":3293.33,"end":3305.25,"speaker":"Dr. Timothy Patitsas","text":"Oh, and I'm just the tip of the iceberg. You should see how holy some of our professors are. But I will say, and if we talk again, then I mention it in the book, but we can talk about what Jane Jacobs said about icons."}
{"episode_id":"SW - #097 - 2020-04-10 - Timothy Patitsas - Beauty, Complexity and Ethics","start":3305.57,"end":3307.65,"speaker":"Jonathan Pageau","text":"Okay. Yeah, definitely. It'd be great to look at."}
{"episode_id":"SW - #097 - 2020-04-10 - Timothy Patitsas - Beauty, Complexity and Ethics","start":3307.89,"end":3317.95,"speaker":"Dr. Timothy Patitsas","text":"And she wasn't a believer, so I trust her more because she had that immediacy in her. She wasn't constrained by some. Something else."}
{"episode_id":"SW - #097 - 2020-04-10 - Timothy Patitsas - Beauty, Complexity and Ethics","start":3318.03,"end":3322.19,"speaker":"Jonathan Pageau","text":"Right. She just had an intuition of what this was. So, yeah, we'll definitely dive into that."}
{"episode_id":"SW - #097 - 2020-04-10 - Timothy Patitsas - Beauty, Complexity and Ethics","start":3322.91,"end":3323.83,"speaker":"Dr. Timothy Patitsas","text":"Thank you, Jonathan."}
{"episode_id":"SW - #097 - 2020-04-10 - Timothy Patitsas - Beauty, Complexity and Ethics","start":3323.83,"end":3325.47,"speaker":"Jonathan Pageau","text":"I think. Dr. It was great to talk to you."}
{"episode_id":"SW - #097 - 2020-04-10 - Timothy Patitsas - Beauty, Complexity and Ethics","start":3325.63,"end":3328.11,"speaker":"Dr. Timothy Patitsas","text":"Thank you to your listeners and viewers and all that."}
{"episode_id":"SW - #097 - 2020-04-10 - Timothy Patitsas - Beauty, Complexity and Ethics","start":3329.15,"end":3394.11,"speaker":"Jonathan Pageau","text":"I hope you enjoyed this episode of the Symbolic World. The Symbolic World is edited by Justin Ward and it is based on a series of videos that you can find on my YouTube channel, Jonathan Pageau's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course, leaving a review on itunes. Everybody knows that's the best way to get the podcast out there to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon Pajo videos as well, and on subscribestar. All those links you can find on my website or in the show description. So thank you and I will see you soon."}
