{"episode_id":"SW - #220 - 2022-02-23 - King David - How to Be a Conservative Rebel","start":0.24,"end":1371.98,"speaker":"Jonathan Pageau","text":"Considering the current state of affairs, there are many people who have asked or have suggested or have wondered how it is exactly that you can be a conservative rebel or a rebel in a time when a system is becoming tyrannical. And so I thought that we could look at how exactly you could do that. And the best way to look at that question is, is of course, to look at the story of King David. In the story of King David, we will find some very surprising imagery, some very surprising use of symbolism that will help us understand when it is that we have to be something like the snake that avoids being caught or something like the. The person who is dancing around the tyrann. This is Jonathan Peugeot. Welcome to the symbolic world. So in the story of King David, King Saul represents very much the tyrannical king. And you can see that he represents the tyrannical king because the reason why God is displeased with him is because King Saul tries to take the sacrifice upon himself. That is, he tries to act as the spiritual authority, to take away the power from the spiritual authority and sacrifice before the prophet arrives, who is the one who's supposed to do the sacrifice. The other place where King Saul disappoints is, is when he does not obey the rule that God gives. Now, that rule is a very, very dark and extreme rule that he receives from God. And one day we'll look at what that is talking about. But for now, it's mostly important to understand that in the story, the reason why he's seen as a tyrannical king is that he wants to concentrate power in himself, take it away from the prophet. And ultimately, you could say, even, let's say, think that he can decide instead of God because Saul is a tyrannical king, then the prophet Samuel will anoint David. God will tell Samuel to anoint David to be the replacement of King Saul. Now, at the outset, King David is hidden. It is not public that he is the future king. At the moment he is hidden, he is the secret king. And as the secret king, it will become necessary for him to actually resist the tyranny of King Saul. Now, what's really interesting is to notice to what extent King David takes on images of all that is dark, all that is shifty, all that is strange, all that is insane. He takes on all that symbolism in the moment when he is resisting King Saul. And so it really is a perspective from the point of view of someone who wants to resist the system, and in order to do so, must take the role of that on which the system is trying to rule, or that which is the kind of bubbling chaos which is at the bottom of the world. Now, this starts with the very image of the fact that the way that David was inserted into King Saul's court was that he was asked to come sing for King Saul. Now, if you read my brother's book, you will see that the fact that you have the king standing there, and then you have King David, who is playing music, trying to calm down the king's ardor, trying to soothe him. And you'll see that at first, he does soothe him. At the outset, King David plays music for the king and soothes the character. So you can actually see, interestingly enough, King David playing the role of the jester, the entertainer, this kind of the moment when work stops, entertainment, all of that, in order to act as a counterpoint to the excess of the tyrannical king. Now. But then once, King Saul is going to start to be jealous of David because you have that moment when King David kills Goliath, and so King Saul becomes jealous of David and so now starts to look out for him. And this is where you're going to see some very interesting symbolism. Now, once again, David is standing there and he's playing music for King Saul. And so he represents all that is, all that is related to time. For example, in Matthew's book, all that is related to the informal, to the un. Let's say, unnamed or something which is not fixed, something which is moving, something which is rhythmic. And what does King Saul try to do? He tries to jab David with his lance and tries by that to pin him to the wall. That's what it says in scripture. And so you can understand that King Saul's desire to jab David, right, to pierce him with a lance is akin to something like, you know, pinning an insect into a. You know, pinning an insect down into a display case. He's trying to fix him. He's trying to stop him from playing music. He's trying to stop him from being that shifty character he wants to name him. And now we, in this image, we see the negative aspect of naming. That is that there is an aspect of naming which, if we're not careful of, about naming, can utterly fix something, can prevent it from having its malleability, its idiosyncrasy, right? Too much light, too much identity can be a very dangerous thing because it can freeze something. It can freeze it into death. And you can see that with people who are too obsessed with naming, too obsessed with control, is that if you exercise too much control over a system that then you can actually cripple it into immobility. You can kill it by piercing it. And so it's very fascinating to see that King Saul wants to jab David and that this is related to fixing him to, you could say something like stopping him from moving, totally identifying him, totally capturing David, you know, like as if he was a wild animal, as if he was a. As if he was something that he's hunting, right? To hunt him down, to find him, to fix him. And this is now an image of the tyrannical state or the tyrannical king that wants to fully master and in that mastery tried to kill it. It has something to do with. I've talked about the notion of the system of the beast or the excess of naming, which comes in all that imagery of 666 symbolism and the idea of marking something right, marking it in a manner that is complete so that there is no remainder, trying to make it so that there is absolutely no remainder, that everything is captured by the system. Now, of course, in our case, this can be completely related to technocratic societies, to societies of surveillance, societies of tracking. And we can see how right now this is being very much accelerated by the state trying to jab us and trying to jab us in a way that fixes us and makes us participate in a system of naming in which there should not be any remainder. And this is why there's so much obsession with making sure everybody is part of the system, you know, and so this is what is happening around it. So it's interesting to see the manner in which David resists this. Now, this is some of the craziest symbolism that you'll ever see, because once David, who is the future king, the king in hiding, becomes a, let's say, becomes a target for the tyrannical system, then David will take on all the symbolism of the opposite, all the symbolism of the strange, of the enemy and of madness. And this, of course, interestingly enough, starts with a moment where King David isn't sure whether or not Saul is really angry with him and whether or not Saul still wants to kill him. So after David runs away, you know, when. When Saul tries to. To pin him to the wall, he comes back and then he speaks to his friend Jonathan, and he asked Jonathan, like, you know, what's the situation? And Jonathan is telling him, I'm going to go back to see my father, and you stay here. And so if my father asks for you, that is, if he asks for you in an angry way. That is, if he wants to know where you are, if he wants to make sure he knows where you are, that you've been properly tracked, then it means that you're in danger. If he's angry that you're not there, that he wants you to be in his court, then you'll know that you're in danger. But if he does, if it doesn't bother him that you're not fully in his court, that you're not there at this moment, then we'll know that you're not in danger. So Jonathan goes back and then realizes that King Saul gets very angry because David is not there. But what's interesting is the sign that Jonathan gives to David. So he says, when I come back, you're going to hide next to a target, and then I'm going to shoot an arrow, right? I'm going to miss the target. And the manner in which I miss the target is going to be a symbol. It's going to be an image of what you need to do, whether you should come back or whether you should go away. Now, this is extremely interesting if you understand the notion of transgression, if you understand the notion of sin, that here in this situation, missing the target, not hitting the mark, is the manner in which the shifty character that David now represents, you know, the kind of the wild character that he's becoming, is to know what to do and so you can understand what's going on, that things are really. David is really representing now in a very strange way, something like the dragon that is avoiding to be pierced by St. Michael. But here in this case, it's. It's, of course, David which is the good. We'll see why he is the good in this case and why he's not the same type of dragon that you see in the icon of St. Michael and the dragon. But the imagery is the same, right? St. Michael is trying to pierce the dragon, is trying to fix the dragon. And it's funny because a lot of people have pointed out to me that the image of St. Michael smashing his lance in the dragon's mouth looks like the COVID test. Looks like you're receiving a COVID test. And there's something about that. There's something intuitive about the idea of being penetrated by the state in a manner in which they want to do that in order to make sure that you're part of their system and to kind of make you understand your position vis a vis the state. And so you can see that if you think that that's stretching it. There are some governments, for example, the Chinese government, which allegedly were using other types of penetrations in order to know whether or not you had Covid, which is obviously not necessary at all. But it can help you understand what it is that's going on. That is. That is. There is something. There is something which is even sometimes beyond the people that are implementing it, that they don't necessarily. I'm not saying this is planned to be this way, but it's still manifesting a pattern of penetrating and related to identity and fixing. It's just there. So what does King David do now? King David obviously has to now run away. And in his running away, it is so fascinating what happens. First of all, he has to hide inside the temple. And in hiding inside the temple, the priests end up giving him the bread that is in the holy place, the bread that is for the priest. And so you'd say, what is going on? Like, what is happening? And so the priests are giving him the bread. He is not taking it for himself. That's very important. And you can maybe say that that's the difference between him and King Saul, which is that in a manner, David is now engaging in a form of transgression. Right. But this transgression is. There's something innocent about the transgression. And this is where we're going to start to see the difference. There's something innocent in his transgression. But it's not only that. What does David receive when he goes to see go into the temple? He received Goliath's sword. Now receiving Goliath's sword will be compounded by the fact that David will then go and associate himself with the Philistines, will actually go to the city from which Goliath comes from and will place himself under the guardianship of the kings and the people responsible for the Philistines. And he pretends to fight for the enemy. This is very interesting. But there are other scenes where he also pretends to be crazy. He feigns madness in the wilderness. He assembles in a cave with a band of debtors and a band of shady people. And so these gestures are all gestures about, you know, moving into the margin, going down into the cave, going into death, aligning yourself with the stranger, aligning yourself with your enemy. All of these things in a way that I've warned you about, that happens on the periphery. Now. This is what David is doing. And so what is the difference between David and just a traitor? What's the difference between David and. And a Regular thief and a regular debtor. And the answer is something like his intention. What is his intention and how does that intention play itself out during the story? Now, this might seem like it's a trick or might seem like it's something off, but you can see if you look at the story carefully, you'll notice, for example, when David is working with the Philistines, I forget now if it's the Philistines, but one of the enemy tribes of the Israelites, he pretends that he's fighting for them, that he's actually fighting the Israelites, but in secret he is defending them. And he is doing other things. He's attacking other tribes while they think that he's with the enemy. He acts crazy. He's actually pretending to be crazy in order to get away from his enemy. And then when he comes at a moment, dark deep down in the cave where he's hiding, and then King Saul comes down in the cave, this is one of the most powerful images of understanding what's going on in this story. So King Saul goes down into the cave where David is hiding, and King Saul doesn't know David's there. And King Saul goes there to do his business, you know, it says to cover his feet, you know. And while he's down there doing his business, David sneaks up behind him while he's going about and he cuts off the fringe of his vestment. When Saul leaves the cave, King David brandishes the fringe of the vestment of Saul as a guarantee that he is not there to kill the king, that he has the fringe, but that he has no intention of killing the king. So this is really the difference between David and a revolutionary. It's the difference between. It's the difference between a protest, an antifa protest, and the trucker convoy. Look at the differences between the two. And so one of them, let's say the antifa protest wants to. Wants to usurp the government, wants to destroy the power of the state. Hates, you know, anything about the nation, is hiding their faces, you know, is destructive, attacks federal buildings, does all that. You saw that in 2020. We saw that during the Floyd protest. Antifa attacked federal buildings in the US for months on end. If you look at the trucker convoy protests, what you have are people waving the flag of their country, you know, hundreds of Canadian flags and hundreds of Quebec flags and people basically being extremely respectful to police, you know, going up there fist bumping the police. And I've seen it myself, I was there in Ottawa, you know, the truckers are extremely respectful of authority, extremely respectful of police, but are saying, we know this is edgy. Like, we know that what we're doing is maybe illegitimate in its practice, but that the intent is, we want to restore the rule of law. We want to restore the identity of our nation. Now, you can argue with them whether or not this is what ultimately it'll do or not. And you can argue with them whether or not you think they're misguided or that they're in error. But you can still see the difference between something like a conservative rebel who is acting in a rebellious manner, he's acting in a technically sinful manner that is willing to miss the mark or to avoid the mark in order to not propagate a tyranny, but rather point their own country, their own higher identity towards a higher purpose. And so you see that, of course, also in the same situation where King David walks into the camp while Saul is sleeping, and then he finds a lance. I think he actually finds Saul's lance. So you have a sense in which he could take that lance and could now do the same to Saul that Saul tried to do to him, to pin him to the ground, right? To stop him in his tracks, to fix him. But instead he plants the lance above Saul's head and therefore spares him. And also shows you exactly what's going on. That is, that's how. That's the difference. Where are you looking? If you resist the system, you have to be doing it in a way that's looking above the system, that's looking towards a higher point, a higher point of attention. You can resist the system when a system becomes corrupt, as long as you have your attention towards what is right and what is virtuous. And of course, in a certain manner, you could say, history will judge you. And maybe there's a manner in which it's a tricky position to be. Because to a certain extent, you can understand the criticism of those that do that. But we see that example in the story of the church constantly, right? My own patron saint, Saint Maximus, is a wonderful example of that. Where Saint Maximus thought that the emperor was wrong in his theological pronouncements, and he said, no. And the emperor said, look, look around us. Everybody agrees with me. The patriarch of Constantinople agrees with me. You know, everybody agrees with me. Why won't you agree with me? And Tim Maximus said, no, I cannot agree with you. I will not go along with your system. Because he was looking above, he was looking higher, and you could see that there was error in the way that the king, the emperor was acting and that the patriarch was acting. And so, like I said, it's a tricky position to be, because to a certain extent, you also kind of have to accept the consequences of doing that. You have to accept the consequences that if you're going to want to avoid a tyrannical system, if you're going to want to point to a higher meaning, that means that you will become the victim of the system. You're going to, you know, and that's the position we're in right now. You know, I. I mentioned this before, but right now in our province in Quebec, they are demanding people use vaccine, passports in order to go to church. And to me, that is a problem of hierarchy. And so at that point, when this, when these things start to happen, then there is no choice but to position yourself as someone who is resisting a illegitimate tyranny, a tyranny which is excessive in its grasp, which is trying to take the powers of God for themselves, an authority which is trying to name without exception, which refuses to leave a fringe. And sometimes it becomes the role of actually the conservative person who actually believes in hierarchy to raise up that fringe and show it back to the authority and remind them, remind them of the fringe and the need to leave an exception. That you cannot encompass everything, that you are not God. And trying to encompass everything is going to lead to massive chaos and a massive breakdown. And so I hope this was helpful. I hope it's helping you understand some of the things that I've been saying in the past few weeks, some of the things that I've been doing on social media. But it's just starting because this is happening now. And so thanks for your support, everybody. Thanks for your attention. And you might have noticed there are few, maybe a few less videos as usual these days. But hopefully as my attention starts to focus back again, then we will have more of that coming very soon. I hope you enjoyed this episode of the Symbolic World. The Symbolic World is based on a series of videos that you can find on my YouTube channel and Jonathan Pedro's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course, leaving a review on itunes. Everybody knows that's the best way to to get the podcast out there to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon, the Pageau videos as well, and on Subscribestar, all those links you can find on my website or in the show description. So thank you and I will see you soon."}
