{"episode_id":"SW - #244 - 2022-07-27 - The Wages of Sin Is Death","start":0.24,"end":57.63,"speaker":"Jonathan Pageau","text":"There's a verse which is very famous. Most people who have been in contact with Christianity have heard it. And you know, if you someone who's trying to convert you, often they will cite you this verse, it is from the Book of Romans. For the wages of sin is death. The gift of God is eternal life in Christ Jesus our Lord. So what I would like to do is I would like to look at that verse in its basic concepts in the Book of Romans and look at how this, the structure that St. Paul traces for us in the Book of Romans, and especially in this section, can really help us understand the way that symbolic structures work, the way that things hold together in the world, and that ultimately what St. Paul says is fractally true at every level and isn't just a question of morality or of dying and going to heaven and all that kind of stuff. And so hopefully we can have a fruitful experience examination of this passage."}
{"episode_id":"SW - #244 - 2022-07-27 - The Wages of Sin Is Death","start":69.31,"end":72.99,"speaker":"Announcer","text":"This is Jonathan Peugeot. Welcome to the symbolic world."}
{"episode_id":"SW - #244 - 2022-07-27 - The Wages of Sin Is Death","start":83.55,"end":1047.71,"speaker":"Jonathan Pageau","text":"So I'm going to read part of the text, maybe not the entire text. It's from Romans 6. I will start at verse 15. You can read around it if you want to get more context than what I'm going to say. And so I'll start with 14 actually. So St. Paul is talking about becoming free from sin and becoming attached to grace, becoming slaves of God, becoming slaves of grace and no longer being slaves of sin. And so he says, for sin shall no longer be your master. You are not under the law, but under grace. What then shall we sin because we are not under the law, but under grace? By no means. Don't you know that when you offer yourselves to someone as obedient slaves, you are slaves to the one you obey, whether you are slaves to sin, which leads to death, or to obedience, which leads to righteousness. But thanks be to God that though you used to be slaves to sin, you have come to obey from your heart the pattern of teaching that has now claimed your allegiance. You have been set free from sin and have become slaves to righteousness. I am using an example from everyday life because of your human limitations. Just as you used to offer yourselves as slaves to impurity and to ever increasing wickedness, so now you offer yourselves as slaves to righteousness leading to holiness. When you were slaves to sin, you were free from the control of righteousness. What benefit did you reap at that time from the things you are now ashamed of? Those things result in death. But now you have been set free from sin and have become slaves of God? The benefit you reap leads to holiness, and the result is eternal life. For the wages of sin is death. But the gift of God is eternal life in Christ Jesus our Lord. And so, obviously, I'm not going to go through all the implications of this text. We're going to look at the manner in which this text connects to the basic symbolic structure that I often talk about, let's say, the way in which things hold together in hierarchies in the world. Of course, this does not take away from, you know, the usual interpretation that you might see in the Church Fathers, but hopefully this will at least help those people that follow my work kind of see how it connects to what I'm trying to explain to you. One of the things that St. Paul is doing, of course, in the Book of Romans, is he's distinguishing something like the law as a bunch of rules you follow from allegiance or faith or attachment or something, which is more than just following a bunch of rules, which is grasping the higher reality that you're participating in. And so this is not complicated. It sounds complicated. It's not complicated at all. And so you could say that if you grasp, for example, you know, the reason why the rules exist, then those rules become almost irrelevant because you understand why the rules are there, and therefore you naturally embody what the rule is trying to capture, right? And so if you understand why it is good to be honest and to care for your neighbor because you love them and you see the face of God in them, and because you see them as brothers and sisters, then rules about not stealing and not breaking into people's houses and not doing all these things or are going to be irrelevant to you. You know, you don't have to. In a certain manner, you don't have to follow those rules explicitly because the behavior that you will have will implicitly flow from the attachment to the higher ideal. You know, and this is, of course, the same for many things that are even something like that are technical. You know, if you understand, you know, if you understand the purpose of something you're making, you will be less bound by all the steps you're making to do them. So a chef, for example, someone who's not very good at cooking, will follow recipes very strictly, will read all the instruction we'll put them. But once you understand cooking and you understand, let's say, what it is you're trying to accomplish in terms of taste, in terms of experience for the people, then you don't really need cookbooks so much anymore. You might look at them, you know, as a. As a Basic guide, but usually you. You've imbibed the reason why you're making food, and you've kind of reached a level of attachment and expertise that means that you don't need the rules so much anymore. And so this is really what St. Paul is talking about, but obviously talking about it in terms of your own personal life and in terms of the manner in which you exist. And so when you exist under grace, this is a way to understand it, the difference between existing under the law and existing under grace. When you have captured the higher participation, then you exist. Something like under grace, you don't have to follow a bunch of rules, you don't have to do a bunch of things, but rather the things you do flow from above. They don't just. Just exist below. And this is really trying to help you understand this notion of the. The hierarchy of beings. I've talked about this before, which is the idea that faith is this jump from the bunch of things you need to do into the gestalt, into the one thing above in this hierarchy of beings that is holding everything together. And once you grasp that, and it really is, it's important to understand that it's not just kind of like a. An intellectual thought. It really is a grasping. It is a. An allegiance. It is a. It is more like something akin to, let's say, exactly the way St. Paul talks about it. It is more something like becoming a slave in the sense of having your allegiance to that thing. And so if you love something and you've submitted yourself to it and you've dedicated your allegiance to it, then, like I said, naturally will flow from you the behaviors that are part of it. And St. Paul is. It's really smart. What he does is that he is explaining to you that if you, for example, like, if you have your allegiance to sin, that is, if you have your allegiance to something which misses the mark, to these parasitic processes that we talk about a lot on this channel. These. These behaviors and these patterns of being that think that they have it all, you know, together. Then you don't have to follow any laws, do you? There are no laws. You know, there aren't no laws to. To, let's say, overeating. It's like you just are a slave to that pattern and your behavior flows freely from that slavery. And so St. Paul, he says. He says, look, I'm going to talk to you in a way that you can understand, right, because of the weakness of your flesh. But he's saying it's kind of like that. It's like the way in which you are a slave to sin and your behavior freely flows from that slavery, that that's the way that you are going to be a slave to God. That is, if you attach yourself to God, then you live in grace and your behavior will simply flow from that, from above, let's say. And so it might seem weird to people, but he's also trying to help you understand that it really is about submitting yourself to the right principality and entering into that principality. It's not so much about rule than about a bunch of stuff you do. Rules in a bunch of stuff you do. And the laws in the Bible are useful. They can kind of help you gather things together. And sometimes they can help you see dimly what it is that the rule is aiming for. But if you just follow the rules, then you're never going to be transformed. You're never going to reach, you know, all the elements below don't give you that which is above, right? All the elements of a pen or a glass or a table or a team or whatever. The none of them give you the reason. The reason is above. You access it through faith, and then it flows down into the behavior through grace. And there's something natural about the way that identity flows down from in this hierarchy of beings. And anybody who has experienced it will know the difference, right? Once you kind of grasp going upstairs and going downstairs, you don't have to break it down into all the different behaviors you're doing. But if you're teaching a child, let's say, to go upstairs at first, you know, you maybe you will tell them, do this, do that. This is the way to do it. Be careful of this, be careful of that. And there's an indefinite amount of things that you could tell the child to do. And what you're hoping is that will kind of help them see. And once they grasp it, then you don't have to give them any rules anymore. They just do it naturally and it flows from there. And so the way that St. Paul presents it, it really is to. To a certain extent the idea of attachment and fruits. And so what it is that you're attached to will produce fruits because they are bound. You know, it really is like a tree that has an identity, that it's an apple tree or whatever. And that tree then naturally will release its identity into these. These manifestations into the fruit. And this is what St. Paul is. These are all the images that St. Paul is trying to help you understand. And so he's saying that when you attach yourself to these parasitic processes. When you attach yourself to death, that is, if you enter into, you know, a behavior that acts only for itself. You know, when you lie, that's what you usually do. When you lie, you usually sacrifice the higher relationship you're having with the person in front of you in order to get something. And so the lie is always parasitic because it is putting, you know, whatever it is you want to get, or even if it's just influence or, you know, whatever it is higher than. Than the communion of you between the person you're talking to. And so once you enter into that, what it does because it's a parasitic process, it's not sufficient. It doesn't have what it needs to ultimately hold. And it will devolve into what John Verveghe calls reciprocal narrowing, which is that the behaviors of the sin, they'll kind of self devour because they don't have enough to sustain you. And the fruit of that is death. That is what death is. Death is when the aspects of a being start to, let's say, isolate themselves from each other and start to become more independent from each other in a way that is no longer unified. And so when you're a slave to sin, what ends up happening is your behavior start to fragment. And you can have different obsessions. You can swing from one side to the other. You can love and hate things at the same time. And you can, you know, you'll compete between these different passions that you have within you, and that will slowly devolve into little tyrannies and also into fragmentation of yourself. And so the wages of sin is death is a description about how reality works. But the gift of God is eternal life in Christ Jesus our Lord. That is when you attach yourself to Christ. That is when you attach yourself to the Incarnation. When you do attach yourself to the place where heaven and earth meet, to the place where these invisible purposes and identities that come from heaven meet with earth, all the potentialities. That is when the gift of God flows down from you. That is when once you're in that spot, that is when you have faith in Christ, then out of that will flow natural behaviors will flow, grace will throw things that won't feel like a bunch of rules that are binding you, but also will not produce fruits that narrow and that are parasitic and will eat you up as you're kind of devolving. And so that's why it's experienced as a gift. And so you can understand it like the identity of anything that you're participating in is something like a Gift which flows from above. It's something that you can't get at the level. Level. So you can't get at the level of the behaviors. Whether it's like a. Like I always use the same examples, but like, if it's a sports team, you know, you can learn to pass, you can learn to. To dribble, you can learn to, sorry, let's say a basket. Yeah, basketball team. So you can learn to pass, you can learn to dribble, you know, you can learn to run, you can learn to. To shoot. But if you just have these bunch of things, you never will get. The essence of the game. The essence of the game flows down like a gift from heaven. And it gives meaning to all these behaviors that you're participating in. And so there is something of grace in the manner in which the purpose of basketball and the reality of basketball flows down into all the elements that constitute it. So if you miss the mark in basketball, right? If you're not able to reach that goal properly, then you lose, right? You lose the game. You don't win, you know? You know. But if you're able to truly, let's say, attach yourself to the. To the purpose, then you will have something like fullness of life in not fullness of life metaphysically, but like fullness of basketball, right? Fullness of basketball as you play it. And this is what. This is what scales up all the way to the idea of your very existence, which is that if you don't realize what the law leads to, if you don't realize that the law is there because to kind of help you see dimly to the purpose of things, or if you attach yourself to sin, then you're not going to have fullness of life. But if you attach yourself to the incarnation, to the place where this comes together in the heart, let's say through the heart, through faith, through trust, you know, through love, through all these things that bind reality together, then what will flow down from heaven is that it will flow down fullness of life, which will come down from the Father above and will fill everything that you are part of with meaning, with purpose, with light. And so it really is a description of just basic description of reality. And the paradox that St. Paul is able to bring about is it doesn't happen by doing a bunch of things. It happens by submitting yourself to the highest principle, by becoming a slave to that which is above you, the right aspect that is above you. And the surprise of that is that it actually fills you with freedom. And this is something that you know, that I've talked about recently as well, which is that freedom doesn't just mean you do whatever you want to do. Freedom can only exist as bound by a higher purpose. If you drop someone in the ocean, you know, and you say you're free, it's like, okay, free to do what? Right? You're free to just be there, you know, and to swim around. But if I give you a purpose, if I bind you to a higher purpose, then you can experience within that purpose the parameters of choice, the parameters of direction. All of this will appear bound by higher purposes. And so that's also very important. So the. It is a paradox, but it's a paradox which is not a. Not a contradiction. It is that if you submit yourself to a higher purpose, then in that slavery, you will experience a kind of freedom within those parameters. So if you become a slave to God, if you become a slave to the source of all reality, if you become a slave to the incarnation, to Christ, that is the place where all the patterns and all of potential meet in the heart, then you will have fullness, fullness of life, and it will appear to you as a gift. So hopefully this is not too abstract, it's not too complicated. I just wanted to help people see how St. Paul, especially St. Paul, is really, really talking about the nature of reality and how reality works very often, especially when he uses the images of bodies and of heads, of a heart, all of this idea of tree and fruits, all of these things. He's really talking about a very powerful structure of how reality works. So hopefully this was helpful and will help you at least try to read St. Paul with that different vision and try to understand it fractally. And remember that it's not just a technical question. It does obviously scale up into your very transformation and your attachment to God. But you can also try to do it fractally. So you can see if I can understand it at different levels of reality, then I have maybe a little bit of a better grasp of on what St. Paul is saying. So thanks everybody for your time and I'll talk to you very soon."}
{"episode_id":"SW - #244 - 2022-07-27 - The Wages of Sin Is Death","start":1048.03,"end":1110,"speaker":"Announcer","text":"I hope you enjoyed this episode of the Symbolic World. The Symbolic World is based on a series of videos that you can find on my YouTube channel, Jonathan Pageau's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that it's quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course, leaving a review on itunes. Everybody knows that's the best way to get the podcast out there to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon the Pageot videos as well, and on subscribestar, all those links you can find on my website or in the show description. So thank you and I will see you soon."}
