{"episode_id":"SW - #223 - 2022-03-09 - Doug TenNapel - Christianity and Pop Culture","start":12.08,"end":15.6,"speaker":"Jonathan Pageau","text":"This is Jonathan Peugeot. Welcome to the symbolic world."}
{"episode_id":"SW - #223 - 2022-03-09 - Doug TenNapel - Christianity and Pop Culture","start":25.77,"end":27.69,"speaker":"Doug TenNapel","text":"Well, hello. Welcome to the discussion."}
{"episode_id":"SW - #223 - 2022-03-09 - Doug TenNapel - Christianity and Pop Culture","start":28.49,"end":43.33,"speaker":"Jonathan Pageau","text":"Hey, Doug. It's really good to meet you. I'm happy to finally meet you in person. I've had a lot of people tell me, you need to contact Doug. You need to contact Doug. And so finally, I saw you on Twitter. I think we were following each other, and it was kind of informal, and then."}
{"episode_id":"SW - #223 - 2022-03-09 - Doug TenNapel - Christianity and Pop Culture","start":43.33,"end":59.31,"speaker":"Doug TenNapel","text":"Here we go. Yeah. I love your work. I love your work. And I think I got a hold of you through. I think I found out about you through Reagan Lodge probably a year ago. I. Okay, so. So. But what the audience may not know is this is the first time we've talked to each other live."}
{"episode_id":"SW - #223 - 2022-03-09 - Doug TenNapel - Christianity and Pop Culture","start":59.47,"end":71.75,"speaker":"Jonathan Pageau","text":"Yeah, definitely. No. The first time we've ever. We've ever exchanged except for a few messages on. On Twitter. And so. Yeah, the same. You know, it's like I knew you for sure when I was at. When I was a kid, you know, like a kid. A teenager."}
{"episode_id":"SW - #223 - 2022-03-09 - Doug TenNapel - Christianity and Pop Culture","start":71.75,"end":72.07,"speaker":"Doug TenNapel","text":"Yeah."}
{"episode_id":"SW - #223 - 2022-03-09 - Doug TenNapel - Christianity and Pop Culture","start":72.07,"end":76.59,"speaker":"Jonathan Pageau","text":"Like, I remember you from Everyone Knows My Word. Yeah. For the earthworm stuff."}
{"episode_id":"SW - #223 - 2022-03-09 - Doug TenNapel - Christianity and Pop Culture","start":76.59,"end":76.83,"speaker":"Doug TenNapel","text":"And then."}
{"episode_id":"SW - #223 - 2022-03-09 - Doug TenNapel - Christianity and Pop Culture","start":76.83,"end":91.94,"speaker":"Jonathan Pageau","text":"But that, like, I just. I guess it's when he kind of came back online, like a few years ago or like a year ago when. When you started reworking on the. On that property. Then I'm like, wait a minute. He's done a lot of stuff. And so I started looking into the other stuff that you. You worked on."}
{"episode_id":"SW - #223 - 2022-03-09 - Doug TenNapel - Christianity and Pop Culture","start":91.94,"end":99.94,"speaker":"Doug TenNapel","text":"I'm busy. So for my audience, this is Jonathan. It's Pay it. Wait, let me. Wait, don't tell me. Don't help me. Paju."}
{"episode_id":"SW - #223 - 2022-03-09 - Doug TenNapel - Christianity and Pop Culture","start":100.42,"end":112.64,"speaker":"Jonathan Pageau","text":"Pajo. Dang. It's really hard to say in English because it's a. It's really. There is no equivalent in English of like an ah and a soft J and an o. So people really struggle to remember that."}
{"episode_id":"SW - #223 - 2022-03-09 - Doug TenNapel - Christianity and Pop Culture","start":113.28,"end":134.24,"speaker":"Doug TenNapel","text":"Okay. Pageo. And my name is Doug. But I put Jim down here to foil YouTube just in case any of this ever ends up on YouTube. I've had seven channels shut down, so I always just go as Jim just to bug them. Oh, my goodness. The face recognition will destroy my channel. And your channel for people who want to find you is for my people who want to find you. What's your channel called?"}
{"episode_id":"SW - #223 - 2022-03-09 - Doug TenNapel - Christianity and Pop Culture","start":134.52,"end":139.72,"speaker":"Jonathan Pageau","text":"So it's just Jonathan Pedro or the Symbolic World. Usually if you type either of those, you'll find my channel."}
{"episode_id":"SW - #223 - 2022-03-09 - Doug TenNapel - Christianity and Pop Culture","start":139.8,"end":156.76,"speaker":"Doug TenNapel","text":"Yeah. Symbolic World. And you. And you get some serious views on there. You. So I recently saw you. You've interviewed with Jordan Peterson. You've had big names, kind of philosophy people. Right. In art and Christianity. Art. And are you orthodox Is that right? What are you."}
{"episode_id":"SW - #223 - 2022-03-09 - Doug TenNapel - Christianity and Pop Culture","start":156.76,"end":184.92,"speaker":"Jonathan Pageau","text":"Yes. Yeah, I'm orthodox and for sure I'm interested in trying to figure out a way for people to tell better stories today. And I think that the story, for example, for sure, the story of Christ and the Bible stories in general, they're just such an amazing template and people tend to not see it that way. They want to. They're afraid of seeing them as stories almost. You know, it's like they afraid. They almost. It's like it's dangerous to the Bible to see the stories, but the stories in there are so powerful in terms of their structure."}
{"episode_id":"SW - #223 - 2022-03-09 - Doug TenNapel - Christianity and Pop Culture","start":185.48,"end":265.89,"speaker":"Doug TenNapel","text":"And you see it where I see it is camp putting puzzles together with the beloved Ms. Tenaple on my dining room table and she's just listening to Handel's Messiah and it's like this chorus is coming in and singing, you know, where his shape or whatever it is. You know, it's one of the songs and, and you keep going like it reminds you that that is the greatest story ever told because we've heard it so much. It's like, eh, it's Christmas time. But then when you hear a choir gear up and you hear a song like that that stood the test of time and it's huge and full of wonder, they're reminding you of the first time the story ever happened is. Guys, this is the most mind blowing. If you just step away from it of a God, you know, and man falls and then a God has this plan and he sends prophets and kings or whatever, and the God himself comes as his son. You know, the second part of the Trinity comes and dies for people's sins who are in debt to this God. And you just, you go, this is the weirdest story ever told. It is the greatest, weirdest. So I love that the, the people in the past that made big deals out of the art and the music kind of refresh it for us who are a little more jaded and it's all kind of old news. You got to see it afresh."}
{"episode_id":"SW - #223 - 2022-03-09 - Doug TenNapel - Christianity and Pop Culture","start":266.13,"end":266.97,"speaker":"Jonathan Pageau","text":"Yeah, definitely."}
{"episode_id":"SW - #223 - 2022-03-09 - Doug TenNapel - Christianity and Pop Culture","start":266.97,"end":267.65,"speaker":"Doug TenNapel","text":"Amazing story."}
{"episode_id":"SW - #223 - 2022-03-09 - Doug TenNapel - Christianity and Pop Culture","start":268.02,"end":314,"speaker":"Jonathan Pageau","text":"Yeah, I like to see it too. What I like to help people do is to see the story of Christ in the. A lot of people that find the story of Christ boring or you are not super interesting and just show them how it's informed every single one of our story today. You know, all those movies you like, all those, all those heroes you enjoy, they're all completely informed by the story of Christ. But it's like, like you said, it's like, it's as if it's so comfortable for us that we don't see it anymore. We take it for granted and we can denigrate it even, you know, see it as something that's not super interesting. But without that story. Yeah, the stories, the stories of the ancient world, of the ancient Greeks were very different. Like their heroes were very different from our heroes. And that's not an arbitrary. The change isn't arbitrary. It was really brought about by. By the idea of self sacrifice that Christ exemplified."}
{"episode_id":"SW - #223 - 2022-03-09 - Doug TenNapel - Christianity and Pop Culture","start":314.24,"end":340.59,"speaker":"Doug TenNapel","text":"Yeah. So if I was a materialist, you know, a secular progressive, I would say, oh, stories, there's no God stories would have evolved to where we're at now in the west anyways. What unique characteristics do you think are the, like the main, the big one of Western storytelling that say, you'd see in a Western comic book or movie that you wouldn't say in like a Shinto Buddhist anime?"}
{"episode_id":"SW - #223 - 2022-03-09 - Doug TenNapel - Christianity and Pop Culture","start":341.23,"end":341.71,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #223 - 2022-03-09 - Doug TenNapel - Christianity and Pop Culture","start":341.71,"end":342.67,"speaker":"Doug TenNapel","text":"Story structure?"}
{"episode_id":"SW - #223 - 2022-03-09 - Doug TenNapel - Christianity and Pop Culture","start":342.99,"end":407.31,"speaker":"Jonathan Pageau","text":"Well, I do, I do think that for sure, the story of. Of self sacrifice or the idea that the main or the hero character, the strong character. Right. The one that kind of exemplifies the apex of a culture, that his purpose is to sacrifice that strength for people that are weaker than him. I think that that for sure is something that we do not see. Like I always joke around and say, you know, if you look at the ancient heroes, like Hercules, you know, was a hero despite the fact that he slaughtered his own children. You know, and Achilles, Achilles is the big hero in the, in the Iliad, but he's pouting in his tent because someone took away a sex slave. It's like, that's not a Christian hero. Right. The knight is the Christian hero. The idea of someone who has become very strong, very powerful, but then puts his power and his strength to the service of the weaker. And that has become the trope of every single superhero comic. And even if they do it an antihero, they're still saying it's an antihero. They're like, here's an upside down version of what the real story is, which is this hero that sacrifices himself."}
{"episode_id":"SW - #223 - 2022-03-09 - Doug TenNapel - Christianity and Pop Culture","start":407.31,"end":434.51,"speaker":"Doug TenNapel","text":"They still all admit what the real story is. It's why I always liked satanic heavy metal. You know, by them acknowledging. By ACDC singing Highway to Hell. They actually are talking about hell and acknowledging it. They know that to be a badass, you don't make fun of Zeus, you make fun of Jesus Christ. And that's why I laugh all the time. They try and come up and go and make fun of my religion or whatever. I'm going, oh, you're Just acknowledging how powerful and really how true it is."}
{"episode_id":"SW - #223 - 2022-03-09 - Doug TenNapel - Christianity and Pop Culture","start":435.01,"end":466.01,"speaker":"Jonathan Pageau","text":"Yeah, no, that's for sure. I definitely. I even. I even made a video called, like, the Apotropaic Function of Heavy Metal and how, like, embodying heavy metal people without knowing it by embodying the upside down. They're almost like Christian gargoyles, you know, like these monsters on the edge that remind you what's on the inside. It's like, okay, I can see your. It's like. It's interesting. Your heavy metal Persona is interesting. But I'm pretty sure I can't build a society on that. You know, Even though it's kind of fascinating, I know that I can't really build my family and society on that. So I'll go back to the other, you know."}
{"episode_id":"SW - #223 - 2022-03-09 - Doug TenNapel - Christianity and Pop Culture","start":466.01,"end":475.03,"speaker":"Doug TenNapel","text":"But you were singing the truth. There are no stop signs, no speed limits, and nobody's going to slow you down. You're on a highway to hell."}
{"episode_id":"SW - #223 - 2022-03-09 - Doug TenNapel - Christianity and Pop Culture","start":475.03,"end":475.87,"speaker":"Jonathan Pageau","text":"Yeah, exactly."}
{"episode_id":"SW - #223 - 2022-03-09 - Doug TenNapel - Christianity and Pop Culture","start":476.27,"end":480.35,"speaker":"Doug TenNapel","text":"I just repeat the lyrics back to them and they're like, how could you say that? Well, you sang it first."}
{"episode_id":"SW - #223 - 2022-03-09 - Doug TenNapel - Christianity and Pop Culture","start":480.75,"end":483.91,"speaker":"Jonathan Pageau","text":"That's right. It's. It's your actual tropes about what's going on."}
{"episode_id":"SW - #223 - 2022-03-09 - Doug TenNapel - Christianity and Pop Culture","start":483.91,"end":489.39,"speaker":"Doug TenNapel","text":"You can only say it in sarcasm. You can't say it straight. That's the most offensive thing you can do."}
{"episode_id":"SW - #223 - 2022-03-09 - Doug TenNapel - Christianity and Pop Culture","start":490.35,"end":527.35,"speaker":"Jonathan Pageau","text":"So I've been. I've been really curious, like, one. I guess the. I've been really curious about yourself because, you know, you've been existing mostly in this kind of secular story world where, you know, you've been able to kind of bridge a little bit and even into Hollywood, I think I've heard a little painfully, let's say, like, it's been frustrating for you, but, like, I know you've been able to bridge these different secular places. And so my. I guess I'm curious to know how you feel. Like, the Christian story informs the stories that you tell. Like, how do you. How are you able to without. Like, I know you're not. For sure. You don't go into moralism, you don't go into that kind of stuff. Like, I don't see that in your work. But how do you. How does that, like, underlie your storytelling?"}
{"episode_id":"SW - #223 - 2022-03-09 - Doug TenNapel - Christianity and Pop Culture","start":527.75,"end":730.91,"speaker":"Doug TenNapel","text":"Sure. So. And for my audience also, you do comics, you do prints, you do great, fantastic art. So we'll. I'll. I'll need to get your link so I can link into all that stuff. I don't do the moralistic stuff because I don't think moralism is the true way to salvation either. So I'm kind of wasting my time. If I'm just teaching people how to be nice, okay, so that doesn't save us all. So instead, and this is where I'm influenced by our heroes, Tolkien, C.S. lewis, G.K. chesterton, George McDonald, guys who also weren't that interested in moralism of just like be good, you know, and that wins the day is to be good. That's not what they were saying. It's the good often has to go through incredible suffering. And by the suffering that they demonstrate in their characters, they show that the good is worth giving up appetites for. So I'm looking for something deeper. And story is the best place, you know, to do that. Fiction, fairy tale, fantasy is a great place to start putting a twist on your reality to help people see it in a new way. Okay, so that's, that's what Jesus did with parables too, is if I come in the front door and I tell you Jesus died for your sins, right? You might go, you might be a secular progressive, you'd go, ah, I dismissed that. But if I came to you and said Gandhi believed a truth about peace and everyone turned their back on him and they even beat him, they mistried him and beat him, you know, they'd throw Martin Luther King in jail. He was shamed for what he believed. I'm telling Christ's story, but I'm putting a purely secular thing that they respected skin on it, really getting them to see the truth of the situation without putting the Jesus name on it. Okay. Because what Jesus did is amazing. Even if his name was Chuck, okay, we just know him as Jesus because that was his name and that was the symbols and the real life events that God used. At the time it was Jewish and in Rome they were putting people on a cross. It would be just true if his name was Jim. It happened 2,000 years later and he was put in an electric chair, false tried or whatever, he would still have to be God. So I'm not saying, you know, it's like a washed out myth, but if I can just remove those symbols where I can get you to see something more clearly. And that's what like Planet of the Apes did it for white people is, it was talking about racism. And here's the astronaut, you know, comes to a place where he was this big heroic astronaut. Now he's on the bottom, treated like a slave, put in cages by a bunch of apes, you know, and they are, they're cheating to win, you know, they're giving men lobotomy so that they actually do speak dumb. And they're implying that men are dumber and things like that. That was what Rod Serling was saying with that script. So I have a better idea. He forced me to experience empathy by removing my common vocabulary. So I can just keep dismissing that story and keep just. I don't have to listen to the Christian story until someone comes in and tells it, you know, a different way with a sacrificial and unforgiven or magnificent stuff and, Or Iron Giant, you know?"}
{"episode_id":"SW - #223 - 2022-03-09 - Doug TenNapel - Christianity and Pop Culture","start":730.99,"end":785.39,"speaker":"Jonathan Pageau","text":"Yeah, yeah, that's, Yeah. I mean, I think that that makes a lot of sense. And I think that the references that you bring up are just because I feel like right now there's, there's a moment. I mean, maybe it's just because I'm there. And so I, I, it's my experience, but there's, there's this weird buzz around, at least in my world, where there's a lot of people, artists that are actually converting to Christianity, writers, musicians, you know, visual artists, and, and there's a desire to, to tell better stories also because of the whole, you know, everybody's, know the whole, the whole woke problem and how stories have become so ideological that it's as if there's a vacuum that's been created. And all of a sudden people are realizing, wait a minute, now is. It's a frustrating, tough and annoying time to be in because all these stories are horrible, but it's also an opportunity to tell better stories. And I get the sense that there's a. There's some kind of a movement in the air."}
{"episode_id":"SW - #223 - 2022-03-09 - Doug TenNapel - Christianity and Pop Culture","start":785.63,"end":808.49,"speaker":"Doug TenNapel","text":"What's the greater threat to story, do you believe? Because this keeps me up at night. Is it woke ideology being forced on. On storytellers so they can only tell one kind of story? Or is it general illiteracy so that we're no longer drawing from the deep wells of the enlightenment, of the, the Iliad and Shakespeare and all that? Which is worse?"}
{"episode_id":"SW - #223 - 2022-03-09 - Doug TenNapel - Christianity and Pop Culture","start":808.97,"end":858.95,"speaker":"Jonathan Pageau","text":"I think one feeds the other. Right. If you look at the way that Mao did his Cultural Revolution, that was the point. The point is we need to derac. We need to pull out the roots so that we can now put in our own story. So I feel like those two are kind of happening at the same time, where on the one hand, people don't know the ancient stories, don't know, you know, have lost their connection to the Bible story, to the ancient myth. You know, they don't know them. And then at the same time, then we're putting in something which is like a saccharine version, but because you don't have the real one, then you can still kind of eat the, the cheap one, like the cheap fake one. It doesn't totally disgust you. Like it would disgust you if you had those original stories. But because you don't, you're like, okay, you know, I can, I can. It's like, it's like a diet, like a bad diet, but it's better than eating nothing, let's say."}
{"episode_id":"SW - #223 - 2022-03-09 - Doug TenNapel - Christianity and Pop Culture","start":859.68,"end":876.96,"speaker":"Doug TenNapel","text":"But 50 years ago though, even if you were an atheist, you couldn't be a smart elite guy. Unless you'd read Pascal, unless you'd read Virgil. And today you can be a teacher of literature and not read that stuff."}
{"episode_id":"SW - #223 - 2022-03-09 - Doug TenNapel - Christianity and Pop Culture","start":877.28,"end":881.8,"speaker":"Jonathan Pageau","text":"But you can see because it's the postmodernism. Postmodernism brought about both at the same time."}
{"episode_id":"SW - #223 - 2022-03-09 - Doug TenNapel - Christianity and Pop Culture","start":881.8,"end":882.12,"speaker":"Doug TenNapel","text":"Yeah."}
{"episode_id":"SW - #223 - 2022-03-09 - Doug TenNapel - Christianity and Pop Culture","start":882.12,"end":894.54,"speaker":"Jonathan Pageau","text":"So postmodernism said the hierarchy of stories that you have is, is a horrible patriarchal imposition. So we need to get rid of that. And so then they get rid of the classics, they get rid of all the stories that people use to happen."}
{"episode_id":"SW - #223 - 2022-03-09 - Doug TenNapel - Christianity and Pop Culture","start":894.54,"end":911.14,"speaker":"Doug TenNapel","text":"The truth is, whatever I gurgitate in me, not out there. That guy was just some old dead dude. What grasp on the truth does that objective thing out there have on me? I have internal. I have something truer, what I feel I don't need to read. By the way, Christians do it too."}
{"episode_id":"SW - #223 - 2022-03-09 - Doug TenNapel - Christianity and Pop Culture","start":911.22,"end":911.98,"speaker":"Jonathan Pageau","text":"Oh yeah, for sure."}
{"episode_id":"SW - #223 - 2022-03-09 - Doug TenNapel - Christianity and Pop Culture","start":911.98,"end":929.84,"speaker":"Doug TenNapel","text":"Because they're like, why am I going to read this book book when I can just experience by rolling my eyes up in my head and just praying and feeling the worship music really, really hard. I don't need the Bible. I have a direct connection to him. What, I don't need the booby prize of his word."}
{"episode_id":"SW - #223 - 2022-03-09 - Doug TenNapel - Christianity and Pop Culture","start":930,"end":995.21,"speaker":"Jonathan Pageau","text":"Yeah, no, you're for sure there's been a dumbing down of Christianity too. You can see it in like the lyrics of worship songs just, you know, from like a hundred years ago to today, you can just see how, how they just become dumber and dumber and dumber. And now they're basically just pop love songs, you know, with the name of Jesus in them. So I think that it's all kind of happening simultaneously and it's creating this vacuum that is. It's scary because on the one hand it's being filled with a kind of new. This kind of new woke religion because people have a desire for the sacred. They have a desire for something higher. So they're seeing it in whatever it is they can get. But. Yeah, so we need, to me, like, I see it as a crisis moment even for us, that is that Christians and people who, even people that are Maybe not super Christian, but that at least see the world kind of falling apart. You have to understand that these stories hold, used to hold our world together. And if we can't have people that are willing to dive back and to retell these stories in a way that is, that is able to catch people's attention, then it's not a pretty sight what's coming."}
{"episode_id":"SW - #223 - 2022-03-09 - Doug TenNapel - Christianity and Pop Culture","start":995.53,"end":1017.26,"speaker":"Doug TenNapel","text":"And, and we right now are reaping the whirlwind, I would guess, of the 70s and 80s. Okay, what are they going to reap? What world are they going to reap from today? Because are you optimistic of the future or are you putting your bunker together?"}
{"episode_id":"SW - #223 - 2022-03-09 - Doug TenNapel - Christianity and Pop Culture","start":1017.5,"end":1025.18,"speaker":"Jonathan Pageau","text":"So I, I, I have, yeah, I have short term pessimism and long term, like, you know, positive."}
{"episode_id":"SW - #223 - 2022-03-09 - Doug TenNapel - Christianity and Pop Culture","start":1025.5,"end":1033.05,"speaker":"Doug TenNapel","text":"Only because God wins. Only because God always wins. But you're going to get thrown in the meat grinder in the meanwhile. You're going to get jobed."}
{"episode_id":"SW - #223 - 2022-03-09 - Doug TenNapel - Christianity and Pop Culture","start":1033.13,"end":1071.65,"speaker":"Jonathan Pageau","text":"Yeah, I see suffering in the short term, that is for sure. But I think like, there's not much else we can do except to, you know, to, I mean, I think there's two things we can do. One is, of course, we need to deal with our own lives and, you know, straighten ourselves up and, you know, look to Christ as our, as our guide and our example and try to live in his, in his life. And then the second one is for us artists, it's like make better stories, tell better, you know, make better images, tell better stories and do it in a way that is both completely connected to the, to the ancient stream, but also surprising enough that it's not just pastiche and kind of bland copying."}
{"episode_id":"SW - #223 - 2022-03-09 - Doug TenNapel - Christianity and Pop Culture","start":1072.53,"end":1093.77,"speaker":"Doug TenNapel","text":"Now I'm a mutt Evangelical, I'm a Presbyterian this week, Reformed Presbyterian this week. You're Orthodox is. And we're watching our churches just getting completely taken over by the woke, BLM rainbow, all that stuff. Is there a threat to that in Orthodoxy where there's so much more liturgy and ritual and old stuff to protect them?"}
{"episode_id":"SW - #223 - 2022-03-09 - Doug TenNapel - Christianity and Pop Culture","start":1094.01,"end":1113.12,"speaker":"Jonathan Pageau","text":"Well, there's a, I would say there's a, the battle is there in the Orthodox Church. It's there. And we know who the people waging that battle are. They're, they're recognized. But I would also say that the resistance is still very much the majority. I mean, when I say very much, I mean like 95 the majority."}
{"episode_id":"SW - #223 - 2022-03-09 - Doug TenNapel - Christianity and Pop Culture","start":1113.44,"end":1125.76,"speaker":"Doug TenNapel","text":"So because of that, I can't say that in our churches. My personal church. Yeah, 95, probably 99 in my personal church across Christendom in the South. Oh, no, it's done, guys."}
{"episode_id":"SW - #223 - 2022-03-09 - Doug TenNapel - Christianity and Pop Culture","start":1127.84,"end":1171.34,"speaker":"Jonathan Pageau","text":"The Orthodox, the Orthodox Church in The south is actually doing very well right now. It is doing really well. They. They are. They're growing. They have a lot of young catechumen, a lot of young people coming in. And there's this, like. Because. I think it's also because the thing about liturgy, or the thing about, let's say, traditional forms is that I can kind of understand why people wanted to get rid of them, because they wanted to connect culture. They wanted to connect to the popular world. Like, there was this desire to. To reach out as far as possible. But now, as, let's say, the Christian story itself is kind of crumbling. There's a sense in which, okay, so why would I go to church to go to a concert and listen to a conference when I get way better. Way better concerts here and way better speakers here? It's like, if that's what's being offered, then maybe I just need to."}
{"episode_id":"SW - #223 - 2022-03-09 - Doug TenNapel - Christianity and Pop Culture","start":1171.82,"end":1180.86,"speaker":"Doug TenNapel","text":"I don't need to go to church to see a mediocre message and listen to mediocre music with mediocre people. I don't need to go to church for that."}
{"episode_id":"SW - #223 - 2022-03-09 - Doug TenNapel - Christianity and Pop Culture","start":1181.1,"end":1225.01,"speaker":"Jonathan Pageau","text":"And so one of the things that liturgy offers, though, is that if it's. If it's. Because it's thousands. It's thousands of years of buildup, you could say. So you can imagine people refining this. These patterns and these analogies. It's mostly typology like, that are refining this typology for 2000 years. And so even if they have the most boring priests in the world, if you're attentive to the words that are being sung, you just always have these amazing surprises, especially around feast. And when it's more like a feast day, then you have these crazy relationships between the Old Testament and the New Testament, this kind of playing back and forth where you. Yeah, for me, it's always. I can always fall back on the liturgy because it's never stupid. It's never stupid. It's never."}
{"episode_id":"SW - #223 - 2022-03-09 - Doug TenNapel - Christianity and Pop Culture","start":1225.09,"end":1227.81,"speaker":"Doug TenNapel","text":"Yeah, it's kind of stood the test of time."}
{"episode_id":"SW - #223 - 2022-03-09 - Doug TenNapel - Christianity and Pop Culture","start":1227.89,"end":1228.65,"speaker":"Jonathan Pageau","text":"Yeah, definitely."}
{"episode_id":"SW - #223 - 2022-03-09 - Doug TenNapel - Christianity and Pop Culture","start":1228.65,"end":1286.55,"speaker":"Doug TenNapel","text":"You know, those are great rituals and stories, and there is a great hunger for ritual. I have seen Peter Lightheart from the south is bringing a lot more rituals back into the Reformed Church. So we ourselves practice. We're. We're doing Advent now, but we do practice more. For instance, I've seen just a tiny step toward a lot of congregations having communion every week instead of. It used to be like, once a quarter or, you know, whatever. And now it's. We're seeing. There is a recognition that there's hunger there and that our Our buildings are just awful, you know? Yeah, it's just awful. And you go into Orthodox guys. There's an Orthodox guy's house right across the way from us here. We meet at his house and we talk about Chesterton. We have a meeting group between Orthodox Catholics, Evangelicals and Reformed, you know, so it's like before, man. We get in arguments. But going to the house, it's an Orthodox guy. And I go into his library, man, and there's all these just beautiful works of art."}
{"episode_id":"SW - #223 - 2022-03-09 - Doug TenNapel - Christianity and Pop Culture","start":1286.63,"end":1290.63,"speaker":"Jonathan Pageau","text":"Wait, is it. Is it. Is it who I think it is? Is it Terry Mattingly? Is that him?"}
{"episode_id":"SW - #223 - 2022-03-09 - Doug TenNapel - Christianity and Pop Culture","start":1290.87,"end":1291.67,"speaker":"Doug TenNapel","text":"No, no, no."}
{"episode_id":"SW - #223 - 2022-03-09 - Doug TenNapel - Christianity and Pop Culture","start":1292.31,"end":1295.35,"speaker":"Jonathan Pageau","text":"He was like. He said hi to. I say hi to Doug. He's my. He's my friend."}
{"episode_id":"SW - #223 - 2022-03-09 - Doug TenNapel - Christianity and Pop Culture","start":1295.35,"end":1320.68,"speaker":"Doug TenNapel","text":"Yeah, yeah. I'm real good friends with him. I've known Mattingly. I love that guy. No, it's. John Singleton is the group. The guy. And it's just. We have different theologians come in and speak every month. I haven't been in a while. But then they let. And we pass a microphone around and people. It's open discussion stuff. I only know that in his house, I can tell kind of what. What religion he is by looking at the. The symbols and stuff."}
{"episode_id":"SW - #223 - 2022-03-09 - Doug TenNapel - Christianity and Pop Culture","start":1320.68,"end":1321.08,"speaker":"Jonathan Pageau","text":"I go."}
{"episode_id":"SW - #223 - 2022-03-09 - Doug TenNapel - Christianity and Pop Culture","start":1321.08,"end":1331.57,"speaker":"Doug TenNapel","text":"It's just beautiful and gold leafing and, you know, it's just cool. So, okay, where else can we go with this? Because we're comic book guys."}
{"episode_id":"SW - #223 - 2022-03-09 - Doug TenNapel - Christianity and Pop Culture","start":1332.45,"end":1346.45,"speaker":"Jonathan Pageau","text":"Yeah. Well, I mean, like, for me, the comic book world is new to me. Like, it's new, and it's not new. It's actually. It's actually returning to my roots when I was a teenager. Like, I was really into comics when I was a teenager. And so now we're putting out triptychs."}
{"episode_id":"SW - #223 - 2022-03-09 - Doug TenNapel - Christianity and Pop Culture","start":1346.45,"end":1350.13,"speaker":"Doug TenNapel","text":"You know, triptychs were before all that stuff. So there is, you know."}
{"episode_id":"SW - #223 - 2022-03-09 - Doug TenNapel - Christianity and Pop Culture","start":1350.53,"end":1382.15,"speaker":"Jonathan Pageau","text":"Yeah. And also the way that it was done in the books, like in medieval books, there is. There's already the beginning of something like the comic book thinking in the way that they would put scenes next to each other and have some bleed over into the other. A lot of the stuff that. Even the more contemporary, like the comics in the. You know, after that started breaking the boxes and started, you know, doing this bleeding stuff is. Or go into the margins. And this is something that was. You can see medieval manuscripts. That's. It's pretty amazing to notice that the relationships that are happening there."}
{"episode_id":"SW - #223 - 2022-03-09 - Doug TenNapel - Christianity and Pop Culture","start":1382.31,"end":1404.14,"speaker":"Doug TenNapel","text":"Yeah. And is it. You know, a lot of. A lot of Christians want to know what to do with their art. They feel helpless. They feel limited, afraid to make a wrong move. And how can one Dumb comic make a difference. Maybe we're trying to make too much of a difference instead of just enjoying the beauty of making something true."}
{"episode_id":"SW - #223 - 2022-03-09 - Doug TenNapel - Christianity and Pop Culture","start":1404.38,"end":1404.94,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #223 - 2022-03-09 - Doug TenNapel - Christianity and Pop Culture","start":1405.42,"end":1411.42,"speaker":"Doug TenNapel","text":"So what do you. If you were going to give advice? Because everyone always asks that advice, young Christians saying, what do I do?"}
{"episode_id":"SW - #223 - 2022-03-09 - Doug TenNapel - Christianity and Pop Culture","start":1412.03,"end":1455.64,"speaker":"Jonathan Pageau","text":"Yeah, well, listen, I mean, I think that we're in an interesting moment and we'll see how it plays out because we're kind of on our comic. We're kind of taking something of a risk in the sense that I feel like if Tolkien at the time, when he was writing, he had to write his Christian worldview into a completely fantastical frame. Right. Something happened in the 90s and the 2000s and it was related to comics actually. Something happened where people started using the Christian worldview or kind of you could call like a Christian mythological structure, but to. To attack or to be very subversive towards Christianity. So you had like Alan Moore and his Swamp Thing. He did a lot of Christian stuff, but it was twisted and it was weird and it was all kind of a cult and stuff."}
{"episode_id":"SW - #223 - 2022-03-09 - Doug TenNapel - Christianity and Pop Culture","start":1455.64,"end":1460.92,"speaker":"Doug TenNapel","text":"Yeah. And you can see Pullman did it with His Majesty's Dark Materials or whatever it's called. Pullman."}
{"episode_id":"SW - #223 - 2022-03-09 - Doug TenNapel - Christianity and Pop Culture","start":1460.92,"end":1461.28,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #223 - 2022-03-09 - Doug TenNapel - Christianity and Pop Culture","start":1461.28,"end":1462.96,"speaker":"Doug TenNapel","text":"And like Neil Gaiman Compass."}
{"episode_id":"SW - #223 - 2022-03-09 - Doug TenNapel - Christianity and Pop Culture","start":1463.36,"end":1528.64,"speaker":"Jonathan Pageau","text":"Neil Gaiman used Milton's poem as a structure for Season of Mist, basically. Like his Lucifer character is the Lucifer from Milton's poem. And so I started noticing that like in the 90s and then the early 2000s, there were a bunch of movies like was it called Stigmata? And then, then Da Vinci Code. And I was like, you know what? Actually I think that now's the time for Christians to take back the Christian legendarium, you would call it, to go back into all these, these mythological structures that are in Christianity and reappropriate them now in a surprising way to kind of tell the story that no one expected. And so that. So our story is basically taking all the weird stuff in Christianity, all the kind of stuff that people would have used to make fun of Christianity, and flipping it back into a story that's celebratory and that is kind of like celebrating the Christian story, basically. So we've got like dog headed men and we've got weird saints, St. George, St. Simeon who stands on a pillar. We have giants and dragons and all the, all the stuff that, that a lot of modern kind of materialist Christians don't want to talk about. We just kind of jammed that into one story."}
{"episode_id":"SW - #223 - 2022-03-09 - Doug TenNapel - Christianity and Pop Culture","start":1528.96,"end":1552,"speaker":"Doug TenNapel","text":"Yeah. And today Christians is because, just because Christianity is so out of fashion that Christians deal with a lot of shame And a poor self image. They just, they. Christ hung on a cross naked and bore our shame. And then our payment back for his salvation is to be ashamed of him, you know, in public. To a public that has no right to be proud of anything."}
{"episode_id":"SW - #223 - 2022-03-09 - Doug TenNapel - Christianity and Pop Culture","start":1552,"end":1587.47,"speaker":"Jonathan Pageau","text":"You know, that's so torturous. But I see what you're saying. Completely. But I would tell. So I would tell Christian artists to dive back into the stories, right? To know your Bible stories, and not just the Bible stories, but to know the stories of the early Christians, the early saints, and then to dive into the Christian legends. The Christian legends are way better than the anime that you'll watch. You know, people don't know the Arthurian legend. Don't know, like, for example, the legends of Alexander the Great. They don't know all of these crazy, amazing legends that we have. People have just completely forgotten them."}
{"episode_id":"SW - #223 - 2022-03-09 - Doug TenNapel - Christianity and Pop Culture","start":1587.71,"end":1610.43,"speaker":"Doug TenNapel","text":"And in early America, like, Paul Bunyan was the greatest. Not Paul Bunyan, Bunyan. The Pilgrim's Progress was the top selling book at the beginning of America. It was like they couldn't make enough of them. Yeah. And you know, that was common language. Everyone knew that story was part of pop media back then. Yeah, man."}
{"episode_id":"SW - #223 - 2022-03-09 - Doug TenNapel - Christianity and Pop Culture","start":1610.67,"end":1639.27,"speaker":"Jonathan Pageau","text":"So. But now we have an opportunity which is, you know, like in the, in Lord of the Rings or you see in certain fantasy tropes where you have this lost lore, like a lost kingdom that is gone and that, you know, someone is now like rediscovering almost like, like a detective. Now we can do that with Christianity. Like, you can actually treat Christianity like that as this, like, exciting hidden gems that are scattered around the world that people can discover and find. I think that it's. That it's actually an opportunity for storytelling because."}
{"episode_id":"SW - #223 - 2022-03-09 - Doug TenNapel - Christianity and Pop Culture","start":1639.27,"end":1661.72,"speaker":"Doug TenNapel","text":"Yeah, a canticle for Leibowitz, the guy that did the rose did something like that. He was a secularist, so he was like saying, you know, they found this past religion or whatever, but you could do a dune thing where you go back and find the old scriptures, you know, and they're in space and it's a. Like, Josiah, you know, they bring back the scripture. It's like, what is this? You know, and they could find it anew."}
{"episode_id":"SW - #223 - 2022-03-09 - Doug TenNapel - Christianity and Pop Culture","start":1661.88,"end":1671.4,"speaker":"Jonathan Pageau","text":"Yeah, the Josiah example is a great example. Like to use that trope as a. As a way to kind of tell the story of rediscovery, I think is. I think it's a. It's. It's. I think there's a lot of possibility there."}
{"episode_id":"SW - #223 - 2022-03-09 - Doug TenNapel - Christianity and Pop Culture","start":1671.64,"end":1754.49,"speaker":"Doug TenNapel","text":"Yeah. And then I also. Loosely, in my stories, I also do. I. First of all, I do celebrate Pop media, because I am also a, a victim of my culture, you know, of just loving the Beatles and Captain Crunch cereal and just junk. So I don't mind speaking the language of the tax collectors and whores of my time. I'm very much a part of that. But so I don't mind having even pop Christianity in my work, you know, both pop secularism and pop religion in my work. But then I say something very serious, which might be. A lot of my stuff is very pro family and pro dad. Anytime I tell a pro dad story, it's not about human dads. I'm really paying tribute to my father, God, who I believe is being undermined by a worship of a female Gaia in feminism is to undermine the masculine nature of God. And I don't mean a God who lifts weights. I just mean a God who when he draws the line, leadership, self sacrifice, being a servant of all and all that, I see as very masculine traits. And those are being just excommunicated from our society at an alarming rate, including dads and the family structure and all that, it's getting just torn apart before. So I don't mind telling stories in tribute to that."}
{"episode_id":"SW - #223 - 2022-03-09 - Doug TenNapel - Christianity and Pop Culture","start":1754.92,"end":1776.68,"speaker":"Jonathan Pageau","text":"Yeah. And I think we always have to remember that Dante wrote his poem in Italian, he didn't write his poem in Latin. We always think that we have to be high minded about the way that things present themselves. But I think that the most powerful version, the scripture, the gospel, was written in Koine Greek. It wasn't written in classical Greek, a lesser language."}
{"episode_id":"SW - #223 - 2022-03-09 - Doug TenNapel - Christianity and Pop Culture","start":1776.76,"end":1777.12,"speaker":"Doug TenNapel","text":"Right."}
{"episode_id":"SW - #223 - 2022-03-09 - Doug TenNapel - Christianity and Pop Culture","start":1777.12,"end":1798.1,"speaker":"Jonathan Pageau","text":"Yeah. So I think that the joining of really the high pattern, like the powerful structure that you find in the first chapter of Genesis or that you find really in the story of the incarnation, but then using that and not being afraid of bringing it down to the common place, I think is something that creates the most powerful, the most powerful stories."}
{"episode_id":"SW - #223 - 2022-03-09 - Doug TenNapel - Christianity and Pop Culture","start":1798.74,"end":1853.69,"speaker":"Doug TenNapel","text":"I also always speak the language of my secular world. It's, I really have very little to say to Christians. I'm not trying to convert the people who are already in the, you know, in the barn. I'm, I'm leaving the 99 to go after the 1, or in this case, I'm leaving the 1 to go after the 99 out in the storm. And so I really want to make a case for them to kind of tie a knot in the bottom of this rope of meaning and give them something to hold on to. So you mentioned earlier that a lot of people are finding Christ today because as Paul said, where else will you go? You know, when you're at this point of despair. And to the people out there who, when there's. You can go nowhere else, like there's. Oh, you're going to come sooner or later, or you will reject the only point of meaning for everyone. That's my statement to Jordan Peterson. I hope he comes and moves out here to Nashville. We'll have a cigar right there. His daughter's already here, so he might as well just."}
{"episode_id":"SW - #223 - 2022-03-09 - Doug TenNapel - Christianity and Pop Culture","start":1854.01,"end":1854.97,"speaker":"Jonathan Pageau","text":"You're in Nashville."}
{"episode_id":"SW - #223 - 2022-03-09 - Doug TenNapel - Christianity and Pop Culture","start":1855.05,"end":1857.29,"speaker":"Doug TenNapel","text":"I'm. I'm in Franklin, Tennessee, so I'm just south."}
{"episode_id":"SW - #223 - 2022-03-09 - Doug TenNapel - Christianity and Pop Culture","start":1857.61,"end":1857.97,"speaker":"Jonathan Pageau","text":"Okay."}
{"episode_id":"SW - #223 - 2022-03-09 - Doug TenNapel - Christianity and Pop Culture","start":1857.97,"end":1858.21,"speaker":"Doug TenNapel","text":"Yeah."}
{"episode_id":"SW - #223 - 2022-03-09 - Doug TenNapel - Christianity and Pop Culture","start":1858.21,"end":1859.85,"speaker":"Jonathan Pageau","text":"Jordan was there, like, last week, I think."}
{"episode_id":"SW - #223 - 2022-03-09 - Doug TenNapel - Christianity and Pop Culture","start":1859.93,"end":1865.41,"speaker":"Doug TenNapel","text":"Yeah, I know. I'm gonna get him out here. I'm. I'm gonna force him by the sword to convert to Christianity."}
{"episode_id":"SW - #223 - 2022-03-09 - Doug TenNapel - Christianity and Pop Culture","start":1865.41,"end":1868.61,"speaker":"Jonathan Pageau","text":"It's gonna buy this sword. Just like the old Charlotte."}
{"episode_id":"SW - #223 - 2022-03-09 - Doug TenNapel - Christianity and Pop Culture","start":1868.61,"end":1868.81,"speaker":"Doug TenNapel","text":"Good."}
{"episode_id":"SW - #223 - 2022-03-09 - Doug TenNapel - Christianity and Pop Culture","start":1868.81,"end":1870.97,"speaker":"Jonathan Pageau","text":"Charlemagne. Who doesn't like Charlemagne?"}
{"episode_id":"SW - #223 - 2022-03-09 - Doug TenNapel - Christianity and Pop Culture","start":1870.97,"end":1892.76,"speaker":"Doug TenNapel","text":"Where's those? What happened? That's how dad did it. All right, we're going to wrap it up. We can always do another talk some other time. Jonathan, I've had a blast with you, and this is just to keep it compartmentalized. If people like it, like, pass this link around, tell your friends about it, that Jonathan and Doug are tearing it up."}
{"episode_id":"SW - #223 - 2022-03-09 - Doug TenNapel - Christianity and Pop Culture","start":1893.72,"end":1902.33,"speaker":"Jonathan Pageau","text":"All right. Well, no, it was great to talk to you and. Yeah. So I would like to send you, definitely send you a copy of our book and get your very honest opinion."}
{"episode_id":"SW - #223 - 2022-03-09 - Doug TenNapel - Christianity and Pop Culture","start":1903.28,"end":1913.36,"speaker":"Doug TenNapel","text":"Yeah, yeah, I'd love to see it. I'll send you my address and we'll give it a review. We'll spread the link around and I'll end the broadcast now. This has been the Doug and Jonathan Show. All right."}
{"episode_id":"SW - #223 - 2022-03-09 - Doug TenNapel - Christianity and Pop Culture","start":1913.44,"end":1975.43,"speaker":"Jonathan Pageau","text":"I hope you enjoyed this episode of the Symbolic World. The Symbolic World is based on a series of videos that you can find on my YouTube channel, Jonathan Pageau's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by, of course, leaving a review on itunes. Everybody knows that's the best way to get the podcast out there to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon, the Pageot videos as well, and on subscribestar. All those links you can find on my website or in the show description. So thank you and I will see you soon."}
