{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":0.32,"end":10.08,"speaker":"Jonathan Pageau","text":"So that's Paul's last words, is go to church. You know, find an estuary or at least some club, like a knitting club or something. Like, you know, be connected with people."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":10.48,"end":12.64,"speaker":"Paul Vander Klay","text":"Build your family ships with people."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":12.88,"end":13.52,"speaker":"Jonathan Pageau","text":"That's right."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":13.68,"end":58.16,"speaker":"Paul Vander Klay","text":"Learn to build relationships with people. Because again, my sense is with a lot of younger people, like, you're right, when we were growing up, you were just with people. There wasn't any of these screens to be with people through or to have this deceptive form of community. And those are skills you need to learn to develop. And it's a lot better than having a six pack or being your ideal weight or getting some great degree or some, you know, some uber great job. The skill of interpersonal relationship is the most. One of the most important skills you can develop in your lifetime. And, and there's no other way to do it but by doing it with people in real life."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":69.76,"end":90.18,"speaker":"Jonathan Pageau","text":"This is Jonathan Peugeot. Welcome to the symbolic world. So let's just say hi to everybody because we don't know, it's like, we don't know how to introduce it. Just a conversation with Paul and Jonathan."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":90.42,"end":186.3,"speaker":"Paul Vander Klay","text":"The Thunder Bay Conference is coming up where John Vervake, Jonathan and I are going to be meeting with another professor from, from Thunder Bay. That's coming up in September. I've got this trip that I leave next, less than a week from now for Europe, trying to sort of gather and strengthen the estuary groups. And I'll be talking to a bunch of people. And so I asked John, Jonathan to meet. John is traveling today, so he couldn't meet and. Well, why don't we talk about the status of the conversation? I put out a video last week. When I got back, I had some personal vacation time that I was taking and then I listened the video dropped of your conversation with John and David Fuller, which I thought was a terrific video. And I also thought that your conversation with Jordan and John, to me, that conversation felt like, okay, we're sort of getting things back on track in some ways, almost all the way from 2018. You, me and John have sort of kept pecking away at this. Jordan's kind of been on the outside. I thought your conversation with Jordan right when he got back was outstanding. But how, I mean, where do you see? We were talking about consciousness. That's what the conference in Thunder Bay is going to be about. We're talking about attention. I thought Jordan's conversation with Ian McGilchrist was very interesting. I haven't watched yours with him yet. So where do you see? Well, let's talk about the conversation, then let's talk about the embodiment. So where do you see the state of the conversation right now?"}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":186.54,"end":408.02,"speaker":"Jonathan Pageau","text":"Well, the first thing to say, too, is that the conversation that Jordan just put up with John Rivaeke and the conversation that happened with David Fuller, those two parts, those were filmed like one day after the other. And so there's a through line in terms of the conversations. There's a, you know, there's a. Not a mood, but there's. There's a lot of things boiling that we ended up covering, you know, both in the conversation with Jordan, then also in our conversation together, because we record. Actually recorded this conversation with Jordan first, and then the conversation that came out earlier, we recorded after. So some of it was actually going back over some of the things we talked about with Jordan. And so I think that things are moving, at least to me, things are moving in the right direction. And, you know, I also did some discussion with some more cognitive scientists, Ian and Renato Kastrup, and also Don Hoffman, to kind of see if the ideas that we're playing with in terms of. In terms of, first of all, the primacy of attention, also in terms of what you could call the levels. Right. I think that's how you talk about it. The idea of a fractal relationship between these different levels. So kind of self. Same structures that embody themselves, embed themselves into each other. If those make sense to them, like if they make sense to these other cognitive scientists. And the answer is yes. Like, it really there seems to be. Although, you know, in both of my discussion with. With Don and with Bernardo, for example, there were some things that. That kind of scraped a little bit. You know, Don Hoffman's idea of, like, the VR glasses, like, he doesn't see, he doesn't have this sense that John Vervaeke, for example, talks about beauty as revealing, and he sees it completely as a. Almost like a lie. Like, as if our experience of the world is this lie. And I was trying to push him to say, like, okay, well, then what? Like, you know, so I think that. I think that everything is kind of moving along. And what I'm noticing is that more and more people are understanding what the subject is. They're understanding what it is that we're talking about. They're also understanding this question of level. I think most people understand that now and how attention, let's say something like the highest form of attention is something like worship. That a part of the highest form of attention is something like sacrifice. That sacrifice and worship are related and that that is what creates bodies. And that it's not just about something that happens mentally is that the sacrifice of attention, the sacrifice of worship creates the body in which we then move. You know, and so. So I think that that's. I think that that's where we are, that most people would kind of understand that and understand that it. It happens individually in you. Right? It happens that in terms of families, in terms of teams, in terms of the church, and also happens in parasitic ways. Sometimes when we talk about. When we talked about demons or parasitic processes that are both individual and social or at larger scales that we can see this. We can. Most people now, I think, not most people. Me, I don't know most people, but at least a good group of people understand what this is about and can now make sense of something like angels and demons and a lot of the language that is in scripture in a way that doesn't seem arbitrary to them. That seems now like, okay, this is actually. This is not just like a declaration of someone who says he saw God and God told him to say something and now he says it. No, this is. St. Paul is describing reality in ways that are extremely powerful and that if we can just have the key to what he's saying, that it's as relevant as anything these cognitive scientists are saying. So I think that I hope that's where we are. Maybe it's more of a hope that I'm expressing."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":408.34,"end":434.55,"speaker":"Paul Vander Klay","text":"Well, I think at least those who are following these conversations, I think people are. Even the way in which we grasp or appropriate this knowledge is not the way in which we, in a modernist frame, imagine what knowledge is and how we appropriate it. I don't know if that makes any sense because I think, you know, when."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":434.55,"end":472.79,"speaker":"Jonathan Pageau","text":"I look at what's not just information, it's not just. You can't just get it from accumulating information. There's a. There's a change that happens. It has to happen like a. Like a conversion. We could say, you know, in a small C conversion that needs to happen or else people will think. And you've seen it. Like some people are saying, oh, there it's all gibberish. What they're saying is just a bunch of gibberish because they listen, they hear, but they don't. Because they can't see the. What it is that you have to change your worldview basically to really understand it. And that's not a mental process. It's something which is actually precedes mental processes. It's like a insight and intuition. It's a. I don't know."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":472.95,"end":474.15,"speaker":"Paul Vander Klay","text":"It's. It's a vision."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":474.39,"end":474.87,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":475.03,"end":548.32,"speaker":"Paul Vander Klay","text":"And I think so. You know, I. When I listen to these conversations, I always try to see if I can translate it into terms that people who maybe didn't go to college or, I mean, kind of people that I preach to on a regular basis in church. The video I just put out this morning, I've been looking at Oliver Sacks, his work, and he had a really lovely chapter on the simple. And the simple are those who can't do abstraction, but they very clearly live in the world of the concrete. And I was struck in listening to that chapter in his book, the man who. Who Mistook his. His Wife for a Hat. There's a level here of. Of practicality. And so, okay, I look at this, and I hear. I mean, someone like Nate up in the UK saying, well, this is just gibberish. And I talked to him on Twitter a little bit this. And I probably will talk to him again about it, but I think still in sort of a modernist worldview, people look at this conversation and think, well, this will help me get what I want, instead of understanding that this will change what you want."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":548.88,"end":551.52,"speaker":"Jonathan Pageau","text":"Yeah. Yeah. That's a great way to say it."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":552.24,"end":662.73,"speaker":"Paul Vander Klay","text":"This will change what you think is good, what you think is beautiful, and what you think is true. And it's actually at that level of transformation that we do need to be changed. And I think part of what's powerful in, let's say, having these conversations with John Vervaeke, with Jordan, and with, let's say, David Fuller, is that in some ways, you know, because these individuals are. Are on the different side of the Christian line, let's say, in some ways that I think for the church. I mean, where I come at this thing is as a preacher, intelligibility is key. And what's been happening for the last 200 years in a lot of ways, is that we've seen the church accommodating to modernity and trying to do that translation through it. And now I think we're beginning to see it from the other side, where there's at least been enough of a sea change that the church can point to things that are not modern. They might be older than modernity, and they include things that are now coming after modernity. But the church can begin to make intelligible. For me, it's. It's making the Bible intelligible again, actually, because that's. That's my main job as a preacher, to make the Bible intelligible. And the more I, you know, the deeper I got into Lewis, let's say. And, you know, part of the reason his book Miracles has been, to be quite honest, I remember seeing Jordan Peterson and I'd. Seeing something there that was in the Biblical series. And then in his classroom lectures, I said, wow, this is really helpful. And because I'd been reading C.S. lewis's book Miracles, like, two, three times a year for a couple of years."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":662.81,"end":663.21,"speaker":"Jonathan Pageau","text":"Wow."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":663.21,"end":755.36,"speaker":"Paul Vander Klay","text":"To sort of combat modernity in me because I just. I just felt myself increasingly becoming a reductionist modernist. And I knew. Part of me knew in my formation that this was. This was untenable. This. This doesn't fundamentally work. And so then when I was listening to Jordan, I was connecting it with some of what Lewis was saying in that. In that book Miracles. And I thought, boy, Jordan should really read this book. And then I thought, I could send him the book, but that's pointless. So then I thought, what I really have to do is I shouldn't really worry so much about Jordan, but I should address his audience. And so that's. That's really how this thing got started for me. Now, part of the irony and sometimes frustration in all of this sort of thinky, talky space, which I think is essential, and I obviously participate in it, and we have that at the conference. But part of the reason I'm so excited about the conference coming up in Thunder Bay is exactly what John said at the end of your conversation with Jordan. And John and. And what Jordan said, too, is that when we're having these conversations in the same room, when we're physically together, I get a sense that you can make more progress, that you're actually the physicality, the embodiment. You're actually making more progress in these areas that, let's say, the words on a page or the speech captured in a video can't fundamentally capture."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":755.84,"end":870.68,"speaker":"Jonathan Pageau","text":"I think you're absolutely right. And I mean, my experience of when I went to Toronto and spent those few days with John Ruvake, for example, I felt like our conversation really jumped a lot farther. Like I finally understood what he meant when. Why, at least. I finally understood at least why he resisted the notion of narrative as being, let's say, the basic substructure. And so I finally got it, like, okay, I understand, because there is this basic ontological hierarchy which is not, let's say, a narrative. And you see it like the story of Moses is the best example, right? So it's like the law is not a story, right? It's I still, like, how can I say this? I still think that it's anchored in the story, but I think that there's an importance to this order of beings that we have to attend to. And so I was like, oh, I finally understand why, or at least what he was trying to get to when we were talking. So to me, that was a massive breakthrough. And also I think the more we've been discussing about beauty has been a massive breakthrough, those conversations as well. So I'm really excited for sure, to be with people, but not just you guys, although I'm looking forward to seeing you guys. It's also just having people around that are interested, that are curious and having informal moments of discussion and sitting around a table at dinner, and those things are very precious. Luckily now with COVID I won't say ending, but at least with COVID not being an issue anymore, you know, we have that at the parish again, like we have it in our church. We have coffee hour and we have that camaraderie and that, that communion. But that is so precious. I mean, that has so much value to be able to be with people and to exchange. And it's funny that we say that as if it's not a normal thing to do, but it's become very. It's become almost exceptional because we're so caught up in this, this online space, you know."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":871.16,"end":986.74,"speaker":"Paul Vander Klay","text":"Well, and I love how earlier you talked about body and of course, in Christian terminology, that's Christian language. When we gather together on Sunday or during the week or in our homes or let's say in an estuary group, we are creating body. We have the body politic. Political parties have our bodies. I mean, that's the language that obviously Paul started in. Yeah. You know, in Corinthians and that has permeated the Western world. It's completely, you know, underbetting our politics. And I think, you know, my. My questions and my desires when I. Okay, so I'm watching you and John and Jordan talk and David Fuller. You know, I'm going to be in the uk. I'm going to. I'm going to get together with David, I'm going to get together with Justin. We're going to have a bunch of estuary groups. I think part of the challenge we face is that of celebrity in that we see Jordan, you, Jonathan, me, perhaps to a degree. And even though, let's say in the early Church, I think church fathers, bishops were in some ways celebrities. You look at Cyprian, you look at Augustine. I think this dynamic of celebrity has everything to do with attention. But I do think that for me, the goal of all of this thinky talky stuff has to be knitting people together into bodies. Because I think we are far more transformed by how we are in these bodies than we are through the fire hose of abstracted talk that is coming at us into these things we're putting on our ears or into our eyeballs."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":986.9,"end":1196.03,"speaker":"Jonathan Pageau","text":"Yeah, that's why I tell people go to church in the sense that I think that, yeah, this has to hit the road, like it. And it's also what makes what we're talking about real in the sense that I'd say my brother and I's notion of symbolism is obviously embodied. It's not something which is just floating up there. And I think also that the manner in which John Vervecki talks about relevance realization, he doesn't see it as just a mental process. He sees it as an embodied reality. Right. Moving in space and encountering things. So I think that we're not, let's say that we're not Gnostics, and it's very important. And that's also one of the things that will make this project, whatever it is, will make it successful because it is trying to, not in the ways that the rationalists and the modernist thought, but it is trying to bridge the world of phenomena with the, say, these spiritual ideals. But it's not doing it through chemistry or like, you know, like the weird ways that, that people have tried to do it, like creationism or that kind of stuff, but it's tried to do it in a. Still really, in an embodied way. So it's, it's connecting your experience, your daily life to these, these higher understandings. And so. And that, like, it scales, right? It's not just you, and it's, it has to, it has to embody itself in your family and in the intermediary communities and in church. And one of the things that Jordan, for example, has said is the best thing you can do right now is like, you know, clean your room and become a better person. But there's also the scaling. There's also. Because one of the problems of the modern world or the contemporary world is that it, you know, there's an extreme of chaos and an extreme of order is the best way to understand it. You see the states and these organizations, even corporations, coming more and more powerful, more like, let's say, coercive and authoritative and also permeating your space. And then we see the people becoming reduced to their idiosyncrasies as much as possible. Like to your little thing. And so a normal world and we talk about these embedded hierarchies. A normal world is mediated all the way through. And it's interesting, Paul, because I've been thinking about this in terms of Exodus, for example. It seems like that's one of the things that's going on in Exodus where God is like, God is this raging fire. Like God will destroy everything, you know, and then the people are in Egypt, they're all scattered, you know, they're a bunch of slaves. They're a mixed multitude. And God's like, okay, I want to make you into a people, but if I, if I, if I connect with you, it's just going to burn you. So we have to create this mediating structure between. And it's, it's both the law, but it's also the structure of, of authority, of, you know, the thousand, the hundred, the tens that, whatever, the 50, the tens that gets set up. So you get this mediating reality of small embedded structures in each other. And it's like that's how it works. That's how it works. But the modern world wants to reduce, have all this power up here and reduce us to individuals. So one of the best things you can do and it's this like, is really go to church or join a team or be part of an actual group of people that are working together, you know that, that are together towards a common attention. And it's a normal thing for humans to do, but it's something which is, has been made harder by Covid. By the Internet, by you know, getting caught up in these, these online spaces. So, so it really is embodying this stuff at different levels in a family and in a church and in a group is the, is necessary or else it's not going to have fruit. It's not going to."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":1196.28,"end":1333.85,"speaker":"Paul Vander Klay","text":"Yeah, well, I think one of the key elements of this is the very anti modern. I think you said it very well, the individualism, the anti modern practice of commitment. I think, I mean, John talks about self transcendence. I don't think there's any more powerful self transcendence than the sacrificial burden of a costly commitment that happens when you, let's say you marry because you, you say, okay, I'm sure that if I live another 50, 60 years after this marriage, I will find another attractive person that I think is better for me than you. I am sure that I am going to find jobs and opportunities that will take me away from you. And so in a commitment, you say you Know, in the Old English vowels, forsaking all others. It's like, well, you're going to do that in your 20s, you know, think about all of the optimization. You're going to turn your back away from for the sake of this. And, and so then, then with children it becomes even more. Because children are these little, you know, they start out these little parasitic bloodsuckers that they take all your money, they take all your time, they take all your attention. They, you know, they're just such greedy little things. But if you actually devote yourselves to them and you pour yourself into them, then they actually grow up and they themselves can become, you know, people who, people who love and give and sacrifice for others. So it's this, it's this dance that creates. But I think part of, part of what, what this depends upon is the, the making and keeping of commitments. And especially, I think the Orthodox Church has seemed, I don't know, I don't really know the church much, but the Orthodox Church has seemed to maintain some of that better than at least in a lot of Protestant churches. Now, commitment is sort of the complete opposite of consumerism, where consumerism is. I'm going to act on what I perceive my best interest is now. And the moment that I perceive those interests and desires changing, I'm going to hop to the new thing."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":1334.1,"end":1334.42,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":1334.5,"end":1367.21,"speaker":"Paul Vander Klay","text":"I'm going to hop to the new partner, I'm going to hop to the new job. I'm going to. And there's a degree to which, you know, when it comes to where you buy your things or that level is appropriate for a bunch of things in life. But if that then becomes connected, if that's the way you approach everything in life. And I think, you know, I've talked more about my channel before the churn. I mean, YouTube understands that. Okay, you're watching Vander Kleen. Now you're watching Peugeot. Now you're watching Peterson. Now you're watching Vervecki. Now YouTube doesn't care who you watch, just that you watch."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":1367.37,"end":1368.17,"speaker":"Jonathan Pageau","text":"Yeah, yeah."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":1369.13,"end":1411.48,"speaker":"Paul Vander Klay","text":"So I, you know, I think even though on one hand we're certainly making use of this medium, I think we do our audience a disservice if we don't continue to remind them that it's going to be in having in real life commitments to one another in a face to face way. All of this talk about self improvement, self transcendence, none of that is going to happen if the tyranny of the individual isn't broken. And the most obvious breaking of that is by making and Keeping commitments."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":1411.72,"end":1522.31,"speaker":"Jonathan Pageau","text":"That makes sense. I think that's true. And also the idea that commitments, you have scale of commitments. And that's super important too, because one of the issues. So when you were talking, I was thinking there are right now, let's say cults that will understand that. And they use that, they weaponize it, right? So they. They actually demand so much commitment from you. They demand supreme commitment. And then in doing that, and so you think of, why would anybody join a cult, right? And it's sexy because people know that it's fulfilling to be committed to something and to kind of give yourself to it. And so cults will weaponize that. And so you can recognize the difference between a cult and a real commitment. Whereas a cult or a parasitic type of relationship like that will demand all from you, right? Will demand all and will see any other commitment you have as competing with whatever commitment you give them. And so that's a good way for just people watching or listening to know the difference. And you. So, you know, it's like even in your relationship, like if you. You're in a relationship with someone with, say, a man, with a woman, and then that person wants you to give up all your friends and give up your family and give up and renounce your. Your parents, and everything is like, okay, well, no, like, that's not. That's not a good relationship. That's a bad relationship. That's a, you know, the only thing that you know. That's why we have the idea of God. Like, God is the only one who can demand all our commitment. And then thankfully, he gives it back to us in fractal participations, right? In marriage, in churches and in friendships and all of that. So that's one way to see the difference. But you're right that if we find these healthy places to commit ourselves, then that's one of the embodied ways that we can deal with the meaning crisis."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":1524.1,"end":1540.26,"speaker":"Paul Vander Klay","text":"What do you hope for people who. Now, I talked to Catherine and they've sold about 100 tickets. They had 60 Airsoft tickets. And apparently Jonathan, John and I are all going to participate in the Airsoft, which. And I'm fully expect that we are going to get pegged."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":1540.34,"end":1540.82,"speaker":"Jonathan Pageau","text":"That's right."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":1540.82,"end":1544.42,"speaker":"Paul Vander Klay","text":"More than anybody else, just by virtue of hierarchy of attention."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":1544.9,"end":1551.62,"speaker":"Jonathan Pageau","text":"And you also by virtue of hierarchy of scale, like, you're just going to be so much taller than all of us that everybody's going to be shooting in fall."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":1553.82,"end":1573.06,"speaker":"Paul Vander Klay","text":"We're going to get massacred. But in terms of the people. Well, I very much want people to come to this conference and I think there will be. For those who are watching online who can come to this concert. Now, I realize that Thunder Bay is a difficult place to get to if you're an American."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":1573.06,"end":1574.74,"speaker":"Jonathan Pageau","text":"It's a commitment though, Paul. It's a commitment."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":1574.74,"end":1623.48,"speaker":"Paul Vander Klay","text":"That's right. It's a commitment. If you're. I am not actually my first, when I looked at air flights, I first looked at, okay, I got a flight, fly like two steps into Toronto, then I'm going to spend the night, then I got to get to Thunder Bay and I decided, no, I'm going to have one flight over to Minneapolis and then we're going to do a road trip from Minneapolis up to, up to Thunder Bay because it's only about five hour drive from Minneapolis and Minneapolis. For those say, flying from other places in the world who can get into America, which is not always easy, but those who are in the United States who want to get to Thunder Bay, I would very much recommend get to Minneapolis and then get up from Minneapolis to Thunder Bay. What do you want for people who listen to your channel and have been, let's say. How can I say this? Because again, I don't think what we really want is fans."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":1624.12,"end":1698.35,"speaker":"Jonathan Pageau","text":"No, I. One of the great things about this conference that I'm looking forward to is that we're there for several days and so and it's also going to be limited. You know, they have a limit of people that can come. So it's like, I think they said 300 would be the limit, but they're thinking more like 150 maybe, you know, 200 people. And so it's like 200 people. If you spend three days together, two days together, it's not the same. Like you have time to, you know, we'll eat, we'll sit, we'll talk, there'll be a lot of breathing room. And so I think that that will be in some ways very refreshing compared to, you know, the one stop evening, you know, presentation and then a few questions at the end. That's really what I'm looking forward to really is to have just time to be able to talk with you and John and have other people sitting around that are, that are chiming in that are, that are giving their, their ideas. Yeah, that's what, that's definitely what I'm looking most forward to. And I think that it will, it will, I think it will cement and I think people will create relationships there as well. Because a lot of the, let's say the symbolic people or the estuary People they meet online. But yeah, going there, meeting in the flesh, spending a few days together, that will definitely cement. And I definitely see people visiting each other and then calling each other afterwards and staying in touch. That's definitely what I hope."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":1698.51,"end":1769.7,"speaker":"Paul Vander Klay","text":"Yeah, that's, that's what I hope for too. The, the thing that I've appreciated most over these last four years has been I'm trying to get Rick to go now. Rick's going to listen to this. He's going to, it's real. He's got to get a passport first. But, but even, even the idea of going to Minneapolis, you know, carpooling, doing a road trip together, as a minister, I've often found that car time with people in our culture is really valuable because, you know, the cell phone doesn't work that well. You're in a car, you're just, you're in that confined space for a number of hours with people. You can gain a level of fellowship, of personal knowledge. You can find people that you actually click with and can maybe, you know, build longer friendships, you know, friendships again. I just saw a video, someone was saying that Generation Z is the loneliest generation, which is, you know, astounding, given the fact that we're all running around with these little devices in our pocket that it supposedly connects us to the world. The quality of that connection is, is weak."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":1769.7,"end":1773.18,"speaker":"Jonathan Pageau","text":"No, for sure. Yeah. Kids don't, right now, kids don't see."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":1773.18,"end":1773.94,"speaker":"Paul Vander Klay","text":"Each other a lot."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":1773.94,"end":1812.16,"speaker":"Jonathan Pageau","text":"They, they, they are, they're on Instagram or on Snapchat or whatever, sending each other photos and writing texts. But there's hard, I've noticed it. Like even my kids, they actually, my kids see a lot of their friends, maybe more than a lot of people, but they still, I feel like, you know, when we were kids during the summer, you would, you would spend all day with their people. Like you just go, you would leave in the morning and then you spend all day with people and then you come back home and that's not the case. Like, it's not, it might be happening somewhere, but it's definitely not happening around here. So it's just. So you're right, these friendships are going to become more and more, going to become more and more precious as time kind of moves forward and we have to be deliberate about it. We can't just think it's going to happen."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":1812.4,"end":1855.06,"speaker":"Paul Vander Klay","text":"Well. And I also think a lot of the, the self improve. So there's a lot of this sort of self improvement stuff on the Internet right now. And in some ways we're Sort of adjacent to that. Given clean up your room and you know, Jordan's sort of in a self help thing. There's a couple of his books, but I think. And a lot of that focuses on, well, eating better and cleaning your room and having a better job. I suspect that part of what's going on with Gen Z is that they haven't developed the interpersonal skills to really build lifelong relationships with one another. Because the only way you can actually build those skills is to be with people."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":1855.22,"end":1859.06,"speaker":"Jonathan Pageau","text":"Just spend a lot, a lot of huge amounts of time with people. Exactly."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":1859.54,"end":1948.23,"speaker":"Paul Vander Klay","text":"And learn that talking in a certain way or talking about certain things, that doesn't really progress the conversation and then learning how to read the subtle cues from someone else to engage in a conversation. And you know, as Jordan says, you engage in the conversation in order to have a next conversation and another conversation and to allow the relationship to go deeper and to be more stable. And so I, I think that part of, you know, all of these skills are. They're basically necessary for having a satisfying church life, a satisfying romantic relationship, a satisfying relationship with a parent or a child or a cousin or a sibling. And you know, it sounds, I hope that if people are. There's a lot of digital. I won't call them digital nomads, I won't call them digital monks, I'll call them digital recluses. For the digital recluses to get out from behind the screens and be in a car with people and have to do all of that difficult work of learning to relate, build a relationship, build a friendship, maintain a friendship, feed a friendship. Because I think all of this is actually the knitting that builds these bodies that we're talking about."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":1948.55,"end":1961.19,"speaker":"Jonathan Pageau","text":"Definitely. And so what about you in terms of the estuary? Because you're doing this little estuary tour. Tell me a bit about that. You're going to Europe and so who are these people? Like how many are there?"}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":1961.75,"end":1977.06,"speaker":"Paul Vander Klay","text":"It's hard to know. So I am doing a bunch of more conferency type things. So in this all got started because the German estuary decided they wanted to do a festival and so they've got a band called Two More V's."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":1977.06,"end":1979.3,"speaker":"Jonathan Pageau","text":"What's more, V is going to be there. Yeah, I know, I know."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":1979.46,"end":1984.66,"speaker":"Paul Vander Klay","text":"So Two More V's is going to do music and they got Burn Power coming over from Tbilisi, Georgia."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":1984.74,"end":1985.22,"speaker":"Jonathan Pageau","text":"Wow."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":1985.7,"end":2043.58,"speaker":"Paul Vander Klay","text":"And I'm. And then Mattea said to me, he said, you know, well, if we paid your way, would you come? And I thought, yeah, I'd come. And then John Van Dank was Like, well, if you're going there anyway, why don't we make it a big thing? So the German Festival started it out and then the Hollanders got together and said, you know, well, let's use that to kick off our Dutch estuary. The Netherlands is small enough that, you know, people can get around pretty easily. So talking to a guy who was their national theologian and a journalist and another philosopher. So we're doing a conversation there. I think we're having another estuary type group there. So we're going to launch a couple of Dutch estuaries. The German estuary has been going well, so they're going to have a festival and they want to make that a yearly thing. One of the things. I was just in Chicago. One of the things that I've been noting is that these estuaries, like the Chicago estuary, they meet together quite regularly, but every year now they're doing a bigger event."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":2044.05,"end":2044.45,"speaker":"Jonathan Pageau","text":"Okay."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":2044.53,"end":2063.17,"speaker":"Paul Vander Klay","text":"Draw a little bit more attention and organize themselves and give them sort of a project that they can push themselves to. And I think that's pretty helpful. So I'm meeting with some theologians in the Netherlands and then the German Festival, and then John Van Dank and I are taking a train through Switzerland, through France, under the Channel, all the way to the uk."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":2063.49,"end":2063.97,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":2064.85,"end":2071.04,"speaker":"Paul Vander Klay","text":"And then I'm going to go up to Ireland, Northern Ireland, and I'm going to do an event with. With Marcus."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":2071.12,"end":2077.52,"speaker":"Jonathan Pageau","text":"Yeah. That's so amazing. I'm so jealous of that. Like, I would. Oh, man, you're. You're making me so jealous. Yeah. I wanted to be so bad."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":2077.92,"end":2089.52,"speaker":"Paul Vander Klay","text":"So, tickets, I've got the. I'll put the links below for these things. You can still get tickets for that. And then I come back down to London and I'm doing an event with. With Glenn Scrivener and Tom Holland."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":2089.76,"end":2093.28,"speaker":"Jonathan Pageau","text":"Nice. Whoa. That's amazing, Paul. That's gonna be wonderful."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":2093.36,"end":2101.28,"speaker":"Paul Vander Klay","text":"So I think there might still be things available for that. And then I'm preaching in a little church in London. That's actually one of the things I'm most excited about."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":2101.52,"end":2102.96,"speaker":"Jonathan Pageau","text":"Preaching in a church in London."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":2102.96,"end":2113.52,"speaker":"Paul Vander Klay","text":"Oh, yeah. There's a little church and the church writes me. Oh, we're a little church. I've got a little church. I much prefer a little church because we can see each other."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":2113.92,"end":2114.4,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":2114.56,"end":2175.23,"speaker":"Paul Vander Klay","text":"And so I'm preaching in a little church in London. And then we've. I'm going to meet with Justin Brierly a little bit, and I'm going to meet with David Fuller and I'm going to have another estuary meeting in Salisbury. I think there's a few other estuary meetings that are going. We're going to have a meeting in Manchester, just an estuary group. And I hope Nate comes down for that because Nate's been critical. And the Book of Proverbs talks about the fact that in many ways our critics can be a blessing because they can open us up to maybe things we're not seeing. So I think, I think I'll have a good time. Nate and I have talked. He's one of the few guys that managed to get himself banned twice from the Bridges of Mean Discord Surfer. So even had Joe ban him. But, but you know, as a pastor I deal with that. You know, you're always dealing with sheep that behave badly. So I have a. I have a heart for sheep that behave badly."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":2176.11,"end":2179.95,"speaker":"Jonathan Pageau","text":"That's amazing. That sounds like. So is it all going to be recorded? Most of it it's going to be."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":2180.72,"end":2198.8,"speaker":"Paul Vander Klay","text":"I think the bigger events are going to be recorded. I don't know. We'll have to see. And then we're also, hopefully. So there's another guy who's been talking about. He's a Hollywood cameraman and he was just down in Greece filming a sequel to the Big Fat Greek Wedding."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":2198.96,"end":2199.44,"speaker":"Jonathan Pageau","text":"Okay."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":2199.44,"end":2252.86,"speaker":"Paul Vander Klay","text":"And he's going to come up and he's actually been talking about thinking about doing a documentaries that he teaches documentary filmmaking at Biola and he's starting to think about what would a documentary look like focusing on this little corner of the Internet. That'd be interesting because there's a lot of attention going to Jordan. But I'm more excited by what I hope we're knitting together with me and you and John and Estuary. And part of what Estuary for me is about from a church perspective is that churches, you know, church has to continue to do what church does. But there's been a, there's been a gulf between the church and the culture and there are a lot of fundamental misunderstandings about what church is and what church is for."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":2253.18,"end":2253.66,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":2253.74,"end":2291.92,"speaker":"Paul Vander Klay","text":"And there's a lot of, you know, given the history of church in the west and perhaps to the east in the Eastern church as well, there's a lot of anxiety among non churched people about churches at a culture. Is it, is it something that's tyrannical? And I think, I think anybody who's, you know, there certainly are tyrannical churches and tyrannical pastors for sure. But anybody who's had a living, healthy relationship in a church should understand that church is fundamentally not tyrannical. We talked about making and keeping commitments. That said, making and keeping commitments is a different thing from a tyranny."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":2292.18,"end":2324.98,"speaker":"Jonathan Pageau","text":"That's right. It's hard because some people today, let's say, might think that that's. That that's it. Like, a lot of people seem to think that just authority itself, any authority, is immediately tyrannical. But that's not usually. That's not especially in a church. Because think about a church is that it's not. You're not. Especially now, like, there's no one compelling you to go to church. And so it's a negotiation. Like, even if there is real authority, it's always going to be a negotiation because it's not like. Not like there are any consequences. You're not going to church, Especially now."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":2325.3,"end":2340.34,"speaker":"Paul Vander Klay","text":"Yeah. And yet. Well, I. I thought your conversation. I think it's with Glenn, when you talked about authority, I. I'd love to hear you talk more about authority in some of these venues, because. So my wife is an elementary school teacher."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":2340.34,"end":2340.82,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":2340.82,"end":2377.79,"speaker":"Paul Vander Klay","text":"And she's a. She's in a Waldorf program. So she went first grades first through eight with her class. I remember that first class that she sort of graduated. I mean, those kids. Gosh, those kids would. Those kids would do anything for her. Because what she did through those eight years was she's very demanding. She runs a very tight ship in terms of that classroom. But she can do that because she pays very close attention to each of them as an individual, and the kids very quickly pick up that she wants what's best for them. Yeah. And so it's not tyranny, it's love."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":2378.03,"end":2522.73,"speaker":"Jonathan Pageau","text":"Yeah. Yeah. But you can see it like there's also. I mean, I think everybody's had that experience in school. I remember my best teachers were actually not like the. Just the nice teachers, the ones that are just trying to buddy up to you and to. You know, they're actually the teachers that were both demanding and strict, but involved and caring. So it's like, you know, they. They will put in the work, they'll put in the time, they will pay attention. They'll listen to you. They'll listen to your question. They'll take them seriously, but you better step up. And, you know, so there's a sense in which it's a. That seems to be, at least in terms of authority, understanding that for sure, if authority doesn't love, then that's not how it works. Right. I mean, St. Paul sets it up pretty clearly. It's like the authority has to love. And then the. Let's say the People that are submitted to that authority have to submit. But it's a. It goes both ways, right? It's like if you don't, you can complain, let's say you could be an authority and you can complain that nobody's listening to you if you, you know, but. And you can say, well, they should. You know, this is God's way. Like, they should listen with like, okay, you can say that as much as you want, but it's still not going to work. It's not going to happen. So I think, yeah, I mean, I think it has to do with hierarchy. People don't understand also that hierarchy is always negotiation. Not in a bad way. Not in the sense of like a. Like a fight or some kind of conflict, but it's a negotiation in the sense that whatever thing wants to find body has to deal with the body it's going to find. Right. It's like a maple tree growing, let's say, on a rock, has to negotiate its body out of what is possible for it. So the structure of a tree will be related to the soil in which it is. And that is just a natural relationship between the pattern and its instantiation. And that is true for any type of hierarchy, any type of authority. There's a negotiation between the pattern and the structure and the potential that will instantiate it. There's no way around it. It's not never just top down. Top down is not. Is not. At least not. I don't think there's any way to argue that top down is the Christian way of seeing the world. Like it's a call and response, like the Song of Songs. That's why. That's why the fathers see the Song of Songs as this relationship between God and man. But you could see it fractally as this relationship between authority and those that are submitted to it, as this call and response of two lovers that respond to each other and want to come together."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":2523.85,"end":2547.26,"speaker":"Paul Vander Klay","text":"I think that's why we want to create bodies. I think that's why we meet together. Because, you know, the attention, the love part of the. I remember once you saying that, you know, these screens and people looking at us right now, we are beings of light, but we are. In that way, the screens are deceptive."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":2547.42,"end":2547.9,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":2547.98,"end":2557.5,"speaker":"Paul Vander Klay","text":"Because myself, you, John Revaeke, Jordan Peterson, any of us, if you meet us in person, part of you is going to definitely be disappointed."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":2557.5,"end":2558.86,"speaker":"Jonathan Pageau","text":"That's right. That's for sure."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":2561.41,"end":2685.42,"speaker":"Paul Vander Klay","text":"One of the huge disappointments that I think the deceitfulness of these technologies are a blessing. But there's A deception in them, in that right now this is a very immediate relationship that. Oh, I feel like Paul gets me. I don't get you at all. I don't see you at all. I'm looking at a camera and a screen here and I've even, you know, I haven't even gotten to know John and Jonathan beyond, you know, conversations. Less than 1. On one hand, that's not real knowledge. And I've certainly listened to them plenty and thought about them in terms. But, but the. You, you cannot really form a body, a durable, life giving, authoritative yet loving body without, you know, immediate relationship. And just by virtue of the Dunbar number. I think part of what made Jordan so powerful, especially in those early years, was that he was able to connect both. He had authority and people would again and again say that to me, oh, he's, you know, he speaks as one with authority. Oh, okay, I've heard that before. But partly because on one hand he, he was able to make a, a credible demand of people that people could say, yeah, I should clean my room. Yeah, I'm sponging off my parents, I'm. I'm wasting my life. That's a credible appeal and a credible challenge. But at the same time, you'd see him when he was talking about the loss of humanity, that, let's say someone living in their mother's basement covered in Cheetos dust, doing video games and porn all the time, when he would break down into tears about such a person. You saw then that mixing of challenge and care and love. But, and the screen sort of said, well, he cares about you. Well, to the degree that you're participating in, in the fraternity of porn and Cheetos Dust, perhaps. But that's not much of a fraternity to be a, that's not a good body to be a part of."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":2685.58,"end":2716.83,"speaker":"Jonathan Pageau","text":"No. Yeah, well, it's a spark. Like, it's a, it's a spark that can lead you to, into something real. Which is why I think like, it's, I mean, I think that both of us have had different ways of going about it. Like, I think the estuary that definitely it seems to be, what you're trying to do is saying, okay, well, we need to get this to land, you know, and, and I'm focusing more on the church idea. But the estuary is like an intermediary space, like a space of, you know, a bubbling space of discussion and exploration that I think is also super necessary right now."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":2716.91,"end":2736.52,"speaker":"Paul Vander Klay","text":"And, and part of, for me, estuary always has two prongs. One of it is, I'd love people to form groups, make a body, participate in it, commit to it, figure out how to make that a life giving, life producing network of relationships. But the other part for me is admonishing the churches to say, look, why."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":2736.52,"end":2737.36,"speaker":"Jonathan Pageau","text":"Aren'T you doing that?"}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":2737.84,"end":2808.04,"speaker":"Paul Vander Klay","text":"Yes. Why is it that no one imagines a church would be a good place to go to in order to get into a body that, you know, that has these kinds of conversations. I see what you've done in terms of your symbolic world in a rather estuary way. So you have. Here you have the Church Fathers, here you have the Church, but you are translating that and trying to make it intelligible via symbolism to a much broader audience. And some have figured that out and then found their way into the church. Um, you know, as a preacher, that's always, in a sense, been mine. But I've seen the church as. So at least the Protestant church in some ways was so formative of modernity, and especially in the 19th, 18th and 19th century, they thought they could basically retranslate the Bible into science and yield technology that would. I mean, there's a, there's a real difficulty in Protestantism there."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":2808.36,"end":2808.92,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":2809,"end":2832.25,"speaker":"Paul Vander Klay","text":"And yet for, you know, then people say, well, why are you still Protestant? Well, because I'm committed to a body. I'm committed to. I'm committed to lots of bodies. These are my people. And so at one point, someday you and I are going to have to have a longer conversation about the Protestant Reformation, which, which, which would be absolutely fun, but I could also do it."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":2832.25,"end":2836.01,"speaker":"Jonathan Pageau","text":"In private with like a glass of beer and, you know, or a bourbon."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":2836.01,"end":2844.29,"speaker":"Paul Vander Klay","text":"And cigar or something, which was exactly what Lewis said. Louis said, Protestant Reformation should have been a conversation of that nature rather than."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":2844.69,"end":2845.89,"speaker":"Jonathan Pageau","text":"What it ended up being."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":2845.89,"end":2855.59,"speaker":"Paul Vander Klay","text":"What it ended up being. So, so, yeah, so there's, so there's Thunder Bay coming up and there's my Europe trip. Are you, are you doing any, anything?"}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":2855.59,"end":2907.72,"speaker":"Jonathan Pageau","text":"Look, there's a lot of stuff. I mean, there's a lot of stuff coming up. It's all, none of it is super clear. It's, I mean, people have noticed that I've been. That Jordan Peterson has kind of taken me along, I guess is the way to say it. He's like, all right, Jonathan, let's go there, let's do this. And I'm like, okay, sure, why not? Like, I'm, you know, I love it. We did this, this, we did this 10 year, 10 day seminar on Exodus, which was great. Which a lot of fun. We didn't finish the book we actually got to the law basically in 10 days, which is crazy. But, you know, it was a lot of. It was like a wild conversation. Dennis Prager was there and then Greg Hurwitz, Stephen Blackwood, for people who kind of follow Jordan, have seen him, and James Orr from the uk. So it was, it was great. It was wonderful. And so I'm probably, I'm probably going to the UK in September. Okay. There might be some events there, but it's. Nothing is clear yet. So."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":2907.72,"end":2908.12,"speaker":"Paul Vander Klay","text":"Okay."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":2908.12,"end":2911.44,"speaker":"Jonathan Pageau","text":"So at least for now, it's. It's Thunder Bay. People come to Thunder Bay."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":2911.6,"end":2915.56,"speaker":"Paul Vander Klay","text":"So this seminar on Exodus, any of this recorded or was this. Pretty much."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":2915.56,"end":2942.63,"speaker":"Jonathan Pageau","text":"It was all recorded. Oh, no, it was recorded like daily Wire recorded. It was like with five, six cameras and lighting and the set and makeup and it was like another world being in another world. But I mean, it was great. It was wonderful. I did enjoy my time there and a lot of downtime also with all these people just chatting and discussing and so that was great. But. But yeah, it's definitely high, high production."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":2942.79,"end":2959.23,"speaker":"Paul Vander Klay","text":"Well, I would love to see because, you know, as a pastor, I know you say, okay, people should, oh, I'm going to start reading the Bible. They go through Genesis, like, oh, Genesis was great. And they go through Exodus and you get to Sinai and wow, Exodus is great. And then after Sinai, we're not there yet."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":2959.23,"end":3036.21,"speaker":"Jonathan Pageau","text":"I know. I keep telling, like, okay, you, you, we better, like, we better set up some notions or better set up some structures of understanding how this is applicable right now. Because when we get to take a sword and cross the camp and slash as much as you can, like when we get to kill all the, you know, it's like, you, we better have a way to understand this because like our ideals about freedom and whatever, like all this stuff that people want to put into Exodus and about, like freedom from slavery and all this stuff, like, you better be ready because what's coming is rough. And I think there are ways to talk about it. I think the church fathers have ways to discuss it. If we understand reality fractally, then the application that is made personally is not just a metaphor. It's not just. It's actually not just like an arbitrary allegory that the fathers came up with. It's actually applying the pattern of the story to yourself. And then the sacrifices become self sacrifices. The Egyptian that you kill is the one inside you. And so it's a transformation of the interpretation into the person and then all of it can be applicable. But unless we do that, then good Luck, like good luck with the purging of the camp there, fellows."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":3036.53,"end":3040.93,"speaker":"Paul Vander Klay","text":"Well, not only that, but also the furnishings of the tabernacle."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":3041.25,"end":3043.97,"speaker":"Jonathan Pageau","text":"Yeah. How are you going to understand any of that stuff?"}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":3044.05,"end":3074.33,"speaker":"Paul Vander Klay","text":"Right. Why all of these chapters God is giving detailed instructions on. This is what the tabernacle is supposed to look like. I mean, it's almost like he's. I always liken it sort of like the tabernacle is sort of like a nuclear containment unit. Because what happens often is God breaks out into the camp and people die. And so the kind of attention given to the furnishings of the tabernacle, the, the rituals of the."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":3074.33,"end":3076.25,"speaker":"Jonathan Pageau","text":"It ends with the description of the tabernacle."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":3076.25,"end":3076.65,"speaker":"Paul Vander Klay","text":"Yes."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":3077.03,"end":3103.6,"speaker":"Jonathan Pageau","text":"And so. But that's the body. Like that's the embodiment that we're talking about. It's like the final embodiment of all of this, where it's leading to, which is an embodiment of sacrifice and worship. Like, that's actually the mediating. So all the mediating principles are now in place in terms of the law and in terms of space and in terms of relationships of people and relationships of authority. All of this has now been established and now it's practiced."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":3103.6,"end":3104.24,"speaker":"Paul Vander Klay","text":"It's Right."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":3104.24,"end":3281.37,"speaker":"Jonathan Pageau","text":"And people always think that what happens on Sinai is just about a bunch of moral codes you're supposed to use. Like you said, it's actually mostly about the tabernacle. It's mostly about an order of worship, an order of procession. Right. A manner in which we engage with each other in a ritual, worship, sacrifice sense. That's actually what's probably the prime. The prime drive of where we're going in terms of Exodus. So, so, but that's all related to what we're talking about. It's very. Exodus is actually, I'm really happy that we're doing Exodus because Exodus is really about the discussion that we're having now and understanding the relationship between the embodied practice which instantiates these patterns that are. That are above. And that's what Exodus is about the whole time. And some of it does include, you know, having to remove the patterns or remove the things that don't fit. And it looks weird in the text. Because it does look weird in the text. It's like, well, yeah, it's killing a bunch of people. I understand that that's. That's difficult. But it's like you can either just be annoyed and angry and just, just scream and shout. Fine. Or you could try to understand it and realize that, you know, whatever you get involved with that has this pattern you're going to do that, right? It's like if you're, if you're in a basketball team and then someone comes with a baseball bat, you're going to say, I'm sorry, you need to go home. Because this is not what we're doing. We have to purge you from this team. Because this is not. It does not fit with the aim that we're going to. And so unless we are able to look beyond. I mean, I don't want to minimize the madness of some of the things that look really crazy to people in that book. But if we want to understand it, then we need to, to be able to see what it's referring to in terms of a pattern and in terms of embodiment. So anyways, sorry, but it's like we're not there yet because we're just at the law. Like, we've just basically, in the Exodus seminar, we've come to the Ten Commandments and we've read the Ten Commandments, and then that's it. Like, we didn't even interpret them because so. But there's already some of it. Like when you see Moses going up, you see the problem. Like when Moses goes up the hill and then the people forget him and then they make the golden calf. And it's like, it's like, okay, so Moses, because God says to Moses your will be God to Aaron or you will be God to Aaron, and then Aaron will be your mouth to the people. And so you can imagine it's like the hierarchy. It's a hierarchy of manifestation. So then Moses leaves and then Aaron makes a golden calf. It's like, that's how it works, folks. It's like if you don't stay connected, then these things at the bottom become idols. And so unless they're connected all through, then that's what, that's the problem. That's when things become idols. And so it's. I think people are going to be able to, people who watch our content, like people who listen to John or watch my videos and everything will be able to understand, you know, what's going on in the books of Exodus, because it's all about that."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":3281.45,"end":3303.83,"speaker":"Paul Vander Klay","text":"Well, I, you know, there's that. There's definitely the problem of, let's say, Canaanite slaughter. So we've got those issues. But to me, also, the question is, you've got the second half of the book of Exodus, which is all about furnishing in the tabernacle. How does the tabernacle function? And then you've sort of Got the decalogue, the ten words, but then you've got all of these particular other little laws."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":3303.83,"end":3304.23,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":3304.23,"end":3365.41,"speaker":"Paul Vander Klay","text":"And then of course that's going to lead to Leviticus, which is even more of that. And then it's going to lead to Deuteronomy, which is sort of a. I remember in seminary doing a little bit of a detailed study between the laws in Exodus and comparable laws in Deuteronomy and the changes between them. And of course that gets, in biblical scholarship, that gets into a whole thing. But the, I mean, a lot of the heart of the conversation is, okay, how do we then live? Because quite clearly the tabernacle and the more specific laws flow out of the Exodus and the decalogue and it's all the application. And I think, you know, part of what I would like to hear from you and from Jordan and especially in conversation with others, we have some, we have some, some Jewish members in our bridges of meaning community is okay, how do we deal with, you know, okay, you can't weave, you know, you can't wear a garment of two fabrics. I mean, all of that's super easy."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":3365.41,"end":3366.37,"speaker":"Jonathan Pageau","text":"To understand, by the way."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":3366.37,"end":3369.47,"speaker":"Paul Vander Klay","text":"Yeah, that one's super easy. But that's the low hanging fruit."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":3369.47,"end":3370.23,"speaker":"Jonathan Pageau","text":"Yeah, yeah."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":3370.55,"end":3372.27,"speaker":"Paul Vander Klay","text":"The, yeah."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":3372.27,"end":3436.83,"speaker":"Jonathan Pageau","text":"Why the tabernacle is set up the way it is. Like, I mean, I think that some of the details of the tabernacle, I think are definitely obscure to me. Like, there's some like, you know, the hoops and the, like, some of it becomes like, okay, like, at least in terms of meaning, like, it seems like, okay, well, you need hoops to hold the thing. And I hate. Because we like. Oh, Jonathan. Saying just. Right. But I just. Because I don't, I don't wholly enlighten, but in terms of the basic structure of the tabernacle, I think that it's extremely coherent in terms of, in terms of an ontological hierarchy. And it actually repeats the story in Genesis. It's actually, it's almost a narrative repetition of the fall moving from the tree, you know, the candelabra, let's say, and the, the, the, the cherub on the altar. So you have a little mini paradise and then you have bigger versions of it moving all the way to the, to the garments of skin and then ultimately to the, to the altar of the fire on the outside. The fire and water on the outside. You have the laver and you have the. So it's like, you see it like it's in Exodus."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":3436.83,"end":3436.99,"speaker":"Paul Vander Klay","text":"Right?"}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":3436.99,"end":3515.02,"speaker":"Jonathan Pageau","text":"The fire, the column of fire and the column of Water in Exodus are related to what you end up finding in the tabernacle. A good way for people to understand it is that during the plagues, those get mixed up. It's like there's fire and water, and it's destroying, and it's all mixed. And then God separates that into two guiding principles. Two pillars, you could say. And then those end up in. Ultimately in the tabernacle. They also end up ultimately in the temple as Yakin and Boaz, as the two pillars of the. Of the temple. And so there's a structural element. Like, to understand the structural. The thing is, I'm not sure. One of the things I think I might do is because obviously this is a conversation between eight people. And so you always measure. Like, you're like, okay, when should I make an. When should I make. Say something? And I need to make it impactful. I need to make it relevant. One of the things I might do is when the Exodus seminar comes out, I might make my own exodus. Like, oh, good. You know, just to kind of say, well, if you like what I'm saying there and you like what Jordan saying there, you want more. Like, here's, here's. Here's a bunch of videos that go through Exodus as well. So I'm thinking about doing that just because obviously some people are going to tell me, like, why didn't you say this? Like, why didn't you? I was like, you know, it's like you're with eight people, so you. You find the moment and you try to measure your. Your involvement. So. But it was fun. It was a lot of. It was a lot of fun."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":3515.34,"end":3516.38,"speaker":"Paul Vander Klay","text":"Where did you do it?"}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":3516.38,"end":3518.58,"speaker":"Jonathan Pageau","text":"In Miami. We recorded in Miami."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":3518.58,"end":3523.18,"speaker":"Paul Vander Klay","text":"Oh, did someone have a place in Miami or was it just kind of a rented space that they use?"}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":3523.18,"end":3528.86,"speaker":"Jonathan Pageau","text":"Well, Daily Wire. Daily Wire, they basically run out of two places out of Nashville and Miami."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":3528.94,"end":3529.74,"speaker":"Paul Vander Klay","text":"Oh, okay."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":3529.74,"end":3535.51,"speaker":"Jonathan Pageau","text":"And so they rented us. They have a staff studio. They rent there, and they have a team that comes to film. And so. Yeah."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":3535.59,"end":3538.15,"speaker":"Paul Vander Klay","text":"Well, any idea when that's going to be released?"}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":3538.15,"end":3544.83,"speaker":"Jonathan Pageau","text":"I think it's in November, but I think it's for the Daily Wire Plus. I think that's what I. That's my understanding."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":3544.83,"end":3561.11,"speaker":"Paul Vander Klay","text":"Well, there we go. I got my. I paid for my year because it was cheaper a month. Someone on Twitter, right away, when that got announced, someone at Twitter, this means Paul vanderkly is going to get a Daily Wire plus subscription. I thought, no, I'm not going to do it. It was a day later. I bought it. It's like, oh, now I got to do it."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":3561.9,"end":3569.66,"speaker":"Jonathan Pageau","text":"Well, I mean, yeah, because, I mean, some of the contents. Definitely, definitely. I think, I think they're going to do some, some public, some. They're going to do both. I don't know. We'll see."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":3569.66,"end":3601.24,"speaker":"Paul Vander Klay","text":"But I was happy that the conversation with you and John and Jordan, that, that was completely on YouTube. I was happy about that. And, and I understand, I, I totally understand that for Jordan. You know, I say this and sometimes people criticize me for saying it. Jordan had a life, you know, he had a life. He was a clinical psychologist, he was a university professor. You know, he did his little Ontario public TV things and then he spoke out and his life was taken away from him."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":3601.32,"end":3601.72,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":3601.72,"end":3634.03,"speaker":"Paul Vander Klay","text":"And so I don't begrudge him. He's got years left in him, hopefully, to, to have a vocation. And, and so now he, you know, he, like Brett Weinstein and you know, they're kind of, you know, Vervecki talks about domicide in terms of their vocation. Jordan Peterson and, and Brett Weinstein, they were, they were sort of kicked out of their professions. And so now they're living in this intellect, you know, public intellectual space. And so I understand that YouTube is not probably a stable, reliable platform necessarily for him."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":3634.03,"end":3668.13,"speaker":"Jonathan Pageau","text":"So I don't think definitely to, at least in the long term as things get like, as things get closer to. So now there's the midterms. But when we get to the next election, things are going to get wild. Like, things are going to get so crazy. Like, don't think that you've seen it all. Like, it's going to get really bad. So in a way, people that aren't in some ways at least aware and preparing for that on social media and make it in this space where we're using these, these massive Google and these massive companies to make content, you know, don't be naive. It's going to get. Next election cycle is going to get really bad. So."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":3668.37,"end":3706.22,"speaker":"Paul Vander Klay","text":"Which again is why I think people need to be embedded in a body. Yeah. And they need to have, you know, when you look at Rod Drear's latest book and when he talks about what you have, when these mediating structures are sort of liquefied by the chaos that's going on, what you really have are relationships of trust where you look across the way and say, I trust this person and I trust this person not because they're saying all the things I want to hear, but because I've been with them and I've watched them, I've Watched them live."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":3706.46,"end":3707.02,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":3707.1,"end":3723.44,"speaker":"Paul Vander Klay","text":"And you know, no, none of us are completely trustworthy, but we get a sense of what we can trust people for and what we can't. And it's all that detailed real life connection that finally that, that you really need when, when chaos reigns."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":3723.52,"end":3735.2,"speaker":"Jonathan Pageau","text":"So yeah. Yeah, what's that? So that's Paul's last words is go to church. You know, find an estuary or at least some club, like a knitting club or something like, you know, be connected with people."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":3735.52,"end":3737.68,"speaker":"Paul Vander Klay","text":"Build your family ships with people."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":3738,"end":3738.56,"speaker":"Jonathan Pageau","text":"That's right."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":3738.8,"end":3784.44,"speaker":"Paul Vander Klay","text":"Learn to build relationships with people. Because again, my sense is with a lot of younger people, like, you're right, when we were growing up, you were just with people. There wasn't any of these screens to be with people through or to have this deceptive form of community. And those are skills you need to learn to develop. And it's a lot better than having a six pack or being your ideal weight or getting some great degree or some, you know, some uber great job. The skill of interpersonal relationship is the most, one of the most important skills you can develop in your lifetime. And there's no other way to do it but by doing it with people in real life. There's my message."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":3784.6,"end":3787,"speaker":"Jonathan Pageau","text":"That's great. Pastor Paul has spoken. Thanks."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":3787.08,"end":3787.48,"speaker":"Paul Vander Klay","text":"Thanks."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":3787.48,"end":3790.56,"speaker":"Jonathan Pageau","text":"This is great. I definitely, I'm looking forward to seeing you very soon."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":3790.56,"end":3805.59,"speaker":"Paul Vander Klay","text":"Looking forward to seeing you and John too. And, and you know, I've, you know, I've gotten to know Catherine and Eamon who are setting up this conference. They're great, you know, quite well. And so I really look forward to meeting with them in the flesh and. Yeah. So. All right."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":3805.59,"end":3807.47,"speaker":"Jonathan Pageau","text":"Maybe have a great trip to Europe too."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":3807.63,"end":3834.54,"speaker":"Paul Vander Klay","text":"Good place to land the plane. Yeah. And I hope if I can find reliable Internet connections from Europe, I hope to have, you know, unlike my vacations people, people on my channel have been, you know, you're not putting out the content I'm used to. Well, if I can find Internet connections, hopefully Vendanka and I will talk and we'll have Job in there and we'll have Matthias from Germany and two more of these. And so hopefully stuff will keep coming out that'll be different. My vacation, so."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":3834.62,"end":3835.46,"speaker":"Jonathan Pageau","text":"All right, everybody."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":3835.46,"end":3837.26,"speaker":"Paul Vander Klay","text":"All right, Jonathan, thanks a lot."}
{"episode_id":"SW - #249 - 2022-08-23 - Paul VanderKlay - Community and Self-Improvement","start":3837.26,"end":3946.44,"speaker":"Jonathan Pageau","text":"Bye bye, bye, bye. Hello, everyone. I want to invite you to an event which will be happening from September 16th to the 18th in Thunder Bay, Ontario, called Consciousness and Conscience. It is going to be a conference where I will be there with John Vervecki, with Paul Vanderklee, and also with Dr. Richard Moore. Mondril for those who follow the this little corner of the Internet, you will see that this is the closest thing to a conference bringing us all together that we're going to have in a little while. It is the closest thing to a symbolic world conference as well. It's going to be several days of talks, of discussions, and it's even going to start a few days early on the 14th where we're going to have an airsoft and barbecue. And it really shows you what is the purpose of this conference is to. To, to get together, to discuss ideas, to also get to know each other. So I'm really excited to participate in this. My own talk will be called Love and Attention. And I'll be looking at the manner in which love binds together our attention and why. I think that this is really the glue of consciousness in general and kind of one of the secrets to how reality presents itself to you. But mostly, really, I'm looking forward to being there with you guys, with Paul Vanderklee, who I've never met, with John Vervecki, who I always love to be together and discovering also Dr. Richard Mondril, who I don't know yet. I think it's going to be a wonderful event and I'm really hoping to see you there. If you want to sign up, go to Urbanabbey caconference and look up consciousness and conscience. I'm going to drive there. You know, because of our situation in Canada. I'm actually going to. To drive like 15 hours in order to get to this conference. So once I'm there, I'm going to be excited to. To make the most of the time I have with all you guys there. So I hope to. To see you there and to meet you there. And thanks."}
