{"episode_id":"SW - #305 - 2023-09-15 - Richard Rohlin - How to Read Like a Medieval Person","start":0.88,"end":41.19,"speaker":"Richard Rohlin","text":"So this is all by way of saying not only is the metric system demonic, but cause and effect is made up. In the Middle Ages, people did not see history. And again, you could read some of Van Alaskan's essays about this, and he's even got a whole section on it in a history of the island, if people are curious about this. But in the Middle Ages, people didn't see history as a series of causes and effects. They saw history as a battle between good and evil, which means that the most important thing in history has already happened, because that was the crucifixion and the resurrection of Jesus Christ. But history is this battle between good and evil. This is what the whole Apocalypse of St. John is about, is history seen as this conflict between good and evil in which good ultimately triumphs."}
{"episode_id":"SW - #305 - 2023-09-15 - Richard Rohlin - How to Read Like a Medieval Person","start":52.47,"end":130.37,"speaker":"Jonathan Pageau","text":"This is Jonathan Pedro. Welcome to the symbolic world. So, hello, everyone. I am back with Richard Roland for another universal history episode. This week, Richard is going to give us a presentation that he's prepared in another context. But that is very. I was very successful. It is about how to read like a medieval. How to look at the ancient world, how to read the text, how to engage with the ancient world in a way that's fruitful for us today. And before we start, I just want to make sure you know about the Beowulf class that we are putting together. Richard is going to give a Christian reading of Beowulf that we're going to have on the symbolic world community. I will be part of it. I will be taking the class and also giving some comments in the discussion. And so look at the description. There'll be a link in the description below, and we would love to see you come in. This is a new thing we're doing, and we're really excited about this possibility of diving in way more than what we do in just these podcasts and, and, and helping you learn how exactly like what we're talking about today, how to read these old texts, how to make them relevant to you today. So, Richard, kick us off."}
{"episode_id":"SW - #305 - 2023-09-15 - Richard Rohlin - How to Read Like a Medieval Person","start":130.61,"end":657.54,"speaker":"Richard Rohlin","text":"All right, well, thanks, Jonathan. I'm very excited about both the Beowulf class, which is. I mean, I think I've said this before on this podcast, but if I had to just have one book, that is the only book I could study and talk about for the rest of my life. You know, setting aside the holy scriptures, it would probably be Beowulf. So there's. There's nothing that I'm more excited to talk about and to get to talk about it with you and with all the people who have signed up to be a part of the class and a part of the live discussion. Everything else, it's going to be great. You guys can go to the Symbolic World store. I think there's a link there where you can get signed up for the class. So. But what we're talking about today, this is a talk that I gave at the Father photius avant's parish, St. Sava's Orthodox Church here in Allen, Texas. So shout out to Father Photius, who I know listens to these, to the universal history episodes and his family. They were wonderful. They, you know, really great church, really dynamic parish. If you can ever. If you're ever in the North Texas area and you can check out and support the work they're doing there, I think it's just incredible. He has one of the most, like, I would say, medieval churches in the area in terms of the way that they've built their building and laid out the interior and the art and the iconography that they're doing now. It's just fantastic. But. So this is a talk that I gave as a fundraiser for his parish, and a lot of people asked for a recording. It wasn't really recorded then, but I wanted to do it now in the context of the. The universal history discussion. Because one of the questions that I get the most often is something like, okay, but how do we actually read these stories, like, and see the things that you guys are seeing when you're. When you're talking about them? Basically, like, well, how do I do this at home? How do I tell my kids about this stuff? Right? When my kid asked the question, you know, okay, but did dragons really exist? Or, you know, okay, this thing happens in a saint story, but did they really do that? Like, how do I. How do I answer that question for them? So what I wanted to do was to actually kind of pull back the curtain a little bit. It's going to be a little bit of an apocalyptic episode this time and just talk about some of the underlying assumptions or the underlying understandings that we use when we read these old stories the way that we read them, and maybe that'll help people kind of move in that direction. So I wanted to start with a. A quote from C.S. lewis, which is where all Orthodox converts, American Orthodox converts, have to begin everything this, with a CS Lewis quote. This is in his essay De Audendius Poitis. He says there are two ways of enjoying the past as there are two ways of enjoying a foreign country. One man carries his. Carries his Englishry abroad with him and brings it home unchanged, we could say, like his Americanness now, because I think Americans have displaced the English as the worst tourists. But anyway, wherever he goes, he consorts with the other English tourists. By a good hotel, he means one that is like an English hotel. He complains of the bad tea where he might have had excellent coffee. He finds the natives quaint and enjoys their quaintness. In the same way, there is a man who carries his modernity with him through all his reading of past literatures and preserved it, preserves it intact. The highlights in all ancient and medieval poetry are for him the bits that resemble, or can be so read that, that they seem to resemble the poetry of his own age. But there is another sort of traveling and another sort of reading. You can eat the local food and drink the local wines. You can share the foreign life. You can begin to see the foreign country as it looks not to the tourist, but to its inhabitants. You can come home modified, thinking and feeling as you did not think and feel before. So with old literature, you can go beyond the first impressions that a poem makes on your modern sensibility by study of things outside the poem, by comparing it with other poems, by steeping yourself in the vanished period, you can then re. Enter the poem with eyes more like those of the natives. And so the premise that sort of like kicks off this, our discussion today is that the situation for us as Christians should be that the world is a foreign country, right? St. Peter says, I urge you, as sojourners and exiles, I think the King James says, strangers and aliens, to abstain from the passions of the flesh which wage war against your soul. The world should be a foreign place to us. But for most of us, especially those of us who are moving out of a modern context back towards some more traditional form of Christianity, right, It's usually the reverse. We, we come to the church finding it as a foreign country. And actually I would even say, for instance, you don't hear it actually very often anymore. But one of the. Sometimes one of the objections that I'll hear when somebody visits an Eastern Orthodox church for the first time is something like, oh, well, it's just, it's too Eastern, it's too difficult for the Western mind to understand, etc. Etc. As though there's something like hard coded into the Western brain, you know, that can't understand people going in and out of doors or something. You know, it's like a little. What do you really mean by but. But. But what they're really saying, though. And people, people don't realize this, but what they're really saying is it's not modern enough. Yeah, right. It's not an east west thing. And I've, you know, I've said many times, and I, I will keep saying it until I'm blue in the face that the real difference isn't east versus west, it's modern versus ancient. Yeah, right. So we come as modern people encountering a pre modern church, a pre modern holy tradition. And actually listen, even if you're Protestant and you've got no interest in becoming Eastern Orthodox or traditional Roman Catholic or something like that, the very fact that you have the Holy Scriptures, right, which is a pre modern, you know, text or a series of pre modern texts, it is something which is actually not written for you. Now all scripture is written for you because it's scripture. Just like the liturgy is always for you because it's the liturgy, but you aren't the original audience. Right. And it was something that was created, you know, through human tools. And those people that wrote those things were not, for instance, they were not 21st century Americans. One time when I was, I was teaching, this is my old church before we became Orthodox, I was teaching family. We had a sort of a family integrated Bible study. So like an all ages Sunday school, basically. It's this one of the things that I did. It was a great class, by the way. Love those people, love that class. It was so fun. But one of the one, you know, we're going through some of the psalms and so we come to some of these like the royal Psalms, the psalms that have to do with like the king, right? And I just said, hey guys, just to like, you know, just to. Because I'm an agent of chaos in the world. I just, I just, you know, I was like, I was like, hey guys. So, you know, as we get into this, we're going to read the psalm and it's about, you know, God saved the king, right? That's what the psalm is about. And then at the end I said, now having read the psalm, what would you guys say the most biblical form of government is? And everyone in the class, I mean there's like 40 people in this class, everyone said, oh, obviously it's a representative republic, you know, not even a democracy. They said representative republic is a good, good American conservatives. But, but I mean this is just, it's a little bit silly of an example, but it's a classic example of sort of taking our frame and trying to take it to the way that we read the scriptures, right? And so we do this because we're like that first kind of tourist. Right. We fail to realize that the holy, that holy tradition, so the scripture, the liturgy, the doctrine, the moral law of the church that we've received was never intended to satisfy our tastes. So when we encounter things that are sort of quaint, we're like, oh, isn't that nice? They used to believe that. And when we encounter things that we don't like, it's because they're too strange or they're too regressive or they're too Eastern or what have you. And so the point of actually this whole project, I would say the entire project of my adult life has been to help people be the good kind of tourist. Right. Several people have said, you know, in the discussion around the universal history videos, well, obviously you can't just turn your, your mind and your, you can't wind back the clock. You can't just become a 13th century Russian peasant as much as maybe you would like to do. And that's. That's true. That's true. But you could at least start by becoming the good kind of tourist. Yeah. And so the idea is to, is to kind of shift from seeing the church and the scriptures as a foreign country to seeing it as our home. Right. That all of these things, including the holy scriptures, are foreign to us in the sense that they're pre modern, that they're Eastern. You know, psalms were not written, you know, in, you know, Kentucky. They're ancient, they're hierarchical. We are modern, we're postmodern. We're obsessed with up to the minute relevance, with being egalitarian. And so when we try to wrangle with tradition by adjusting it or rebalancing it for modern day sensibilities, instead of encountering it for what it is, then it, it, you know, we end up doing violence to it. Right."}
{"episode_id":"SW - #305 - 2023-09-15 - Richard Rohlin - How to Read Like a Medieval Person","start":657.54,"end":721.41,"speaker":"Laura Diaz","text":"Tucson, the weight is over. Medi Weight loss. They're officially open on North Oracle Road. That's right. No more counting down the days. You can walk in right now and start your journey to a healthier you. Hey, it's Laura Diaz from iHeartRadio. And you can trust me, this isn't just another weight loss clinic. I know that because it's where I lost weight safely with real medical support. GLP1 medications. You can see them everywhere online right now. But the truth is, your health shouldn't be a DIY project ordering these meds without the professional guidance. It can lead to dangerous mistakes, wrong doses, no oversight, and serious risks at mediweightloss. I got the same medication, but with a customized plan, weekly check ins and a licensed physician guiding me every step of the way. And and the cost the same as those risky online options. Tucson, your moment is here. If you're ready to take control, feel better and lose weight the right way, mediweightloss is ready for you. Walk in, get started and see real results. Call or visit mediweightloss.com to learn more and book your free consultation today. That's mediweightloss.com pack up though, because Chevy."}
{"episode_id":"SW - #305 - 2023-09-15 - Richard Rohlin - How to Read Like a Medieval Person","start":721.41,"end":748.44,"speaker":"Richard Rohlin","text":"SUVs have the capability to take you to some incredible places. Like an adventure in the middle of in the equinox. Active, an SUV that will help you get away with confidence. Or head off for a night in the in Chevy Traverse with all the tech you need to stay connected. While the undeniable value of Chevy Trax will keep you moving from here to over here to way over here. Get to all the places you want to be with Chevy SUVs. See Watson or O'Reilly Chevrolet."}
{"episode_id":"SW - #305 - 2023-09-15 - Richard Rohlin - How to Read Like a Medieval Person","start":748.92,"end":812.64,"speaker":"Jonathan Pageau","text":"Yeah, and there's also like, there's also something to say that's important, which is that the modern world has been the world in which society has moved away from its faith, has moved away from its attachment, you know, to scripture, to faith. And so it's not surprising that in a world that was set up, let's say, that brought us away from faith in that world, it would be more difficult for us to understand the vehicle by which faith was brought into the West. And so we have to kind of humble ourselves and be careful because one of the problems that happens is that in the modern world you have two reactions. You have a kind of modernism that uses modern tools like science, like, you know, a kind of materialism, a kind of rationalism to destroy the past. And then you have strange people that still embrace rationalism and materialism and a kind of, that kind of attitude, but then use the very tools to try to defend texts that were never meant to be that in the first place."}
{"episode_id":"SW - #305 - 2023-09-15 - Richard Rohlin - How to Read Like a Medieval Person","start":812.88,"end":871.03,"speaker":"Richard Rohlin","text":"Yes. My own childhood is, I mean, I grew up in like a really hard line, young earth creationist, like literalist reading of Genesis, right? Where basically like they'll take certain lines in Genesis and try to like twist them to conform to sort of here's some fringe scientific theory, right? And there's a whole discussion to be had around this. Let's say I certainly believe God is the maker of all things, visible and invisible. And really strongly there's something deep in my core that reacts against the myth of Evolutionism. Right. But the problem with this approach is the way in which it subjects the scriptures to science. Actually, what both, like the new atheists and the younger, you know, answers in Genesis. And those folks, what they both agree on is that science is the standard. Yeah."}
{"episode_id":"SW - #305 - 2023-09-15 - Richard Rohlin - How to Read Like a Medieval Person","start":871.03,"end":874.59,"speaker":"Jonathan Pageau","text":"I've heard people say science is the mind of God, like in church."}
{"episode_id":"SW - #305 - 2023-09-15 - Richard Rohlin - How to Read Like a Medieval Person","start":875.39,"end":876.03,"speaker":"Richard Rohlin","text":"Yeah, that's."}
{"episode_id":"SW - #305 - 2023-09-15 - Richard Rohlin - How to Read Like a Medieval Person","start":876.03,"end":882.83,"speaker":"Jonathan Pageau","text":"Science is seeing the mind of God. And I was like, yeah, I. I mean, I was like 17 and I was already like, I don't know about that. That's not."}
{"episode_id":"SW - #305 - 2023-09-15 - Richard Rohlin - How to Read Like a Medieval Person","start":882.99,"end":1125.47,"speaker":"Richard Rohlin","text":"That's really. That's not good. Yeah, that's not great. Okay. So anyway, we want to help people be at least begin as being the second kind of visitor, the second kind of tourist, so that when we come to the church, the liturgy, into the scri, we encounter them not as some kind of a foreign country that needs to change and conform to the culture that we came from, but actually as our true home. Right. As the soul's true home. So one way to kind of frame this would be to say is to think in terms of mirrors and windows, Right. That ancient literature and ancient liturgy could either be a mirror that reflects our own faces back to us, where we sort of see the things we're looking for, or it could be a window through which we gaze upon paradise, upon the stars, upon the heavenly city, upon the love that moves the sun and the other stars, as Dante would say. Right. And so that's kind of the goal here is to cultivate this. I'll explain this at the end, but this mystagogical vision of the cosmos. So this being said, there are four things that I would put forward as these are shifts you must make if you're going to read ancient. Any ancient literature, let's say pre modern literature, because it's really ancient and medieval. Right. So if you're going to read any pre modern literature and really read it charitably, there are kind of four shifts that you kind of have to adopt. So the first is a shift in the way that we think about authorship and originality. And this is where. This is where a lot of the damage was done before people realized what was happening starting in the 19th century. So we have this. We have this discipline called signed contextual criticism. And on its own, it's just a set of tools for figuring out when something was written and who wrote it. Um, and so in that sense, you know, like, like many tools, it could be used in a good way. I have, you know, in my. In my own academic career, I have engaged in textual Criticism specifically in and around Old Norse poetry. And actually some version of this has existed, existed since the ancient world, right? Famously, Origen, you know, one of the most important, you know, his most important contributions to the tradition was essentially worked of, of textual criticism looking, you know, comparing the Septuagint to the Hebrew Old Testament. People have always known that there were difficulties presented by manuscripts and that manuscripts contradicted each other. Like people weren't stupid. It's true that literacy rates were generally lower, although not as low as people sometimes think they were. But people who were literate read a lot more than we do today. Like we live in a post literate society where we think we can read because we can read like a tweet or a, an X, I don't even know what we call them anymore. But like we think we're literate because we can read like a status update or you know, a headline or something like that. But actually most of us just read two sentences and we skip to the next paragraph and we read those first two sentences and so on. Right. We're actually sort of post literate. But people who could read in pre modern times read deeply. They read deeply. So they noticed these differences. They noticed way more differences. Actually. Sometimes I'll be reading along like in, in the, you know, something like the Ambigua, which is all about these difficulties and you know, written by Saint Maximus or something like that. Some, some text like I'll be reading along anybody like, ah, now here we clearly have what, what appears to be a, A, a difference between this gospel writer and this gospel, right? And I'm looking and I'm like, well, it doesn't really actually seem like it's a difference to me. Right. They were much more precise in, in the ways that they look for these things. So people always knew and people always understood that, that there were things like translation errors, copyist errors, right. Which could render a phrase. But the pre modern mind saw these difficulties as being providential actually as an indication that there is some deeper meaning the reader was intended by the Holy Spirit to unearth. It's like, it's like the, say, like, like the corner of a treasure chest poking up out of the ground. And you walk along, you trip across it and then you notice, oh, there's some buried treasure right here. Yeah."}
{"episode_id":"SW - #305 - 2023-09-15 - Richard Rohlin - How to Read Like a Medieval Person","start":1126.03,"end":1234.93,"speaker":"Jonathan Pageau","text":"And I want to defend that very precisely for people because people might think that it's just a cope, you know, and I think that you can actually, structurally, you can understand it, which is that imagine a story that you tell and that you have to remember. And one of the things that makes you help remember a story is it's just general coherence. It's like, if it makes sense, then you remember it better. Like, if it makes sense, then you can attend to it more easily. But the fact that in stories that are very ancient, certain quirky details that are so weird are maintained in the story means that there had to be great effort to remember that. You know, and so I. I've mentioned that, for example, like in. In a very simple one that has nothing to do with, like the. With Scripture itself. But in, for example, in translation about texts about St Christopher, there was this weird change that happened between the idea of Canaanite, like from Canaan, and then Canaan, like in terms of dog. Canaanites in terms of dog. And, and the. The people interpreting it says, well, it's all ridiculous because it's just a mistake in transcription. But if. If someone had made a mistake in transcription and that mistake in transcription made absolutely no sense, it would have been corrected in the next iteration. But if there's something about it that is holding, then maybe that. That that mistake is then continued on mistake. It's not a mistake. It is something like a providential transformation of the text. And so we. We. It. I know it's hard for people to understand, but if things are remembered and attended to, even though they're weird, it means there's something hidden underneath it. And so that's what. That's how the church fathers would see it. It's like there's some weird detail that's so strange that it doesn't seem to make sense. Like, why is it there if it's maintained there?"}
{"episode_id":"SW - #305 - 2023-09-15 - Richard Rohlin - How to Read Like a Medieval Person","start":1235.61,"end":1249.13,"speaker":"Richard Rohlin","text":"And this is actually. I mean, the. The best example for this is just to understand. This is why we have four Gospels, not one. I mean, it actually sort of is the one gospel, right? But it. But we have four gospel accounts, let me put it that way."}
{"episode_id":"SW - #305 - 2023-09-15 - Richard Rohlin - How to Read Like a Medieval Person","start":1249.13,"end":1249.53,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #305 - 2023-09-15 - Richard Rohlin - How to Read Like a Medieval Person","start":1249.77,"end":1668.21,"speaker":"Richard Rohlin","text":"So actually it's not the first book of the New Testament is not Matthew. It is the gospel according to St. Matthew, right? This is how it's said liturgically. And even when I speak about it in, like, teaching class and things like that, I always try to use that precise language because it's the one gospel. And in fact, we collect all four accounts into a single book in the Orthodox Church, which we call the Gospel book, which we. We parade around and we kiss and we venerate, we read from and. And everything. So it's the one gospel, right? This verbal icon of Christ is how The Fathers speak of it, but we have four accounts. And those four accounts have these sort of subtle differences, sometimes major differences. But there were attempts actually even quite early on to create a single harmonized gospel account. You know, Tatian's attempt is the most famous. But a lot of people tried this and actually the church rejected it. Right? The church rejected it. If we wanted just a single synthesized, smooth account, we could have had it, right? We could have kept it. We could have just picked one of the four gospels at any given point in time, or we could have made our own, you know, our own version that, you know, smoothed out all the differences, included all the parts. If we wanted that we could have had it. But it was not God's will and it was not, you know, what the Church agreed upon to have that. We have four gospel accounts, and some of these gospel accounts have subtle differences. Actually. If you look at I'll tease something which I won't pay off, and so people will have to go dig themselves for it, as I think, you know, this is how Christ teaches. So there's precedent for it. So the thing that I'll tease and not pay off is that if you go and look at the account of how the myrrh bearing women come to the tomb in the Synoptic Gospels, it's a little bit different in each, each version and the list of who's there and who's not there and the timing Mary Magdalene coming and, and the apostles, it's all just like there are these little subtle differences. But if you go and you read for instance, St. Gregory of Palomas's homilies on these texts on the Resurrection, there is actually a really beautiful mystery that St. Gregory and actually other church fathers saw as being hidden, as sort of being hidden there within the Gospels concerning, concerning the resurrection and the Mother of God. So I won't explain what that is, but I'll encourage people to go out and kind of research it for themselves. Okay, so, so this is, this is like one commonplace example, but you could basically say, if you wanted to boil down this pre modern approach to authorship, you could say that they approached it this way. First of all, they approached reading with credulity. Credulity, that is, they believe that the author loves you because producing a book is an act of love, right? Books are extremely expensive in the ancient world. They, they create, they, they, they represent not just a lot of time and training that would have to go into somebody skilled enough to produce a book, but also like the lost economic opportunity. Because most books are written on the, on the, on the skins of young animals, right? Sheep and cattle specifically. Well, if I kill a young calf, that's a calf that's now out of my breeding pool, I can't ever get meat from that calf. I can't ever get milk from that. You know, I can't get any of that stuff, right? So it presents a tremendous, like, lost opportunity. And so this is actually why, for instance, as you, if you look at medieval text, the farther north you go, in other words, the poor people get and the, the more scarce like animals become, the more abbreviations are used in the texts. And so by the time you get to Iceland, it's like they have an abbreviation for almost every word. It's a total nightmare. Like if you read like, you know, you know, stuff written on the continent and it's in this beautiful Carolinian minuscule and it's super legible and you can basically just read it off the page and then you look at something that's happening like 600 years later in Iceland and, and it's almost completely illegible unless you have a magnifying glass. Why? Because they're trying to save paper, right? They're trying to save paper. So creating a book is an act of love. The pre modern approach to reading is first of all this with an assumption that the author loves you, and then the assumption that the Holy Spirit has guided the process not only of composition, which the sort of fundamentalist world that I grew up in are really big on this. The Holy Spirit has guided the process of the composition of the Scriptures. Although in the Middle Ages they would have actually said, this is true for all good books. It's especially true for Scripture, but it's true for all good books. But the Holy Spirit is guided not only the process of composition, but also that of transmission, right? So that the Bible that you have is the Bible that you have, not some easier version of the Bible, not some version of the Bible that you would have made to satisfy like modern questions and concerns. Because that's what the Holy Spirit has given you, right? And so at the end of the day, they would see the book as a gift received from authority. That's what the book is. It's a, it's a gift. In fact, our word authority, right, Is the same root as author, right? So a book is a gift received from authority in the modern world, right? With this, the discipline of textual criticism is, is used to look for these differences between texts, no matter how minute they are, right? And use them to propose. Propose New theories. Why new theories? Because people have to write dissertations. You got to get published, right? You can't get published saying something somebody's already said. So you got to come up with a new theory. And so it's used to propose new theories about the age, authorship, provenance of. Of text and of course, sacred text among them. And at its worst, and. And obviously this is, again, it's a useful discipline. It's something that I do and engage in on a regular basis. But at its worst, this modern way of reading sees differences and difficulties as being something worse than mistakes, right? They're accidental. Tells that someone is being dishonest with you, that somebody is trying to pull the wool over your eyes. And so there's this idea that on the one hand, the apostles were these master con men, right? These master con men, they're fooling everybody into this construct of Jesus of Nazareth that this new religion they started. But then on the other hand, they're so bad at their job that they didn't notice their own, you know? You know, they couldn't get their stories straight. Right? It's just. It's a little, obviously, I think it's a little ludicrous, right? But the assumptions of this way of reading, in contrast to the pre modern way of reading, are first of all, suspicion. Right? There's an inherent hermeneutic of suspicion. The author has an agenda. And then usually this idea that historical forces, I say in. In my most Marxist accent possible, right? That economic, political, social forces guided not the Holy Spirit, but these forces, these forces guided both the composition and the transmission of the work. And so the book goes from being a gift received from authority and it becomes a text received from an author. Right? A text received from an author."}
{"episode_id":"SW - #305 - 2023-09-15 - Richard Rohlin - How to Read Like a Medieval Person","start":1668.77,"end":1674.45,"speaker":"Jonathan Pageau","text":"So it's sort of like a text received from, like, patriarchal, you know, power."}
{"episode_id":"SW - #305 - 2023-09-15 - Richard Rohlin - How to Read Like a Medieval Person","start":1674.45,"end":1739.39,"speaker":"Richard Rohlin","text":"Yes. Well, that. That's really. That's really. That's when postmodernism comes in, right? And so this modern way of reading focused on first and foremost on authorship is the most interesting question. Because if we can know when someone lived and what their social, economic circumstances were, then we're better able to understand the agenda of the text. But what postmodernism does is it comes in and deconstructs the modern way of reading further because it assumes basically liquidity. The author is dead, right? The. This whole death of the author thing, the author is dead, and therefore any agenda that they might have had, you. You don't actually need to know or care about that because this book, the book is Now a fluid reality which can be manipulated to serve to redistribute social and economic power via various critical lenses. And so this is when you get into, well, let's do a, let's do a post colonial reading of Beowulf, which is a real thing that somebody has done, you know. Well, did anybody writing Beowulf have postcolonialism or even colonialism in mind?"}
{"episode_id":"SW - #305 - 2023-09-15 - Richard Rohlin - How to Read Like a Medieval Person","start":1739.63,"end":1742.19,"speaker":"Jonathan Pageau","text":"Yeah, but the disease is already there in the modern thinking."}
{"episode_id":"SW - #305 - 2023-09-15 - Richard Rohlin - How to Read Like a Medieval Person","start":1742.19,"end":1743.39,"speaker":"Richard Rohlin","text":"No, it is. It is. Yeah."}
{"episode_id":"SW - #305 - 2023-09-15 - Richard Rohlin - How to Read Like a Medieval Person","start":1743.39,"end":1788.67,"speaker":"Jonathan Pageau","text":"Because in the modern way of thinking, what they would want to do is show how the, let's say the, the power structure, whether it's from a Marxist point of view or some. Something akin to that is embedded in the text. And the fact that it was authority authoritative means that it participated in, in maintaining certain social orders that were important for the people of the day. And so they'll tend to look into the text and like to see the preservation. Like if you look at, at some of the Old Testament title critical writing, they see it as a conflict of different groups and different political factions versus the fighting inside the text and that there's this like conflict that you can find inside the text that's showing a political conflict within Israel at the time."}
{"episode_id":"SW - #305 - 2023-09-15 - Richard Rohlin - How to Read Like a Medieval Person","start":1788.67,"end":1788.87,"speaker":"Richard Rohlin","text":"Right."}
{"episode_id":"SW - #305 - 2023-09-15 - Richard Rohlin - How to Read Like a Medieval Person","start":1788.87,"end":1848.04,"speaker":"Laura Diaz","text":"Tucson, the weight is over. Mediweight loss. They're officially open on North Oracle Road. That's right. No more counting down the days. You can walk in right now and start your journey to a healthier you. Hey, it's Laura Diaz from iheartradio and you can trust me. This isn't just another weight loss clinic. I know that because it's where I lost weight safely with real medical support. GLP1 medications. You can see them everywhere online right now. But the truth is, your health shouldn't be a DIY project ordering these meds without the professional guidance. It can lead to dangerous mistakes, wrong doses, no oversight and serious risk. At MediaWeightLoss, I got the same medication but with a customized plan, weekly check ins and a licensed physician guiding me every step of the way. And the cost? The same as those risky online options. Tucson, your moment is here. If you're ready to take control, feel better and lose weight the right way, mediweightloss is ready for you. Walk in, get started and see real results. Call or visit mediweightloss.com to learn more and book your free consultation today."}
{"episode_id":"SW - #305 - 2023-09-15 - Richard Rohlin - How to Read Like a Medieval Person","start":1848.04,"end":1917.08,"speaker":"Announcer","text":"That's mediweightloss.com looking for your next go to smoke shop. Stop scrolling. I've got you. Headshop.com is the number one online smoke shop already trusted by over 100,000 happy smokers just like you. They've got it all. Dab rigs, vaporizers, glass bongs, smoking pipes, even THCA flour, all in one place. Need a new daily driver? Grab a smooth glass bong or a classic smoking pipe. More of a copy concentrate fan. Their dab rigs, E rigs and wax accessories are designed for smoother, harder hitting sessions. And yes, they've even got legal THC flower. Best part, every order ships fast and discreet, which is why thousands of smokers keep coming back. So don't waste time hopping between shops. Shop the best in dab rigs, vaporizers, glass bongs, smoking pipes and THC flower. Right now at headshop.com the number one online smoke shop, headshop.com has what you need. Check it out today. Oh, and because you're listening right now, you get 10% off your next order when you use the coupon code HSHOP at checkout. Go to headshop.com now and smoke smarter."}
{"episode_id":"SW - #305 - 2023-09-15 - Richard Rohlin - How to Read Like a Medieval Person","start":1918.6,"end":1931.6,"speaker":"Richard Rohlin","text":"And the big problem that I am currently having with a lot of, let's say, broadly conservative reactions to post modernity is that they are trying to get back to modernity."}
{"episode_id":"SW - #305 - 2023-09-15 - Richard Rohlin - How to Read Like a Medieval Person","start":1931.68,"end":1932.16,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #305 - 2023-09-15 - Richard Rohlin - How to Read Like a Medieval Person","start":1932.32,"end":1940,"speaker":"Richard Rohlin","text":"And this is just. It's not far enough. Right. It's not far enough for us as Christians. That's not, that's not an acceptable solution."}
{"episode_id":"SW - #305 - 2023-09-15 - Richard Rohlin - How to Read Like a Medieval Person","start":1940.08,"end":1940.56,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #305 - 2023-09-15 - Richard Rohlin - How to Read Like a Medieval Person","start":1941.68,"end":2035.74,"speaker":"Richard Rohlin","text":"So to talk a little bit about the idea of like authorship, the, the authorship in the ancient world was always understood as, as being a, a composite thing. This is part of why, like the, these, these like modern, the, the modern hyper fixation on, oh well, there's this group in the text and this like you're just saying this is like sort of missing the point from a pre, modern perspective because. Well, first of all, putting the name of an established authority on a work, let's say for instance the Old Testament book the Wisdom of Solomon, this was often, this is a link with the chain of tradition. Right. It's not always an absolute statement about the origin of every syllable in the works. In the case of the Wisdom of Solomon, nobody thought that Solomon wrote, wrote it. I mean it was, everybody knew it had been written much later, but they named it that. Why? Because it's in the Solomonic wisdom tradition that goes back to proverbs. You've got the Proverbs of Solomon. Did Solomon write all of the Proverbs of Solomon according to the Proverbs of Solomon? He did not. But we still call them Proverbs of Solomon in the way that we still call the Psalms The Psalms of David. Right. David is the author of the Psalter, even though if you actually, in the actual text, it'll say he's not the author of every single one of the Psalms. This is, again, this is not a problem for anybody before the 19th century. Like, nobody cares. Like, like, we understand what we mean when we say this. Right. So if somebody wants to say. If somebody wants to say there's like a, you know, there's like a little bit of, you know, oh, this later thing was added to one of the books of Moses, for instance. Right."}
{"episode_id":"SW - #305 - 2023-09-15 - Richard Rohlin - How to Read Like a Medieval Person","start":2036.06,"end":2042.66,"speaker":"Jonathan Pageau","text":"Well, like the description of his death, for example, let's say. Right, right. Which is that someone else wrote the description of Moses is death."}
{"episode_id":"SW - #305 - 2023-09-15 - Richard Rohlin - How to Read Like a Medieval Person","start":2042.82,"end":2043.94,"speaker":"Richard Rohlin","text":"Right, right."}
{"episode_id":"SW - #305 - 2023-09-15 - Richard Rohlin - How to Read Like a Medieval Person","start":2044.02,"end":2045.22,"speaker":"Jonathan Pageau","text":"Whatever. Who cares?"}
{"episode_id":"SW - #305 - 2023-09-15 - Richard Rohlin - How to Read Like a Medieval Person","start":2046.34,"end":2418.83,"speaker":"Richard Rohlin","text":"Right. Not. Is that. Is that a problem for anybody? No, not really. Right. Because again, we, the pre modern person trusts that the Holy Spirit is guided not just the process of composition, but also the process of transmission. And so this is even when you get into, like, there are certain pericopes in the Gospel According to St. John, specifically the one concerning the woman caught in adultery. Right. Which doesn't show up in some ancient manuscripts. Right. And so then you could sort of ask the question, well, you know, is this originally part of the Gospel or not? And actually, for our purposes, it doesn't matter. What matters is, is that, you know, this is. This is something at. Somewhere in the. In the process of transmission, right. Which the Holy Spirit oversaw. This. This story is one of the stories that's in this gospel according to St. John. It's in this Yohanian tradition. And. And then you would just look at, well, how does the church. How do we use this liturgically? And that sort of will kind of clear up some of those questions. Now, sacred texts were copied with a great deal of fidelity, but the farther out you get from Holy Scripture, the more likely it is for major changes to be introduced. So a good example of this in an essay of his called the Genesis of the Medieval Book, which is a really important essay that I think everybody who's interested in these things should read. C.S. lewis uses the iterations of the Arthurian tales. And so he starts with Geoffrey of Monmouth as an example, who just includes a little bit of King Arthur in his overall annals. Right. And then you've got Wace and then. And then Lyman coming along and enlarging and massively improving on what Geoffrey did. Right. And it was understood that this is sort of like, oh, let's say, far enough out in the narthex, as it were. Right. You know, near Enough to the base of the mountain that you have the ability to kind of improve things, but also bring in things that you've heard that the previous author maybe hadn't and stuff like that. Right. And so the way to think about a medieval book or a pre modern book is that it's a cathedral. Right? Every great cathedral built in the Middle Ages was built over the course of one, two, in one case, 600 years. Right. Well, you're going to start building a building that is going to be finished by your grandchildren and great grandchildren who are going to have totally different architectural tastes than you. You do, right? And so these great medieval cathedrals, a lot of times you'll have. Well, this bit was done here and this bit was done at this time, and this bit was done at this time. And so everything like sort of doesn't match, but at the same time it totally goes together. Right. Because it just sort of grew up in this organic way. Right. But if you wanted to try to pick through and pull out and try to pull out the pieces that you could say, well, this is the original cathedral, then the building just collapses. Right. And this is the kind of the same way that medieval books work. So Eugene Vodoloskin, who you've had on the channel before, who's, you know, a wonderful, wonderful fiction author, I'll hawk his new book once again, the History of the island, which is actually a. It is a work of medieval universal history as a novel and it's. It's just fantastic. So people should go read it. But he said, in a really important essay of his called the Middle Ages, he said that it's important to note that there's a spectrum here, that the stability of a medieval text depended in large part on its closeness to the Holy Scripture, the primary book. In the Middle Ages, the Holy Scripture, the text of texts standing at the center of spiritual life, had a special fate. Any new manuscript copy of the Holy Scriptures was produced by drawing not on one, but on two or more manuscripts. The scribes looked after the integrity of the holy text by comparing manuscripts, correcting possible errors and deviations from the canonical text. At the other end of the spectrum that ends with maximal distance from the sacred, one can see that the text changed significantly when reproduced. And everybody was okay with this. Yeah, right. What, what mattered wasn't so much who said something, but what was said, you could say. And so they don't really have. In the Middle Ages, they don't really have this idea of plagiarism, and in fact, they don't really have a strong notion of authorship. Most medieval authors simply did not sign their work unless they were a very important person, like one of the church fathers or, you know, an emperor or something like that, who, who had like the spiritual or social right to do so. But for most, most medieval authors, the idea that you would sign your work would be seen as kind of like a, an act of pride. So that's the first thing is the shift in the way that we approach, that we approach the question of authorship and transmission. And if we can actually just make that one shift, then 90% of people's problems and like hang ups and things like this, especially the kind of hang ups that very smart people tend to have, will go away. And then you can actually start reading the text. Right? It's the. I always crack up whenever like I buy a new edition of some patristic text or medieval poem or something like that. And the actual text itself is not that long. It's maybe 80 pages. Before the 80 pages you have 150 pages of critical analysis of. Here's what the guy who put this book together, you know, basically this is his PhD dissertation. Here's what he thinks about the text, right? And it's sort of clear by volume which thing is the more important in terms of what's being published. All right, so the second thing that I would want to kind of point out as a necessary shift, this is a much shorter point, is the meanings of words and things, right? Because modernism is a flattening and a separation of space and time. We'll talk about that a little more in a moment. But it also tends to flatten out meaning as well. So as such, modernism is usually capable of understanding something as either being literal, which, by which we mean being understood as most obvious materialistic sense, like a measurable taxonomical category. Usually it's something like if you had a camera. Yeah, right. But of course, of course this itself is a bad test, right? Because we all know perfectly well from recent events that you can have a camera on site and half the people watching the video see two totally different things, right?"}
{"episode_id":"SW - #305 - 2023-09-15 - Richard Rohlin - How to Read Like a Medieval Person","start":2418.83,"end":2422.19,"speaker":"Jonathan Pageau","text":"You know, yeah, all that during the trucker protest."}
{"episode_id":"SW - #305 - 2023-09-15 - Richard Rohlin - How to Read Like a Medieval Person","start":2422.19,"end":2447.26,"speaker":"Richard Rohlin","text":"Very clearly. Yeah, it's just trucker protests. And I mean, lots of other things, you know, like almost any tragedy that gets spun for political purposes or whatever, somebody will have a video of what happened. And half the people who watch it see one thing and the other half who watch it see the other thing. But anyway. But modern people will. Are usually capable of understanding something as either being literal or allegorical which. By which they mean having a symbolic meeting. And that's."}
{"episode_id":"SW - #305 - 2023-09-15 - Richard Rohlin - How to Read Like a Medieval Person","start":2447.26,"end":2448.54,"speaker":"Jonathan Pageau","text":"That's what the thing we, we know."}
{"episode_id":"SW - #305 - 2023-09-15 - Richard Rohlin - How to Read Like a Medieval Person","start":2448.54,"end":2448.74,"speaker":"Richard Rohlin","text":"We."}
{"episode_id":"SW - #305 - 2023-09-15 - Richard Rohlin - How to Read Like a Medieval Person","start":2448.74,"end":2459.98,"speaker":"Jonathan Pageau","text":"We hit that all the time on the symbolic world. Because at the outset when I started talking about these things, yeah. I would never get backlashes of people saying, oh, you're saying it's all allegorical, it's all metaphor, you know, and I'm like, I'm."}
{"episode_id":"SW - #305 - 2023-09-15 - Richard Rohlin - How to Read Like a Medieval Person","start":2460.36,"end":2466.12,"speaker":"Richard Rohlin","text":"Any of those things, but I still remember your. There is no such thing as literal video. Yeah, yeah, yeah."}
{"episode_id":"SW - #305 - 2023-09-15 - Richard Rohlin - How to Read Like a Medieval Person","start":2466.36,"end":2487.32,"speaker":"Jonathan Pageau","text":"Which is like, purely medieval, like in the sense that. That we're talking about now, which is that There, There, you know, it's like the. This idea of, like this objective reality that is completely neutral, of. Of. Of importance. It's like even in the modern world, even though we have that category in the modern world, it. It falls apart very fast, right?"}
{"episode_id":"SW - #305 - 2023-09-15 - Richard Rohlin - How to Read Like a Medieval Person","start":2487.79,"end":2723.45,"speaker":"Richard Rohlin","text":"And so this is. This is, I think, one of the things that this one. In the next, I would say the next three things. Like, there are four things. These next three things are the things that your channel has probably done the most open people's eyes on. Like this, this understanding. Like, if you can just see that things can mean more than one thing, right. That words can mean more than one thing, but also that things that, that, that things that exist in the world have meaning, they have significance. That, you know, you can have a tree, right? And the tree is. You could say in some. In some objective secularist reality, right? The. The tree is just. It's just an arbitrary organism. But actually, even materialists don't usually think this way because. Because they'll be, oh, well, you can't. Trees are good for the environment, right? You can't cut down trees. But actually, if. If we're, if we're doing a secularist materialist devoid of meaning, the tree is just an organism. Its existence is just as arbitrary as every other organism's. Right. Unless I give it meaning, there's no reason I can't cut it down. Yeah, right. So medieval people believed. I just read that quote from Vadaloskin. Because they believed that everything they wrote and read was, no matter what its style, to some degree, a continuation or a concretization of the Holy Scriptures. Because they believe this. They believe that books could have multiple complementary layers of meaning. Very simple. We just. For Orthodox Christians, actually, Old calendar, new calendar, both would have recently finished the Dormition fast. So every year during the Dormition fast, my family reads the Life of the Virgin by Saint Maximus the Confessor, which is his sort of hagiography of the life of the Mother of God. And early on in it, he's Talking about the 44th Psalm, you know, the queen stood at thy right hand, clothed in, you know, and this is the. This is like one of the primary, you know, Psalms, one of the primary Old Testament passages that the church sees. And historically, all Christians have seen as. As talking about the Mother of God. And. And he says, but if you find somebody who says that the queen in this passage actually is the church, there's no problem with that because first of all, she is the church. And secondly. And then he says, words authored by the Holy Spirit ought not to be understood as having only one meaning. Very, very. Just, very, very simple words authored by the Holy Spirit ought not to be understood as having only one meaning. Right? And so in the Middle Ages, this eventually develops into something that probably most people who have taken some kind of a class on, like the Middle Ages or read like Augustine's, confess St. Augustine's confessions in school or something like that will be familiar with. And that is the fourfold sense. Right. And there's like, there's actually even fun little Latin mnemonic poems to help people remember this. Right. But basically it's the literal. We could say historical might be a better way of phrasing that. Right. Here's what happened in history. Right. Although even that is. Is maybe a little fraught. But let's just say, like, this is what happened in history. This is how it was recorded. This. This is the event that was recorded. Right? That's. That's what that is. Then there's the typological, which would be, in what way does this text, this story or this symbol or something like that, in what way does it connect with the life of Christ, with the life of his mother, with the life of the church, etc. So a very good example is something like, you know, the Old Testament, the serpent in the wilderness. Right. The brazen serpent. Well, on the historical level, God told Moses to make a serpent. Right? This is the literal reading, okay. God told Moses to make a bronze serpent. He lifts it up on a pole, and everybody who looks at it or touches it is healed. Now, on its own, that doesn't actually have a whole lot of meaning, Right. It's just, here's God gave you instructions to do an arbitrary thing. Yeah."}
{"episode_id":"SW - #305 - 2023-09-15 - Richard Rohlin - How to Read Like a Medieval Person","start":2723.45,"end":2740.23,"speaker":"Jonathan Pageau","text":"And I always did it. I always take the literal meaning as, like, the way we talk about literal meaning. It's just like getting the facts. Right, Right. They're just getting. This is what the text says. Like, the text says this because one of the problems with sometimes, in a negative sense, we allegorical reading is that people gloss the text."}
{"episode_id":"SW - #305 - 2023-09-15 - Richard Rohlin - How to Read Like a Medieval Person","start":2740.31,"end":2740.71,"speaker":"Richard Rohlin","text":"Yes."}
{"episode_id":"SW - #305 - 2023-09-15 - Richard Rohlin - How to Read Like a Medieval Person","start":2740.71,"end":2754.79,"speaker":"Jonathan Pageau","text":"They don't pay attention to it carefully. They just kind of gloss over it and then give this, like, high meaning. But I think it's really important, even in symbolic interpretation like that you state that you get the text. Right. You get to get everything there. Right."}
{"episode_id":"SW - #305 - 2023-09-15 - Richard Rohlin - How to Read Like a Medieval Person","start":2755.35,"end":2910.5,"speaker":"Richard Rohlin","text":"Yeah. So. So in the. In that case, here's the historical event. God told Moses to do a thing. Moses did the thing, people were healed. Right. But then there's a typological significance which has to do with the lifting up of Christ on the cross. This one is. Is. Is easy because Christ himself explained it to us. Right. Which we don't always get. We don't always get. And then the third level is what's sometimes called the moral or the tropical tropological level. And moral, as in this is the moral of the story. In other words, because this happened, here's how you should behave. Right. That's the moral of the story. This is. Any one of these levels, by the way, is like a fine level, but if you treat it like it's the only one, then you get, like, an awful version of the story. So, for instance, there's a lot of, like, mangling of traditional fairy tales because people were, you know, fairy tales which were not traditionally just stories for children. Yeah. But in the Victorian period, when they tried to make them into just stories for children, they would always rewrite them with this sense of. And then here's the moral at the end. Yeah. Right. And so it's just like. It just, like, saps the vitality out of the. The story, which is actually mostly happening on the typological level. Right. And then the. Finally, the fourth level that. That they would see would be, was sometimes called the. The anagogical or the eschatological level, which is basically connecting the text with last things, the end of the world, or the end of a pattern, the end of a cycle, or most importantly, probably the end of your life. Right. And it's important to note that people didn't just use these senses to read the Scriptures. Yeah. They actually use them to read Homer, and they use them to read everything. And they would actually say, you could read the Odyssey. And there's a typological sense in which you can apply the Odyssey to the life of Christ. Yeah. Right. And they 100% sincerely believed that. And what I'm sort of, you know, obviously trying to imply is that you can do this, too. You can do it with something like the Lord of the Rings, I've got a whole podcast where that's what we do. So. But in the same way, things can mean not just words, but also things like. Like the things that you encounter in the world can mean more than one thing. Right again. Rocks, trees, basic things like that. My favorite example, honestly, is bread and wine. Right. You know, part of the whole symbolic literal argument, you know, around the. The Eucharist in the Christian, you know, west over the last 500 years, 600 years now, has. Has been because people sort of see, well, it can only be one thing. Like, it can only."}
{"episode_id":"SW - #305 - 2023-09-15 - Richard Rohlin - How to Read Like a Medieval Person","start":2910.5,"end":2921.18,"speaker":"Jonathan Pageau","text":"It can't be bread and the blood and body part at the same time. So we have to, like. We have to collapse it to the body and then make the bread. What do they call it? Like, just like, details."}
{"episode_id":"SW - #305 - 2023-09-15 - Richard Rohlin - How to Read Like a Medieval Person","start":2921.18,"end":2921.42,"speaker":"Richard Rohlin","text":"Like."}
{"episode_id":"SW - #305 - 2023-09-15 - Richard Rohlin - How to Read Like a Medieval Person","start":2921.42,"end":2921.78,"speaker":"Jonathan Pageau","text":"Like."}
{"episode_id":"SW - #305 - 2023-09-15 - Richard Rohlin - How to Read Like a Medieval Person","start":2922.69,"end":2924.29,"speaker":"Richard Rohlin","text":"Yeah, accidents or whatever it is."}
{"episode_id":"SW - #305 - 2023-09-15 - Richard Rohlin - How to Read Like a Medieval Person","start":2924.29,"end":2926.37,"speaker":"Jonathan Pageau","text":"Yeah, accidental. That's right. That's the word."}
{"episode_id":"SW - #305 - 2023-09-15 - Richard Rohlin - How to Read Like a Medieval Person","start":2926.37,"end":3056.53,"speaker":"Richard Rohlin","text":"Yeah. So one of my favorite things that Dante wrote is actually a series of letters. Oh, I gotta plug my computer in. Is a series of letters that he wrote actually explaining the Divine Comedy, which is. Which is nice. Again, when the author, like, gives you an explanation of his own thing, pay attention. He may be wrong, you know, but. But still, you should pay attention. So what. What he says is that we should call it. That is writing polysemus, that is, of many senses. First sense derives from the letters themselves, a second from the things signified by the letters. We call the first sense literal. So he gives his own explanation for. For this, and then he gives an example from the Comedy. So to clarify this method of treatment, consider this verse. When Israel went out from Egypt, the house of Jacob, from a barbarous people, Judea was made his sanctuary, Israel his dominion. Which, by the way, that's the psalm that the souls sing when they're being brought to the mountain of purgatory at the beginning of Purgatorio, he says, now if we examine the letters alone, the exodus of the children of Israel from Egypt in the time of Moses is signified. That's the letter. That's the level of the letter we call the literal meaning, right in the allegory. It's our redemption is accomplished through Christ. So that's the typological sense. In the moral sense, the conversion of the soul from the grief and misery of sin to the state of grace. So this is how I should behave because of this. And then in the anagogical or the eschatological sense, the exodus of the holy soul from the slavery of this Corruption to the freedom of eternal glory. They can all be called. And then he says they can all be called symbolic, right. Of course, he means something different by that than most of us mean today. But, and, but this is actually how he uses the psalm in the Comedy, because if you pay attention to those early cantos of Purgatory, that's actually what is happening. It's all four of those things. It's, you know, remembering this time God delivered his people, but also in the moral sense, it's the conversion of Dante's soul from the grief and misery of his own sin. Right. And so on. So that's the, that's the second thing that I would want to help people make the shift on is that is the meaning of words and things, right? And their ability to kind of have that, that the world itself is symbolic, the world itself is polysemus. And that these connections are not arbitrary, which is."}
{"episode_id":"SW - #305 - 2023-09-15 - Richard Rohlin - How to Read Like a Medieval Person","start":3056.53,"end":3130.44,"speaker":"Jonathan Pageau","text":"Yeah, but the. Not arbitrary is very important because this is something that we run into with postmodernism, which is that postmodernism argues for polysemy as well, but they argue for free floating polysemy. So like, the idea is that is that you have multiple meanings, but those multiple meanings are disconnected from each other and there isn't, let's say, an underlying analogy between the different levels of meanings. And so, and interestingly enough, is that because of that when now people like you and I argue for polysemy, people accuse us of being postmodern because that's where they've heard that and they're like, well, how can it have several meanings? It means that everything's going to blow up and then, right, we don't know what's real and it's all made up and it's all in your mind and it's all that. But it's like, no, it's none. It's, it's neither of those. The, the, the poly, the, the polysemic aspect of a text is all directed, right? It's all directed towards the truth. And that's what makes the different levels cohere together. And so when Dante presents his different levels of what he means by that psalm, those, it, it's not, they're not disconnected, they're just different levels of the same meaning, the different levels of the same truth."}
{"episode_id":"SW - #305 - 2023-09-15 - Richard Rohlin - How to Read Like a Medieval Person","start":3130.6,"end":3202.32,"speaker":"Richard Rohlin","text":"And it's because they had a, you say the pattern or the interpretive map that they're using for both the book of the Scriptures and also the book of creation, right. Is the passion and resurrection of Jesus Christ. Yeah, right. That's the central thing that you have to take as completely necessary to this entire model. Right. That without it, without it, almost all western literature just becomes incoherent. Right. Even fairy tales, Even fairy tales. Most of the, the fairy tales written by the Brothers Grimm and I'm talking like the first edition that had all the gnarly stuff in it before they kind of, you know, made it polite later. Yeah, but, but the, the, the, the. All those fairy tales, right, Those fairy tales actually have the gospel story encoded within them. Right. On the typological level. And that doesn't mean it had to be a deliberate thing. Right. That this is just, you know, I am, I mean you're, you're. Your thing that you say, right. This is how the world lays itself out. Yeah. Right. This is, this is the way that things are. Right."}
{"episode_id":"SW - #305 - 2023-09-15 - Richard Rohlin - How to Read Like a Medieval Person","start":3202.88,"end":3263.1,"speaker":"Jonathan Pageau","text":"That's really important because especially. And it's weird because a lot of people have done the opposite which is to try to make the fairy tales into non Christian things. And usually what they, they mean by that is because the fairy tales are immoral often. Actually they aren't actually. They actually aren't usually about just like getting behavior. They're quite immoral, they're quite mythological and they can be quite jarring. But the truth is that like read the story of Samson again. I read the Book of Judges. This is actually part of our tradition. You know, the idea that everything has to be clean and moral and, and puritan is ridiculous. It's just not part of the tradition at all. Like the, the, the. These gnarly and kind of weird stories. The way that people read Homer there was, there's very weird stuff in Homer, but they could nonetheless or they could read Plato, people could read the Symposium and even though it had all this kind of dark stuff, they could see that there were still glimmers shining through it. You know, without having to accepting this as just being an example more lesson about this or that."}
{"episode_id":"SW - #305 - 2023-09-15 - Richard Rohlin - How to Read Like a Medieval Person","start":3264.14,"end":3293.26,"speaker":"Richard Rohlin","text":"That's. That's beautifully put. Yeah. This is, this is like. This is the big thing that we gotta get people to sort of understand because even then actually something that's sort of come up recently now I'm off the reservation, I'm off my notes. But is. Is the way that the way that somebody could read and be offended by like a saint story, Like a work of how geography. Right. There's like weird sometimes shocking stuff to modern sensibilities in the saints lives. If you don't think that then you just haven't read enough of them."}
{"episode_id":"SW - #305 - 2023-09-15 - Richard Rohlin - How to Read Like a Medieval Person","start":3293.5,"end":3294.06,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #305 - 2023-09-15 - Richard Rohlin - How to Read Like a Medieval Person","start":3294.46,"end":3571.09,"speaker":"Richard Rohlin","text":"And so this sort of like, we had this kind of idea of here's what, like a, like a clean, polite, well behaved, right, Christian person is supposed to look like. And it's basically the product of. Basically it's like the 1950s, right? You know, like, like it's, it's like at least in this country, we have like 1950s America in our head, right? You know, that's the, that's, that's our golden era. So that's where we go back to. And we're like, you know, the lawn's got to be neatly trimmed and you know, you know, all that stuff. And man, it's, it's, you know, it just. The, the tradition is so much weirder than that. It's so much more dangerous than that, you know. And this is, you know, again, this is not to say, you know, I mean, nobody, nobody who knows me would think for a moment that I'm, you know, running down like the moral teachings of the Church or anything like that. No, and nothing like that. But, but to say that that actually, if you, if you go and look at actually what the tradition is, you know, in literature, in the Church, in our hagiography, in the scriptures, all these things, if you look at what it is, it's, it's not that. It's not that just sort of clean. It's not that just sort of like clean. You know, the lawn is perfectly cut and, and you've got the two kids, one boy and one girl, and like just that whole like sort of black and white image of here's what perfect life, you know, is supposed to be. If you're a good person. You go to church on Sundays and this is where fairy tales really fit into things. But they would have read those stories and they would have read. But they would have also read Homer and they would have also read even like the North Smiths, right? There's some great work that's been written. We're going to talk about it some in the Beowulf class people, there's some great stuff that's written about how Christians, when they, you know, the Scandinavian and Germanic Christians, when they converted, they were able to look at things like Yggdrasil, the Tree of life, right? The world tree, right? And then to sort of see it as the cross, right? And, and then, and then develop a really beautiful poetic tradition around the cross, which is actually deeply consonant with the Byzantine poetic tradition around the cross. So we'll talk about some of those things in the Beowulf class. But just to move on real quick, because I know we're like way over the normal time for these kinds of things. The third thing that you need to understand, and again, this is something that you have been trying to tell people, and I think effectively telling people for years, is that heaven is above and hell is beneath. The medieval vision of the cosmos is not geocentric, right? That is the world at the center. It is rather the Earth at the bottom, right? And so you, you get this very clearly in Dante where you've got the, the, the, the outer heaven, the empyrean, right? Where God dwells, right? The divine rose, the beauty of everything, sort of like, bout like reality bounces back in on itself like a mirror image. And it's God at the center and everything around him, right? But then you have these various tiers, the various, you know, different heavens, right? These different heavens. The heaven of the fixed stars and Saturn and Jove or Jupiter and Mars and Sol, the sun and Venus and Mercury and the moon and then beneath the moon. And basically in the Middle Ages, the really important barrier is the barrier of the moon, right? Things beneath the moon can change. It's the world of time. It's the world where repentance is possible, but it's also the world where things die and decay. Beyond the moon is things are fixed and things move in kind of perfect order, right? And so in, in Dante's Divine Comedy, when Lucifer, when the devil is cast out of heaven, he's cast down to Earth. Why is he cast down to Earth and not some other place? Which would actually be a perfectly good question to ask if you had like a Copernican model of the universe, right? Why not? Why, why Earth? Well, it's very simple answer. And in, in the, the bottom. It's the bottom. It's as far down as you can go. So Lucifer is cast down to Earth and when he lands, his body makes a pit because basically the Earth hates him and is trying to get out of his way, right? So he lands and everything is like sort of thrown up and the dirt is thrown up on the other side of the planet. That becomes the mount of Purgatory. And then Satan eventually lands at the center of the Earth. Why at the center of the Earth? Because in this, you could say, like geography, this is as far away as you can get from God."}
{"episode_id":"SW - #305 - 2023-09-15 - Richard Rohlin - How to Read Like a Medieval Person","start":3571.09,"end":3572.09,"speaker":"Jonathan Pageau","text":"That's the lowest point."}
{"episode_id":"SW - #305 - 2023-09-15 - Richard Rohlin - How to Read Like a Medieval Person","start":3572.09,"end":3611.91,"speaker":"Richard Rohlin","text":"Yeah, the lowest point. So man did, medieval man did not see himself as standing at the center of the universe. He saw himself as standing at the bottom of a great stairway looking up towards God. And of course, the the, the. The. The. The medieval, medieval man understood the entire human life as the soul's longing, a desire to return to God who had made it. Right? And so it's really easy to remember this if we remember two things. One is that in the Middle ages, nobody believed the world was flat. It wasn't like people all thought the world was flat until Christopher Columbus or whoever sailed around it and proved, you know, like, oh, my gosh, are there."}
{"episode_id":"SW - #305 - 2023-09-15 - Richard Rohlin - How to Read Like a Medieval Person","start":3611.91,"end":3613.83,"speaker":"Jonathan Pageau","text":"Really still people that think that I."}
{"episode_id":"SW - #305 - 2023-09-15 - Richard Rohlin - How to Read Like a Medieval Person","start":3614.07,"end":3656.91,"speaker":"Richard Rohlin","text":"I still run into it. People are like, oh, Columbus proved the world was round. And I'm like, no, he didn't. The Greeks proved the world was round. And they did it with math and they did it, you know, 4,000 years ago. And anyway. But then also, the other thing is, the other thing is, and here's my little Ender's game reference for Ender's game fans out there. Like, we just have to remember the enemy's gate is down. That is, that is, you know, hell is down, right? The center of the earth, right? And so in the medieval cosmology, there's no such thing as outer space. Doesn't exist. Not to say they didn't know that there were stars, planets, comets, supernova, etc. But there's no such thing as outer space. This vast empty blackness where everything is just sort of arbitrary and Neil DeGrasse Tyson Y just kind of floating out there, right?"}
{"episode_id":"SW - #305 - 2023-09-15 - Richard Rohlin - How to Read Like a Medieval Person","start":3657.47,"end":3716.74,"speaker":"Laura Diaz","text":"Tucson, the weight is over. Medi weight loss. They're officially open on North Oracle road. That's right. No more counting down the days. You can walk in right now and start your journey to a healthier you. Hey, it's Laura Diaz from iheartradio and you can trust me. This isn't just another weight loss clinic. I know that because it's where I lost weight safely with real medical support. GLP1 medications. You can see them everywhere online right now. But the truth is, your health shouldn't be a DIY project ordering these meds without the professional guidance. It can lead to dangerous mistakes, wrong doses, no oversight, and serious risks. At mediweightloss, I got the same medication, but with a customized plan, weekly check ins, and a licensed physician guiding me every step of the way. And the cost? The same as those risky online options. Tucson, your moment is here. If you're ready to take control, feel better, and lose weight the right way, mediweight loss is ready for you. Walk in, get started and see real results. Call or visit mediweightloss.com to learn more and book your free consultation today."}
{"episode_id":"SW - #305 - 2023-09-15 - Richard Rohlin - How to Read Like a Medieval Person","start":3716.82,"end":3785.65,"speaker":"Announcer","text":"That's mediweightloss.com looking for your next go to smoke shop. Stop scrolling. I've got you. Headshop.com is the number one online smoke shop, already trusted by over 100,000 happy smokers just like you. They've got it all. Dab rigs, vaporizers, glass bongs, smoking pipes, even THCA flower all in one place. Need a new daily driver? Grab a smooth glass bong or a classic smoking pipe. More of a concentrate fan. Their dab rigs, E rigs and wax accessories are designed for smoother, harder hitting sessions. And yes, they've even got legal THC flower. Best part, every order ships fast and discreet, which is why thousands of smokers keep coming back. So don't waste time hopping between shops. Shop the best in dab rigs, vaporizers, glass bongs, smoking pipes and THC8 flower. Right now at headshop.com the number one online smoke shop, headshot.com has what you need. Check it out today. Oh, and because you're listening right now, you get 10% off your next order when you use the coupon code HSHOP at checkout. Go to headshop.com now and smoke smarter."}
{"episode_id":"SW - #305 - 2023-09-15 - Richard Rohlin - How to Read Like a Medieval Person","start":3787.96,"end":3838.04,"speaker":"Jonathan Pageau","text":"I actually have a theory about that, is that when we switch to the Copernican model, outer space becomes the limits of the earth. It actually flips, it inverts weirdly. And, and everything that used to happen on the edge of the, of the world is now projected into outer space. If you watch that movie gravity, it's really actually wonderful. Like in terms of that cosmic sense, it represents outer space as this like place of death and strangeness that is outside the bound world. And, and, and basically like it's, it's related to going into the water. That's why at the end of the movie, she's in this, in this thing and she encounters St. Christopher and she encounters like this like weird place where she doesn't understand Chinese. And then finally she dives into the bottom of the water and comes out like resurrection. It's like that's a real good understanding of what outer space is really."}
{"episode_id":"SW - #305 - 2023-09-15 - Richard Rohlin - How to Read Like a Medieval Person","start":3838.04,"end":3867.39,"speaker":"Richard Rohlin","text":"Yeah, the, the, you know, the one of the other, you know, really strong ancient images including for like the Germanic peoples. We're going to talk about this in the Beowulf class. The way that they, they, they saw the world as, you know, as, as Midden Yard, right? The, the middle Earth surrounded by the encircling sea, right? And where the sea is like this is the abyss. This is the thing. You can't, like God is Over there on the other side somewhere. Right. That's basically what space became for us when that switch happened."}
{"episode_id":"SW - #305 - 2023-09-15 - Richard Rohlin - How to Read Like a Medieval Person","start":3867.39,"end":3868.03,"speaker":"Jonathan Pageau","text":"Yeah, exactly."}
{"episode_id":"SW - #305 - 2023-09-15 - Richard Rohlin - How to Read Like a Medieval Person","start":3868.03,"end":4228.46,"speaker":"Richard Rohlin","text":"Yeah. Yep. So in this conception of the world, the world moves and is moved by love. Right. Dante, again, has this wonderful phrase at the very end of the Comedy, referring to God as the love that moves the sun and the other stars. So in. In the discarded image, C.S. lewis makes a really great point about this. He says that in the modern world, we conceive of a universe governed by laws. Right. We have the law of universal gravitation, the law of conservation of energy, the second of thermodynamics. Right. And one of the things that basically post modernity does is it starts to break down this vision of the universe, even. Even at the level of, like, quantum physics, which, again, this is all stuff you've talked about, but it. It breaks down this. This idea of a world that's, like, totally governed and kind of predictable and determinable. Governed by laws. And now we're actually saying perception is part of the. You know, actually affects, you know, reality on a quantum level, you know, whatever that means. Right. But it's got no compelling alternative with which reality could be unified. And in the Middle Ages, they understood the world as being held together and moved by love, which you could say is. Is. Is held. And a world that's actually held and moved together by attention. Yeah, Right. And so Jeffrey Chaucer in his poem the House of Fame, which is not one of the Chaucer stories that you read in high school. I don't know why. You know, I guess it's because the teenagers. We figure teenagers can handle, like the body humor of. Of the Canterbury Tales, and maybe that'll be more fun for them. But in the House of Fame, which. Which, among other things, involves this. This man sort of ascending up through the spheres, right. It's being. You know, he's asking questions about how the medieval universe works the way it does. And he's told that every. I'll just quote from it here. Every kindly thing. Kindly as in the sense of according to its kind, not as in the sense of nice. So every. Everything according to his kind. Every kindly thing that is hath a kindly stead, that is a home there. Hey. He may best in it conserved be Unto which place everything through his kindly inclining moveth for to come to. So things move in the universe, things move in the cosmos by. By this process of basically everything trying to get back to where it belongs. So why does water sit on top of the Earth? Because water belongs here and the earth belongs here. If I drop the stone in water, why will it go down? Newton was not the first person to notice that apples fall from trees or whatever. Right. You know, and be like, gosh, no one's ever noticed this before, you know, but the explanation that they would have given it was the apple falls because it's made of earth and it's trying to get back to where it came from. And of course, Lewis. I'll give another Lewis quote. He says we could ask the medieval scientists. This is silly. Why are you talking this way? Do you really think that a rock really loves the earth, like, whatever? And he would. We could retort, or he could retort with a counter question. But do you intend your language about laws and obedience any more literally than I intend mine about kindly inclining? In other words, is there like a cosmic traffic court where if you disobey the law of gravity, like, you get a ticket? Like, how is. How does this work? How does this work? But what Lewis says is that on the imaginative and emotional level, it makes a great difference whether we, with the medievals, we project upon the universe our strivings and desires, or with the moderns, our police system and our traffic regulations. Like, what do you want to live in a cosmic police state, which has even affected the ways that we think about Christianity. Like the reduction of Christianity to basically just moralism. Yeah, I mean, I've talked about this elsewhere, but I grew up in this, you know, fundamentalist group or sect that, among other things, believe that the Bible is a set of laws, set of principles is what they called them, and if you live by these things, then your life will go well, and that they're as immutable and as provable as, like, the law of gravity. I mean, they would have said that. Right. And so do we want to live in a. In a world, in a. In a cosmos that's governed by love, or in one that's essentially a police state? All right, so the last thing I want to talk about is space and time. So I'm going to read here a quote from Zygmunt Bauman's Liquid Modernity, which is an incredible book if people haven't read it, by liquid. Zygmunt Bauman means that it is. Modernity can't hold a shape, it can't hold form. So he says that modernity starts when space and time are separated from living practice and from each other, and so become ready to be theorized as distinct and mutually independent categories of strategy and action. When they cease to be as they used to be in long pre modern centuries. The intertwined and so barely distinguishable aspects of the living experience, locked in a stable and apparently invulnerable one to one correspondence. When I read this paragraph, I was just like, oh, it's Matthieu's book. And it's like everything Jonathan has been saying for years and it's like. But somebody else, somebody else is saying it. So modernity basically is the separation of space and time. It's becoming two sort of separate things. Right. And I think that you can tell me what you think about this, because I'm still kind of noodling on this idea, but I think that post modernity could be understood as a further corruption of this, that once space and time are measured, separated, categorized, they eventually cease to have any meaning at all. And then we deconstruct them in order to kind of show how absurd they are. Right. I think about this a lot when I'm driving around in my car because, like, it's the most absurd sort of separation of space and time. The fact that I can be somewhere, you know, 100 miles away. I can be there in an hour and a half."}
{"episode_id":"SW - #305 - 2023-09-15 - Richard Rohlin - How to Read Like a Medieval Person","start":4228.86,"end":4240.7,"speaker":"Jonathan Pageau","text":"Yeah, well, for sure, the, the technology has made this problem excessively great in the same way that in your car you have that experience. We have the experience now. Like, look at what we're doing right now."}
{"episode_id":"SW - #305 - 2023-09-15 - Richard Rohlin - How to Read Like a Medieval Person","start":4240.78,"end":4241.66,"speaker":"Richard Rohlin","text":"Right? Yes. Right."}
{"episode_id":"SW - #305 - 2023-09-15 - Richard Rohlin - How to Read Like a Medieval Person","start":4242.57,"end":4242.89,"speaker":"Jonathan Pageau","text":"Yes."}
{"episode_id":"SW - #305 - 2023-09-15 - Richard Rohlin - How to Read Like a Medieval Person","start":4243.05,"end":4243.53,"speaker":"Richard Rohlin","text":"Yeah."}
{"episode_id":"SW - #305 - 2023-09-15 - Richard Rohlin - How to Read Like a Medieval Person","start":4243.85,"end":4251.61,"speaker":"Jonathan Pageau","text":"There's nothing more like break. Nothing would breaks. This sense of space is this zoom conversation, you know?"}
{"episode_id":"SW - #305 - 2023-09-15 - Richard Rohlin - How to Read Like a Medieval Person","start":4251.69,"end":4275.27,"speaker":"Richard Rohlin","text":"Yeah, that's a good point. I think that. I think that deconstruction is at its heart. It's a reaction to this absurdity. And it's like a. It's like an immune response. I mean, I mean, this is. I did not intend today to be the day that I explained why the metric system was invented by demons. But the, the. But, but, but, but. As you know, here in America, we stubbornly refuse to use."}
{"episode_id":"SW - #305 - 2023-09-15 - Richard Rohlin - How to Read Like a Medieval Person","start":4275.43,"end":4277.67,"speaker":"Jonathan Pageau","text":"It's impressive how you do it. I don't know."}
{"episode_id":"SW - #305 - 2023-09-15 - Richard Rohlin - How to Read Like a Medieval Person","start":4280.39,"end":4322.36,"speaker":"Richard Rohlin","text":"I'll measure things in universal standard giraffes before I use the metric system. Like, like, oh, that's three giraffes long. Like, I'll, I'll go there before I, before I succumb to the use of the metric system. But, I mean, the. But if you think about the metric system, basically the idea is, hey, let's measure the earth at a certain point that we've arbitrarily determined. Let's measure everything. Yeah. And then divide it up into regular sections and that's going to be our base unit of measurement from now on. And it used to be like a certain piece of metal that they had to keep at a certain temperature because actually if you get it out in the real world, it'll stop being that precise length. And now I think they use like lasers or something. But anyway, the point, it's really important."}
{"episode_id":"SW - #305 - 2023-09-15 - Richard Rohlin - How to Read Like a Medieval Person","start":4322.36,"end":4334.32,"speaker":"Jonathan Pageau","text":"What you're saying because this is, you know, the, the, the, the, the traditional way of measuring which is clunky and it's difficult is nonetheless based on human experience."}
{"episode_id":"SW - #305 - 2023-09-15 - Richard Rohlin - How to Read Like a Medieval Person","start":4335.68,"end":4338.48,"speaker":"Richard Rohlin","text":"It's clunky and difficult, but it's also easy and intuitive."}
{"episode_id":"SW - #305 - 2023-09-15 - Richard Rohlin - How to Read Like a Medieval Person","start":4338.72,"end":4339.2,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #305 - 2023-09-15 - Richard Rohlin - How to Read Like a Medieval Person","start":4339.2,"end":4380.85,"speaker":"Richard Rohlin","text":"Right. At a very base level to say how many feet is this? Well, I've got a foot I can check. Right. And, and most of the time that's going to be good enough for most, most applications. Right. An inch. Right. Well, I've got a thumb. Right. A cubit, I've got an arm, you know, but, but even like measurements of time, like, like so many people have tried to monkey with the way that we measure time and it's like, like we'll, we'll let you do the metric system with space, but when, like, no, when they tried to introduce like the 10 day week, you just can't do it. You just can't do it. Like everybody has a seven day week. Like it's, it's completely, you know, it's one of the most immutable things about the human experience. Yeah."}
{"episode_id":"SW - #305 - 2023-09-15 - Richard Rohlin - How to Read Like a Medieval Person","start":4380.85,"end":4394.77,"speaker":"Jonathan Pageau","text":"And I mean just separating time into four quadrants of sun and dark, like light and darkness and sun and moon. Even though in, in, in the, the, let's say over the variation, it changes, it's like you just can't change. You just can't change that."}
{"episode_id":"SW - #305 - 2023-09-15 - Richard Rohlin - How to Read Like a Medieval Person","start":4395.17,"end":4465.09,"speaker":"Richard Rohlin","text":"Right? Yes, it's. Yeah. So it's this. But this is, this is the, the kind of ways that you, this the sort of idea that if we sort of measure and quantify everything. Yeah. Right. Then we, we can control it and then everything is certain. Right. This, this basic idea, what it, what it does is it separates time from space. Right. Because it separates space from any kind of experience of that space in a way that, you know, human beings would, would use it. So what Father, Father Silvio Bunta and his, this is in from his, his commentary on the Eraticon, which is like for people, it's like the priest book from the Simonos Petro monastery on Mount Athos. He says that, he talks about how the orthodox tradition, we have two different words for time. We have Kronos, you know, whence Chronology, right. This is what Father Alexander Schmemann called death. In other words, it's the. It's the experience of time and decay, right? The linear passage of moments. And then we have kairos. And kairos is this, this, this. It's the eternal moment, right?"}
{"episode_id":"SW - #305 - 2023-09-15 - Richard Rohlin - How to Read Like a Medieval Person","start":4465.09,"end":4467.89,"speaker":"Jonathan Pageau","text":"Yeah, it's qualified. It's qualified time. It's like."}
{"episode_id":"SW - #305 - 2023-09-15 - Richard Rohlin - How to Read Like a Medieval Person","start":4467.89,"end":4518.11,"speaker":"Richard Rohlin","text":"Yeah, qualified time is a good. Yeah. So Charles Taylor, in a secular age, he describes chirotic time as how something that happened 2000 years ago can become closer to you than something that happened yesterday. So, like, if you go to Orthodox Pasca, right, Which even if you're not Orthodox, like, it's not even close to your Easter this year, so, like, you have no excuse. Go, go, go find an Orthodox church. Like, go. What? That's like, when you go to Orthodox Pasca, you are experiencing the resurrection as an event that is closer to you today than the moon landing or the assassination of JFK or, you know, the, the, you know, hit, you know, the, the 2016 election or something like that. I don't know why I couldn't pick a non controversial historical event, but just."}
{"episode_id":"SW - #305 - 2023-09-15 - Richard Rohlin - How to Read Like a Medieval Person","start":4518.11,"end":4519.51,"speaker":"Jonathan Pageau","text":"They just piled them up there."}
{"episode_id":"SW - #305 - 2023-09-15 - Richard Rohlin - How to Read Like a Medieval Person","start":4519.99,"end":4521.19,"speaker":"Richard Rohlin","text":"My mind wouldn't do it."}
{"episode_id":"SW - #305 - 2023-09-15 - Richard Rohlin - How to Read Like a Medieval Person","start":4521.27,"end":4521.75,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #305 - 2023-09-15 - Richard Rohlin - How to Read Like a Medieval Person","start":4522.58,"end":4548.82,"speaker":"Richard Rohlin","text":"Okay, so chronological time is the time of this world. Right. But the chirotic time, the kairos, this is a time that knows no chronology. But we have the same thing actually with space as well, which I think is not as well known. In the Orthodox tradition. We have two words for space. There is Korah, which means like normal space, like any old space, and then topos. Right, which means like a particular place."}
{"episode_id":"SW - #305 - 2023-09-15 - Richard Rohlin - How to Read Like a Medieval Person","start":4549.36,"end":4552.88,"speaker":"Jonathan Pageau","text":"Yeah, like that's qualified space too. It's like, it's like that. It's like this."}
{"episode_id":"SW - #305 - 2023-09-15 - Richard Rohlin - How to Read Like a Medieval Person","start":4553.12,"end":4554.16,"speaker":"Richard Rohlin","text":"This. Yes."}
{"episode_id":"SW - #305 - 2023-09-15 - Richard Rohlin - How to Read Like a Medieval Person","start":4554.32,"end":4556.88,"speaker":"Jonathan Pageau","text":"There's a hierarchy to its. To its existence."}
{"episode_id":"SW - #305 - 2023-09-15 - Richard Rohlin - How to Read Like a Medieval Person","start":4557.2,"end":4720.23,"speaker":"Richard Rohlin","text":"So in the liturgy, Kronos becomes kairos and space becomes place. Right. And all of these things are kind of caught up into that eternal moment. And to give like an example of this. So this is all by. By way of saying not only is the metric system demonic, but cause and effect is made up. In the Middle Ages, people did not see history. And again, you could read some of Vladaloskin's essays about this, and he's even got a whole section on it in a history of the island, if people are curious about this. But in the Middle Ages, people didn't see history as a series of cause and effects, causes and effects. They saw history as a battle between good and evil, which means that the most important thing in history has already happened, because that was the crucifixion and the resurrection of Jesus Christ. Yeah, right. But history is this battle between good and evil. This is what the whole Apocalypse of St. John is about, is history seen as this conflict between good and evil in which good ultimately triumphs. But because we see history in this way, if we, you know, if, if I slap Jonathan, or let's say I insult Jonathan, I say something really mean about your mother, right, and then you slap me, right? We could say, well, there's a cause, which is. I said something insulting and in effect, which is you slap me. But in the Middle Ages, they wouldn't have understood it this way. They would have understood it as I sinned against the image of God in you or your mother, and that God through your hand, punished me. Right? That's the, that's the sort of difference. There's a. We see sort of history as being this flat two dimensional thing, but they, they would have seen God as constantly, always intervening in history. And where this becomes really important is when you understand something like the Annunciation. So if you only have this understanding of chronological time in which everything must proceed through a course, a series of ordinary cause and effects, something Lewis really struggled with when he was writing Miracles, and he actually kind of had to go back and revise quite a bit of it after a conversation with a Roman Catholic philosopher on the subject. Okay, but if you see history as just being the series of sort of normal causes and effects, then Mary is an ordinary Jewish girl, one whose life must have gone on in the usual way. Marriage, childbirth, family life, old age, death, as part of. A. Part of a normal succession of cause and effect. And so you'll have conversations with somebody who, talking about something like the entrance of the Theotokos into the Temple, which is an event that we celebrate in, you know, that most traditional, all, all traditional Christians celebrate, and most Christians around the world celebrate as a feast in the church. But then you'll have a modern person come along and say, well, that's not. They never let women into the temple, so that couldn't have happened. Well, listen, brother, nobody's saying that this is a normal thing that happened. It's not the point."}
{"episode_id":"SW - #305 - 2023-09-15 - Richard Rohlin - How to Read Like a Medieval Person","start":4720.23,"end":4723.63,"speaker":"Jonathan Pageau","text":"Why? It's a miracle. Yeah, it's special that we're talking about it."}
{"episode_id":"SW - #305 - 2023-09-15 - Richard Rohlin - How to Read Like a Medieval Person","start":4723.63,"end":4822.8,"speaker":"Richard Rohlin","text":"Right. And so if, but if you see time is only in this way, then the Enunciation and the Incarnation become like a blip or an interruption into the ordinary passage of things, which is otherwise just part of the linear progress of humanity. But if you view it as, as happening in chirotic Time, it's happening in kairos, then all of the righteous actually from across human history, Adam, Seth, Noah, Abraham, David. Right. Sort of narrow into a point so that by the time that the word is incarnated in the womb of the most holy virgin, there's basically just the one righteous family left in Israel. Right. And. But it's all from a Chronos standpoint, that's terrible because look, you know, by a number standpoint, bad guys are winning. Right. But actually from. In terms of kairos, no, it's. Everything is distilling, everything's condensing down to a single point so that all of God's interventions on behalf of his people throughout history are actually rolled up into and made manifest in that moment. And this is why the. The Magnificat, which is one of the oldest Christian hymns, a lot of historians think that it was already being sung in church before the old, before the gospel according to St. Luke was actually written. Right. It's one of the oldest Christian hymns. This is why the Magnificat, if you look at it, it's really like a bringing together of every song of a victorious righteous woman from the Old Testament. So you can look at Deborah's song and Miriam's song of the sea and the song of the righteous, Hannah, and like, like all of their prayers. Right. You know, as the. As the weaker person praying for deliverance. Right. All of that stuff is kind of rolled up into that single prayer that. That she prays."}
{"episode_id":"SW - #305 - 2023-09-15 - Richard Rohlin - How to Read Like a Medieval Person","start":4822.88,"end":4882.09,"speaker":"Laura Diaz","text":"Tucson, the weight is over. Medi weight loss. They're officially open on North Oracle Road. That's right. No more counting down the days. You can walk in right now and start your journey to a healthier you. Hey, it's Laura Diaz from iHeartRadio. And you can trust me. This isn't just another weight loss clinic. I know that because it's where I lost weight safely with real medical support. GLP1 medications. You can see them everywhere online right now. But the truth is, your health shouldn't be a DIY project ordering these meds without the professional guidance. It can lead to dangerous mistakes, wrong doses, no oversight, and serious risks. At mediweightloss, I got the same medication, but with a customized plan, weekly check ins, and a licensed physician guiding me every step of the way. And the cost? The same as those risky online options. Tucson, your moment is here. If you're ready to take control, feel better, and lose weight the right way, mediweight loss is ready for you. Walk in, get started and see real results. Call or visit mediweightloss.com to learn more and book your free consultation today."}
{"episode_id":"SW - #305 - 2023-09-15 - Richard Rohlin - How to Read Like a Medieval Person","start":4882.17,"end":4892.97,"speaker":"Richard Rohlin","text":"That's mediweightloss.com and so this is where we get to this idea that I think would be like the fifth and final or the fourth and final idea. Go ahead."}
{"episode_id":"SW - #305 - 2023-09-15 - Richard Rohlin - How to Read Like a Medieval Person","start":4893.05,"end":4936.22,"speaker":"Jonathan Pageau","text":"Just help people see. What Richard is alluding to is in some ways there's a manner in which you can understand the, let's say, the, the enunciation of Mary as the cause of all the other ones that came before In, in, in. In. In a sense of meaning. Right. It's like that's what, that's what Richard is trying to allude to. And that's why when we talk about. It's like that which makes all those other things worthy of interest and important to notice and strings them together and makes them something is, is, Is actually something that happens after the event. And that is, you know, and, and that's why in some ways, like Christians have an eschatological vision of reality."}
{"episode_id":"SW - #305 - 2023-09-15 - Richard Rohlin - How to Read Like a Medieval Person","start":4936.22,"end":4936.58,"speaker":"Richard Rohlin","text":"Yeah."}
{"episode_id":"SW - #305 - 2023-09-15 - Richard Rohlin - How to Read Like a Medieval Person","start":4936.58,"end":5050.11,"speaker":"Jonathan Pageau","text":"Which is also that that which will happen in the future, like the, the, the, the eschaton that's coming over the hill that never quite happens, is going to make sense of everything and will show us and will reveal to us what the cause of everything was in the first place. And there's a collapse between the end and the beginning when some ways the end becomes the beginning and the end are brought into the person of Christ as this glorious figure that is both the one that comes at the end but then revealed to be the one that created is the lamb of God that was sacrificed before the foundation of the world, although that happened at the crucifixion. That might sound like a weird, a weird way of thinking, but it actually is something that we experience all, all the time, that we experience in our lives all the time, which is that. That the fact that we remember things in our past as being important is usually based on things that are happening to you now and that things that are culminating for you now. It's like, oh, the reason why I liked to, I like to, to, to play this game when I was young is because, oh, it turns out I'm going to become a doctor or whatever. And we kind of. And it's weird because the postmoderns, this is something that they understood. Leo Tao wrote this little book called Postmodernism Explained to Children. And that was his definition of postmodernism. Postmodernism was basically reinterpretation of the past based on the present. But again, what the postmoderns got Wrong is that they saw it as an arbitrary exercise in power ultimately, which is that there's a way in which power can now reinterpret the past and make it align with their present vision. And they didn't have a sense in which none of this is. Is actually arbitrary. And ultimately all of this is. Is playing in. In cosmic patterns that are. That are true, that are just simply true and are playing out in. In. In creation."}
{"episode_id":"SW - #305 - 2023-09-15 - Richard Rohlin - How to Read Like a Medieval Person","start":5050.43,"end":5069.68,"speaker":"Richard Rohlin","text":"You could say that postmodernism is sort of a failure of eschatology, right? You don't have the capacity for an eschatological vision. You just. You sort of like, you're reacting against the separation of space and time, but you still. You still accept the. The chronos, the fact that things are just going to keep going, right? Yeah."}
{"episode_id":"SW - #305 - 2023-09-15 - Richard Rohlin - How to Read Like a Medieval Person","start":5069.68,"end":5105.22,"speaker":"Jonathan Pageau","text":"Well, Jacques Derrida had this idea. He called it open eschatology. And it's an interesting idea because he understood in some ways that the future is coming towards us and interpreting the past. But he didn't want, like, he was like, no, it's not about saying come, Lord Jesus. He would just say come. Like just basically this desire to see the future roll on us. But, but, you know, it's like that the world actually does go through. Does, actually. Does actually manifest in patterns, I'm sorry to tell you. And so, so it's not, it's not arbitrary at all what's coming over the hill."}
{"episode_id":"SW - #305 - 2023-09-15 - Richard Rohlin - How to Read Like a Medieval Person","start":5105.7,"end":5172.33,"speaker":"Richard Rohlin","text":"Yes. Yes. So this, this kind of brings us to like, the final thing that I want to say, which is that the goal of this kind of reading and the goal of, again, my whole goal, I mean, it's really. It was like when we sat down and we first started talking about doing the Universal History series, it was kind of like, how do we get people to take this stuff serious? Right? It's this, this idea that. That through these stories and through sort of helping people understand these patterns through stories, right? To help them have a relationship with the cosmos that is, you could say, like a mystagogical vision of the cosmos, right? The mystagogy being the relationship between, you could say, the earthly temple and the heavenly temple, right? And. And actually in Judaism and in traditional Christianity, those are actually the same thing. There's no distinction between them. And so this, this, this is a vision of a cosmos in which we see that the relationship between the seen and the unseen is. Is real. It's not just merely symbolic. It is symbolic, but it's not merely symbolic in the way that, you know."}
{"episode_id":"SW - #305 - 2023-09-15 - Richard Rohlin - How to Read Like a Medieval Person","start":5173.13,"end":5176.89,"speaker":"Jonathan Pageau","text":"It'S not metaphorical or allegorical in a way that makes it arbitrary."}
{"episode_id":"SW - #305 - 2023-09-15 - Richard Rohlin - How to Read Like a Medieval Person","start":5176.89,"end":5355.51,"speaker":"Richard Rohlin","text":"Right, yeah. And that's the next thing. It's just. It's not arbitrary. We can't say this enough. Right. The patterns by which. The example you've used sometimes. Right. Is that the patterns by which the cosmos is laid out aren't just things that we are making up any more than we see an arbitrary arrangement of pigments on a canvas and we decide that they're a Van Gogh painting. Right. But it's also apocalyptic. And this is what I think sometimes people miss a little bit in some of the conversations that I've seen happening in various circles around the Internet, talking about some of this stuff, that it's apocalyptic in the original sense of lifting up the veil. Lifting. Lifting of a veil. Right. That the nature of this relationship is constantly revealing itself in man, who is a microcosm of the universe. And then also, first and foremost in the liturgy. Right. So. And that's the final thing, is that this. This relationship between the seen and the unseen is liturgical, that the relationships between these things aren't static. They move, they dance, as in the liturgy. And I still remember the first time I ever went to a Divine Liturgy. And, you know, I. I'd done my homework, I'd read on things ahead of time, because that's how I am. And then I got there, and despite the fact that I had read, you know, description after description of what was going to happen in the Divine Liturgy, I'm there. And it's like this big, festal liturgy, and there's a bunch of clergy, and they're coming in at the altar, and they're going out of the altar and they're doing. I'm like, I have no idea what is happening, but I had this deep conviction in that moment that this is the shape of everything, right? And that, of course, for us, ultimately, the revelation of Jesus Christ, the God man who is himself, the total revelation of God and the total revelation of the human person. And that's the last thing, the last point is, if you're gonna understand the Scriptures, if you're going to understand the liturgy, if you're going to understand any work of pre modern literature, you have to see man as a microcosm, that is, as a little cosmos, right. That this vision of the world is not anthropocentric man at the center, but it is anthropocosmic. We are not just a collection of cells any more than a temple is a collection of bricks, or the liturgy is just a collection of arbitrary historical movements. That accreted over time. And this is again, by the way, there are certain, let's say, circles of conservatism that are currently trying to wage war against the madness of our, of our current age by reducing things. So I, I saw this headline a few weeks ago in, in like a conservative website about, about some transgendered person. Right. And so to say. But, and, and they said that every DNA of this person's, you know, biology is, is male. You know, and, but listen, folks, if we are reducing identity down to cellular level, down to DNA, right. We've actually already seeded the ground to materialism."}
{"episode_id":"SW - #305 - 2023-09-15 - Richard Rohlin - How to Read Like a Medieval Person","start":5355.59,"end":5363.51,"speaker":"Jonathan Pageau","text":"Yeah, right. Because that's why CS Lewis says it had this wonderful quote and I think it. I forget in which book of the."}
{"episode_id":"SW - #305 - 2023-09-15 - Richard Rohlin - How to Read Like a Medieval Person","start":5364.07,"end":5365.35,"speaker":"Richard Rohlin","text":"Voids of the Dawn Shredder."}
{"episode_id":"SW - #305 - 2023-09-15 - Richard Rohlin - How to Read Like a Medieval Person","start":5366.07,"end":5375.07,"speaker":"Jonathan Pageau","text":"No, I'm talking about in the Space trilogy. He says, he says gender is more primordial than sex. And it's like. And I quoted on Twitter and everybody."}
{"episode_id":"SW - #305 - 2023-09-15 - Richard Rohlin - How to Read Like a Medieval Person","start":5375.07,"end":5376.63,"speaker":"Richard Rohlin","text":"Was, I saw somebody was enraged."}
{"episode_id":"SW - #305 - 2023-09-15 - Richard Rohlin - How to Read Like a Medieval Person","start":5376.95,"end":5402.05,"speaker":"Jonathan Pageau","text":"You were like losing their mind and thinking that. I'm like agreeing with gender theory because they want to collapse gender and sex together, which is actually not a traditional thing at all. Gender and sex in traditional cultures has always been different, but the problem is that they're not free floating. Right, right. They are coherent and they are, they play different. They play the pattern of the same thing at different levels. And it just, it's hard for people to think that way, but that's just how it is."}
{"episode_id":"SW - #305 - 2023-09-15 - Richard Rohlin - How to Read Like a Medieval Person","start":5402.37,"end":5403.49,"speaker":"Richard Rohlin","text":"Boats are female."}
{"episode_id":"SW - #305 - 2023-09-15 - Richard Rohlin - How to Read Like a Medieval Person","start":5403.97,"end":5405.33,"speaker":"Jonathan Pageau","text":"That's right. What are you gonna."}
{"episode_id":"SW - #305 - 2023-09-15 - Richard Rohlin - How to Read Like a Medieval Person","start":5407.37,"end":5723.84,"speaker":"Richard Rohlin","text":"Yeah, boats are feminine. There's nothing you can do about it. Yeah. Another C.S. lewis quote. I thought that's where. This is where we're going to go. But to paraphrase something he says in the Voyage of the Dawn Treader, if you're talking about DNA, that's not what a man is, it's only what he's made of. Right? Yeah. So Archbishop Dimitri, who's our beloved founder of our diocese here in the oc, The Diocese of the south, he said that during the first millennium since Christ, the Church was occupied with the question, who is Christ? During the second, with what is the Church? Is when you have the schism, the Great schism, the Reformation and so on, and that the great question of the third millennium is going to be what is man? Right. But Archbishop Dimitri said that Jesus Christ is the answer. Right. He says that Jesus Christ is the truth about God and the truth about man, since he is both God and man. God's real nature is completely revealed in the Son of God. The Incarnate word. And the whole truth about man, his worth, his value and dignity are realized and made manifest to man in the Son of Man, Jesus of Nazareth. So this is the, the first thing that we have to really understand, to read and understand ancient medieval literature, liturgy, all of our scriptures. And we absolutely must understand if we are going to even start to talk about salvation. And what, what that means is that man is a microcosm. Just a couple of quotes to finish this up. Saint Macarius of Egypt said, the heart itself is only a small vessel, yet dragons are there, lions are there, there are poisonous beasts and all the treasures of evil. There are rough and uneven roads, there are precipices, but there too is God and the angels. Life is there, and the kingdom, there too is light, and there are the apostles and the heavenly cities and the treasuries of grace. All things lie within that little space. This is why actually, this is why in the orthodox spiritual tradition, we talk about going down into your heart, right? Like turning the eye of the heart inward upon itself. It's not an act of just like, self preoccupation, but it's actually because the entire world is there. And that's why, that's why you could have somebody who is a hermit who is actually upholding the whole world, right? Because by praying, and this is, say Siloan the Athenite once corrected somebody for, for saying, you know, Lord Jesus Christ, Son of God, have mercy on me and on the whole world. So don't, don't pray that way. Just say, have mercy on me the sinner. Because if you do that, then you're praying for the whole world, right? That's really. You can't ask God for anything more than that. The way that Saint Maximus the Confessor phrases this is, he says that the church building, that the temple, but he means like the building, the physical building is a human being and every human being is a church. And then he actually says, and the cosmos is a human being, and every human being is a cosmos, and the scriptures are a human being, right? And every human being is a scripture, right? And from there, there's a lot that we could say about his mystagogical vision, which I think we're just like way over time, so I'm not going to do that. But if you sort of like take these, these five things, right, Then you can use them to sort of understand when you come to liturgy or when you come to an ancient text like Beowulf, and we'll talk about this in the class when you come to even something like the Scriptures and you come across something that's, like, offensive to your modern sensibilities, come into the church and you see there's this big wall between you and the altar, right? Why is that there? Like, are you trying to keep me from God? What's going on? Like, I thought the curtain of the temple was. Was torn in two, you know, And. And, you know, to that, we would just say it was. And. And when do you show that in your liturgy? Because if you wait here in a minute, you'll see it, you know? But if. If you come across these. If you come across something that's so offensive to modern sensibilities, like monasticism, like the relationship between the. The active and the contemplative life, you know, why can't, you know, I'm a visitor to your church. Why won't you let me back in the altar area? You know, things like that. And these are all real questions, by the way, that, that I've. I've tried to answer and had to answer for catechumens and inquirers in my own parish, Right? But if we can understand. If we can understand that the world is laid out in this way, we can understand the human body as first and foremost a temple of the Holy Spirit, right? If that's our beginning point, then we can go from there to address, not just be the good kind of tourist, but also, as Christians address the passions and the pathologies of our day. So this is kind of my elevator pitch, my really, really long elevator ride pitch for. If you can kind of shift the way that you're thinking about these different things, then, okay, you won't. I can't make you into, like, a native of the Middle Ages, although maybe it's more possible than some people think. But I can't. I can't. I can't make you into a native of the Middle Ages. But what you could do is to become the good kind of tourist who, when you come to these things and when you come to these services, Right? And I'm really big about. Don't just read about this stuff. You got to go to church, guys. When you come, when you encounter these things, instead of this being weird or foreign or Eastern, you can start to see actually what's going on there underneath the surface. So, anyway, I'm gonna stop repeating myself now."}
{"episode_id":"SW - #305 - 2023-09-15 - Richard Rohlin - How to Read Like a Medieval Person","start":5723.84,"end":5737.86,"speaker":"Jonathan Pageau","text":"All right, Richard, thanks. This is great. And people, yeah, go sign up for the. For. For bailiff. I really can't wait. It's going to be. It's going to be a lot of fun. And we're also, we're going to figure out a way for people to be able to ask questions, to participate where."}
{"episode_id":"SW - #305 - 2023-09-15 - Richard Rohlin - How to Read Like a Medieval Person","start":5737.86,"end":5772.82,"speaker":"Richard Rohlin","text":"Yeah, it would be like a moderated. Yeah, moderated, interactive discussion and a bunch of really cool stuff. I'm excited about it because there are things that I can say to the Symbolic World crew about Beowulf that I probably couldn't say in a more academic setting. You know, people just wouldn't know how to receive it or accept it. But you guys have been coming along with Jonathan on this journey for so many years and, and also with me. Like, I, I, we've been doing universal history for more than two years now. Like, that's insane. So the groundwork has been, you know, been laid, so we should be able to just kind of get right into it. So I'm excited about it and I look forward to seeing everybody in September."}
{"episode_id":"SW - #305 - 2023-09-15 - Richard Rohlin - How to Read Like a Medieval Person","start":5772.82,"end":5774.46,"speaker":"Jonathan Pageau","text":"All right, everybody, we'll talk to you soon."}
{"episode_id":"SW - #305 - 2023-09-15 - Richard Rohlin - How to Read Like a Medieval Person","start":5774.78,"end":5775.38,"speaker":"Richard Rohlin","text":"Bye. Bye."}
{"episode_id":"SW - #305 - 2023-09-15 - Richard Rohlin - How to Read Like a Medieval Person","start":5775.38,"end":5790.3,"speaker":"Jonathan Pageau","text":"If you enjoy these videos and podcasts, please go to the symbolicworld.com website and see how you can support what we're doing. There are multiple subscriber tiers with perks. There are apparel and books to purchase, so go to the symbolicworld.com and thank you for your support."}
