{"episode_id":"SW - #334 - 2024-04-03 - Aidan Hart - A New Image of Everything","start":12.16,"end":96.94,"speaker":"Jonathan Pageau","text":"This is Jonathan Pedro. Welcome to the symbolic world. Hello, everyone. It is my great joy to be back with Aidan Hart to discuss a wonderful image at his designings. Those that have paid attention to my channel have seen many discussions with Aidan. His insight into iconography, also his, his own mastery of the skills makes him really one of the modern masters of, of iconography, but also of understanding the role and the symbolism and icons. And he is working on a beautiful new image of the heavenly Jerusalem and its relationship to creation. And in some ways it's very akin to the images of everything that I've developed, you know, with, with the, with the mountain and the crucifixion or the flood. And it, it really goes to show how you can show the same universal truth through different prisms. And so I really want to. To explore this image with him and, and see how, how he came to develop it the way he did. And so, Aidan, thanks for. Thanks for talking to me about this. And so what is the impetus? Let me show the image first of all and then we can talk about it. Tell us a bit about what the impetus was for this image, like what prompted it."}
{"episode_id":"SW - #334 - 2024-04-03 - Aidan Hart - A New Image of Everything","start":97.66,"end":195.68,"speaker":"Aidan Hart","text":"Yeah, thanks, Jonathan. I got an email from an orthodox marine biologist who's a professor at Point Lomas University on the west coast of America. And being a marine biologist, he was very interested in somehow bringing together evolutionary theory, not obviously in the sense of an atheistic one, but the sense of a gradual creation, let's say, with Christ, with orthodox theology. So it was quite an exciting project. Besides, studied biology at university myself and, and I wanted to bring together scientific discovery, but an emphasis on Christ is the telos. Christ is the beginning and the middle and the end. So it was a real challenge. I somehow wanted to bring together heaven and earth, acid ware, and this movement towards the New Jerusalem. So basically the commission came from Andrew and he wanted it to be used as a point of discussion and teaching. Really. It's big. It's going to be roughly 2 meters or something like that, perhaps traveling around a bit. Probably we'll use it in England for about six months before we send it over. So it's going to be a point of discussion, really. There's already an orthodox sort of creation group, so I think they're discussing it there. So my main influence has been obviously the New Jerusalem, the Book of Revelation, but also Saint Maximus the Confessor. So in a sense it's trying to indicate something of St. Maximus's teaching and an icon."}
{"episode_id":"SW - #334 - 2024-04-03 - Aidan Hart - A New Image of Everything","start":196.64,"end":236.11,"speaker":"Jonathan Pageau","text":"All right, so let's look at some of the elements. I Mean, I was really, I was, I found it really beautiful because what I see in the image, in some ways it's, it's taking this image of the cosmos really from, from an apocalyptic vision. And so the image of the heavenly Jerusalem is the, is the top of the, the world. It's something like the source of reality. Christ is in the center. He becomes in some ways the tree of life, the middle of the garden and the waters are flowing down from him. So tell us a bit about some of the choices that you made in the image. Maybe we can start at the top."}
{"episode_id":"SW - #334 - 2024-04-03 - Aidan Hart - A New Image of Everything","start":236.43,"end":368,"speaker":"Aidan Hart","text":"Yeah, probably the best place to begin is the end. Really. We can only understand the beginning in the light of the end to which God is directing it. So first of all, the image itself is actually three by two in proportions, which means that the bottom half is a square, the bottom 2/3 rather is a square and the top is a dome. And Christ is situated in the middle of the dome, the circle at the top, but also is the middle of the top of the square. And four sided squares, the symbol of many cultures of the created world, the four elements, the four points of the compass. So Christ is at the heart of it. He's the Logos, God become flesh. So it begins and ends there. But of course, as you see around him is the new Jerusalem. And it's the new Jerusalem which includes the whole of creation. What struck me about Maximus's teaching compared say with Dionysius the aopagite, it's to say you're sort of leaving behind matter and we end up just with sort of pure ideas. But Maximus, all the material symbols are taken up and a part of the end, they're not sort of spat out. It's tempting thing. So that's why I've got sort of the divine things, the angelic realm at the top, the mother of God, together with plants, mineral kingdom and all that. So that's a starting point really. I wanted it all culminating in Christ and behind Christ himself, of course you've got this in microcosm. We've often talked about the fractal nature. So the horn icon is a square united with a circle. And behind Christ again you've got a circle turned as a diamond combined with the circle, his divinity. So Christ is fully God, fully man. But creation is also created by nature. It's material by nature, but it's called to be united to God by grace. So all three really got this square united of the circle, or another way to put it is the cross runs through everything, the vertical and the Horizontal?"}
{"episode_id":"SW - #334 - 2024-04-03 - Aidan Hart - A New Image of Everything","start":368.72,"end":402.6,"speaker":"Jonathan Pageau","text":"Yeah. It's amazing. I mean, because in some ways, it's the symbolism of the church itself with the dome and the square, but it's also just an arch. You know, like, to see how universal this symbolism. You know, the arch of a window has the same structure as the church itself. It's this little. It's this beautiful kind of fractal symbolism that comes in. And so I'm curious, why did you put the Virgin up at the top of the image? Or in the. In the. The top part of the image? What. What. What was your. What was your thinking there?"}
{"episode_id":"SW - #334 - 2024-04-03 - Aidan Hart - A New Image of Everything","start":403.16,"end":463.57,"speaker":"Aidan Hart","text":"Yeah, in. In. In the. Well, a whole lot of things, really. The Virgin is like the microcosm of the whole church. You know, God became man in her, so in herself, she's like a symbol fruition of the church. So Christ, in his humility, humbles himself to raise us up. So Christ is in the center. So even though he's not the highest, he's in the center. So he's always the Logos, the heart of everything, but he wants to sort of exalt the church. And that's symbolized in the Virgin. I actually had it a bit smaller originally, but the commissioners asked if I could make her larger. So all along I was sort of trying to balance. Christ is God, therefore, at the top. But on the other hand, Christ is God and his humility into his creation and wraps it around Himself. He's happy, as it were, to allow himself to transfigure us."}
{"episode_id":"SW - #334 - 2024-04-03 - Aidan Hart - A New Image of Everything","start":463.65,"end":505.69,"speaker":"Jonathan Pageau","text":"Yeah, and there's also, like an incarnational movement if you follow from the top and the glory of God here at the top. And then you have this descent of. Of God into the world as a seed, you know, in the virgin and then fully revealed in the end, you know, of Christ in the center of the whole story. So I think it works really well. And it also suggests the east and the apse of the church with. With the Mother of God there. And at the. You know, kind of in the. If you were standing in the church, that what you would see, right? You would see her be back there, and then above you, you would see Christ. And so there's this reflection of that structure in the image itself."}
{"episode_id":"SW - #334 - 2024-04-03 - Aidan Hart - A New Image of Everything","start":506.57,"end":572.15,"speaker":"Aidan Hart","text":"And of course, it'll be sort of dark blue at the very top. You've got the single sphere, but with three prongs coming out. So that is the Holy Trinity, three at one. So again, we go through Christ to the Father and through the Holy Spirit in the sense that everything comes from the Holy Trinity at the top and moves toward The Holy Trinity. At the top, the horizontal gradually gets taken up into the vertical. So that's why if we go down to the bottom, I'm sort of struggling to unite what's called Chronos, clock time, with kiros, which is more sort of divine and vertical. So I decided to have the six days of creation in bands. And at the bottom, just slightly curved. But as you go up, the curve gets steeper until ultimately it comes to a point toward Christ. So that at the bottom, one starts with the flat, disordered, as it were, the world of form and void. And then gradually we rise up to higher order."}
{"episode_id":"SW - #334 - 2024-04-03 - Aidan Hart - A New Image of Everything","start":572.87,"end":592.76,"speaker":"Jonathan Pageau","text":"But one thing I noticed. Yeah, I hadn't thought of that when I saw it at the outset, because I was wondering, why do you have these kind of tears going up and these circles? But then I can clearly see that in some ways it's the dome of heaven that is flattening itself out to become the earth. And the opposite is true, which is flat earth is kind of moving into this heavenly shape. That's amazing."}
{"episode_id":"SW - #334 - 2024-04-03 - Aidan Hart - A New Image of Everything","start":594.28,"end":621.57,"speaker":"Aidan Hart","text":"And the gradual sense of creation starts from the outside. It comes toward the inside. So Andrew once told me that the likely phases of the development of the created world. So you've got large enough extinct creatures on the left and the right. And gradually, as you move forward, you come to more recent creatures. So you've got this Chronos on the horizontal being consummated in the divine time."}
{"episode_id":"SW - #334 - 2024-04-03 - Aidan Hart - A New Image of Everything","start":623.25,"end":640.29,"speaker":"Jonathan Pageau","text":"Okay, so that's why you have the dinosaurs on the outside. I was like, why? What are the dinosaurs doing there? I guess it makes sense that they would be on the outside, for sure. So in some ways, it's like this movement into our experience or the world in which we live."}
{"episode_id":"SW - #334 - 2024-04-03 - Aidan Hart - A New Image of Everything","start":640.96,"end":722.21,"speaker":"Aidan Hart","text":"And Christ has sort of overcome death, not just in the sense of our physical death, but death in terms of separation. So that in some sublime, incomprehensible way, in Christ or the extinct animals are sort of gathered together, lots gathered together into the present. So they're extinct in another sense, in Christ. They're not. Some people ask me why I've got a hedge around paradise. It's initially just because the word paradise is a Persian word meaning a walled park where the emperor would enjoy time with his family and friends. So there's always a sense of distinction between paradise, which was planted by God initially, and the thickened, wild world around. So the way I see it is that God planted the garden as an icon of how he wanted us, as the prophet to priests and kings and queens of the world, to gradually expand the Walls of paradise, to make the whole universe a paradise. So this distinction between paradise and the rest of the world is important. Not to create a sense of sacred and profane, but the opposite, that. That was the beginning, as it were. And gradually, if we acted correctly, which of course we didn't, those hedges, as it were, would expand. The whole world would become a garden city, basically."}
{"episode_id":"SW - #334 - 2024-04-03 - Aidan Hart - A New Image of Everything","start":722.37,"end":761.5,"speaker":"Jonathan Pageau","text":"Yeah. I think, I mean, I think your insight also to make a. A wall that is vegetable, like a vegetable wall, like a, you know, an organic wall, and then have the heavenly Jerusalem being this stone wall, I think it's intuitively very right. It just feels right, like, because you feel that there is a. There was a border, there was a limit of. To the garden, like you said, that was meant to be expanded, but that. That limit would not have, you know, would not have been the same type of limit that would be found in the city. So I really think it's a. Intuitively, it's a. It's a very strong idea to have used the hedge. And also because gardens, we're used to seeing hedges as. As limits in gardens."}
{"episode_id":"SW - #334 - 2024-04-03 - Aidan Hart - A New Image of Everything","start":761.5,"end":761.9,"speaker":"Aidan Hart","text":"It's."}
{"episode_id":"SW - #334 - 2024-04-03 - Aidan Hart - A New Image of Everything","start":764.06,"end":782.89,"speaker":"Jonathan Pageau","text":"But I've never seen that ever. Like, I don't think I've ever seen that represented that way. So I. I think it's a great insight on your part. Tell us a bit about this vertical down here. So you have the cross and then you have these two trees, I imagine, the Tree of Life and the Tree of Knowledge, maybe. But tell us a bit about how your decisions on those."}
{"episode_id":"SW - #334 - 2024-04-03 - Aidan Hart - A New Image of Everything","start":783.29,"end":950.52,"speaker":"Aidan Hart","text":"Yeah, I'd always been perplexed, you know, why God should put this tree of knowledge of good and evil there. Often Protestant writers have said, oh, this is to sort of test us. But it didn't seem to sort of fit with my understanding of God that he put something there to test us. So I was really fascinated when Ephraim wrote that the tree of knowledge and good and evil can be understood as the created world. So if we, Adam and Eve, had received it with thanksgiving, then it would have been knowledge of good. In other words, we wouldn't just then have just seen it as a nice fruit, but would have seen it as an expression of God's love. So we would have received it Eucharistically, but if we just grabbed it because it's just nice to taste and turned our back on God, then it would become knowledge of evil. So that really made sense to me. God, in his humility, wanted to create something in a sense from which he is absent, which is our free will. Okay, I've given You everything. I'm going to stand back now and I want you to be grown ups, to live properly. You can live improperly if you want. That's your freedom. So you've got the tree of knowledge of good and evil there, which we botched it up with. So that's why Adam and Eve are then walking downhill either side clothed now. So Christ becomes the tree. Of course the word cross in Greek is stavros, but also kilo, which can be tree and wood of the cross at the same time. So above that is the tree of knowledge, of life and a made up three. The tree of life is God himself, the Trinity. And the three colors I've used are those used in the Rubinov Trinity icon. Sort of the pink and the red and the green. The Father on the left, the Son and the middle and the Holy Spirit on the right. And then of course you've got the cross. And this is a jeweled cross. It won't just be a wooden cross, it will be a glorious cross. So Christ enters our fallen world and as the tree of life becomes dead becomes the cross, the tree of death, and that becomes the tree of life. And Christ said that the sign of the Son of Man will appear in the heavens before I return. So this is often depicted as a jewel cross of early Roman mosaics. So the cross of death becomes the coming of the kingdom in the future. So that's why it's going to be a jeweled cross. And as you mentioned earlier, the four rivers come from the cross, the tree of life and Christ above. Because it's not the cross itself, it's Christ on the cross who is the source of the river. So you've got these four rivers there."}
{"episode_id":"SW - #334 - 2024-04-03 - Aidan Hart - A New Image of Everything","start":951.08,"end":1037.57,"speaker":"Jonathan Pageau","text":"Yeah, I like the idea that because we're used to, we see this image in, it's funny how you can see how at some point the iconographic intuition just becomes a language because we're used to seeing the, in the image of the Last Judgment, we're used to seeing fire come from under the feet of Christ. And then here, because you're showing the order of creation rather than the judgment per se. It's still an apocalyptic image, but it's a, it's a powerful insight to have the water which flows from, from Christ through the cross, through the trees, with all the images that we have of, you know, Christ's side being pierced and the, the water flowing, that, that was the water paradise. All these images. It's I, I, I really love, I really love it because it's completely new. I Don't think I've ever seen anything like this. But it is at the same time completely traditional because all the associations, if you know them, they come, they, they appear right away. It shows you how there's all this room within the iconographic language. If you do it with the right attention to tradition, but also deep understanding of it, that's not just rote copying, that you can come up with new images that immediately strike us as right, even though we've never seen them before. And so I, I really love that the, the image of the water is coming down. I am surprised that you don't have four. You have like three rivers. Should have. You should have."}
{"episode_id":"SW - #334 - 2024-04-03 - Aidan Hart - A New Image of Everything","start":1037.57,"end":1053.45,"speaker":"Aidan Hart","text":"Yeah, one, but there are actually four now there's four. How's that? I think it's the. How does it work now? I think basically you've got. It's been a while since we designed this. I don't think this. I think the river at the top is the fourth one."}
{"episode_id":"SW - #334 - 2024-04-03 - Aidan Hart - A New Image of Everything","start":1053.45,"end":1059.61,"speaker":"Jonathan Pageau","text":"Okay. So this would be the one and then these would be three. Okay, so that's how you see it. Like that one and then. And then three more."}
{"episode_id":"SW - #334 - 2024-04-03 - Aidan Hart - A New Image of Everything","start":1059.85,"end":1064.89,"speaker":"Aidan Hart","text":"Yeah, and. And you notice that the water goes uphill on either side. You've got this funny sort of."}
{"episode_id":"SW - #334 - 2024-04-03 - Aidan Hart - A New Image of Everything","start":1064.89,"end":1066.41,"speaker":"Jonathan Pageau","text":"Yeah, yeah, I'm wondering about that."}
{"episode_id":"SW - #334 - 2024-04-03 - Aidan Hart - A New Image of Everything","start":1066.64,"end":1119.02,"speaker":"Aidan Hart","text":"So Bishop Callistos once said that Christ comes to us out of the future as well as out of the past and in the present. It's one reason why we face east. We're sort of moving toward the rising sun. That Christ. And I'm fascinated by the Roman apses, the early Roman apses. A lot of apses have been asked of fresco have been inspired by this. So you have an image of Christ there, of course, in the apse, but behind you have brightly colored clouds, normally which are sunrise colored clouds. So on the one hand you're looking at Christ present here as we worship, but on the other hand we're looking at Christ coming in the future. So time goes forward and backwards in God. So I wanted the river to go uphill, as it were, as well as downhill, just to sort of play with that sense of the elasticity of time in Christ."}
{"episode_id":"SW - #334 - 2024-04-03 - Aidan Hart - A New Image of Everything","start":1119.1,"end":1248.67,"speaker":"Jonathan Pageau","text":"Yeah, yeah, yeah. But I mean, there's also a way in which, you know, we know that the water goes up. I mean, this is a weird thing. Like we know that there's this cycle of water and there's this relationship between heavenly water and earthly water in Genesis. Genesis 1. But visually what's interesting about it is it has this, you know, it is. We have a structure that's very, very primal. And I don't know to what extent we can explain it, but there's a structure you see in iconography. And you see it, you see the, the central pillar across and then two things on the side that are. That are doing something like that. Whether it's the two snakes on the croier, you know, whether it is sometimes, it's sometimes foliage that will be coming back up on the two sides. So there's this deep insight about that, this being right. And so, you know, even if even, even when I looked at it and, and I didn't know what your intention was, it didn't matter because it feels right even structurally, even if I don't totally understand the meaning. There's something about it which I recognize as being something like the center. And then these two aspects that are, you know, coming up to praise, coming up to react, coming up to even attack sometimes. Like, it could be different, different versions of it, but it does it, it really is the center and these two sides. So I, I, yeah, I, I thought it looked intuitively right. And so the other part, which is really interesting to me and I love is that in some ways you have the creation of the, the, the physical cosmos at the bottom of the image, in some ways, because it's the most material. And so you have the six days of creation here moving up towards, towards Eden and then, then up towards the final revelation. So you have this idea in some ways of the, you know, this relationship of the different heavens. So you have the firmament kind of under. Under the Garden of Eden, which is, which is. Sounds a little weird, but maybe you can tell us a little bit about, about those decisions."}
{"episode_id":"SW - #334 - 2024-04-03 - Aidan Hart - A New Image of Everything","start":1248.91,"end":1397.79,"speaker":"Aidan Hart","text":"Yeah. So when I became Orthodox 40 years ago, I remember my parish priest, Father Yves Dubois, reminding me that the Sabbath is actually the Saturday and the Sunday is the eighth day. And I got fascinated by this concept of the eighth day, which has joined to the previous seven days of creation. But the eighth day is also called the first day of eternity, after which there are no other days. So at the bottom you've got these different layers gradually getting steeper in the middle. So you come to seven, and the seventh day got 1, 2, 3, 4, 5, 6, 7. Yeah. So Adam and Eve are sort of walking down the sixth day. Then you got this sort of seventh there. But then everything above the top river is the eighth day. So I wanted that sort of movement, the progressive movement upwards and a bit of an aside, but relevant nonetheless. One method I use for painting is to do a sort of Puddley, especially if I'm doing garments and ground a rather messy puddle and then gradually add more detail. So the garments, for example, might end up with quite crisp highlights. So this made me think that creation and movement toward crisis, the telos, isn't leaving chaos behind, replacing it. Just a pure order. Pure order. You've got chaos below bubbling up, all sorts of potentiality. So instead of seeing it horizontally moving from chaos to order with no chaos, I thought vertically stacking up. And it happens like that, of course, in nature that you have mutations happening all the time, the sort of chaos of mutations. And once in a while, one mutation helps you adapt better. Without that chaotic mutation, you wouldn't have the opportunity to select the best to adapt better to one's situation. So that fascinated me. So you've got this rather sort of chaotic water. There is some order to it. They're gradually moving up. But nonetheless, the basis is this sort of. I would think of this chaos of the physical world as the freedom that God has given to the inanimate world. You and I, as human beings have a free choice in the way that water doesn't. But God has given water a certain freedom through this chaos. So at every point, God in his humility gives things a certain freedom according to their nature."}
{"episode_id":"SW - #334 - 2024-04-03 - Aidan Hart - A New Image of Everything","start":1399.23,"end":1466.09,"speaker":"Jonathan Pageau","text":"Yeah, I think, I think the insight is. Is quite. Is. Is quite right. And, you know, I always say that the, the tohu bohu, you know, the, the primordial waters of creation, they're still there. They're not. They. God didn't remove them. He basically pulled creation out of. Out of them. But they're still there, you know, as this potentiality at the bottom of the world out of which, like you said, possibility emerges. And then, and then we. We cast light on those possibilities and we select them and we choose them and then we. We tend them, you could say, in order to. To make them thriving. So, no, I think. I think the. The basic structure is. Is intuitively quite. Quite right. I really enjoy it. The other thing that surprised me, though, is that I would have. If I had done this, I would have put. I would have flipped this. I would have put the. The sun on this side and I would have put the kind of nighttime on the other side. Just because I'm used to seeing the. The sun on the right hand of Christ, you know, like Adam and Eve. And then you see the sun and the moon. That's. That's the one thing that. That was one of those. The very, very few things. When I looked at it, I was like, I would have flipped that."}
{"episode_id":"SW - #334 - 2024-04-03 - Aidan Hart - A New Image of Everything","start":1466.25,"end":1468.93,"speaker":"Aidan Hart","text":"But, you know, when we look at."}
{"episode_id":"SW - #334 - 2024-04-03 - Aidan Hart - A New Image of Everything","start":1468.93,"end":1472.41,"speaker":"Jonathan Pageau","text":"Each other's work, you know, we look at it, you know, through the. The prism of someone who."}
{"episode_id":"SW - #334 - 2024-04-03 - Aidan Hart - A New Image of Everything","start":1472.41,"end":1473.21,"speaker":"Aidan Hart","text":"Who. Who."}
{"episode_id":"SW - #334 - 2024-04-03 - Aidan Hart - A New Image of Everything","start":1473.21,"end":1479.08,"speaker":"Jonathan Pageau","text":"Who, when he sees a beautiful image like this, wishes he. I wish I would have been the one to make it. I was like, oh, this is so."}
{"episode_id":"SW - #334 - 2024-04-03 - Aidan Hart - A New Image of Everything","start":1479.08,"end":1480,"speaker":"Aidan Hart","text":"You would have improved it."}
{"episode_id":"SW - #334 - 2024-04-03 - Aidan Hart - A New Image of Everything","start":1480.4,"end":1482.44,"speaker":"Jonathan Pageau","text":"I wish I was the one that made this image."}
{"episode_id":"SW - #334 - 2024-04-03 - Aidan Hart - A New Image of Everything","start":1482.44,"end":1532.2,"speaker":"Aidan Hart","text":"Well, I still. I mean, I'm still taking an advice. This is the first draft, in a way, Andrew got people to give feedback. But it's interesting that the Hebrew day begins with sunset, not sunrise. In Mount Athos, where it was for a while, we would set the clocks by the sunset. So there's a movement from darkness toward light. And we tend to read left to right, of course. So there is that progression from dark to light. And on the left, you've got sort of the little speckles there. That's like the dust which gradually coagulate into the planetary constellations. So that's, again, chronotic movement left. Now, one thing, I'd say that. Who do you think is to the left and right of Christ?"}
{"episode_id":"SW - #334 - 2024-04-03 - Aidan Hart - A New Image of Everything","start":1532.92,"end":1549.56,"speaker":"Jonathan Pageau","text":"Well, my understanding, you know, it took me a while to think about, to realize what it was, but then when I looked at the way the image was structured, I think I realized, because I was like, well, it's clearly not the mother of God and John the Baptist. And then I thought, it's Adam and Eve."}
{"episode_id":"SW - #334 - 2024-04-03 - Aidan Hart - A New Image of Everything","start":1549.64,"end":1550.28,"speaker":"Aidan Hart","text":"That's it."}
{"episode_id":"SW - #334 - 2024-04-03 - Aidan Hart - A New Image of Everything","start":1550.92,"end":1559.97,"speaker":"Jonathan Pageau","text":"But again, why did you flip them up here so you have them. Is it because you wanted to have The Virgin and St John, the foreigner structure at the top?"}
{"episode_id":"SW - #334 - 2024-04-03 - Aidan Hart - A New Image of Everything","start":1562.53,"end":1571.37,"speaker":"Aidan Hart","text":"Yeah, good point. Really can't remember why I put them around that way. Yeah, because that."}
{"episode_id":"SW - #334 - 2024-04-03 - Aidan Hart - A New Image of Everything","start":1571.37,"end":1575.05,"speaker":"Jonathan Pageau","text":"Because you usually see Adam at the right side in the."}
{"episode_id":"SW - #334 - 2024-04-03 - Aidan Hart - A New Image of Everything","start":1575.05,"end":1575.37,"speaker":"Aidan Hart","text":"In the."}
{"episode_id":"SW - #334 - 2024-04-03 - Aidan Hart - A New Image of Everything","start":1575.37,"end":1579.81,"speaker":"Jonathan Pageau","text":"In the Last Judgment. So that's what. That's the thing that threw me off a little bit. I was like, oh, who are who?"}
{"episode_id":"SW - #334 - 2024-04-03 - Aidan Hart - A New Image of Everything","start":1579.81,"end":1583.97,"speaker":"Aidan Hart","text":"Yeah, perhaps they ought to change them over then. Yeah. So that people relate that to the resurrection."}
{"episode_id":"SW - #334 - 2024-04-03 - Aidan Hart - A New Image of Everything","start":1584.5,"end":1594.58,"speaker":"Jonathan Pageau","text":"Yeah, the anastasis has that. And then often you see. In the Last Judgment, you see them kneeling at the altar, you know, beneath the feet of Christ. And so they have that order."}
{"episode_id":"SW - #334 - 2024-04-03 - Aidan Hart - A New Image of Everything","start":1594.9,"end":1595.94,"speaker":"Aidan Hart","text":"Yeah, I can't change that."}
{"episode_id":"SW - #334 - 2024-04-03 - Aidan Hart - A New Image of Everything","start":1595.94,"end":1628.53,"speaker":"Jonathan Pageau","text":"I think it's a great idea, you know, because it does tell the final story in some ways in a manner that I've never seen told. Because, you know, we represent this idea often, the idea that you're representing here. We often represent it as the apostles, you know, sitting and ruling with Christ, that type of imagery. But I think the idea of showing Adam and Eve as a king and a queen in the kingdom, it brings it all together in terms of creation. Right. If we're talking about an image of creation, I think it's a wonderful insight."}
{"episode_id":"SW - #334 - 2024-04-03 - Aidan Hart - A New Image of Everything","start":1628.85,"end":1642.05,"speaker":"Aidan Hart","text":"And quite a bit in the way that those figures will be dressed. It's a bit difficult on this tiny scale, but they won't just be king and queen, but also be prophets, so they'll probably have a prophet hat. And also you notice that they're offering bread and wine."}
{"episode_id":"SW - #334 - 2024-04-03 - Aidan Hart - A New Image of Everything","start":1642.21,"end":1645.4,"speaker":"Jonathan Pageau","text":"Oh, yeah, I was wondering. I didn't catch that."}
{"episode_id":"SW - #334 - 2024-04-03 - Aidan Hart - A New Image of Everything","start":1645.55,"end":1713.78,"speaker":"Aidan Hart","text":"Okay, yeah, yeah. So this is a symbol of them using creation properly. In other words, they've changed from partaking incorrectly of the created world and partaking properly, which is to fashion it well to make good wine and good bread, but also then offer it to God with thanksgiving. In other words, to see the Logos within the logo of all his creation. So they're being restored to their role as prophet, priest and king. And above them, of course, are representatives of the whole of the church. There'll be people of all different races there and different ages, male and female. So as with the mother to God, that group behind will be a summation of the church, but also in Adam and Eve, it's a summation of the church I'll fall bears because they're being raised. That struck me, actually, when I first saw the resurrection icon, when I became Orthodox. That was wonderful that the very people, Adam and Eve, through whom the whole of creation fell, are actually the first to be saved. I thought that's God's forgiveness. The ones who missed about are the first to be raised."}
{"episode_id":"SW - #334 - 2024-04-03 - Aidan Hart - A New Image of Everything","start":1713.86,"end":1784.62,"speaker":"Jonathan Pageau","text":"Yeah. And there's already an insight of the cosmic aspect of what's happening at the resurrection. Like, you can feel that this is hinting to this cosmic moment that you're showing here, which is in some ways I really love the idea. It really just all of it comes together because in the book of Revelation, you have this idea that, you know, the kid. The kingdoms offer their crowns up, you know, and also in some ways, all their good works are kind of offered up to. To Christ and using the bread and the wine, because people who don't know. But in the. The traditional idea of the. Of the Eucharist was that the people make the bread, you know, and then they bring it up so that it will then be consecrated. So it's like an offering of creation. You've talked about this, I think, even with me before, you know, the. The idea that. That it's this offering of all creation, ultimately in the Eucharist is what's going on. And so having that appear in the heavenly Jerusalem is a great. Is a great way to create that summation. One of the things too, that when you mentioned about the seven days, I don't know if you thought about it, but if you have the seventh day being here, that's also the Sabbath in the sense of the cross."}
{"episode_id":"SW - #334 - 2024-04-03 - Aidan Hart - A New Image of Everything","start":1784.62,"end":1784.9,"speaker":"Aidan Hart","text":"Right."}
{"episode_id":"SW - #334 - 2024-04-03 - Aidan Hart - A New Image of Everything","start":1784.9,"end":1792.9,"speaker":"Jonathan Pageau","text":"Because we have this idea that the holy Sabbath is that Christ, the day of Christ's death, is the perfect Sabbath."}
{"episode_id":"SW - #334 - 2024-04-03 - Aidan Hart - A New Image of Everything","start":1794.58,"end":1887.71,"speaker":"Aidan Hart","text":"I was rereading parts of Saint Maximus the Confessor this morning, and I was really taken by how he talks about the cross. He says all visible things, phenomena in the Greek need a cross, and all intelligible things, spiritual things, invisible things, need a tomb. And what do you mean by all visible things need to cross? Maximus is saying that I'm looking at the horizontal part of the cross. God created great diversity and embraces that diversity. Everything doesn't melt down to a big blob, that a tree's a tree and a rock's a rock, et cetera. But then the vertical, you gotta go down first to the Logos at the heart that created all these, and then they're raised up to the heights to, to return them to the Logos without losing their distinction. And then he says that the intelligible things, our spiritual perception of things, needs a tomb. In other words, we need to go beyond. And this is the whole symbol thing, isn't it, that God comes to us through symbols. But then there's always something beyond the symbol. So if we cling to the symbol, we die. So we've got to receive that glory, but also take it to the tomb and think, wow, there's another one beyond even that and one beyond that. So that was one aspect of his teaching. I wanted to show that the sort of centrality of the cross, not just as the death of Christ, but as you've often said, it's like a tree, isn't it, that's rooted in heaven, rooted on earth. It spreads out, but yet it's one."}
{"episode_id":"SW - #334 - 2024-04-03 - Aidan Hart - A New Image of Everything","start":1888.51,"end":1888.99,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #334 - 2024-04-03 - Aidan Hart - A New Image of Everything","start":1893.08,"end":1895,"speaker":"Aidan Hart","text":"To, to. To the sky that it will die."}
{"episode_id":"SW - #334 - 2024-04-03 - Aidan Hart - A New Image of Everything","start":1897.48,"end":1909.96,"speaker":"Jonathan Pageau","text":"Definitely. Definitely. So, so tell us about the plan for this image. You said it's going to be in a, in a, a church. And are you going to be. Document? I, I imagine you'll be documenting the, the making of it. It's quite a. It's quite an undertaking."}
{"episode_id":"SW - #334 - 2024-04-03 - Aidan Hart - A New Image of Everything","start":1910.6,"end":1946.27,"speaker":"Aidan Hart","text":"Yeah. Yes. Well, probably actually it'll end up in the university. I don't know if it'll be in the chapel, but in the University anyway, but because it'll be painted in egg tempera and I'd like to leave egg tempera at least six months before I varnish. Andrew suggested that I have it and use it in England. In fact, I've been asked to give a talk at the Bath Orthodox Arts Festival again. So hopefully I'd have it ready by then. We can take it there. But, you know, I quite like to have it as a talking point. I mean, it is an icon in the sense that it's iconographic, but it's."}
{"episode_id":"SW - #334 - 2024-04-03 - Aidan Hart - A New Image of Everything","start":1946.27,"end":1948.27,"speaker":"Jonathan Pageau","text":"So it'll be painted on a panel. It won't be painted."}
{"episode_id":"SW - #334 - 2024-04-03 - Aidan Hart - A New Image of Everything","start":1948.27,"end":1948.55,"speaker":"Aidan Hart","text":"Yeah."}
{"episode_id":"SW - #334 - 2024-04-03 - Aidan Hart - A New Image of Everything","start":1948.55,"end":1950.99,"speaker":"Jonathan Pageau","text":"Yeah, okay. A two meter panel."}
{"episode_id":"SW - #334 - 2024-04-03 - Aidan Hart - A New Image of Everything","start":1951.23,"end":1955.79,"speaker":"Aidan Hart","text":"Well, I haven't decided entirely, but it'll be big Anyway. Yeah. Between 1.6 to 2 meters."}
{"episode_id":"SW - #334 - 2024-04-03 - Aidan Hart - A New Image of Everything","start":1955.79,"end":1957.03,"speaker":"Jonathan Pageau","text":"1.6. Okay. All right."}
{"episode_id":"SW - #334 - 2024-04-03 - Aidan Hart - A New Image of Everything","start":1957.03,"end":1983.55,"speaker":"Aidan Hart","text":"Wow. So, yeah, I mean, I want it to be a talking point and it's more. I suppose it's more like an illuminated manuscript in the sense that it's not something that you put in the church to venerate. Though I suppose you could say that if there is one day of the liturgical year where it would be appropriate, it would be September 1, which the previous patriarch appointed as the day of creation. So it is actually part of the church calendar now."}
{"episode_id":"SW - #334 - 2024-04-03 - Aidan Hart - A New Image of Everything","start":1984.91,"end":2044.51,"speaker":"Jonathan Pageau","text":"But it's also, it is. I think it's a. I think that your image is, is an, is an apocalyptic image. I think that it, it's appropriate in the, in that sense that it's completely coherent with an image of revelation which focuses on the summation rather than the judgment. And so although it's an image that we've never seen before, I think that it fits perfectly well with, with, with our tradition, you know, and, and there are, there are versions of that. Like in the west, you have these types of images that try to show the ontological relationship between Christ and the world. It's not like there aren't. There are many precedents, I think, for, for your image. It's just that you bring it together in such a. Such a cohesive, such a cohesive way, which in some ways is the thing that, that we're, that we can do, right? That we can. We can stand on the shoulder of giants, as we say, and kind of say, oh, well, I see these threads coming together. You know, we can just push it a little further and see how it, how it comes together."}
{"episode_id":"SW - #334 - 2024-04-03 - Aidan Hart - A New Image of Everything","start":2046.35,"end":2092.34,"speaker":"Aidan Hart","text":"The general idea for the arrangement came from an icon. All creation rejoices anew. A Russian icon, the idea of the arch at the top, and that's very different in the bottom half. But the sort of the white upper area with the arches, that was inspired by that. I wasn't sure how to depict the New Jerusalem, which is a square basically, with 12 gates. As I came across this image from. It's a fresco from Italy painted in 1090, I think. San Pietro Almonte in Cervarte in Italy. I think the reason why they've done it like that is you want everything to be visible. Nothing is hidden. So this is the only way really you can get all 12 gates visible."}
{"episode_id":"SW - #334 - 2024-04-03 - Aidan Hart - A New Image of Everything","start":2092.5,"end":2093.7,"speaker":"Jonathan Pageau","text":"Yeah, yeah, yeah."}
{"episode_id":"SW - #334 - 2024-04-03 - Aidan Hart - A New Image of Everything","start":2093.86,"end":2098.5,"speaker":"Aidan Hart","text":"That's sort of. It's sort of a square, but it's not. And I wanted all 12 gates visible."}
{"episode_id":"SW - #334 - 2024-04-03 - Aidan Hart - A New Image of Everything","start":2099.38,"end":2111.79,"speaker":"Jonathan Pageau","text":"That's right. Okay, so I see. It's a great solution to show an iconographic space that reveals itself, but that still suggests the square without hiding the different parts."}
{"episode_id":"SW - #334 - 2024-04-03 - Aidan Hart - A New Image of Everything","start":2112.03,"end":2157.13,"speaker":"Aidan Hart","text":"Yeah, yeah. A lot's been written recently, really, from the time of George, say, of Pavel Fransky, on the different perspective systems used in icons. An inverse perspective has sort of stolen the scene. But in fact, I figured there are about seven types of icon perspective. One is multi view perspective. Like in this one, it's to say you're viewing the square, or cubic, whatever it is, New Jerusalem, from all different angles at once. So all gates are visible, of course, in God. God is not limited to space. So in general, an icard sort of confounds our rational faculty to help us to go from there, which is good, but it has limitations into the noose, into the noetic faculty which can."}
{"episode_id":"SW - #334 - 2024-04-03 - Aidan Hart - A New Image of Everything","start":2157.69,"end":2201.11,"speaker":"Jonathan Pageau","text":"This is the real tesseract, not this scientific stuff about four dimensions. Like this is. This is an actual tesseract. But you can show everything, you know, simultaneously in. In a. In a space. But it, it's interesting to think about that, what you said, because in some ways, you know, if you think of the. I would say that this is a. A me, a meaningful Cubism in some ways, where the Cubist did it in a manner that was aesthetic and not necessarily trying to point to meaning. But now you're. You're flipping space and you're. You're showing all these different facets simultaneously, but rather to reveal something about creation and the relationship between 1 and 12. So that's a. I think it's a great. It's a great."}
{"episode_id":"SW - #334 - 2024-04-03 - Aidan Hart - A New Image of Everything","start":2202.15,"end":2247.11,"speaker":"Aidan Hart","text":"Probably all of the, as it were, discoveries which are really rediscoveries of 20th century art, color field painting, for example, saying, well, the surface is flat, so why try to make it three dimensional using perspective, whatever. All these things really have always been in the sacred tradition. But as you say, Cubism, for example, is always there in the icon that we kept it in the realm of the sacred. Just haven't taken that one aesthetic tool and sort of separated it, which is really exciting. I think a lot of research has been done on a lot of the Orthodox roots of early modernism, often in a debased way, but, you know, it's there. It's not actually a discovery at all."}
{"episode_id":"SW - #334 - 2024-04-03 - Aidan Hart - A New Image of Everything","start":2248.98,"end":2286.29,"speaker":"Jonathan Pageau","text":"Yeah. And there are ways that we can recapture. And I mean, I think that's some of the work that you've done. Father Silouan, many of the, of the Romanian artists as well, who are trying to kind of say, okay, well, let's get, you know, we can also take some of the best elements of these traditions and reintegrate them into a vision that, that is hierarchical and, you know, and doesn't, doesn't try to just transgress. To transgress, but rather is able to kind of mold our vision so that we can have a better insight, you know. So tell me a bit about the carving that's back behind you because. No, it's like you're tempting me by putting that up. Right."}
{"episode_id":"SW - #334 - 2024-04-03 - Aidan Hart - A New Image of Everything","start":2286.77,"end":2303.73,"speaker":"Aidan Hart","text":"I put it there for you, Donna, for just for you. Yeah. This has been quite a complex commission. It's the three, the use and the furnace. And it's commissioned for an Orthodox church to have an interior door. And it's going to be the upper panel of a door. So it's, it's carved."}
{"episode_id":"SW - #334 - 2024-04-03 - Aidan Hart - A New Image of Everything","start":2303.73,"end":2305.81,"speaker":"Jonathan Pageau","text":"And this will be in a door."}
{"episode_id":"SW - #334 - 2024-04-03 - Aidan Hart - A New Image of Everything","start":2306.39,"end":2313.19,"speaker":"Aidan Hart","text":"Yeah, set into a door. Yeah. It's quite, quite large, you can see. Yeah, quite large."}
{"episode_id":"SW - #334 - 2024-04-03 - Aidan Hart - A New Image of Everything","start":2313.43,"end":2313.91,"speaker":"Jonathan Pageau","text":"Nice."}
{"episode_id":"SW - #334 - 2024-04-03 - Aidan Hart - A New Image of Everything","start":2314.23,"end":2321.19,"speaker":"Aidan Hart","text":"Whatever that is. Three feet, three feet high or something. Yeah, it's beautiful."}
{"episode_id":"SW - #334 - 2024-04-03 - Aidan Hart - A New Image of Everything","start":2321.19,"end":2331.59,"speaker":"Jonathan Pageau","text":"I mean, it's also. I'm so jealous. I've never had the chance to do. To do a color carving, to have to have it painted. It's quite. It's really amazing."}
{"episode_id":"SW - #334 - 2024-04-03 - Aidan Hart - A New Image of Everything","start":2332.7,"end":2352.7,"speaker":"Aidan Hart","text":"I found sometimes it's quite good to polychrome. As long as you do justice to the wood carving. You don't just sort of cake it and paint so you can see the wood coming through. Because you don't depend so much on good lighting to show the detail with low relief. If the lighting isn't good, it just looks a bit like a blob at a distance."}
{"episode_id":"SW - #334 - 2024-04-03 - Aidan Hart - A New Image of Everything","start":2354.46,"end":2359.07,"speaker":"Jonathan Pageau","text":"And so, yeah, you've done it with stain instead of painting it. Painting it like."}
{"episode_id":"SW - #334 - 2024-04-03 - Aidan Hart - A New Image of Everything","start":2359.15,"end":2378.43,"speaker":"Aidan Hart","text":"Yeah, I used oil paint, but put lots and lots of terps in, so it's almost for stain, really. So I semi sealed the wood first and then used oil. You can't really use any temper in A situation like this and then, and then put a thin coat of varnish and waxed it over the top."}
{"episode_id":"SW - #334 - 2024-04-03 - Aidan Hart - A New Image of Everything","start":2378.99,"end":2383.79,"speaker":"Jonathan Pageau","text":"Yeah, it's really beautiful. Is that the only. Are you going to make, Are there other panels for this?"}
{"episode_id":"SW - #334 - 2024-04-03 - Aidan Hart - A New Image of Everything","start":2383.79,"end":2388.05,"speaker":"Aidan Hart","text":"This one. This is fun. Yeah, yeah, yeah."}
{"episode_id":"SW - #334 - 2024-04-03 - Aidan Hart - A New Image of Everything","start":2388.05,"end":2394.17,"speaker":"Jonathan Pageau","text":"I hadn't seen you carve in a while, though, have you? Because it seems like this is. It's been a while since I've seen you make such an elaborate carpet."}
{"episode_id":"SW - #334 - 2024-04-03 - Aidan Hart - A New Image of Everything","start":2394.41,"end":2419.62,"speaker":"Aidan Hart","text":"Yeah, well, I, I, I don't suppose so many people commission carving, so I, I just do what I'm commissioned to do, but. Right, right. I did two carvings about two years ago, but, yeah, they're big gaps where you don't get anything. Stone is more common because it can be part of an icon screen or whatever. Actually, I don't know about you, but I find stone easier to carve than wood. With wood, for sure. There's so many chisels and you got to worry about the grain and, yeah."}
{"episode_id":"SW - #334 - 2024-04-03 - Aidan Hart - A New Image of Everything","start":2419.62,"end":2434.26,"speaker":"Jonathan Pageau","text":"Stone, you just have flat chisels pretty much. You just, you know, and then this and then wood, it's like this whole. And you have to keep them super sharp. You know, with stone, you don't have to think about it so much. Sharpen them a little. Not too much even. You don't want them to be too sharp. Yeah, I prefer, I prefer carving stone by far."}
{"episode_id":"SW - #334 - 2024-04-03 - Aidan Hart - A New Image of Everything","start":2434.82,"end":2438.5,"speaker":"Aidan Hart","text":"Yeah. And primarily soapstone, isn't it? Or steatite, rather."}
{"episode_id":"SW - #334 - 2024-04-03 - Aidan Hart - A New Image of Everything","start":2438.83,"end":2442.23,"speaker":"Jonathan Pageau","text":"Yeah, that's mostly what I'm doing. Have you ever tried to carve the steel?"}
{"episode_id":"SW - #334 - 2024-04-03 - Aidan Hart - A New Image of Everything","start":2442.23,"end":2447.31,"speaker":"Aidan Hart","text":"Well, you really kind of gave me a piece, but I just, I just haven't got around to carving and I'd really like to."}
{"episode_id":"SW - #334 - 2024-04-03 - Aidan Hart - A New Image of Everything","start":2447.31,"end":2455.79,"speaker":"Jonathan Pageau","text":"Yeah, once you carve that, you will, you won't, you won't be able to, you know, you'll start writing me emails saying, jonathan, I need more of that steatite."}
{"episode_id":"SW - #334 - 2024-04-03 - Aidan Hart - A New Image of Everything","start":2457.63,"end":2485.82,"speaker":"Aidan Hart","text":"Yeah. I have carved ivory that's a bit similar, I suppose, in that it's got no grain at all and very, very dense. And when I was at Mount Athos, I was commissioned to carve something for the patriarch. And there's a wood called flamori, which I never come across before. It's virtually grainless. It's not boxwood, but like boxwood to look at, but not, not as hard as boxwood. I did an icon of the port 80s icon with it and I really enjoy that."}
{"episode_id":"SW - #334 - 2024-04-03 - Aidan Hart - A New Image of Everything","start":2486.86,"end":2488.86,"speaker":"Jonathan Pageau","text":"Have you ever tried carving boxwood before?"}
{"episode_id":"SW - #334 - 2024-04-03 - Aidan Hart - A New Image of Everything","start":2488.94,"end":2490.38,"speaker":"Aidan Hart","text":"Oh, yeah, yeah, yeah."}
{"episode_id":"SW - #334 - 2024-04-03 - Aidan Hart - A New Image of Everything","start":2490.63,"end":2491.35,"speaker":"Jonathan Pageau","text":"It's really amazing."}
{"episode_id":"SW - #334 - 2024-04-03 - Aidan Hart - A New Image of Everything","start":2491.51,"end":2575.24,"speaker":"Aidan Hart","text":"Yeah, it's good stuff. Yeah. I wanted to say about the icon is the challenge was Being pedagogic in the sense of teaching, but I just don't like images that are just like illustrations that are like things you read in one's mind. And that sort of takes away that soulishness of a work. I think a work of art should always hit you right in the solar plexus and then you can unfold the inner meaning. So I just found the only way to get that unity was to really have a reduced color scheme. So basically all green and blue, which are very close. And then I started reading a book. This one, actually, I bought it here by this one here. And she uses the Greek term inargia, not energia, but inargia, which is really the immediate impact of aesthetics on the soul. And if they're done in the right way, then it brings us closer to God rather than just being titillation. So apart from all the content of the icon, I really wanted it to have it beautiful in its own right and the composition and the color. And I was really struggling with that. But then I found if I really limited the color palette, then though the details there, it sort of becomes one."}
{"episode_id":"SW - #334 - 2024-04-03 - Aidan Hart - A New Image of Everything","start":2575.4,"end":2619.08,"speaker":"Jonathan Pageau","text":"Yeah, because there are a lot of details. And you're right, if you had. You could get distracted by all the little animals and all the, you know, all the dinosaurs and all these things. But I, like you said, you don't have that experience. I think. I think a lot of it is also because Christ appears very strongly. And the, you know, the. The colors here, the. The kind of orange, yellow color, and also Adam and Eve. So the. The characters in this center, because the colors are stronger there then all these little details here maybe at first seem ornamental, and then they. And so they kind of. They kind of fuse together. But if you pay attention to them, you can see them. But they don't. But they don't. They don't call out, you know, they don't."}
{"episode_id":"SW - #334 - 2024-04-03 - Aidan Hart - A New Image of Everything","start":2620.6,"end":2632.17,"speaker":"Aidan Hart","text":"It's a limited. Those. The color palette of the. The trees and animals to the left and right. So they're there, but they're not different colored. You know, if I put green leaves everywhere, then they're distracted from Christ. Yeah."}
{"episode_id":"SW - #334 - 2024-04-03 - Aidan Hart - A New Image of Everything","start":2632.25,"end":2634.49,"speaker":"Jonathan Pageau","text":"What is this here? This little image here?"}
{"episode_id":"SW - #334 - 2024-04-03 - Aidan Hart - A New Image of Everything","start":2634.57,"end":2640.81,"speaker":"Aidan Hart","text":"Yeah, well, that's the lion with the kid. You know, the prophecies of Isaiah."}
{"episode_id":"SW - #334 - 2024-04-03 - Aidan Hart - A New Image of Everything","start":2640.97,"end":2641.53,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #334 - 2024-04-03 - Aidan Hart - A New Image of Everything","start":2642.65,"end":2654.33,"speaker":"Aidan Hart","text":"So you've got them there and on the other side as well. So it's the prophecy of Isaiah that the, you know, the lion shall lay down for lamb and so on. Okay. Okay. Yeah. You got on the. Right there, you've got the. Is it the wolf?"}
{"episode_id":"SW - #334 - 2024-04-03 - Aidan Hart - A New Image of Everything","start":2654.41,"end":2661.21,"speaker":"Jonathan Pageau","text":"And the, the wolf and the, the. And here the lion. And it's. Then this is just like a person that's with them, like showing them."}
{"episode_id":"SW - #334 - 2024-04-03 - Aidan Hart - A New Image of Everything","start":2661.69,"end":2664.89,"speaker":"Aidan Hart","text":"The child shall put a hand in the asps. In the, in the asps."}
{"episode_id":"SW - #334 - 2024-04-03 - Aidan Hart - A New Image of Everything","start":2665.53,"end":2670.53,"speaker":"Jonathan Pageau","text":"Oh, right, okay. Yeah, yeah, okay, I thought of that. All right. All right."}
{"episode_id":"SW - #334 - 2024-04-03 - Aidan Hart - A New Image of Everything","start":2670.53,"end":2682.81,"speaker":"Aidan Hart","text":"And also you've got dinosaurs eating grass there. So that you've got birds that now. Yeah. Sort on the left there. You've got a Tyrannosaurus rex eating grass on the left there. Yeah, yeah."}
{"episode_id":"SW - #334 - 2024-04-03 - Aidan Hart - A New Image of Everything","start":2683.29,"end":2691.77,"speaker":"Jonathan Pageau","text":"I have to say that the dinosaurs, they weird me out a little bit because I would have put dragons is what I would have put, instead of dinosaurs."}
{"episode_id":"SW - #334 - 2024-04-03 - Aidan Hart - A New Image of Everything","start":2693.05,"end":2695.41,"speaker":"Aidan Hart","text":"Well, I can put one in for you, just for you, Jonathan."}
{"episode_id":"SW - #334 - 2024-04-03 - Aidan Hart - A New Image of Everything","start":2695.41,"end":2699.93,"speaker":"Jonathan Pageau","text":"Yeah. Oh, if you did that, if you put a dragon in there just for me, I would be grateful forever."}
{"episode_id":"SW - #334 - 2024-04-03 - Aidan Hart - A New Image of Everything","start":2699.93,"end":2708.64,"speaker":"Aidan Hart","text":"Oh, she'll put that in. I'm. I'm putting notes down of everything. I'm enjoying this, so I'll change it over and even. And I'll put a dragon in."}
{"episode_id":"SW - #334 - 2024-04-03 - Aidan Hart - A New Image of Everything","start":2711.76,"end":2724,"speaker":"Jonathan Pageau","text":"And so what. Tell us a bit about, about your, Your future plans because you're in a new workshop now. You're. You're focusing on that. Giving, giving some trainings and everything. Maybe tell people what you're up to besides this, this particular image."}
{"episode_id":"SW - #334 - 2024-04-03 - Aidan Hart - A New Image of Everything","start":2724.72,"end":2818.51,"speaker":"Aidan Hart","text":"Yeah. Thank you. Yes. I just moved to a larger studio because my two previous apprentices, Jim Blackstone and Martin Earl, have moved down to Chichester. Now I was approached by them two years ago, the Anglican Cathedral, to help them set up a liturgical arts center. So it has two elements to it. One is to train people to much higher standard. Not just an icon painting, but fresco carving, that sort of thing. So Jim and Martin are heading that. But the second arm of the center is to also educate priests and decision makers and as much as anything, how to help them brief people like architects. If you're lucky enough to someone like Andrew Gould who knows what they're doing, it's fine. But a lot of architects haven't done church work. So a. We're trying to get involved with seminaries, Catholic, Anglican, Orthodox, to I suppose equip the decision makers just with the main principles, the commissioning work. A priest can't tell an architect, for example, or an iconographer how to do things, but at least they can say, this is the atmosphere, this is the state of soul, this is how the liturgy operates. So what you do has got to work liturgically and spiritually, basically, how to give a brief. So anyway, Martin and Jim have gone down there, so that meant that I had space for More apprentices. I love a young man, 25 year old man from New Zealand who's joined me a few months ago and then another who's coming from New Zealand for shorter apprenticeship. So yeah."}
{"episode_id":"SW - #334 - 2024-04-03 - Aidan Hart - A New Image of Everything","start":2820.51,"end":2865,"speaker":"Jonathan Pageau","text":"For those who don't know like that, been following kind of the whole story that the, the Snow White book that we published with Heather Paulington. You know, beautiful, beautiful book. And now Heather is studying with Aiden. He's been studying now with you for a few months now. Um, and I'm already seeing, we're doing Rapunzel now we're doing the second book. And, and now the, all the, the stylistic choices that she's making. And I can see that she's mastering folds and she's mastering certain elements of iconography that, you know, take a, take some time to, to, to dive in and she's creating these beautiful bridges between kind of secular illustration and iconography. And so I know that I have, I have you to thank in, in, in large part for that. So I, I appreciate that."}
{"episode_id":"SW - #334 - 2024-04-03 - Aidan Hart - A New Image of Everything","start":2865.88,"end":2913.85,"speaker":"Aidan Hart","text":"Been a real joy having hither and I was so pleased that she began working with you because it had been a vision of hers to be a full time liturgical artist and it can be really hard to find an opening. But things opened up very, very quickly for her. And I do go on about garments quite a lot. I tell to my students, first I've run this three year part time icon course. Faces, they're not easy, but at least all faces are more or less the same in the sense that they've got two eyes, a nose and a mouth. But garments, draperies, so much more complex. There's so much subtlety, a lot of work. So I really sort of hammer. It's got to be a certain logic to it that we transfigure the world, we don't distort it. And I think a lot of iconography distorts folds, you know, different understanding. So I think I really, really labor that. So I'm pleased that she's come along."}
{"episode_id":"SW - #334 - 2024-04-03 - Aidan Hart - A New Image of Everything","start":2913.85,"end":2962.11,"speaker":"Jonathan Pageau","text":"Well, yeah, I think that's definitely in your work. It's something that I really appreciate because you can see that in late iconography, Russian iconography especially, at some point the, the garments just become abstract shapes which, which is beautiful to some extent, but at some point it becomes almost disincarnated. And I think in some ways even the fact that, that you started as a carver, you, you and, and me also as a, as an icon carver, the, the vestments have to make sense because or else you can't, you can't carve It. If it. If it's just like lines and just abstract things, it looks horrible. And so this desire to kind of come back to something which, like you said, is both makes sense but has a transfigured element to it. I think it's a. It's definitely, definitely the way forward, because you can't. At some point, the abstraction just falls apart and you. You know, it's just disconnect with reality."}
{"episode_id":"SW - #334 - 2024-04-03 - Aidan Hart - A New Image of Everything","start":2962.11,"end":3033.71,"speaker":"Aidan Hart","text":"So I think it's a general principle with life, isn't it, that. I know Father Barnabas, my. My spiritual father in Wales, a blessed memory. He said that if you want to know God, you must know the soil from which you came first. If we try to leap to higher things, then we'll crash down very quickly. So I think just understanding the laws in creation, like how a branch comes out from a trunk, for example, just basic things like that. All those should be embodied in the icon. Yes, I'm doing that. Some interesting fresco work. Well, silica paint, probably, rather than real fresco for apsces. So things seem to go through different phases. Should be a lot of apsidal commissions at the moment, which is great, I love, because the lapse wraps around you, of course. And because there are apses in churches which probably won't have scope for other work, you've got to say a lot, albeit hopefully with elegance, in that one space. So that's why I go back to these Roman apses, where you've got Christ and a few saints, but also the new Jerusalem indicated by Bethlehem and Jerusalem and often sheep moving toward the center. So that's like all of the faithful in time, moving toward Christ."}
{"episode_id":"SW - #334 - 2024-04-03 - Aidan Hart - A New Image of Everything","start":3034.19,"end":3098.44,"speaker":"Jonathan Pageau","text":"Yeah. And I think your intuition about aps is one that I caught right away when I started looking at your work and I thought was the right way to go. Because you see a lot of Orthodox churches end up in either Catholic buildings or Anglican buildings. And so they don't have a dome. And so then they want to kind of maintain the iconography of the church, of the dome, with the apps. So they'll end up putting the Virgin in the apps, but then they don't know where to put Christ. And so they'll. They'll sometimes like. Like stick a. Like a. A flat disc, you know, at the. At the ceiling. And there's. And it's like. There's a. There's a. Like a perfectly orthodox solution to this problem, which is to understand the apse as a little microcosm of the whole church and to have Christ at the top. Sometimes you can even have The Virgin underneath him, you know, you see images of that. We have Christ in glory and then the Virginia with child and the apostles. Like there are different ways to do it where you can capture all the same symbolism, not in the same scope, but at least the essence of the same symbolism in the apps without distorting your architecture, you know?"}
{"episode_id":"SW - #334 - 2024-04-03 - Aidan Hart - A New Image of Everything","start":3099.08,"end":3155.16,"speaker":"Aidan Hart","text":"Well, this is something. This is exactly what I'm talking about. The need to educate priests, seminarians, anyone who makes these sort of decisions. What you said is just the most basic thing. Work with what you've got and don't try to make it something at a dissent. If it's a basilica treated as a basilica, not a dome church, I don't think it would require much time in a seminary to get these things across to three days. Even in a day, the very basic principles could be communicated. So I hope that anyone's listening to this podcast who can have influence in seminaries. Please, please, I beg of you, just have it as not optional, but mandatory for everyone in a seminary to have at least a day or two. Not on how to pay the icons at all, but just principles. And ask Jonathan and Andrew myself, you know, put down two sides of a four. The principles to have in mind. Just, just, I beg of you, whoever's out there, we'll."}
{"episode_id":"SW - #334 - 2024-04-03 - Aidan Hart - A New Image of Everything","start":3155.16,"end":3185.24,"speaker":"Jonathan Pageau","text":"We'll make a video for you and you can just show it to the students. Like, we'll do that. Yeah. So all of you are listening at St. Vlad Stones, you know, all these American seminaries and the European seminaries. Yeah, I think that's a great, That's a great insight. A great insight. Well, Aiden, thank you so much. You know, I, I always love talking to you and I cannot wait to see this image come to fruition. You know, I'll, I'll. Once you have pictures of you working on it, please send them to me and I'll also share them because I think it's going to be a wonderful work."}
{"episode_id":"SW - #334 - 2024-04-03 - Aidan Hart - A New Image of Everything","start":3185.72,"end":3196.29,"speaker":"Aidan Hart","text":"Lovely. Good. I'm. I'm starting a Patreon site in hopefully a few days might because of your advice. So I'll be putting updates on that as well, but I'll let you know."}
{"episode_id":"SW - #334 - 2024-04-03 - Aidan Hart - A New Image of Everything","start":3196.37,"end":3213.57,"speaker":"Jonathan Pageau","text":"All right. This is a way to support Aidan's work. You know, the iconographers, they give their life to sacred art and give their life to the church. And so we need to. We definitely need to help them be able to do that. And so I will definitely be checking out your Patreon as soon as it's up and encourage everybody to go there."}
{"episode_id":"SW - #334 - 2024-04-03 - Aidan Hart - A New Image of Everything","start":3214.29,"end":3219.26,"speaker":"Aidan Hart","text":"Thank you. Lovely to talk Jonathan Thanks Abe. Some inspiration. Bye."}
{"episode_id":"SW - #334 - 2024-04-03 - Aidan Hart - A New Image of Everything","start":3219.9,"end":3235.02,"speaker":"Jonathan Pageau","text":"If you enjoy these videos and podcasts, please go to the symbolicworld.com website and see how you can support what we're doing. There are multiple subscriber tiers with perks. There are apparel and books to purchase, so go to thesymbolicworld.com and thank you for your support."}
