{"episode_id":"SW - #177 - 2021-10-01 - Christianity is Not Revolutionary","start":0.32,"end":1712.02,"speaker":"Jonathan Pageau","text":"I recently made a video on the symbolism of the Beatitudes and trying to show structurally and symbolically how the Beatitudes give us an example or kind of a pattern of how high things relate to low things, of how Christ is really there to fill up the world, fill up the hierarchy, and how he demonstrates how acting a certain way below will make you participate, become fruitful, will make you the body of that which is above the kingdom of heaven. All of these types of images that Christ uses, representing, require us to be in a certain stance, face to what is above, so that we can receive from above and manifest it in the world. So I was trying to show a little bit how this is really the symbolic pattern and how Christ really fills up the hierarchy. And of course, this prompted the usual types of comments that, you know, Christianity is a religion of resentment, a religion of bitterness, a religion of the weak. All of this type of thinking, which is, you know, obviously comes from a kind of Nietzschean perspective and usually has even more unsavory elements in those types of comments. And so although to a certain extent Christianity does show the value of that which is below and how it participates in that which is above. And so there can be a, A, a way of showing the meaning of weakness or the meaning of submission. All of these types of things are shown in Christianity. But, but it doesn't bring about this notion of resentment and this especially the idea that Christians are somehow revolutionary and that this type of thinking leads to revolutionary action or to a revolutionary mindset. So what I want to do is I want to look at two parables that Christ talked about to maybe try to put that to rest once and for all, to try to show once again the same pattern of how Christ gives us an example of how things from above manifest below and how it fills up the world, what that looks like, but in a way that there is no way that you could see it as a form of revolution. So those two parables will be the parable of the wicked husbandman and the parable of the wedding feast. This is Jonathan Pageau. Welcome to the symbolic world. So when we're reading these passages, I would suggest that you always keep in mind the general symbolic pattern, this basic pattern of reality, the mountain of paradise as being this kind of cosmic mountain which moves from a place where heaven and earth meet at the top, but where it's the top of the mountain or the, the, the holy of holies, of the temple, this place of theophany, which then moves down into the world and manifests itself but also tends to lose its flavor as it goes down into the world, all the way until we reach the chaos of the flood, the chaos of the waters which are below. So we kind of have to just remember that type of imagery as we're reading the parables. It can help us understand what it is, what. Why it is that Christ is using certain images rather than other images. So we're going to start with the parable of the wicked husbandmen, or the wicked vinedressers. This is in the Holy Gospel of St. Matthew, chapter 21, and it starts at verse 23, the parable of the wicked vinedressers. Christ says here another parable, there was a certain landowner who planted a vineyard and set a hedge around it, just dug a wine press in it and built a tower, and he leased it to vinedressers and went into a far country. Now, first, you right away need to see the image in your mind. The image again, is an image, a cosmic image of a basic pattern of reality. You can imagine a tower, imagine it in the middle. It's a lot easier to imagine it that way. So imagine a tower in the middle. And imagine now the vine, the. The. The vines that go down. And then at the. At the bottom you have this hedge which is around it, which separates it from other things, which is kind of the limit, the wall, the barrier between this world that is here in terms of the. In terms of the. The vineyard and the rest of the world, let's say. And so you can imagine that from the beginning, when things are planted, or the beginning of the vine moving towards the moment where the vintage is drawing near, the moment where the reaping, where the fruits of this world are going to become manifest, where we're going to see what the fruit of this vine is. Now, the vine, the vineyard, was received from above. It was a kind of kingdom of heaven. You have to understand it as. And so it is received from the owner, which is obviously an image of God, but it works at every level. It doesn't only work as a parody parable of how God interacts with the world, but it also works also at a level lower, you know, almost directly at where the parable is talking about, the way that. That. That the parable is actually talking about this, this. This owner and his. The people he leases it to. So we can understand that whatever it is that we hold from below, we. We necessarily take it from above, right? The, the unity of the world that we participate in must come from above, right? So imagine, you can imagine this not just as a vineyard, but as, let's say, a sports team. You know, there's something from above. There's a. There's an ownership, there's a direction which comes from above. And participating in that, moving towards the championship, manifesting the fruit of this purpose that we're, that we're participating to together is the same as this, as this vineyard. And so these husbandmen or these vinedressers receive the vineyard from above, and they participate in it, and they're going to be able to partake of its fruits, but they don't. The actual ownership of the vineyard is not theirs. As the time of the fruits are drawing near, the vinedresser, the owner of the vineyard, sends his servants. You can imagine them as angels, you can imagine them as messengers from above. Imagine it in a, let's say in a company. The boss of the company sends down messages to see if the workers are doing what they're supposed to, if they're bringing in the profits, and if they're bringing them back, they're giving them to where they're supposed to be within the company, let's say. And so he sends his servants, one by one, they are killed, they're beaten, they. They are rejected, basically. Right? And so what you have is a situation where the, the multiple agents of the vineyard, they want to take the authority for themselves, they want to take the ownership for themselves. And they don't want to recognize that they receive this from above. They want to. They want to be able to just take the fruits of this world without recognizing where the world comes from, without recognizing the thing which binds the world together. The authority, the name, the nation, the team, whatever it is. There's something which binds all this multiplicity together. Now, they don't want to recognize that. And so they get rid of the messengers, they get rid of whatever is coming at some point from above. Things are coming from above. The. They refuse them and they think that it's going to work. And then it says, of course, this parable is ultimately talking about prophets and of course talking about how Christ then comes into the world. The Anointed One comes down the very, let's say, reason why the team itself exists or why the company exists, comes down to manifest itself into the group, into the vineyard, into the company, into the team, or whatever. And then when all these agents see the reason, they basically realize, like, if we get rid of the Logos, if we get rid of the seed, if we get rid of the thing which binds us together, then we can take it for ourselves. Right. I mean, think about it just in terms of a nation. You have a certain unity, and everybody kind of pays taxes towards the central government or whatever it is. And you realize, hey, if I can get rid of the reason why we have to pay these taxes, then everything I get I can just take for myself. Isn't that wonderful? Isn't that great? And so they kill the son who is, and they say will take his inheritance. We'll take the fruits of this world without the reason for this world. But see, that doesn't work that way. You can't do that. Well, you can try, and communists have tried. And, and this is why I'm saying Christianity is not revolutionary in any way, because in this example, you can see what happens when you try to take the fruits of a world and at the same time destroy the order by which the world is actually manifesting itself. And then what happens? Then, of course, the authority, the power to bind this vineyard together will be taken away from them and will be given to someone else, will be given to another group which can hold this world together who can recognize the authority of where the order of their world comes from. And then they will be able to. To gather the fruits in a proper manner and continue to exist as, As a vineyard itself. And so, so you can imagine, like it doesn't say this in the, the. In the parable, but you can imagine that all these different vinedressers, what they're doing to the. The one above them who is, let's say, the authority by which the vine, the vineyard exists, they would then do amongst themselves, right? Because then they take a part of the fruit. They take some fruit, and maybe they have people working for them. Then they start to think, well, if he took the fruit, why wouldn't it be mine? How would you even. Who would decide who would have the authority to manifest the fairness of how things are given when there is absolutely no more authority that comes from above, and it doesn't work that way. And so, of course, then the Christ says, one of the. One of the very mysterious things is that the stone that your builders rejected has become the chief cornerstone. And this was the Lord's doing. And it is marvelous in your eyes. This is, of course, the mystery of. Even you could understand this mystery as something which is happening now. That is that sometimes you don't see the reason for what you're doing right away. You see the reason. You see the unity of a group when the fruits start to appear. And this is a fascinating thing which is being suggested is that Sometimes the seed or sometimes the reason for things manifesting themselves, things emerging in the world actually don't appear until the very end. And the, the end of something manifests its origin and also manifests the reason why it existed in the first place. This is, this is important for people who are interested in, in things like natural selection to understand because people tend to, to think that when we say, let's say that eyes are for seeing, they'll say, oh, that's a post, you know, that's a, that's a something, a meaning which is added afterwards, right? That the, the reason when we say eyes are for seeing in a kind of a natural selection way is just something we add on top of a chaotic situation, of a chaotic selection. But that is actually how the world works, is that the seed usually remains, often remains hidden for a long time. And then suddenly you start. When you see the fruits of something, then you can recognize the seed, you can recognize the meaning. There's a wonderful quote by St. Gregor of Nyssa who says the animal comes first and then comes the spiritual. That in. In a human person, but in anything. Often we see the, the kind of chaotic or the, these phenomena gathering together in a way that at first we're not sure what exactly is happening. And then when the fruits start to appear, then we realize that there was a logos bringing it along. You know, all, all along there was the logos pulling it towards its purpose, even though we couldn't recognize it at the time. And of course, in terms of this particular parable of the, the vineyard, you can, you can understand it very immediately as imagine again, I like using sports analogies, even though I'm not a big sports fan, but they're easy to understand. And so you can imagine that there's a team that. Imagine that all these teams have a goal, have something which is making them united. Let's say hockey players in Canada, they all have something, an authority which is binding them together. And that authority would manifest itself in the capacity to give the Stanley cup to the winning team, right? And so the authorities, they bestow this cup to show who it is that came the closest to the goal. And so if team members amongst one team, they say, well, if we could get rid of this thing, you know, this, this authority that binds us together, this authority, you know, whatever the NHL that's taking massive profits from us or the owner of the team which is making, Taking massive prop. Massive profits from us, if we could just take it for ourselves, then, then we would have way more. Right? Obviously it makes sense but then, of course, if that happens, then the team will actually break apart and cease to function and will no longer have the capacity to even win the Stanley Cup. And so the cup and the authority and the. And the recognition will then fall down, will be. Fall on another chosen team which will then become the ones who are the. The new, let's say the new. The new fruits of this whole enterprise that started in the first place. And so it can give you an idea of how it is that Christianity is not. Doesn't at all present itself as revolutionary, but rather tries to show how things below have to be in order to become the kingdom, in order to participate in those things which come from above. And so I want to now look at the second one, which is as harsh as this first one. And it is the parable of the wedding feast. It is in the Holy Gospel of St. Matthew, chapter 22, starting at verse one. And Jesus answered and spoke to them again by parables and said, the kingdom of heaven is like a certain king who arranged a marriage for his son and sent out his servants to call those who invited to the wedding, and they were not willing to come. Now, first of all, it's important to see, he's saying this is what the kingdom of heaven is. So remember from the Beatitudes the idea of you have heaven above and then you have the kingdom. The kingdom is the extent to which heaven has manifestation in the world, right? It is manifestation gathered together under an authority. That's what a kingdom is. And so this is what he's saying. This is how the kingdom of heaven works. And you'll see that it's actually how all of reality works. And it's actually revealing a very interesting mystery about the Fall itself and how the fall participates in bringing about the kingdom, despite its scandal, let's say. And so you can imagine, now imagine it as a mountain. So the king is in the castle above, and now all the people are down below. Let's say the higher people up on the mountain are people that are higher up in the social hierarchy. So the people that are lower down on the mountain are those that are lower down in the social hierarchy all the way until you get down to the, to the very bottom, right, where you have good and bad people that you can't even discern whether they're good or bad, let's say, at the bottom. And so he sends out his servants and his servants go down the mountain and now start to call people up to go up into the. The. The. Into the wedding feast, which is being held above. So again he sent out other servants saying, tell those who are invited, see, I have prepared my dinner, my oxen and fatted cattle are killed, and all things are ready come to the wedding. But they made light of it and went their ways. One to his own farm, another to his business. So you can imagine now, lower down, the thing which is making people not go up the mountain to the wedding feast is that they are distracted by other gods, right? They are distracted by other points of attention which, although in themselves don't, aren't bad, but they are. If you now attend to your business and you attend to your farm without understanding how all of this is held together by the kingship and the era of the king, then you're going to lose your farm. At some point you're going to lose your business because you, as society fragments, it's just going to be taken over by the outside. And so the first thing they needed to do was to recognize the wedding feast and to recognize this union of heaven and earth. Because that's what a wedding feast is, the union of heaven and earth, which happens at the top of the mountain in the king's castle, is the point by which even their now secondary attentions are able to exist, right? But they don't see that they want to get. They want to pay attention to their secondary things. Now, this is the first level. So imagine you have the purpose, the idea of attending to the feast, then attending to all these different things. And if you just attend to these different things which aren't, which don't recognize the unity of the union of heaven and earth, then after that is actually going to come hostility towards that, that which is above. So the first is distraction, and then lower down on the mountain is hostility. And so it says, and the rest seized his servants, treated them spitefully and killed them. When the king heard about it, he was furious. And so now they rebel against the king. And so the king sends down his armies, it says, and he sent down armies, destroyed those murderers and burned up their city. And so those fruits down on the mountain which are not going to recognize the authority which is above those will be destroyed. And it can look like a harsh, can look like a harsh thing, but this is just the natural process of how any world lays itself out. If you're like, let's use another sports analogy, if you're playing a sport, if you're playing basketball and one player doesn't want to participate in the purpose of the team, then you're going to get rid of that player. You're going to cast them out. You're going to. You're going to eject him from the team because he is a threat to the unity of the team. So here it is, we're seeing the same thing. Those that oppose the messengers of the king which come down from above, they have to be gotten rid of one way or the other, because they're trouble for the unity of the kingdom, because they're opposing that which actually binds it together. But then you can imagine now the servants kind of coming lower, both in this invitation, now in judgment, but always coming lower. So the king continues and says to his servants, the wedding is ready. But those who were invited were not worthy, therefore, go into the highways, and as many as you find invite to the wedding. So those servants went out into the highways and gathered together all whom they found both good and both bad and good. And the wedding hall was filled with guests. So this is already showing us a very mysterious aspect of the Fall. That is, as the Fall happens, God covers the Fall. And so the Fall is actually participating in a kind of salvation of the whole world in a very surprising way, which is that as we move away from the glory of God and fall, then God covers the fall. He covers it both with mercy, but also with judgment. And this continuously is happening as you move lower and lower down into this. This cosmic hierarchy. So now we're out into the highways. We're out into this, you know, let's say you can imagine like the valley or the. The bottom of the mountain where it's all these mixed people that are gathering together, that are crossing each other, that aren't necessarily nations, that are in between spaces. You could say that's what highways are. They're not cities. They're kind of in between spaces. So he destroys these cities that aren't willing to recognize the union of heaven and earth. And now he's in the. In between spaces, and he gathers all these weird people, all the people that are good and bad, all of the different, you know, all the people that are kind of at the bottom of the hierarchy now, they actually end up having an opportunity to. To participate in this. And this is what I told you about. This is kind of one of the amazing things of Christ, is how Christ is filling up the hierarchy, going all the way to the bottom of death and gathering it into God by his story, by the way he's acting, you know, by his message. All of this is what he's doing and in his actions as well. But now here comes the clinch. Here comes the cincher at the end, which is to really show you that this is not a revolutionary movement. This is not, let's say, the people at the bottom of the hierarchy climbing up the mountain and taking what's theirs, you know, you know, getting. Getting what was owed to them, or that kind of, let's say, resentful attitude of those that are below. But it's rather this slow extension of the kingdom as those above refuse it. Even the, let's say the invitation now goes lower and lower to gather everything up through this mysterious to the mystery of the Incarnation, we could say. But then. But when the king came in to see the guests, he saw a man who did not have on a wedding garment. So he said to him, friend, how did you come in here without a wedding garment? And he was speechless. Then the king said to the servants, bind him hand and foot, take him away and cast him into the outer darkness, where there will be weeping and gnashing of teeth. For many are called, but few are chosen. So here is where you understand that even in the Beatitudes, even as Christ extends the invitation of the kingdom of heaven, fills the kingdom of heaven all the way towards the bottom of the mountain, you could say all the way right up to the border of the flood, can become the kingdom of heaven. But nonetheless, that which is gathered in has to have the garments of the wedding, have to manifest the union of heaven and earth, even in this, their lower, lower spheres. And so, yes, Christ calls the taxpayers and the prostitutes and the good and the bad and the thieves and all of these people to gather into the kingdom. But it also means that they have to be somewhat transformed. They have to be transformed in a manner that they wear the garments of the union of heaven and earth at the level where they are. So there's absolutely no revolution. There really is an image of how all of this is to show how Christ fills up the hierarchy of being, and how, yes, those that are below, those that are weak, those that are sick, those that are weeping, they can rejoice because the invitation now has been called all the way down to them. They have a way, they have a manner in which they can participate. And they also even exemplify in their poverty or in their lowliness, how it is we need to be in regards to that which is above, we need to receive from above. But you have to receive from above. You have to manifest the fruits of the kingdom of heaven, or else you will then again, just, just like all the other things that didn't manifest as the invitation was coming down the mountain, they will nonetheless be cast out of this world. And so, of course, this is a. An image of the entire. Of the entire cosmos. But it works once again at the. At every single lower, lower world, let's say, you know, as a world fills up and kind of calls in more and more it for the world to cohere and to exist as a world, those that participate in it nonetheless have to show its colors, have to manifest the fruits of whatever world, whatever team, whatever company that they're participating in. And so I just wanted to go into that a little bit to show you once again how most of the things Christ says are just showing you this pattern of how heaven connects with earth. But there's nothing revolutionary there. There's nothing revolutionary in the way that we understand revolution, the way that we understand the idea that that which is below is somehow owed something from above, or that that which is below needs to take from above and needs to. To. To get rid. But there is a sense in which the pride of those which are higher up on the hierarchy is often what prevents them from acknowledging what it is that binds them together towards the transcendent. And so there is a danger in those that are above, which is to be prideful. And this is one of the things that Christ calls out to. And it's a completely coherent argument. It's a completely coherent argument about how it is that anything works. Think again, once again, about a sports team. The pride of the players, if they are distracted by their own interest, will damage their capacity to participate in a common goal, will damage their capacity to exist as a team and to attain that which is the very reason why they're together. And so I know this might be a little complicated for those who have been following my work for a while, but hopefully for those who have, this will have been just one more example of how Christ fills the hierarchy in a way in which we all have the capacity to participate in a way that shows the particular opportunity of those which are below to manifest this relationship, but not at all in a way which is revolutionary, in the manner in which the moderns understand this kind of revolutionary, resentful moment. And so I hope this has been useful to you. I thank you all for your attention and I'll talk to you very soon. I hope you enjoyed this episode of the Symbolic World. The Symbolic World is edited by Justin Ward, and it is based on a series of videos that you can find on my YouTube channel, Jonathan Pageau's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course, leaving a review on itunes. Everybody knows that's the best way to to get the podcast out there to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon Pageau videos as well, and on subscribestar, all those links you can find on my website or in the show description. So thank you and I will see you soon."}
