{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":0.64,"end":57.4,"speaker":"Fr Andrew Stephen Damick","text":"And there are hundreds of thousands of crosses on this place. And it was a stunning experience to be there was one of these places. As soon as you walk in, you feel like you must be quiet. Just immediately you must be quiet. And as we were walking, you're going to hear this. You're going to hear, hear this on the documentary in a couple of episodes. So Father Ginteros, who is one of the priests, the priest, really, who showed us around almost the whole country, he said as we were walking around, he says, you know, when people place their crosses here, some are happy because they're celebrating something. You know, sometimes they put one because a child was born or baptized or something like that. Sometimes they're sad, they're remembering someone who's departed, or they're praying for something that they're really worrying about. He says walking around here and seeing all the names and all of these languages on these hundreds of thousands of crosses, he says this is almost like hearing what God hears. And as you look around, you see all these prayers that are ascending and you actually can read them."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":69,"end":111.96,"speaker":"Jonathan Pageau","text":"This is Jonathan Peugeot. Welcome to the symbolic world. So, hello, everyone. I am very happy to be here with Father Andrew Damick and Richard Roland. And Father. I always pronounce your name wrong, which, I'm sorry. And I just realized I did it again. But, you know, I love you. And for people that watch the channel, you are used to seeing them here. I feel like we are in some ways partners in crime. Although we're not committing a crime, we're helping to restore a certain way of seeing and a certain way of participating in reality."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":112.05,"end":112.21,"speaker":"Fr Andrew Stephen Damick","text":"And."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":112.44,"end":146.11,"speaker":"Jonathan Pageau","text":"And so Father Andrew and Richard went together on a trip to Lithuania to document, you know, the. The relationship between Orthodoxy and the deep stories that exist in Lithuania. So I am excited. I haven't yet listened to the. To the. The podcast, I have to confess, but I'm excited to. It's called the Wolf on the Cross, An Orthodox Christian pilgrimage in Lithuania. And the first episode is already out. The Wolf. Lithuania before the cross. And so Father Andrew and Richard, I mean, start with Father Andrew. What possessed you to make. To make something like this?"}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":146.91,"end":209.55,"speaker":"Fr Andrew Stephen Damick","text":"There are so many reasons that I went to Lithuania, but for me, probably the first one is that my great grandparents were from there. And so Lithuanian language and culture were not in any way passed down within my family. It was erased essentially, after one in one generation. And so for me, it was a kind of a question mark in my own family's history. And over the last 10, 15 years or so, I'VE been sort of trying to fill in what that question mark means for me. And, you know, one of the things that I discovered along the way is, well, there's actually a seven or 800 year history of Orthodox Christianity in Lithuania. And so that really sort of doubled or tripled my desire to go there and to connect with not just my family's history, but also the story of that place and the story of my brothers and sisters in Christ in that place. And we found it's really fascinating, actually. Yeah, so it started with my great grandparents, but then so many, so many reasons."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":209.55,"end":212.87,"speaker":"Jonathan Pageau","text":"Yeah. So were your ancestors Orthodox or do you know."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":213.75,"end":243.96,"speaker":"Fr Andrew Stephen Damick","text":"So my great grandfather was Catholic and my great grandmother was Lutheran, which is a relatively. A rare thing in Lithuania. Most. Most people are Catholics. But my great grandmother was from a. I think, I'm not certain, actually. She was from a culture that was essentially a German culture in Lithuania that existed for a long time and became Lithuanianized. So her last name was Germanic, but probably was altered in a Lithuanian way. And she always said the Lithuanian was her first language."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":244.6,"end":248.6,"speaker":"Jonathan Pageau","text":"And so Richard, why did you go? What made you want to go on this trip as well?"}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":249.13,"end":462.76,"speaker":"Richard Rohlin","text":"Well, actually, it sort of started as a joke. Father. Father Andrew was like, you know, I'm thinking about going to Lithuania next year. And almost as a joke, I was like, well, let me know, I'll go with you. And you know, then a year later he's like, so I'm going to Lithuania. How serious were you? And so I went along to help make the documentary, carry Father Andrew's bags, that kind of thing. I carry my own bags. But actually, really, I think there were a couple of things. One is, I mean, heck, Europe is where the history is from, you know, and so I've been doing this universal history thing with you, Jonathan, for well over a year now, I think. Actually, I think it's maybe, maybe like two years, like however long since our first video. I don't even know. But we've been doing this thing for a while and. And so this was just an opportunity to kind of go over there. And I've always been interested in the Baltic states in particular and in that culture for a couple of reasons. One is because it's the geographical meeting of east and west, which is the sort of the spiritual and cultural place that I find myself in my life right at this kind of place where east and west come together. Obviously being a Western person, but being a member of the Eastern Orthodox Church and trying to navigate those things and figure some of those things out Lithuania is the actual embodiment of all of that. And also, I don't know, there's a really interesting thing kind of going on in Lithuania that is present, I would say, in Celtic culture, specifically like Celtic Christian culture as well, which is the way in which they were able to kind of integrate their kind of mythical, pagan past and even certain artistic motifs. There's the Celtic cross. You can find Celtic crosses in Ireland from before the time of Christianity. The Celts were already making crosses. Christianity just came along and explained why and the same kind of things going on in Lithuania. So you have the Baltic sun cross, which is this ancient kind of pagan symbol. And when Christianity came along, we said, hey, no problem. Actually this is, you know, crosses are a specialty of ours. Let's put Jesus on it. And now that's probably one of the most recognizably, specifically Lithuanian things. And then, you know, finally, finally it was just an opportunity to kind of go to the, you know, being in the Orthodox Church in America, my particular parish and my particular, you know, the tradition that I'm in within the Orthodox Church is from a very, what used to be called Ruthenian background. Right. But Ruthenia is this land that once encompassed much of what today is modern day Ukraine and Belarus and up into Lithuania proper. And so in that sense, it was kind of a way to go to the lands that my spiritual ancestors, if not my physical ones, as far as I know, I have no Lithuanian ancestors, although it's quite probable some of my ancestors may have invaded Lithuania at some point, but. Or tried, right? Yeah, but it, but it was an opportunity to kind of go to the place where this, where my spiritual ancestors are from. And there's a particular connection to an icon of the Mother of God there that's related to all that, which maybe we'll talk about in a minute. So."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":463.08,"end":467.88,"speaker":"Jonathan Pageau","text":"Wow. So. So you're how many of us nine episodes is that, is that my understanding?"}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":467.88,"end":474.4,"speaker":"Fr Andrew Stephen Damick","text":"That's. That's the current plan is for nine episodes and nine like two hour episodes, basically."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":474.64,"end":485.68,"speaker":"Jonathan Pageau","text":"So you, you discovered a lot of things there. So what, like what, what's the driving force? Like what is the thing that really made you curious and excited?"}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":486.24,"end":616.93,"speaker":"Fr Andrew Stephen Damick","text":"I think there's a lot of pieces of Lithuanian history, including Lithuanian Orthodox history, that are keys really to the history of, of Europe and of the Orthodox Church. Right. So I'll just give a couple of brief examples. One major element of Orthodox Christian history that shaped even a lot of American Orthodox history is what's often referred to as the UNIA and that was. That was the term at the time, you know, so a union between some Orthodox dioceses and the Roman Catholic Church. And this became a turning point in Orthodox history, especially European Orthodox history, where. Well, that took place in what locally they call the commonwealth of two nations, but in English sources, it's usually called the Polish Lithuanian Commonwealth. And the vast majority of that was in lands that either at the time did or shortly before belonged to the Grand Duchy of Lithuania. And so there were Lithuanians, some of whom were Lithuanian speaking and some of whom were Ruthenian speaking, but identified culturally as Lithuanian, or maybe were Polish speaking, but. But identified as Lithuanian, who were deeply involved in the UNIA and many who were deeply involved in resisting the unia. There are saints, Orthodox saints from that period who were involved in resisting the unia. For instance, Saint Athanasius of Brest. The Union is called the Union of Brest, and Brest is a place that was part of the Grand Duchy of Lithuania at the time. So that's one element and connected to that. And this is something that I think probably a lot of American Orthodox Christians are not aware of. You know, we have this common greeting, especially in Orthodox churches that are of Slavic background, where people say, glory to Jesus Christ. Glory forever. Right. Slaviusisu Christo. And I can't remember how to say the other one in. Yeah. So that greeting actually is originally is Lithuanian. So they would say, garba yezui Christoi, Glory to Jesus Christ. And then they would respond with peramjus, Amen, which means forever amen. And this is the way that all Lithuanians greeted each other up to World War II."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":617.97,"end":621.97,"speaker":"Jonathan Pageau","text":"You mean, they would greet each other just like. Yeah, in the street, basically. Wow."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":621.97,"end":623.41,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. This was not a church thing."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":623.41,"end":623.97,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":623.97,"end":675.68,"speaker":"Fr Andrew Stephen Damick","text":"This was just a Lithuania thing. And so when the UNIA happened, that greeting, of course, which was old even by that point. So, you know, this greeting is centuries upon centuries old. It gets into the UNIA because these people just keep living the way they live and greeting each other the way they always did. And then, you know, when many people of. Also this group is called Greek Catholics, even though they're not ethnically Greek or linguistically Greek, when many Greek Catholics immigrate to the United States, they bring that greeting along with them. And of course, many of those converted to Orthodoxy in the early 20th century, late 19th, early 20th century. At the same time, there were groups back in Europe who did the same thing. Formerly Greek Catholic churches became Orthodox again, and the greetings stuck. It's not actually a Russian Orthodox greeting."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":675.92,"end":677.28,"speaker":"Jonathan Pageau","text":"Yeah, it's a Lithuanian."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":677.28,"end":734.74,"speaker":"Fr Andrew Stephen Damick","text":"It is a greeting that comes from Lithuania, but it is part of the Grand Duchy, part of the Polish Lithuanian Commonwealth. And so if you say that to someone in Russia, they may not know how to respond to you because they've never heard that before. Right. So it becomes part of Orthodox Christian culture here in America, but ultimately has its own origins there. There was a moment that we, a Sunday evening where we went to a home in a village there and the parents of the, the wife of one of the priests who was hosting us and he said, now when you meet her parents, if you really want to greet them in a beautiful way that they will recognize as very respectful and very Christian, you should say this. Garba yazui kristoi. And I said, well, what does that mean? And he told me, I was like, wait a minute, I know this greeting. You know, he says, he says, yeah, all Lithuanians said this up until basically Nazis and Soviets invaded and they pushed that out. And then now you get good morning, good day, whatever. Yeah, yeah."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":734.98,"end":756.61,"speaker":"Jonathan Pageau","text":"It's funny because I, it's funny because that we don't have that greeting in, in our parish because it's a French speaking parish. It has a different, maybe a different line. And I remember the first time I, I mean, a few, the few first times I wasn't used to it, right? I'm standing in front of a, of, of a priest and he says, glory to Christ. And I just look at him and, and it's like I'm this idiot that doesn't know how to respond to the greeting, but I learned to in time."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":756.69,"end":757.09,"speaker":"Richard Rohlin","text":"So."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":758.13,"end":768.93,"speaker":"Jonathan Pageau","text":"So Richard, I wanted to ask you in terms of our universal history, so I'm sure you discovered or found ways that the, that Lithuanian culture connects and so we want to hear about that."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":769.17,"end":902.02,"speaker":"Richard Rohlin","text":"Yes. And so Father Andrew has graciously assigned me a lot of the more medieval history portions of the, of the documentary, as well as writing a lot of the legends. One of the interesting things that I think people will enjoy about this documentary, at least Symbolic World folks, is the way in which the, we'll have legends about like the early Lithuanian grand dukes, for instance, and then also the hagiography of the early Lithuanian martyrs, so that you get this in episode one. But those events both happen within a generation of each other. And so when I kind of wrote those legends, wrote that hagiography and the way that we kind of put it together, you get one at the beginning of the episode one, towards the end of the episode, but they're done by the same voice actor, and they're written in the same style. And so the point is actually to kind of show the continuity of. Of time and of history and of the world. From the, you know, the legend of the Iron Wolf, which is this pagan Lithuanian legend about the founding of the city of Vilnius and then a generation later, the passion of the three holy martyrs of Vilnius. And that those two things kind of flows together naturally in a way that shows how. Shows how things like the pagan histories of our past, as well as the stories of the Christianization and specifically the way that that's embodied in the lives of the saints and also in the stories that surround these. These many wonder working icons of the Mother of God that you'll find in Lithuania. The way that these things just form a kind of a continuous stream. So that's one thing that I'm really excited about in the documentary. Another thing that's really interesting is just the way in which the Grand Duchy of Lithuania and then the United Polish Lithuanian Commonwealth turns out to have been very important in a lot of European history in ways that the version of history that many of us grew up with, which was, you know, a little light on the Middle Ages to begin with. And then if you did get anything, it would be mainly from like a French and French and English and English perspective. Right. Specifically about how the English are better than the French."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":902.02,"end":905.9,"speaker":"Jonathan Pageau","text":"That's right. Or in my case. Or in my case, the opposite."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":905.9,"end":918.54,"speaker":"Richard Rohlin","text":"In your case, the opposite, actually, yeah. I mean, this is not related to anything at all. But one day we will do a universal history video about Joan of Arc, who I'm very interested in. But of course, growing up, I was told she was the villain."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":918.94,"end":919.34,"speaker":"Jonathan Pageau","text":"Really?"}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":919.5,"end":921.1,"speaker":"Richard Rohlin","text":"Like, can you believe that?"}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":921.1,"end":924.54,"speaker":"Jonathan Pageau","text":"Yeah, Well, I didn't think that's even possible. How can you think that?"}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":925.02,"end":928.2,"speaker":"Richard Rohlin","text":"First of all, obviously people don't hear from saints and angels."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":928.52,"end":929.76,"speaker":"Jonathan Pageau","text":"Yeah, of course not."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":929.76,"end":985.98,"speaker":"Richard Rohlin","text":"Yeah, that's right. There's that. But also, she was French. So anyway. But that aside, I'll just give another example. That's like a really weird thing. So if you grew up in any kind of like a evangelical fundamentalist sort of reformed kind of that stream, that trajectory, you probably. I mean, like, for instance, the churches I grew up in had a Reformation Day celebration every year. We wouldn't celebrate All Saints Day, you know, don't be crazy. But instead we would celebrate Reformation Day as sort of like a replacement holiday for Halloween, actually celebrated on the same day. Oh, really? Yeah, we'd have a big party, people would dress up, people would Dress up as like famous reformers. And we actually had a girl one year that came in a pickle barrel, which is a specific reference to something happened in the life of Martin Luther. He married this. This. This ex nun by smuggling her out of a convent in a pickle barrel. Yeah. Anyway, wacky times."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":986.22,"end":987.02,"speaker":"Jonathan Pageau","text":"Wacky times."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":987.5,"end":1120.57,"speaker":"Richard Rohlin","text":"Truly wacky stuff. Like if you think about symbolism of everything going on there. But one of the things that we, you know, they would do is they talk about all the, like, the early sort of people they consider to be proto reformers, among whom was an important Hungarian religious leader named Jan Hus. John Huss in English, by the way. Jan Hus, not a. Not a Protestant. The big thing that he was kind of fighting for was for. We'll probably talk about him in Universal History at some point too, because he's really interesting. But the bit. One of the big things that he was fighting for was for the. The reception of the Eucharist in both kinds. And in fact, the Hussite fashion that the Hussite faction, who was really a stickler for this, were called the Utraquests, you know, from the Latin, like, meaning both kinds. Right. So at this point in Western Europe, it was common practice to only commune people in the body and not in the blood, and only once a year. And this is actually the main beef that the Hussites had. So, you know, they weren't quite Baptist, you could say, but. So anyway. But the Hussites were not just a religious movement, they were a major political movement. And what most people do not know, I didn't actually know this until very recently as I was researching stuff for the second episode, is that they wanted their own kingdom and they wanted their own king. And so they actually invited the Grand Grand Duke Vitotas, who was the. You know, the. He's called Vitotas the Great. He's one of the main people who really tried, centuries before the unia, he really tried to see if he could unite Eastern and Western Christianity. He's a very interesting figure, but they actually invited him to. The Hussites actually invited him to be their king, you know, because they wanted to have a Christian Catholic king over them, but not the king of Hungary, who they weren't getting along with at the time. So anyway, all of this stuff is just hugely interesting. And a lot of the major political figures that show up, especially in the history of the 14th and 15th century in the Grand Duchy of Lithuania and Poland, eventually, Kingdom of Poland, eventually become married into or involved in all of the most important dynastic. Struggles that happened in the late Middle Ages."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":1121.18,"end":1131.58,"speaker":"Jonathan Pageau","text":"So Lithuania has, although we don't know much about it, it has a strong, like, it just has a strong presence or kind of invisible presence to us in the history of Europe."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":1131.58,"end":1147.58,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And I think the reason why, there's probably several reasons, but I think one of the big reasons why that's the case is because at the end of the 18th century, the Polish Lithuanian Commonwealth gets divided up between three different empires and Poland and Lithuania, as separate countries cease to exist."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":1148.55,"end":1148.71,"speaker":"Richard Rohlin","text":"Right."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":1148.71,"end":1153.27,"speaker":"Fr Andrew Stephen Damick","text":"So you get the Russian Empire takes a chunk and gets Lithuania basically."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":1153.59,"end":1154.07,"speaker":"Richard Rohlin","text":"Yeah."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":1154.55,"end":1212.08,"speaker":"Fr Andrew Stephen Damick","text":"The Prussians and then the Austro Hungarian Empire, they each get their own chunks. And so one of the things that we get as a result, especially as Orthodox Christians living in North America, is the conversation about Orthodox Christians who lived in those lands is largely from the point of view of Russia, who kind of subsumed that region at the end of the 18th century and had been kind of in competition with it for a while up to that. And so as a result, the point of view of people who lived in that area is largely, largely gone and sometimes is kind of denigrated as being like a peasant culture or whatever. Like another example is, for instance, is the practice of Holy Supper, which is very common amongst many Orthodox Christians that they do on Christmas Eve. Holy Supper was. Is a practice of the former Polish Lithuanian Commonwealth celebrated by Catholics, by Orthodox, by Protestants, and still to this day. And if you were to sort of draw a map of Eastern Europe and put dots where everybody's celebrating Holy Supper, you would essentially see a map of."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":1212.08,"end":1241.22,"speaker":"Richard Rohlin","text":"The Polish Lithuanian Commonwealth conversation over Christmas with somebody who is Polish Catholic by just, you know, culturally, he's not practicing or anything, but he says, oh yes, well, we Poles, we celebrate Christmas actually on Christmas Eve. And what he was talking about was Holy Supper, like, that's the Christmas celebration. You know, we don't actually do anything on Christmas Day. And I was like, well, that's not exactly correct, but. But it's just like that memory of the Holy Supper was, you know, like, still very, very potent for him."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":1241.22,"end":1242.26,"speaker":"Jonathan Pageau","text":"Yeah, that's interesting."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":1242.26,"end":1242.78,"speaker":"Richard Rohlin","text":"I didn't."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":1242.78,"end":1260.74,"speaker":"Jonathan Pageau","text":"It's funny because my wife is from Slovakia and she says that Christmas is the 24th. And I'm like, Christmas is not the 24th is 25th. Well, in my country we celebrate it on the 24th. I'm like, I was saying it's Christmas Eve, you're celebrating Christmas. We have this fight, like for 20 something, you know, 24 years, you've had this fight over When Christmas actually is."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":1261.21,"end":1271.01,"speaker":"Fr Andrew Stephen Damick","text":"Probably doing something at home with her family, having to do with a particular meal the night before. And it was like a special. That area was part of this commonwealth."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":1271.01,"end":1272.17,"speaker":"Jonathan Pageau","text":"That's super interesting."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":1272.57,"end":1278.89,"speaker":"Fr Andrew Stephen Damick","text":"So. So it's almost like Lithuania is a kind of Easter egg, especially for Orthodox Christians, kind of hidden in everything."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":1279.29,"end":1279.85,"speaker":"Richard Rohlin","text":"Yeah."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":1280.17,"end":1287.13,"speaker":"Jonathan Pageau","text":"You know, what is the state of the. What is the state, let's say, of. Of Orthodoxy today in Lithuania? What is it? What did you find there?"}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":1288.19,"end":1325.91,"speaker":"Fr Andrew Stephen Damick","text":"So there is a Russian diocese, Russian Orthodox diocese of Lithuania right now. And this diocese arises really in the 19th century with a whole bunch of Greek Catholics becoming Orthodox, which from one point of view was a sort of a mass conversion movement, from another point of view involved a lot of government pressure. Both are probably true at the same time. So that's the origin of the modern diocese. There are about 50 or 60 parishes in the country. Somewhere around 100,000 or so people identify themselves as being Orthodox Christians, but only about 2 or 3,000 are actually in church on a regular basis."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":1326.07,"end":1326.63,"speaker":"Jonathan Pageau","text":"Okay."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":1327.75,"end":1353.86,"speaker":"Fr Andrew Stephen Damick","text":"But there are a number of centuries old churches there and some incredible shrines. For instance, the reliquary of the three Martyrs of Vilnius in the Holy Spirit Monastery. Their relics have been incorrupt for 675 years. And we actually came home with relics of these three martyrs. So if anyone's in Eastern Pennsylvania, come to Emmaus and you can venerate probably the only relics of these saints on the continent. Very likely."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":1354.98,"end":1368.34,"speaker":"Jonathan Pageau","text":"And so what about, what about the. Are there traces of the Greek Catholic or the, the. The Orthodox? Let's say a smell of Orthodoxy in Lithuanian Catholicism still, or has it been completely subsumed by."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":1369.29,"end":1378.33,"speaker":"Fr Andrew Stephen Damick","text":"As a matter of fact, yes. Probably the most obvious way is that they have. There are a number of the wonder working icons of Lithuania which are in Catholic hands."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":1378.33,"end":1378.65,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":1378.65,"end":1398.61,"speaker":"Fr Andrew Stephen Damick","text":"But you look at it, it's an Orthodox icon and it's often mounted up behind a Catholic altar. And they're venerated by both Orthodox and Catholics. And one of them, which of course is the one that I know Richard is itching to talk about, Our lady of the Gate of the dawn actually has a feast day on the Orthodox calendar, and that's the day after Christmas."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":1398.61,"end":1401.73,"speaker":"Richard Rohlin","text":"So I have prepared some visual aids. Father Andrew, one moment."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":1401.97,"end":1406.45,"speaker":"Fr Andrew Stephen Damick","text":"So Our lady of the Gate of the dawn, while Richard is fetching whatever he's getting, I'm sure he has a copy of it."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":1406.45,"end":1407.09,"speaker":"Jonathan Pageau","text":"Yeah, I'm sure."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":1407.33,"end":1432.3,"speaker":"Fr Andrew Stephen Damick","text":"Is. Is sort of the national icon of Lithuania and it is in a gate so you can walk through the gate, and then up above the gate, there's a chapel. And that chapel hosts the icon. And it is a stunning icon. It is an icon of the Mother of God, essentially, as she's described, or as the church is described, because we know these are basically the same thing in Revelation, chapter 12, a woman clothed in the sun with the moon beneath her feet."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":1432.3,"end":1434.02,"speaker":"Jonathan Pageau","text":"Oh, yeah, I know that icon, of course."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":1434.1,"end":1437.14,"speaker":"Fr Andrew Stephen Damick","text":"Crowned with 12 stars. This is. This is Lithuania."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":1437.14,"end":1440.26,"speaker":"Jonathan Pageau","text":"This is. Yes, yes, yes, yes, yes, yes."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":1440.34,"end":1453.16,"speaker":"Richard Rohlin","text":"Wow. So this particular icon, which first shows up in Vilnius in maybe the 13th or 14th century, very old, probably, you know, from somewhere in the east, but nobody really knows for sure."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":1453.64,"end":1454.04,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":1454.76,"end":1485.04,"speaker":"Richard Rohlin","text":"It's put over the Dawn Gate of the city of Vilnius to protect it from invaders. And the Dawn Gate is one of the few of the original medieval gates, I think the only one of illness, which still stands to this day. And so there's a beautiful chapel up on top of the gate now where you can go and see the icon and venerate it. The actual thing is huge. Oh, it's the size of, like, a wall. I mean, really massive. And of course, then it has this beautiful. Or. I mean, it has this. This, like this sort of like the silver Riza over it."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":1485.12,"end":1485.44,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":1485.44,"end":1488.68,"speaker":"Richard Rohlin","text":"But it's. But yeah, the original icon is massive."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":1488.68,"end":1493.12,"speaker":"Fr Andrew Stephen Damick","text":"I mean, it's probably five feet across, maybe maybe six feet tall."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":1493.44,"end":1494.8,"speaker":"Richard Rohlin","text":"That's about right. Yeah."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":1494.8,"end":1501.2,"speaker":"Jonathan Pageau","text":"And so is. It is the Reza. It's like the image you showed us. Is that what you see? Or is there another Riza on top of it?"}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":1501.68,"end":1513.12,"speaker":"Richard Rohlin","text":"This is like a kind of, you know, just like a printing with like, kind of a. Like gold foil or whatever over it. So the reason covers actually pretty much everything but the face, I think."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":1513.12,"end":1514.36,"speaker":"Jonathan Pageau","text":"Oh, not even the hands."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":1514.36,"end":1516.32,"speaker":"Fr Andrew Stephen Damick","text":"It covers the hands."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":1516.64,"end":1561.73,"speaker":"Richard Rohlin","text":"Doesn't cover the hands yet. Doesn't cover the hands. But if you look at the original version of the icon, which is under the Riza, which, I mean, you can find pictures of this online, you'll notice if you're an Eastern Orthodox Christian, especially in the kind of the Slavic tradition in North America, you'll notice that it bears a deep similarity to an icon which St. Seraphim of Sarov had in his cell. So this is a copy of that icon, and you can see it's basically the same image. It shows the Mother of God. There's no moon here, but it shows the Mother of God with her hands folded over her chest. Yep. In St. Seraphim's icon, there is wording as there is in this One in the halo around the Mother of God's head. That in Slavonic is the refrain from the Akathis hymn, Rejoice O and wedded bride."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":1561.97,"end":1603.04,"speaker":"Fr Andrew Stephen Damick","text":"So, you know, the icon became very popular, especially throughout the whole Grand Duchy of Lithuania, the Polish Lithuanian Commonwealth. And so many copies were made. And it's generally believed that when St. Seraphim, I think, visited Kyiv at one point, that he was given a copy while he was there. And so this is another, like I said, a kind of another Lithuanian Easter egg that exists for Orthodox Christians. And, you know, Saint Seraphim, in many icons is actually depicted praying in front of an icon while he's kneeling on the rock. There's an icon sometimes in a cell, sometimes nailed to a tree, and it's. If you look closely, it is Our lady of the Gate of the Dawn. Like there's just no question. Yes. Is that icon."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":1603.12,"end":1625.1,"speaker":"Richard Rohlin","text":"So the icon itself is quite unusual in terms of Eastern icons. Most Eastern icons of the Mother of God show her holding the child. Yeah. And of course, the. The kind of lore that's grown up around this icon in this Slavic tradition is that it depicts the Mother of God at the moment of the Annunciation with her sort of her hands folded on her chest in prayer, her head bowed. She's giving her assent."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":1625.5,"end":1629.98,"speaker":"Jonathan Pageau","text":"Yeah, that makes sense. I mean, it does look like the pose that she takes in the Annunciation icon, right?"}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":1629.98,"end":1654.59,"speaker":"Richard Rohlin","text":"Yes. And so. But the kind of. The story about how Saint Seraphim got that particular icon is that when he was. When he was a young man, before he was Seraphim or a saint, he. He went to the. The Kiev Lavra, the great lava Kiev, to get a blessing to become a monk. And he goes there, and the elder there. Do you remember her. Her name, Father Andrew?"}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":1654.59,"end":1655.55,"speaker":"Fr Andrew Stephen Damick","text":"No, I don't."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":1655.55,"end":1656.03,"speaker":"Richard Rohlin","text":"Oh."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":1656.11,"end":1658.23,"speaker":"Fr Andrew Stephen Damick","text":"But I'm sure you'll tell the story in the documentary."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":1658.23,"end":1660.67,"speaker":"Richard Rohlin","text":"I will tell the story in the documentary and people can."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":1660.75,"end":1663.47,"speaker":"Jonathan Pageau","text":"We'll get the name for the full version. We'll watch the documentary."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":1663.47,"end":1756.2,"speaker":"Richard Rohlin","text":"I'm spacing out right now, but the whole. The elder there at the. At the Kiev Lavra at the time was one of these saints who is a woman who disguised herself as a man and became a monk and is living in the cell there at the Lavra. So at the time it was he. People didn't find out until after her death. Yeah, but so Saint Seraphim goes to this woman. She's from a kind of a noble family with connections to Belarus, which is where this particular icon Our lady of the Gate of the dawn is very popular and very revered and so it seems. And this has been the theory of a couple of historians of iconography that I've talked to about this. The theory is that since Seraphim probably was given this icon by this, this Holy Elder when he was at the Kiev Lavra and got a blessing to go to Sarov and become a monk and probably brought it with him from there. And so, and so it's got this kind of deep connection. Of course, St. Seraphim is the, as the patron saint of my parish, but also my own personal patron saint. And so this particular icon has been, you know, as you can see, many years ago I actually, even before I was Orthodox, I commissioned this copy of it from an iconographer in St. Petersburg. And it's been, you know, kind of, you know, definitely my favorite icon of the Mother of God and really personally significant to my life and my prayer life. So, you know, for me going to see the icon of Our lady of the Gate of the dawn, this was."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":1756.2,"end":1766.64,"speaker":"Fr Andrew Stephen Damick","text":"A, was a big deal and it's extremely beloved throughout Lithuania. Every single Catholic church you go to and every single Orthodox church you go to has a copy somewhere."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":1767.76,"end":1787.05,"speaker":"Richard Rohlin","text":"We were told even, although there's only maybe you know, a very small handful of Protestant churches in Lithuania, but we were told that, you know, even in some of those you can see, I guess the only two Protestant churches we went into while we were there didn't have one up. But we were told that even, especially like Lutheran parishes often will have one up."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":1787.05,"end":1800.17,"speaker":"Fr Andrew Stephen Damick","text":"And if you go to Lithuanian cemeteries, which are a fascinating place to begin with, you will see this icon on many tombstones. I mean she's just everywhere in Lithuania, everywhere."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":1800.57,"end":1824.39,"speaker":"Richard Rohlin","text":"So if we wanted to actually talk about two things real quick that I think if you want to say like, are important to me to kind of the symbolism of Lithuania and that people will be hearing about more in the documentary. One thing would be the cemeteries. And the other thing that I would really like to talk about is the, is the sort of weird in many ways kind of abortive attempt to reconstruct Baltic paganism in Lithuania."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":1825.11,"end":1827.07,"speaker":"Jonathan Pageau","text":"That's happening now, let's say that's been happening."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":1827.07,"end":1851.25,"speaker":"Fr Andrew Stephen Damick","text":"That's right. Yeah. There's a neo pagan movement there called Romova, which is surprise. It's, it's. And what they do is they take. So, so just as with almost any paganism, European paganism, there are no sources, there are no first hand sources from actual Baltic pagans. Instead, what you get is stuff that survived in folklore. A lot of weird syncretistic stuff."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":1851.49,"end":1853.81,"speaker":"Jonathan Pageau","text":"Yeah, A bunch of mushrooms and Jung."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":1854.37,"end":1855.57,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. Exactly."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":1855.57,"end":1856.41,"speaker":"Jonathan Pageau","text":"Modern paganism."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":1856.41,"end":1860.29,"speaker":"Fr Andrew Stephen Damick","text":"And in their case, often they would mix in stuff from Hinduism."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":1861.11,"end":1861.35,"speaker":"Jonathan Pageau","text":"Really?"}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":1862.07,"end":1869.51,"speaker":"Fr Andrew Stephen Damick","text":"Yes, because both Indian culture and Lithuanian culture are Indo European cultures."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":1869.99,"end":1871.67,"speaker":"Jonathan Pageau","text":"Oh, yeah. So that's stretching it."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":1873.03,"end":1898.99,"speaker":"Fr Andrew Stephen Damick","text":"Well, there's a linguistic connection between the two. So Lithuanian is actually one of the most archaic Indo European languages. And so as a result, many people have seen lots and lots of very obvious cognates with Sanskrit. And so as a result, then there's this kind of feeling like, well, the ancient Indians, the ancient Lithuanians were kind of maybe sort of doing the same thing religiously, which is just hilarious. Yeah, it is pretty hilarious."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":1898.99,"end":1901.19,"speaker":"Jonathan Pageau","text":"How many thousands of years are we talking about here?"}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":1901.35,"end":1901.91,"speaker":"Fr Andrew Stephen Damick","text":"A lot."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":1902.15,"end":1905.03,"speaker":"Jonathan Pageau","text":"Yeah, a lot of thousands of years. Wow, that's. That's wild."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":1905.19,"end":1923.84,"speaker":"Fr Andrew Stephen Damick","text":"But I mean, most of the way that Lithuanian paganism has kind of survived in Lithuania is not through this Neopagan movement, which is only just a few thousand people at best. Okay. But rather it's the survival of legends that have become, if not explicitly Christianized. They have become Christian friendly."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":1925.36,"end":1928.64,"speaker":"Richard Rohlin","text":"Basically mythology turning into fairy tales."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":1929.04,"end":1953.91,"speaker":"Fr Andrew Stephen Damick","text":"Right. Yeah, exactly. Like a great example, and you'll hear this in the first episode, is the Legend of the Iron Wolf, which is a pagan story happening with pagans and includes a pagan priest interpreting a pagan duke's dream. Right. And yet in very Christian Lithuania, the iron wolf is everywhere in Vilnius. It's one of the symbols of the armed forces. But there's no sense of syncretism to it at all. The sort of. The fangs of paganism have been completely removed."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":1954.79,"end":1987,"speaker":"Jonathan Pageau","text":"Yeah. But I mean, that's what Richard and I have been exploring for the past several months, that you see the same in Byzantine culture. They had kept the Greek plays, they had kept Homer. They would read these. It was part of their kind of common imagery, common culture. But. But there was a hierarchy. And that's. I think that's. That's the way to understand it, that there's. There's a proper hierarchy. These stories can often survive as kind of, you know, as folk and common things that we hold in common."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":1987.4,"end":1992.28,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I know. Richard, you were going to mention cemeteries. This is something that I think is really worth talking about."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":1992.28,"end":2010.83,"speaker":"Richard Rohlin","text":"Yeah, yeah. So I'll come to that in a second. I want to. I do want to share, like, one little detail. I'm going to actually share one of the things that Father Andrew wasn't there for. Oh, it's true. Yeah. So we Went. We went out to. During the trip, we went out to the city of Kaunas, which is up near the. The Baltic."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":2011.07,"end":2012.39,"speaker":"Fr Andrew Stephen Damick","text":"Are you thinking of Klaipitera?"}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":2012.39,"end":2014.35,"speaker":"Richard Rohlin","text":"Klaipiter. I don't know why I said Kaunas."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":2014.51,"end":2015.91,"speaker":"Fr Andrew Stephen Damick","text":"Konas is in the middle. Yeah."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":2015.91,"end":2022.15,"speaker":"Richard Rohlin","text":"I've been. I've been just, like, looking at these names while I write this episode until my. My eyes get crossed. Yes, thank you."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":2022.15,"end":2024.47,"speaker":"Fr Andrew Stephen Damick","text":"All these names that start with K. It's true. There's a bunch."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":2024.47,"end":2097.82,"speaker":"Richard Rohlin","text":"So we went up to Klaipida, which is a city there by the Baltic, and then one. And then took a ferry across to this long spit of land that's actually made up of a number of dunes, what are called parabolic dunes. They basically giant sand dunes that get up and walk every once in a while. And in fact, the ones on. On this. This. This land formation called the Cronin Spit, they're actually. Some of them are named after, like, the villages that they have swallowed, you know, over the centuries, which is pretty awesome and really beautiful place. I mean, truly one of the most beautiful places I've ever been in my life. One of the interesting things about it was the, you know, we went to a place there called the Hill of Witches. So the Hill of Witches was one of these things that was kind of bought and paid for by the Soviets as like a way of trying to undermine Catholicism. Lithuania, more or less. Okay, right. So basically it's this hill and these trails, like these hiking trails, and you go up and the word that's being translated as witch in English really means, like. It can mean like fairy, but also like demon or imp or something like this."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":2097.82,"end":2100.58,"speaker":"Fr Andrew Stephen Damick","text":"But it's basically mythological folklore. Figures."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":2100.58,"end":2104.02,"speaker":"Richard Rohlin","text":"Yeah. Figure, like. Yeah, a character from folklore."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":2104.02,"end":2104.46,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":2104.46,"end":2119.64,"speaker":"Richard Rohlin","text":"And. And so they. There are these sort of like, carvings, statues of all these different figures done in kind of a traditional Lithuanian mode. And so these aren't. I mean, they're not objects of worship. There aren't. You know, nobody comes up there and offers sacrifices."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":2119.8,"end":2122.68,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. There's no altars up there. Yeah, yeah."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":2122.68,"end":2140.92,"speaker":"Richard Rohlin","text":"But it definitely felt like this very sort of weird. This weird kind of wild, liminal sort of a space. And so we had a great time hiking and everything. And then Father Andrew, I think, went back to the hotel and did you go back to the hotel or did you just go somewhere to rest?"}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":2140.92,"end":2146.78,"speaker":"Fr Andrew Stephen Damick","text":"So we went to that hill together. It was the day before that you went somewhere else on the spit, if."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":2146.78,"end":2159.7,"speaker":"Richard Rohlin","text":"I recall, or maybe the day after. But. But in any case. In any case, I think it was the day after. Because we went the next morning we got up, we went swimming in the sea. And then. And then we took this. No, maybe it was after."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":2159.86,"end":2161.14,"speaker":"Fr Andrew Stephen Damick","text":"Anyway, it's okay."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":2161.38,"end":2162.74,"speaker":"Richard Rohlin","text":"I was very jet lagged at that point."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":2162.74,"end":2166.42,"speaker":"Fr Andrew Stephen Damick","text":"We were very liminal space. You can't begin to remember things as they happened."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":2166.66,"end":2241.04,"speaker":"Richard Rohlin","text":"So it was really interesting because we. It was the evening. It was the evening and we were making our way on this long hike up to the top of the dunes. So you can hike up to the top of the dunes and look over them over the border into Kaliningrad, which is technically part of Russia, the Kaliningrad Oblast. And it's funny because I was in an airport a couple months ago, but I was telling somebody about the crony and spit just like a random person in the airport because this is what it's like to travel with me. And this, this girl turns around and her eyes get real big and she says, I'm from Kaliningrad. It's like nobody knows about this. Anyway, it was, it was, it was kind of a neat meeting. But anyway, so we're hiking up these dunes and I mean, really beautiful, kind of a silent forest. So it's all on sand. And you know how like after a snowfall everything is kind of hushed because the snow is kind of sucking up all the sound. Exactly like that. But no snow. Yeah. So there's this hush. All you can really hear is the crunch of the sand under your feet. You're in this pine forest. I told somebody, you know, if a. If a white stag ran across the path right now, I would not be surprised."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":2241.04,"end":2241.52,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":2241.84,"end":2276.07,"speaker":"Richard Rohlin","text":"So we make it up to the top of the dunes. Actually, while we're hiking up, there's like somebody like some, some neo pagan group somewhere in the woods is like, they're, they're doing something right. And so they're, they're beating drums. And like the drums are like the only thing you can hear in the forest. And you know, it's way off in the distance. It was very eerie. And we made it up to the top of the dunes and they have this. They built this massive sundial at the top of the largest dune there. And the sundial is. It's weird because it uses a bunch of Norse runes which are maybe not quite, you know, which are appropriate."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":2276.87,"end":2280.06,"speaker":"Jonathan Pageau","text":"Yeah, maybe for Lithuania, all paganism is runes."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":2280.14,"end":2283.34,"speaker":"Fr Andrew Stephen Damick","text":"I mean, I know there's Norse people right across the Baltic Sea."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":2283.34,"end":2287.66,"speaker":"Richard Rohlin","text":"Well, I know there certainly were, you know, Norse people in Lithuania at various points."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":2287.66,"end":2287.98,"speaker":"Fr Andrew Stephen Damick","text":"But."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":2287.98,"end":2335.94,"speaker":"Richard Rohlin","text":"But I mean, this wasn't being done to make historical reference. They were trying to do this to make it a little seem like sort of like vaguely neo. Neo pagan massive sundial up at the top of the dunes. So it was a very interesting place. And I'm, I'm, you know, as we're getting, getting towards that part of the documentary, I'm still kind of like mulling over the experience there because in what is overwhelmingly, you know, a Christian place, right. There is. There are these like little bits of, I don't know how to say, like fairies hanging out in the corners. Right. In a, in a. Usually in a, I think in a pretty harmless way, but, you know, just connecting this to some of the other universal history discussions that we've had. And I know there are other places in the world that are like this as well, but it was really strange and at times very intense to kind of come into contact with this."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":2336.26,"end":2336.54,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":2336.54,"end":2365.15,"speaker":"Richard Rohlin","text":"Yeah, the other thing that we'll mention real quick were the, the graveyards, which were absolutely incredible here in the US I don't know how things are in Canada land, but here in the US graveyards are just sort of like mass produced rows on rows of headstones. They're all the same. There's nothing really particularly beautiful or sacred about him. It's more like how can we pack as many people into these spaces as efficiently as possible?"}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":2365.79,"end":2370.27,"speaker":"Fr Andrew Stephen Damick","text":"And I think the further you get away from the east coast, the more that seems to be the case."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":2370.27,"end":2371.55,"speaker":"Richard Rohlin","text":"Yeah, I think you're right."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":2371.55,"end":2377.79,"speaker":"Fr Andrew Stephen Damick","text":"We have some good old cemeteries here in Emmaus, Pennsylvania, but still they do not compare to Lithuanian cemeteries."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":2377.87,"end":2399.82,"speaker":"Richard Rohlin","text":"If you go out into the countryside, even here in Texas, go out to East Texas, which is where I'm from, there are some nice old church graveyards, but generally speaking, there are a bunch of generic Restland, flower land, you know, accepting land. Right, yeah. And just like seas and seas of indistinguishable headstones."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":2399.98,"end":2501.25,"speaker":"Fr Andrew Stephen Damick","text":"And when we were in Lithuania, we ended up peering over the wall of a couple of cemeteries. But there's one in particular that we went to and we scoured it and that's because we went to the hometown of my great grandfather, which is called Kodirkus Nomistis, which is way on the western edge of Lithuania, right next to the Russian part, the Kaliningrada Oblast, which traditionally, by the way, that land, that oblast that belongs to Russia now it's disconnected from the main body of Russia. Traditionally that's called Lithuania Minor. So it belonged to Lithuania back in the day at various points in history. So Kodiuchus Nomesis is right up against that border and there's a little river that separates the two. And we started walking through that cemetery, which, thank God is not a huge cemetery. And we were looking for my ancestors because I knew that a bunch had been buried there. I found records indicating that, but I, I didn't know exactly where. And after some time, you know, thank goodness we had someone along with us who read Lithuanian who was able to say, this one says, so my family's name. You know, this is funny, you began by mispronouncing my name. If I, if my great grandfather left it alone, you might find it easier to say Domica. Domica is our traditional name. And so the, the priest who is guiding us that day, Father Vladimir, he pointed at one particular one. He says, this says of the Domica family on it here in Lithuanian. He said, this is it. And it is literally the place that my ancestors are. Were buried for generations. And no one in my, no one in my family, the American branch of my family had been back in almost a hundred years. Yeah."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":2501.57,"end":2510.73,"speaker":"Jonathan Pageau","text":"So are these, were they stone monuments or were they these wooden crosses that we see? Like this image we have in Lithuania of like these wooden, wooden crosses and stuff."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":2510.73,"end":2512.33,"speaker":"Fr Andrew Stephen Damick","text":"We should talk about the wooden crosses in a second."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":2512.33,"end":2615.9,"speaker":"Richard Rohlin","text":"We will come to that in a second. Yeah, yeah. But no, these are stone for the most part. There were, I guess, a few wooden grave markers, like really old traditional ones. And in fact, one of the places we went to when we were on the Cronian Spit was to the. We went to the house of Thomas Mann, a famous German novelist, actually one of my favorite writers. He wrote a really interesting novel on the life of Joseph called the Young Joseph or Joseph and His Brothers. Super interesting, worth reading. But he wrote that novel while he was living on this house, this really beautiful old kind of traditional German house that there were a lot of Germans who kind of settled in that particular part of Lithuania along the Baltic. And so we went to his house. And then after we went to his house, there was a nearby Lutheran church. And so we went, we looked at that. And then this is part. Father Andrew wasn't there for, I think. And then we went to this old Lithuanian graveyard, Lutheran Lithuanian graveyard in this case, but really old fashioned in that all of that the markers were these wooden crosses. But there would be different kinds of crosses depending on who the person was and how old they were. If you sort of knew like how to read the crosses, you could say this kind of cross for somebody who died when they were young, this kind of cross for a mother, etc. And actually we found, we found the grave graves of two Orthodox Christians in that graveyard while we were kind of looking around. So they died there and were buried there some time ago. But, but most of the grave markers were. Were stone in most of the cemeteries. Almost all of them. I wouldn't say almost all, but I'd say a good third, if not half, had this icon. Wow. On it. Yeah. Wow. Yeah."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":2615.9,"end":2666.06,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And one thing that really makes a Lithuanian grave different from most of the ones you see in North America, and you see some in North America like this, but almost all of them in Lithuania are like this, is that the grave plot is outlined usually in stones or sometimes cement, you know, to mark the border of it. And then inside that border there is basically a small garden planted with lots of flowers and so forth. And so when you walk through it, instead of the graveyard being essentially taken care of by some company that owns the place and mows the lawn, every single grave is immaculately cared for by family members. And Lithuanians will visit the graves of their family at least twice every year, no matter where they live in the country. Now, fortunately, you can get from one corner of the country to the farthest away corner in about three and a half hours."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":2666.14,"end":2666.62,"speaker":"Richard Rohlin","text":"Yeah."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":2666.7,"end":2700.19,"speaker":"Fr Andrew Stephen Damick","text":"So it's not hard, you know, to, to, to do it, but. But they will go twice a year. So they will go on the anniversary of that person's death and make sure that the grave is very well taken care of. And they also will go around November 1st and 2nd, which is sort of a two day holiday that they call Vellanes, which is connected, of course, to the Catholic All Saints and All Souls Day. And if you go especially on those days, you will see that there are candles on every single grave. And so it's almost like there's a second city. You know, there's the one city where the living are and then there's this other city where the dead are."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":2700.27,"end":2700.75,"speaker":"Richard Rohlin","text":"Wow."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":2701.23,"end":2717.76,"speaker":"Fr Andrew Stephen Damick","text":"And it is a very, very serious time for Lithuanians, for Velinus. And it's considered to be a stain on your family. If the graves of your family are neglected. Like, it's a big shame. You don't let that happen."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":2718.64,"end":2725.56,"speaker":"Jonathan Pageau","text":"So, Father Andrew, what do you hope to accomplish, like, with this documentary? What is it that you were. What is it that you want to bring to the world?"}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":2725.56,"end":2949.07,"speaker":"Fr Andrew Stephen Damick","text":"I guess, number one, a bunch of stories that people have never heard that I think are going to be not just fascinating and entertaining in some cases, but I hope Edifying. One of the ways that I know how stuff that I make is, is being received by the. Is by the email that we get. And I tell people that with Aman Seoul, which is the podcast that Richard and I do together, we get the longest emails. So Tolkien fanatics, you know, sending us long, multi paragraph emails, you know, and then, and then with Lord of Spirits, which I do with Father Stephen DeYoung, we get the weirdest emails. Deeply, deeply weird. Many of them, not all. Yeah, but deeply. But with the Wolf on the Cross, we get the most heartfelt emails. And it's been really interesting to me to see that because I thought, okay, well, I care deeply about these stories. Will anyone else, you know? And I've heard actually from a bunch of Lithuanian Americans, including some Orthodox clergy, saying that they were in tears listening to what we were talking about. But even people with no Lithuanian heritage at all saying, I've never heard this before and why did no one ever tell me? And especially they were struck by the story of the Three Martyrs of Vilnius, which is just such a powerful, powerful story. And if you listen that first episode, number one, Richard's writing is top notch. So good job, Richard, in writing that story. And then we also hired a voice actor named Brandon Talley, and his performance is top notch. And one of the things you'll also hear, this documentary is very different from every other ancient faith radio podcast, particularly not just in terms of the content, but also the production value. So not only are you going to hear, you know, the two of us telling stories and doing narration, but you're also going to hear lots of interviews that we recorded on site while we were in Lithuania. You're going to hear voice actors, you're going to hear ambient music that is appropriate to whatever the story that's being told. So, for instance, during the hagiography of the Three Holy Martyrs, you're going to hear this very epic, adventurous sounding music because it's an epic tale, but also even there's sound effects, right? So like, we tell stories about battles and you hear battle sounds, you know, in connect with us. And honestly, there is, as far as I'm, as far as I know, there is no other Orthodox Christian media in English podcasts like this with this kind of production work. And so my hope is that people will feel that they are there with us, that they are taking the trip with us, that they're on the pilgrimage with us. Like another great example, we talked about crosses. There's a very famous place there called the Hill of Crosses, where people go on pilgrimage, and they bring across all along their pilgrimage, and then when they get there, they place it and they will write the names of people on that cross that they want to pray for. And there are hundreds of thousands of crosses on this place. And it was a stunning experience to be there is one of these places. As soon as you walk in, you feel like you must be quiet. Just immediately you must be quiet. And as we were walking, you're going to hear this. You're going to hear. Hear this on the documentary in a couple of episodes. So Father Ginteros, who is one of the priests, the priest, really, who showed us around almost the whole country, he said, as we were walking around, he says, you know, when people place their crosses here, some are happy because they're celebrating something. You know, sometimes they put one because a child was born or baptized or something like that. Sometimes they're sad, they're remembering someone who's departed, or they're praying for something that they're really worrying about. He says, walking around here and seeing all the names and all of these languages on these hundreds of thousands of crosses, he says this is almost like hearing what God hears. And as you look around, you see all these prayers that are ascending and you actually can read them."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":2949.79,"end":2983.64,"speaker":"Richard Rohlin","text":"I should just note that typically the way it works is somebody goes on a pilgrimage to the Hill of Crosses, as we did. You have a cross, you write the names of the people that you want to pray for, and then you carry it with you on your. Your pilgrimage. So you get to the Hill of Crosses where you plant it, and then you leave it there. So there were, I mean, hundreds of thousands, I think, is too conservative an estimate, especially since a lot of times you'd have a big cross and there would be hundreds of rosaries just hung on it left there. So, I mean, you know, if you wanted to count really all the crosses there, including the small ones, it'd have to be a million."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":2983.96,"end":3002.37,"speaker":"Fr Andrew Stephen Damick","text":"It's impossible. Yeah. And, you know, one of the things about this place, so it's been hosting crosses probably for centuries now. During the Soviet period, the Soviets would go in and burn them down and bulldoze them down. And yet in the middle of the night, people would go out there and put their cross back."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":3002.37,"end":3008.21,"speaker":"Richard Rohlin","text":"And so it had the effect of this forest getting burned down and then just springing up again, regrowing overnight."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":3008.21,"end":3072.33,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And so it became a symbol of resistance to an atheist domination of the country, of an occupation of Soviet demonic evil. And so one of the things that I want people to walk away from. Not just from this story of the Hill of Crosses. You're going to hear it over and over again, over and over again is this sense of keeping the faith and loving Christ in the midst of very difficult circumstances. You know, Orthodox Christianity has been a minority in that country throughout its entire history. Throughout the whole history, Orthodoxy has been the minority. It was never the state religion, even when grand dukes were Orthodox, which there's one that we know was. There's one that was Catholic and then Orthodox and then Catholic again, probably. But then even, you know, frankly, you know, our Catholic friends suffered a lot under. Under Russian imperial rule and under, certainly absolutely under Nazi and Soviet rule in the late 20th century. And it is an extremely inspiring story to hear about how these people kept their faith in the midst of this."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":3072.45,"end":3072.61,"speaker":"Richard Rohlin","text":"And."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":3072.92,"end":3102.36,"speaker":"Fr Andrew Stephen Damick","text":"And I mean, it was amazing. Like, we were walking around and people say, oh, yeah, there was a Lenin statue over here. We tore that one down, you know, so, you know, it's hard to think about that, you know, to conceive of what it must be like to have lived under that domination and then to come out and have this sense of solidarity and love. Like Lithuania gained its independence from the Soviet Union through singing, actually a singing revolution, which. You're going to hear that story towards the end. So we don't."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":3102.98,"end":3126.5,"speaker":"Jonathan Pageau","text":"You don't want to spoil it. So everybody go and check out the series the Wolf and the Cross. I am going to listen to the first episode, you know, by tomorrow morning. And now you've got me all excited about it. So thanks for your love and your dedication to this project, but also just to helping people rediscover the ancient stories, how they connect together with our faith. And so, Father Andrea and Richard, thanks for your time."}
{"episode_id":"SW - #279 - 2023-03-23 - Fr. Andrew Damick and Richard Rohlin - Lithuania - The Wolf and the Cross","start":3126.74,"end":3128.42,"speaker":"Richard Rohlin","text":"Thank you very much for having us, Jonathan."}
