{"episode_id":"SW - #185 - 2021-10-26 - How Kanye West Bridges Contradictions With Donda","start":0.24,"end":808.05,"speaker":"Jonathan Pageau","text":"So Kanye west put out his album Donda finally. As you know, I've been watching Kanye west for several years, and since the album has been out, many people have been asking me whether I'm going to give some kind of review of the album. And people have been asking me, you know, why is Kanye west working with Marilyn Manson and Dababy? Why is, he, you know, producing Lil Nas X? You know, why is he doing all these things if he's supposed to be a Christian? What is going on, you know, what is the meaning of some of his actions? And so I want to look a little bit at again at Kanye west, at, let's say, his faults, his difficulties, and also what it seems that he is trying to do and what that means within a Christian context. And of course, in his kind of role as this strange fool that is kind of bridging contradictions, let's say. We'll try to look at that and try to make sense of it a little bit. This is Jonathan Pedro. Welcome to the symbolic world. And so when the Donda album came out, I have to admit that in listening to it, my first reaction and I talked about this on the Q and A was that the album is all over the place. That it somehow is very disparate in terms of sound. It seems very uneven even in terms of production, and it seems to be scattered all around. And this of course, is compounded by some of the actions that he's been taking. You know, this thing of collaborating with someone like Marilyn Manson, who is one of the most anti Christian characters in music, let's say, and people like Dababy, that has been very controversial recently on the other side, you know, making kind of kind of homophobic comments, supposedly. I don't even know what he said, but he's been controversial because of that. And so what is going on? And of course, you know, getting involved with Lil Nas X and all of this, who has put out this kind of weird satanic inverted video, why is he doing this? And so I think that the first thing we need to understand about Kanye west and let's say his kind of role in what he's doing is that from the very beginning of his career and from the very beginning of his music, he is a man of extremes. That is that in his music making you will find the most radical of extremes. You will find, you know, these songs about Jesus, like on his first album, songs that are about his mother, kind of in tribute to his mother, which is not something that rock stars and rap stars tend to do. But then you'll also find these. Some of the most vulgar, you know, kind of degenerate songs that have ever been made explicitly very sexually explicit, you know, very disturbing and. And dark. And so this is something which has kind of inhabited him for a very long time. You know, he said a long time ago, even in his early songs, he would self identify as Catholic, but then also engage in these darker. This dark humor and these very dark songs. And so this is something we need to understand about him as a person. He's someone who is extremely. Who kind of manifests these extremes and has kind of been living in contradiction for a very long time. There's a particular song where you really see this. And I remember there's a song called Lost in the World where he expresses this very clearly in talking about his wife. This is actually something which came out of a poem that he wrote for his own wife. I don't know if they were married at the time, but that he wrote for Kim Kardashian. And I remember hearing interviews about. From Kanye talking about how this is. These lyrics are very important to him, these bars. And so let me just read you this part where he talks about Kim Kardashian, and he says, you're my devil, you're my angel, you're my heaven, you're my hell, you're my now, you're my forever, you're my freedom, you're my jail, you're my lies, you're my truth, you're my war, you're my truce, you're my questions, you're my proof, you're my stress, and you're my masseuse. And so, of course, what he's doing is, of course, inhabiting these opposites and showing how his experience of this woman is manifesting itself to him in these extremes, let's say. And he does the same even in this new album. In Danda, there is a. There's a verse from the song Come to Life where he says, I get mad when she's gone, mad when she's home, mad when she's gone, mad when she's home, sad when she's gone. And so this idea that he experiences the world as contradiction, he experiences his relationship with his wife as contradiction. Now, this is something that we all experience, of course, we all have this experience of contradiction within ourselves, you know, to a certain level. But in his. Let's say that in his case, this seems to be something which embodies him to the extreme and which is part of a little bit of his own madness. And A little bit of his genius as well, is to be able to really perceive these kind of extreme contradictions in the world. Now, my impression, or let's say my impression of what he's trying to do with Donda, now that I think about it and now that I kind of understand, I've been thinking about these contradictions that he's. What he seems to be trying to do in this album is trying to pull everything together. That is, take all the extremes of his own music making and pull them into one place. And so a lot of people have been saying that Donda is something like a. Like a mix between, you know, his last album, Jesus Is King and Yeezus, which was this extremely harsh album with very harsh beats and extremely kind of just this. Just this really extreme harshness about it and so on. Dana, you get these songs that have these hard beats and then other songs with which have the. Using this kind of spiritual choir with the organ and this more kind of uplifting, spiritual sense to them. But you also have on this album something which reminds us of the older albums of Kanye, which has this kind of soulful. More soulful singy song to them, you know, like this more dance aspect to it as well. And so it seems that he's really trying to kind of bring it all together into one place. And in that song, Come to Life. If you've seen the video of it, you really do get this imagery in the video itself where, you know, in the Chicago event where he played his album for Everybody, he had a version of his house in the middle of the stadium. And then at the top of the house, he put an image of the cross. And so he's trying to join the notion of the church with the house, which is something that I've done before in trying to explain people's symbolism, that there's something about the hierarchy of a house, the hierarchy of intimacy which happens in the home, and this kind of movement into sacred space that you find in a church. Now, in other videos we'll talk about a bit later, but out of this church house comes Marilyn Manson and Dababy with Kanye West. We'll talk about that a bit later. In the video of Come to Life, you see. You see Kanye west inside the house burst on fire. And then you see him walk out of the house as the house is on fire. And then you see an image of Kim Kardashian in this wedding veil kind of walking down, and you find Kanye west coming to him and then removing his mask. Like, people don't Some people don't know. But ever since it seems like they've announced their divorce, Kanye west has hidden his face. Basically, nobody's seen his face. He just wears this mask all the time. And so now here he is kind of encountering her and then removing his mask in front of his bride. I mean, obviously, it's all very strange because they're supposed to get a divorce. But in terms of symbolism, you can see. Can you see the extremes? Like, you have this sense of the home church in which is set ablaze, and then he burns this house down, which I guess is supposed to be some kind of a baptism. But in terms of extremity, you can really see that on the one hand, you have this kind of extreme image of this house bursting on fire with him inside. And then you have the joining of him with his wife, where he removes his mask and comes face to face with her. You also see him at the very, very end removing her veil and now kind of joining together. And so we have this extreme of fire. And in the fire, he's also wearing a mask of fire, of separation, of just this contradiction, and then coming to meet with his wife. And so I think that this is like an image of what he seems to be trying to do. And in the SO song Come to Life, you really get the ultimate image of this, which is. It's a very common image. But if you understand it in the way that Kanye west, who he is, you get a very powerful image of this. And so in this verse where he said what I said, I'm going to reread it, but I'm going to start from the beginning where he posits these extremes. So he says, don't you wish the night would go numb? I've been feeling low for so long Ain't had a high for so long Been in the dark for so long Night is always darkest before the dawn. So notice he's going from light to dark. Light to dark, light to dark. Gotta make my mark before I'm gone I don't want to die alone I don't want to die alone. And this is where he goes. I get mad when she's gone Mad when she's home Mad when she's gone Mad when she's home Sad when she's gone Then he says, Floating on a silver lining yeah, you know where to find me Writing on a silver lining and my God won't deny me Tell the devil get behind me and all the stars are aligned Lift me up every time you know exactly where to Find Me, which is riding this silver lining. And I think that this is really one of the most powerful images of Kanye that you can find, which is that he is an image of the edge. He is an image of these extremes which manifest themselves on the edge. With his obsession with fashion, his obsession with, you know, with kind of popular music, and also all these contradictions that I let out for you. But that he is trying to transform this edge and into a silver lining. He's trying to show or find the light in the edge and trying to make it bright and make it shine and in this desire to kind of reconcile all the opposites. I think that this is exactly what he's doing. When he does things like reach out to Marilyn Manson, of all people, and include him on his album. Reach out to these controversial figures, you know, reach out to Lil Nas X and produce his albums. He's saying, I'm gonna go to the edge. You know, he. He seems to think. He seems to want that. This notion that the love of Christ is going to kind of reach unto the edge and he's going to be able to ride the edge and to turn it into a silver lining. Now, you might think that this is kind of silly and extreme, but think about the very album Donda. Think about what he did. He made an album with just dozens and dozens of guests of guest features and. And Chris Brown, Jay Z, all of these new rappers that I don't know anything about. And he made a clean album. He had them on his album without swearing, without talking about disgusting things, without going into the disgusting subjects that these people usually go into. On the contrary, he had them all involved in this cultural project where by joining themselves with Kanye, it's not him who was infected by them, but it's them who were somehow brought into this kind of new identity that he is trying to give himself. And so this is something, if you want to kind of understand, at least this is my understanding of what's going on with Kanye now, whether he's fully successful. I'm not sure. I felt like the Donda album was uneven in many ways, but nonetheless, I think that this is what he is trying to accomplish. And as usual, we. We can just continue to watch him. To watch, you know, as he kind of continues to move in culture, to see what kind of effect he's going to have and if he's going to be able to pull all these threads together and ride that silver lining. So, everybody, thank you for your attention, and I'll talk to you very soon. I hope you enjoyed this episode of the Symbolic World. The Symbolic World is based on a series of videos that you can find on my YouTube channel, Jonathan Pedro's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description and so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course leaving a review on itunes. Everybody knows that's the best way to get the podcast out there to get it heard. And and if you want to get involved, you can also support the podcast financially going to www.thesymbolicworld.com support or else on Patreon the Pageot videos as well and on SubscribeStar, all those links you can find on my website or in the show description. So thank you and I will see you soon."}
