{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":0.4,"end":76.37,"speaker":"Jonathan Pageau","text":"Hello, everybody. I am back here with Richard Rowland. One more episode of our Universal History series, which has been really bringing up so many positive comments. People are excited about it. So it's fun for us because we are so excited about Universal History that we're both surprised and overjoyed to see that people are following us down this rabbit hole. Today is going to be our last episode on Ethiopia. I know we've been talking about Ethiopia a lot, but it is so relevant to situation of kind of the beginning and the end joining together and all this kind of eschatological vision. And so today we're going to look at Ethiopian, several Ethiopian practices and how they kind of manifest the two aspects of Ethiopia. One, which is this idea of the container or the ark, and then the other aspect is the idea of the edge at the extreme and how all these kind of traditions come together to manifest a very specific and particular, particular version of Orthodox Christianity. So, Richard, I hope you're ready for this because I'm excited. This is Jonathan Peugeot. Welcome to the symbolic world."}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":87.18,"end":107.66,"speaker":"Richard Rohlin","text":"I'm also excited and yes, I'm ready. I've been reading, I think I told you this. I've been working my way through like an 800 page Ethiopian. There's Synaxarium, their hagiographical text. I haven't made it quite all the way through this week, but I've read just a lot of hagiography and it's also bouncing around in my head. So I'm ready."}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":107.74,"end":108.74,"speaker":"Jonathan Pageau","text":"All right. And."}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":108.74,"end":109.5,"speaker":"Richard Rohlin","text":"Or deeply confused."}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":109.5,"end":125.34,"speaker":"Jonathan Pageau","text":"I'll let you throw the ball in there and start the conversation and we'll go along on it. I think you're probably the only person in the world that I know that has read like, I know about the Nine Saints, but I've never heard of this more extensive kind of hagiography. Ethiopian hagiography."}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":125.34,"end":277.93,"speaker":"Richard Rohlin","text":"Yeah. Well, they have a. In the Orthodox Church, we call it the Synaxarion. And I think the word that they use from the Coptic tradition is the Synax. But it's the same word, same thing, right. Which is basically just like the daily commemorations, the daily lives of the saints. And so they have a book like that very much like we do, maybe equivalent to the Western, the Roman martyrology or something like that. Although I don't fully. I would just confess I don't fully understand how that book, that set of liturgical books actually works in the Latin tradition. So please don't me or actually and tell me why I'm wrong. But anyway, so what I wanted to start with reason I'm talking about hagiography, other than the fact that it's just something I'm deeply interested in, and it's one of the main, let's say, source materials for legendary history or universal history, and certainly the most popular genre of literature in the Middle Ages. Last time we talked, and we kind of ended on this note in our. In our previous video, that this about the fact that the saints uphold the world. Now, I believe that to be literally true. I do believe that there are people right now in this world praying for us that are holding back the judgment of God and whose prayers we're joining, we're participating in, especially in the liturgy. But I also think that this saying, the saints uphold the world, provides a very important interpretive key or symbolic key for understanding the way that a given principality manifests itself. So something we talked about, I think it was last time, is this idea that the thing that sort of symbolically ties stuff together is always going to be a person. It's like you've got everything in the cosmos sort of moving towards personhood. The way that a principality manifests itself, that it's going to be most strongly tied together, is going to be in a person, usually in some kind of cultus of veneration. And I don't mean like guys with dark hoods around pentagrams, like cult in the anthropological sense, people where cultus, which is a Latin word that means worship or veneration. That's the root of our word culture. So the way that you have a culture is that you have a culture of veneration around a common point. And the common point is usually a person."}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":278.18,"end":326.07,"speaker":"Jonathan Pageau","text":"Yeah, that's really important because we have a kind of new. We have a kind of Platonic under, you know, strata in our understanding. And we tend to think of ideas or these abstract principles as being the thing which binds us together. But in reality, in terms of human. Human reality, things are actually bound together by people, you know, remembering and celebrating our common ancestors, our heroes, our politicians, our saints. This is actually the manner in which we recognize unity much more than the idea of liberty or freedom or these kind of revolutionary, abstract ideals. We remember Napoleon and the French remember Napoleon and unite themselves under Napoleon. Much more than fraternity, equality and freedom, whatever. In English you say it, however you say it."}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":326.07,"end":448.68,"speaker":"Richard Rohlin","text":"Yeah. And to talk about that period for a moment, because you had the American Revolution, the French Revolution, all happening right there at the same time. And one of the things that they would do, especially in the iconography of that time and over, say, the course of maybe the next 50 years as they start building buildings and painting murals and things like this, is that they do really try to depict, let's say, the genius of a particular country. Liberty, equality, fraternity, or victory is a really important one at that period. And then Columbia in the New World. Columbia as the goddess of the New World. And there's a lot of art, especially if you go to the United States Capitol building or some of our other. Yeah, shrines. I was trying to think of a word that wasn't that, but that's the right word. If you go there, you'll see these figures depicted, these female figures, often like nude or semi nude, you know, depicted in the same way as. As Greco Roman. Greco Roman gods. And the interesting thing is that this was. This was a conscious attempt to tie back to Greco Roman civilization and personify these things, these abstract ideas as gods and goddesses. And the interesting thing is that it did not work. Nobody in the popular imagination, like, in the popular imagination, if you said, what's the personification of America? Most people who instantly go to George Washington. Most people most of the time. And I'm not trying to make. It's stupid that there's a whole political thing right now about whether or not that's a good thing. But I'm not trying to make a statement about that. I'm just saying most people, most of the time, if I show you George Washington's picture on a $1 bill, that's the most immediately recognizable icon. So the interesting thing is that is that we tried to create these symbols artificially, and that did not work."}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":448.84,"end":453.96,"speaker":"Jonathan Pageau","text":"Yeah. The exception, I would say Lady Liberty, like the Statue of Liberty, because it's so big."}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":454.04,"end":454.52,"speaker":"Richard Rohlin","text":"Yes."}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":454.76,"end":470.6,"speaker":"Jonathan Pageau","text":"I think that it was able to kind of imprint itself on the imagination and act as almost like a kind of goddess figure for America. That's as close as you get, but it's not the rule. It really is the only one. All the other figures are people."}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":471.22,"end":579.06,"speaker":"Richard Rohlin","text":"Right. If I showed most people, like, a picture of the goddess Victory, Nike, and was like, who's this? People don't know. Even though she's on the ceiling of the rotunda at the U.S. capitol Building. So this is all to say the symbolism of a nation with a symbol being understood as something that holds two realities together rests most fully in its saints. And that includes those nations which are not overtly Christian, like the United States, for instance, but which still have what, a mult, what amounts to a cult of veneration and a hagia. Hagiographical tradition. And I'm just going to say a quick thing again about like Abraham Lincoln because that got a lot of people very excited or very salty last time. It's funny because I saw the clip and I'm sure you're too seasoned of a YouTuber to go and like read the comments on your own videos, but I went down and looked at the comments on the clip of the stuff that we were saying about Lincoln and one guy was like, oh, typical Americans, you know, they're, they're, they're only focused on, you know, what happens to their own country. And I was like, dude, this is from a video about Ethiopia. Like, come on, come on. Peugeot's Canadian. Come on. But anyway, but, but I just want to, I just want to, like, I want to give an easy example since most of our viewers are Americans. So we can understand that actually we do this and then we'll go and we'll talk about Ethiopia. So, so this is gonna, this, this idea of a cult of veneration, a hagiographical tradition. This includes both biography, but it also includes legendary material. Right. George Washington chopping down his father's cherry tree or the legend of Honest Abe are just as important, maybe more so than anything either of those men did, which is historically verifiable."}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":580.18,"end":593.6,"speaker":"Jonathan Pageau","text":"That's super important to understand because it participates not only in the identity of George Washington, but like you said, that legend as its frame becomes a kind of a frame for how Americans perceive themselves."}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":593.92,"end":705.88,"speaker":"Richard Rohlin","text":"Right, Right. We're honest, we're forthright. We sort of, you know, the way that we want to think about ourselves, whether or not we live up to this, the way that we want to think about ourselves is that we're honest, we're forthright, we sort of do the right thing no matter what the cost is. Right. So when Lincoln died, his body was moved, or you could say his relics were translated across the country to be, to be buried, I think in Springfield. And there was, at every stop along the way, there were people came on pilgrimage to see, to venerate his, his body. This is very religious thing. When his body reached there, there now where he's buried in Illinois, I think it's Illinois. I've actually been there a couple of times. But I was, I was pretty young. So my family went on essentially a pilgrimage to the tomb of Abraham Lincoln. My dad was really into Lincoln. When I was a kid, I read this massive multi volume biography of Lincoln's life and that was one of the things that was, you know, like I was encouraged to read as a young person. And, like, I want to make it clear, like, I'm not really down on Lincoln or, you know, a certain part of me, like, I don't feel like this is necessarily, like a huge problem. This is just the way that. This is the way that America is. Like, if you. What you got to understand, like, this is part of our. Our identity. So you'll just get a kick out of this. Okay, so there at Lincoln's tomb, there's a large copper, as in the penny bust. So I'm just assuming you know things about American money. So Lincoln is on the one, is on our penny, our one cent piece. Right. He's on our penny. We have debt presidents on all of our money. Lincoln's on the penny and he's on the $5 bill. And. And so there's a massive copper bust made of Lincoln's head. And the whole thing is tarnished, except for the nose. And the nose is bright and shiny. Why?"}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":705.88,"end":706.96,"speaker":"Jonathan Pageau","text":"Because people rub it."}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":707.2,"end":714,"speaker":"Richard Rohlin","text":"Because as you enter the tomb of Lincoln, you are supposed to reach up and rub the nose. Wow. For good luck."}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":714.16,"end":721.88,"speaker":"Jonathan Pageau","text":"Yeah. It reminds me of that statue of St. Peter at the Vatican. There's a statue of St. Peter where his foot is almost completely worn down because people walk in and everybody rubs the foot."}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":721.88,"end":729.39,"speaker":"Richard Rohlin","text":"Wow. Yes. So it's like, here's a statue of Lincoln. I'm going to venerate it for a blessing, and then I'm going to enter his tomb."}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":730.91,"end":767.83,"speaker":"Jonathan Pageau","text":"I think it's mostly to understand, like you said, we're neither criticizing nor celebrating this. We're just saying that this is how it works. This is actually how any identity kind of holds together through these act of celebrating and venerating and remembering those that marked our history, marked our story, and also participated in our unity. So. So this is just how it works. And so it can help Americans understand, like you said, why religious practices look the way they do. Because they're not just. They're more than religious in a strict sense. They're just the way that reality. Reality lays itself out."}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":767.99,"end":770.87,"speaker":"Richard Rohlin","text":"To quote my friend Jonathan Peugeot, it's not arbitrary."}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":771.03,"end":799.6,"speaker":"Jonathan Pageau","text":"No, it's not arbitrary. This idea, like, of having even the picture of the president in all official buildings. I don't know if they still do it, but I know they did it. They did it before. This kind of idea of having the image of the emperor, the image of the king, or the image in all these public spaces to mark his presence. And as you enter, you kind of see who the principality is that's at this moment, holding all this together is something which is very religious in the way it instructs."}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":800,"end":988.08,"speaker":"Richard Rohlin","text":"I once organized an event at a Protestant, very Reformed, Baptist, Protestant seminary. And when you get there, outside the building that we're in, they have this. This area called Martyrs Walk. And you walk along and it's got the names of all of the, you know, these different Baptist missionaries who have been killed doing overseas missions. But then you go inside and you go inside and the. The main auditorium, there is wall to wall with the pictures of each president and dean that the seminary has ever had in its, you know, history. And so it's. You walk in, you know, there's like, names of the martyrs along the outside. And you go in and the room is full of icons. I was. I was. I was with a friend. I wasn't Orthodox at the time, but I was with a friend who was. And he and I just sort of looked at each other and grinned a little bit. And he said, and they say Protestants don't have icons anyway. And again, like, my point is, I'm not trying to keep any kind of criticism on anyone about this. I'm just trying to say, like, this is. This is the way that things cohere. This is the way that things hold together. So with. With that being said, the best way that we can understand the symbolism of Ethiopia, I think, is by reading the lies of the Ethiopian saints. And if we do, eventually, I know a lot of people want to do, like, Ireland and Celtic stuff. And if we do that, then. Then we'll. We'll eventually do the same thing there. Because when we do this, going to see and notice certain patterns which are going to manifest themselves over and over again in Ethiopian hagiography. And like, if you read a large amount of Ethiopian hagiography, what you're going to see is a lot of the stuff is exactly what you would expect from any Christian hagiography pretty much anywhere, right? It's the same religion, same Jesus. You know, holiness is not radically different in Ethiopia than it is other places. But then if you're attentive, you'll also notice that there are certain things, certain patterns which might be present other places in very small amounts, but which are central to the Ethiopian experience of holiness. So that's what I want to start out by looking at today. All right, so the first one of these, which should be surprising to absolutely no one, is the prominence of the idea of the furta sacra, which means the holy theft or the theft of the sacred. Right. So the story usually goes something like this. You Have a holy man who dies before he dies, he leave instructions to his disciples that he's supposed to be buried in a certain place. And then for whatever reason, often because there's a ruler who has other plans in mind, his orders are not followed. Because they're not followed, various calamities ensue until someone steals the body and buries it in the appropriate place. And then the calamities stop. And so the idea is the saint was actually willing, desired this stuff to take place. In some cases, what they actually do is they. They put an empty. They make a replica coffin and they switch them and they leave the empty coffin in place of the original and they take the original and they bury it wherever the saint wanted it buried."}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":988.08,"end":991.6,"speaker":"Jonathan Pageau","text":"Sometimes there's a trick in the translation."}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":991.84,"end":993.2,"speaker":"Richard Rohlin","text":"Yes, yeah, yeah."}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":994.48,"end":1022.9,"speaker":"Jonathan Pageau","text":"And that's. I mean, obviously most people will right away see that this is just a kind of playing out of the original taking of the ark. And then now it's as if, like you. When your foundational pattern has a certain form, then if you fractally play itself out through your society, it's inevitable because that's what you're looking at as your model and as your first memory, you could say. And then it just plays itself out through the history. So it's very fascinating."}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":1022.98,"end":1045.32,"speaker":"Richard Rohlin","text":"And you do find this other sort of thing. I've never encountered it. I've been reading a really massive collection of Welsh hagiography recently. This is just like. If you could see my desk right now, there are just stacks of printed out pages because none of this stuff is published, but you can still find it online. I actually got a new book of. Oh, yeah, right here. I just got a new book of the Irish thing."}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":1045.48,"end":1047.4,"speaker":"Jonathan Pageau","text":"Irish Hagiography, Volume 8."}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":1047.88,"end":1049.48,"speaker":"Richard Rohlin","text":"The Volume 2. This one's Volume 2."}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":1049.48,"end":1050.76,"speaker":"Jonathan Pageau","text":"Sorry, I thought eight there."}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":1050.76,"end":1109.93,"speaker":"Richard Rohlin","text":"Yeah. There's a lot, though. There's a lot. There's a lot. A lot of these saints are really wonderful. Nobody's heard of them, but anyway, I've never encountered the fur to sacra thing in really almost any lives of Irish saints. You do find it a little bit in Byzantine hagiography. Two examples that I can think of off the top of my head. There might be a couple of others, though. Again, it's not very common. One would be the translation, one of the translations of the relics of St Nicholas which are stolen, but then because they're stolen, they're able to be saved from the Turks just like a few days later. And so St. Nicholas appears in a dream to basically tell people Listen, it's okay. This is how my relics are being preserved. Another example. And every year, like, when we come across this and we read this with our kids from the Synaxarion, kids always ask me questions about it because it seems so obviously wrong to their little minds. And that is the placing of the robe of the Mother of God at her church in Blakarnae in Constantinople. Do you know the story?"}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":1109.93,"end":1110.65,"speaker":"Jonathan Pageau","text":"No, I don't."}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":1111.05,"end":1191.35,"speaker":"Richard Rohlin","text":"So essentially, the story is that her robe was kept by one of her maidservants, who was not a Christian, she was a Jewish. After her death, I think this is commemorated in July, maybe on, like, July 2, but it might be a little bit later in the month. I forget now. And. And so it's passed on from one woman to another. And they have this tradition that the woman in the family that holds it has to be a. She has to be a virgin. And so it comes to this woman who's, like, the last one in the lineage. There's no one after her to take the keeping of this. Of this robe, which even though she's. She's a Jew, she's not a Christian, but, like, the robe works so many miracles that people are always coming to her house to be healed and all this different stuff. And then one day, these two Byzantine nobles who were passing through on their way back from a pilgrimage to the Holy Land, they hear all these miracles happening, and so they go there, and it's divinely revealed to them that this is the robe of the Mother of God. And so they sort of, like, debate, what do we do about this? What do we do about this? And eventually, and it sort of seems that there's, like, divine sanction for what they do, they make a replica coffer, like reliquary, and they switch him out, and they bring the robe to Constantinople and place it in the very famous church of the Mother of God at Blacarnae. So that's a."}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":1191.67,"end":1193.75,"speaker":"Jonathan Pageau","text":"That's a clear example of what you're saying."}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":1193.83,"end":1437.09,"speaker":"Richard Rohlin","text":"That's a crazy story. And of course, it should be less crazy if we understand the association of the Mother of God with the Ark of the Covenant. Right. But. So that's a really clear example of the Furta sakura. So that sort of thing is, I would say, rare in Byzantine hagiography, at least from what I've read of it. It's very common in the Ethiopian hagiography. I would say it's one of the defining patterns. Another one would be, and this is really interesting, maybe something to mention, and I'm not sure that I fully understand the symbolic resonance here, but one of the interesting things that I've noticed is that in Ethiopian hagiography, the focus on relics always tends to be on the whole body, whereas in other Christian cultures, relics could be a little piece or a hand, like the left hand of Mary Magdalene or the head of John the Baptist, et cetera. But in Ethiopian practice, it really does seem to be the whole body. In fact, there's an example of one saint. I can't remember his name now, but at some point his left leg just fell off and they just sort of tossed it. It was very strange. So it's like there's this focus on the whole body and relics really mean just the body. Not so, for instance, the contrast to this would be in the Celtic tradition, where the relics of a saint can mean their bones, but they're just as likely to mean things like a bell or an altar or a vestment or something like some holy object that belonged to the saint. So it's just kind of a different approach. And then there's something called the kidan. So the kidan, and this is in essentially every single Ethiopian hagiography that I've read. At the end there will be a kidan and the Kidan Ethiopian people. Like, I'm probably saying the word wrong, actually, I think I'm saying it right in this case, but tell me if I'm not so. The kidan is a pact between the holy person and God that is made before their death. And again, there is very interestingly something like this in Saint Maximus the Confessors. I'm looking to see if I have the book, but it's over there. Saint Maximus the Confessor's Life of the Virgin. There's actually a moment like this, like right before her death, she asks her son that he would honor her intercessions for those who call upon her name. Right. But this sort of thing, like this sort of comment doesn't show up very often in Byzantine saint's lives, but it's in every single Ethiopian saint's life, essentially. And basically it is. What will happen is that either Christ himself or sometimes the Virgin Mary or St. Michael the Archangel will come to the holy person shortly before their death and make a promise that God will answer the prayers and come to the aid of those who observe the saint's memory, like the annual commemoration of the saint's life. Although some saints were actually commemorated like monthly, which is apparently. I mean, can you imagine? Yeah. And so one example says, whoever invokes your name Whether inside or outside, in a desert or wilderness, on every path, in his walking or his sitting, in all of his suffering, I will heed his prayer and demand immediately. So this is like. It's a promise to reassure the people who venerate the saint that their prayers aren't going to be heard. So this is another one of the really interesting. One of the really interesting patterns. And if you think back to all the stuff that's going on with Solomon and his Ethiopian son, you've got the theft of the ark. But then also Solomon says, well, you stole the ark and nobody died, so this must be from God. So the idea is that it's a theft, which is kind of an ambiguous thing, but then it's something that God seemed to have willed."}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":1437.25,"end":1522.04,"speaker":"Jonathan Pageau","text":"There's also something, at least in the image of the theft of the ark, and even in this image of the theft of the vestment of the Mother of God, of her robe, there's something. There is a pattern in, like that between identities. You could say that sometimes the relationship or the translation between identities happens through tricks because it's not within an identity. And so you can see that obviously in the story of Jacob, quite often with Laban, and then you can also see it with Moses and the pharaoh. There's all these stories, especially in the Old Testament, of when you're in the stranger's land, sometimes the interaction with the stranger will happen through a kind of trick. And so you see that in the story. And it's interesting that you mentioned, for example, that the taking. One of the only stories in the Byzantine tradition is the taking of the robe of the virgin, and that this is very much related to the idea of the ark itself, you know, as this container, as this kind of outer shell. It's kind of outer feminine shell. So it's interesting to see that these patterns actually kind of make sense, especially if we kind of understand, and even if Ethiopians understand themselves as being, you know, kind of this extreme, this extreme of the world, let's say, and the relationship to the rest of the world, you know, it seems to kind of fit together, you know."}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":1522.04,"end":1568.93,"speaker":"Richard Rohlin","text":"Yeah. And I think, you know, even. Even in this promise, right. Whether you're inside or outside, you know, whether you're a desert or a wilderness, you know, it's. It's like the. The ability, the capacity of the saints and of their intercessions to go to these really extreme places, which we're going to talk about more in just a second. But I think there's something interesting about this, too. Because one of the things that you see in Ethiopian hagiography is that the veneration of the saints is very much a two way street. And what I mean by this is there are all kinds of stories about so. And so was a wealthy farmer who decided to skip the commemoration of this local saint because he had to plow his field. And so the saint shows up and blights all of his crops. So I mean, this stuff, I mean."}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":1568.93,"end":1572.49,"speaker":"Jonathan Pageau","text":"This stuff is tough, man. That's tough stories. Those are tough stories."}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":1572.8,"end":1591.36,"speaker":"Richard Rohlin","text":"Giving, you know, John Calvin just the heebie jeebies right now. But I mean, I mean that, that's. And you actually find this thing in English hagiography too. Like this is very common, you know, basically. But the idea is that the relationship between the patron and the person is. It's very much. It's supposed to be a two way street."}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":1591.52,"end":1651.71,"speaker":"Jonathan Pageau","text":"But you, it's easy for people to dismiss it as a quid pro quo, quid pro quo, or like this kind of, this transaction or whatever. But if you want to, you can understand it more generally as even secular people, you can understand it in a larger context by understanding that if you don't remember your principalities, if you don't remember those things that bind you together, then yes, you're going to be cursed. That is, if you don't remember that which binds you, then you're going to fall apart, then your world is going to break down. So if you want to destroy a country, destroy its heroes, right, Attack, attack, Attack Christopher Columbus, attack George Washington, attack. All these figures that are meant to be, these pillars that hold society together, if you stop to remember them and to celebrate them, then you're going to actually see a blight on your crops or a blight on your country. So it's not just like a magical transaction, but it is an image of how reality actually works as well."}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":1651.95,"end":1773.11,"speaker":"Richard Rohlin","text":"Yes. Yeah, that's the thing I wanted to key in on, is that you can even just imagine it on the most boring and mundane level. What happens if you. This analogy might come back to bite me. Okay, but what happens if you stop paying your taxes? What happens if you just stop doing the things that you need to do to exist in a civilized society? What happens if you just decide, listen, I'm not gonna even very simple things like keeping up your lawn so that your neighbors don't hate your house every time they look at it. Very basic things like this. And so stories like this, what they do is they extend that reality into the realm of the spiritual and they say Actually, there's a spiritual neighborhood as well. Right. That there are these spiritual principalities and that. Yeah, if you don't honor them. I mean, the thing is, if you live in an ancient or a medieval society and you decide, I'm not going to. Let's say you live in 14th century England and you say, actually I'm not going to show up for the Corpus Christi procession. I'm not going to go beat the bounds. Well, what's that saying? It's saying I'm not part of this community. You're not just turning your back on Christ and on the saints, but you're actually also turning your back on your neighbors. So it's saying, wealth, I'm going to go plow my field instead of taking an offering, the church in memory of the saint. Right. Then that's going to be used to feed the poor. So I'm actually like, I'm being greedy. I'm hoarding. I'm refusing to care for the poor. I'm refusing to venerate the saint. All of these things go together. And it's one of the weirdest things about our society today. I think that essentially the idea of care for the poor and then also the idea of veneration have been completely separated. I think it's one of the things that's really destroyed our ability to do charity in a really traditional and a Christian way."}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":1773.11,"end":1828.26,"speaker":"Jonathan Pageau","text":"But you can understand how there's something frightening also about a world that works that way completely, let's say, if you think of. Because it can also, in an excess, like if it goes too far, it can create a world of fear and a world of. You're constantly afraid that if you don't do the right thing, if you're not celebrating this thing or that thing, then your world is going to collapse. And so I can understand also how sometimes it can become too far and become almost like this kind of rigid system that is impossible without flexibility. But I think it's also important for us on the other extreme, in a world where basically nothing matters and everybody does what they want and, you know, there are no relationships between us and our neighbors that we, we can understand how the world works and how remembering and celebrating the saints and the things that bind us together is actually a necessary part of, of existence."}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":1828.98,"end":1933.39,"speaker":"Richard Rohlin","text":"Yeah. So that's, that's why I'm trying to point this out is, Is to say a couple of things. One is that these, These three patterns that we've just talked about. The, The. The sacred, the holy theft, the. The kidan. And then this idea of. Of the sort of like the saint as punisher, that all three of those things show up to some small degree in the hagiography of, let's say, the Chalcedonian churches, but not to this degree. So what we're. So this is a good example of, like, where we see, you know, once we get to Ethiopia and we get to Ethiopian hagiography, we see, like, the more extreme patterns manifesting themselves, but also in a way that. That does sort of serve as a container. Right, yeah. So with that said, last time, we talked a little bit about the nine Saints. And the nine saints are these. They're also sometimes called, like, the nine Roman saints or the nine Righteous ones. And essentially this is a group of saints. I think they're traditionally supposed to all be from Syria, which is, of course, part of the Roman Empire at this time. But I think, also looking at the etymologies of names and various other things, now people think some of them might have come from Syria, some of them might have come from as far away as Rome, like in Italy. But essentially it's this group of nine saints that come to Ethiopia within about 100 years after the conversion of Ethiopia. And they come probably because of the Council of Chalcedon, and with the. They're basically. They're not willing to adopt the. They're not willing to accept the decrees of the council. So they have."}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":1933.39,"end":1938.11,"speaker":"Jonathan Pageau","text":"So they're resisting the Chalcedon, the Chalcedonian definition."}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":1938.35,"end":1938.71,"speaker":"Richard Rohlin","text":"Right."}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":1938.71,"end":1948.59,"speaker":"Jonathan Pageau","text":"And they're looking for a place to. How can I say this? To contain their knowledge or to contain their experience. Right."}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":1948.59,"end":2095.1,"speaker":"Richard Rohlin","text":"So these were all monks, they're all scholars, and they brought with them quite a number of texts and manuscripts which ended up not surviving anywhere else. For instance, there are additional Clementine letters. I won't say Clementine letters, because that means something else down here in the south. But we have the song anyway. Yeah, but we have these, like, additional Clementine letters. We have actually a number of texts that are like sort of quasi New Testament. They're like kind of part of the larger canon of the New Testament in Ethiopia that just don't survive anywhere else. And so the traditional belief is that these manuscripts were brought by the nine Saints with them. And they also did other things, like translating a lot of liturgical texts and a lot of actually hagiography and other things into Ge', ez, into the language of the Ethiopian people. So they're very, very important. They're part of this, really. In fact, if you look up any just top 10 list of Ethiopian saints, of which there are, I think, at least two on the Internet. They'll feature there in the timeline, sort of like them. And then after them, this hypnographer named Jared, who's really interesting because he seems to have, at one point, he left Ethiopia because of kind of a schism or a scandal, and he went to Syria. And while he was in Syria, you know, he came into contact with other, you know, with. With other forms of Eastern Christianity. And at some point he composes this beautiful, I mean, really beautiful acrostic poem to the Mother of God. You can go out and look up the text, And I think St. Vladimir Seminary Press has a translation of it, but if you read through it, it's got all of these very similar ideas and phrases to those that we find in the Hymn to the Mother of God, which is also an acrostic. So I think the two are probably related. But in any case, so the nine saints, they. They're responsible for, basically, they're. They're more extreme theologically as opposed to the rest of the. The church, the say, the imperial church. But then they bring with them these. They bring with them these texts and become this repository of knowledge."}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":2095.26,"end":2109.1,"speaker":"Jonathan Pageau","text":"Yeah, because it's the Book of Enoch, the Book of Jubilees. These are where we first discovered them, let's say. I think it was in the 19th century, 18th or 19th century. This is where they first reappeared on the horizon. People knew about them, but then all of a sudden, here they are, these books. Yeah."}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":2109.1,"end":2140.07,"speaker":"Richard Rohlin","text":"And it's a tricky question, I think, as to whether Jubilees certainly seems to have been preserved in Ethiopia because it was already a holy book of the Jewish community in Ethiopia before they converted to Christianity. But Enoch and then also just a bunch of other stuff. I mean, if you just go up and you look up, like, the Wikipedia page on the Ethiopian canon, there will be books on there that you would never heard of before."}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":2140.31,"end":2148.24,"speaker":"Jonathan Pageau","text":"Yeah, there's some interesting. But was it the Book of Adam and Eve or whatever that that book is? There's some really. It's really interesting to read these books because."}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":2148.24,"end":2193.2,"speaker":"Richard Rohlin","text":"Yeah. And like the Ascension of Isaiah in some. Which is very important Christological text for some reasons, like things like that. It's really interesting. It's really, really interesting. They divide up proverbs differently and they have some extra, like I said, some extra Clementine books. They also have some collections of apostolic canons and other stuff that's all sort of part of their larger canon of the New Testament, and that seems to date back to kind of this infusion, let's say, of the more extreme pieces of learning and tradition in the imperial church that then become preserved in Ethiopia."}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":2193.28,"end":2211.27,"speaker":"Jonathan Pageau","text":"Yeah. And that's where, again, we keep coming back to this image of Ethiopia, not just having the ark, but acting as an ark in itself, itself, as a nation and as a church, being a place where things are preserved, including some extremes that have been kind of pruned off in the imperial church, let's say."}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":2211.75,"end":2263.48,"speaker":"Richard Rohlin","text":"All right, so let's talk just a little bit about the nine saints and a couple of their lives, because they're super interesting. And then we'll talk about some weirder stuff. So I'll just read a short little commemoration here from their synaxarium. For this is Aragawi, I hope I'm saying that. Right, who's also surnamed Zah, Mikhail of Michael. This holy man became a guide to the servants of God on the road. And he went up again, a guide to the servants of God on the road. So he's supposed to be the leader of these nine saints. And of course, they're on the road. Right. Which, you know, not in a stable or fixed place. And then he comes to one. It says he went up to the holy Dabra Dhamo. This is a very high mountain holding the tail of a serpent. And there he fought countless noble fights."}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":2263.72,"end":2285.57,"speaker":"Jonathan Pageau","text":"And God used to see the images of this. They're dramatic because you see him sometimes actually, like, coiled up by this snake and being pulled up this pillar, this kind of high pillar. And so it actually looks like this snake, not around the tree, but there's this verticality, and then there's the snake pulling up the saint up to the. Up to the top of this pillar."}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":2286.05,"end":2321.02,"speaker":"Richard Rohlin","text":"So two days ago, three days ago, from when we were recording, this was Byzantine New Year and also the feast of Saint Simeon the stylite. And I posted that picture in the symbolic world of this sort of same image, right, where you have the serpent coiled around the pillar and then sort of like, poised to strike. And you have Saint Simeon there standing at the top of the pillar, and then that wonderful, you know, open clamshell with a pearl in it. Yeah, oyster. Oyster with a pearl in it at the top, which. That's a wonderfully mysterious image."}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":2321.82,"end":2342.28,"speaker":"Jonathan Pageau","text":"Yeah, it's a very powerful. It's a very powerful image. And in this story also, of the snake kind of carrying this saint up, this Ethiopian saint up, you can really see this whole image of the bronze serpent and this image of the idea of death turned against death and how kind of Asceticism is also. Even that death turned against death."}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":2343.08,"end":2347.48,"speaker":"Richard Rohlin","text":"And also Moses taking the serpent by the tail."}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":2347.72,"end":2348.2,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":2349.88,"end":2362.28,"speaker":"Richard Rohlin","text":"Which is of course, the wrong way to grab a snake. But he takes the serpent by the tail and then the serpent solidifies and it becomes a staff. It becomes a rod of authority and of miracle working."}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":2362.68,"end":2385.69,"speaker":"Jonathan Pageau","text":"Yeah. What it has to do with fixing change, it's like, so you have this changing thing. Fix it. If you grab it, if you're able to grab on to variability, then you can transform it into hierarchy and it becomes a staff. So that's the image that you see in this also in both the image of Saint Simeon and the image of the saint that gets ascended up the cliff."}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":2385.85,"end":2444.95,"speaker":"Richard Rohlin","text":"Yeah. And I don't know, we were talking about this a little bit earlier, but I think there is definitely a kind of more extreme person, let's say, who the only way forward for them, the only way for them to sort of ascend is to take the serpent by the tail. And there's a paradox in that. It's a dangerous. It's an inherently dangerous thing because there's always this danger that serpent's going to double back and bite you. But the person who can do that becomes a guide to the servants of God on the road. Yeah. I don't know. Like, this particular image has really been. I won't say bugging me, but just really stuck with me the last several days. Yeah. So then you've got. This is a weird one. Okay. You've got Garima or Isaac, and he's a Roman prince. In fact, in this particular hakaography, it says his father was the emperor of Rome. And I don't know. Yeah, yeah."}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":2444.95,"end":2445.67,"speaker":"Jonathan Pageau","text":"Pretty intense."}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":2446.44,"end":2571.45,"speaker":"Richard Rohlin","text":"I don't know, like, historically, which emperor that is supposed to be. It doesn't say any hagiography. It's probably not that important. But he's a prince. That's important. Yeah. So he's a prince of Rome and he's sort of a miraculous conception. His mother was barren. She prays to the mother of God. She's given this son, she names him Isaac, and he grows up and he's made a deacon, and then he's made emperor. And again, it's a little tricky to figure out. Is that supposed to be some historical emperor? Seems like not. Right. But it says that he sat and judged justly and righteously for seven years. And then Saint Abba, Pantaleon of the Cell, this is another one of the nine saints heard of him, and he said, my son Isaac, let the dead bury their Dead come and seek the kingdom of God. So he abandons his. His robes and his wealth and his power and everything, and he leaves and becomes a monk. He leaves and becomes a monk. And it talks about all of his different miracles. One of the things that he seems to do is be able to plant plants where they shouldn't grow. Like he plants a grape seed into a rock with his thumb and a grapevine grows out. And then. This is a weird story. I'll just read this bit to you. It says one day certain calumniators went to Abba Pantaleon, so that's his spiritual father. And said the priest Isaac consecrated the offering after he had eaten. So he's being accused of basically of not fasting before liturgy, right? And Abba Pantaleon, having gone to him, caught him on the road and he said to him, and these guys are always on the road, said to him, wait, man, so that I may tell thee a secret. And St. Isaac said to him, let men shut me in and remove the stones from us. And they turned aside for his distance of 5 stadia. And Abu Pantalion said unto him, oh, my son Isaac, thou hast terrified me. And thereupon he was called Ava Garimah. And having finished his good course, our Redeemer appeared to him and promised him, etc. Right?"}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":2571.93,"end":2574.13,"speaker":"Jonathan Pageau","text":"So I don't even think I understand what's going on."}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":2574.13,"end":2597.87,"speaker":"Richard Rohlin","text":"It's really hard to follow, okay? But what it seems to be. And somebody, you know, write it and correct me on this, but what seems to have happened is that he is accused of a sin, a scandal, and rather than defending himself, he requests to be shut up, like to. To be like walled in, right? And then, and then that's. That's it."}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":2598.03,"end":2598.51,"speaker":"Jonathan Pageau","text":"Whoa."}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":2598.51,"end":2598.91,"speaker":"Richard Rohlin","text":"Yeah."}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":2598.91,"end":2606.63,"speaker":"Jonathan Pageau","text":"So basically he lives. He just ends up living like in a little walled up cell for the rest of his life. But that's how he becomes a saint, basically, right?"}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":2606.63,"end":2718.44,"speaker":"Richard Rohlin","text":"And that this is. This is. And you know, it does not say whether or not he really did this, right? Now it does say that he was a great faster, that his flesh cleaved to his bones and all this stuff. So it seems unlikely he really did this, but he doesn't defend himself. And it definitely seems like Pantaleon his. His spiritual father, you know, that he's scandalized, you know, and wants to, you know, like, doesn't tell him why he wants to talk to him. He's like, hey, come here, I'm going to. I'm going to talk to you about something, tell you Let me tell you a secret. And so then his. His solution to handling this, this is to bas himself the secret, it's to wall himself off. So, I mean, this is some of this stuff. Like, you read this stuff, and it's like, man, there's something really important here. And I'm not sure I know what it is. Yeah, yeah. So, and then Pantaleon, I'll just mention him quickly. He was called Pantalion of the Cell. And the reason for this is that he goes to the top of a mountain and he cuts himself a cell out of the rock. And the cell is five cubits long, three cubits wide, so not very wide, and then three cubits deep. And so it's all a single stone, no door, one opening. And if you work out the dimensions, basically the point of the cell is that it's a cell in which you can only stand, you can never sit or lie down. So he's sort of protected from the elements. But he's very much kind of a stylite, where he's just like. And basically that's where he is. And he blesses one particular Ethiopian king, Caleb, who has a war with a local, actually Jewish king. And so that's kind of his story. So those are the three of the nine saints that we have, like, the most detailed lives about, at least in the synaxarium that I could find. Now, I think that if you. I'm sure there are some Ethiopian people out there who know more stories."}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":2718.68,"end":2806.29,"speaker":"Jonathan Pageau","text":"Obviously there's some of the images. I forget which name of the nine saints are, but that when you see the actual images, they're very extreme. The iconography itself is extreme. So I remember in Ethiopia, one of the images of these nine saints was this saint that, in imitation of Christ, had thrown himself from a cliff and had died on these pointy rocks. And so you actually see an icon of this saint being transpierced by these pointy rocks at the bottom of a cliff. And there's another one of them who has wings like a seraphim and has these, like, nine wings around him. So it's like when you see these saints in the church, it's just like all these saints next to each other. And you have this image of a saint being brought up by a snake. There's another one who fed of dying birds by his tears. And so you can see him holding a bird with its beak in his eye. So you see all these. So when you go into the church, you don't even know who these saints are, but you can know that they're part of these, the nine saints. And you see all their images next to each other and all of them are engaging in very kind of extreme iconography. You do get this sense of really like a magical, fantastical world. One of the images that really struck me the most, like in some of these underground churches that exist, there's one church which is dedicated to Saint Mercurius. And so you go into the church and then there's this icon of Saint Mercurius on a horse. And next to him there are these two dog headed men."}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":2806.54,"end":2806.74,"speaker":"Richard Rohlin","text":"Right."}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":2806.74,"end":2826.14,"speaker":"Jonathan Pageau","text":"And it's a legend that these two dog headed men had killed Mercurius father and Mercurius ended up converting them and then they become like his companions, but also these fierce warriors that can be kind of turned against the pagans when you need to, you know. And so you can see these extreme images all over the place."}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":2826.3,"end":2864.25,"speaker":"Richard Rohlin","text":"Yeah, the St. Bartholomew, the apostle Bartholomew in the Ethiopian hagiography has a, like a legion of cannibal Cynocephalytes, cannibal dog faces. That's, that's how they're translated in this English translation. The dog faces. The dog faces, which obviously like, if you're just like sort of scanning a page, like dog face is going to jump out at you. But, but he has like, he has, he has these, this legion of cannibal dog faces that, that sort of like that he converts and then like, you know, other people try to try to kill him or try to do him harm and the dog faces actually turn and defend him."}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":2864.25,"end":2865.33,"speaker":"Jonathan Pageau","text":"Become guard dogs."}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":2865.33,"end":2874.01,"speaker":"Richard Rohlin","text":"Yeah, yeah, they become guard dogs. Like it's exactly the symbolism of a dog. Right. You can have a wolf or you can have a guard dog. Right. And that's what they become."}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":2874.01,"end":2874.33,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":2874.33,"end":2874.73,"speaker":"Richard Rohlin","text":"And you see."}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":2874.73,"end":2897.7,"speaker":"Jonathan Pageau","text":"Yeah, it's basically the same as Saint Mercurius. It's just that. And it can also then understand these images of the dog headed St. Christopher as being a soldier. Like these soldier images of the dog headed St. Christopher. Also, when you understand the other legends of Cynocephali that existed in the world, you can kind of see why these images kind of glue come together and manifest it the way they do."}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":2897.94,"end":2907.14,"speaker":"Richard Rohlin","text":"Yeah. I'll just read this little bit here after this. Our Lord Jesus Christ commanded him, I.e. bartholomew, to go to the city of Barbar, that is the city of the barbarian. Nice."}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":2907.3,"end":2908.94,"speaker":"Jonathan Pageau","text":"The city of Barbara, right?"}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":2908.94,"end":2933.98,"speaker":"Richard Rohlin","text":"Well, yeah, Barbara is a Greek word. Right. Because that's what non Greek speakers sound like to Greek speakers. Bar. And he sent him with Andrew the Apostle. And by the way, St. Andrew has lots of encounters with dog faced men in basically every hagiographical tradition. It's definitely there in the Anglo Saxon. There's a poem about it."}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":2933.98,"end":2941.22,"speaker":"Jonathan Pageau","text":"Yeah, the story of abominable, like abominable who then becomes Christian. It's a beautiful little story about the dogged monster."}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":2941.22,"end":2980.32,"speaker":"Richard Rohlin","text":"So he goes to the city of Barbara and he sent him to Andrew the Apostle with his helper to help him. And the people of that city were exceedingly wicked and they would not receive the apostles who were working before them. Signs and wonders. And God commanded one of the dog faced cannibals, so they're cannibals as well, to submit to the apostles and not to resist them in anything which they ordered him to do. And they took him with him to that city and the men of that city brought out wild beasts against the apostles to eat them up. And straight away that dog face rose up against those wild beasts and ripped them asunder and also slew a great many men of that city. And of course everyone in the city converts. This stuff is gnarly, man. This stuff is really, it's really incredible."}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":2980.32,"end":3023.92,"speaker":"Jonathan Pageau","text":"Yeah, but in terms of understanding kind of the symbolism of the barbarian and the symbolism of. It's the same symbolism that the emperor, the Byzantine emperor used in taking the Varangian guard around him. You know, like they're having a foreign guard around you that is only, you know, is only submitting to you and using this kind of foreign power as a way to defend yourself against a foreigner. Like it's the same as the, as the French king giving Normandy to the Scandinavians so that they would have these inner barbarians that would act as guards for the outside. But it's just a more fairy tale or more kind of mythological telling of this pattern which is a real pattern in the world that is important to understand."}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":3024.48,"end":3034.92,"speaker":"Richard Rohlin","text":"Yeah. So I think that. So there are a lot of cannibals actually, as it turns out here in the Ethiopian tradition."}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":3034.92,"end":3119.87,"speaker":"Jonathan Pageau","text":"And the craziest story, this is the craziest story is the story of Beli the cannibal. And this is one of the things, when I went to Ethiopia marked me the most because the iconography of Beli the cannibal is often on one set of the doors, which moves into the sanctuary, which moves into the holy place. And so the story is that there's a man who received guests very similar to how Abraham received these three guests, these three angels. But instead of giving the angels food, instead of feeding the stranger, he receives food from the stranger. So he actually eats the stranger's food. And it turns out that these three guests are demons, and what they're giving him to eat is human flesh. And so when he eats the human flesh, he becomes obsessed now with eating human flesh and then goes out and starts to, like, eat, eat people and just kind of becomes a crazy cannibal eating human people. Until one day he's wandering through the desert, and he sees an ascetic who is kind of there in the desert and asks Beli for a glass of water in the name of the Holy Virgin. Beli gives him water and then continues on his life. And then when Bili the cannibal dies, he comes to the judgment of Christ. And as he is being judged and going to be sent to hell, the mother of God comes and tips the scale to his side, because one day he gave a glass of water, a."}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":3119.87,"end":3121.31,"speaker":"Richard Rohlin","text":"Cup of cold water in my name."}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":3121.31,"end":3190.42,"speaker":"Jonathan Pageau","text":"Yeah, exactly. And so there's. And so what's crazy is that the image that you see on the door to the sanctuary, which you have to remember, is where communion is coming from. So the body and flesh of Christ is coming out of the sanctuary, but on one of the doors of the sanctuary, you have this image of a man sitting, eating pieces of human flesh. So it's like this extreme manifestation of one aspect, of the scandalous aspect of communion being represented. But then if you look at the story completely, it's also a testimony to the universality of salvation and just how far the salvation of Christ is able to reach, even beyond our own judgment and on our own understanding of what is possible in the name of God. So it actually shows two extremes. One is the extreme scandal of communion, the extreme scandal of the most abhorrent behavior of cannibalism, and the extreme of a man who's completely lost and saved for a very small gesture done in the name of the Virgin. So it actually is just. We talk about this manifestation of extremes. It's hard to go any further than that."}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":3190.5,"end":3250.51,"speaker":"Richard Rohlin","text":"Yeah, there definitely should be something scandalous about salvation. And I think that when it stops being just like when the cross stops being a little bit scandalous to us, then we've sort of forgotten what it was about. Right? Yeah. And it's interesting because in Western Christianity in particular, you go and read Scholastic authors. I mean, Aquinas has a whole long discourse about why is the Eucharist not cannibalism. Right. And so he really wants to distance. Probably rightly so. Right. He wants to distance the two things. But then Also in the Ethiopian tradition also, I think probably rightly so, there's a willingness to not shirk away because, I mean, it was a scandalous thing when Christ told it to the Jews people, hey, do you want to be my disciple? If you want to live with me and have my life, all you have to do, you have to eat my body and drink my blood."}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":3250.51,"end":3255.51,"speaker":"Jonathan Pageau","text":"Yeah. That text in St. John, when you realize he's actually just talking out in the public. He's so crazy."}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":3255.67,"end":3345.4,"speaker":"Richard Rohlin","text":"Yeah. And he keeps using, you know, like, this word that specifically means chewing. Like, you gotta. You know, and like. And he's just saying these things to people and, you know, and they're like, well, this is a hard saying. You know, Like, I feel like if the way that you're describing communion, like, is not a hard saying, then you're missing something. Right? And so. So, yeah, I think that's maybe like the ultimate example, like, to put that on the holy doors, like, I can't. You know, I can't imagine. Right. We had this Father Photius Avant, who I think sometimes watches these videos. So if you do, hey, Father Photius, we love you. Yeah. He had this new iconostas carved for his church here in Allen. It's beautiful. It's one of the most beautiful iconostas that I've ever seen. And on the holy doors, there are a couple of. They could be sort of dragons or cockatrices on top of the holy doors, sort of guarding the entrance to the sanctuary. Made instant intuitive sense to me. I was like, that is awesome. That's medieval. I love it. I've had so many people. So did you see the pictures of Father Photius's new iconostas? And, like, I helped unload it, dude. And he's like. And they're like, yeah, I'm just not sure about, like, the. The monsters on the doors. Like, what's that about? You know, so like, even that little bit, like, we know that. We know that. It's not like your bishop has a."}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":3345.4,"end":3350.08,"speaker":"Jonathan Pageau","text":"Staff with two snakes, right? Oh, I can get the cross. Why are you so bothered by this?"}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":3350.08,"end":3389.52,"speaker":"Richard Rohlin","text":"I get that question so much. And I always just send them your article and then they read it and they're like, oh, that's really cool. Okay, good to know. And then it's all good. But. But that's that. So that's the. That, you know? But the thing is, like, we know because it's in the church, because we're used to the idea that everything, like, within the church Especially in the sanctuary, has this deep symbolic resonance. Like, we know that it's not. Well, it's not arbitrary, right. It's like. It doesn't. It's not neutral. So then you have to ask the question, well, what is doing? So I explain, you know. Well, it's the idea of the guardian, right? Like, this is what a cherub is. Right. Is a monster. Who, by the way, the four. The four beasts, the cherubs have their own feast day in the Ethiopian church."}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":3389.52,"end":3389.92,"speaker":"Jonathan Pageau","text":"Really?"}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":3390.16,"end":3395.72,"speaker":"Richard Rohlin","text":"And they have their. It's got its own entry in the synaxarion and it's super cool. Super, super great."}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":3395.72,"end":3396.32,"speaker":"Jonathan Pageau","text":"That's awesome."}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":3396.4,"end":3415.04,"speaker":"Richard Rohlin","text":"Yeah. So I couldn't tell you what day it is because, I don't know, the Ethiopian calendar, they have different months and stuff. But it's really cool. And so you start to explain. Okay, but in the Bible, God's throne is guarded by monsters. We're used to thinking angels. These are nice that, you know, but like."}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":3415.2,"end":3418.32,"speaker":"Jonathan Pageau","text":"Yeah, well, God rides the cherub across the heaven, you know."}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":3418.32,"end":3418.64,"speaker":"Richard Rohlin","text":"Right."}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":3418.88,"end":3427.84,"speaker":"Jonathan Pageau","text":"And it's. It's like. It looks pretty much like a bull with wings, you know, with like. It doesn't. It seems like it's more of a. Of a something you mount, you know?"}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":3427.84,"end":3433.92,"speaker":"Richard Rohlin","text":"So. Yeah. So that said, I don't think Father Photius could get away with a cannibal on the. On the holy doors."}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":3434.32,"end":3464.03,"speaker":"Jonathan Pageau","text":"Yeah, that would be a little much. That would be a little much, you know, although you say that, but. Although there is a tradition of putting the good thief on the northern door of the entrance into the sanctuary, which is not as scandalous, but it shows us the scandal very similar to the scandal of B', lai, which is this one moment of contrition that the good thief has and who makes him the first in paradise, basically."}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":3464.19,"end":3510.72,"speaker":"Richard Rohlin","text":"Right. So we have these verses in Holy Week in the Orthodox Church where we sing about the good thief stealing paradise. And in some Eastern churches. Not in. Not in the Eastern Orthodox Church, but in some Eastern traditions, I think this might be like a Syrian thing, but there's actually. On Holy Friday, they actually have a liturgical tug of war between one of the deacons and one of the priests. What? Yeah, they have this pole or spear and they do a ritualized tug of war right on the entrance to the sanctuary. And this is the. It's basically. It's like the guarding cherub trying to keep the thief out of paradise and the good thief stealing his way in."}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":3510.96,"end":3511.84,"speaker":"Jonathan Pageau","text":"That's amazing."}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":3512.56,"end":3597.67,"speaker":"Richard Rohlin","text":"So that kind of stuff is there, man. And it's interesting because, like, in the Orthodox Church, on. And I know this isn't quite Ethiopia, but it's still relevant on, like, Sundays. The verses that we sing, the stikara verses that we sing with Beatitudes, if your church does the Beatitudes, they're all about the good thief, right? And so it's funny because you'll. You'll, you know, like, talking to our evangelical friends. Love you guys. Somebody's. There's always going to be somebody who's like, okay, but why do I need to do all this stuff? Because the good thief, like, that somehow, like, proves their point and, you know, like, oh, well, no one. No one has ever thought of the good thief before, you know, but actually, if you look at Eastern liturgy, especially Holy Week, is one of the most important stories for us because the, you know, there's a bunch of things going on there, right, that the love and the clemency of God, right? But also, like this hope, you know, like the, you know, that prayer that we say, you know, I will not, you know, speak of your mystery. I will not give you a kiss as to Judas, I will not speak of your mysteries to your enemies. But, like, the thief will I confess thee. Remember me, O Lord, in thy kingdom. So it's to basically say, God, I don't really have anything to bring to the table at the end of the day, but if. If he could get in, then maybe you'll also have mercy on me, right? And so there is that embrace of a scandal that's at the heart of our salvation, which is really beautiful."}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":3598.07,"end":3678.31,"speaker":"Jonathan Pageau","text":"So for me, one of the other things I wanted to bring about to kind of balance out our discussion was to maybe help people understand also the way in which the ark kind of participates in the structure of the Ethiopian liturgy. Because now we talked about the extreme. The extremes in the sense of. Really the extremes, right, of these fringe behaviors and these kind of fringe moments of sanctity that exist a little bit in the Orthodox tradition but seem to kind of fill up the different Ethiopian traditions. But then you also have the idea of containing, which we talked about in terms of the holy text. But we also understand the ark is present in the liturgical life of the Ethiopians through what's called the tabot. And so the Ark of the Covenant is in this chapel in Axum. But there are replicas. They're symbolic replicas. They're not like actual replicas, but they're symbolic replicas of the ark which are present in every single church in Ethiopia. There are very few people supposedly at Least this is what I was told by an Ethiopian man, that there are very few people that make these. That it's a very kind of. It's a very tight group of people that have the capacity to make these little. They're like wooden boxes. Not boxes, like wooden blocks that represent the tablets, really, more than the ark in the sense of the."}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":3678.47,"end":3679.19,"speaker":"Richard Rohlin","text":"Even that name."}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":3679.83,"end":3743.62,"speaker":"Jonathan Pageau","text":"Yeah, they represent the tablets basically, of the law. And they're placed in the altar area of the church, like in the altar, or under the altar, like in the table, let's say. And so you can see how this idea of the container of the sacred kind of just reaches all the way down into the everyday life of all the churches. And what's fascinating about a lot of these tabot is that they're icons, actually, that they're relief icons of Christ on the cross are different. They're not always. Sometimes there's some text on it, or sometimes there's actually abstract symbols on these tabot, but often they are icons. And so the image becomes also this kind of container for the sacred. So it's just important to see how. Just permeating all through the imagery of Ethiopian Christianity, there are these elements of the extreme edge, as both extreme and as container for everything."}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":3743.86,"end":3791.13,"speaker":"Richard Rohlin","text":"And that's why I always go back to the image of the nest, which I like, because the nest is a container that's made out of remnants, like little bits of string and fur and twigs and whatever birds can find. But then it's brought together into this place that can actually shelter and protect something. And by the way, that symbolism of having the little replica of the ark or the tables of the law in your sanctuary is the same thing that we do in the Orthodox Church when we put the mother of God in the apes over the altar. Like, symbolically, it's a very similar function. Right. The understanding that she is the new ark, she is the warm mercy seat. Right. Is one of the phrases that's used of her. So the idea is that she's the."}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":3791.45,"end":3878.12,"speaker":"Jonathan Pageau","text":"Yeah, the seat of wisdom, the mercy seat. All these types of images of the Mother as the container, as the resting place of the presence of God in the church. And so then maybe, just like my last comment on this, you might want to finish with something else, but is to remind people of also this. What started our discussion on Ethiopia was an eschatological vision that was present in the apocalypse of Pseudo Methodius, which is this idea of the Roman emperor joining with the edge, or joining with the end and coming out in the end. Out of this edge. And so you have this idea of the beginning and the end which is manifested in the story of the nine saints as well. That is, you have these Roman saints that seem to come from all over the Roman Empire who go into Ethiopia to find an ark and to find a place where Christianity is preserved and where, you know, to act as this kind of last resting place for all these traditions. And so in their tradition, they have this image of the Roman coming towards Ethiopian. And then in our tradition, we have the same vision in a different form, but of the Roman Emperor in the moment of crisis, hiding in Ethiopia, so that in the end, Ethiopia will stretch its hands out unto God and the last emperor will rise out of Ethiopia and kind of manifest this last glorious moment before the end of the world."}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":3878.2,"end":4038.97,"speaker":"Richard Rohlin","text":"Yeah. The thing I would say to cap this out is also to remind people, why are we looking at. Why have we spent. You know, this is. Was this Ethiopia three or four? I think I can even remember now. It was not four, it's three. I've just been living with it. Like I have a stuff. Stack of books and stuff. I've just been living with it for a while now. So I really have no idea how much of this we've done. But the reason we've done so much on Ethiopia is for two reasons, I think. One is because it's a great proof case. It's a great case study. That's the way to say it. It's a great case study for showing how the stories that people tell about themselves, how the saints that they venerate and how even the sort of dark or ambiguous parts of our histories, right, that all of these sort of contain the meaning and they contain the identity and the framework that that people uses to engage with the world, which is really what universal history is about. So we are going to, you know, people keep asking, like, okay, but when are you going to do, you know, like this or this or this. The reason we've been doing Ethiopia is because a lot of people don't know about it. So they don't know all the cool symbolism. But also because it's. What if I'm going to sit here and talk about what's the symbolism of America, which is the one we get asked for the most? In those comments, people just. And I've hinted at it, maybe one of these days we'll do it. But the problem with trying to do the symbolism of America is that because we all think we know it so well and our audience is primarily, you know, Americans, right? We think we know it so well. There's always going to be. There's a. We're just not as attentive to the weirdness or the. You know, that these traditional shapes and structures that are. That are. They're still manifesting themselves today. Again, like rubbing Lincoln's nose for a blessing. You know, that's something I've done as a child. Right. I didn't think anything about it at the time because everyone was like, like. And that's the thing, like, when you're participating in, like, a cult of veneration, most of the time you're not doing it as a conscious thing. Like, most of the time, like, this is just, you know, like, you go to a concert and you get really amped, you know, because everyone else around you is also really amped. And it's just. It feels like a natural way to be. So. So by. By going somewhere that's like a little. A little bit different, it allows us to sort of, like, look at these patterns with fresh eyes. And so then maybe when we. We turn our gaze to parts of universal history that are going to be a little more familiar to us, the pump will be sort of primed and we'll be sort of ready to start thinking in these ways."}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":4039.05,"end":4080.2,"speaker":"Jonathan Pageau","text":"Yeah. I think also looking at an extreme version or looking at kind of the edge of the universal history in terms of Christianity can also. How can I say this? It can also help us see, like I said, how these stories cross over and how the way that people talk about themselves often, even though the stories are different and the way that it's presented is slightly different, ends up strangely connecting with the way that other people tell stories about those same people. And so there is a way in which we can kind of look through the idiosyncrasy and see that there's a pattern, that there are patterns of identity by which we recognize each other as kind of all participating in this grand narrative."}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":4080.84,"end":4095.4,"speaker":"Richard Rohlin","text":"So we've talked about, I guess, for three videos now, kind of with an outsider perspective on some of this stuff. And I know it's your goal to hopefully get some clergyman from the Ethiopian Orthodox Church on the channel. Yes."}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":4095.4,"end":4115.79,"speaker":"Jonathan Pageau","text":"And so I'm really hoping. I mean, if there are people out there that, you know, that, you know, the bishops or priests or deacons, you know, and you would be willing to talk about Ethiopian tradition from an insider perspective, I'd be very happy to hear from you. And I'll be trying to at least have one conversation with someone from inside the Ethiopian tradition to Kind of explore it from the inside, let's say."}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":4115.79,"end":4128.11,"speaker":"Richard Rohlin","text":"Yeah, we'll see if we would work that out. So. Yeah. Thanks, Jonathan. This has been a ton of fun, and I guess people want to keep hearing Universal History. I definitely have more things to talk about."}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":4128.67,"end":4148.94,"speaker":"Jonathan Pageau","text":"That's great. I'm excited. There's so much to talk about that we'll just keep going. As long as people are paying attention, are excited about this, we'll continue. So, everybody, thank you for your attention. Don't forget to check out all of Richard's projects, like Aman Sewell. And what about what's happening with this book that you mentioned a few episodes ago?"}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":4149.02,"end":4228.37,"speaker":"Richard Rohlin","text":"So Finding the Golden Key. It's going to be an essay collection on recovering the sacramental imagination. I'm still hoping you're going to contribute. We've gotten, I want to say, about 14 submissions. Ish. So far. And a lot of them are pretty great. There's definitely one that was written by somebody dropping some acid, so you know who you are, whoever that is. I don't know. It's. It's wonderful. It was like, oh, I'm gonna just save this because this is. It was just like this long, crazy stream of consciousness. But other than that, we've gotten some really great submissions. So I want to. I still want to hear from more symbolic world people. So if you go to findingthegoldenkey.com you can submit an abstract for a paper, and there's. There's an outline of the kinds of things we're looking for. If you don't hear back immediately, do not panic. You have not been rejected, but the deadline is through the end of this year, so you still have about, as of this recording, about three months to get the abstract together. And then you'll have time after that to write the full essay. So do that in. I don't know if it'll already be in the past by the time this video comes out, but if not here, middle of September, 11th and 12th, I think I'm going to be at Father Andrew Stephen Damek's church in Emmaus, Pennsylvania."}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":4228.45,"end":4228.85,"speaker":"Jonathan Pageau","text":"Great."}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":4229.49,"end":4247.49,"speaker":"Richard Rohlin","text":"And I will be there doing Doxamut Live. We're going to be talking about Tolkien and more Tolkien and Saint Maximus. So please come to that. If you're in the Pennsylvania area. And then in October, middle of October. I always. I never have the dates for these things in my head because I'm just really bad at, you know, calendars."}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":4247.73,"end":4251.62,"speaker":"Jonathan Pageau","text":"But put it in the description. You can give it in the actual dates. Just an event."}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":4251.86,"end":4279.18,"speaker":"Richard Rohlin","text":"Yeah. In October. In October, there's going to be an event in Wichita, Kansas, which is the. The. Which is fourth Rome. And we'll be. There's going to be an event in Wichita, Kansas, at the 8th Day Institute. And I will actually be talking about the Celtic sacramental imagination and the Holy Grail. And I'm going to be giving like two talks on that. So if you're one of the people in the comments who's like, okay, but do Ireland next? Do Ireland next."}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":4279.18,"end":4280.32,"speaker":"Jonathan Pageau","text":"Like, go to Wichita."}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":4280.63,"end":4295.51,"speaker":"Richard Rohlin","text":"Come to Wichita and you can hear all about it. You can also hear all about the Holy Grail, which is basically. I've had this crazy idea that I've been working on for three or four years now, and I'm going to actually try to actually tell people about it in person in Wichita. So come and hear that."}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":4295.51,"end":4303.27,"speaker":"Jonathan Pageau","text":"All right, that sounds great. So, Richard, thanks again for your time and your energy and yeah, I'm still as excited as I was in our first episode. So let's keep going."}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":4303.35,"end":4305.07,"speaker":"Richard Rohlin","text":"Yeah, this is great stuff. Thanks, Jonathan."}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":4305.07,"end":4305.67,"speaker":"Jonathan Pageau","text":"All right, bye."}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":4305.67,"end":4305.85,"speaker":"Richard Rohlin","text":"Bye."}
{"episode_id":"SW - #184 - 2021-10-25 - Richard Rohlin - Extreme Ethiopia","start":4306.32,"end":4368.21,"speaker":"Jonathan Pageau","text":"I hope you enjoyed this episode of the Symbolic World. The Symbolic World is based on a series of videos that you can find on my YouTube channel, Jonathan Pageau's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that. That it's quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by, of course, leaving a review on itunes. Everybody knows that's the best way to get the podcast out there, to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon the Pajo videos as well, and on subscribestar, all those links you can find on my website or in the show description. So thank you and I will see you soon."}
