{"episode_id":"SW - #255 - 2022-10-03 - Authority on the Right, Power on the Left","start":0.24,"end":1298.79,"speaker":"Jonathan Pageau","text":"One of the important aspects of the symbolism of the right and the left has to do with authority and power. That is the two ways in which influence can be conducted on others, on the world, on society. And so what I want to do is I'm going to continuing my last video on the symbolism of the left and the right hand. I'm going to continue in this direction, but we're going to look at how the symbolism of left and right applies to. To the very important aspect of authority and power in the world. This is Jonathan Peugeot. Welcome to the symbolic world. So one of the important aspects of symbolism, as I've often said, is that it is fractal. That is the symbolism of the left and the right, as I've talked about in my last video about the dasis of how it appears as the figures that are next to Christ, the Mother of God, St. John the Foreigner, St. Peter, St. Paul. But that symbolism is already included inside the icon of the Pantocrator. The icon, the pantokratur, is the image of Christ as the returning Christ, or the Christ as the ruler of all, as the judge of all. And so you have a beautiful example here by the contemporary iconographer Aiden Hart. And so in this image, the image is separated left and right, and on the right side of Christ, or on his right, he is blessing with his hand, and on his left side he is holding a book. Now, already in this structure, you will see that the basic symbolism of the left and the right is being maintained. And even the crossover between the symbolism that I mentioned in the last video of how one seems to move into the other, you can see something like that already in this structure. And so Christ is blessing with his right hand and this symbol that he does, this manner in which to hold his hands, we say that it is a blessing, but the origin of this is actually the hand of a dress. That is, it is Christ addressing us. And of course, we've come to interpret that as a blessing. In the Catholic Church, for example, you will see priests that will bless making this gesture. You also sometimes see Orthodox priests do that as well. But it has. So the notion of blessing and of address has come together. But what's important to understand it is something like direct influence. That is, if I speak to you, if I bless you, if I address you, I am directly as a person influencing you, right? My. My relationship with you is direct, but at the same time it is also flexible because orality has an impermanence to it in terms of its manifestation, right? So I say something and Then it vanishes, right? It only, it only is retained in your memory. It doesn't have physical instantiation. So because of that, it is also more flexible. So it's direct and it's flexible. And on the left hand, he's holding a book. Now, this book is interpreted in several ways. Some people sometimes say it's the book of the Gospel, but it's better to understand this book as the book of life that's described in Revelation, the Book of Books, right? You could say it's just a book or the book of Books, right? Is the best way to say that. But what's important to understand the difference between, of course, the right hand and the left hand or the address and the book, is that the influence of a book is indirect, right? So I don't have the person in front of me talking to me. I've got something that they've said that is written on a piece of paper. And now there's a distance between what the person is saying and the book, right? So I've talked about how the right hand is a stand in for the center. The right hand is a moving towards the center. In this case, it's a straight direct influence, and the left hand is moving away from the center. And, and in this case it is this distance which appears in writing, but at the same time it is also fixed. And so you can understand, if you look at, even at the Last Judgment, you can understand that the direct address is a living. It's a living breath, it's a living influence that I'm having on you. Whereas the left hand and the book is more dead, you could say, right? Because it can become dead letter, right? It's not just that, but, but it can become something like dead letter, where it's just a, where the text has lost its spirit. That's a possibility. So you can understand now why the, the, the right hand and the left hand is represented this way in this image. Now, what's important to understand in the basic structure of the Pantocrator is that this is based on a Roman tradition. It's based on ancient Roman art. And so I will show you. This is a statue of the Emperor Titus. And in the emperor is doing two things. With his right hand he is addressing, and with his left hand he is holding a scroll. And so you can see the same structure in this image. I could have shown you other images, but this is, this was the one that I had where you can see the Roman emperor as using that duality, right? Addressing with his right hand and then holding the scroll in his left hand. And this structure is understood by most art historians as also representing authority and power is the way that the land would have said it. And the structure of authoritas and potestas is the basic structure to understand the manner in which Roman society functioned. And so the way that Roman society functioned during the Republic, you had the senators. Now the senators, they actually didn't have an explicit role in the managing of the nation. They didn't have power in the immediate executive power. What they had was influence. And their influence was based on who they were. That is, it was based on them. You know, they were supposed to be wise men, men that were recognized by all as having authority in their person, in their example, in their lineage. You know, the fact that they were part of certain families. And so it was really, it has something to do with who they were, which was giving them authority. So you can see how this directness of a person like, I have done great deeds in the past, and because of these great deeds, I'm chosen to be on the Senate, or, you know, I come from this lineage that's been important in the city of Rome. And so because of that, I am now in this influential position. But the senators didn't have power to execute anything. And that power to execute was what we call potestas, which was magistrates. And different people would receive the power to do things. So some of the power would be to enact certain laws, some of the power could be to do certain projects, and then sometimes it would be to go to war. And so the ultimate power would be something like imperium, which would be the power that is granted to you to now go out and fight on behalf of Rome and to accumulate other lands and riches from other people in the name of Rome. And so you can see how those two are related. Now, the potestas would come from the senators to a certain extent. That is, the senators would give advice, would suggest, would tell people what they should do. But that telling had no legal weight. It only had legal weight if it was enacted in other parts of their system toward the magistrates, who would then enact that law. Now, what happened in the emperor is that those powers were brought together in one person. And so that's why we see that the emperor is, is addressing with his right hand like a senator, but he's also holding that scroll. And that scroll is seen by art historians as also a stand in for potestas. That is, it's the law that's written down, it's the edict that's written down. It's like, this is what we're going to do. It's the paper that makes it that he can show to others to prove that he's allowed to do what he's doing, okay? And so one is direct and has that. That direct influence of authority, and the other is indirect because it's written down and because it's, it comes from above, you could say, and is implemented in the world. And so this structure of authority and power of atoritas and potestas became the backdrop for the manner in which all of Christianity, both the east and the west, understood their, their legal system, okay? And it comes in Christianity, that same kind of structure of these two direct and indirect influence of a comes all the way down in a certain image which we call the traditio legis and traditio clavis, which is a Western tradition especially. But you see it in, you see it in very early art, and it gets developed in the Middle Ages. Where you see, on the one hand, Christ giving to the one on his right, St. Peter, he gives the keys, and to the one on his left, St. Paul, he gives the book. And so the keys, of course, the keys are the same as the addressing. It's like the keys are a direct influence, right? With the keys, I can open and close, I can bind and I can unbind things. I can bring them together or I can let them loose. And so this is a direct influence that Christ gives to the apostles. And it's represented as being given to St. Peter. And then of course, there is the new law, this more external aspect, the new rules, the book which is given to St. Paul. And so that makes sense with St. Paul representing also the apostle to the Gentiles, the apostle to the outsider himself, being an outsider being, you know, the illegitimate apostle, you could say. And with St. Peter holding the keys and being the stand in the stone on which Christ built his church. And so you can understand, and it's super interesting to see how that relationship can sometimes be fruitful. Like in the case here where we represent them as the two pillars of the church, this Yachin and Boaz, that hold the church together. But they can also sometimes become hostile. And it's interesting because in the way they can become hostile, there's like a crossing over which happens, and it has to do again with this crossing over of the, of the, the left and the right. And you can see that with St. Peter and St. Paul on the question of circumcision, which is interesting, which Is circumcision is the manner in which someone was marked in order to participate in the center, but it's also a kind of external mark. And so there's this interesting thing going on, and St. Paul challenges St. Peter about circumcision and saying that you don't need this external mark in order to participate in the body of Christ, you have to be circumcised in your heart, you know, and so he brings it inside. And so there's this interesting dynamic that is happening that plays with this crossing over of the left and the right that I've talked about in the last video. So you can meditate on that because it's sometimes hard to keep them in your mind. But if you perceive it slowly, you'll notice that there really is this duality, but this duality that crosses over. And of course, this relationship will happen in many guises. It will happen in the west in terms of the relationship between the pope and the emperor, between the pope and the king. And so here the direct or higher or direct influence will now start to be seen as spiritual influence. And the power, the potestas, the executive power, will then be seen as the secular courts, the kings, the emperors, the secular authorities. And so you can understand how this now in some ways has been transformed a little bit, but it also follows the same pattern. And of course, the two headed Byzantine eagle is a wonderful example of that. To help you understand this relationship of this duality of the two eagles, one representing religious authority, the other representing temporal power, being held together by a common crown. Right? You could say that this is the crown of Christ or something like that. There's a higher crown and then that crown gets separated into two crowns, one which is spiritual authority and the other is temporal power. And in this particular version, you hope you can see it, you can see that it's very explicit that that's what at least this version is dealing with. Because the one talon of the eagle is holding a cross and. And the other talon of the eagle is holding what's called a globus cruciger, which is a symbol of temporal power. Now, this symbolism is fractal. And so there can be different versions of that. And so it's not always spiritual and temporal, but it will always have this duality of direct and indirect, or let's say masculine and feminine sometimes. And so, for example, a good example would be like a king would hold in his hand a rod and a globus, and so he would have a scepter in his right hand and A globus in his left hand. And so you, you have a straight and curved, a straight and crooked thing, a round thing and a straight thing. And you can understand how the right one has to do with authority. That is, it's like you point at things and you say this, right? You point with your staff at things like a magician points at his staff at things. And with his left hand, it's the thing that he's holding, he's holding the globe in his hand. And so it's a kind of, it's a holding of land or a holding of power or a holding of this petestas. And so you could have different versions of that. So there are some versions of the two headed eagle, where instead of having a cross and a globus, the eagle will have a sword and a globus. Or, you know, it could have, I don't know if it exists, but there could be one that has a staff and a globus, you know, and so it's, it doesn't always refer exactly to the same particulars, but the structure is there that you can recognize being repeated over and over. So you can understand in the manner in which it would happen, there would be different ways that it would be played out in the world, this relationship between, between authority and power, between the right hand and the left hand. Sometimes it could be fractal, like even down at the. You can notice how fractal it is if you look at the keys here, for example. And so again, St. Peter, for example, holds the key, but you can understand that one of those keys is on the right hand and one of those keys is on the left hand. They kind of cross over because one is to bind and one is to unbind, one is to tighten in the center and one is to loosen. So you can understand that it happens fractally. So even on the right you have. It can be repeated at different levels where you have again the same symbolism which is repeated. So that's important to understand because sometimes if you don't understand that it's fractal, it can become confusing because you're like, okay, well then why. So if left is something like unbinding, pushing away, like St. Christ says about the goats, and right is something like binding or bringing in. So then why does St. Peter have the two keys, one to a lock and one to unlock, one to bind and when to unbind? And so it has to do with that. And so you could say that St. Peter as a stand in for the center, has a left and a right hand himself and can manifest that at a lower level. So that's just a little hint to understand that as well. And so this can play out in different ways. So for example, in the Middle Ages, of course, Charlemagne, for example, was crowned by the, by the Pope. And in the. But there's always like a test. If the, if the two sides don't get along together, the two sides can fight for the crown, right? The lion and the unicorn fighting for the crown. You see that in that type of imagery where you have on the one hand the unicorn with its, with its one horn, with its staff, with its representation of a stand in for the central thing and then the lion, that is the powerful, you know, beast that will devour and that will, that, that is violent. And so you can understand the symbolism is everywhere if you, if at some point you can see it. So for example, in the Byzantine representation there'd be all kinds of play related to this. So for example, the, the, you know, of course the patriarch would crown the emperor, but then the emperor in church would come up to the holy place and would usually bring the offering to the holy place. It's like I am the one in the world who is dealing with all this stuff and so I bring it to the holy place and then it's brought into the holy place in order to be consecrated. And so there are different ways in which this would play out, but it's important to kind of understand these two aspects, to understand them, of course, in the world, but also to understand that they're related to the way we look at the Christian ark. And so I want to look again at this transfiguration, because the transfiguration, the reason why I want to look at it is because in the last video I talked about the relationship between Elijah and James and then between Moses and St. Peter and how there's this crossover. But symbolism works on many levels at the same time. And so there's also a manner in which in the Bible, this right and left hand is also related to the prophetic and the priestly. And so you see that of course, in our tradition as well, where you have the saints and then you have the priest and the official, let's say the official structure of the church. One is direct and flexible, right? The prophetic is direct and is, if it's not, not careful, it can sometimes be a little too flexible, you could say. And then the other is indirect because it's a hierarchical structure, you know, that is functional, but then it is also fixed. It has A more fixed aspect. So you can see that in the image of the transfiguration, where Elijah now in this case represents the. The prophetic and this direct relationship to God. And then Moses is the one who receives the law and so also has this external part to him, so it's fractal. So Christ is blessing with his right hand and he's holding a scroll in his left hand, but then on his right he has Elijah, who is this direct, this image of the prophet and the direct relationship. And then Moses, who is the. The book and the indirect. And so I know this can sound to some people like it's a contradiction between what I said in the last video. But hopefully you'll start to be able to see how symbolism is not a system. And it has coherence. And that coherence can manifest itself at different levels, but it's not the type of coherence which can be reduced to a system. It's more. It's coherent like a poem, a coherent like a song. And so it can function at different levels at the same time. So hopefully this was useful for you to understand a little bit more about how important this relationship of the right and left is. And maybe you can meditate a little bit about how if in the ancient world, the right and the left were seen as authority and potential and power, how it is that right and left today are used in ways that are symbolically accurate to represent the basic divide in our political thinking. And I think that if you start to think of the crossover of how some of these categories cross over, it might help you understand the manner in which the right and the left. Because some people are surprised. Like some people are saying, why is it that the left wants more government? And it's like, think about it, think about it in the terms that I'm telling you about this crossover between that which is indirect and moving away and that which is also fixed, whereas the other side is direct and related on authority of the. Of the person, but is also more flexible. And so that's something that you can think about, maybe go nuts in the comments and we'll see what happens. So thanks everybody for your attention and I will talk to you very soon. I hope you enjoyed this episode of the Symbolic World. The Symbolic World is based on a series of videos that you can find on my YouTube channel, Jonathan Pageau's YouTube channel. You can also get involved through. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course, leaving a review on itunes. Everybody knows that's the best way to get the podcast out there, to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon, the Pageot videos as well, and on subscribestar, all those links you can find on my website or in the show description. So thank you and I will see you soon."}
