{"episode_id":"SW - #257 - 2022-10-17 - September 2022 Q&A","start":12.08,"end":5177.89,"speaker":"Jonathan Pageau","text":"This is Jonathan Peugeot. Welcome to the symbolic world. Okay, so hello to whoever's there. I don't think there's many people there today for the beginning of the Q and A. There's a weird lag in my video and so it might take a while for me to notice the questions in the chat, but. All right, and so a few announcements before we start. As some of you know, I was in, in London for. I was in London for the, for the last week with Jordan Peterson and it was pretty, pretty wild. I mean it was pretty wild in the sense that it was really interesting. I went to an interesting meeting with people that are hoping to offer a different alternative to the narrative, let's say that we're dealing with on the world stage, which was fascinating. And then I was also on stage with him at the Apollo theater. It's like 3,500 people. I don't think I've ever been in front of so many people, which was wild. And a few other things. You'll see. We did a conversation with Mohamed Hijab. I don't know if that's going to come out. We'll see. We had. It was an interesting discussion. Hopefully that will be made public as well, but maybe not. We'll see. So first of all, apologies again for people who've been struggling to sign in to the website. It's a frustrating thing that is going on, but we're going to launch a new website. I. We hope in a few weeks, like mid October is what we seem to be aiming for. So because of it, it's just the energy to fix the current website seems like it's not there. So hopefully when we get to, to the website, all of this will, will be settled and things will be in a good situation. So. So yeah, so let's go, let's start. And so as people know, for those who support me on patreon or through PayPal, on the website, people can ask questions in advance if for people who give a certain amount. And so that's how we get the questions and then, and then those that show up on the chat. I also will answer question in, in the chat as well. So let's see. Let's start with a question in the chat. Actually it says why is identity an invisible center, a story signified both from an origin above it to which it returns and from its outer product from which it departs, as well as allow and exist for, for offspring? Your question is. Isn't super clear, but yes, the identity is an invisible center. That's the best way to understand it because it's something which cannot be found in the elements that constitute the identity but exist, let's say above, beyond it, or the man in which they come together. And so that's the way to understand the center. All right, let's start with the symbolic word website. So David Flores asks. I've been thinking about authority for a while now and was excited to see your left and right hand videos. One aspect of authority that I feel I often, I feel often gets forgotten is control of power or domain specifically not using the power you have. Just because you can exercise authority or power doesn't mean you have to or will at all times. In your recent videos on the right and left hand, I felt like the crossing over you were describing is something like this. When the right doesn't exercise its power, it looks like the left and vice versa. Does this line up with your ideas? And if so, could you elaborate on it? Yeah, I'm not sure. No, I'm not sure it lines up with my, with my ideas especially that I've been talking about how there's a difference between authority and power. Let's say at least that's the way that I describe it. And so if you're, if you're kind of dealing with that, then I'm struggling to see, yeah, I'm struggling to see what that means. So sorry, David. So I hope I'm going to be okay during this Q and A because since I got back from London I've been sleeping like 12 hour days every day and I'm really struggling to like for some reason to like get back on top of things. So hopefully that, that won't affect too much the discussion. So Benjamin Wood asks, as a polyglot, what is your sense of how English grammar and vocabulary shape contemporary discourse? I've heard that English and Latin both have a tendency to reify concepts that Greek and other continental languages are less prone to. But I can't evaluate these claims. If true, how significant a problem is it that English is the lingua franca of both science and the Internet? Well, English is definitely, I mean, I thought about this. English is definitely something like, something like the language of the end because seems to be very open to multiplicity. Like it seems to, to be able to absorb anything, like to absorb, you know, the Germanic languages and also the Latin languages and you know, whatever works seems to be able to be absorbed into English. And so on the one, on the one hand it definitely makes it a very powerful language because it kind of, because it it can just absorb things. And so it seems to, it seems that like, English culture in general, like a kind of Anglo culture in general seems to be pretty good at finding the balance as it absorbs different things. You know, that. I guess that's part of what English history is about, you know, all these different groups coming in and taking over. And so, so language has that. English definitely has that characteristic, but it also, it's interesting because, because of that characteristic, it also has a kind of richness in terms of possibilities that other languages don't because it often will have in the like. So in English you'll often have both the Germanic, you know, Anglo Saxon word and then the Latin word. And so you have a lot of vocabulary and it, and it's very different. You know, the German, the kind of Anglo Saxon words and the Latin words are very different. So, so it's definitely interesting for sure, as someone who's bilingual, especially someone who knows French can make you, it can make you look like you're smarter in English because you, your normal words in French are the Latin words. And so it can make you sound like you're really smart because in English, some of the Latin words are usually a little more snooty or something. Like they're, they're, they're more, they seem to sound smarter, but for French they're just a normal word. So it's, it gives you an advantage there. Hopefully, hopefully, hopefully that, yeah, but I have noticed that, I've noticed that. But sometimes I use a word which is just a normal word to me, but it comes, it comes from French. And then people will react as if I used a really fancy word. And it's like, well, maybe in English it's a fancy word, but I don't think it's that fancy in French. All right, so Shane Carlton asked what is the proper way for a lay member of an organization to help orient the head to problems that are rising in the organization? The main problem I'm seeing is the significant infiltration of non traditional Christian values into a Christian organization and how to combat it. Yeah, it's very difficult. I mean, we're in a difficult situation, especially in terms of Christianity. And so I think that, I think that you definitely need to, I think the best way to understand it is you need to live those out on your own. That's the first thing. And then you also need to communicate it clearly to the, the people in power, the people that are in charge. And you can do it a few times in different ways. And in this particular Time. I think that at some point, if. If it gets too bad, it's probably best to go. Like, it's probably best to leave that organization. I know that that's at least what's important is at least not to try to cause some kind of. To kind of have a revolutionary attitude within the Christian organization and not try to, let's say, upend the leadership. But at this point, at least try to find another parish. Like, at least another parish where things aren't so bad, depending on what church you're part of. But, yeah, it's a difficult. It's a difficult question. All right, so Lance Whitehorse says, can we understand nation initiation as embodiment? I'm curious about the use of ritual to sanctify an initiation of a person into a member of the tribe. I mean, I wouldn't see it as an embodiment. I would see it as definitely a way of join. Yeah. I mean, of joining to the body. So, of course, initiation is a way to. To make the transition between the outside and the inside. That tends to be at least one of the functions of initiation. At least that is definitely what circumcision is and also what baptism is. And so. So, yeah, so it can't. It's related to joining into a body, let's say. All right. And so Corey Coble asks, can you talk about the symbolism of soldiers or warriors? They have monster characteristics, and so maybe belong on the periphery defending the church, but also have a proper place in society. And so, yeah, you definitely have a point. I often talk about that. There's something about soldiers that people that stand on the wall, that they actually have a lot in common with your enemy, and they almost have to have something in common with your enemy in order for them to be soldiers. And so they tend to represent. They represent order in the sense that they're connected to the center, but they also represent the periphery in the sense that they, like, yeah, they're the wall on the side. They hold the weapons. And so that is something to think about in terms of how they. How they manifest themselves as protection. You know, a policeman has more in common with a criminal or a prison guard has more in common with the inmate than with normal people in society. There's something about that which is true in terms of soldiers. And so that's why you can kind of understand what happens sometimes with the question of mercenaries and the problem of mercenaries, the idea of soldiers for hire and all that. But there's definitely. They definitely have a place in society, but it's A difficult place. It's always a difficult place. All right. James Orange asked, can you explain the significance of the following passage? Luke 11:24 26. When the unclean spirit has gone out of a man, he passes through waterless places seeking rest and finding none. He says, I will return to my house from which I came. And when he comes, he finds it swept and put in order. Then he goes and brings seven other spirits more evil than himself, and they enter and dwell there. And the last state of that man becomes worse than the first. Thank you for everything you are doing. And so this is about the problem of the need for spirit or the need for principality. There needs to be things that manage you or that inhabit your house. You could say it that way, the way that scripture talks about it. So it's talking about the problem of wanting to get rid of certain bad habits or certain bad aspects of reality, but not replacing them with something better. So if you don't replace a bad habit with something better or worship or just something better, I mean, of course worship is the ultimate version of that. But if you don't replace a bad habit with a better habit, then you're actually opening yourself up for rush, like a rush in of the passion you had with seven more with it. So I've used this example before in terms of a diet. You know, if you diet and you're not careful and you kind of push yourself to the extreme and you just stop eating the things that you like and you don't have anything to replace it. Like, you don't. You're not thinking of how to replace. You're just removing the things that you tend to go to. Then you're going to binge. You know, you're going to find yourself eating way more than before. And it's the same with a lot of the passions. You, you know, you have to be. You have to be careful when you try to eliminate something bad, because that's. Because of that. All right. So Cormac Jones asks. Greetings, Jonathan. Given what you said about bathrooms and identity, would you further say there's something about menstruation that would train a woman to perceive what builds up on her uterine walls? Dude. As beyond the boundaries of her bodily identity, such that any zygote that is planted there should be intuitively perceived as not her body? Is there an argument to be made from emergent natural law that life begins at conception? An argument that is that does not rely on revelation emanating from above, like the Gospel story of annunciation is There a way to divvy up the phenomenology of childbearing so as to identify where the mother's life ends and. And the child's life begins? Or is that like the beginning of a life, a mystery where our minds cannot tread without revelation from above, unknowable by natural law? I've never thought about what you're saying there. I've never thought about what you're saying. It's a very strange perception that you had that the idea that because a woman ejects monthly some aspect that something that's inside her as an outside, then that would be like a pre. We tend to see it at the opposite of that. Like, we tend to see it as a. As a kind of side effect of fertility, you know, and something like a failed union. That's why if there's no union, then there's like a residue which is produced by the failed union. That tends to be the way that, at least I understand it. So I've never really thought about what you're saying and the way that you're saying it. And so I think that the problem, like the problem of what you're asking is really a problem in a world where having children is not the ultimate value. And so the question of when exactly life begins. And so we could say conception, you know, in some ways I'd rather say that, but there's a manner in which that question becomes a question. Only if you think that you would want to not have children, but in a world where having children is a blessing and is something that people want, then, you know, it's like you wouldn't even try to ask that question. You'd just be happy that you're going to have a child and that you know that a new life is going to come from you. And so I think that that's my answer. You know, it's like. Think that that's my answer. And if you're in a situation where you shouldn't have gotten pregnant, let's say, and where getting pregnant is. Is as a social embarrassment or is a moral problem, then that's probably the reason why you would ask that question. And so in the very. Let's say, even in a world where, like, in a world where childbearing would be very valuable, you can understand why someone would want to ask this question would be in a moment where they. They got pregnant through some. Some other means that aren't through through marriage. And so, so I think that that's my best answer is that if we value life and we value the next generation and we think that that's very precious. Then we won't try to answer that question in a technical way. So that doesn't give you a lot of stuff in terms of legal and in terms of defending the question legally. But the problem of defending the question legally is also difficult in a world where people don't care about. About children. And so it's like, how are you going to, you know, how are you going to change, make, let's say, make abortion illegal in a world where everybody thinks that, that having a child is not the most valuable thing you can do it. But it's going to be very difficult. I mean, it seems like there needs to be a deeper transformation for that to truly be reversed, let's say. All right, so Samuel Ramalera asks. Hi, Jonathan. God bless you. You've said once that Jesus manifests all the true patterns and the twelve apostles also participate in that by manifesting patterns that will fill the world. I've come to understand how Peter and Paul manifest that in their symbolism and in the story of the church via the left and right hand patterns, especially in the West. You've also talked sometimes about Judas as a type of Antichrist. But how do the other apostles fulfill the world like that? Well, what is the symbolism related to them? Also, when will the Universal series with Richard Rowland return? This series needs a great comeback. Yeah, we're definitely going to start that very soon. Richard was traveling. He went. He was traveling with Father Andrew Damick, actually. And so they're back and so we'll start soon. I think we even have a date. I don't even remember when it is, though. So how did the other 12 apostles fulfill the world like that? And so it's interesting because you've got a point. Like a lot of the twelve apostles, the symbolism of the twelve apostles seems like it's lost or that we don't know much about them. There are certain apostles that definitely have, that definitely have some tradition that are important. For example, like St. Andrew, he is the one who kind of evangelizes so much of the world. And he's shown with his wild hair, he kind of goes out into all these places. You also have, of course, the apostle tyranny, Thomas, who goes to India and has all these traditions related to him in India. And then there are a few others. But it's true that most of them seem to kind of be lost to us. But you can understand it just in some ways as a cosmic image, as the 12, you know, and so you have the 12 months or the 12, you know, the 12 signs of the zodiac. You have the 12 tribes of Israel. And so that's the way to understand it. It's basically thinking of, let's say, moving out from the center. If you look at the description of how the camp of Israel was supposed to be set with the tabernacle in the center and with the tribes kind of all around it, all these, these 12 and a half tribes or whatever all around the, the tabernacle, you kind of have to understand it that way. So it's like an extension of Christ into the world. So I imagine instead of the tabernacle, you have the entire cosmos as the place. And that's what you see in the image of Pentecost when you see the 12 flames kind of spread out on the disciples, but imagining it like, spread out unto the whole world. So that's a way to understand it. But it's true that some of the specific, especially the disciples, especially the 12, like, some of that symbolism is lost for sure. So. All right. And so Tobias Lundqvist asked, when Adam ate from the fruit of the tree, he blames the woman for his sin, who in turn blamed the serpent. And so the serpent became the first scapegoat. Jesus reversed this by turning himself into the ultimate final scapegoat and took the sins of the world upon his shoulders. Is it reasonable to assume that if Eve had not blamed the serpent, then God would not have cursed the beast and our animal nature would not have fallen? Interesting. Likewise, if Adam had not blamed Eve, then she would not have been weighed down by the curse either, and our feminine imagination would not lead us astray. Thanks highly appreciate your work. And so I think that these kind of speculations, they're not that useful because you kind of have to understand it as a single move, right? As a, as a single move, that is, that is the move of taking divinity for yourself means that you're acting, right? You're. You take divinity for yourself in pride. And so that is almost the same in its very nature as, let's say, blaming the other for your problems. And so, you know, if you're not God, right? And so if you, if you want to be like God and you, you eat the fruit, that is, that will make you, you know, if you take for yourself the idea that you are going to be like God, then what are you going to do? And so you have to blame others for your, for your problems. And so you're right, though, that Christ definitely inverts the whole story. And inverts the process because he does also eat the fruit, but he also takes the blame. And so even though he's innocent. So it's like really the opposite of the story of Adam and Eve. Adam and Eve take the fruit and then blame the others for the consequence of eating the fruit and are guilty of disobeying. And so Christ takes the fruit in obeying the will of God, as you see in the garden of Gethsemane the night before, it's important to see that that's what's going on there as well, that he is actually obeying the will of God by eating the fruit and then accepting the consequences of that and dying. So it really is a flipping of the Genesis story in many, many ways. And so, all right, so Mark Johnson asked, what is mercy and grace? And so they're not exactly the same. They're related to each other, I guess, but they're not exactly the same. It's the same also when people talk about rigor and justice, they're not exactly the same. They are kind of related. The way that I see mercy is mostly about the notion of letting go, right? Or not holding against someone and therefore not holding what you could hold against them. And so basically letting people come to you despite that, you know, and so you could say that mercy is when. Mercy is when you. It's like someone does something against you, and you would have every right to be angry and would you just kind of let it go in order to bring that person in communion with you? That's the way that I understand it. Grace in terms of. Especially in terms of orthodoxy is very different. Right? Grace, at least in orthodox theology, is really the manner in which God, let's say, reveals himself to us. Know, we talk about the relationship between grace and God's energies. The idea that it is the presence of God in all things. And the presence of God in the world is. Is through his grace. Through his. The manner in which he's hiding behind all things is the best way to say that. Okay, so let's go to subscribestar. Just one question on subscribestar. WelshX asked, Dear Jonathan, have you ever visited a Catholic Mass in the old Tridentine Rite? Can you say something about the symbolism there? For example, using the Latin language in white may be a danger or not to change this old liturgy. Thank you so much for your work. And so, yes, I have been to a traditionalist Catholic Mass. I enjoyed it. I think it was beautiful. I've been to several and I kind of understand or sympathize to a certain extent with the Latin in the sense that there's a sense in which, at least in the West, Latin is the language which kind of holds the west together, which makes it something, you know. And so I can understand why some people hold on to the Latin Mass, but I also don't believe that you necessarily need to have the liturgy in Latin for it to be valuable. I think it is valuable to understand the words of the liturgy, you know, and so that's why I do prefer. It's funny, because it seems like in the Catholic Church, you can. It's like you can't have. You have one or the other. You either have the Old Rite or the Trinitine Rite in Latin, or you have the Vatican II rite in your language, but for some reason, there doesn't exist, you know, a Tridentine version in your local language, which. Which is interesting. I don't know. In Orthodoxy, translation has always been an important part of. Of the Church and of. And, you know, because when they converted the Russians, they immediately translated the liturgy into. And Slavonic. And then the same with all the other countries, you know, when they. When they would be evangelized, the liturgy would be translated immediately. Well, not immediately. Sometimes it took a bit of time, but it would be translated ultimately. So, yeah, I tend to prefer that myself. All right, so we're moving to Patreon. So Hephaestus, sad little hammer asks. Hi, Jonathan. I don't understand what glory is. Okay, for example, you oppose death with glory. I don't oppose it. I say they're the same. Why didn't I say that death is different from glory? Why not oppose death with life? I asked my priest, and he said something I need you to explain. He said, glory is another word for the uncreated energy, which is God himself, His presence that we can experience, also called grace. Glory is often used to describe God's visible presence manifested as light, cloud, etc. Can you perhaps interpret what he said for a weak little foreigner like me? Thank you so much. A weak little foreigner. So your priest is right. And so, of course, your priest is right, but he's talking about the glory of God. And so, of course, you're not God. You also have a glory. Every living things have glories, but the glory of God is very specific because God is the source of all things. So you can understand glory as something like the overflowing of you. And so you, you know, as a person there, you have extensions of you which overflow from you. So you have Manifestations of you in the world. And so that glory is your reputation. That glory is the stories people tell about you. That glory is the things you do. It's your works, your works. It's the things you leave behind, you know, it's the things you've created. All those things participate in your glory. So you can understand it really as. As an extension of your being out in the world. Okay? So that's why, you know, it's like an athlete wins a competition, and that's his glory. He has glory. So we glorify him, we give him a medal, we add things to him in order so that we can see his glory. Okay? Now, in the sense of God, it's more complicated because God is not that. Say God is the source of all things. And so you can understand the glory of God as the manner in which God fills all things. It's an over. If you can understand, like an overflowing of God. It's the works of God. It's the way in which God manifests himself in the world. It's everything that makes us see God or encounter God. Okay, but the idea in orthodox theology is that that glory and that grace, like we mentioned before in the early question, is not separate from God. It's actually God himself. And what it is, because God is the source of all things, it becomes the underlying reality of all things. And so God is hiding through his glory. So all the world is full of his glory, right? You've heard that before. The world is full of God's glory. That is, the world is an expression of God. That is, God created the world, and so it is full of his glory. And his glory underlies it and is actually causing it. So that's maybe the difference between God's glory and our glory. But you can understand both as the same. And so the way to understand it, so if you look at the way that it's described in scripture, you can kind of understand it, is that if so all these overflowing things, if they are connected to God, then they are God's glory. If they get cut off from God and they're seen as having being in themselves or having value in themselves, then they become idols because we aren't linking them properly to their true source. They aren't vehicles for us to see through them God present in the world. And so that's true for God, but then it's true also for you. That is, if you're overflowing, that is, if the works you do are not done ultimately in the service of God, you know, in the proper alignment with God, then those works which are your glory will be dead. Right? And you can understand so many things about how the, you know, in the, the epistles, how this is discussed. It's like on the one hand, St. Paul says things like, you have to run the race, you know, win the race, get the crown, all that kind of language. And then right away, like immediately, a bit later, he'll say things like, you know, works are dead. They have no value in themselves. Okay? And so you can understand it similarly to the man in which God's glory fills the world. It's like your glory can fill the world to a certain extent, but if that glory isn't in service of God, then it becomes death. It becomes an image of your death. And so the image, the ultimate image of receiving a crown. So you receive glory on your head, but then you offer that crown to God. So it's like if you offer your crown, your glory to God, then that glory is, that's the only way that the glory you receive has any value. And so it's like a paradox, but not really. It's a paradox in the sense that whatever glory you have only finds its value if it is offered up to God. But if you try to keep your glory for yourself, then it becomes dead. Letter it becomes dead and becomes dead works. Okay, so hopefully that's helpful. I think I've got it right. All right. So Matthjean says, hi, Jonathan. I've heard that some orthodox priests say Jesus didn't fulfill all the Old Testament prophecies as his first coming and will be fulfilled at the second coming. Seems crazy that all Old Testament prophecies wouldn't have been fulfilled at his first coming. Maybe they don't know how to interpret the Old Testament prophecies correctly since they think they haven't been fulfilled. Your thoughts. And so there's definitely like, there's a mysterious aspect to that. The West Beta will understand it. And this might seem like a cop out to some people, but that's what it's going to be, is that there's a sense in which Christ on the cross all is finished, like all is done on the cross and there's a sense in which all is done. Something like in like a seed, like everything contained in the center. It's like everything is accomplished. And now all that has to happen is it has to kind of unfold. So that's the way that I tend to understand it. And so maybe in that sense you can get a feeling like, well, Some of the things that in the Old Testament will happen at the second coming, but the second coming is just an extension of the crucifixion and resurrection, at least that's the way that I see it. So, I mean, because Christ himself, you know, talks about, you know, the, the coming of the Son of Man and the judgment of the world and all these things. And so it seems like he is pointing to something further. But I do think that that has happened, that happened on the cross, at least in seed form. That's why we have the good and the bad thief on the cross as an image of that. The judgment of the living and the dead already happened, which is difficult in terms of, you know, I understand how that would be difficult for, you know, just kind of secular people to, to understand. So that's as much as I'm going to say about that. So Anton Olanderson says, hi, Jonathan, I hope you're doing well. I asked a couple of months ago about the correlation between the weight of Solomon's gold and the number of the beasts, which are both 666. I also found that in a Muslim tradition, the beast of the earth has the ring of Solomon and marks unbelievers by destroying their noses. I know you're understandably hesitant to talk too much about the mark, but can you talk about the symbolism of Solomon's apostasy with him owning an excess amount of gold and worshiping his foreign wise gods? Yes, you've got, you understand it correctly. You understand it correctly. It seems like what happened to Solomon is that in his wisdom, right? In his wisdom, he came to a point where he wanted to account for everything. And that has to do with the idea of counting the remainder of his gold, but then it also has to do with worshiping foreign gods. And so it's like, it's as if you want to account for the, for the margin, you want to account for the excluded within your religious system. And so I think that that's definitely the idea that we talk about when we talk about the beast as this thing, the system which tries to account for everything and in doing so ends up leveling everything or inverting everything in a weird way. And so, yeah, you've got, you've got. But this is interesting, the idea destroying their noses. Think about that. Interesting. Q. Rose says. Dear Jonathan, I really enjoyed your video about Sir Gawain and the Green Knight. I have been struggling with one aspect of the story. At the end, Sir Gawain appears to give his confession to the Green Knight, suggesting that he takes the role of a priest or even Persona Christi. The poet emphasizes the devilish quality of the Green Chapel, which, from the description seems to be a dolmen, but is still referred to as a chapel. This seems a strange mixture of pagan and Christian elements. Any help with this would be appreciated. So I've never thought about the idea that he would be confessing to the Green Knight as a priest. But you do have a point that for sure, this the strange idea of the Green Chapel. So there definitely is like, the whole story of the Green Knight has to do with how to deal with the stranger or how to deal with the strange. And so that's why it would definitely have something of paganism in it. And the notion of how to deal with the strange appears right at the outset, of course, with this strange monster which appears in the. In King Arthur's court. But then it also goes on later in terms of the idea of him being a guest in a foreign noble's castle and his strange wife trying to seduce him. You know, this is all biblical imagery of the stranger's wife trying to seduce you. You can imagine Joseph in the house of Potiphar. You can imagine Solomon warning his child, warning his son about the foreign woman, you know, whose feet go down to Sheol, you know, whose lips are as smooth as honey, but whose lips go down to death. And so this is all what's kind of going on there. And so this is also represented in the Green Belt itself as this strange rim, as this strange periphery which acts as a supplement and protects you. Right. And so there's a. There's a relationship, I mentioned this before, between this idea of the. Of the adding of the strange skins on Adam and Eve, like adding of this. Of the strange as a layer around the outside. So all of this is what the Green Night is about. And so there's definitely something about the Green Chapel, which is probably something like what you're saying, probably something of ambiguous chapel, something about an ambiguous holy place that isn't Christian, that isn't pagan, but really is, you know, the liminal, this liminal space that the whole story is about. And the question is, how can Gawain. How should Gawain act in that. That world? But in terms of the idea of confessing, that's interesting. Like, I definitely have to think about it, but, like, in the end, the surprising thing is that it's as if it's like a trick. The whole thing is a trick. Right? The whole process was there to test whether or not he would remain True and faithful. So, yeah, so. But there's definitely still things to think about with that story because it's a. It's a very complex story in terms of symbolism. Right. So Joe Gallego says, hi, Jonathan, I'm a cpa and I've been trying to understand what taxes represent in respect to symbology and the ideas. So taxes are really just sacrifices. They're just good old sacrifices, you know, Know, you take what you have that's valuable and you give it up towards a higher participation. So you give it to the state, and the state then offers back something, right? You give up the money of taxes, then the state offers protection, identity, cohesion, you know, laws, rules, all the things that bind us. So in order for the state to bind us, it has to take from us some potential to form its, inform, its body. And. And so we become its body. But it's symbolized. But not just symbolized, but symbolized in the sense of concentrated into us, giving up value up the hierarchy so that, so that we can participate in, in the common projects, in whatever common project that we're involved with. So when, you know, I know some people are like death to taxes type people, but I really don't see that as a Christian position. Really, it's just not possible. Because without taxes, you can't exist as a common body without giving up. And it's the same with the church. If you don't tithe to your church, if you don't give money to your church, you're not part of the church. I'm sorry to tell you, you have to give money. And I know this sounds like it could sound crass. It's not crass at all. You have to give up potential towards a higher being in order to participate in it. And, and so it's not just money, obviously, you can imagine that you also have to give attention and you have to give energy and you have to give work, let's say up. You know, all those things can be traded with money. You can imagine that in some groups, instead of, let's say, giving money up to the state, you could say something like, everybody has to give a week of their time. Let's say a group, it's like everybody has to give a week of their time or everybody has to give so many hours to the group in order for. In order to kind of bind us and make us exist as a group. But no matter what it is, you have to give up potential for higher beings to be able to exist. Yeah. All right, so Justin Domansky says Greeting. Jonathan, what are your thoughts on the intentional use of symbolism to manipulate people? I'm referring to primary to actors within the marketing and advertising industry and their scientific approach to utilizing symbolic language for commercial, political or even experimental reasons. Yes, you have a point. And this is interesting because there's a relationship between the discovery of symbolic structures from a psychoanalytic level because like Freud and Jung had really good intuitions. Like Freud sometimes I think is. He's almost like, he's like an antichrist figure and don't freak out because I use that term, but in the sense that he has like upside down symbolism. So a lot of the things actually that Freud says in terms of, you know, certain sexual symbolism that he encounters in dreams and all this stuff, if you flipped it back, it actually can become a kind of image of, of higher symbolism, let's say. And so what's interesting is that a lot of the advertisement symbolism that we see today in the different companies started with Freud's nephew Edward Bernays, who, who wrote the book Propaganda and tried to use psychoanalytic symbolism in order to. In advertisement. And not just in advertisement, but also in statecraft and in. And in psyop operations. Psyop operations both within the country and I imagine on the enemies. Of course, what Bernays did for the government is not known, but he did work for several agencies in the government. And so you're right, I mean it's a dangerous thing. You know, it's like the problem of having a little bit of knowledge and having power. It's kind of like you can imagine a magician in the old sense or a sorcerer who has just enough, enough spiritual intuition, like just enough spiritual knowledge to be able to use it against others, but not enough to understand that what they're doing is, is leading to destruction or is leading to, to, to problems down the line. So. All right. And so Alex Cilento asked a similar question. So I'm not gonna, I'm not gonna answer the, the other one. So Reuben Korf asks. Hi Jonathan. I have for a while been considering the significance of the Enochian fallen angels have both sexual relations with human women and then also teach them various technical art and skills. In some Jewish and Christian writings, only one of these two events is discussed. But in one Enoch, it seems very significant that they are connected somehow closely together. With this in mind, as well as the prevalence of Internet porn, what can we say about the relationship between sex and technology and. Or techne? Yeah, there's definitely a relationship. There's a direct relationship because techne is an increase in power for desire. That's what techne is. That is it increases our power, but it increases our power most often in the direction of our desire. Because the desire for power itself is, let's say, problematic. And so there's definitely a direct relationship between desire, technology, the increase in it, and then ultimately leading to something like pornography. Yeah, I don't know what to say. It seems like that's pretty clear. All right. And so Cameron Dixon says. Hi, Jonathan. What is the symbolism of the three languages, Latin, Greek and Aramaic, that appear on the sign above Christ on the cross? I mean, I think that it's interesting because it links worlds together. I think that that's probably the best way to understand it. It's as if you could say that, you know, there was a declaration that he is the king, you know, and that declaration is done both in the local Semitic language, the Latin language, which was the language of the Romans, but then also Greek, which was the lingua franca of the whole region. You know, the kind of thing, the Helen, the Hellenistic culture that bound all these Mediterranean. These Mediterranean cultures together. And so I think that that's really what that's about in terms of symbolism. So Christian Kleist asked, hello, Jonathan, do you have any symbolic insight into the words given to St. Sulan by our Lord, Keep thy mind in hell and despair not? And so, first of all, it's important to understand that when it says hell, I think it really means. It means death Sheol, like keep your mind in death and despair not. I think this has to do with the idea that if you die on purpose, then you won't die accidentally. And so if you slay your desires, if you keep yourself in death in that sense, where if you let. If you don't, if you're able to put to death yourself and your desires, then that is the best position because then you will not die. And then you will actually find a strange hope because you won't have the actual despair, which is attachment to those desires. Right. Which is, let's say, undue attachment to all these things that bind us. And so I think that that's. That's the image. Yeah. And so you can. You could see it if we said it the opposite way. Right. If you could say something like. If I would say something like, keep your mind on your desires and you will despair. Right. Then you can. Then you can kind of understand it. It's harder maybe to understand the opposite, which is keep your mind in death and despair not. And you won't despair Hope that makes sense. So Marcus David says, what's the symbolic meaning of Lucifer Morningstar being voted the sexiest man alive by women? Really? You mean the character? You mean the character on, like the Neil Gaiman character? I guess there's a series, Netflix series on that. I mean, whatever, dude. It's not surprising. I don't know what to tell you. I don't know what to tell you. That's the world we live in. All right, Brandon, we says you sometimes describe the cross as a place where heaven and earth meet. Isn't this a quality comment at some level to all symbols? Does this make this cross a meta symbol or recursive symbol? Is Christ like symbol man? Yes, I do think that the cross is something of a meta symbol or like the symbol of symbols. Definitely, definitely. So I think the cross is definitely one of the most primordial images. Like, I mean, in the sense that it's. It's what our perception is made of, you know, and so I think that it's very, very important. So you can understand, like, the point as being the essence of that, but you don't see the point. You don't really see it. The cross makes the point visible, this intersection. And so, yeah, yeah, I do think it is a meta symbol. So. X Perez asks. In the life of St. Moses the Black, it is said that sometime after his conversion, he was descended upon by robbers whom he subdued and brought to the elders of his monastery, effectively bringing them to repentance. Somewhat contrarily, send Seraphim Sarav, upon being robbed, laid down his arms and allowed himself to be beaten, only later interceding on behalf of his assailants to the judge at their trial. How could these 2 Responses to this same stimulus relate to the divergent symbolism of the right and the left? Thanks again for all your wonderful content. Such a great story, man. That story, St. Moses, such a great story. Because it's like in the story, it suggests that he. That he didn't hurt them. I guess it's like he subdued them. You know, he is this huge thug. So, no, I think that both of them are. I think both of them are good. If I remember correctly, and I might be wrong, but I think that there's also a sense in which St. Moses was protecting others. This is also something which is different in terms of understanding. You know, the idea that you'd say you wouldn't defend yourself, but you would defend others. And I think if I remember correctly, that's part of the story, is that those robbers were not just there to Rob him, but were there to rob the monastery and to rob the other monks. And so St. Moses, you know, just subdued them. It's a great story. And it also kind of shows, you know, it shows the nature of St. Moses, you know, who is this protector in many ways, you know, he's a criminal, he's a robber. You know, he. He kills the dog. And so he becomes like the protector for those who. Who. For those who want a little hint on. On God's dog. We suggest that in the story, which is why, well, he doesn't actually kill the dog, but when the dog dies in the story, the first book, you know, because of the. The thieves that kill the. The dog, then Christopher replaces the dog in the story. And so there's a little bit of that in the story of St. Moses where he kind of becomes the guard dog and has to deal with the issues. But then ultimately, in the end of his story, my understanding is that the last. In the very end of his story, the way he dies is that he actually lets himself be killed by robbers, if I remember correctly. So that part of St. Seraphim is also there in the story of St. Moses. So B.J. sanchez says. Hi, Jonathan. Synoptic Gospels There seems to be a pattern around the transfiguration. First, there is the confession of Peter, Jesus's prediction of his death and the fall of Peter. Then there is the transfiguration, and there is the healing of the boy. Is there a deeper link that means these must go together. Thank you, and God bless Father Jerome. Santa Maria. So there's something there. Someone recently. Oh, man, I wish I could remember his name. There's a wonderful priest. I was having a discussion with him recently, and he was able to help me understand an aspect of the transfiguration that I never understood. And I think it's related to all of this. It's that. So the transfiguration, we understand that it happens on the feast of the tabernacles, and the feast of the tabernacles were when the Israelites would make tents for themselves and live in tents for a certain amount of time in order to remember the Exodus, when they lived in tents in the desert. But there's also a sense of which, that it's related to the tabernacle in the sense of the Holy Tabernacle too. And so St. Peter, Christ says he's going to die. And St. Peter says, you don't have to die. And then Christ rebukes him. Right? And then in the transfiguration happens Again. But I never seen it that way. I never seen it that way. But the person really made me. This priest really made me see it. Christ appears with Elijah and Moses. And Peter says, basically, Peter says, I'm going to build the church. That's what he's saying when he says, we'll make tents for you. He's saying, we will make the tents for you. We will make the tabernacle for you. Because you are the glory of God. We will make the tabernacle for you. And then Christ says, no. And what he's saying is something like, I will build my church. I will make my church. You will be part of that. But always know that I am making my church. And it's like, that's the sin of Peter. It's like he tends to think that he's the one. He tends to think that he's the church or that he's got it. And Christ has to remind him, like, yes, I'm doing it through you. As soon as you forget that it's through me that you're able to do it, then I rebuke you. And it's like, man, there's a very powerful mystery about the Christian church in that, you know, there's a very powerful mystery. So I think that definitely in terms of the, in terms of the fall of Peter before, of the rebuking of Peter and the transfiguration, there's like, there's definitely a relationship between those two, you know. Yeah, yeah, yeah, yeah, yeah, yeah, yeah. So, yeah, good stuff. I mean, it's pretty powerful. But I'm not sure about the healing of the boy, though. I'd have to think about that. I'd have to think about the healing of the boy. Hopefully that gives you a little bit of a hint of how these seems to fit together in a very beautiful way. All right, so Garrett Widner says hello. Jonathan, what is your opinion on using video games as a means of culture creation? Seems most overtly Christian. Video games are shallow and childish and video games has a whole huge towards centralism and time wasting. Do you have any thoughts on how a video game could be useful in a Christian sense? And so, I mean, I think video games can be useful to a certain degree because they tend to have a hierarchy and they tend to have a kind of ladder of ascension and, and so you can kind of understand hierarchy and ascension and transformation. Like, they're usually pretty shallow transformations, but nonetheless, like, especially if you think of, like, kind of role playing role, you know, RPG games where you have a character that has to acquire certain skills and virtues and then ascends and therefore masters more domain as they kind of ascend that hierarchy. I think that that can help people understand how. How the world works and how, you know, of course, it's. It's a low version of that, but I do think that there are some interesting. And just like fantasy stories, it seems like video games because they're simplified worlds, they tend to have compressed symbolism in them, you know, so I think they can be useful. I think the problem is, of course, that they're massively overused and that they kind of take over and they replace religion, I guess, for a certain extent and, you know, seem to replace life for some people. So that's the danger of them. But, you know, I don't think they're evil in themselves. All right, so Dan, DB Says hello, Jonathan, what is the symbolism of Ruth in the Bible? Thank you for all your work. Keep fighting the good fight. And so symbolism of Ruth in the Bible is the symbolism of the strange potential that can be included. It has to do with what stranger can be included inside, what aspects of the. Of the strange and of the. The foreign can be included. And so, you know, that's why all the symbol. There's so much symbolism about. About that. Like she comes. She, you know, she is. She. She's the. The. The stepdaughter of n. Naomi, who says. Who's bitter. So she's the stepdaughter of the bitter. Like if, you know, the bitter waters, these unfruitful waters. And so she seems to be like a bitter aspect. But because she says, your God will be my God, and because she follows her stepmother, even though she didn't have to back to Israel, then she's connected. She's connected to the center and can be redeemed, you could say, or can be. Can be. Well, yeah, redeemed is the best way to understand she can be redeemed and brought into. In on the inside, even though she is a stranger and an outsider. And so. But her symbolism, like the idea that she is. I think she's gleaning, right? Isn't she? Even in the story? I might make a mistake here. I want her to be gleaning in the story, like to be taking what's fallen from the. I think she's gleaning from that is she's a stranger gleaning on the field. And then she comes and she uncovers the feet of Boaz. And it's like the relationship with the feet and the strange, if you remember you know, the whole idea of the feet and what they represent as the limit of the body. And they also, they are a stand in for other parts of the body, like other, let's say the parts of the body where the sun doesn't shine. Right. That's what the feet also kind of represent. And so she kind of uncovers that. And she uncovers his nakedness, you could say. But in that case, she's doing it towards redemption and not towards scandal. So it's like a weird thing going on there. And then ultimately she also represents a glimmer of the return of. The return of the. The. These stranger. Because Moabi, the Moabites are. I'm not sure. Oh man, now I'm confused about who the Moabites were. So sorry, I need to check that to make sure that I don't make an error in that. But at least it gives you a good idea like, of who, of who, how that relates to the story of Ruth. All right, all right. So Manuel Montiel asks, what is the symbolism of excessive adornment and how does this relate to nakedness? Can there be excessive nakedness? Both adornment and nakedness seem to have their place in the church. Certain icons of Saint Mark the Ascetic as naked. But it's clearly far from acceptable to be excessively adorned versus naked. If I walk down the street. Thanks for entertaining the oddly phrased questions. I mean, there can be transgressive nakedness, if that's what you mean by excessive nakedness. And so there's a nakedness of scandal. We talk about that, I've talked about that a few times, where there's the idea of improperly revealing the nakedness, your nakedness, or the nakedness of others. And it usually has to do with a kind of embarrassment and it, it has to do with a kind of scandal. Right. And so the idea of like participating in a scandal is something like excessive nakedness. So it kind of shows you to the world. It has to do with like the idea of, I mean, of course, nakedness. The idea of public nakedness, right? Of showing being exposed. Like that could be excessive nakedness where someone is exposed, his private sins or his private thing are like exposed. And so you see their nakedness in a way that is improper ultimately, because we all have those like, we all have our nakedness, we all have our scandals, our sins or whatever. And so when you see some, when someone's sins are kind of exposed to the world, I think that would be something like excessive nakedness. So Drew McMahon asked. Hi, Jonathan. Can you explain why the census that Mary and Joseph were traveling for was important an aspect of the story of Jesus's birth? I think that it has to do with. It has to do with this idea of accounting for things. It has a little bit to do with the problem of civilization or the. The problem of, you know, this idea of the symbolism of the beast that we've talked about, the symbolism of the number of the beast and accounting for all things. And so a census is like in scripture, you're not supposed to have a census like King David is. In the story of King David, there's like, there's criticism about the census, which is not done properly because it's dangerous to count things. I know this sounds weird. It's like the secular people will just freak out. It's dangerous because when you count things, you crystallize them because you actually make them, you fix them. And so when you do that, you. You can finalize them. You know, if you count something, you fix it and you can finalize it. And if you do that, you know, you're kind of accelerating. Accelerating its shattering, maybe is the best way to kind of understand that. And so you could. I mean, it's hard for people to understand what I'm saying, but if you see it in excess, you can maybe understand it. So it's like, imagine someone who is obsessed with all the details, right? Someone who is obsessed with every single detail about something. And so if you become obsessed with all the details and you don't leave fluidity on the edge of processes that you're involved with, you run the risk of killing that thing. Like you can kill something through excessive attention and accounting for detail, okay? And so maybe that's a better way for you to understand that. So you can under. If you understand it in its extreme, which would be something like, you know, I'm on a construction site, and I ask for the guys on my construction site to account for every nail that they use and every screw that they put in. And I want them to come to me in the end with an explanation of how many nails they put in each board and where the boards were. And I want to account for all that. It's like, I am going to kill this project. I'm going to destroy it. And so now understand that as the relationship between accounting for things and they're bringing about their end. You can bring about the end of something through accounting. And I think that that is what is being manifested in the notion of the census. It's like, yeah, it's like, Rome is. Rome is, Rome is. It's coming to an end. You know, something like that. Yeah, something like that. Not that there aren't other censuses, obviously, there's censuses all the time. I'm just saying why it's in the story. Why it's important that it's in the story. Of course, there's nothing. I don't think today that there's anything wrong with the census, but we don't need to understand the pattern as best as we can. Why is it that it would be a big deal in the ancient world for this to exist? Lisa Parrott says productivity apps. Yeah, yeah, it's like that. Some of these productivity apps are the very opposite of productivity because they kind of ask you to account for all the things you're doing and it, like, it could totally kill you if, you know. You know, I started. I started going to the gym as an example. Sorry. I started going to the gym because my daughter wanted to go to the gym. And so I'm like, okay, fine, I'll go to the gym with you. So I started going to the gym and they gave us this app with, like, you know, the program. And then in the app you can, like, for everything if you want to, you can, like, put in the weight for how you use for every rep. You can put in how much time it took you. And you can. It's like, if you did that, my goodness. Like, would you ever return to the gym if you actually did that? It's ridiculous. So Steven Young asks. Hi, Jonathan, do you think it's possible that the Templars became associated with Baphomet because they represented a kind of ambiguous crossing over of categories. For example, the mixture of authority from above in heaven and power from below on earth. Secretive, but also a cultural icon. The crossing over of monastic life, particular knighthood and living ascetic life, but possessing massive riches and banking system, etc. Just curious if this crossing of boundaries caused people to associate them with a disordered, ambiguous spirit like Baphomet subconsciously. Sorry for the lengthy question. And so, no, I don't think. I don't think that the Templars were that. I don't think so. My understanding about the Templars is subtle. Like, it seems like for sure, by the way, the Templars have been absolved, at least pretty much. Like, I think it was like 20 years ago, maybe, maybe 15 years ago, someone found a letter in the Vatican archives which. By the Pope at the time, which actually absolved the Templars of any wrongdoing it turns out that he was the King of France who was really behind the persecution of the Templars. And it seems like it was part of King Philip's desire to also bash the Pope and to take power from spiritual authority. That's the way that I see it now in terms of Baphomet, what's interesting about the Baphomet and what happened in the times of the Templars is that I think that there's a kind of fabulation or kind of they made up this thing or there's some kind of fabulation or maybe it was based on some strange rumors because. Because Baphomet sounds strangely like Mahomet. Like it's sounds strangely like Mohammed in a certain pronunciation. And they were in Islamic countries. And the way they describe Baphomet is a strange kind of. Seems like it could even be Muhammad, but in a weird distorted way. But what happened, interestingly enough is that the projection of Baphomet or the projection of this image of Baphomet stayed with. With Western history and kind of got integrated into Western history and then became like a dream, like a kind of weird dream. And you see the same with the, the Hammer of Witches where a lot of the stuff in the Hammer of Witches was, was seen fabulatory. You know, maybe some of it is. Is true, but a lot of it seemed really fabulatory, but it seemed like it's like a weird dreamlike projection of your enemy or of the evil that, that you're opposing. And so it kind of ferments in the, in the culture. And then so if you look at the. What's called the Taxil, the Taxi Taxil Hoax, which is that in the 19th century a man named Leo Taxil wrote a book about the Freemasons which was a taking on a rehashing of the Baphomet legends about. Of the Templars. And it kind of remade up this thing that the Freemasons worship Baphomet. And it was like a more elaborate version of Baphomet and all this kind of imagery. But then interestingly enough, like that type of imagery and that kind of dreamlike thing gets taken up then by occultists and taken seriously. And then that leads to that, say modern Satanists using Baphomet and all the imagery which kind of developed in this strange way as what they are like they are the worshipers of Baphomet. And it's fascinating to see how it happened. And you see the same with the Wiccans and stuff. So it's like the Wiccans are basically taking the descriptions in the hammer of witches and are taking it for themselves, reinterpreting it, but basically taking the basic notion that described witches in those texts and are now incarnating it as the enemies of Christianity. And you see the same with modern Satanism. So it's kind of fascinating to see how that developed and how that happened. So, yeah, it's very particular, but I don't think that the Templars worshiped Baphomet. I really don't think that. I mean, Bernard of Clairvaux is a pretty tight guy. Like, Bernardo Clairvaux is the man. I'm sorry. You know, it's like he wrote their chart and, you know, I mean, sure, there was something wrong. There are things about the Templars which were off, but I really don't think that they were. But I think that the story of the Templars and their fall is an important part of understanding where we are now in terms of, you know, temporal authority, temporal power, trying to take over spiritual authority. So, all right. Matthew o' Hara says, what's your understanding of Christ having a new name? It's mentioned in the later, the letter to Philadelphia, Revelation 3:12. The one who is victorious. I will make a pillar in the temple of my God. Never again will they leave it. I will write on them the name of my God and the name of the city of my God, the new Jerusalem, which is coming down out of heaven from my God. And I will also write on them my new name. Name. I mean, what do I think? What do I understand? I think that it has to do with the idea of a secret name or the idea of a name which is not revealed yet. And so it has to do with the idea that there are aspects of God which we do not, which are beyond manifestation, and that, you know, in the eschaton, then those aspects will be revealed in new names, you know, and you could say something. You could even say something like, we will all be given new names in the eschaton. Like, you could say something like that. Because. Because of that. Because they're aspects of God which are not. Are accessible to us, let's say. So that's what I see. That's how I see it. All right. Luca Irimadza says, what is the meaning of vesting the bishop in front of everyone? Yeah, that's an interesting one. That's an interesting one. I'm not totally sure. It might have to do with the fact that that's like something like we are the Clothing like we are the bishop's clothing. Something like that. And it might also have to do with something like understanding that the role of the bishop is beyond the individual, that it's not just about so and so who's standing there, but it's like something that is received and is beyond their individuality. And so despite their weakness, like their frailty, you know, you can imagine symbolically that they're not wearing clothes. You see their frailty, you see that they're not just this glorious bishop figure, but that they have, they're hunched or whatever, like they have their bodily frailty and that the function they play is added to them or is beyond their individuality. Maybe it's a good way to see it. So Sean Desmond says, been reading lots of Rene Guineau recently and I'm finding practically everything perfectly true and agreeable people. Okay, could you give the biggest reason why you're wary of recommending his writings to people? Is he just missing something or does he get something very wrong? Well, it just depends what book you're reading, my friend. I mean, I don't know what book you're reading, but it's like Guino had a, had a, had a slight anti Christian bend in some of it. And you'll see it, if you keep reading, you'll start to see it like he, he has a, he has an animus against, against Christianity and it shows. He also has weird things. Like he, it's like when you read it at first because you, sometimes you don't know what he's talking about. And then later, for example, like he, he defends Martinism like his whole career and he says Martinism is a traditional form. And it's like, really? And then when you start to discover that Martinism is like some made up version of Freemasonry that was developed by the French occultist Papus, you're like, okay, that's weird. Like, that's weird, you know, and then you'll notice that there's a bunch of other stuff that's weird. Like he tends, for example, he seems to want to defend the Cathars as a possible other tradition in the West. There's a bunch of stuff about it, you'll notice that, that are, that are strange, you know, and then he, he ultimately became a Muslim and moved to Egypt. And, and so he's definitely, you know, it's like, like I said, there are many things about him that are, that are great. But it's like if you read, like if you read some of his books, if you've read. If you haven't read King of the World yet, like, read King of the World and then, and then we'll talk, like, because some of the stuff that he suggests are just. They just. They're just a little off the rocker, you know, so. Yeah, but I mean, like I said, I have deep admiration. He has one of the greatest symbolic minds that I've ever encountered, you know, so on that front, he's really good. But. And he also. Has he one of the first to have the proper insight about where the modern world was going and what was going to happen. So there's that. But, you know. Yeah, you know, he started as an occultist. That's important to understand. He was in the church of the Gnostic Church, you know, before, let's say, kind of embracing tradition. But it seems like a lot of. A lot of, like a lot of us in some ways, like we kind of bring in our old world into the new world. And so it seems like he kept a lot of that occultist stuff with him as he was discovering the more kind of traditional forms. And so, so there's so many things. Like, for example, he says that no religion teaches reincarnation. And he kind of tries to explain it in some ways and looks at some point it's like, I see what you're saying. Like you're defending against the new age reincarnation, that kind of really puny reincarnation that people remember themselves as, you know, princes always remember themselves as being great figures in the past, that kind of nonsense. But then it's like he also seems to suggest that there is no. In. Even in. In another tradition, there is no cycling back of the souls into this state, rather that there's only kind of transmigration to other states. But it's like, I mean, he was a Muslim, so I understand why he said that. That especially was like a universalist Muslim trying to fit Islam with other traditions. But it seems, definitely seems like, like Buddhism teaches a form of strict reincarnation. And you see in. In certain forms of Judaism, they have this notion of the cycling of the souls where there really does seem to be something like what origin or what Plato was describing as these souls which cycle back up, you know, into the. You know, back into bodies for certain reasons. And so, yeah, so I don't know, those are a few reasons, but there are plenty of other reasons. Ajafka says, what is the symbolism of a priestess? What would their function be? I mean, so it depends in what religion. But, you know, I probably don't know enough about pagan religion to understand what priestesses were in other religions. Sometimes I've wondered if the priestesses in other religions were priestesses for certain gods or in service of certain gods. Maybe, I don't know. So I don't really know. But for sure, in the Christian tradition and the Hebrew tradition, the priestly role is really a male role in terms of the people. And so in some ways the priest is feminine in regards to God and then masculine in regards to the people. But in that sense, they have to be a man because the church or the body is the feminine and the priest acts as the head or the man, and the church acts as that which is receiving the body and all that stuff. So, yeah, that's why we don't have women priests. That's also why the churches that do have women priests. They quickly become different. Let's just say they quickly become particular. Not to say that there are some women priests that I'm sure that personally are dedicated, true Christians who. But just in general, when you look at the churches that have embraced women priests, things don't go well. Things get weird really fast. All right. Charlie Longoria says hello. Jonathan, I'm a photographer and is wondering how I can use photography to point back to Christ. Portrait of the human face seems to me is a way to do that. I visited Philadelphia and asked, started asking random people if I could take portrait of them. This was a very fun exercise. What are your thoughts on this? There's a lot I can say on this topic, but I will leave it at that for now. I mean, sure. Yeah. Yeah, I think you're right. I think taking pictures of human faces is a good way to kind of point to things. You know, photographer photography is a framed action. You know, you frame things. And so because you frame things, it's directed vision. And so as directed vision, you can. You can understand that it would be possible to take pictures and to show pictures to people that would exemplify the proper direction or the proper vision. And so maybe that's something you can think about. So tiered. Tiered says esoteric ritual texts are often purposely veiled as symbolism to make it exclusive. To what extent is Christian symbolism meant to veil? Perhaps you can go into the difference in symbolism used in esoteric Satanic text and Christian symbolism. So for sure, Christ does that. I mean, Christ clearly says in some of the stories that he tells when that he turns then to the disciples and says that now he's going to tell you the meaning of this thing. So he's like, he gives the story to the people, but then he turns to disciples and tells them what it means. And there's a sense in which that is also something which I think was part of the early Christian initiatory process. That is, if you read the difference in the text between, let's say, the catechumens text or the texts that are kind of teaching the basic scripture and the mystagogical texts, which are the text texts which explain the analogies and the typology that is in scripture, you'll see that those are different. And you can understand that the things that would be taught to the catechumen before they're baptized was different than that which would be taught to the initiated once they had entered into the church, and that the mysteries of the events would be revealed to people after they have entered into communion. And this is also something which seems to happen at Pentecost, which is that now Pentecost, when they received the Holy Spirit, all the things that they had been experienced, which to them had been to a certain extent veiled, were now unveiled, and they were able to see through them into more mystical reality. And so I think that there's nothing wrong with that. We have a weird idea of kind of democratic. Democratic notion. Now, people might criticize me for doing mystagogy, let's say, in public, which may be. But in some ways these are strange times. Like, these are times when the normal processes are difficult to hold. And so I would say maybe one of the difference between, for sure, the Christian way that it happens and the Gnostic or kind of sometimes esoteric way that it would be done. This is my understanding, is that I think the Christian images are not there to explicitly obfuscate. Like, they're not meant to be completely opaque or completely obscure, but that the initiation into their mysteries is like a deepening of something that you could see at a surface level at the outset. And that you could understand this as cycles of deepening, where the more you experience and the more you kind of move into the mystery of the story, then the more you see, but it doesn't negate that which was there before. It's not like an arbitrary code or some. These codes that this means this. This means that, this means that. And once you know that you have the key now you can unlock the story. It's more like a kind of deepening of the story itself, self, and of its implicit meanings which. Which are there in. Like, are there, if you're able to look with the right eyes, maybe is a way to say that. So Ross Bird says. Hi, Jonathan. What is the meaning of Jesus? Promise about agreement. In Matthew 18, if two of you agree on earth about anything they ask, it will be done for them by my Father in heaven. This comes right after the promise of binding and loosing. Well, I think it has to do with the. With this idea of. Of communal bodies. Right? Of this idea that, you know, if two or three are gathered in my name, that I'm there. Right. The idea that if. If we agree, you could say, like, if you agree on what's real with others, then that will be part of what makes it real. I don't want to sound postmodern. That's not what I'm doing. But there's. There's an. There's an aspect to that, that by loving one another and by agreeing together, we can reform the world and that God will change even the shape of the world if we agree. I might do a video about that. I'm thinking about doing a video about Neil Gaiman's With a dream of 10,000 cats that he wrote. And that was in the Sandman series of How. So. Lisa says the past can't be erased, only reframed in a way. She's not talking about what I'm saying, but it's related to this, that if you agree, you can reframe certain things. And it's not like. It's not relative. I know it sounds like I'm saying everything's just relative to what we agree on, but there is a power of agreement and love in shaping the way the world exists. Of course, it's not idiosyncratic. It can be a deepening of reality. All right, so Anders Ralstadt says, hey, Jonathan, what is the symbolism of Simon helping Christ bring the cross to Golgotha? Yeah, I think this has. I think this is like a promise of what's coming. In the sense that. I think that Christ is already suggesting the church in that gesture, right? Already suggesting the idea that we will carry the cross, you know, and that. That there's something, you know, like that weird statement of St. Paul that talks about perfecting the sufferings of Christ in his body. That there's something about how the church has to help Christ carry the cross, you know, or participate in it, because you could say it's something. It's like Christ lets Simon help him carry the cross. That's probably a better way to understand it. Seems like a strange, strange gift, right? Or a strange permission that he gives, but at least that seems to be the way we understand the martyrs is that there's a kind of glory in participating in that. So not saying that's what I want, you know. So Norm Graunet said, just as the formation of any body requires sacrifice, because the things that are not that body need to be cut off. Yes. Does that mean that celebration always requires sacrifice? Is the opposite also true? Does all sacrifice bear seeds of celebration? So I think so. And so there are two sacrifices. It's really important to understand that there really are two sacrifices. There is the, you have to understand Yom Kippur as the, as the, the atonement as being an image of those two sacrifices, right? There's a sacrifice up and then there's the scapegoating out. Those two things kind of happen at the same time. They happen at the same time on, on the cross, for sure. And so you understand that celebration is sacrificing up, right? We gather our attention up towards the thing that binds us, but that also requires cutting off of that which doesn't fit or purifying. So purify yourself and purify yourself and go to the temple to offer sacrifice, right? So you cut off and then you, you gather and then you offer up. And so I think that all celebration, like any concentration of attention, will be in some ways a sacrifice of potential attention. So you, if you're concentrating on your homework, you can't listen to music, or maybe you can, but you can't watch Netflix at the same time, right? You can't study and watch Netflix at the same time. If you do that, then you won't get good grades because you won't have sacrificed your attention. You won't have gathered your attention in celebration and sacrificed in the sense of scapegoated the things that don't fit in what you're trying to accomplish. And so I think that's true for all kinds of. We're all celebration. So. So Nicolas says, what would be a proper Christian understanding of a nation? This question is particularly important to me as I'm coming from a former country of Yugoslavia where war broke out twice in a 10 year span because the various people claimed their local nationhood to be more important than our previous joined one. We can see similar things going on in Eastern Europe right now. I also suspect this pattern will keep occurring more and more the oncoming in the coming years and not just in Eastern Europe. Yes, you're right. That is what's going to happen and, and it's going to increase and it's been happening for a long Time. This is. This started a long time ago. And a long time ago it started a hundred years ago, more than 100 years ago. And it's two opposites. Like there are two opposites happening at the same time. It's like, on the one hand, there's a desire to crystallize the nation very strongly, to crystallize groups, to crystallize nations, to crystallize identities, fix them very strongly. And then there's a counterweight to that, a counter reaction, which is a desire then to mix and to confuse because we see the nation or the identity as being too strong and too tight. And so we have to remember that in the era post and after World War I, there were massive displacements of people all across Europe and the Middle east, where nations were now all segregated. And so all the Greeks left Turkey and all the Turks left Greece, and they created these segregated nations that were as homogenous as possible within themselves. And so that is a problem. And we created these hermetic borders around states that are supposed to contain in them these now displaced people that have their own common identity completely closed off. And so, you know, that was one of the reasons that justified even the existence of the state of Israel was this move towards saying every nation needs their land and their country and their borders, and every group has to be closed off. But of course, that's ridiculous, because that's fractally true. And so you can imagine that at every level, people can now say, well, we're not. We're not really part of this group. Like, we're not Greeks, we're cretins. We're not, you know, we're not. We're not really this group. We're actually this smaller group. And so it could fragment indefinitely. And so you saw that in many respects. But then that leads to a kind of other opposite, which is this problem of mixture and of wanting to kind of eliminate all the differences. And so in the communist, let's say, time, the communist states, they had this problem where they just wanted to eliminate nationhood and eliminate tribalism. And so they just created these countries that contain all these tribes inside and basically said, you're not allowed to be that. You just have to be, you know, the proletariat or whatever. But that doesn't work, you know, because we don't exist that way. We exist in these fractal relationships. So when the Wall came down, then everybody clung back into their identities. And now and then it was just like my group against your group. So this is the problem of not having Proper, normal hierarchies of relationships across the board, which is that in a normal world, you would have, people would have their families, people would have their tribes, people have their groups, and then people would all participate nonetheless in higher identities. Whether it's something like empire, but it doesn't have to be empire, but it could just be Christianity, for example, in the west, you had all these, these little kingdoms that nonetheless somehow attended to a higher, A higher good together so that they wouldn't just constantly be at war, although they still were at war way too much. So, So I think it's going to get worse. There's no way around it, and it's gonna play on that, on that issue. Yeah, it's a tough, it's really tough. It's a tough time. So Blake Straight says, hey, man. Visited the monastery in Wayne, West Virginia last week and got to see your reliquary during the services. That place is awesome. I like to, to move to the area. Which practical thing do you think I could do to make that town more of a beacon of light? What like Wayne, West Virginia, and I have a reliquary there. Oh, there you go. I didn't, I didn't. I guess I, I, I forget, like where I send my things, so. I'm happy you saw a reliquary. Luckily, it's important to understand that it wasn't my reliquary, that it's the reliquary of those saints. Like it ends up belonging to the saints, you know, once the relics are in it. But I don't know what you could do to make that town more of a beacon of light, you know? You know, if you move there, just participate in the community and participate in the church. That's the best thing I can say. So. All right, guys. And so thanks for your attention, everybody. Thanks for showing up and sorry I was a little tired this time, hopefully. Nonetheless, despite that, there were a few good answers in the, in the Q and A and. Yeah, well, thanks for your support. Thanks for everything, guys and talk to you again very soon. Bye bye. I hope you enjoyed this episode of the Symbolic World. The Symbolic World is based on a series of videos that you can find on my YouTube channel, Jonathan Pedro's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course, leaving a review on itunes. Everybody knows that's the best way to get the podcast out there to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon the Pageot videos as well, and on subscribestar, all those links you can find on my website or in the show description. So thank you and I will see you soon."}
