{"episode_id":"SW - #227 - 2022-04-05 - March 2022 Q&A","start":12.08,"end":6684.1,"speaker":"Jonathan Pageau","text":"This is Jonathan Peugeot. Welcome to the symbolic world. All right, hello, everybody. Hope everybody is having a fruitful Lent, at least for me. It's been really hard for some reason. Lent has just been really intense. And I think it's. I think it's. It has to do with just everything that's going on. It's just hard to. Man, just hard to. It's just hard to focus properly. So, yeah, good to see Brad in the chat. And this time I realized last time that I had posted because the people that give $10 or more can ask questions in advance. And then I just send that thing, message out to people. And then I. I just forgot to send to all the other subscribers and patrons, I forgot to send the message. And so I was like, why are there so few people in the. In the chat? And then that's probably why. So hopefully we'll have more people. And also people who are members of this, of the Facebook group can also have access. So, you know, and everybody else, you know, watch later. So hopefully we can get involved in the chat as well. And so as you know, you know, people send in their questions and we kind of whittle them down to about 50 questions. And so this time from 80, we went down to a little bit less than 50. And so don't be, don't be surprised if your question doesn't appear. Usually if it doesn't appear, it's because I've often been asked that question before or it's convoluted or. Yeah, so, all right, let's do this. And so I'm going to start with a question from Renault Gagnier. Those who don't know Renaud, we probably don't know him, but he. He's really one of the people that helped me to set up, like the NFTs for God's dog. He's been really involved in crypto and helping me understand crypto. And so he asked a question. I have a burning question about technology. Am I using technology or is technology using me? At the rate of change. As the rate of change is accelerating, technology's capacities are growing exponentially. I wonder if there is a time where Christians should step off his train. I'm feeling the effects of my participation with technology and how it is shaping my heart and mind as we move towards technocracy, technopoly. When do we say no more? And so I obviously have been thinking about that quite a bit myself. And so I think that there will be a point where we're going to have to step off. I don't know if it keeps going this way, which it probably will. I don't know if it's the same for everybody. I think you have to be attentive to your own passions and let's say what's driving you, like you said. And so for sure your frame is right. That is, this is the issue of technology in general. You could say it's the issue of the garments of skin, you know, right from the outset in the story of Genesis, where, you know, the garments of skin are meant to protect you, are meant to increase your power, are meant to give you possibilities in a world of chaos and of death. But they also have in them a kind of cycle of desire that is difficult to avoid and the kind of drunkenness of power that it brings. And so. And so I think that that's definitely the case, especially for like, phones and Internet and all this stuff. Yeah, it's not easy. So I do think that at some point it might be necessary to step off, but I'm not sure when that is for everybody. It's not exactly the same. Some people might never step off. But for sure, I thought about it and I like kind of how. When it would be necessary for me to do that. And I haven't totally come to the conclusion yet. So. All right, and so we're going to start with people who support me through the Symbolic World website. So Cormac Jones asks. Hello, Jonathan, what do you know of the use of the word symbol and its cognates in the Greek Bible? Any key passages? Thank you so much. I think that one of my favorite use of a symbol, cognate is actually, I forget what the reference is, but it's the moment when it's after the birth of Christ, after the Magi. So I guess it would be in the Gospel of Matthew, I guess after the Magi come to see Christ, it says that the. That the mother of God, that Mary gathered these things in her heart and the word gather in her heart is a cognate to symbol, symbolo or something. And I always thought that that was one of the best image, images of symbolism that you could find with this image of the Virgin that is the. The feminine aspect that gathers these seeds that she receives and that it's almost like an image of. It's like a lower image of something which happened at the Incarnation itself. That is, she gathered in her center, in her heart. And by bringing all these disparate elements and gathering in the center, that is really a good definition of what symbolism is. She keeps them together. And gathers them in a way that makes them a whole and remembers them. Because there's definitely a relationship between symbolism and memory in general. Because memory is the manner in which disparate things are connected to something that is far away from them. So it's like, how do I. If I remember my mother, it's because she's not there, she's far. And so there's a manner in which to remember God is also to bring together, even in the word to remember, to bring back together, to take disparate elements and bring them together towards something. So. So that's what I think. One of the best places that I find a cognate for symbol in the Bible. And so Brad says, compare the etymology of symbolic and diabolic. Yeah, exactly. How several people bring that up. Which diabolos means to separate and symbolic means to bring together. So we can kind of understand what it is that the devil does. The devil, you know, a Satanic, Like a satanic movement is to show how things break apart and not how they come together. To tend to only emphasize the manner in which things are separate and not the manner in which things are together. So you can understand that even within analytic thinking, if you're not careful, you can fall into a kind of diabolical. A diabolical path where you're always tending to break things apart to their constitutive elements, and you become cynical about the manner in which they join together in higher meaning. So, all right, so Ramau asks, hi, Jonathan, what is the symbolism of monkeys, apes, in the medieval worldview? My guess is that it does have a little relationship with eosinocephaly, but it seems a little limiting also, what are the symbolic aspects of the more modern trends of human evolution? And so I think that it's interesting. There are some medieval legends that are interesting about monkeys and apes, for example. So you can see there's a legend, for example, in the Nativity Gospels that talks about Christ in Egypt who encounters a slave. And this slave is bothering. It's a really weird story, so don't be surprised. So the slave is bothering Christ for some reason when he's a baby. And, you know, because he's all powerful, he changes her into a monkey. And then the mother of God, she tells him that you can't do that, basically, you shouldn't do that. And so he turns her back into a human. But legends like that, for example, there are weird Jewish legends from the Middle Ages that talk about how the descendants of Cain became apes. And there's also a Whole idea of, like you said, the notion of the cynocephaly, that there's a possibility that one of the encounters that brought about the stories of the cynocephali was people from the north, you know, Europeans or whatever, that encountered apes and were not able to discern whether or not what they were dealing with was human or not. And it. Just because they weren't used to seeing apes and apes stand up and they have features that are similar to ours. And so there's a sense in which they kind of like, are. They are this kind of weird in between space between humans and other animals and that they could be perceived that way. But what's interesting mostly is to understand how in the medieval mind, they see it ontologically. They don't see it as. The evolutionists think of it in terms of, like a progress of mechanical. Mechanical and physical causality. They see it ontologically as, you know, apes are lower than humans. And so the idea that, like, as Cain degrades and. And goes down into the body and loses the higher aspect of him, then he would become a monkey, like he would become an ape. And that type of thinking is still there today. You know, when someone suggests that someone. When in evolutionary thinking, there's a whole mythological thinking. So, for example, when a progressive talks about how someone is, you know, like a caveman or someone is retrograde, you know, he's from the past, what they're suggesting is that that person is more like an ape than I am. That's what they're suggesting. So what. What a medieval person might have suggested ontologically, in terms of someone who is more animalistic, would have been more like an ape, more like. Like. Like a monkey. The progressive does it in time and tends to talk about the. The dumb, you know, the dumb hick or whatever, that's almost like a caveman or almost like. Like an ape. So. So you can see that a lot of these things still are still around, like, the same way of thinking. It's just framed a little differently, but it ends up being very, very similar. And so I actually talk about this in the article that I wrote for the Secrets of God's Dog for our. For our comic book. I wrote about the relationship between this kind of progressive sin and even. There's a video about that. I think it's called How We Dehumanize, where you can. You can watch that video and get a sense of how different people dehumanize in terms of seeing others as animals. So Annie Crawford says devolution yeah, exactly. There's a sense. There really is a sense. That's more the medieval way of thinking, but it's interesting to understand. So, like, when the evolutionist says something like, the origin of the humans is apes, they're saying a lot about what their worldview really is, because their worldview is based only in, like, physical phenomena and physical changes. Then they tend to. They will tend to say something like, the origin of man is an ape. Which is crazy if you really think about it. It's like the origin. I mean, and it's as stupid as saying something like, you know, the origin of. Of Michelangelo's David is a quarry. It's like instead of looking at the intelligent part of it, they look at just the. The. The physical characteristics, and they see that as the origin. But that's. That's because they don't understand, right? They don't understand how. They can't see how things come together into purposes and things come together into identities, and those identities are higher than the. The. You know, it's like. It's like when morons. These morons, you hear, sorry, I'm being a little aggressive here, but you hear these. These people say something like, you know, you're 99.9% the same as a monkey. And you're like, okay, dude, what does that even mean? That doesn't mean anything. You could say something like, I'm also 99% the same as anything you want to, depending on how you calculate it. You could say I'm 90 compared to, you know, compared to this, I'm 99% the same as a blade of grass. Like, these types of comparisons are so similar. Silly and absurd. It's like qualitative difference is what is the real difference, not these quantitative differences. You know, the difference between an ape and a human. If you can't see the difference between an ape and a human, you know, you're in serious trouble, my friend, because the difference is very qualitative. It's like. It's the difference between someone who can. Who can name the other and the other that can't name back. It's like that's the difference between a human and an ape. It's like, I can tame an ape and an ape can't tame me. Pretty is pretty simple. It's pretty simple. All right. I can put a. I can put an ape in a zoo, and a zoo can't put an ape. Can't an ape can't put a human in a zoo. It just. That's. That's pretty much A good way to understand the difference between a man and a nape. Anyway, sorry, I don't want to go too hard on the poor. The poor evolutionists. All right, here we go. Okay, so Douglas Matthews says, I've been trying to understand the symbolism of taking the mark on your right hand versus your forehead. Could you go into this a bit? A popular stance seems to be that it is about those who take the mark do so in both their actions. Yes. And their mind. But it sounds to me like it's more about how types of people, the true believers, the people who simply go along with it in only an external way, even if unwilling, are still guilty of receiving the mark. So, I mean, I think you're right that the emphasis on having a mark on your forehead and on your hand has to do with identity and action. You know, you have to understand head not just as mind, but really as the place of identity, because this is where I encounter you. Like, if I think of someone, I think of this, think of their face like head face. That's where identity is. And so I think that has to do with that. It has to do with identity, with identification and then action. And so the idea of a mark on your forehead and on your hand actually comes from scripture. Right. It's the idea that you should have the law on your forehead and on your hand, which is where the whole Jewish practice of having the Teflon, you know, wrapped around. You see these people with, like, a little box on their forehead, the Orthodox Jews, and you see them with, like, things wrapped around their. Their hands. It has to do. I mean, it's a ritual version of the idea of having the law in your. In your identity and in your action. And I think that that's what it means. And I think that's what it also means. It's what it also means in terms of the idea of the. The mark and revelation. It has to do with identity, with identification and action. So you can see it like. Right. That's why it says that if you don't receive the mark, then you can't buy or sell. Like, you can't. You can't act in the world. But it has to do with you being accounted for in your identity as well. So that's the best way, I think, to understand that. All right, so Gideon Yu says, hello, Jonathan. What symbolism would you see in the story of Joseph being sold into Egypt, where Reuben is one who tries to deliver Joseph from death and plans to save him from the pit, but Judah is the one who comes up with A plan to sell Joseph to the Ishmaelites. Yeah, well, there's definitely something about that and there's definitely something about, there's definitely something about how that relates to Christ as well. Because ultimately you could say that it's Judah, Judas who also sells Christ to the Romans in the microcosm of the story in terms of the story of Judas in the Bible, the character Judas, but then also in general, Judah in terms of the Jews of the period who give, who gave Christ over to the Romans to crucify him. So always to remember that, right, it's the Romans that physically crucified Christ. But they were, you know, you could say something like Judas sold Christ to the Sanhedrin and then. Or to the, to the Pharisees or whoever it was, the people responsible. And then they sold basically Christ over to the Egyptians, over to the foreigners. And so that's the, that's the story. So how is that related to the fact that Jesus is descended from Judah? But there's a duality in the story of Judah. And there's also the idea that the king or the lion of Judah, that the lion of Judah is a particular thing. You always remember that a lion is also an impure animal. And there's a relationship between the, the king and this. And the character of Judah is a shady character in a lot of stuff. If you know the story of Judah and also the relationship, the kind of illegitimate types of relationships. And there's also, in Judah, there's a breakdown of causality because he has a daughter, he has a child with his own daughter in law. And so there's this kind of breakdown of causality. And the Messiah, Christ gathers it all together. Christ gathers the best and the worst of the Old Testament in a way. And that's why in the genealogy of the Messiah, it's important to mention the places where he also comes from weird illegitimate relationships. For example, David and Bathsheba who married the wife of his, you know, of someone else's wife. And then you also have the story of Ruth, that is a strange woman. And you know, you have all these. Yeah, all these stories. So anyways, yeah, Christ is very, very mysterious. Guys. There's a lot of, there's a lot of stuff in the story of Jesus that is, that is difficult to totally, you know, like I said, he crashes your categories. All right, so pkb5021 says, what does it mean that the mother of God has many identities? IDR lady of Sorrows or lady of Guadalupe. I know Christ took on many Identities as well as a king, teacher, carpenter, etc. But often you don't specify pray to Jesus the carpenter, like you might to Our lady of Sorrows. Is this something to do with the feminine? I mean. I mean, I would say it's not exactly the same. And also there's an idea in which a person has different manifestation. And so a good way to maybe understand that in terms of Christ would be that you don't have the same stance if you look at an image of Christ on the cross as you have when you look at the image of Christ as the Pantocrator, as the ruler of all. You don't have the same stance when you see Christ as a child in the arms of his mother, as you do when. And this is all Christ. But there, you know, Christianity is a place in which unities and multiplicities coexist. And so the same with the aspect of the Mother of God, where the Mother of God has different aspects to her, her role as the one that gathers and manifests and shows the way to Christ. Then there are different aspects of her as well. Like you said, there is her grieving for her son, there is her showing the way, her opening the way for Christ, to his ministry, for being the space in which Christ manifests himself. So there's all these aspects and different aspects in Orthodoxy. Often they'll even be like different icons that manifest different aspects of the Mother of God. Sometimes more affection, sometimes more of a showing. So I think that that's completely normal. It's not something that is weird. And the closer you get to something which holds everything together, the more aspects can become explicit. And so when you take an example, let's say you have a saint that's maybe not as important, then it's not like there'll be all these aspects of that saint that we'll think about, that we'll meditate on, that we'll remember. But when you come to someone, when you come to Christ, who is God incarnate, then all of a sudden his aspects become bright and we can see them as manifesting in the multiplicity, the source of things. So I think it's the same with the Mother of God as the container. There are so many aspects to the notion of that which contained the infinite in her, that we sometimes have to meditate on the different aspects or invoke the different aspects, you know, in order to kind of come closer to the mystery of how it all comes together. To me, that's the best way of understanding that. All right, so David Flores asked. I asked about the symbolism of hornets in a previous Q and A and how God sent them for the Israelites. All I could come up with is hornets are bees that do not produce honey. Their stings make blisters. I feel like it's connected to Moses hand turning white somehow. I'm at the limits of my intuition. Have you had any time to think about this symbolism? I did it. I'm sorry, but I think your intuition is completely. Is right on. I think that definitely that hornets don't have a useful. They're not useful to. To humans like bees are. And so bees are like roses, right? They. They have a sting, but they also have a sweetness or have something sweet. Whereas the hornet is only. Is only, let's say rigor, right? Only the, the, the. The sword. Only the, the harsh aspect of, of like divine revelation, you could say. So, yeah, I think you've got it right. I think you're on the right thing where. Whether that has to do with Moses hand turning white. Not sure. Not sure. Yeah, not sure. I'd have to. You're bringing about some interesting images that I definitely have to think about. And so Patrick Blonsky says the hornets maybe relate to thorns. Definitely relate to thorns. They're definitely related to thorns. Like active thorns, you can say. So you can imagine like the judgment of God kind of coming out as, you know, raging fire, like that kind of stuff. You know, this was Patrick Blonsky who said that C Street Soul said, hello, Jonathan. What is the symbolism of the hunter? Fishermen and wild meat opposed to shepherds, agriculturalist livestock and crops. So there is an opposition between the idea of the. Let's say the shepherd and the agriculturist in terms of civilization. The hunter, fisherman obviously has something to do with more kind of active, aggressive male energy. I don't know how else to say it, right. The idea of going out into the world and. And hunting down, you know, finding something, aiming at it, you know, killing it, and then using it as potential. So, you know, that's why, you know, if you think of the. One of the images of imperial or tyrannical civilization in the Bible would even. Is something like a hunter. If you think of Nimrod, for example, who was the king of Babel, was the one who created the tower of Babel and the city. He was said to be a great hunter before God. And so there's a sense in which that's an image of imperialism. And you see the same in the story of King Saul. Of course, King Saul is Hunting David. But you can still understand the image of this very powerful masculine figure that is trying to pierce things that are outside and join them into potential. It definitely has to do with war as well. It has to do with. With war, but at a. Not exactly at the same level. All right, so Brother James asks, what is the symbolism of a live broadcast? More specifically, what are the symbols we should be looking for to show us the ultimate consequence of having technologies where everyone in the world could essentially watch the same thing at the same time? My instinct tells me this is not a good thing. That is somehow it's leading to the end and to Antichrist. But I can't define it much more than just this gut feeling that the evolution of live broadcasting from radio, television to the Internet is a major factor in diminishing people's ability to see the world symbolically. I'm hoping you have a clearer view of this. Thanks, as always. Well, for sure, a way to understand, I think, the idea of live broadcast or just broadcast in general, it really is similar to what you said in the sense that it is. It's moving. It's a way to move towards a kind of mono culture too, where the idea that the entire world, you can imagine an event, and there have been events like that that are so let's say 9, 11. Like, you have an event like that that's so strong that the entire world is watching it, like the whole world is seeing it at the same time. So on the one hand, there's like a insane unity, but also a weird flattening of reality where it's like we all have this direction, it's indirect, but like this. The sense that we're connected to an event that's happening in the world, and the whole world is kind of connected to that event for some reason. The image that comes to mind is the image in Revelation of the Witnesses. It says that the witnesses will be killed and something about how the whole world will see it. Like the entire world will see and their bodies will be displayed for the entire world to see for. For a certain amount of time. And so there's definitely something about that. Like you said, it's right. So Jean Philippe Maxot says, what would happen to a vampire if he drank Christ's blood? Dude, what is this? He would explode. He would. He would explode. You know, it says. It says in Scripture that. That, you know, when you come to communion, you know, you come. If you don't discern the. The blood, body and blood of Christ, then than it is to your condemnation Right. And so think if a vampire drank the blood of Christ, he would just. He would. He would. He would explode or, or he'd be saved. But it just depends on the reason why he did it. But in a way, a vampire usually drinks the blood of someone. He would. He would just. That'd be the end of that. The end of that vampire. All right, so Eric says, hi, Jonathan. Hope you are well. In Loris Arseny. In Loris, Arseny claimed not to feel at home on his first visit to a cathedral. This because God seems closer and warmer in Orthodoxy and higher and grander in Catholicism. Could you expand on this, man? I think it has to do with. Even just in terms of the architecture, I can understand what he means that, you know, Gothic architecture is something which is pointing up, right, because it has all these spires and all these points, all the windows, all the. The spires. Everything is kind of elevating you up towards heaven, you could say. And even if you go inside a cathedral, a Gothic cathedral especially, and all the. All these vaults and all this vaulted ceiling is pointing. Is really kind of moving up. Whereas in Orthodoxy, in the Orthodox Church, because of the square and dome, it does feel like a closer thing. And also the. The walls in Orthodox churches are often painted with icons. And so you. You come into a cloud of witnesses and everything is. Everything is presencing itself to you. And even in terms of, let's say, the image of Christ in the dome, you know, it's up there, but it's also, let's say that image up there is also the same image that you see on the iconostasis. There's a sense of. Of closeness, which I think. Which I think is a sense of family, you know, but, you know, I think these are tendencies, because, I mean, I'm sure if you go to Hagia Sophia, you probably feel the crazy grandeur of that church. I've never been there, but I've been in massive Orthodox churches where you do feel that grandeur. But I know what. I see what he means in that sense. So Wedge Youngman says, is it true that all dogs go to heaven? And so there are so many things wrong with that question, which I can find at least two ways, you know, three ways in which that question is not right. So I don't know how to answer it, because it's like, go to heaven, first of all, you know, I don't talk about that. And then dogs and then all. It's like, the dogs go to heaven. So, yeah, all right. I mean, in In Scripture, it says from the New Jerusalem, it says that the outside are the dogs in the. And when there's an image of the New Jerusalem, it says it's like, outside are are the dogs from New Jerusalem? So, you know, maybe some of them can stand as guards. And then at the New Jerusalem. So Pnumaesh asks, what is the significance of Joshua staying in the tent of meeting even when Moses leaves? I don't know. I've never thought about that. I'm sorry. Maybe something to the effect that he's going to enter into the, into the Holy Land and not Moses, something like that. That he's actually going to cross over and not Moses. Maybe something like that. Jeffrey Nomic says. Greetings, Jonathan. In your last live stream on the Symbolic World Facebook group, you mentioned Pavel Florensky and his book Imaginaries in Geometry. Your description of his conclusion was fascinating, so I impulse bought the book. I studied abstract math at university, and since being in truth the Symbolic World, I struggle to see how mathematics can meaningfully contribute to Symbolic World Project. Are you aware of any similar works that the mathematically inclined audience member would appreciate? I'm not a math person. You might have to ask my brother. He would definitely know. He's far more of a mathematician. I know that Guinot actually wrote an interesting little book called Against Infinitesimal Calculus, in which he argues. He argues that systems of proportions like fractions, are more real than decimal points. You know, that kind of stuff. And how the decimal system is really, it's like an aggression on reality because it's like, what does it even mean, right? You know, what proportions are like half of something, et cetera. But what are these points like.12. So that might be an interesting book to look into, but I'm not a math person. All right, let's see, what do we got in the chat? So in the Gospel, Christ expands his following after healing the sick. Is that an example of integrating a remainder? When we accept Christ's healing, is he the remainder we are integrating? So I don't think you're seeing him in the right position. I think you have to understand healing as more related to forgiveness of sins. Healing a body is the, let's say, physical equivalent of what forgiving sins is. That is, it's like you have something that isn't working according to its telos, that isn't working according to the way it should. And then you fix it. When you fix it, then you realign things together. You bring, you know, the different elements back together in a Proper order. So I think that that's really how you have to understand a healing. And so the fact that that would then bring people into following him is not surprising because the people following him and kind of starting to form a body around him is also an image of that healing, of how, you know, someone has some defective aspect to them and then something which isn't working according to its purpose and then Christ kind of resets it. You know, let's see. All right, so a pauper asks, what does the pattern of repentance look like and how does it break the pattern of sin? One of the things about sinning is that it often involves forgetting. There's something, we all often have an idea that, like when people sin that they're somehow deciding to sin. And often that's not how it happens. Often when we sin, it's like a forgetting, a forgetting of what's true and a forgetting of our real purpose and an attachment to lower desires. And so one of the things repentance does is that it first of all makes you name the thing. So you name the thing. And I mean, we actually, we even sometimes repent for things that we don't, that we did unwittingly. But there's a sense in which it's a bringing forth of the problematic aspect in order to then heal it. So you can understand it. Something like, you know, you go to the doctor, and before the doctor heals you, he's going to try to figure out what's wrong with you. Like he can't heal you if he doesn't figure out what's wrong with you. And so you have to be able to say, it hurts here or this is broken or whatever. And then we'll all agree that that's the problem. And so now we are going to heal it. And so that's an aspect of repentance, which is that as we repent of the sin, we kind of shine a light on this thing that's off the path. Then let's say there's a man in which it restarts the possibility of realigning it because we've kind of exposed it and we are disassociating from it, right? We're saying, I did this, but I don't want this. Right? Does that make sense? So you, I don't know, you lie and you're like, oh, I lied. I just lied. You're like, okay, I lied, but I don't want that. And so I ask forgiveness and I repent of my lie. And so you can understand how doing that. Doing that over and over and over is actually a way to train you to slowly move away from that thing. Yeah. So I don't know. To me, that. That. That's. That's part of it at least, you know. All right, so let's see. Michael o' Connor says Gothic architecture is epic. I think Gothic architecture is epic, too. I think that Gothic architecture is like the. If done properly, it's like the best of Western Christianity is Gothic architecture. You know, it's. It really is. And, you know, in a way, it has its own characteristics which maybe need to be balanced with, you know, the more. Let's say, like the more West Eastern architecture. But I think maybe the same too. Like, there's something about the Gothic which says something that's true. Like, I don't know, like standing in a Gothic cathedral, like standing in front of a Gothic basilica or a Gothic cathedral, you know, I don't know how you could see that there's not something true about that space face. I mean, it's pretty amazing. Gothic architecture is amazing. It's very impressive. It's impressive in the sense that it does create that sense of awe and that sense of transcendence which is nest, which is part of what Christianity is. You know, there is a sense in which God is. You know, we talk about cataphatic and apophatic. There's a sense in which God is also always moving beyond our representations, beyond everything. So there's not. There's not nothing wrong with that if it's properly balanced with the fact that Christ is also coming back down on us. I think again of the Eastern architecture with Christ in the dome that is representing Christ returning into the world, and Christ kind of acting as the king and the one that's presencing himself to us. I think that those two things have a function. All right. So, Sarah, Mary says hi, Jonathan. I was wondering if you could talk about the symbolism of cats. It seems that they have lived with humans for a very long time. They are canonically, as I understand it, the only animals allowed behind the Akanastasis. What? I never heard that before. They are the center of various superstitions across multiple ages and cultures. People have associated them with witches and with good or bad luck. And I read once. I read once that sailors used to believe they controlled the weather with their tails, like dogs. They are one of the most common animals kept as pets in modern times, but they are in many ways the opposite of dogs. Wondering what you think. Thank you. I mean, there's Definitely something going on with, like, especially even in the modern times, the manner in which we've set up an opposite between dogs and cats. Right. Set up this sense even, that there are like dog people and cat people. It's definitely manifesting something about reality, something about different types of humans, different types of aspects of humanity. One, which is maybe, let's say on the positive side, more reserved, more crafty, wiser maybe. But on the negative side, maybe possibly hypocritical, possibly tricky in that sense. And then a dog, which is obviously more obvious and more not secretive like a cat is. And is more obvious and more outgoing, but is also. Is also maybe can feel a little too much like a little too obvious and a little too present, like a little too much in your. In your face. And so, I don't know. I mean, but there's definitely something going on in the modern world in terms of the relationship between, you know, people who love dogs and people love cats and, and how they see each other as opposites in terms of the ancient world. I never heard that. The idea that they are allowed beyond the iconostasis, for sure, they. They are an image of discretion. And there's a secretive aspect to cats, for sure. And I mean, that might explain something to do with, you know, maybe why cats were venerated in. In con. In places like Egypt or whatever, that there was something about their secretive type of. Their secretive aspect that was. Yeah, that had something to do. So. So I see people like, fighting, fighting in the. In the chat, like, cats are evil, dogs are good. Someone says God's cat when. That's hilarious. Oh, my goodness. All right, here we go. So Lisa says, can you elaborate on your post. Post in the Facebook group about the giants in the book of Enoch being as tall as Noah's Ark, 300 cubits in length. Someone commented that the ark is our boat, but their coffin. Is that right? And why specifically the number 300? I don't really think I understand why it's 300. I think. I'm sure Metzi would definitely have insight about that. But the fact that they're related in terms of their length, I think it has to do with something to the effect that Noah is using an aspect of the giants in order to build the ark. I've hinted at that a few times before, that there's something about Noah and it's pointed at in different ways in the traditions. You know, first of all, the idea that he uses technology, which is from the descent from Cain's lineage, in order to create the Ark is already a surprising thing. Like, he. He basically, you know, in scripture, it suggested, and especially in the Enoch traditions, that the technification of the world is one of the things that brought about the. The flood and. And the corruption. So the fact that Noah is using that knowledge and kind of flipping it in a way that he'll use it as a vehicle. And it's related also to the idea of Oholiab, which means something like the Bezalel, I think, sorry, Bezalel, which means something like the darkness of God, the one who built the ark of the covenant and the tabernacle. And there are other traditions that suggest that, for example, Noah married Tuel, Cain's sister, Naamah. And so there's some link. There's something of Cain in the ark and there's something of the giants. And so you can see, like, there are all these weird legends that try to hint at that. There are other weird legends about how one of the giants Og. These are Jewish legends that one of the giants Og, you know, like, either he rode on the side of the ark or that he also rode a unicorn. Like, there's a weird Jewish legend about how Og rode a unicorn behind the ark. And so it's like all these things that are kind of trying to help us understand, you know, ultimately, which I think is leading us to something like the symbolism of the new Jerusalem, where that lineage of Cain gets transformed and brought back. Like the garments of death are retransformed into garments of glory, something like that. So. So, yeah, I mean, it has to do with death, turning death against death, that's for sure. That's how I understand that. And so Patreon, we're moving to Patreon. And so Bradley says it's death defeating death. Yeah, that's pretty much it. All right. Nate Barker says, hey, Jonathan. Some passages in scripture make it seem like Christ, the apostles and the earliest Christians were under the impression that the second coming was happening very soon. For example, 1 Thessalonians 4, 13, 18, Paul seems to think within his lifetime or very soon after. What do you say to this? And why hasn't Christ returned after so long? When scripture makes it seems like his return is imminent, that's because his return is imminent. You know what I'm going to tell you? Christ is returning soon. So get ready, be ready for Christ's return. That's all I can say to that. All right, so here we go. Yah is Real says, hi, Jonathan. I'm a new supporter. I love your Ethiopian series and was wondering what your take on the symbology of Rastafari movement and Emperor Haile Selassie. One is, I know many people, including myself, who have been introduced to Orthodoxy and developed interest in it through reading about Emperor Haile Selassie. Thank you for your work. Really enriching stuff for the mind and soul. Blessings from Scotland. And so, I mean, obviously I would say that there are some aspects of the Rastafarian religion that are obviously like super weird. I mean, but there's an idea in Rastafarianism, there's an idea which actually, I think seems to interestingly pan out. Like there's something about the death of Haile Selassie that marks a transition in the world. And there's something about the figure of Haile Selassie which marks a. And it's not just the death of Haile Selassie. There's the death of Haile Selassie and there's also the death, you know, of the Tsar of. Of the Char. During the communist revolution. There's something about that which seems to mark the end of a. Of a world. And, you know, so there's something very. There's something very interesting about him and about his role, it seems, in this. The kind of end of the ancient world and this weird. This weird modern reality. This weird disenchanted and kind of modern reality in which we. In which we are in. And so I think that definitely Haile Selassie has an interesting position in that story. You know, there are really fascinating stories about how just like before World War I and during the time of the. These. This last. There was this last kind of effort by the different powers in the Christian powers to kind of unite and to create a common front. And this was headed in some part by people like Tsar Nicholas and Hale Selassie. And so they would actually have these meetings where, you know, all these kings of Europe and these Christian leaders would meet together, these Christian aristocrats. And what was interesting is that this is. Someone told me this. I don't know if it's true. I never fact checked it. Okay. But this is a story that I was told by Andrew Gould, by the way. And so Andrew told me about how during these. These events where all the, you know, the King of England and the king of. And the Tsar. The Tsar of Russia and all these Christian leaders would meet is that because they were. They would have these formal events and formal processions and everything. They had to decide like who. Who would be in the first and the second and the third in these Processions and in these. These entries. And they decided to do it based on the. How ancient their dynasty was. So Haile Selassie would always be the first because, you know, according to Ethiopian tradition, you know, it's like his. The dynasty is like thousands of years old. And it's like he's actually like the. You know, he's actually the descendant of Solomon in their. Their tradition. And so just interesting. Like, it would have been a really interesting time to. To be there with all these, like, these last Christian kings, you know. Okay, so Brandon Burns asked, what is the symbolism of the leprechaun? And so little symbolism of the leprechaun is the symbolism of Ireland. You know, it's like, that's what it is. The symbolism of the leprechaun is the symbolism of the monster at the end of the rainbow, you know, who hides a treasure. And you can understand, if you want to kind of understand the function that Ireland has had in, you know, preserving Christian wisdom and even Roman wisdom in a time of darkness. Like, that's what Ireland was, you know, that's what Ireland. That's the role that Ireland played. So I think that the leprechaun is like a weird manifestation of this strange exception on the edge of the world, which ends up being a treasure chest for the spiritual wisdom and the, you know, the spiritual, the mystical tradition of the. Of Christianity. So, yeah, that's what I think leprechauns are. So Christian Swenson asked, what is the symbolic meaning of Atlantis? And so I think the symbolic meaning of Atlantis is just one of the versions of the flood story that it's the version of the idea of an old world that was flooded, that fell into the ocean, and then it's gone. So we don't have access. We don't have access to that world anymore. It's just too far, far away from us. And so that's what I think. That's what I think. Atlantis is just another version of that, of a pre diluvian world, but now a myth taken from. Taken from the Greek point of view. Tom Megan says, can the metaverse be used for good, or can it only be an attempt to escape from the real world? If a good metaverse were to be built, what would it look like? I mean, the answer to that is whatever it is now, like the metaverse is already there. It's not like it's just not totally unified. So I don't think that it's evil in itself, but I do think that it's extremely dangerous, just like Twitter is extremely dangerous, just like Facebook's extremely dangerous, but maybe let's say times another 10. And so the difficulty with the metaverse and this stuff, even now, look, what I'm doing now is that there's a manner in which it is disincarnated. And, and so, so we have to be careful not to confuse this with true, true communion, you know, and true relationships. So you watch, you guys watching me answer questions. This is not, this is a, this is a diminished version of a, of, of human relationships. And although it's powerful because I, I can reach a lot of people and I can say a lot of things to, To a lot of people, it is a diminishing in quality necessarily. And so the metaverse is, Is going to be that as well. Now the problem with the metaverse, of course, is it's trying to be immersive, and it's all. It's trying to replace true. It's trying to, to pose as real relationships and pose as real communion. And so I think that that's definitely a problem. Something which will lead people into great despair if they accept that, like, if they take that seriously, it'll be very, very. They'll become very miserable. People will be miserable in the metaverse. They'll just know, like, how the Internet is kind of ruining people's mental health now. I mean, the metaverse, it's going to be way more. It's going to be very dangerous. And also because it's going, the way that the metaverse sets itself up is like almost like a infinite desire. And so, like, think of, think of someone who has, who, like, lives like a weird furry type character who has their digital avatar. And, you know, they fantasize about their avatar and they have this. And so there's something really weird and unhealthy about that. Or someone who's really obsessed with some massive video game and creates their avatar. And the video game, you know, takes all their time to create their avatar and then kind of sees it as an extension of themselves. But now imagine that. But now with goggles and you can look down at yourself and you can see yourself as this, as this avatar man. So it is. It is definitely dangerous. But I think that. Yeah, I don't know. I don't know. It's like, I don't know when the moment to back away from it is. I don't know. Because do we need people planting seeds in the metaverse? Yeah, of course. Just like, In a way, YouTube is a tool that is work that is actually bringing helping people Kind of move on a trail back to real communion. Maybe the metaverse will be that as well. But I, I don't know. Like, I, it's for sure, it's very, it seems like I've never tried it. Like, I never put on the goggles to enter into these kinds of worlds, but it seems like it could be extremely intoxicating and difficult to kind of keep your, keep your, yourself straight through all that. All right, Eric. Hence, he says, what are good indicators to check pattern recognition against confirmation bias? So there's a few ways to do it. One, one is, of course, to see if it matches with other. What other people have said, you know, if there's some corollary with what other people have said. Another way to understand is whether or not you can find other examples of the pattern that you're talking about. And do you have to ignore massive aspects of the way something presents itself to you in order to, to interpret it? A good, a good example of that is, you know, you see that all the time. People interpret, people interpret video, movies, or. I've seen it. Even people now interpreting, like my comic book, our comic book that's been out now, is that people get hyper focused on the detail and then they, they kind of stop seeing how that detail is actually integrated into other aspects of the story. And so, you know, you see that when people interpret movies, they look at, they watch the movie and then they catch some reference to something else, and they're like, aha. And then they jump into it. But they stop to see how these are all things that are connected together. So I think that those are ways to avoid confirmation bias. Being part of a tradition in general is a good way to avoid confirmation bias, because the mechanism has worked itself out where there's a reason for the patterning, like, let's say in Christianity, there's a reason for the patterning, which is also to kind of bring you, to transform you into something more. It's not just about, it's not just about pattern recognition. Yeah, but I think those are, those are good ways. And also ultimately, symbolism has to talk about a higher structure. It has to fractally lead you up towards something else. And so if your symbolic structures and symbolic interpretations are leading you down, then I would always be cautious about that. They can show you some aspects of what's going down here. But a good example is the UFO thing. It's like people who see UFOs everywhere, people who look at every traditional imagery they can find, as soon as they see a disc or a Circle. They're like, ha, flying saucer, right? And so it's like, what does that tell you about reality? What does seeing flying saucers everywhere in ancient art tell you about how to exist in the world? It doesn't. It's like a weird thing about information that's hidden in these things. And, you know, if you can decode it in a way, then it will. I don't even know what it's supposed to do. Like, who cares if they're like, why would that matter? You know? So I think that that's, That's a good way. If, let's say you're interpreting everything to know, like, whether or not lizard people rule the world or something like that, then, I mean, I would say it's like, try to understand what the idea that people think, like, why do people think that UFOs are important? Is a better way to under. To think about UFOs? Or why do people. How do people even come up with a theory about, like, how lizard people rules the world? That's more important than trying to look in every movie and find traces of, like, the lizard people. And, you know, you know what I mean? I hope people understand what I mean. So I would say that direction and then tradition and, and also notice making sure that your interpretation is coherent with interpretations that have come before you. So Corey Cobalt says that's maybe the problem with the Metaverse. It's structured in a specific format. It's designed to addict, to make people money, prioritize, pure sharing of information. Yeah, exactly. That makes sense. Like, you can understand that the, the very purpose of Metaverse is just to turn you into a product. And so already it's like, that's a problem. So, but like I said, I don't think that it doesn't mean that there would be something to do there, but it would have to be thought out and would have to be. You'd have to be cautious and not desacralize. So Jokubas wrote, and it says, what is the symbolism of boiling a child in the mother's milk? Is it related to spoiling? So this refers to a law in the Old Testament where it says that you should not boil a kid in its mother's milk. That is, you shouldn't. Yeah, so you shouldn't eat the meat of a animal that is cooked in the milk of the mother. And so this is really has to do with all these laws that try to preserve normal causality. Right. And try to preserve regular causality. This has to do with incest. It's the same type of law that has to do with not engaging in incest, which is a breakdown of causality. So you have, you know, you have father, you have a father and a mother and you have children, and then those children marry and then they have children. But if, if a father like has a child with their grandchild, then all of a sudden the relationship of causality is completely broken. The normal. So, so, so the father, right? So the father is both the grandfather and the child and then becomes the brother, the stepbrother of this one. And you know, it's like all the entire world starts to break down into chaos. And so the idea of not using something which is meant to feed the child, use that to kill and to cook the child. So it's like that which is life giving to the child. You don't want to use that as the means by which to kill it and to. Then, you know, so you could say that the right order is that you can eat a child and its mother's milk, but you would eat the kid after. It's because it drank from its mother, it got the milk from its mother integrated into its body. Then you eat the kid. And that's the proper way to integrate both at the same time. It's integrated fractally. But when you do this, that's when you break down the normal causality. So a good way to understand it is people wonder about these laws, like what is up with all these laws. What's important to understand is in these types of laws, it's something like pattern enacting patterns. And so when you do these things, Christians don't do this, but let's say these types of laws, when you do them, you are even unconsciously engaging in modes of being where you recognize levels of causality actively. Not in your mind, not in just thinking, but in doing it. You know, you realize that you have to keep wool and linen separate. You can't weave them together. So what is going on? You understand that there's are. There are different categories of beings that have to be kept separate to a certain extent. There are different generations of realities that have to be kept separate. And if you confuse them, then you create, you break down the world. So doing it in practice creates a pattern of behavior. It's. I've mentioned this before. It's like you tell your child to shake someone's hand. You say, you, when you meet someone you know, you stand there, you look them in the eye, you shake their hand. And so you would, you could say the same. You would say, why would you. Why is touching someone's hand something that matters? Like, why is it that you're telling your child to when they meet someone to touch their hand? What kind of. What kind of nonsense is that? But what you realize is that if the child learns to do that properly and to take the time to look the person in the eye, to shake their hands properly, to engage with them directly at a certain distance, with a certain firmness, with a certain rhythm, then that will leak into all their other behavior with people. It will create. It will become a pattern, especially with a greeting. It's like when you first encounter someone, here's how you set the pattern of behavior between you and them, and then that will then will have repercussions and into other aspects of how you engage with people. So that's how a lot of these laws function. There's nothing weird about it. We have a bunch of these types of laws ourselves. We just don't realize them because we take the idea of shaking someone's hand so much for granted that we don't realize that it's a patterning of behavior according to certain principles of how the world works. So, you know, all right, continuing on. We have to continue because we're about halfway through. So Anthony Ross Rosa says, to what extent should we practice these laws today as a Christian? There's a transformation that happens for sure in the. In the laws. And so it's. The emphasis is not exactly the same. The emphasis in Christianity ends up being a lot more in relationship to others and relationship to people. And so I would say, as a Christian, you should. You should just follow Christian behavior. And a lot of these laws, especially the purity laws of the Old Testament, are pretty much. They pretty much fall apart in Christianity also, because we are not. We are the strangers. Most of us at least, are. We are the strangers in that story. So. All right, Drew McMahon asks. Hi, Jonathan. My question is on the topic of free will. In your interview with Robert Reedlove about Bitcoin, you talked about free will and made the point you made before, that the only genuine free will move ultimately is in the movement, in the moment, move towards God. That everything else is contingent on circumstances and other forces you may not be aware of. Isn't one's choice in the moment to move towards God still impacted by those same forces and circumstances? I'm wondering how that choice in particular is different than all others, which makes it actually free versus all others, which are contingent. Thank you. Once again. It's like there is no such thing as we have to understand freedom. Understand freedom as that which moves away from enslavement to the contingencies and move towards the telos. So it doesn't mean that it's not framed by the contingencies. Right, of course. It's like you're not, you're not free to, you're not free to eat salt when you're taking your shower. Like, you're not free to. I'm trying to find the absurd connections. Like you're not, you know, you're not free to, you're not free to build a house when you're, you know, when you're driving your car. It's like the reality has its contingencies, but the freedom is when those contingencies come together towards the purpose. And so that's the, that's the freedom we have and is the freedom we have is to move towards purpose, move towards logos. That's the freedom. And as you do that, you, you become less burdened by. It's not that the contingencies aren't there, is that the telos enlightens them, like casts light on them. You don't feel them as contingencies as much. You see them as the frame in which to move towards purpose. And so I think that that's the way to understand freedom there. I don't think any other way to understand freedom works. It's not, it's just not. It just doesn't work. And so, so you can imagine that. Think of it like as you move up, so let's say you, you discover the logos of a specific thing and you discover the purpose and you move towards that purpose. And then that is, that is embedded into all these other purposes. And, and as you move higher up, then all those purposes, all those contingencies kind of fall away. It's not that they actually end up ceasing to exist, but it's that they don't appear as. They appear as these glorious points that are kind of moving up towards the ultimate purpose. And as you move towards theosis itself, then the whole world starts to shine with that one final purpose, which is, you know, to exist in love, in the, you know, in the life of God, something like that. And then, then you're free. You're not free in the sense that you're not free in the sense that, like, let's say when faced with a glass of water, you're like, well, I don't want to drink water, right? I want to, I don't know, I like, I don't want to Drink water. I want to do a cartwheel. And it's like, I don't want to drink. You know, I don't. It's like, no, you, you. You engage the world with a transparent vision and understanding and participation in the purposes of things. And so you're not a slave anymore. And you could be put in prison, you could be shackled to the wall, you could be tortured. Anything could be done to you. And you wouldn't always be free because you would not be a slave to the contingency because you would be living up in that higher purpose. So I don't see how without understanding freedom that way, that the Christian world makes sense. Like, if freedom is just this idea of a lack of contingency, then what does that have to do with a martyr? Like, what does that have to do with someone who is led into being eaten by the lions? The images of the martyrs are there to show us that if you live in the highest telos, with the highest purpose, then no matter what happens to you down here, you will be free. Not because you won't. Not because you. You won't be in the contingencies, because the contingencies are inevitable. It's that those contingencies won't swallow you. They won't. They won't hold your being. I hope that makes sense. I always feel sometimes with these questions that I'm actually being confusing to people. So Andre, Andre B. Says it's difficult to understand your views on angels. Really. The way you describe the angel of a city in scientific terms is reasonable. But could you use similar terms to talk about Gabriel, who told Mary she is going to give birth to Jesus? I mean, I don't know what to answer that. It's like, do you think that, let's say your being is reasonable in terms of science? Like you. You existing and being able to communicate and being able to act in the world is reasonable. And I. I hope you would say yes. And so when I use the image of a city and the idea of an angel that has a city as a body, you could say it's just to help you understand how you can perceive that. But there are other methods of causality by which higher beings can manifest themselves. And some of them are possibly more subtle than a city, you know? So think of it like the virtues. Like the virtues, the body of the virtues, or the kingdom of the virtues. If you have the angel of a virtue, then those angels have far more subtle bodies. The way in which they interact with the world is not the same as the City, A city is easier to understand. But in terms of these other types of beings that exist, the way in which they manifest themselves is more subtle. So the idea that there are, let's say, angels, archangels, and especially the notion of, let's say, Gabriel and Michael as these kind of two, two sides of, of the man which God manifests himself in the world, like, you know, the blue angel and the red angel or the, the angel of the right hand and the angel of the left hand that you kind of see in. And Gabriel and Michael. I mean, I don't know why that, I don't know why that's, to me, that's not bothersome at all. Now whether or not I can know the mechanical causation by which Gabriel manifested himself to Mary, I don't know. I'm not there. Like, I didn't have that experience. In a way, it doesn't totally matter to understand what are the mechanical causations by which that happened, the mechanical causes by which Mary understood that she had been contacted by an angel. I don't know what that experience is. I mean, she might have had a vision and that maybe no one else could have seen the vision that she saw, but the vision was nonetheless real and the vision was nonetheless true. And so, you know, Gabriel is using her mechanisms of perception through which to manifest himself to, to her. Right. You have an example of that, you know, in the story of, of Balaam and the ass, where, where Balam is, is going, is, you know, is going down the road with his donkey and he can't see the angel. The donkey can see the angel, but he can't see the angel. So it's a funny story. And then the, the donkey is trying to save Balaam moving off the, moving off the, the road. And so, and then all of a sudden Michael decides that he's going to manifest himself to Balaam. The angel decides going to manifest himself to Balaam. And so then Balaam sees the angel. And so these are. So what is the mechanical causation of that? Like, what is. I don't know. Like, I mean, I don't know, it's like, it's not, that's not the traditional stories. And these types of things don't, they don't describe that because they don't really care. But I mean, the reason why I use city all the time is just because it's a lot easier to understand with the city how phenomena can gather under a principality and then manifest a higher will into the world. But there are a lot of other ways that that can happen. So hope that makes sense. So Reuven Korf says. Hi, Jonathan. In exploring early Christian universal history, I've encountered what seems to be an odd mix of symbolism. That is many early church fathers connected the giants and titans of Greek myth with the human builders of the Tower of Babel. Yep. That is that chaotic and wild figures were the architects of the archetypal bastion of hyper order of the ancient world. This seems confused or at least confusing to me. How should I understand this? So it's not that hard to understand that there's a sense in which Nimrod is a continuation of the Nephilim. And this is something which is not. I mean, like I said in the story, it doesn't tell you how that happens. People try to find all kinds of weird ways to try to connect the Nephilim in the Old Testament to, let's say, Nimrod in the New Testament. Nimrod. Now after the flood, sorry, the pre Diluvian giants and then Nimrod. But there's definitely a connection between Nimrod and the, the giants. Like that. He just was a giant. So there's a sense in which, I mean, if you want to get nitty gritty with it, you can understand the way Father Stephen presents it in the Lord of Spirits, which is that, you know, there is a. There is a ritual to embody higher beings and mix them or connect them with humans and to make humans the place of embodiment for these, these higher. These fallen angels or these gods that, that mix with humans. And that's what a lot of this is about. You know, that after the flood, they somehow did it again. Like they somehow continued to embody these principalities in humans and that would create these demigods that were extremely powerful, extremely influential, that had, that had more power to them and were also the founders of civilizations, the founder of technical societies. Remember again that the cities are based in Cain. So Nimrod building a great city after the flood is a repetition of the problem of Cain in the pre diluvian world. So that's the way to understand it. So you can see how the church fathers would connect the Titans and the giants with that in the Bible, which was representing the same thing, which was representing the same, the same notion. So I think that that's, that's the best way of, of understanding it. And so the, in the Book of Enoch, what it describes, you could, you could then put it into the Greek world and think about the same thing. You know, you have these gods that come down and have relationships with women and then they produce children that become these very, very powerful figures that are terrible and that, you know, are the founders of civilizations and whatnot. So, yeah, so think about it like Gilgamesh was a demigod, for example, and Gilgamesh, you know, is another example of this kind of stuff. I'm probably going to do a talk, I did a talk last week at a college here about the relationship between the book of Enoch and let's say, technology and the environmental narrative, crisis narrative. And so I might do an English version of that for my channel, if people are interested in that, might do that. So Julius Richards. Should we not participate in a movie fandom? I would say it's probably better to avoid it, you know, I mean, especially like the more active parts of it. I would be careful. It's okay to be fans of things. Like, it's okay to enjoy things. I think it's always, it's always about the place that they have in your life. You know, if you, if you spend all your time thinking about Star Trek and you know, and you don't, and you, you live in the Star Trek world, then I think that's a problem. I mean, if you. Things are properly ordered and, and you think Star Trek is interesting and maybe can help you understand certain aspects of the world and how the world works, that doesn't take over your, your, your being, then I think that's fine. So, you know. All right, so Christian Kleist asked, hello, Jonathan, what is your favorite American folk hero? Paul Bunyan? Johnny Appleseed? John Henry. I don't really have one. I really like, I definitely like the story of John Henry. I like it because I think it does kind of represent the tragedy of our situation. You know, you think the story. Think of, let's say, of our own situation as the problem of John Henry. Think of, like, I always kind of joke, I can, I can think of someone like, like Elon Musk is like John Henry who finally gave in. You know, he's arguing, he's like, he's telling people to be careful about artificial intelligence. And finally he's like, you know what? We can't, can't beat him. Join them, you know. So, yeah, for sure. In our case, the story of John Henry will be important as we realize that we're being, becoming irrelevant to the machine, you know, and be, be attentive to that. All right. Dorothea says, is the conception of Christ, the virgin birth, connected to lowering heaven down and the assumption of the Mother of God to rising earth up and is it connected to the different roles men and women have in the church, that of women being lowering the heavens through prayer and the role of men being rising the earth through the sacraments? Yeah, I'm not totally sure about the second part, but definitely the first part is right. And also, not only is the first part right, but I would say that you really have to understand. So there's an image in the Orthodox tradition, you know, which is the Dormition of the Mother of God. So you see the Mother of God, you know, dead on, you know, lying down, and you see all. All the disciples around her, and you see people sensing around her. And then in the middle, you have Christ with the soul of the Mother of God in his arms. So I think that. That if you kind of understand that as the totality of the story, which in a certain manner, let's say the assumption of the Mother of God and, you know, the deification of the Mother of God and the Incarnation are intimately related. It's like in the incarnation is contained, you know, the final. You know, the final rising up of the saints, you know, meeting Christ up in the heavens that you see in the book of Revelation, you know, and that this is. This is related. All of these are kind of related. So the idea of, like, the heavenly Jerusalem coming down is also at the same time. Right. The earth meeting it. And so those two movements of the Incarnation and the assumption of the Virgin, they seem to be two aspects of a same cosmic mystery. You know, that's the way that I see it. You know, the idea that. Right, right. I mean, it's there, like, I'm saying this as if it's a big mystery. It's right there in the saying that we have all the time, the Saint Athanasius saying that. That God became man so that man would become God. Like, that's it. It's those two things happening at the same time. And you see that both in the Incarnation and in the assumption and the deification of the Virgin as being a kind of grand story version of that. That little statement, you know. Oh, yeah, by the way, Brad, I hear Brad, you have Covid. Dude, I hope you have the mild version. I hope you're okay. I mean, it seems like right now, mostly the mild version is what's left. And so if you have the omicron and it's the other variants, it's actually, I keep telling people, like, omicron is like a blessing. If you get Omicron. Get omicron. I had. I had the delta version, which was really not fun. And I feel like I still have some. I still have some, like, remainders of that, which is now, you know, more than six months ago. So if you can get. If you can get Omicron, like, run out and get it. Like, man, people are going to shut me down. YouTube's going to shut me down for saying that. But, like, be a good idea to get that. Bradley says I wanted the higher dose delta. You want to improve your masculinity? Only a minor cleansing of my sins. All right. All right. So let's get back this. Okay, so Anders Vsted said. Hi, Jonathan. What is the symbolism of tears? And what does St. Gregor of Nyssa mean by. For tears are the unfailing guardian of those saved by virtue. And so I think that, I mean, the way to understand. It's not any tears, by the way. It really. It is, in a way, tears of compassion for others and tears of contrition for yourself. Those are the salvific tears. And so there's a manner in which compassion for others is a immediate connection. So you cry for others, then you are living in them. Like, you know, they're. They're living in you, and you're living in them. There's a way in which the barriers get broken down. And so I think that that's. And there's a way in which there's a. There's a surprising thing about that, which is that there's actually a way in which having compassion for others is the only way to manifest the proper relationships of hierarchy, which is that there's like a weird secret about having compassion for others, which is that in order to have compassion for all men, you kind of have to be above, you have to be high up. You have to be able to perceive the suffering of all, and you have to be able to connect to all this suffering. So there's a manner in which it's the way to be above in the hierarchy without the dangers of being above in the hierarchy, without the danger of being above. Being high up and lording over others is the gift of tears. The gift of tears can be an image of someone who's really high up in the hierarchy of being, and that is manifesting itself through infinite compassion. Maybe that's the best way to understand that. Sean Rigaldo says, what's your process when writing? Do you have any tips in regard to symbolic writing? I mean, my process when writing is probably not the best process. I'm going to have to change that soon, because if I'm going to write an actual book. I'm very intuitive when I write, and I usually don't make a plan, and I just start writing, and then I just write. And I try not to be too judgmental when I'm writing. I just kind of let things connect. And then I do a lot of editing. That's the way that I write. And I do a lot of editing because I come back and then I put things back together and I work on the language and the formulations. But at first, it's really just trying to get all the images out and the stories out. So in terms of symbolic writing, in terms of writing about symbolism, I wouldn't have any other tips besides the one that would be just in general interpreting symbolism, which is that I think the best thing to do is to stay as close as possible to your subject at first, stay within the thing you're interpreting, and then once you've got that mastered, then start to apply it analogically for people to be able to see how it connects. But at first, try to stay as close as possible to what you're. You're doing. And one of the examples I always tell people, try, like, the way I do it. If you notice, when I talk about symbolism, I'll often give like, a really, like a biblical type example, like a kind of high example. And then I'll try to give a very basic one with, you know, like, you know, how you put your socks on in the morning or some really basic, basic thing to try to show. To try to test for myself even how the thing I'm intuiting properly connects to the different levels of reality. So that's advice for that. All right, so Dusan Babik says, why is national identity so important in Orthodoxy? Is there any deeper meaning of national identity from the perspective of eschaton, or is it just a consequence of having churches tied to specific people language? I think it definitely is. I think it definitely is linked to eschaton, and it definitely is linked to. To a proper embodiment of the Logos across all the different levels. And so this is something which right now is kind of in conflict because a lot of people in the Orthodox Church, and especially in the Orthodox Church in America, for reason, because in America, because a lot of the national Orthodox groups are in exile from their own nation, then they bring that into American Orthodoxy, which means that American Orthodoxy is struggling to find its own reality. It's struggling to find its own existence. And so it creates a weird situation. Orthodoxy in America is a scandal, to be honest, in terms of its Structure, which is that we have these different bishops for every jurisdiction in every city. This is not how Orthodoxy should be. There should be, you know, one structure in a. In a land and one bishop for a city. Or like, that's the ideal, but obviously it can't always play out. But like that. There's one bit that everybody that goes to church in one area has the same bishop. That's what it should be in Orthodoxy. But because of the national problem, then it's. So I understand why a lot of people object to it. But nonetheless, in the description of the heavenly Jerusalem, it says that the heavenly Jerusalem is there and is open, and the kings of all nations carry their glory into. To participate in the new Jerusalem. So there's a sense in which the best of all our identities at every level at which those manifest is to be given up to God and participate in this kind of eschatological, fractal, final reality, you could say. And so if you watch my talk with Aidan Hart, he mentions that the idea that one of the things you have to do if you're an Englishman is to be the best Englishman you can be. And that's part of you participating in this liturgical dance. And so it's like, I'm a father. I'm supposed to be the best father I can be. I'm part of a community. I'm supposed to be the best member of that community I can be. Always understanding that all of those kind of collapse into Christ. Ultimately, all these identities collapse into Christ, but that they have their reality at the level in which they are. You know, a lot of people use that verse which says, you know, there's neither Greek nor Jew, there's neither slave nor free, to basically collapse all the levels of reality. And I think that that's definitely the wrong way to do it. And I think that it's. It's a. It's a. It's a modern. It's kind of a weird modern way of using that verse. It really is more of how all these identities will lose their particularity as you move into Christmas. So there's a man in which you can move into Christ and find perfect unity of all the multiplicity. But that to the level that I am a Father, and to the level that I am a Canadian and I am a man and I am all these things, then I need to live that to its highest purpose. So Alicia Mertha says, I'm new to your channel, so forgive me if you're previously covered this. What is the relationship between symbolism, superstition, and conspiracy theory, it seems like these can easily be conflated and often are today. How can we best distinguish between them and ensure we aren't fluctuating between them? I mean, the first thing to say is, the first thing to say is that the idea that there are no conspiracies is, is, is, is a, is a political tool. There are conspiracies there. The fact that the difference between understanding that there are conspiracies there, there are definitely conspiracies. There are conspiracies, multiple conspiracies. Conspiracy just means there are people that have joined together and have a, have a goal and are trying to enact that goal in the world. You know, their purpose. And so they conspire together to do something. So there are plenty of conspiracies in the world. Now the problem that happens with the conspiracy theorists, the way that like the one that's completely unhinged, you could say, is they see everything as related to this pattern of behavior in the world. And so they're not looking at to what the meanings of things are as they move up the hierarchy of being, but they're only seeing these different coded meanings as an example of conspiratorial action in the world. So what do I mean exactly by that? Usually that type of thinking comes about when you don't believe the world actually has meaning. When you think that the world is arbitrary. Some people who think that the world is arbitrary and think that the world doesn't naturally manifest itself in meaning. When they see meaning in the world, then they think that that meaning had to be put there by someone for a reason. Then they look at the world and they see all these patterns. They see these relationships between like stories and they see how this and that, like different religion, tradition, this or that God looks like, or this story in this movie looks like this story in this movie. And they think, haha, someone put that there to control us, to manipulate us to do that. Now it doesn't mean that people don't put things in movies to control you or to manipulate you. Of course they do. Anybody who thinks differently has diluted to how the world works. So I think that symbolism, what it does is that it understands that these patterns are natural. First of all, they're natural in the world. They can be manipulated, they can be used for purposes, but they are, they will inevitably happen in the world. So the fact of noticing patterns doesn't mean that someone like, like a human agent put it there. It just, it's there and the world works rhymes like the world actually rhymes. Reality rhymes. Reality is patterned. And so. And then also those patterns scale up towards higher and higher understanding participations in reality. So when someone sees symbolism only as a way that proves some phenomena in the world where their symbolism isn't moving up higher, then that's when there's a problem. So, right. The example I gave before is one of the best examples. It's like UFOs, aliens, they're aliens. So then everything becomes about showing. So every story, every myth, everything is only there to talk about how there are aliens. And it's like, that's not helping you. Like, even if there are aliens, it's not helping you. It's not helping you understand how this patterned world kind of exists. So in terms of superstition, once again, like, I would also be careful. Like, often hidden in what we call superstition is often some meaningful stuff. Now, I'm not saying that I. I'm not saying that it's like if I see a black cat cross the road, that I'm going to freak out or whatever, or if I. But there's. If you analyze superstitions, maybe I should do it one day with you guys and get a bunch of superstitions and then help you understand why that pattern of being would coalesce into a story and why that story would be able to keep people's attention over several generations. And you could maybe understand how some of these superstitions sometime hide a nugget of some very powerful nuggets about how the world works in story world. So we could do that maybe one day. That might be fun. All right, so Charlie Longoria asks. Hello, Jonathan. I've been thinking about the relationship between the theotokos and the cherubim and seraphim in liturgy and in her prayers when we say she is more honorable than the cherubim when beyond compare, more glorious than the seraphim, what is happening there? I have a protecting veil of the Theotokos icon and she is surrounded by seraphim. Yeah, well, for sure. Like, when you see the Mother of God surrounded by angels, you have to understand that in a way she is like the ark of the Covenant. We often have the two angels. When you see two angels above in an icon next to the Mother of God, often either Christ or the Mother of God, it has to do with this idea of the two cherubs that are covering the ark. And so you could say that she has become the. She has become the. The container of the divine in the world. And so that's why she contains all of creation in. In her womb. I don't know how else to say it. That's why she's higher than the seraphim and the. And the cherubim. Like she contained in her that which the universe cannot contain. And so she becomes in a way, like an image of how we can also go up. And so it's like it's not just her. Like there's a sense in which we are in a certain manner meant to rule over the angels. Like man. Humans are meant to rule over the angels. And so the idea of the. This is a complicated thing because it's related to the man in which I talk about how human consciousness is central to all of this. And there's a manner in which although we understand these principalities as being above us, right, These angels as being above us, there's a manner in which if we were to participate in Christ to the extent that we can, then we would realize that. That we rule over the angels. That the. I don't know how else to say that, to not sound weird. I don't know what to say. But it like in terms of understanding that things manifest themselves in human consciousness and that they are like a kind of a result of man. Capital M, man. I think it's a key to kind of understanding reality. And I've argued with this with a lot of people like, you know, I have good friends. They'll know who. They'll know who they are when I mention them, who are more like Thomas and don't see the world to the same vision as St. Maximus, who has a sense in which the human person is the laboratory where all of this takes place. The human person is. It is ultimately the place in which the seeds of all creation gets gathered into Christ. But Christ as the incarnate man and we are called to participate that. And there's even a manner in which that incarnate man maybe was like a good way to understand it was that the incarnate man was there at the outset. Was there, right. It is the incarnate Christ that created the world. So they say crazy things to help you understand that. Things like, you know, that when Christ was on the cross, he was creating the world. Things like that which sound completely crazy. But if you understand what is trying to get to which is that the creation is linked or finds value in consciousness and human consciousness, then it doesn't. It's not so weird anymore. I said this in my discussion on. On, like the. On Jordan Peterson's channel. The one video I did for the Jung Institute, where I said man is at the origin, you know, the world is born in consciousness, and to the extent that we have access to it, is born in human consciousness. Yeah, I don't make sense. That's the place where heaven and earth meet. So. So Andrew says, what is the symbols of the Antidoran? Is it related to St Christopher, to the dogs eating the crumbs that fall off the master's table? I think it definitely is. It definitely is related to that, but also us, like, all. To the extent that we are also that. Like, it's not just about the outsiders, but it is a sense in which the crumbs of communion, you know, actually fall into the world, and the blessings that come with liturgy, you know, leak out into reality and that, you know, the. The food of God reaches all the way to the edge of the table. And so I definitely think that that's what the antidoron is related to. So Nathan Hart says, what is the symbolism of the Ukraine versus Russia war being fought by two men named Vladimir Volodymyr? And how does it relate to universal history? First Russ King to convert. Yeah, it's definitely tragic is what it is. I mean, the Rus found their Christianity in Kiev. I mean, that's where. That's where the origin of. Of Russian, of the Rus says Christianity is. And so Prince Vladimir was the prince of Kiev. So, yeah, it's. It's definitely a horrible situation all around. Like, it's just. It's just. And it's. And watching, like, just watching the church devolve, you know, as this horrible war is going on is. You know, if people. I've really decided that I'm not gonna get. I'm not gonna speak about it too much, and there are reasons for that, but I hope people don't think it's because I take that war lightly and that I. That I'm not seeing the tragedy that's happening there. So, yeah, there's something playing out, folks. Like, there's some big story that is really. Everything is winding up, you know, and it's. And in a manner, it's like. It's a weird surprise, but maybe not such a weird surprise that. That the orthodoxy is thrust into this. Like, thrust into the very place where all of this is. Is kind of coagulating this whole big wind up. All right. Oh, Lisa says don't scare us. I'm sorry. I feel like I've been. I feel like. I feel like since. Especially since COVID started, I feel like I've just. It's hard for me not to. To say scary things. And I wish I didn't have to say the things that I'm saying, but I'm not going to pretend like, I felt so bad, man. It's like I went. I did this Q and A at this college, and the Q and A, the subject was about the end of the world. Their conference that I was supposed to talk to two years ago, and I didn't, like a year and a half ago or whatever. And so finally they said, well, why don't you come and do that conference we're going to do? So I did the conference, which was about how, you know, how to help people understand the story of Enoch and how, you know, what it means for fallen angels to fall into the world and to bring technology with them and to have corrupt relationship with women. Like, you know, for a lot of people, it's like, it's just complete insanity. It's just a science fiction story. So I'm like, I'm trying to help them understand how once intelligent patterns get unleashed in the world, then there's a manner in which once the genie is out of the bottle, you can't control it anymore. It just runs right. Like you. You unleash a technology through desire without understanding the ramifications of all what it implies. You just see the increase in power. You don't understand what it's going to do in the world. Then it does it, and you're like, you're surprised. Like, you can't be surprised. These patterns are going to run. And so I was talking about that and talking about nuclear, you know, nuclear war and talking about, you know, basically being. Just talking about how once the genie's out, it's like he basically saying, there's no. There's no big solution right now. There's only little solutions. I can't. There is no big solution. And it's like at the end, man, the kids were just looking at me. They're like 18 years old. They're just looking at me. And the teacher, bless his heart, who. I. I appreciate him very much. He's a nice man, just tried to recuperate the situation. He. He was like, you know, maybe you can give us some positive something, Jonathan. Maybe you could twist it into something positive. And I was like, yeah, maybe. Anyway. So anyways, I talked about. I talked about, you know, building an ark and talking and, you know, how we need to reconnect in our communities. That's the only thing I could say. So, yeah. All right. So Kirsten curiously says Hello, Jonathan. What is the symbolism? Saint Anthony, the centaur and the satyr. I find it fascinating that he was apparently born the same year St. Christopher was martyred. Thank you. Hope you're well. Interesting. I didn't know that the source, St. Anthony in the center on the side is super interesting because it really is a nice little cosmic image, which is that St. Anthony goes out into the desert and then he goes out into the wilderness. And then in the wilderness he encounters monsters. That's where you encounter monsters. Right. And those monsters are images of his passions and are images of his temptations. So if you want to kind of understand how later in Western iconography, ultimately demons are represented as a mixture of all these different animals and stuff and are all kind of chimera and hybrids, then you can understand that the story of St. Anthony in the desert is a recasting of these ancient hybrids into the moral frame and the more connected frame of. Of Christian, Christian. The Christian hierarchy of values. Because in a way, the centaurs and the satyrs, even in Roman times and in Greek times were already images of human passions. Like, look at the stories of the centaur. The story of the. The centaur is always trying to like rape someone's women. Like that's all the centers are always doing that. And the satyrs are always also extremely sexualized in Roman iconography and, and in Greek iconography. And so the relationship between the. The hybrid animal and a kind of disordered passion, you know, it's like, what can I tell you? St. Anthony went into the desert and encountered furries. Like, I don't know what else to say. It's like that. It's the. Nothing has changed. It's still the same now. You know, it's Nothing has changed. So. Arie Fisher says. Hi, Jonathan. Matthew left a very interesting comment on Colonel for the Catacombs recent video saying that there was an important tradition that interprets 666 as being the combination of the 600 years of Noah was alive and the height and the breadth of the statue of Nebuchadnezzar. This is comes. This comes from. From Saint Irenaeus of Leon. I mentioned that in my video on 666. Matthias says that because the years of Noah's life have to do with time and the measurement of the statue space, that 666 is more like an evil meta space than it is just space on steroids, which is how I understood it until now. He also relates this to our situation of the coronavirus, a virus of crowns what are your thoughts on this? Well, dude, as usual, Matthew, if you can get insight from mature, like, there's no doubt about what it is, like, I. I've rarely heard him give any bad insight. And so you know the kernel of catacombs, by the way, go watch it. His videos are wonderful. And Matir's intuition is, as usual. Right on. He always sees one level higher, and I'll be honest with you, often one level higher than I can see. So would this be a way of distinguishing between something like a system of purity which just tries to cut off the outside, versus something more sinister, which tries to control both the inside and the outside? Yeah, using one to accomplish the other. Like Ozymandias in the Watchmen. Exactly. That's a really good way of understanding. And so it's a manner in which. Like the way that I talked about it, it's something like the idea of accounting for everything, like, accounting even for the exception. And like you said, the idea of. You see that in the notion of. Of, like even in the communist time or. And now. Right. The idea of controlled opposition, the idea that you infiltrate even your enemy and you actually have a kind of system that incorporates even your. Your enemy into it. Yeah. Scary stuff, that's for sure. So Scotty Thorpe says hi, Jonathan, inspired by your recent video on the anadromous. Can you elaborate on the symbolism of puppets? I mean, I don't really know what else I. What else? I could say that. What I said there. I mean, they're just extensions of be. Of humans. They are often kind of caricatures different aspects of humanity. You see that especially in the more traditional puppet shows where they represent archetypes and so you can understand them as. As kind of extensions of. Of. Of what humans are and even physically. Right, because you. You kind of control them and they manifest some element. So that's why I see that. All right. Ben K. Says. Hi, Jonathan. Tragically, my cousin has been diagnosed with terminal cancer at the age of 22. I'm sorry to hear that. His doctors say most likely he has only a matter of weeks to live. To be honest, I'm completely unsure about what to do about it or how to help. Are there stories, scripture, or anything else that you could recommend to navigate such a troubling time? Apologies for the heavy subject matter, and thank you for all your work. You know, I mean, I would say the. The death of someone you love, especially if it's something that is announced and you know it's coming, is a. Is a tragedy. And it's something that you can't help, right? You can't stop it. I mean, unless. I mean, unless you're a saint, maybe you could, you know, but most of the time, no, I would say that then take it as an opportunity to love your cousin and take it as an opportunity to show your cousin compassion and affection in ways that maybe you would not have done if he was not in that situation. And we live our lives, and we. We kind of have these superficial relationships, and we have these. Kind of take things for granted, and we take people. People for granted, you know, just normally. And so I think that when someone you love is dying, it's an opportunity to make those last moments shine as brightly as possible. So that's what I always encourage you to do. All right. Kevin Peterson asks. So Kevin Peterson asks, does the principality of Soccer unite countries into itself? If so, does it contribute to the breakdown by creating its own subculture? And so. Well, look, there's a. There's a theory, you know, and that this theory is a. Is a globalist theory. There's a theory of the Olympics. So I don't know if it's about. If it's about soccer. I think that soccer is maybe too low of an identity to really kind of understand what's going on. But there's a sense in which, in Greek culture, casting the strife and casting the competition into a liturgical ritual practice seem to have been a way to channel aggression and to channel the different conflicts into a kind of symbolic. A symbolic ritual that would embody it, but also maybe evacuate it. So I think that that's something you could see in. I think that that's the function that the Olympics seem to have had at the time in the Greek states, in the Greek cities. And I think that there was a desire to do that. Today, I think there's a desire for the Olympics to actually be that. And so you can really understand it like, you can understand it like, you know, how animals will have a show, right? They'll have a show of strength. And so, you know, how they'll play fight. And because they play fight, you know, the male manifests his supremacy and will have the females. But the word. The person that, you know, submits at the end of the play, fight. Doesn't have to die, right? Doesn't have to die, you know, for the one. For the. For the stronger male to. To get. To get his boon, let's say. So I think that that's one of the things that sports can. Is meant to do symbolically and structurally, in terms of civilization. So I. I think that there's. There's nothing wrong with that. You know, I mean, it seems to not be totally sufficient. But I mean, it can play that role to a certain extent, I think. And I think in some manner it has. But. But it's limited. You know, there's going to be war anyways. There were wars in the Greek states and there'll be. There are wars since the Olympics started. So. All right, so Chandler Turner asked. I was wondering about the symbolism of Z, something which we've all been seeing more of recently. I mean, it's not very complicated. I don't know, is it really? Like, especially in terms of our languages. It's just about the end. It's just the end. So people have played that game with, like, what is it, that movie or that book, World War Z, where in a way it's like the last war, but it's also the Zombie War. And so there's a. There's a relationship between Z. Like even the idea of. Of people who talk about Generation Z understanding that it's like intuitively talking about it as if it's the last generation of something. Like, it's. It's a weird. It's a weird because. Because, you know, people said Generation X and then it was Generation X was like generation without identity, but they didn't totally realize that then it would be like kind of Generation Y, I guess. And then Generation Z, which is like the last generation. Is that. Is that what's going on here? So. So that's usually what Z represents, presents. And so. And then someone mentioned the Z, like in terms of also the Azov battalion, that there's something going on there which has to do with the end as well. But I don't know if that's what it is. But at least that's the way that. That's the way that it plays out. At least for us. When we think of Z, we think about the end. So Nicola Alexis Lexish asks, when Jacob was leaving his Uncle Laban, what was the significance of Rachel stealing Laban's household idols and then successfully hiding them during the search? If you want to understand that there's some humor in that story, if you want to understand that, you have to understand how she hides them. She hides them by saying that she has her period and that she can't get up from the. You know, from where she's sitting because she has her period. And so if you want to understand what it means for Rachel to steal the foreign gods and the remainders to take with her the remainders of her brother's house back into Israel. You could say that that's the story of Israel. Like, it's the story of Israel all the time, right? It's the story of Israel leaving Egypt, bringing with it the gods of Egypt, the golden calf, bringing with it also the mixed multitudes that are in Egypt with them, and then becoming very difficult for things to integrate because of this problem. But also, it's like, it's part of the story. It's like it's part of the story. You know, the, it's part of the cycle. Like, if you want to get the whole cycle, it also includes that, that part at the end, there's these remainders, and those remainders are part of the, or the story. And so I think that that's what's being represented here. Like, if you want to understand, if you want to understand menstruation, it's like that story will help you understand menstruation. Sorry, sorry, guys. You guys asked the question. All right, Luca Irimad's asks, symbolically, are software developers like, blacksmith, who would be the closest to, or are we our own breed? I mean, software developers are like blacksmiths in the sense that blacksmiths are the ultimate representatives of, of technical people in the ancient world. Right. You have the image of the black fist, of Tubal Cain as a blacksmith, or of Hephaestus as the blacksmith. God is, is the ultimate image of what technology is. So you're right, they are in a way, the modern, the modern blacksmith. So. All right, so Brandon says, what is the symbolism of the medieval sword, specifically of its representation as an upside down cross? So I don't think it's seen as an upside down cross. It does definitely there's a relationship between the sword and the cross, but I don't think that it's understood as an upside down cross when people use it. I've never seen anything that refers to that. There is a sense in which, you know, you see the knight who turns his cross around and then almost has it in front of him, almost like a cross, that he's venerating the cross. So definitely that's something that I've seen that type of imagery, but I don't think it's ever understood as an upside down cross. But I mean, the symbolism of the medieval sword is just a symbolism of authority and a symbolism of, of, of the power of the, of the king or the nobleman or the knight, you know. All right, Alex Couches, what is symbolism, meaning behind John the Baptist Beheading. I live by the sword, die by the sword. That's what Christ said. Right? And so you can understand the. You can understand beheading as the separation of body and of soul and body. That's what beheading is. It's a separation of heaven and earth. All right, I'm kind of winding down here, guys. It's been two hours. Okay? Norm gone says hi. Jonathan, is there a relation between the Ark and the circus caravan? It seems like the circus is revealed as a total facade. And the reality of how it travels from place to place while the Ark is revealed as the light of the new world, are both remnants one of the old world and other of a new one beginning. Thoughts? This is. This is not your question, but I'm going to answer it in a way that. That will maybe surprise you. There's definitely a relationship between the Ark of the Covenant when it is taken by the foreign nation and the circus caravan, because all the symbolism of it, you know, like, causing deformations in the groin area and. And causing growth in the growing area, and then also, you know, being related to rats and mice and infestations of. Of vermin, and then the idea of, you know, having to make these little, like, idols of. Of tumors and. And of rats and then letting the ark, like, just go on its own, like led by animals, you know, for it to finally return to Jerusalem where there it ceases to have its. Kind of ceases to have the effect of what happens when the center is taken out. Like when the center is taken out of its proper place. So I think for sure there's a relationship between those two. I don't know about the Ark of Noah, though. That's something to think about. All right, guys. And so sorry, a few dark questions in this, and if you like, a few questions, a little slightly inappropriate answers. I mean, it's hard because sometimes these things, if you. If. If that's what we're talking, it's like, that's the question. That's the. That's the answer. So sorry. Hopefully. Hopefully everybody is doing okay. So. So everybody, thanks for your. Thanks for your attention. Thanks for showing up. And there's a lot of stuff going on. I will let you know. There's some interesting announcements I'll probably be making soon. The website is being worked on again, finally. I think I mentioned that last month. You know, the designer is. Everything is supposedly coming together, and we'll have what we hoped for last year and never happened. God's Dog is finally out. That is the PDF, the printing is still going on and that's not totally finished but at least I decided to release the PDF out to everybody that backed it. Those that didn't back it. On Indiegogo there is also a link to if you go to godsdog.com it'll bring you to a pre sale store that is still going to be open for little while until we kind of lock all the printing until the printing's finished. I'm gonna leave the open the pre sale store open until we run out of books. Like if we sell all the books then then that'll close. So. So if you're interested this a ways to back it and thanks everybody for your attention. Thanks to Lisa, I know it's late for you. Thanks to Brad also for for for moderating. I always appreciate you guys and and I'll talk to everybody very soon. Bye bye. I hope you enjoyed this episode of the Symbolic World. The Symbolic World is based on a series of videos that you can find on my YouTube channel, Jonathan Pedro's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things civilization symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course leaving a review on itunes. Everybody knows that's the best way to get the podcast out there to get it heard. And if you want to get involved, you can also support the podcast financially going to www.thesymbolicworld.com support or else on Patreon the Pageot videos as well and on subscribestar. All those links you can find on my website or in the show description. So thank you and I will see you soon."}
