{"episode_id":"SW - #009 - 2018-07-24 - Milo, Jordan Peterson and The Symbolic Worldview. Discussing with Rachel Fulton Brown","start":0.56,"end":73.37,"speaker":"Jonathan Pageau","text":"Hello, everyone. Welcome to the ninth episode of the Symbolic World podcast. On this episode, I'm going to play for you a discussion I had with Rachel Fulton Brown about a year ago. She is a professor of Medieval history at the University of Chicago, and she's been going through a lot of stuff, a lot of controversy around her. In the discussion, we talk about many things, including Milo Yiannopoulos, for example. And so the place that Milo holds on the public sphere has changed quite a bit in the last year. But I think that nonetheless, the discussion, even though it was a year ago, is quite relevant to understand some of the symbolism around the discussions that have been having as well. We talk also about the symbolism of the feminine, its importance, and how we need to recover that. And so I hope you enjoy this and I'll see you soon. This is Jonathan Peugeot. Welcome to the Symbolic World."}
{"episode_id":"SW - #009 - 2018-07-24 - Milo, Jordan Peterson and The Symbolic Worldview. Discussing with Rachel Fulton Brown","start":83.99,"end":112.58,"speaker":"Jonathan Pageau","text":"So, hello, everybody. I would like to present to you Rachel Fulton Brown. She's a professor at the University of Chicago. And we met through Facebook and through being interested in Jordan Peterson, and we realized that we had a lot of interesting things in common, including our interest in medieval theology, medieval symbolism, arts, so many things. So we're gonna. We're gonna have. We'll see, have an interesting discussion about all that. So maybe, Rachel, you can introduce yourself a bit more in more detail."}
{"episode_id":"SW - #009 - 2018-07-24 - Milo, Jordan Peterson and The Symbolic Worldview. Discussing with Rachel Fulton Brown","start":112.9,"end":151.51,"speaker":"Rachel Fulton Brown","text":"Oh, thank you. Jordan. Jonathan. Yes. I have Jordan and Milo on my mind. So some of you may know me as Fencing Bear at Prayer, because Milo has been sharing some of my blog posts about him over the last year. I'm also a great fan of Jordan Peterson because I'm very interested in the way in which he talks about mythology and religion and psychology. So I'm really excited to have this conversation with Jonathan because I'm very interested in the way in which his art matches with the kinds of storytelling that I see Jordan doing and Milo actually portraying and living. So I'm happy to be here. Thank you for having me."}
{"episode_id":"SW - #009 - 2018-07-24 - Milo, Jordan Peterson and The Symbolic Worldview. Discussing with Rachel Fulton Brown","start":152.15,"end":195.06,"speaker":"Jonathan Pageau","text":"So I've been, you know, as most people who will be watching this will know, I've been friends with Jordan for a few. For almost two years now, and I have been paying attention to Milo Yiannopoulos ever since the. The UMass event with Trigglypuff and all that. So I've been. I've been following and being very attentive to what he's been because I saw in him a lot of the symbolism of marginal symbolism that I've been interested in for the last few years. And so maybe you can. When I heard that you were friends with Milo? I was. I was extremely surprised. So maybe you can just quickly tell us how you met him, how you're in contact with him. How exactly did a, you know, a history professor at University of Chicago become friends with him?"}
{"episode_id":"SW - #009 - 2018-07-24 - Milo, Jordan Peterson and The Symbolic Worldview. Discussing with Rachel Fulton Brown","start":195.86,"end":198.98,"speaker":"Rachel Fulton Brown","text":"So tell me, why were you surprised when you heard that I was friends with him?"}
{"episode_id":"SW - #009 - 2018-07-24 - Milo, Jordan Peterson and The Symbolic Worldview. Discussing with Rachel Fulton Brown","start":199.46,"end":206.26,"speaker":"Jonathan Pageau","text":"Well, just because he's. I mean, I don't. I, like."}
{"episode_id":"SW - #009 - 2018-07-24 - Milo, Jordan Peterson and The Symbolic Worldview. Discussing with Rachel Fulton Brown","start":206.26,"end":206.58,"speaker":"Jonathan Pageau","text":"I."}
{"episode_id":"SW - #009 - 2018-07-24 - Milo, Jordan Peterson and The Symbolic Worldview. Discussing with Rachel Fulton Brown","start":207.06,"end":244.9,"speaker":"Jonathan Pageau","text":"How can I say this? I think that I see him. I see him as being. Maybe I'm wrong. And I saw. I saw him as being maybe more unconscious is what than what I thought. And so. And so when I. When I saw what you were doing and the type of symbolism that you're talking about and your understanding of kind of, you know, the types of patterns that exist in the medieval worldview, I was like, huh, you know, maybe. Yeah, maybe he's more aware than I think. And so it got me really curious about. About how you met him and kind of what type of discussions you've had with him and everything. Because I'm very fascinated. I'm very fascinated by what he kind of represents."}
{"episode_id":"SW - #009 - 2018-07-24 - Milo, Jordan Peterson and The Symbolic Worldview. Discussing with Rachel Fulton Brown","start":245.54,"end":294.68,"speaker":"Rachel Fulton Brown","text":"Well, that's interesting that you say that. What you. What you were startled by is that he seems. Whether you're wondering whether he's conscious of what he's doing and why I can see it. Well, I'd say one of the things that absolutely fascinates me about Milo is how well he embodies that archetype that Jordan recognized when he was interviewed about Milo in February, that Milo is this trickster figure. And, you know, I think if Milo were actually. I think he's conscious of it and unconscious of it at the same time. And it's like. It's sort of amusing for me as the medievalist to be watching him and then seeing that the symbolism that he's playing out, because I think if he were doing it in a more sort of conscious way, it wouldn't be as quite as effective. But maybe you want me to tell my story about how I got in touch with him."}
{"episode_id":"SW - #009 - 2018-07-24 - Milo, Jordan Peterson and The Symbolic Worldview. Discussing with Rachel Fulton Brown","start":294.68,"end":296.52,"speaker":"Jonathan Pageau","text":"I mean, just briefly. That'd be interesting."}
{"episode_id":"SW - #009 - 2018-07-24 - Milo, Jordan Peterson and The Symbolic Worldview. Discussing with Rachel Fulton Brown","start":297.08,"end":663.62,"speaker":"Rachel Fulton Brown","text":"So back in September, I was. Well, I was finishing up the book that I'm working on and that I hope you and I get to talk about on the symbolism of the Virgin Mary. So I guess my head was just absolutely full of all of the kinds of symbolic resonances that medieval Christians used to use. And the deans of our college sent out a letter to our incoming freshmen saying that when they come to the University of Chicago, they should not expect to find safe spaces and trigger warnings in their syllabi or in their classes, but come to the university expecting rigorous debate and challenging arguments. Over the last. Over the previous winter, I had been involved in a kind of online, a smaller online argument with some of my colleagues in medieval studies over a post I had done back in June 2015 that I labeled three cheers for white Men, purposefully to get everybody's attention, to make an argument that there are very positive elements of the Western, Christian, European, and therefore also American tradition that we in our culture would do better to actually acknowledge rather than simply saying all white men are potential rapists and that they're the problem. And my three cheers were the idea of chivalry, the idea of marriage as something that involves the consent of both the man and the woman, and the political right for women to have the vote. And I reminded my readers at the end of that little post that if you want to argue with me, remember that one of the great freedoms that we have in the west is the idea of freedom of speech, right? Well, so that post from June 2015 sort of sat on the Internet being ignored for six months until one of my colleagues in medieval studies found it for a book that she was writing on digital whiteness. And thereafter, History Is Made. She found my post, and a bunch of my colleagues in medieval studies got very excited about the fact that they found a real white supremacist. They thought they found me, right? So they left on Twitter and they left on Facebook. And in that moment, a friend of mine mentioned to me that my post was getting some attention, and I sort of leapt into the fray on the Facebook group in the happy warrior guise that I've been trying to. Trying to cultivate, and said, hi, everyone. I hear you have some problems with my post. Let's talk about it. And by the end of that afternoon, I managed to change the conversation sufficiently that the only person left really arguing with me was the original poster who was upset with me. And I realized in that moment that, you know, this is what I'd been waiting for, right? I needed to make these arguments for our culture. So I did a long series of posts on chivalry and on different ideas of freedom in the United States and, you know, the sort of larger arguments that I wanted to start making about the value of Western civilization and the problems that we're having in the academy. So in September, when our dean sent out that letter, I was already kind of primed to be in that aspect of the culture war. I was a little bit aware of Milo from the previous spring because another colleague of mine had also gotten caught up in the white supremacist misogynist labeling. At about the same time, the feminists found me, and he actually, Alan Franson, my good friend, got shamed much more effectively than I did. There were some conference sessions in his honor that were canceled in a Fesh riff that was pulled from publication. And because Alan himself is gay, we were both sort of aware of what was going on with Milo, but we weren't really sure, like, who is he? And so I was mildly aware of the uprising at DePaul when Milo was prevented from speaking by the Black Lives Matter protesters, but I hadn't really properly paid attention to it. So September comes, I'm sort of in a good place with my book to be paying attention to some of the other things that have been happening. The letter come out from the dean, and I say, fine. I'm curious. I, as a medievalist, think it's a. It's a bad idea to condemn someone as a heretic without a proper inquisition. So I went and watched, you know, as many of Milo's talks as I could in, like, three days, all the ones that have been posted from the previous spring. And at the end of those three days, I wrote to him because I. And I labeled that post Three Cheers for White Men. That would work to get his attention. I said, Dear Mr. Yiannopoulos, I teach at the University of Chicago. I'm sure you've heard about this letter that our deans have just sent out. I'm in this, and I put some links on from the chivalry post that I'd done. I admire you greatly, as does my dog. I didn't mention the dog. And, you know, thank you for doing what you're doing. Well, he wrote back immediately. And after that, we stayed in contact over email, with me sending him things to read, suggesting further things that I thought he might find useful to look at. And from my end, watching all of his talks so that I really knew everything that he was saying. And, you know, it's been the most wonderful experience for me over the last year because it's been wonderful having a friend who was as fully engaged in the fight as I knew we needed to be in order to really make the cultural arguments that we have to."}
{"episode_id":"SW - #009 - 2018-07-24 - Milo, Jordan Peterson and The Symbolic Worldview. Discussing with Rachel Fulton Brown","start":665.62,"end":678.31,"speaker":"Jonathan Pageau","text":"And so here's my big question for you regarding that, because I've been thinking about. I've been thinking about him and kind of what. What he is or what he represents and everything. So the question is if he's a Trickster."}
{"episode_id":"SW - #009 - 2018-07-24 - Milo, Jordan Peterson and The Symbolic Worldview. Discussing with Rachel Fulton Brown","start":679.99,"end":680.39,"speaker":"Rachel Fulton Brown","text":"How."}
{"episode_id":"SW - #009 - 2018-07-24 - Milo, Jordan Peterson and The Symbolic Worldview. Discussing with Rachel Fulton Brown","start":680.55,"end":705.53,"speaker":"Jonathan Pageau","text":"How does that work? Like, how. How is he a trickster on the conservative side? Like, how do you see that happening right now? It seems like usually, let's say in mythological images, the trickster is there to. To unbind, let's say, or to loosen things that are too, too strict. Whereas in, in his case, it's very ambiguous. So I'd like to get your take. I have my own ideas about that, but I'd like to get your take on that."}
{"episode_id":"SW - #009 - 2018-07-24 - Milo, Jordan Peterson and The Symbolic Worldview. Discussing with Rachel Fulton Brown","start":706.73,"end":983.27,"speaker":"Rachel Fulton Brown","text":"Well, I think you're right. It's ambiguous, which is the role of the trickster, that he is standing on the border between all of the different sides. And as he said quite well, I think, in his little panel discussion on the Bill Maher show, that the alt right hates him just as much as the alt left does. If you say punta, quote of phrase, right, that the extreme right and the extreme left both find him problematic. And, you know, the trickster needs to be the one that stands on the. On the borders and shows up the sort of rigidity of both sides. Now that it's interesting to me that, of course, Milo initially was being invited to give his campus talks primarily by student groups. He always did his talks for free for the students who invited him. And the groups that were inviting him to the campuses were typically the College Republicans and the Young Americans for Liberty. So, you know, politically, they were what we tend to think about as at least more conservative than not. And of course, because he had the good fortune of doing this campus tour during the election year, it meant that the country was quite excitable, as we get in election years. And he came out very strongly for Donald Trump, primarily, he said, because he thought Trump would be. I think he sees Trump as another kind of potential trickster character, that he always liked Trump as someone who was going to break down the political correctness that had been stifling everyone's speech. Now, what I think. I think you're saying he's ambiguous. He is. His primary mode of engaging with people is through humor and jokes, right? And he loves saying that nobody can resist the truth wrapped in a good joke. And his motto, as it were, which he gets from GK Chesterton, in fact, is rhesus at bellum, laughter and war. Right. That if we're going to win the culture war, you win with joy, not grimness. And I think what the conservatives of the kinds of political conservatives that originally invited him to CPAC and then got cold feet when the videos came out in February about his adolescent sexual life showed is they are as scared of a joke as the left has been typically proving itself to be. And so what, Milo. I've written a lot about what I think Milo shows us in terms of the importance of humor and the way in which humor is sort of scary. Milo also likes talking about how the thing that tyrants. I apologize for my dog. She's just gonna do that. The thing that tyrants hate most is the sound of laughter, because it's the place where people are actually. And I have thought about this a lot. It's like you need structure in order for society to exist, right? Societies can't exist without some kind of order. And you and I both know that Jordan talks about this regularly, that, you know, you need the structure of the walls and the. And the hierarchy and the ordering institutions in order for anybody to be able to live. Otherwise, just we're in chaos, right? But structure itself could become so rigid is to become itself tyrannical. And I think what Milo is doing with his laughter and his willingness to stand there, you know, you can imagine standing there on the city walls and pointing both inside and outside and saying, those of you who think you're safe inside need to loosen up a bit and have some fun and be able to make jokes at yourselves and recognize that the more you try to be morally pure, the more risible you're going to become. But likewise, those who are saying they're standing on the outside of the city and saying, we don't want any structure and we don't want any laws need to be able to laugh at themselves. And what I have just, you know, Milo, I did a blog post just from this last weekend. I got to visit with him in person. He's just a joyous, delightful person to be around because he's filled with. With, well, laughter, right? And it's not just. It's not vicious laughter at other people, it's laughter at himself. It's laughter at the idea that, you know, it's possible to have fun as well as recognize the importance of our traditions."}
{"episode_id":"SW - #009 - 2018-07-24 - Milo, Jordan Peterson and The Symbolic Worldview. Discussing with Rachel Fulton Brown","start":984.87,"end":1041.42,"speaker":"Jonathan Pageau","text":"And so, I mean, I think the big question that I've seen people around me, let's say ask, is what? Because he obviously says he's Catholic, and sometimes. Sometimes it feels like he's saying he has all these different identities. And so depending on the situation, he can point to one identity and then kind of like a snake. Like, he can slither out of a difficult situation. So he can say, I'm Jewish and then kind of, you know, get out and then say, I'm gay. And then get out, but then also be like a white man and then get out, and then. But then he also has this one, which is, like, Catholic. So sometimes he can. He can. But I'm being cynical when I say that. But my question is, what extent do you think that his Christianity, let's say, or his Catholicism is part of his identity or is not part of his identity is part of what he's trying to do, let's say."}
{"episode_id":"SW - #009 - 2018-07-24 - Milo, Jordan Peterson and The Symbolic Worldview. Discussing with Rachel Fulton Brown","start":1041.9,"end":1280.6,"speaker":"Rachel Fulton Brown","text":"I think it's everything. I think that the one thing that if you watch him, and obviously I've watched him pretty carefully, if you watch him, the one thing that is actually absolutely, utterly consistent about his costume is his cross. He always wears it. And he has several crosses that he wears the necklaces. But in every photograph that he's ever taken, except for when he's wearing a suit and tie, but I think the crosses are underneath. He's always wearing a cross. That's invariable. He used the thing about being Jewish most strongly over the summer and into the autumn, when Steve Bannon, his former boss at Breitbart, was persistently being called an anti Semite. And Milo was trying to help Steve in that context, saying, well, look, he hired me, and if you're going with Nazi levels of what counts as Jewish, I'm Jewish, because his mother is of Jewish descent. That he's gay and yet recognizes or feels that it's complicated is, of course, not something that the strong left LGBTQ activists will admit. Because Milo says, well, you know, on the one hand, it seems that being gay is something that I am, and on the other, it does seem to be something that, you know, now that we know how he grew up was, as it were, encouraged into by other people. So, you know, he's saying in that, you know, he thinks being gay is itself a kind of liminal status, whether it's nature or nurture, whether it's. It's born this way or something that you can actually change. And he has said quite poignantly a number of times how he wishes that he weren't gay, because that being gay means. And he does actually, you know, he has, as he said in one of his interviews recently, have love in his life. He does have very deep friendships with some of the men that he's been with, but that means he's not going to have children. And he is also very fond of children and the idea of having, as he says, little Milos. So I think the ambiguity is his acknowledgement of what it means to be human and what it means in fact, to be truly Catholic, that you're. I mean, when people push him on it in his Q and A, he says, well, why are you Catholic? How can you be Catholic? And he said, well, what else would I be? I'm a sinner. Right? And it's very interesting how hard it is for people to hear someone just simply say, I know I do things in my life that are sinful, and I, you know, I celebrate them or I behave in these riotous ways. But I also recognize that they've been damaging to me in my personal life. So, you know, he's. I keep getting in trouble for making, you know, comparisons of him to Jesus, but in the sense of the sort of one who is dangerous because he comes into the middle of the culture and challenges its authorities, I think there's very interesting resonances, but that he's willing to take on the insults that everybody throws at him for actually pointing out the ambiguity of all of our situation. I think he's setting himself up and as an example of saying, well, you think you're so pure on the conservative side, he's a number of times said, you know, if this were 20 years ago, I'd be arguing against the conservative right. And he's showing how the conservative left, whatever it is, the rigid left, both sides, as I see, they meet, you know, they've met at the back, and they're just standing with each other's at the back, each insisting on their own purity. And Milo is showing you. No, I mean, that purity is a fantasy and also sinful because it's making this claim that you can somehow be purer than God."}
{"episode_id":"SW - #009 - 2018-07-24 - Milo, Jordan Peterson and The Symbolic Worldview. Discussing with Rachel Fulton Brown","start":1280.84,"end":1343.01,"speaker":"Jonathan Pageau","text":"Yeah, well, there is a. There's such a large strain of, like, puritanical Christianity in the US it's very strong. So there's a vision of Christianity which is, you know, the. I mean, just the fact that there was prohibition in the United States kind of shows you what type of vision of Christianity is. Is underlying the culture. And so I can understand how that would definitely, for him saying, I have this in my life that I'm struggling with. I know that it's a problem. It's there, you know, deal with it. You know, it's like, I'm still. I still believe, and I'm still Catholic. I still believe in these things. I've got this thing. I've got these things around me. It's like. So I can. I mean, I can understand how that would be extremely problematic for both. Both sides, because the debate about. The debate about homosexuality, especially in the church, has Been like, do we reject them or do we accept them? It's like, that's not the answer. That's not how it works. You know, it's."}
{"episode_id":"SW - #009 - 2018-07-24 - Milo, Jordan Peterson and The Symbolic Worldview. Discussing with Rachel Fulton Brown","start":1343.09,"end":1343.57,"speaker":"Rachel Fulton Brown","text":"It's."}
{"episode_id":"SW - #009 - 2018-07-24 - Milo, Jordan Peterson and The Symbolic Worldview. Discussing with Rachel Fulton Brown","start":1343.81,"end":1380,"speaker":"Jonathan Pageau","text":"Anyway, so like you said, it's complicated, and I think that that's. That's interesting. Yeah, I think I agree with you that that seems to be what he's doing, at least. So. Yeah. So, yeah. So thanks for. Thanks for that. I mean, it's helping me because obviously I've been paying attention to him. And then since the fallout and everything, I would get, like, a lot of people, I kind of pulled away. And then when I saw that you were still writing about him and that you were still talking about him, like, okay, maybe I need to pay attention again. I haven't read his book, but I guess I still need to keep my eyes open on what he is and what he might."}
{"episode_id":"SW - #009 - 2018-07-24 - Milo, Jordan Peterson and The Symbolic Worldview. Discussing with Rachel Fulton Brown","start":1380.73,"end":1381.41,"speaker":"Rachel Fulton Brown","text":"What he's. He's."}
{"episode_id":"SW - #009 - 2018-07-24 - Milo, Jordan Peterson and The Symbolic Worldview. Discussing with Rachel Fulton Brown","start":1381.41,"end":1382.41,"speaker":"Jonathan Pageau","text":"He's possibly doing."}
{"episode_id":"SW - #009 - 2018-07-24 - Milo, Jordan Peterson and The Symbolic Worldview. Discussing with Rachel Fulton Brown","start":1383.29,"end":1509.56,"speaker":"Rachel Fulton Brown","text":"Well, I'm happy to hear that. It was my blog that kept. Kept. Because I had. So if you all look back at the week in February when I was writing about him, it was. It was quite a week for me, right, because he had. Well, I had become infamous among my academic colleagues because an article had come out in the divinity school newsletter Sightings on Thursday of the week, that was two weeks after the Berkeley riot. And the editor at Sightings had asked me to write a piece on what I thought was Milo's significance for American academic culture. And I'd said, well, you know, he shows us the importance of thinking about religion. And that made them all upset. So from the Thursday through that weekend, my colleagues had spent that time on a listserv that I was actually party to, which they should have realized, talking about all the terrible things that I had said. I did a blog post on that. And so I'd spent, you know, the weekend sort of ramping myself up to be, you know, kind of public when my support for Milo. And that Monday was when the video dropped with the clips of his. His. His. His sexual upbringing. And so then it was. I was suddenly there, public, on Milo's side, and there was absolutely no way I was going to betray him. He had just been betrayed by absolutely everybody, including people in the conservative media who had been very supportive of him and had had him on their shows and had talked to them. And then suddenly it was like, that week everybody dropped him. And I spent that week that. The posts started out pretty. Pretty emotionally heavy, including the one where I put posts simply, posted a quotation from my first book on when Mary is feeling the stuff, wishing to suffer with Jesus, the suffering that he. And one of. One of my readers. No, it's good. It was called Mother and Son, the post. And one of my readers wrote to me in an email saying, was that from ILO where you said that? And I'm like, yeah. And she said, thank you."}
{"episode_id":"SW - #009 - 2018-07-24 - Milo, Jordan Peterson and The Symbolic Worldview. Discussing with Rachel Fulton Brown","start":1510.29,"end":1510.85,"speaker":"Jonathan Pageau","text":"Okay, well."}
{"episode_id":"SW - #009 - 2018-07-24 - Milo, Jordan Peterson and The Symbolic Worldview. Discussing with Rachel Fulton Brown","start":1510.93,"end":1663.1,"speaker":"Rachel Fulton Brown","text":"And no, it. Because then she proceeded to tell me about her own son and the struggles that he had had. And I'm like, this is. This is a moment. This is the moment I must stay firm. So if you want to know where my Marian stuff comes from, I've learned a lot about what it means to be a church during that week. Right. Because I suddenly had people. Floods of letters coming to me saying, thank you so much for standing up for him. I'm so. I've admired so much what he's done. I've been encouraged by it. I'm feeling so sorry for him. All these grant. Catholic grandmothers. I had a whole posse of Catholic grandmothers writing to me saying, that poor boy, and he's so lucky to have you. And in the middle of that week, I wrote the famous post where I called the conservatives that had bitched him a bad name, which was one that he had called them in one of his talks and that got shared by Rod Dreher on American Conservative. And that got media's attention. Over the course of the week, I explained a few more things, including what I meant by saying he's a holy fool and how I think he's modeling not only Jesus, but Francis and the kinds of jokes that he plays and things like that to point up the absurdity of the. Of the culture. So I thought, you know, that was the. That was. That was my role. That was my. The thing I had to do this year was be there for him when it all went. And all went terrible. And it encourages me greatly to hear that it helped you and I hope it helped others just sort of step back from like, wow, what just happened here? Someone who actually is an abuse victim was suddenly the bad guy. Yeah. And that was very. I was. It was, I mean, fascinating and horrible at the same time to realize that someone who refused to turn what had happened to him, real abuse into, you know, his identity. Right. He apologized for it on the Wednesday, said, I'm sorry. I appreciate the things I said out of context and certainly out of his context and out of. Out of the context of everything else he was doing could be taken to mean something. I didn't mean, I'm sorry. Now we're back to work, right? He's never going to turn himself into a victim either of the media or of his own childhood because he thinks that that's not the way he's very. Doing what Jordan says. Right. Sort yourself out, recognize what you can do to make things better. Tell the truth and, you know, get on with things. Don't spend all your time, you know, making yourself out to be the victim."}
{"episode_id":"SW - #009 - 2018-07-24 - Milo, Jordan Peterson and The Symbolic Worldview. Discussing with Rachel Fulton Brown","start":1663.18,"end":1907.44,"speaker":"Jonathan Pageau","text":"Well, one of the things, I mean, one of the things about what you said, the fact that people only see it in one, in one way, see him, who was a victim of abuse, as still as an oppressor. I mean, it has to do. There's two things. One is the cognitive dissonance, which comes from extremes. And the other has to do with himself. Because the thing about chaos and about someone who stands in a space in between other things is that I talked about this in my video with Jordan is that they act as a mirror. And so when you look at them, all you can see are the things that align with whatever you want that person to be. And you can't see that. Let's say, for example, Milo, that he's on all sides and no side at the same time. So you, you look at, people will look at them and what they say that he is, it ends up often being a mirror of themselves. Like it ends up being what they want him to be. And so if he's the white oppressor, that's what they'll see. And they'll never see that he's, they won't even realize like gay is not part of it anymore. Not part of it anymore. He's only that thing he said something, whatever he said about his sexual adventures, they'll only interpret it in whatever frame that they already have for him because he's breaking out of all the frames. So you have to frame him. You have to be able to put him in a category. And so I think that, that, I mean, there's been a lot of that happening and it's been fascinating to watch the same with Trump. Trump is the same thing. Trump is not. It's so funny because Trump is not really a right wing person at all. I mean, and, but, but he is. People are so crazy that they look at him, he's too, he's too all over the place and he's actually not something. And so they, they, they want, they just push. You know, they make, like the fact that they would make him into an anti Semite is the most Insane thing ever. I mean, his daughter converted. I mean, it's crazy, but it doesn't matter. It's like, you know, he doesn't fit what a president should be. We don't know how to deal with that. So let's. We need. We need to make him something like, let's make him whatever we think. And it has to do with also the pathology of extremes, which is. Which is this cognitive dissonance, the capacity to only see what's negative in your opponent and only see what's positive in yourself, even though, you know, and never, never be able to see whatever you're doing that's exactly the same as your opponent. And I mean, we saw that in the debates with Jordan Peterson. It was really fascinating. I mean, the one they did at the university, you had two people against Jordan. One person saying, you're exaggerating. You know, you're blowing this out of proportion. It's not a big deal, you know, and then the other person saying, you're the devil, you're Hitler, you're the worst. You're the worst thing that ever happened, and you're being abusive and horrible. And they could maintain those two discourses at the same time and not realize that it's an absolute cognitive dissonance. And the people that are watching it, that are on that are, you know, extreme left will. Will just eat it up. And they'll say. And they can. They can accept both extremes, both, like, both that contradiction. They can just accept it because of their. Their extreme position. So it's a. It's a frightening time to be in. Like, I can. I never, like, I could never understand revolutions because we lived in a democracy. And, you know, I would. I would read about the French Revolution. I would read about. About what happened in Russia, and I'm like, how can people. How could people, normal people, end up the way that you would go out in the street and guillotine women and, like, how is that possible? And now I'm starting to understand how that works. And I'm starting to see how you can become so pathological that you're incapable of seeing that you're doing the same thing that you're criticizing your opponent of doing. So it's. It's a bit. Yeah, it's a bit of a frightening moment right now."}
{"episode_id":"SW - #009 - 2018-07-24 - Milo, Jordan Peterson and The Symbolic Worldview. Discussing with Rachel Fulton Brown","start":1908.24,"end":2040.09,"speaker":"Rachel Fulton Brown","text":"It's very frightening. And you could say, I mean, going back to the mirror, people could certainly argue that I'm seen in Milo myself, which, like, that's lovely. If I see someone who's so lovely that I'm Seeing him in Christian terms. Because I'm Christian and I want to see him in Christian terms. Yeah. But I'd say, you know, the huge test and this. This has always been for me, what was so different about Milo and was. Was really important. I talked about how I responded to the original attacks on my Three Cheers for white men posts, that the thing that I knew I needed to be was the happy warrior. Right. That at any moment, if I turned into someone who was throwing the same kind of insults that were being thrown at me, I lose. Right. And I actually did. I've done several posts in my blog, not just about Milo, about the issues, but also the how to's. Right? How to be a happy warrior, how to answer the offense, how to stay calm when all of these kinds of attacks are coming at you. And that's why I, you know, it's like of all the things I love about Milo, it's his. It's his example that no matter what kind of insult you gets thrown at you, you transform it and turn it and give it back with love. In fact. And the first post I did on him in these terms was called Kung Fu Milo because I was playing off the image of the Kung Fu Panda in the Kung Fu Panda movies. This fits with what Jordan does with all of the superhero movies, right? This is the panda. So in the Kung Fu Panda movie, the idea is the muskox, the evil muskox, is going around collecting up all the chi of the animal warriors. And he's sort of colored all green with envy, right? Because he's envious of the energy and power they have. And he's capturing their golden energy and turning them into little jade ornaments that he can wear on his belt. And so Po, the Kung Fu Panda, has to figure out how to fight him. And I detail exactly. If you haven't seen the movie, all the. The ways that he finds his own people, the panda people, and he realizes they're not really warriors, and so they have to become the kinds of warriors that they can be."}
{"episode_id":"SW - #009 - 2018-07-24 - Milo, Jordan Peterson and The Symbolic Worldview. Discussing with Rachel Fulton Brown","start":2040.57,"end":2042.37,"speaker":"Jonathan Pageau","text":"Which movie is this? This isn't the first one."}
{"episode_id":"SW - #009 - 2018-07-24 - Milo, Jordan Peterson and The Symbolic Worldview. Discussing with Rachel Fulton Brown","start":2042.37,"end":2043.29,"speaker":"Rachel Fulton Brown","text":"This is the third one."}
{"episode_id":"SW - #009 - 2018-07-24 - Milo, Jordan Peterson and The Symbolic Worldview. Discussing with Rachel Fulton Brown","start":2043.29,"end":2046.25,"speaker":"Jonathan Pageau","text":"Okay. Yeah, I didn't make it to the third one. I saw the first one."}
{"episode_id":"SW - #009 - 2018-07-24 - Milo, Jordan Peterson and The Symbolic Worldview. Discussing with Rachel Fulton Brown","start":2046.65,"end":2111.86,"speaker":"Rachel Fulton Brown","text":"There's the sort of climax moment, spoiler alert. Is when Poe ends up having to take himself into the spirit realm to fight the great. The great muskox. And what the muskox has been trying to do all along is like, steal the other animal warriors life. And Po has this moment where he's supposed to be the dragon Warrior, which is a lovely Petersonian image too, Right. When he realizes that to be the Dragon Warrior, it's not that he tries to hold on to his chi and protect himself, but that he has this wonderful moment when he says, do you want my chi? Okay, take it. And he's the Dragon Warrior at that point. He sends out this great beam of golden energy into the muskox, which explodes. The muskox. Right. And that's what I said Milo does. Right. He takes all of the insults that everybody throws at him. You've seen it in the posters that he's putting up for his book right now. Most Hated man on the Internet. He's like, great, I'll use that as my banner. Yup."}
{"episode_id":"SW - #009 - 2018-07-24 - Milo, Jordan Peterson and The Symbolic Worldview. Discussing with Rachel Fulton Brown","start":2111.86,"end":2112.14,"speaker":"Jonathan Pageau","text":"Boo."}
{"episode_id":"SW - #009 - 2018-07-24 - Milo, Jordan Peterson and The Symbolic Worldview. Discussing with Rachel Fulton Brown","start":2112.14,"end":2113.38,"speaker":"Rachel Fulton Brown","text":"Gross. Sarah Silverman."}
{"episode_id":"SW - #009 - 2018-07-24 - Milo, Jordan Peterson and The Symbolic Worldview. Discussing with Rachel Fulton Brown","start":2113.38,"end":2113.7,"speaker":"Jonathan Pageau","text":"Cool."}
{"episode_id":"SW - #009 - 2018-07-24 - Milo, Jordan Peterson and The Symbolic Worldview. Discussing with Rachel Fulton Brown","start":2113.7,"end":2122.24,"speaker":"Rachel Fulton Brown","text":"I'll cite that, right? That anything that people throw at him, he does what Christians are supposed to do. He turns the other cheek. And I."}
{"episode_id":"SW - #009 - 2018-07-24 - Milo, Jordan Peterson and The Symbolic Worldview. Discussing with Rachel Fulton Brown","start":2122.24,"end":2139.12,"speaker":"Jonathan Pageau","text":"He does more. He does even more than that. He's actually. He's actually very. It's very. It's. It's. You know that when you say Kung Fu Panda, I was thinking about the first movie. And in the first movie, he. It's. It's very similar structure where he, you know, during his training, he's unable to master himself."}
{"episode_id":"SW - #009 - 2018-07-24 - Milo, Jordan Peterson and The Symbolic Worldview. Discussing with Rachel Fulton Brown","start":2139.36,"end":2139.76,"speaker":"Rachel Fulton Brown","text":"Right."}
{"episode_id":"SW - #009 - 2018-07-24 - Milo, Jordan Peterson and The Symbolic Worldview. Discussing with Rachel Fulton Brown","start":2139.76,"end":2157.42,"speaker":"Jonathan Pageau","text":"By the end, he realizes that. No, it's. It's his very unwieldiness that was going to be kind of higher than, let's say, the masterfulness. And so he, like, lets himself go to his, you know, to the fact that he's huge, that he eats and all this stuff. And you can kind of see it as he's fighting at the end. It's like he had."}
{"episode_id":"SW - #009 - 2018-07-24 - Milo, Jordan Peterson and The Symbolic Worldview. Discussing with Rachel Fulton Brown","start":2157.42,"end":2157.82,"speaker":"Rachel Fulton Brown","text":"He."}
{"episode_id":"SW - #009 - 2018-07-24 - Milo, Jordan Peterson and The Symbolic Worldview. Discussing with Rachel Fulton Brown","start":2157.9,"end":2341.05,"speaker":"Jonathan Pageau","text":"He's basically using his weaknesses as an. Inverting them, like, using them against his enemy in a really direct way. So, I mean, that's definitely. That's. That's. That's definitely been what Milo has been doing. It seems like. That's. That's what. That's. That's. I'm trying to understand this thing. Like, that's why when we. When I tried to understand Pepe the Frog and all that, I'm trying to understand these. This character that is. That. That is an inverted character, but then restores order. And that's been like, my focus on. For a while now. I've been focusing. I've been writing about St. Christopher and about those types of liminal characters, and I ended up. This is maybe why I think I need to keep paying attention to Milo somehow. It has to do with King David. I mentioned this to you in a private discussion, but I'm just going to lay it out now, is that we have this image of King David as a king, and often we ignore his actual story because his story is very disturbing. King David, during his whole life until he becomes king, he's an inverted character. And so he becomes a refugee and he becomes a criminal, and he lives in a cave, and King Saul is hunting him down. And he actually had some. He does everything. Like he acts once, he acts insane, and then he associates with the enemies of Israel. And even in Israel, people think that he's fighting for his enemies, basically. And so. But we know that. We know because we know the whole story. Let's say, you know, we've read it before. We know that he's secretly still working for Israel. So it's like he's acting completely inverted. But he's the secret king. Like, he's. He's secretly trying to build the temple. That's the best way to say it. Like, he's. What he wants to do is establish the ark, build the temple. But to do it, he goes through this whole strange inverted process. And that's why. Also why he can beat the giant. Because he has in himself something similar to that giant. Like he has a liminal quality that makes him able to stand on the line and be able to fight the opponent. And so I've been really, really thinking about that. And so it's interesting because, like, Milo says he's Catholic, says he's Christian, but then his behavior is so outrageous. I mean, the behavior and the things that he puts forth. Like, I saw, you know what I saw recently when he did this thing with like, these. These women in hijabs that strip and stuff. It's like, oh, my goodness, like, what are you doing? And so this, this, like, really? Yeah, like, he really pushes the limit. And he. And he. And he just inverse everything. And so I know it's so. So the idea is, is he secretly is like. I mean, I think that you're telling me he is, but I still need. I think for me, it's still like the. How can I say?"}
{"episode_id":"SW - #009 - 2018-07-24 - Milo, Jordan Peterson and The Symbolic Worldview. Discussing with Rachel Fulton Brown","start":2341.05,"end":2451.07,"speaker":"Rachel Fulton Brown","text":"I don't think it's that secret. I think it's obvious if you see. But, you know, we were talking about. You're talking about the frames that we see through, right? That you and I both see through. Frames that a lot of people don't have. Right. That both you and I are fascinated by the way in which, again, as we've talked about, Jordan and Milo are playing out these Very symbolic roles. And to me, it's like, it's so obvious. I love your David comparison with Milo because I think that fits perfectly, right? David humiliates himself dancing before the ark and makes his wife upset with him because he's willing to expose himself in front of the handmaidens in this ridiculous way. And it's like niqabi strippers. Okay? I mean, that is obviously Milo saying, look, you know, Western women can do this, right? The women in the Islamic countries that are forced to wear those niqabs cannot. And so that's a celebration of the west and our willingness to, you know, allow female beauty to be something. My argument's about chivalry, right? That the only reason that I can walk down the street alone in Chicago with, you know, a fair degree of confidence that nothing's gonna happen to me is because most of the men around me are going to respect that. And, you know, I think that that's. That's an aspect of our culture that is amazingly easy to take for granted because it's like air until it's not there anymore, and then you. And then you're gonna suffocate. So I see they were just dancing. They, you know, they took. They took the bottom parts of their niqabs off and kept the veils on, which was cool. Kind of funny. You know, I. To me, it's. There's no question at all that Milo is Christian, but it's interesting to me that it's. It's. It's still difficult for you to be confident, I think."}
{"episode_id":"SW - #009 - 2018-07-24 - Milo, Jordan Peterson and The Symbolic Worldview. Discussing with Rachel Fulton Brown","start":2451.07,"end":2452.23,"speaker":"Jonathan Pageau","text":"No, no, no, no, no, no, no."}
{"episode_id":"SW - #009 - 2018-07-24 - Milo, Jordan Peterson and The Symbolic Worldview. Discussing with Rachel Fulton Brown","start":2452.23,"end":2452.59,"speaker":"Jonathan Pageau","text":"I think."}
{"episode_id":"SW - #009 - 2018-07-24 - Milo, Jordan Peterson and The Symbolic Worldview. Discussing with Rachel Fulton Brown","start":2452.59,"end":2467.16,"speaker":"Jonathan Pageau","text":"I think, like. I mean, like, if. Like, if he is. Well, that's the. It's. Okay. So this is gonna be a bit extreme. I'm gonna say something that's a bit extreme, but it's like, either. So either he's a King David type figure or he's a Nero. Right?"}
{"episode_id":"SW - #009 - 2018-07-24 - Milo, Jordan Peterson and The Symbolic Worldview. Discussing with Rachel Fulton Brown","start":2467.96,"end":2470.2,"speaker":"Rachel Fulton Brown","text":"Well, that was his Twitter handle before they kicked him off."}
{"episode_id":"SW - #009 - 2018-07-24 - Milo, Jordan Peterson and The Symbolic Worldview. Discussing with Rachel Fulton Brown","start":2470.44,"end":2516.75,"speaker":"Jonathan Pageau","text":"That's why I say that. And so either he is. So. I don't know. I. For me, I don't. It doesn't. I don't. I don't have to judge anyways. Like, I. Who am I to judge? It doesn't matter. But I'm just saying that those. That's the question I'm asking. Like, which way is his ambiguity going to. Going to. Going to play? And. Because there's Is. There's a. You know. You know, that. You know, there's a very strange tradition about Nero, by the way. There's a very strange tradition from. In early Christianity, which is that Nero is going to come back and come back as this, like, vengeful angel that will, like, restore this weird kind of justice. And so. And then some people think that, like, the. Like in the. In the. In the. In Revelations, when it talks about the beast that dies, but then kind of comes back that that's Nero, actually."}
{"episode_id":"SW - #009 - 2018-07-24 - Milo, Jordan Peterson and The Symbolic Worldview. Discussing with Rachel Fulton Brown","start":2517.07,"end":2517.47,"speaker":"Rachel Fulton Brown","text":"Right."}
{"episode_id":"SW - #009 - 2018-07-24 - Milo, Jordan Peterson and The Symbolic Worldview. Discussing with Rachel Fulton Brown","start":2517.55,"end":2521.43,"speaker":"Jonathan Pageau","text":"And then, you know, the early. Like, the early Christians interpreted Nero's name."}
{"episode_id":"SW - #009 - 2018-07-24 - Milo, Jordan Peterson and The Symbolic Worldview. Discussing with Rachel Fulton Brown","start":2521.67,"end":2674.93,"speaker":"Rachel Fulton Brown","text":"I'll tell you this. When I changed my Facebook profile to have the picture of Milo and me that we took on Sunday together, I had. I suddenly had 666 followers. So, you know, you could be right. No, I don't think so. Because one of. So one of the things that Milo is often accused of doing is outing people for either being gay or being anything. Right. He's just that they're all. There's. There's a persistent claim. I mean, including the claim that got caught up with the Twitter thing that he himself is starting whatever bad things happen to people or the doxing or things like that. And. And of course, he hasn't. It's. It's. It's incredibly difficult to convince people of this if they're. They're seeing him through the frame where he's. He's. He's Nero. But one of the things that's impressed me throughout the. The year that I've been in correspondence with him is how incredibly careful he is at who he names, under what circumstances. You can see it, quite frankly, in the way that he deals with his own staff. Right. How many people actually know who is working for him? Well, only if they're actually already public, like Pizza party, Ben will, you know their names. And otherwise, he's very protective of his own staff, and he's. He's been protective of me all year. It's been interesting what he will and won't share on his Facebook feed that I give him. And I'm like, oh, come on. And he says, well, no, that's not necessarily good for you. That he has. He was trained as a journalist, and he knows the kinds of things that are actually already public and the kinds of things that you simply don't say. Right. And what I find interesting is how, you know, CNN can. Well, they're getting in trouble for that, but, you know, threatened to dox someone, and Milo would never do that. Right. He's gonna make fun of CNN as much as he can. But it's interesting what people count as what belongs already in the public sphere. Lena Dunham and Amy Schumer are out there publicly saying what they're saying. So he's gonna talk about that and that I followed him in my writing about. The people have been responding to me that if someone publishes something out there, I'll talk about it. Right. But I've had things that have happened to me, as it were, behind the scenes that I won't write about because they're behind the scenes and they're not on the public record. And Milo's always very careful about knowing what things are on the public record and what aren't."}
{"episode_id":"SW - #009 - 2018-07-24 - Milo, Jordan Peterson and The Symbolic Worldview. Discussing with Rachel Fulton Brown","start":2675.65,"end":2748.47,"speaker":"Jonathan Pageau","text":"So all I can say is that I'm very happy that he has, like, a medievalist on his team. I think that that's great. I think it's a good. It's a good sign, for sure. So this is like. So what's fascinating for me is our kind of strange position, both of us, because, you know, I met Jordan Peterson through things that were completely unrelated to his, you know, to his. To what happened to him. That has to do with free speech and all that and dealing with this question of the marginal and the in between spaces. You know, the whole question is. Also has to do with these undefined spaces that happen in this chaotic time that we're in. And so at some point I realized, wait a minute. Like, we're both these kind of medieval type Christians, let's say, or at least we see the world much more through a kind of medieval ontology, I would say. So I just find it interesting that we're both kind of there with these two. These two characters. Because. Yeah, like. Because, I mean, for example, I was curious to know, because we've never heard him speak about it. Does Milo know about Jordan Peterson? Like, has he ever heard of him? Has he ever seen some of his videos?"}
{"episode_id":"SW - #009 - 2018-07-24 - Milo, Jordan Peterson and The Symbolic Worldview. Discussing with Rachel Fulton Brown","start":2748.47,"end":2764.1,"speaker":"Rachel Fulton Brown","text":"Oh, yeah, well. Well, I was talking to him a little bit on Sunday about, yes, he knows. He knows who he is. And I mean, my Facebook friends are all saying, no, you know, we've got to get the two of them to talk. I think they've talked maybe a little bit, but not substantively yet."}
{"episode_id":"SW - #009 - 2018-07-24 - Milo, Jordan Peterson and The Symbolic Worldview. Discussing with Rachel Fulton Brown","start":2764.42,"end":2764.98,"speaker":"Jonathan Pageau","text":"Okay."}
{"episode_id":"SW - #009 - 2018-07-24 - Milo, Jordan Peterson and The Symbolic Worldview. Discussing with Rachel Fulton Brown","start":2764.98,"end":2765.46,"speaker":"Rachel Fulton Brown","text":"All right."}
{"episode_id":"SW - #009 - 2018-07-24 - Milo, Jordan Peterson and The Symbolic Worldview. Discussing with Rachel Fulton Brown","start":2765.86,"end":2816.2,"speaker":"Jonathan Pageau","text":"And so then. So then maybe I could ask you that. So we met through your kind of interest with Jordan Peterson. You did his program. And so maybe you can tell us a bit about how you see that, like how you frame. Because I've seen that you've been more intense pretty intensely now into Jordan's material. And so, I mean, I know, because I'm coming from a. More. I see in Jordan a Lot. A strange resurgence of, let's say, a traditional hierarchical ontology, let's say, something that you would find in Dante, let's say, but presented. Presented through a Darwinian frame. So it's. I mean, for me, it's very fascinating to kind of be part of this and be. And so maybe I'd like to get your take on, you know, what. What has drawn you to Jordan and how you. How you see that in relation to what you're interested in terms of medieval history and everything."}
{"episode_id":"SW - #009 - 2018-07-24 - Milo, Jordan Peterson and The Symbolic Worldview. Discussing with Rachel Fulton Brown","start":2816.52,"end":2924.8,"speaker":"Rachel Fulton Brown","text":"Okay. I was interested what you were saying about we as you and I as medievalists, watching these people. And I'd like you to come back to that, but I'll answer this question first. So I was aware. It's like, it's funny how you're sort of mildly aware of these things in the middle of other things. I listened to Jordan's first. The first video about Bill C. 16 while I was decorating my Christmas tree, which I'm sure was symbolic in some ways, but I didn't really. That. That was not an issue I was immediately interested in. I was sort of aware of him as, oh, yes, another professor who has been going through, you know, the adventures this year. I really became fully aware of him when some of my friends posted the comment that he made at the Manning center speech. When first he was asked, you know, he was talking so beautifully about, you know, how important it is to speak and how as professors, oh, my goodness, you've got to be. Be speaking because who is going to otherwise? And that was obviously something I'd been doing all winter with the support of my own dean and president. So I was like, wow, okay, I like this. And then in that same Q and A, someone asked him about Milo, and he came out with this thing about Milo's a trickster. And I'm like, oh, my goodness. That's what I've been saying. I'd been saying, holy fool. But, you know, trickster, jokester. Exactly right. That. That clearly we. Jordan and I were seeing things from a very similar perspective. So I started watching his courses. I read his book the Maps of Meaning. I. In. In the course of all this whole year, not only did I finish my book, lose lots of weights because Milo's fat shaming helps, but I also converted to Catholicism. And why."}
{"episode_id":"SW - #009 - 2018-07-24 - Milo, Jordan Peterson and The Symbolic Worldview. Discussing with Rachel Fulton Brown","start":2924.8,"end":2929.69,"speaker":"Jonathan Pageau","text":"So this is this year that you converted to Catholicism? Oh, my goodness. Wow, That's a big year for you."}
{"episode_id":"SW - #009 - 2018-07-24 - Milo, Jordan Peterson and The Symbolic Worldview. Discussing with Rachel Fulton Brown","start":2929.69,"end":3181.93,"speaker":"Rachel Fulton Brown","text":"I guess it's been a huge year. Nothing's the same, you know, this time last year, I was like, oh, my Goodness, if I'd known what was coming. It's been the most exciting year of my life or one of the most exciting years of my life. Had a few others similar, but this is this pretty much of the number of things that have changed in less than 12 months. It's intense. So I spent the winter going through the Rite of Christian Initiation for Adults and was received into the church at Easter. And Jordan had been talking in his lectures about the self authoring program. I said, well, I very much believe in writing yourself into understanding, because that's basically what my blog had been. Fencing Bear actually started out as my prayer to be able to talk through some of the things that I was learning through my fencing, which I think is also one of my sympathies with Milo, right. I to do something, to really learn it, right. It's physical and bodily. But my knowing that writing things out through the blog had been so helpful, I was. I was really drawn to Jordan's program of writing yourself into solutions. So after Easter, I did the novena of the present authoring faults, right? And then after Pentecost, I did the. The present authoring virtues. And I'm really impressed with the program as a structure of writing one because it's so contained, right. You can only write a certain amount before the text box shuts you out. And that helped me. I had to be really like crisp and. Yes, crisp and concise. And also that the structure of the exercises that you tell a story, then you think about what you would have done different to make it better. And then you think about it in a general terms. And Jordan obviously talks about that as this is you solving. Finding the answer in yourself, right? Finding the answer through your own. Your own thinking about it. One of the things I found most curious about all of it was one, it was easier for me to do the vices than the virtues. I'm clearly more comfortable telling myself how bad I am than I am giving myself credit for having virtues in the first place. I also sometimes found it hard to tell a story and I did a blog post on that about this experience of, you know, how much the few times I was really able to tell a story, it was like blew my mind, right? It's it Jordan's right that all of these emotions and problems are just tangled up in the stories that we haven't been able to tell. And I started. I think I started the he's he. Jordan has shared some of these in his Twitter. That one of the most powerful ones that I did was admitting my Own adultery. So. So if you want to know, from back when I was in graduate school and still with my second husband, but it was an adventurous some time. So you want to know why I'm so sympathetic to Milo? It's like, maybe I've been there. I know what it means to sin. And when I sent that one to Jordan, I'm like, I beg you to tweet this for me. I need everyone to know, tell the truth, right? And it was sort of interesting thing because it wasn't really, when it happened, back when we were younger, it wasn't like everybody. Nobody knew because it was in the town and everybody knew the town. But then we moved for when I took my job here in Chicago, and then nobody knew except for a few colleagues. And it's. It's very easy to let that kind of thing just go away, right? It's like. And you end up. You realize you end up pretending to be more virtuous than you actually know you were. Or maybe you. You know, I spent too much time not letting myself forgive myself for having made a mistake, and I can do better now. Right. And so all of that was just exactly as. As mind blowing as Jordan promises. It is that. That if you finally start telling the truth, it's. It's amazing the things that will open up to you that are, you know, that you've been shutting out because you haven't been able to even admit to yourself that this is something that you need to be able to express."}
{"episode_id":"SW - #009 - 2018-07-24 - Milo, Jordan Peterson and The Symbolic Worldview. Discussing with Rachel Fulton Brown","start":3182.41,"end":3182.89,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #009 - 2018-07-24 - Milo, Jordan Peterson and The Symbolic Worldview. Discussing with Rachel Fulton Brown","start":3183.29,"end":3183.77,"speaker":"Rachel Fulton Brown","text":"Yeah."}
{"episode_id":"SW - #009 - 2018-07-24 - Milo, Jordan Peterson and The Symbolic Worldview. Discussing with Rachel Fulton Brown","start":3185.05,"end":3189.37,"speaker":"Jonathan Pageau","text":"So what is the question you had about medievalists that you said you wanted to get back to that."}
{"episode_id":"SW - #009 - 2018-07-24 - Milo, Jordan Peterson and The Symbolic Worldview. Discussing with Rachel Fulton Brown","start":3189.77,"end":3271.61,"speaker":"Rachel Fulton Brown","text":"So, you know, I think, to me, this is just so amusing, right? Because as the medievalist, you know, in academia, particularly as a historian, I'm in a department that's. That's largely modern. Modern historians that work on the period, from about the French Revolution to the present or about the American Revolution to the present, most of them work on 19th and 20th century or now 21st century history. And for 20 years, I've been the one sitting on the side going, we knew that. Or, you know, arguing the periodization problems. Like, modernity always used the Middle Ages as its foil, right? The Middle Ages are always wet. The modernity didn't. Thought it wasn't. And, you know, the postmodern is interesting. And this is where I'd like to talk to Jordan more intensively about this. A lot of postmodernism comes out of the fact that those French philosophers whom he rightly deplores were trained as medievalists. And particularly that training in polysemy that he talks about. They're saying, you know, they see many layers of meaning and text and multiple interpretations. Well, that is. That's medieval exegetical practice. Right. That's the way medieval commentators read the Scriptures. But of course, what the postmodernists do is unmoor it completely from."}
{"episode_id":"SW - #009 - 2018-07-24 - Milo, Jordan Peterson and The Symbolic Worldview. Discussing with Rachel Fulton Brown","start":3271.77,"end":3274.09,"speaker":"Jonathan Pageau","text":"Flatten it, especially there. They flatten it."}
{"episode_id":"SW - #009 - 2018-07-24 - Milo, Jordan Peterson and The Symbolic Worldview. Discussing with Rachel Fulton Brown","start":3274.49,"end":3282.69,"speaker":"Rachel Fulton Brown","text":"Right. But Roland Barthes, Jordan doesn't mention him, but he's the great exponent of this idea of polysemy."}
{"episode_id":"SW - #009 - 2018-07-24 - Milo, Jordan Peterson and The Symbolic Worldview. Discussing with Rachel Fulton Brown","start":3282.69,"end":3289.05,"speaker":"Jonathan Pageau","text":"Yeah, I read, you know, Roland Barthes Mythologies really was my introduction to symbolism."}
{"episode_id":"SW - #009 - 2018-07-24 - Milo, Jordan Peterson and The Symbolic Worldview. Discussing with Rachel Fulton Brown","start":3289.21,"end":3289.77,"speaker":"Rachel Fulton Brown","text":"Okay."}
{"episode_id":"SW - #009 - 2018-07-24 - Milo, Jordan Peterson and The Symbolic Worldview. Discussing with Rachel Fulton Brown","start":3289.85,"end":3321.17,"speaker":"Jonathan Pageau","text":"I was reading. I was reading Theoreticians and I read. And when I read his Mythologies, I thought, wait a minute, he's doing something more than the others. And so I realized that he was doing it as a critique, like as a Marxist critique of these structures. But I quickly, quickly realized, no, no, no, this is everywhere. Like, it's not just in the things you don't like, it's also in the things that you like. And so that was one of my first, like, awakenings to this notion of symbolic structures, was reading Galan Bakht, which, you know, then I never read again."}
{"episode_id":"SW - #009 - 2018-07-24 - Milo, Jordan Peterson and The Symbolic Worldview. Discussing with Rachel Fulton Brown","start":3321.17,"end":3448.77,"speaker":"Rachel Fulton Brown","text":"But, well, and so Barthes was reading Henri de Lubac's Medieval Exegesis. Right. And so there's a very clear lineage. My colleague Bruce Holzinger has done a book on this. Although Bruce and I are on politically opposite sides, we co authored a volume together. We never learned this until recently, that Bruce shows very clearly that Barthes was reading de Lubac and got this idea of Scripture having multiple senses. And Barthes then translates it into, will all texts have multiple senses. But of course, what he doesn't carry over is the reason that Scripture has multiple senses. And the reason that, I mean, Jordan is being able to do the lectures that he's doing now and the psychological significance of the. The Bible stories, because the Bible carries that kind of multi, multi layered understanding. And so it, you know, it's interesting, a Facebook friend today was asking sort of, does Jordan understand postmodernism? Like, well, what he needs? Because isn't there something good in it? And it's like, well, the good in postmodernism is actually what it carried over from the ancient, the medieval and ancient tradition. But the bad in it is that, of course, it tried to make it independent of the theological and mythological grounding that those insights grew out of. So that you and I see what Milo or Jordan is doing within that symbolic frame means that we also see the postmodernists more clearly because we understand why they were able to make the kinds of arguments that they were. I did a post back in the winter on why Marxism is actually Christian heresy. I called it the Church of the Left. And it's incredibly, you know, it's like the reason, the reason that Mark and Roger Scruton has written well about this too, that you know, that most of the things that people are drawn to have some truth in them. And there is a, there is a truth in Marxism about, you know, concerns for community and concerns for well being and so forth. But of course it's a heresy because as Jordan likes to say, you know, these ideologies are. What is the word that he used? They're imperfect. Right?"}
{"episode_id":"SW - #009 - 2018-07-24 - Milo, Jordan Peterson and The Symbolic Worldview. Discussing with Rachel Fulton Brown","start":3449.81,"end":3642.51,"speaker":"Jonathan Pageau","text":"They put the absolute at a lower level instead of. And that's why to me, the problem with a lot of the postmoderns and that type, and let's say the modern world, is that they've abandoned the idea of an ontological hierarchy. Like, they've abandoned this notion that. And so what they try to do is they try to fully fit the Absolute at a low level of the world. And so they try to fully fit the Absolute within the political sphere, let's say. And that, that, that is a crushing thing. It can't work that way. It has to resolve itself as you move up the mountain and you enter into the divine darkness. You know, it's not, it won't, it'll never be fully, let's say fully realized in the, in the, in the political sphere. So I think, like, I always think that Derrida is really, is really like an upside down medievalist. And I use, actually use a lot of his, I use a lot of Derrida's ideas. What I do is I just, I just tap them and then I just watch them flip back. And then I'm like, okay, I'm fine with that now as long as I can just, just tap that idea. Like, you know, there's a lot, there's. And there's a lot of, there's a lot of his ideas of Dehghidal's ideas in Jordan. I've tried to convince Jordan of this. I know he's gonna watch this. I tried to convince them that you, that there's, that you have to be careful because this idea of, let's say, encountering monsters on the edge and this notion of facing the future and that, you know, facing the unknown of the future and then taming it, I mean, that's really there in Derrida the difference is that I think that's why I like Jordan more. And I think that Jordan is more balance is that. Is that Deida only wants to join with the monster. Like, he just wants to sleep with the monster. Like, he wants to have this full. This, like, union with the. With like the chaotic unknown. Whereas Jordan is saying, you know, sometimes the unknown is this potential, like, like a mother, but sometimes it's also tiamat, and it's not. You have. There are different. Sometimes you have to kill the dragon, sometimes you tame the dragon, sometimes you have to just leave the dragon alone and just let it do its thing, as long as it's not bothering you. And so you have to. You have to. It's a. There. There's a hierarchy. It's always about hierarchy. Like, there's a hierarchy in the way you address these things, depending on how they present themselves to you. So, I mean, that's what I think. Like, I'm going to keep playing with this. And I know even in my discussion with Jordan, I'm going to push them a little bit on these ideas about how to flip things, to flip things back on their feet. And I think that's what my. That's why. One of the reason why I like Milo is I think that's one of the things that he's able to do is to take something upside down and to kind of flip it back, you know, to just kind of tip it and then it comes back into order. And so it's like that. It's the good side of the Joker, let's say. Or the good side of the. Of the. Like. Yeah, like an Elijah figure. Elijah does that. He comes into an inverted world and then he's able to kind of tap it and then it comes back into somewhat. It restarts the cycle, let's say. It restarts the order process. So. Yeah, anyways."}
{"episode_id":"SW - #009 - 2018-07-24 - Milo, Jordan Peterson and The Symbolic Worldview. Discussing with Rachel Fulton Brown","start":3642.51,"end":3701.67,"speaker":"Rachel Fulton Brown","text":"Yeah. So there's something you said back about the political and pushing the political. That, that. That was the other thing that I got that I. You asked me why I was sympathetic to Jordan. So on the one level that he recognized Milo as a trickster, which I totally. It's like he was the one other person that was saying that, and I was like, this is brilliant. And two, that I really appreciated his psychological discipline because that's another thing that I've been very, very interested in is, you know, training, training in virtue, training myself as a fencer, training myself as a. As a writer, training myself in sort of just simply self discipline. So I was very drawn to that. The other was that when he talks, when Jordan talks about the sort of layers of understanding, it was like that was exactly what I was trying to say in this Sightings piece that excited my colleagues so much that Andrew Breitbart, whom Milo likes to quote, like to say politics was downstream from culture. And I said, well, culture is downstream from religion."}
{"episode_id":"SW - #009 - 2018-07-24 - Milo, Jordan Peterson and The Symbolic Worldview. Discussing with Rachel Fulton Brown","start":3701.67,"end":3703.27,"speaker":"Jonathan Pageau","text":"Yeah, exactly."}
{"episode_id":"SW - #009 - 2018-07-24 - Milo, Jordan Peterson and The Symbolic Worldview. Discussing with Rachel Fulton Brown","start":3704.71,"end":3835.91,"speaker":"Rachel Fulton Brown","text":"Right. And when Jordan says. And, you know, then I didn't have space in that. And I think Jordan has also given me the language over the last few months to articulate what I think I mean by religion. And I think it's very close to what he means by it. It's the stories that we live. And, you know, I've been talking about Christianity as a mythology for a while now because I think it's. It's. It's not just ritual or. Or creed, right? It's. It's these embodied stories that you. You take on and become. And Milo does, right? He's embodying Francis or Jesus or Kung Fu Panda or David, right? But you're. You. You live the story. You don't just believe something abstract about God. You have to, you know, incarnate it and take it into the world and perform it. And you know that Milo goes off into campuses and gives these talks in front of these kids that, you know, may or may not want to listen to him. Jordan did the same thing, right? That was so impressive. I've watched most of Jordan's. A lot of Jordan videos in the last few months, too. When he. That first free speech protest on campus, and when he couldn't talk inside, he just went out in the middle of the courtyard, and when the kids pulled off his mic, he just says, okay, I'll talk. Right? That Jordan clearly understands, like Milo, the importance of being there in body. Your speech is one thing. Academics are great at abstract speech, and we write it and stuff and don't necessarily perform it publicly that much. Both Jordan and Milo are willing to do that, put themselves physically at risk, which they have been. Milo travels with bodyguards. I don't know whether Jordan does yet and be willing to be there in their bodies, but that Jordan also understands that what's happening to us, what the crisis that we're living through, and this is very much what I said in my Sightings article is religious. It's a crisis of religious. What stories are we going to live by? What. What truths are we going to embody? When. When I heard him say that, I was like, that's this. This is the one other person I found in Academia, who seems to understand what I was trying to express about what was going on in our culture."}
{"episode_id":"SW - #009 - 2018-07-24 - Milo, Jordan Peterson and The Symbolic Worldview. Discussing with Rachel Fulton Brown","start":3836.07,"end":3983.99,"speaker":"Jonathan Pageau","text":"Yeah, I see it. I see it. Like, I. I usually use. I like to use the word pattern because the patterns embody themselves in stories, obviously, but also in images, also in rituals, and then also in social structures. And so the same. The same pattern, let's say that's in the beginning of Genesis and the creation of Adam and Eve and heaven and earth and these opposites that then come together, you know, that's the same pattern, the same reason. It's the same structure that makes our society be based on marriage. Let's say the story. The story becomes the story. It's like there's an invisible pattern behind the story. Then the ritual, then the. You know, then even in music and all these things. And it's all these same. It's all these same patterns. So I kind of like to see that. I mean, that's what I've been trying to do, is trying to connect those things together and say, you know, like, the reason why, you know, like, let's say that hierarchy of being that we're talking about, like, that's why we say God is in heaven. And that's why we say, you know, that that person is above that other person. Like, no, they're not physically above that other person. There's a whole structure of patterns. And the same structure that makes us think that God or makes us say that God is in heaven is the same reason why we talk about a glass ceiling or like, it's completely infiltrated into our. Into our thinking. This idea that something which is more refined than us would be above us. It's so obvious. It's like one of the things that we use all the time in language. It's the most obvious thing ever, but it's not. It's an image that we constantly use. The image of hierarchy is an image that is embodied in a language and in stories and all these things. And so, yeah, so I kind of like to see it as these. As these patterns that just structure the world, basically. I think. Like, I think. I mean, for me, that's how I see myself as a medievalist. And I mean, my art and everything that I'm doing is trying very hard to live that in a world that is at the margin of that. It's on the edge of that and is watching those patterns kind of become fragile and dissolve. But, I mean, there's hope. Like, there is this. There's this."}
{"episode_id":"SW - #009 - 2018-07-24 - Milo, Jordan Peterson and The Symbolic Worldview. Discussing with Rachel Fulton Brown","start":3984.39,"end":3990.23,"speaker":"Rachel Fulton Brown","text":"There's. There's a hope that if the patterns are real, they can't dissolve. It's just. We dissolve if we don't recognize."}
{"episode_id":"SW - #009 - 2018-07-24 - Milo, Jordan Peterson and The Symbolic Worldview. Discussing with Rachel Fulton Brown","start":3990.23,"end":4032.06,"speaker":"Jonathan Pageau","text":"Right. And it's. And it's like part of the pattern is. Is that. That's what. That's why for the last we know, you know, 20 years of my life, I've been trying to understand how the end becomes the beginning. Like, how does that happen? Like, how does something end? And then how does it turn into a new beginning? And so all these images of monsters and of ambiguity and all that, like, that's why I've been so focused on that, is because I know that the secret is in that question. Question of the. Of the buffer. Like, what happens in the buffer zone? How does that turn? So I haven't completely figured it out yet, but I'm watching it happen. So as I watch it happen, it's helping me to understand it."}
{"episode_id":"SW - #009 - 2018-07-24 - Milo, Jordan Peterson and The Symbolic Worldview. Discussing with Rachel Fulton Brown","start":4032.22,"end":4032.62,"speaker":"Rachel Fulton Brown","text":"Right."}
{"episode_id":"SW - #009 - 2018-07-24 - Milo, Jordan Peterson and The Symbolic Worldview. Discussing with Rachel Fulton Brown","start":4037.75,"end":4038.15,"speaker":"Jonathan Pageau","text":"So, yeah."}
{"episode_id":"SW - #009 - 2018-07-24 - Milo, Jordan Peterson and The Symbolic Worldview. Discussing with Rachel Fulton Brown","start":4038.15,"end":4038.71,"speaker":"Jonathan Pageau","text":"So I."}
{"episode_id":"SW - #009 - 2018-07-24 - Milo, Jordan Peterson and The Symbolic Worldview. Discussing with Rachel Fulton Brown","start":4039.43,"end":4120.5,"speaker":"Jonathan Pageau","text":"It's very. It's very fascinating for me what's happening in terms of. I mean, I just. Like I said, I find the situation very interesting that you're there with Milo. I'm kind of walking with Jordan. And this is my theory, like I told you, my theory about Milo as being kind of King David. So this is my theory about Jordan, because I think Jordan is kind of like King Cyrus. A lot of people don't know the story of King Cyrus, but King Cyrus was a foreign king in the Old Testament. And when the. When the Hebrews were out of their promised land, that they had been. They had been, you know, exiled out into. Into the Middle East, King Cyrus is the one who sent them back and said, no, go back home. Rebuild your temple. Rebuild the walls of Jerusalem. You know, like, basically, you have the right to be what you are, right? Until then, like, the idea of dispersing a people is to make them cease to exist, to dissolve into. Like, if you disperse the people, then you dissolve them into the water. Like, you just spread them out, and then they stop to exist as a unified thing. But then Cyrus says, no, go back, you know, and build your temple. And so what's interesting about Jordan is that he's very. He's. He's very standoffish about saying whether he's Christian or not, he's not. He's not part of any church, that's for sure."}
{"episode_id":"SW - #009 - 2018-07-24 - Milo, Jordan Peterson and The Symbolic Worldview. Discussing with Rachel Fulton Brown","start":4120.98,"end":4124.54,"speaker":"Rachel Fulton Brown","text":"He said he was. He said he was the church of Joachima Fiore."}
{"episode_id":"SW - #009 - 2018-07-24 - Milo, Jordan Peterson and The Symbolic Worldview. Discussing with Rachel Fulton Brown","start":4124.54,"end":4156.98,"speaker":"Jonathan Pageau","text":"Yes, yes, we all heard that. And so he kind of stands outside Christianity somehow. And then he's saying. He's basically telling Christians, go Back, like, go. Go back to your thing. Like you are. You're allowed to be Christian. You're allowed to believe that and hear, and you're allowed to rediscover how profound and how true it is. But he. And the reason why he's able to do that is in a way because he's standing outside."}
{"episode_id":"SW - #009 - 2018-07-24 - Milo, Jordan Peterson and The Symbolic Worldview. Discussing with Rachel Fulton Brown","start":4157.54,"end":4158.02,"speaker":"Rachel Fulton Brown","text":"Yes."}
{"episode_id":"SW - #009 - 2018-07-24 - Milo, Jordan Peterson and The Symbolic Worldview. Discussing with Rachel Fulton Brown","start":4158.34,"end":4174.56,"speaker":"Jonathan Pageau","text":"If he. If he was at this moment in time, let's say if he was something like. If he was. If he was, I don't know, like a Presbyterian or if he was Baptist or a Catholic or an Orthodox, then people would. The people that are listening to him would stop listening to him."}
{"episode_id":"SW - #009 - 2018-07-24 - Milo, Jordan Peterson and The Symbolic Worldview. Discussing with Rachel Fulton Brown","start":4174.96,"end":4189.6,"speaker":"Rachel Fulton Brown","text":"Well, I agree that. So just as Milo is standing on the border by saying he's Catholic but gay, Jordan is interested in religion and believes religion is necessary for us as human beings, but is a scientist."}
{"episode_id":"SW - #009 - 2018-07-24 - Milo, Jordan Peterson and The Symbolic Worldview. Discussing with Rachel Fulton Brown","start":4190.08,"end":4241.39,"speaker":"Jonathan Pageau","text":"So you have these two. So it's interesting because the two extremes are really opposites. You have someone who's. Who's on the inside, like King David. Let's say King David is the secret king of the Jews. But he's acting in a crazy kind of foreign. He's uniting with foreigners. He's acting in all these inverted and liminal ways. You have the liminal king who's not at all part of the inside, who's on the outside, but who is sending people back towards the inside. And it's really interesting. It's kind of interesting. What's fascinating is that I realized that there are actually only two characters in the Old Testament that are called like messiahs. And those are the two. King David and King Cyrus. And so it's like these. It's as if Christ. What Christ does is. Takes those two extremes and unites them in one person."}
{"episode_id":"SW - #009 - 2018-07-24 - Milo, Jordan Peterson and The Symbolic Worldview. Discussing with Rachel Fulton Brown","start":4241.63,"end":4242.11,"speaker":"Rachel Fulton Brown","text":"Yes."}
{"episode_id":"SW - #009 - 2018-07-24 - Milo, Jordan Peterson and The Symbolic Worldview. Discussing with Rachel Fulton Brown","start":4242.35,"end":4272.13,"speaker":"Jonathan Pageau","text":"He takes like the. You know, and then if you look at Christ's story, you'll see that he. He actually does that. He takes the. Yeah. And Christianity is kind of that story of the two extremes of how the inside and the outside can come together somehow. And so. And so, yeah, it's interesting. It's interesting for sure. It's hopeful that maybe these two extremes are there and are helping to re. Establish something that is holding like that. Something that makes sense. Hopefully that's true."}
{"episode_id":"SW - #009 - 2018-07-24 - Milo, Jordan Peterson and The Symbolic Worldview. Discussing with Rachel Fulton Brown","start":4272.13,"end":4272.63,"speaker":"Rachel Fulton Brown","text":"I hope so."}
{"episode_id":"SW - #009 - 2018-07-24 - Milo, Jordan Peterson and The Symbolic Worldview. Discussing with Rachel Fulton Brown","start":4273.9,"end":4286.06,"speaker":"Jonathan Pageau","text":"Hope so. One of the things I wanted to talk to you about is I know that you're going to publish a book very soon on Marian symbolism, so maybe you can tell us a little bit about that."}
{"episode_id":"SW - #009 - 2018-07-24 - Milo, Jordan Peterson and The Symbolic Worldview. Discussing with Rachel Fulton Brown","start":4286.7,"end":4434.55,"speaker":"Rachel Fulton Brown","text":"I'd love to. So the book is called Mary and the Art of the Hours of The Virgin in medieval Christian life and thought. And its focus is this cycle of prayers that most people know now as the little office of the Virgin, or the Hours of the Virgin, because they're prayers that are said throughout the liturgical day in honor of Mary. The most famous part of that hours, most people know, although they don't necessarily realize that they know it, it's the Hail Mary or the Ave Maria, which was, in fact, technically the invitatory for this office. It was the opening chant that was used with the opening psalm and in the Middle Ages, because the ideal was everybody is involved in this service to Mary, everybody is involved in praising Mary. But if they didn't know the full hours, all of the psalms and all of the prayers and all of the other chants, they could. They could serve Mary appropriately simply by saying sets of Ave Marias or Hail Marys. And obviously, that practice turns into things like the Rosary. And even, you know, even today, that's. That's still very popular practice. But what's curious about the Hours of the Virgin is, although there's stories about it being sort of mandated for everyone to say, that was, in fact, never the case in the Middle Ages, that it started as a kind of additional practice that monks and nuns were doing in the 11th and 12th centuries. And lay people over the 12th and 13th centuries, because they modeled their prayer life on that of the monasteries, started asking to learn the hours of the Virgin as the way in which they could also sort of serve in the regular prayer of the church. And like I said, it was always a voluntary practice. By the end of the Middle Ages, there's a whole new kind of book invented so that people can say, these hours. They're what we call books of hours. And most people, if they've seen a medieval manuscript, they've seen a book of hours because they have beautiful pictures and things. So my book is about the way in which this practice developed, the kinds of things that we know from the stories that people told about their experience of saying, particularly the Ave Maria, and then getting deep into the actual symbolism of what the office was. Was about."}
{"episode_id":"SW - #009 - 2018-07-24 - Milo, Jordan Peterson and The Symbolic Worldview. Discussing with Rachel Fulton Brown","start":4434.87,"end":4442.15,"speaker":"Jonathan Pageau","text":"Mm. And so what. What was. I mean, what drew you to that subject right now? What was the thing that made you want to write about this in particular?"}
{"episode_id":"SW - #009 - 2018-07-24 - Milo, Jordan Peterson and The Symbolic Worldview. Discussing with Rachel Fulton Brown","start":4443.43,"end":4720.08,"speaker":"Rachel Fulton Brown","text":"Well, so I've always been interested in prayer, and I've. My whole career has also been working on devotion to Mary. I have a big beef with the feminists who, I think, have badly distorted the importance of Mary in the Christian tradition, in the Western tradition. And I love to talk about That I got to this particular project through the first book that I wrote, which was on commentaries on the Song of Songs in praise of Mary and Christ. And if you know the Song of Songs, it's the dialogue between the bride and the bridegroom. And what's very interesting about the way that book was used in the Middle Ages, in the liturgy, it's primarily used for the offices of the Feast of Mary, that the chants, particularly for the Feast of the Assumption, are taken from the Song of Songs. And in the 12th century there were commentators who were curious about this. Why in the liturgy do we say this text when, as they said in one of the commentaries, it doesn't seem to have anything to do with her. In the 12th century, there are a number of monastic commentators that use this, that use the fact of the. The Song of Songs being used in the Marian liturgy to make the Song of Songs into basically the story of Mary's relationship with Christ. So back when I was talking about the post that I shared about Milo in February on the Mother and Son, that's taken from one of these 12th century commentaries that transforms the Song of Songs into the conversation that Mary and Jesus, Mary and Christ have as I mean, lovers, because Mary is both the most perfect soul in relationship to God and of course, the mother of the Incarnate Son. And that love that they have is beautifully expressed through the Song of Songs. So in the present book, it's like I'm taking that out a further frame and showing not just the way in which one book of the Bible, the, the Song of Songs is used in a Marian context, but in fact the way in which all of the Scriptures were read through a Marian frame and in the hours of the Virgin. This is made sort of performative by way of the framing of the Psalms, the hours, if people are familiar with the hours, it's the practice of saying in the monastic traditions, the practice of saying the Psalter three once a week. Right. And in the Marian office, there's a selection of psalms that are used, some of them taken from the fact that they're used for her feasts and others, as I explained in my book, for a variety of reasons, but all of them are said in the Marian office, framed by chants that basically show the understanding that the medieval Christians had of her as the frame for God. This is that she. That the antiphon frames the psalms. The antiphone will be about her. Blessed are you among women. Let us sing the sweet song songs of the drama before the couch of the Virgin and then the Psalm will be about her son, Christ. And of course, that involves reading the Psalms as in fact about the Lord Adonai, with whom Jesus is identified. When early Christians say Jesus is Lord, they mean he's God, and they mean, therefore he's Yahweh. They mean he's the one whose name cannot be pronounced. So you say Lord instead of Yahweh. And so Mary framing the Lord in the Psalms is Mary framing God in the way in which he became incarnate through her. So my book is about sort of. It's also got this experimental level and its methodology that I set up each of the different chapters by inviting you as reader, to imagine yourself saying particular elements of the office. So first the invitatory Ave with its psalm. Then an antiphon, the first antiphone, blessed are you among women, with its Psalm, Psalm 8. And then the lessons that are largely taken from Ecclesiasticus. So they're all about Mary as wisdom and then the prayers. And the idea is you as reader, get to be. To kind of step inside this practice, just as medieval Christians used that practice. And we have pictures of them doing this in their books of hours, to step inside, into the sacred space with Mary by way of their service to her and praising her through this office."}
{"episode_id":"SW - #009 - 2018-07-24 - Milo, Jordan Peterson and The Symbolic Worldview. Discussing with Rachel Fulton Brown","start":4720.4,"end":4751.59,"speaker":"Jonathan Pageau","text":"Yeah. What's interesting about what you're saying is that in your own methodology, you're reproducing the feminine symbolism in this invitation. Because that's a strong part of the feminine symbolism is this idea of inviting, like you said, inviting the believer to step in and to participate. And so, like, that's the. That's exactly that frame. You know, the invitation is the frame that leads you in, let's say, to the service. So I don't know if you did that on purpose, but."}
{"episode_id":"SW - #009 - 2018-07-24 - Milo, Jordan Peterson and The Symbolic Worldview. Discussing with Rachel Fulton Brown","start":4751.83,"end":4765.96,"speaker":"Rachel Fulton Brown","text":"Well, now I can think I did, but now you just did to me what I used to keep doing to Milo. It's like. Did you realize that this is what you were doing? Oh, my gosh, you're right. Yes. That makes utter sense. Yeah."}
{"episode_id":"SW - #009 - 2018-07-24 - Milo, Jordan Peterson and The Symbolic Worldview. Discussing with Rachel Fulton Brown","start":4765.96,"end":4856.49,"speaker":"Jonathan Pageau","text":"But I think, you know, one of the things that I'm realizing, and I think that it's actually. It's actually obvious, is one of the problem of the age right now, one of the problems of the age is a proper engagement and a proper understanding of the feminine. It's like the fight. The fight that's happening is over what the feminine. And one of the problems about that is that the feminine is. How can I say this? The feminine is a question. Like the feminine is the. Is that invitation. It's that question. And so it's. It's actually very difficult to answer the what. Like, if you say, what is the feminine? It's really hard. It's hard to do it. To do it precisely because it's the feminine asking the what. Like, it's the feminine asking for, let's say, identity to manifest itself. It's the feminine that's. That's like. That's. It's the feminine that is. That, let's say, is that opening for. For something to happen? And so it's like. It's very. It's very difficult. I've been. I've been wrestling with this myself when I. When I talk about feminine symbolism. It's like, been really wrestling with. How much do you. You say, how much do you imply? Like, how much do you suggest? It's like sometimes if you. There's some things that, if you say to explicitly, you make them false, let's say. I don't know how."}
{"episode_id":"SW - #009 - 2018-07-24 - Milo, Jordan Peterson and The Symbolic Worldview. Discussing with Rachel Fulton Brown","start":4856.49,"end":4955.32,"speaker":"Rachel Fulton Brown","text":"Yes, well, yes, that sometimes. I mean that you and I both appreciate the deep power of metaphor and that I think the things. The things that you say, you articulate to metonymically or descriptively, to use Northrop Fry's language, since we're thinking about Jordan's reading too, they kind of lose life, right? And that is a problem, that the truths that are embedded in the stories. It's like the more you unpack the stories, there's this moment of understanding, but then it needs to still be in the story. It needs to still be something that you can live or act through for it to continue to be alive. Otherwise, it turns into this dead thing that you kind of write long academic books about with lots of footnotes, but it doesn't activate anybody's understanding anymore. It's this. So you're saying about the problem of the feminine. This is where my beef with the feminists came in, that I actually started working on Devotion to Mary in college. Basically, that's 30 years ago. So I was very frustrated. I read a lot of feminist theology back in the 80s and a lot of Mary Daly and Rosemary Reuter and Marina Warner's book on Mary. And all of them were just angry at the way in which they thought Mary had been designed or imagined in Christianity. And Mary Daly was. Well, it's all of them. But, you know, the primary way of thinking about Mary that they came up with was that she was basically raped by God, which goes utterly against the medieval tradition, which is that, as Bernardo."}
{"episode_id":"SW - #009 - 2018-07-24 - Milo, Jordan Peterson and The Symbolic Worldview. Discussing with Rachel Fulton Brown","start":4955.4,"end":4978.72,"speaker":"Jonathan Pageau","text":"Also the scripture, because there's this. There's this mo, like you said, even in the tradition, people really go into that moment when Gabriel announces to Mary that she received. Like it's really important in the tradition and even in the text really, I mean, implies that she, that she accepted like, that she accepted that this was going to happen to her."}
{"episode_id":"SW - #009 - 2018-07-24 - Milo, Jordan Peterson and The Symbolic Worldview. Discussing with Rachel Fulton Brown","start":4978.96,"end":4992.6,"speaker":"Rachel Fulton Brown","text":"Well, you remember in my Three Cheers for white men, consent was one of them. That the tradition of Christian marriage being constituted by consent is a, what a huge change."}
{"episode_id":"SW - #009 - 2018-07-24 - Milo, Jordan Peterson and The Symbolic Worldview. Discussing with Rachel Fulton Brown","start":4992.6,"end":4994.36,"speaker":"Jonathan Pageau","text":"It's a huge change in the history of the world."}
{"episode_id":"SW - #009 - 2018-07-24 - Milo, Jordan Peterson and The Symbolic Worldview. Discussing with Rachel Fulton Brown","start":4994.36,"end":5198.03,"speaker":"Rachel Fulton Brown","text":"It is. And in the Western tradition that the argument that the canon lawyers make is developed in the 12th century. And it's, it's. It's deeply embedded in arguments about what happens to Mary at the moment of the Annunciation. And Bernard of, Bernard of Clairvaux has a wonderful passage in one of his homilies where he has, you know, the whole world lies prostrate at your feet waiting for your consent, right? For Mary to say yes, and that, you know, God did not want to take flesh from her unless she was willing. And so, you know, even embedded in that Marian tradition, there's a sense that God is not. God could have raped her, but that's not what. That's not how God wanted to work salvation. And so her consent was very important. So on the one hand, you know, Daley and company of the feminists were, you know, trying to make this into the God the Father rape story. The other is an artifact of the 19th century focus on the search for the historical Jesus. Right. And, you know, now we have this culture of sort of what would Jesus do? And this feeds into my reading of Milo is Jesus too, that people have this, this image of Jesus now as he's. Well, he's either. I did a blog post on this called Signed with the Cross where I'm talking about Jordan's reading of the hero mythology too, that Jesus is either this sort of vagabond socialist, which is a kind of interesting late 19th century image, or he's just sort of saccharine and, you know, too sweet for good. You know, kids book. You know, he loves little children and lambs and stuff like that. And like, you know, seriously, this is a guy went into the temple with a whip and drove out the money changers and made everybody so mad at him that they killed him. So there's a. What we've done with that image, right? With that. There are theologians in the, in the mid 19th century. They're very interested in recovering what they think is the historical Jesus. And of course, for them the historical Jesus probably wasn't God. Probably could have been a little crazy, was probably, you know, Ernst Renan does this in his Life of Jesus, which is a very important watershed in this kind of thinking. Modern Christians tend to have nothing of the mythological layer of who Jesus is, who medieval Christians say Jesus was, which was the Lord, the monster slayer, the Lord of the Psalms, who kill, you know, draws Leviathan out with a hook and, you know, tramples on behemoth. Right. All of the. All of the Marduk imagery that Jordan loves talking about is embedded in the Psalms as well. That he's the one who sits in his throne, sits upon the waters, he tames the flood. He is the one who, you know, overcomes the forces of evil. The. And that image of Jesus as Lord is very much alive throughout the Middle Ages and into the early modern period. And imagining Jesus not just as this man who had a historical existence, which, again, I'm thinking about the lectures that you and Jordan both gave on the Logos, that it matters that he had a historical presence, right? It matters that he becomes incarnate in a particular historical moment, but it also matters that he was the transcendent Lord and, you know, the great hero who transcends all of the hierarchies, that in."}
{"episode_id":"SW - #009 - 2018-07-24 - Milo, Jordan Peterson and The Symbolic Worldview. Discussing with Rachel Fulton Brown","start":5198.03,"end":5206.55,"speaker":"Jonathan Pageau","text":"Orthodoxy, it's still the main image of Christ is Christ as this judge that stands above in the dome. I mean, you can't avoid it."}
{"episode_id":"SW - #009 - 2018-07-24 - Milo, Jordan Peterson and The Symbolic Worldview. Discussing with Rachel Fulton Brown","start":5207.43,"end":5217.37,"speaker":"Rachel Fulton Brown","text":"But it's been lost in the west, right, because the exegetical tradition, the commentary tradition of Western theologians has been much more focused on this historical person and even."}
