{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":0.16,"end":57.34,"speaker":"Jonathan Pageau","text":"So, hello, everybody. I am here with Jacob Russell. Jacob lives on the west coast, and I met him a few years ago as I was going to speak at a Catholic event. And since then he's been more and more involved in the discussion. He's leading the Facebook group that talks about symbolism, that discusses subjects from my brother's book, but also from the videos, and widens the topic of symbolism to a whole bunch of stuff. He's also running a Discord server about this discussion. And also, I mean, Jacob and I have just been becoming friends slowly through all this time, so I really enjoyed talking to him. So I'm going to ask him a few questions about the group and then also some specific questions that he has on theology. And Tim Maximus to confess with, this is Jonathan Peugeot. Welcome to the symbolic world."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":67.64,"end":343.16,"speaker":"Jacob Russell","text":"I've been out here on the west coast for about 20 years. I have four kids. I got twins on the way. So I'm really going through the rad trad phase. And then so, and for about the. For when I moved out here to Oregon, I was kind of your Pentecostal charismatic Christian for a few years, and I started noticing a lot of things that seemed off to me. And so I was asking a bunch of questions, just trying to figure out why I was more interested in the aesthetics of things. So while I was doing like, worship music, what the Protestants call worship music, leading the band style stuff, and I started thinking about, like, why does this look like a concert? It doesn't seem like Christians always had concerts. And I just started questioning the layouts of the church and everything. And I started asking questions and nobody had any answers for me. And so I started looking into more deeper theology and that just nobody was having any answers for me. So when I started looking deeper, I started looking into the historicity of Christianity. And for whatever reason, the atheist point of view was what grabbed a hold of me. And I just dove down that rabbit hole and then became kind of a closet atheist for a number of years and became a little bit more militant about it, mostly online. And so that lasted for about eight or ten years, I think. Wow. Okay. Yeah, for a long time. Then I just discovered Jordan Peterson at some point. And just because I started noticing all that, because I was also becoming quite progressive during this time too, which was more of an interest in an idea or an ideology that wasn't familiar to me because I grew up in the Midwest, so very conservative. So it was kind of like I was looking back, it was like I was trying on different clothes. And so Progressivism, liberalism was just something I was trying on for a while, and eventually it just started to just. Just rub me the wrong way. And everything was getting to be in this weird, controlled aspect of it, like trying to. Trying to pin everybody down, even though it was, you know, the use of the word liberal would think more freedom. But here you were like, their ideology was like, no, you can't go here. No, you can't go there. You can't go over here. You have to think this way. So when I started questioning all this, which was about the time that Trump came up, then eventually I discovered Jordan Peterson, and he was an interesting guy, to say the least. And I started listening to some of his lectures, and he just totally dismantled my ideas of religion. So I wouldn't say that he helped me become a Christian, but he at least helped me reconcile religion, I guess, and see the use in it. And then Pepe the Frog came on the screen, and I was like, I don't know what this dude is talking about, but, like, I'm going to look into it a little bit more. And then you started posting more videos. And then somewhere along the line, I figured out that I started putting 2 and 2 that orthodoxy wasn't Jewish and it was actually Christianity. So I started looking into it, right? And from there, I just kind of like, just started diving deeper and deeper into Orthodoxy. And it started with your talks and Death to the World website. And then. Yeah, so then I started just watching all your videos and trying to understand what that meant for being a Christian in the world today. And I needed to talk to somebody, and I couldn't talk to anybody. Nobody had any idea what I was talking about when I would bring it up. So I just. I was like, I'm just going to start this Facebook group, right? It's like, maybe I can get people to come on here. And I just invited all my Facebook friends at first, and actually, I think you were probably the first member."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":343.4,"end":345.76,"speaker":"Jonathan Pageau","text":"I think I was the first member, I think so. That's fun."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":345.76,"end":375.49,"speaker":"Jacob Russell","text":"And then, like, the next day, everybody else came on, and I don't think anybody still had a clue what was going on. And it just slowly morphed into what it is now. So we've been going for. I think it's been a year and a half, and there's over 700 members now. So I keep saying that once we get 777, then, I don't know, we've, like, reached, you know, Theosis or something."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":376.69,"end":377.85,"speaker":"Jonathan Pageau","text":"For a Facebook group."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":377.85,"end":427.77,"speaker":"Jacob Russell","text":"For Facebook group equivalent of Theosis for a Facebook group. Yeah. So, yeah, so I started that, and discussions have been really helpful into just working out what's going on in my head and seeing what other people think. And it's been just. It's been weird and fruitful. And then I just. I decided to start a Discord server because I thought that there might be more attraction for other people that don't like Facebook because a lot of people are really against Facebook. So I started that. And the Discord group is good. There's some really, really good people and decent discussions going on, but it's not as active as the Facebook group. Yeah. So I'm not starting any more groups, though. After this, I've got. I gotta start on another group for my kids."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":428.01,"end":430.01,"speaker":"Jonathan Pageau","text":"You got your own group coming here, right?"}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":430.01,"end":435.61,"speaker":"Jacob Russell","text":"Yeah. So, yeah, that's. That's pretty much."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":435.61,"end":560.57,"speaker":"Jonathan Pageau","text":"I mean, what. What has. Really. What I've been happy to see with the Facebook group is to notice the level of discourse that has been going on there. It feels like. I mean, obviously, just like any Facebook group, sometimes things. Things get get heated a little bit, but most of the time it's extremely informative and cordial. And what's great is I'm. There are some people who are posting things that are really pushing some aspects of symbolism that I haven't taught about. Like, there was someone. Forget his name was posting best things about bestiary symbolism. So, yeah, taking one animal and then quoting some, putting up quotes about this animal. So there's been a lot of. Yeah, it just feels like it's been complimentary. And I've learned quite a few things. You know, I go in and I kind of follow. I don't comment a lot, but I try to see what people are saying and get a sense of what's going on. So I'm pretty happy about that. I'm just. I'm just happy to see people. I'm the same as you, you know, it's. I'm in the same situation you are in the sense that, you know, before. Before I met Jordan Peterson, let's say it was Matthieu and I. And that was it. There was nobody else who could talk about the stuff with. Just felt like we were just these two people discovering this in our own world, you know? And then. And then all of a sudden, when I met Jordan Peterson, I felt like he had this. He had a symbolic intuition, which I'd rarely encountered. It was one of the first times where I could speak at a certain level, and I knew that he understood what I was Talking about. So I was excited. And now all of a sudden, yeah, all of a sudden now there are all these people that they'll write me messages and I'm like, wow, this person has such a good intuition about these structures. It's almost natural for them. So, yeah, I think it's great to have a network of people that understand this. And I can understand too how for people, sometimes when I make a video, I realize, okay, right now I'm preaching to the crowd because I'm taking for granted that the people that are going to watch this understand the basics of it. So I'm not going to explain basics every time. I can understand why someone also would drop into a video like that and think, okay, this is just nonsense. Or like no one knows what he's talking, what you'd be talking about."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":560.97,"end":617.7,"speaker":"Jacob Russell","text":"Yeah, yeah, I get that quite a bit because I'll see other, like outside of the group, in other discussions and I'll drop like one of like a video of yours that they happen to be talking. Like the other day somebody was talking about dog headed men. So I, I put a link to that article that you wrote in the Orthodox Arts Journal and I was like, I got the response that I figured they were just like, yeah, whatever. They didn't know what they're talking about. They're just like, they're more. Everybody's so focused on. Which is fascinating to me. It's that, that, that people are so focused on the material that they don't realize how much they focus on that. Only because they were more like trying to figure out, okay, how is this like physically real? How are dog headed people physically real? What kind of like experiment happened, you know, 100 years ago?"}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":617.7,"end":618.58,"speaker":"Jonathan Pageau","text":"Aliens. Aliens?"}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":618.58,"end":623.22,"speaker":"Jacob Russell","text":"Yeah, aliens. It's aliens. That's right. But it's aliens."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":623.3,"end":623.94,"speaker":"Jonathan Pageau","text":"Exactly."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":625.62,"end":655.34,"speaker":"Jacob Russell","text":"So, yeah, it's been, it's been, it's so. And now, and now that I've been like in this discussion for, for a couple years now, like, I just see, like, I can't even imagine how you and Mattoo have been functioning for so long because it's just like, yeah, you kind of feel like you're a madman sometimes, you know, because it's like you want to say things and you're just like, nope, nobody's gonna understand what I'm saying. Yeah, look insane. So just gonna just buckle down and log on Facebook."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":656.57,"end":749.93,"speaker":"Jonathan Pageau","text":"Yeah, but in a way it was, I think it was good because for the years, I would say the like almost 20 years that we were working on this on our own and Thinking about it, I also was constantly trying to formulate ways to at least address this, you know, with people. And so I feel like I found some analogies that if I'm in a situation where nobody understands, I can say things I can talk about. You know, that's why I use images like the medieval village, or I try to use really concrete images of something that you can portray in your mind so that it's not. It's. I not always talk about the abstract stuff. And I always try. One of the things I try to do is I. If I'm talking to somebody who doesn't know a lot about symbolism without talking about symbolism directly, what I try to do is I'll. In the discussion, I'll shift between the individual and the communal level while I'm speaking. So it's like I'm talking about something, and then I'll. All of a sudden I'll switch to higher level of existence and then come back. So the person is like, whoa, what happened? Because they can see the analogy. They can see that, okay, here's the structure. I'm talking about something, and all of a sudden I'll talk about a body in terms of a city or in terms of a larger being. And then I'll come back down to the person. Then maybe I'll go even higher. And so it's like, I'm not telling you about symbolism, actually taking by the hand. And I'm going to. Going to take you to these little spark moments where you can see the connections yourself. Hopefully that'll spark your curiosity to then go further. But, you know, it's not easy to talk about this stuff."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":750.09,"end":760.17,"speaker":"Jacob Russell","text":"It's not easy. Yeah, but it's fun, though. It's fun because I also, like, I try to introduce my kids to it a little bit, and they're just like, sure, dad, whatever."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":761.21,"end":817.94,"speaker":"Jonathan Pageau","text":"Well, you know, there's a good way to do it. This is how I did it with my son especially, is if you notice a pattern in a story, then what I've done is I'll tell us some fairy tales. Like, I'll tell them some fairy tales or some stories from ancient myths or some Bible story. And then once I feel like they've heard enough stories with a certain pattern, then I'll just say, hey, did you notice that this story has the same thing as that other story? Did you notice that? Like, do you notice that? You know, the easiest one is the idea of going down somewhere and coming back up and you say, hey, do you notice how they go down and Come back up. Or that there's this movement. And so he'll go, yeah, yeah, yeah. Hey, what other story has that? Think about it. What other story has that? And then think about it. Now my son is, he's pretty good at identifying things sometimes that I didn't even notice. He'll say, he's like, hey dad, did you notice that? I'm like, oh, wow. Not bad."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":817.94,"end":853.86,"speaker":"Jacob Russell","text":"Yeah. Nice. Yeah. It's funny because my son does that too. He's 10. But he was telling me that him and my 8 year old daughter, they'll watch some show and my daughter will get upset whenever the hero is getting beat or whatever and he's like, don't worry, the hero always gets back up again. I'm like, yeah, he does. That's pretty good. Do you notice that? It's like, you ever hear that before? He's like, no. And then so I started talking about all the other stories. He's like, oh yeah. He's like, that's like everywhere, right? He's like, is that that pattern you're talking about?"}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":854.9,"end":862.1,"speaker":"Jonathan Pageau","text":"It's like, okay, dad, yeah, when you're older, how old, how old is your oldest?"}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":862.58,"end":863.22,"speaker":"Jacob Russell","text":"He's 10."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":863.3,"end":887.23,"speaker":"Jonathan Pageau","text":"Yeah, okay. Yeah. So I mean, I think this as a good time. 10. But you'll see it. I think that if, if you, if you work on the patterns and at some point it's like for me, Elysee was when he was like when he hit puberty. I feel like his mind, you know, it's like when you're 12, 13, then your mind starts to really kind of meld, like really kind of take shape. And so then all of a sudden it became more explicit for him and he started mentioning it like, okay, yeah."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":888.59,"end":946.2,"speaker":"Jacob Russell","text":"Yeah, that's interesting because he, my son at least notices that there's a pattern. He doesn't know what the pattern means, but he notices that, you know, the hero always gets beat down but then gets back up again. That pattern he's, he's pretty consistent with or he, whenever he was like two or two or three years ago, he was telling the story that he was just making up as he went. And it was about these dragons and it was like, it was like all these good dragons all had like this like elemental aspect to them and they were against this one dark dragon and they had to like, what was it? And I think even had. He even threw in some sort of resurrection story within it and he was, he was like 7 or 8. And I was like, yeah, I mean it just comes natural to you that's amazing, you know, that. That kids can recognize that, but they have no idea what they're talking about. Yeah, but it's still, it's still quite fascinating."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":946.2,"end":1005.33,"speaker":"Jonathan Pageau","text":"Yeah. And the idea is that those, Those patterns are really what, what make us. What make us like they, they, they. They participate in who we are. And so it's actually. The alienation is actually a work that the world does on us. There's actually work, you know, you have to go to school and you have to be alienated systematically in order to. For that to break. And so the whole modern world is like, you know, because it's on the fringe. It's acting as a deconstructive agent. It's still part of the meta pattern, but still it makes it more difficult for people to see patterns because when you're in the fast, when you're in the spinning, spinning and the. And the upside down and the crazy, then it's harder to see the pattern. That's one of the reasons why I talk about that all the time, because I'm trying to say, okay, this is actually part of a bigger pattern, which is that things move towards this madness. So it's like you can't get away from it. But it's true that in this moment, it can be harder for people to see. To see the regular patterns, you could say."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":1005.81,"end":1006.77,"speaker":"Jacob Russell","text":"Right, right."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":1007.25,"end":1017.85,"speaker":"Jonathan Pageau","text":"All right, so let's talk about what you wanted to kind of talk about. You've been reading Sam Aximus and, And what are the. Tell me, what are the questions that you were coming to?"}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":1018.09,"end":1082.1,"speaker":"Jacob Russell","text":"Well, so it's. It. Well, so one of the interesting things about this was I started. I started looking at, like, the way that the church was laid out, you know, and then I. And I was kind of doing some research, just kind of like, not really looking for anything, just curious about layout and diagrams. And I noticed that there was some sort of correlation between the Jewish temple and the parish. Right. And then I stumbled upon. A few other people were talking about how the Garden of Eden was laid out, very similar in very abstract idea. And I was like, this is fascinating. So I was looking into this more and more. And then I started thinking about how, you know, what those things, like, meant. And then you came out with your. The Hezekiasm video that you did with the. Think you're in Seattle whenever you did that. Whatever."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":1082.1,"end":1082.58,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":1083.22,"end":1204.9,"speaker":"Jacob Russell","text":"And so that, like, that really helped put some things in perspective. Right. And then, so I was trying to understand, like, where who else was talking about this. And that's whenever I Discovered Saint Maximus. And then I realized also that other people talk about it, St. Gregory and a few others. But anyway, as I started reading the specific book that he wrote, which was the. I think it's called the Ecclesiastical Mystagogy, or the Church's Mystagogy, depending. The concept that you were talking about, how the heart is, like. Is like an image of the Church. The Church is the image of the heart into the cosmos. All of that makes sense. But then you get to the part of the soul, and I'm just. It's like. It was like, nothing about the soul makes any bit of sense to me. I don't know why. I mean, maybe it's like. Maybe it's because I'm always thinking of spirit and not of soul. And I'm not quite sure if there's a distinction. And, like, I understand the concept of the noose, you know, but I know that orthodoxy goes deeper and explains some of these things. I haven't really looked into that too much, but especially whenever he's. Whenever. So Maximus splits the soul into two faculties, right. And one of them is. I think they call it. Yeah, intellectual. And the other one is vital. And it kind of breaks them both down into one. The intellectual side, through contemplation and knowledge and wisdom, leads you to truth, into knowing truth. But then the other aspect of it is. Seems like it's more related to the physical, like doing good. And then when those two things come together, it reveals God. Okay, right. So that's what he's basically saying. I have no idea how to apply that. Does that make sense?"}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":1204.9,"end":1205.94,"speaker":"Jonathan Pageau","text":"Apply to your life?"}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":1206.18,"end":1224.18,"speaker":"Jacob Russell","text":"Yeah. Like, how does one. Like, he wrote it for a reason. It's like, okay, now, what this is. It's fascinating, but how does that. How does that, like, push you more into the liturgical life or guide you into prayer at all? You know what I mean?"}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":1224.51,"end":1296.75,"speaker":"Jonathan Pageau","text":"Well, the first thing. I mean, the first thing that. The way that you present it is very good, because the first thing to understand is that words like soul are contextual often, and they don't always refer to the same thing. Seems, at least when I read it, they don't totally seem to. Sometimes the soul and body will be opposed in the sense that everything that's invisible is a soul and everything that's visible is body. Let's say something like that. And then sometimes, like you said, then the soul can be separated into two. The intellect, which would be the noose, and then the soul proper, or the vital soul. That's a good way to talk about it, which would be the in between thing, the thoughts, the desiring capacity, all the invisible aspects of us that are kind of like the motor for action, you could say, or the motor for things. And so the. So the problem in the way that it's understood is that the body is not. Is neutral. The body is not. The body is almost like the earth in the creation sense. It doesn't have value. It's just. There's nothing wrong or good about body."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":1297.07,"end":1298.19,"speaker":"Jacob Russell","text":"It's just like a vessel."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":1298.35,"end":1300.03,"speaker":"Jonathan Pageau","text":"Sin is not related to body."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":1300.91,"end":1301.71,"speaker":"Jacob Russell","text":"Right, right."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":1301.79,"end":1319.06,"speaker":"Jonathan Pageau","text":"It's the passion. It's the in between part which is problematic. Then between. The in between part is what will then you fall into. Let's say when you fall into the body, it's not because of the body, it's because of the. It's the desiring capacity. It's the in between capacity which is focused in the wrong direction."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":1319.38,"end":1320.18,"speaker":"Jacob Russell","text":"Right. Okay."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":1320.18,"end":1337.97,"speaker":"Jonathan Pageau","text":"So instead of looking up and which would order the body, it looks down and then the body, it'll idolize the body or idolize the bodily function or fear for the bodily functions or whatever. And then that's what ends up. It's one of the things that ends up bringing about sin."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":1338.93,"end":1339.33,"speaker":"Jacob Russell","text":"Right."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":1339.49,"end":1400.83,"speaker":"Jonathan Pageau","text":"So that's important to understand because we're so Gnostic. It's so hard to break the Gnostic thinking. We always tend to think, you know, spirit good, body bad. We have that. It's so ingrained into us. But Christianity is really not about that. The problem happens in this desiring capacity. And so then you can understand. But then you can like, you can still have soul, body in the sense that the soul informs the body, but then you can also have it as nous and soul, where the intellectual part informs the. Should at least inform the soul. So that's also a thing that's important in understanding symbolic structures is that they're all contextual. So you can understand, let's say the temple or the tabernacle, the whole tabernacle is feminine in relation to God."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":1401.87,"end":1402.95,"speaker":"Jacob Russell","text":"Right? Okay. Yeah."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":1402.95,"end":1419.15,"speaker":"Jonathan Pageau","text":"Now when you get into the tabernacle, then the holy of holies is masculine in relation to the rest of the temple or the rest of the tabernacle. Then the whole tabernacle is masculine in relation to the rest of the creation."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":1420.28,"end":1420.6,"speaker":"Jacob Russell","text":"Huh."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":1420.68,"end":1422.28,"speaker":"Jonathan Pageau","text":"But does that make sense? So it's like."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":1422.28,"end":1423.32,"speaker":"Jacob Russell","text":"Yeah, yeah."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":1423.56,"end":1443.24,"speaker":"Jonathan Pageau","text":"So that can, that can maybe help you to understand why it's like, why is it, why is it spirit and soul? Like, why is he talking about that is because let's say the soul is the body of this, of the noose, and then the body, the physical body is the body of the soul. It's like it moves down that way."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":1443.72,"end":1446.8,"speaker":"Jacob Russell","text":"Right? Yeah. Yeah. Okay. Yeah, that's making more sense now."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":1446.8,"end":1464.36,"speaker":"Jonathan Pageau","text":"That helps. So. So you have. So that's why also, when I. When I talk about things like I talk about hierarchies and principalities, you always have to understand that something above is a principle of the thing below. But it's also. It can also. It's also the body of something which is above it."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":1465.16,"end":1465.96,"speaker":"Jacob Russell","text":"Right, right."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":1465.96,"end":1511.88,"speaker":"Jonathan Pageau","text":"Does that make sense? So it's like. Yeah, things, things, things are not. It's not like there's just. So each level has a masculine and feminine aspect, and it's necessary for that. Because then people misunderstand so many things, though. That's why it's like, if you want to symbolically understand a queen, how do you do that? If you can't understand how at each level of a hierarchy, let's say there's both a feminine and masculine aspect, depending on which direction it's looking, does that help you to make a little bit more sense of why there would be, say, the noose, the soul, the body, and why he's talking about the relationship of the noose and the soul as similar or akin to the relationship between, let's say, God and creation? Something like that."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":1512.2,"end":1537.59,"speaker":"Jacob Russell","text":"Yeah, yeah, that. Yeah, that does. Yeah. And I think. Yeah. I don't even know. It's such a heavy thing, you know, and so foreign to. So foreign to the way that you. That you just interact, I guess. I guess you do interact in the world in that manner. You just don't realize it. Right. You're just not even ever thinking about it."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":1537.67,"end":1538.23,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":1538.39,"end":1539.35,"speaker":"Jacob Russell","text":"So you can."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":1539.35,"end":1548.47,"speaker":"Jonathan Pageau","text":"You can understand that every time you. I mean, if you. If you're attentive to yourself, you'll notice that all sin is born in thought and desire."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":1548.79,"end":1549.19,"speaker":"Jacob Russell","text":"Right."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":1549.35,"end":1550.95,"speaker":"Jonathan Pageau","text":"It's not born in the body."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":1551.92,"end":1552.16,"speaker":"Jacob Russell","text":"Right."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":1554.8,"end":1570.48,"speaker":"Jonathan Pageau","text":"The body will express yearnings, let's say, but the sinning all happens up at the middle part. And depending on how you direct your attention and where you direct your will."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":1571.6,"end":1593.99,"speaker":"Jacob Russell","text":"That'S where the problem arises, which goes back to take every thought captive. Yeah, right. You know, because. Yeah. Once you cat. If you capture it within your thought process, you know, it's almost like once it becomes. Once it does apply to your body, then it becomes more concrete and more rooted. Right."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":1596.23,"end":1631.03,"speaker":"Jonathan Pageau","text":"It can help you understand then why, let's say for St. Gregory of Nyssa or for some of the more mystical Fathers, they'll talk of the soul, the beloved, right? They'll talk of the soul as the bride of Christ, when they talk about the images in St. Gregory of Nyssa, when he talks about in the Song of Songs. And this relationship between the lover and. The relationship between the lover and the lovey, I guess, is between God and the soul. Because in that relationship, then God acts as the soul, acts as feminine."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":1631.51,"end":1631.87,"speaker":"Jacob Russell","text":"Right?"}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":1631.87,"end":1639.99,"speaker":"Jonathan Pageau","text":"Then, like I said, you can flip, you can keep. You can flip it where it's like now the invisible part of the person, it becomes like masculine in relation to the body."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":1640.63,"end":1641.07,"speaker":"Jacob Russell","text":"Yeah."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":1641.07,"end":1647.99,"speaker":"Jonathan Pageau","text":"Okay, so it's all. It's all about. It's all about hierarchy and how each level interacts with the one above and below."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":1649.27,"end":1668.91,"speaker":"Jacob Russell","text":"Okay, so. And then. So if. If using these principles, then what is there. Is there a way that, like, if the soul, like, informs the body, is there a way that the body. The actions of the body, what. What do they do? They do something for the soul, then in return?"}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":1669.87,"end":1675.23,"speaker":"Jonathan Pageau","text":"Well, they offer this. They offer the support for the soul to manifest in the world, which is."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":1675.23,"end":1710.67,"speaker":"Jacob Russell","text":"Why it's important to have. Right, so which is. This is why it's. It's important to actually go through, like, the more physical aspects of, like, say, prayer, like your prostrations and, you know, whenever. And bowing, you know, whenever you're in church. I'm always. I'm just observing how every. We all bow, you know, at the same time, you know, to the priest. And it's like, it's important to. I understand that it is important for the physical body to do that because. And as you're saying, it's like it goes both ways. The body kind of anchors the soul, maybe."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":1710.67,"end":1736.68,"speaker":"Jonathan Pageau","text":"Yeah. Makes it real. Makes it. Makes it real in the sense of. Makes it grounded. Right. And also the fruit, it's like, that's why this idea of the fruits, you know, the. The actions of the body or the visible actions that you pose, they're the fruits. They're the glory of. Of the. Of the. The soul. And they're also, if you will, in the end, the proof you're not. That you're not deluding yourself."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":1737.08,"end":1737.48,"speaker":"Jacob Russell","text":"Right?"}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":1738.6,"end":1800.44,"speaker":"Jonathan Pageau","text":"If you're not having fruits in the world, then. Then maybe you're living. Maybe you're deluding yourself. And that happens in the. In the more immediate. It's like to love your neighbor isn't just to think about it, right? Loving your neighbor is. Is actually doing things to help your neighbor. You know, caring for people is not just in your mind, it's not enough to just. To just think about it, you know, it has to manifest in the world to a certain extent. If you pray for people, but then every time you talk to someone, you bark at them and you're annoyed with them, then it's like, well, maybe there's some disconnect here. And that's why I keep saying that that's why Christ is so bent on hypocrisy. He's always talking about hypocrisy, because hypocrisy is when the levels are. There's a discontinuity between the levels. What you want is for everything to be aligned. So you want what you think and say and pray for to then align with what you do in the world. Those two things have those. The proof that this is the way that it's really the way is that they're all lined up."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":1800.44,"end":1814.38,"speaker":"Jacob Russell","text":"Lined up. Right? Okay. Huh? Okay. Yeah. This is. It's. Everything is like falling in. If you could see what's in my head, everything is kind of like Tetris falling into place right now. So. Okay."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":1815.18,"end":1875.11,"speaker":"Jonathan Pageau","text":"And so you can understand. So the thing is that in terms, if you're trying to make sense of, let's say, the analogies between the church and the person, it actually just depends. Like, it just depends. And so you can understand, like I said, the invisible and the visible. Then you'd have the relationship of something like the dome of the church and the body and the. The lower part of the church, the dome and the square. Then it's like the invisible and the visible or the heaven and the earth, right? Then it's like soul in the basic sense of all that's invisible about you, and then body in the sense of everything that's visible about you. But then, like I said, it can also be, you know, like the Mother of God can be an image of the body in the strictest sense, but then it can also be the Mother of God can also be an image of the soul in relationship to Christ as well. So you see that in St. Gregory of Nyssa, he says that the whole purpose of life is that you give birth to Christ."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":1875.91,"end":1876.31,"speaker":"Jacob Russell","text":"Right?"}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":1877.67,"end":1887.03,"speaker":"Jonathan Pageau","text":"That is what we're all called to do, is to imitate the Mother of God and giving birth to Christ in our soul. So then it's like. Then the soul becomes the body."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":1888.79,"end":1889.07,"speaker":"Jacob Russell","text":"Of."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":1889.07,"end":1906.06,"speaker":"Jonathan Pageau","text":"The light of the spark of the divine spark. So you have this divine spark hidden in your noose, let's say. And then you have the soul. And so that's where the relate the relationship happens. But you could also see it. Like I said, you could also see it as just the whole invisible and the visible."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":1906.38,"end":1929.61,"speaker":"Jacob Russell","text":"Right. And then in the. More so in the church, the Holy of Holies, where the priests, deacons are coming out. That's like the. That's the visual that's I'm thinking of. Right. That you're talking about. That's because they're. The Holy of Holies represents the soul. And then the north, or the nave is like the body."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":1930.01,"end":1942.97,"speaker":"Jonathan Pageau","text":"Well, it depends. You can really. Like I said, it's really a hierarchy. And so everything. Okay, so let's say a person is spirit, soul and body."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":1943.13,"end":1943.45,"speaker":"Jacob Russell","text":"Right."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":1943.45,"end":1950.9,"speaker":"Jonathan Pageau","text":"That's the way to see it. So you could see it as the church. You have the Holy of Holies, which would be the noose, which is hidden."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":1951.7,"end":1952.1,"speaker":"Jacob Russell","text":"Right."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":1952.18,"end":1971.29,"speaker":"Jonathan Pageau","text":"And then you have the soul would be. Well, that's it. The nartex could be the body in a certain sense, but the cruder aspect of the body would actually be the. Would be the. Would be the. No, sorry. The nave would be the nave, but the cruder aspect of the body is definitely the narthex."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":1971.29,"end":1972.37,"speaker":"Jacob Russell","text":"Narthex, right."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":1972.69,"end":1977.33,"speaker":"Jonathan Pageau","text":"In the sense that it's like this chaotic space. It's a mixture that's all this. That all this stuff and it."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":1977.33,"end":1977.73,"speaker":"Jacob Russell","text":"Right."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":1977.81,"end":2010.62,"speaker":"Jonathan Pageau","text":"It comes to be aligned with. So it's. So like I said, it's better to see. Once you start to see the structures, it's not so important to align things like this is that. This is that, this is that. Because inside. So inside the holy, you'll have a microcosm of the same thing. So inside the Holy of Holies, you have the Holy of Holies, but then you also have the altar. And then in the middle of the altar, then you have a cup. And then in the cup you have the presence of God. So you have another hierarchy inside."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":2012.54,"end":2013.1,"speaker":"Jacob Russell","text":"Yeah."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":2013.18,"end":2021.82,"speaker":"Jonathan Pageau","text":"It's like it just keeps getting smaller and smaller and deeper and deeper into reality until it's this invisible transformation."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":2022.98,"end":2023.3,"speaker":"Jacob Russell","text":"Yeah."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":2025.14,"end":2035.14,"speaker":"Jonathan Pageau","text":"Okay. The whole church has to be that body, too. And so the whole church has to become for the world what comes out of the Eucharist to the church."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":2035.94,"end":2037.94,"speaker":"Jacob Russell","text":"Right. The Body of Christ. Right."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":2038.18,"end":2039.62,"speaker":"Jonathan Pageau","text":"That's what we are supposed to be."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":2039.62,"end":2042.66,"speaker":"Jacob Russell","text":"To the world to be. Right. Yeah. Which. Yeah, okay."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":2043.06,"end":2054.93,"speaker":"Jonathan Pageau","text":"That's when you get the sense of these fractals. Once you get a sense. Once you're really able to see the world in fractals, start to see that it's not so much about aligning things as to notice the structure, how it repeats itself. In different ways. In different."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":2055.89,"end":2080.8,"speaker":"Jacob Russell","text":"Okay, yeah. Okay. So one thing you just said though was you're talking about the noose is hidden. And so that would be like the, like the iconostasis is what's hiding it. Right. So then, what about. So then what do you think about these churches that have done away with those? Yeah, you know, and I think that it's."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":2080.8,"end":2120.66,"speaker":"Jonathan Pageau","text":"I think that it's a misunderstanding of the gospel and I think that it's also a misunderstanding of Christ, but it's also a reaction to an excess. It's always, that's the thing. It's always, you know, it's like I disagree with the revolution. I don't want. I think killing the king is wrong. But I also, I cannot, I can see why the revolution came about. Like, I can still see why it happened, even though I disagree with it, you know, and so it's like I can, I can see why a teenager is rebellious to his parents. I can still think that that's not good and it's not good for that. That person's soul. But I can still see that they're."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":2120.66,"end":2121.66,"speaker":"Jacob Russell","text":"Reasoned by their actions."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":2123.34,"end":2155.3,"speaker":"Jonathan Pageau","text":"If you look at the Russian church, as time went by, the wall between the, between the nave and holy place and the altar just ended up covering the entire space, filling up like they were closed off. And so what I think is normal is a sense that Christ opened the curtain, ripped the curtain."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":2156.72,"end":2156.96,"speaker":"Jacob Russell","text":"Right."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":2156.96,"end":2179.36,"speaker":"Jonathan Pageau","text":"He went in. But then without the curtain, you don't have a ripping of the curtain. You need to re. You need to always re Rip it. Yeah, you have to, you have to, you have to re. Veil in order to unveil. Because you, if you unveil at some point, if it's just unveiled, then you actually. People don't know. There's no mystery anymore."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":2179.84,"end":2180.72,"speaker":"Jacob Russell","text":"Right, Right."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":2180.72,"end":2195.42,"speaker":"Jonathan Pageau","text":"And so it's like. And so what? So the way that I think it should, should be is that there should be a curtain at least that gets pulled and gets open, gets closed and open. So there's like there's this opening and closing of the holy, Holy place."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":2195.58,"end":2195.98,"speaker":"Jacob Russell","text":"Right."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":2195.98,"end":2206.54,"speaker":"Jonathan Pageau","text":"That you understand the problem that we do have access to, to the spiritual world. We do have access to the noetic, but it's also closed off to us."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":2206.54,"end":2207.26,"speaker":"Jacob Russell","text":"Closed off too."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":2207.26,"end":2207.9,"speaker":"Jonathan Pageau","text":"Most of the time."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":2207.9,"end":2208.94,"speaker":"Jacob Russell","text":"Most of the time, right."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":2209.4,"end":2216.2,"speaker":"Jonathan Pageau","text":"Most of the time it is. But it's not true that we don't have access to it. That's also a lie."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":2216.68,"end":2217.08,"speaker":"Jacob Russell","text":"Right."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":2218.12,"end":2236.88,"speaker":"Jonathan Pageau","text":"In a way, we secretly always have access to it because it's that which informs the world Once in a while, if we are, you know, if we're attentive, if we pray, if we do all these things, if we capture the thoughts, like you said, then we have more glimpses of noetic insight, you could say."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":2237.2,"end":2278.33,"speaker":"Jacob Russell","text":"Right. So, okay, so let's go off the soul thing for a second because the veil. The veil thing, I gotta let that simmer for a while. But the veil is interesting. So how does the iconostasis and like, even. Even the Eucharist cup is. It's veiled. Right. So how does that apply to a woman who is supposedly supposed to be veiled, you know, during. During liturgy and during prayer? Well, there is that something, because I read something and my wife actually said this to me. And I don't know where she got it. She can't figure out where she found it, but it had something to do with covering that which gives life."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":2280.09,"end":2299.68,"speaker":"Jonathan Pageau","text":"Well, yeah, I don't know. I don't know if that. That's a way to see it. I think that there are actually. There are two reasons. There are kind of two reasons for the veil. One has to do with hierarchy. If you read the actual text, if you read St. Paul, when he talks about that a woman should be veiled because of the angels. Right?"}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":2299.68,"end":2300.16,"speaker":"Jacob Russell","text":"Yeah."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":2301.04,"end":2498.1,"speaker":"Jonathan Pageau","text":"It's like there's Paul talking about the hierarchy of principalities. He's saying that there needs to be these buffers between the different levels of reality and the danger of removing them. It creates a kind of. It can create a monstrosity. Like, if you. If you. That's a good. It's a good. It's a good. Let's say it's a good way to understand it. It's like if you remove completely the agonistasis and you open up the holy place, then what ends up happening is there's a. There's a monstrosity which appears, which is that we don't. We don't approach it with the reverence that we should. There's a profanation. We profane the higher things, or we profane things, they end up. They end up being people. Like, they end up people in advertisements talking about mindfulness and all that crap. You know, like people who say, I'm one with the universe. Right. Nonsense. It's like it ends up being a kind of profanation of something which is supposed to mean everything, but now, because it's been thrown out, it's like pearls to swine. People can say things like, I'm saved by Jesus, you know, say that. And it's like what are you talking about? It doesn't mean anything. You're not talking about reality. You're using words that are supposed to be extremely precious and extremely mysterious. And now you're saying. You're just like, saying, I'm saved by the blood of the lamb. And it's like, do you even know what you're talking about? Anyway, sorry for the rant, but that's one of the reasons why we need veils is to prevent that kind of nonsense. Right? So on the one hand, there's this idea of protecting the lower from the higher. So the woman is veiled because she's. Let's say, she represents our world. She represents, let's say, the earth. And so you have to prevent. You have to have layers between so that you don't get this throwing pearls, like, profanation where things fall. And it's like nothing means anything. But there's also another reason why women are veiled, which is the opposite, and that's why it's so fascinating, is because the woman is also the holy of holies. And so we have to. We also have to veil her from us. And that's the strangest aspect of it. It's like we also have to protect the mystery. And in the sense that as the holy of holies brings the bread to us. Right. That's also where life, like you said, life comes from the feminine. And so we need to. You need to protect that mystery. There has to be a kind of. A kind of protection for the. So when you're. When you're so a woman, in the sense that a woman is. For each man, a woman is his holy place to a certain extent, in the within this. In the strictly man wife relationship. And so there has to be. There has to be a mystery there. There has to be a protection so that in the intimacy of that you have with your wife, is something which is precious and kept just for. Just for."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":2498.26,"end":2499.38,"speaker":"Jacob Russell","text":"Just for. Yeah."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":2499.78,"end":2512.11,"speaker":"Jonathan Pageau","text":"So it's all. It's all of that that's happening at the same time. That's. That's the way. That's the way I understand it. It's a. It's a. It's a tough stuff. It's a tough thing to talk. Talk about because it's so controversial right now."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":2512.43,"end":2531.82,"speaker":"Jacob Russell","text":"Right? Yeah. Wow. You're gonna piss off a lot of feminists right now. Okay. Yeah, that's. That one's kind of really. I'm speechless. Obviously, that's kind of. Okay."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":2533.58,"end":2552.14,"speaker":"Jonathan Pageau","text":"I'll let you think about that a little bit. Yeah, that's the way that. That's the. That's also the thing about the feminine, which is. Which is difficult for people to understand is. Is how it. It's like how a wife is the glory of her husband."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":2553.26,"end":2554.14,"speaker":"Jacob Russell","text":"Right, right."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":2554.54,"end":2568.3,"speaker":"Jonathan Pageau","text":"And so what does that mean? Man, that's some intense language. There's the feminine. The feminine is kind of like the separation of the waters, where you have the waters below and the waters above."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":2569.18,"end":2569.58,"speaker":"Jacob Russell","text":"Right."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":2569.66,"end":2585.66,"speaker":"Jonathan Pageau","text":"Both feminine. You can understand it that way. You could unnecessarily. There's a way in which you can understand the waters above as being. As being masculine, but there's a way also where it's also. Also this thing that surrounds it."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":2586.55,"end":2591.51,"speaker":"Jacob Russell","text":"Right, okay. Yeah. Wow."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":2591.51,"end":2596.79,"speaker":"Jonathan Pageau","text":"Sorry to freak you out there. I didn't think he was gonna say stuff like that."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":2597.67,"end":2606.47,"speaker":"Jacob Russell","text":"Like. Yeah. Really? Yeah. Okay. That's really torn for me. Okay. So I don't even know where to go from there."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":2606.47,"end":2608.07,"speaker":"Jonathan Pageau","text":"Yeah, Sorry, man."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":2608.79,"end":2614.62,"speaker":"Jacob Russell","text":"No, it's good. It's good, because now. Yeah, this is gonna give me something to really, really chew on for a while."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":2614.78,"end":2665.32,"speaker":"Jonathan Pageau","text":"Well, that's why, you know, if you look at a lot of. If you look at, for example, at the Middle Ages, at the European Middle Ages, okay. If you look at the manner in which knights spoke of the lady, right? And the idea of. Of the veneration that they had towards the Mother of God, but also the veneration that they had towards their lady in general, right? And when you see that, that's when you can understand this holy. Of holy aspect of the feminine, where they. They venerate the feminine as the sacred place. And so. And so the veil that the woman wears is. Is a kind of. Is a kind of hiding of that mystery of the mystery of the holy place from the onlooker."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":2665.32,"end":2666.72,"speaker":"Jacob Russell","text":"From. From. Right, right."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":2666.72,"end":2726.77,"speaker":"Jonathan Pageau","text":"From those that are outside of the mystery, right? And so in that. In that sense, you can really see that. You can really understand it, especially in courtly love. In the courtly love symbolism, you can really see that that's what it's about. It's all about this. This idea. And the masculine even more so. And so it's like the knight had a very, very strong veneration of the Mother of God more than anybody else. The Templars, for example, you know, like, if you read some of the writings, they were extremely dedicated to Our lady because it's also, like I said, it's also about this, you know, as the masculine figure venerating this holy place. Like I said in St. Paul, it's also presented the other Way where it's also this lower, the lower aspect of reality which needs buffers in between it in order to not, let's say, create the thing that you see in Genesis."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":2726.77,"end":2728.17,"speaker":"Jacob Russell","text":"Where it says the Nephilim."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":2728.33,"end":2753.61,"speaker":"Jonathan Pageau","text":"Yeah, the idea of the sons of God going into the daughters of men. You get this like thing above which goes straight to the thing below without going through the normal level. Then you get a monster. And you can understand it in so many ways. You can understand it in the 20th century when we had exactly that problem where let's say in the, in the Middle Ages again you would have a king, but nobody ever saw the king."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":2754.25,"end":2754.65,"speaker":"Jacob Russell","text":"Right?"}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":2754.73,"end":2796.81,"speaker":"Jonathan Pageau","text":"People didn't see the king. The king was in his castle. And anyways, all these people were there and the king would say something, maybe once a year you would see them. And then most of the time you interacted with your noble and your noble then would have access to the king once in a while. So it was like a normal hierarchy where things came down the hierarchy. But. And that was how government works. That's how the army works. That's how all of this stuff works. But then in the 20th century, we created this situation with technology, with all this stuff where it's like you could have Hitler and you could have a hundred thousand people standing in front of him and he would directly speak directly to the people. So you had the top of the, of the pyramid speaking to the bottom of the bottom."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":2796.81,"end":2797.21,"speaker":"Jacob Russell","text":"Right?"}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":2797.37,"end":2840.65,"speaker":"Jonathan Pageau","text":"That is what that would create this frenetic monstrosity that we saw. And it wasn't just Hitler, it was all the demagogues of the 20th century. That's the problem of the demagogue in general is like someone who wants to be the head, but then have direct access to the lower, like the masses without going through the proper channels. And almost all the revolutions happen that way. Did exactly that. Like, instead of going through the normal. Instead of going through the normal methods of the Senate and all their laws, that he went straight to the people and started speaking directly to the people. That's how you cause a revolution."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":2842.41,"end":2855.77,"speaker":"Jacob Russell","text":"And you can actually see this in the language that many Protestants speak where they're like, they don't need the saints, they don't need the theotokos, they have direct access to Jesus. Right. Is it something like that?"}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":2856.25,"end":2860.57,"speaker":"Jonathan Pageau","text":"What? Direct access, easy indirects access to God even exist?"}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":2860.57,"end":2861.29,"speaker":"Jacob Russell","text":"Right, right."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":2861.37,"end":2867.61,"speaker":"Jonathan Pageau","text":"It's me and God, you know, it's like God and God is telling me what to do. And so. Yeah. And I mean, obviously."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":2868.73,"end":2915.2,"speaker":"Jacob Russell","text":"Yeah, yeah, I know. I don't want to get you going down there. It's fascinating. Okay, so that. That makes sense. The Protestant world really fascinates me anyway. I was only in it for such a. Such a short time, you know, but it's looking. Now that I've been away from it for so long, looking at it, how much it's. It's everywhere. And it's just. It's just like. Well, I mean, just the way it's set up, you know, the people are looking at whoever's talking to them. You know, it's all just facing each other. It's like that's no different than anything else now. It's no different than a business meeting or a concert. So. Yeah. So anyway, that was a bit of a tangent. Okay."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":2915.44,"end":2920.32,"speaker":"Jonathan Pageau","text":"Hopefully. But I'm hoping that that might help to understand the question of the veil or the question."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":2920.56,"end":2920.88,"speaker":"Jacob Russell","text":"Yeah."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":2920.88,"end":2945.46,"speaker":"Jonathan Pageau","text":"That veils are so important. I mean, it's so important to understand even if we don't, you know, Even if we don't. Most people don't wear veils today, but like, to understand the importance of veils in the sense of this. The importance of a hierarchy, having levels and having different transitions between all the different levels. Because if you don't, then. Then that's when you get. Yeah, you have problems."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":2945.46,"end":2970.09,"speaker":"Jacob Russell","text":"That's. That's. And that's the. I mean, that's. I was just thinking of the house. Like, that's what the house is too. The house is just a series of veils between every room. You know, and as you go deeper and deeper into the house, you know, I think you're. Yeah. You were even talking about that. I was like, there's a certain part where everybody's welcome on the. On the porch. Few people are let in to the living room. Not too many people are let too far past."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":2970.25,"end":2971.33,"speaker":"Jonathan Pageau","text":"Exactly that."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":2971.33,"end":2972.29,"speaker":"Jacob Russell","text":"Right. Yeah."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":2972.29,"end":2980.57,"speaker":"Jonathan Pageau","text":"And we can understand what kind of monstrosity would happen, let's say, if you brought your sex life out on the porch."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":2980.57,"end":2981.21,"speaker":"Jacob Russell","text":"I don't know."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":2981.37,"end":3010.35,"speaker":"Jonathan Pageau","text":"Right. And that, I mean, then it would be. That's what a prostitute does. Right. That's what. That's what. You know, that's the dissipation, you know, and so. So you wouldn't. Unless if you want a family, you definitely won't want that. You don't want to just go out and have sex with all the strangers. You want that. You want it to be reduced into your bedroom, which is you and your wife. That way you. You keep the mystery and you prevent this kind of monstrosity of dissipation. Which would lead. Which would be the other. Other way."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":3010.35,"end":3013.39,"speaker":"Jacob Russell","text":"Right. Okay."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":3014.91,"end":3019.39,"speaker":"Jonathan Pageau","text":"Yeah. Sex is always a good analogy in terms of. Understand reality."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":3019.71,"end":3023.43,"speaker":"Jacob Russell","text":"Yeah. Everybody understands sex. Yeah. Or at least I think they do."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":3025.83,"end":3028.31,"speaker":"Jonathan Pageau","text":"I think most of us don't totally understand it."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":3029.59,"end":3035.19,"speaker":"Jacob Russell","text":"All right. Yeah. Okay. Now, how does this relate back to the soul?"}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":3036.55,"end":3056.92,"speaker":"Jonathan Pageau","text":"Well, if you read St. Gregory of NYSE, you will see that if you read his reading of Song of Solomon, that's how he sees the relationship between God and the soul. He sees it as a sexual unit. And all the sexual language in Song of Songs is used to exemplify the way that God interacts with the soul."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":3057.24,"end":3078.22,"speaker":"Jacob Russell","text":"Right. And that's interesting because it's like the more erotic language is kind of taken out of Christianity these days. Nobody wants to talk about it, which is so interesting to me because it's like sex is everywhere, but they don't want to talk about it in how it relates to Christianity in a way, I guess. Well, you know what I mean?"}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":3078.22,"end":3136.91,"speaker":"Jonathan Pageau","text":"I mean, we are. I mean, let's say for sure the Christianity took up such an ascetic practice that a lot of the type of language that would be used in that case would probably have been reserved to monastics. You know, it's probably not everybody who would be reading St. Gregory's commentary on the Song of Solomon, but it's still there. It's still there in. It's not as. It's not obviously not like the Song of Songs, because that is extremely explicit if you read that. I mean, it's so sexually evocative, but it's still there in the idea of the bride. We still have the language of the bride. We still have the language of. The language of uniting heaven and earth. All of that is still. It's still there, but it's not. It's definitely more. It's more implicit."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":3137.15,"end":3143.23,"speaker":"Jacob Russell","text":"Right. Yeah. Okay. Okay. Wow."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":3143.31,"end":3146.67,"speaker":"Jonathan Pageau","text":"I think we did a pretty. We went around a few mysteries there."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":3146.99,"end":3149.95,"speaker":"Jacob Russell","text":"Yeah. Yeah. What else we need to solve next week?"}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":3152.11,"end":3171.27,"speaker":"Jonathan Pageau","text":"All right, well, what I'm going to do is I'm going to put. I'm going to put a link to the Facebook group below. People can come in and join in if they want, but obviously there are. There are some moderators and there won't. Like, I don't think. I mean, I don't know how strict you are, but obviously, no things that go overboard get."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":3172.31,"end":3198.13,"speaker":"Jacob Russell","text":"If you just spend. If you just. Honestly, whenever you first get into the group and you just look at some of the posts, you can see how people are reacting to Each other. And I've kind of updated and put some rules there, you know, just like, you know, come on, don't be an idiot. I mean, it's actually. It's okay to be an idiot. Just don't be a jerk. Yeah, really. And even. That's even kind of like, it's because there's. There's two monitors and there's me and another guy, Bradley."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":3198.13,"end":3198.49,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":3198.49,"end":3205.85,"speaker":"Jacob Russell","text":"And it's like we were talking. I think we were talking about this. Like, he's definitely the right hand, and I'm definitely the left hand. So he's laying down."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":3205.85,"end":3206.81,"speaker":"Jonathan Pageau","text":"He's laying down."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":3207.53,"end":3214.96,"speaker":"Jacob Russell","text":"Bradley, Will. Bradley, Will, drop the hammer, you know, and I'll kind of be like, oh, well, you know, let's just. Let's see what else this guy has to say. Yeah, that's good."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":3214.96,"end":3216.52,"speaker":"Jonathan Pageau","text":"We need the good cop, bad cop."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":3216.52,"end":3236.28,"speaker":"Jacob Russell","text":"Thing going on in the. So. But it's good. And like. Yeah, and it's. If. If you. If no one's been in there, it's. It really is. And most. A lot of people have said this. It's a nice place to go and explore ideas without, you know. The best word I can think of is autistic behavior."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":3236.52,"end":3236.88,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":3236.88,"end":3237.24,"speaker":"Jacob Russell","text":"Yeah."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":3237.4,"end":3256.12,"speaker":"Jonathan Pageau","text":"And one of the things I've noticed, too, is that even though I would say probably, there's. Probably the majority are Christian or identify as at least sympathetic, but it's not everybody. There's. I saw there's Jews. There are people from. I think there may be even Muslims and just a lot of agnostics and stuff."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":3256.36,"end":3291.73,"speaker":"Jacob Russell","text":"Yeah, I think there's a. Pretty good, like, the majority of people in there, if you put them into groups. The largest group is probably Orthodox, but barely. And then Catholics and then Protestants, but it's hard to figure out the Protestant because everybody kind of is their own different version of Protestants. But. Yeah, but there's. As far as I can tell, we've done a few polls and, yeah, we have everything. Everybody's in there in some aspect. Everything is in there."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":3291.89,"end":3294.09,"speaker":"Jonathan Pageau","text":"Everything is there. It's a little cosmos there."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":3294.09,"end":3295.97,"speaker":"Jacob Russell","text":"It's a little cosmos. Yeah, it kind of is."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":3297.41,"end":3299.47,"speaker":"Jonathan Pageau","text":"All right, well, it was great to talk to you again."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":3299.55,"end":3300.27,"speaker":"Jacob Russell","text":"Yeah, you too."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":3301.07,"end":3302.27,"speaker":"Jonathan Pageau","text":"And we'll stay in touch."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":3302.59,"end":3303.79,"speaker":"Jacob Russell","text":"Okay. Yeah."}
{"episode_id":"SW - #085 - 2020-01-01 - Jacob Russel - Nephilim, Veils and Why the Soul is Portrayed as Feminine","start":3305.39,"end":3370.3,"speaker":"Announcer","text":"I hope you enjoyed this episode of the Symbolic World. The Symbolic World is edited by Justin Ward, and it is based on a series of videos that you can find on my YouTube channel, Jonathan Pageau's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the symbolic world within the zombie invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course, leaving a review on itunes. Everybody knows that's the best way to get the podcast out there to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon Pageau videos as well, and on subscribestar. All those links you can find on my website or in the show description. So thank you and I will see you soon."}
