{"episode_id":"SW - #120 - 2020-10-16 - September Q&A","start":13.2,"end":6285.39,"speaker":"Jonathan Pageau","text":"This is Jonathan Peugeot. Welcome to the symbolic world. Hope everybody is doing well tonight. I have to admit I am pretty livid right now. I just found out that we are being put back into lockdown and it's effective in two days. We are being told that this is. We're now in a red zone and so they're putting everybody back on lockdown. No, no public places open. No private meetings. Not allowed to invite anybody to your house. Not allow. Allowed to go to anybody's house. And so, ah, man, I'm just really, really, really annoyed. And so we are a population of 8 million people in Quebec and right now there today, two people died of coronavirus. It's usually people that are over in their 80s. Every day there's like less than five, two, three people are dying. And so I don't. And so they're, they're shutting down everything again. And I don't totally understand. They say their purpose is to get rid of the virus. So I don't understand. I'm really, really confused. Anyway, so I'm not going to dwell on this for too much. Let's just say that my answers might be a little spicier than usual tonight because, man, I'm just, I'm just tired of this stuff. And so. All right, so I didn't want, I don't want to get political with you guys, but just very, very annoyed. All right. And so, as you know, people who are subscribed on Patreon or on my website or on subscribestar, people who are, who are above the is it 10, $10 limit, they're allowed to ask questions in advance for the Q and A. And so I'm going to go through the questions and if there's time left at the end, then I will also kind of go through the super chats if there are some. Usually I get through everything, but now every month there's more and more questions. So. So it's getting harder to kind of get through everything. And so I want to announce. So this month, I just want to tell you guys, this month I'm still going to put out the Patron Only video in the next few days and I'm probably going to go into. Well, not probably. It's pretty sure by now I'm going to start to do maybe one or maybe two videos on Sir Gaywin, Sir Gawain and the Green Knight. I know a lot of people have been asking me to go into that story and so I'm pretty excited to, to do that. Hopefully that's going to Be some fun. There's a lot of interesting stuff to talk about. There's too much to talk about in that story. And so it's going to be hard to be succinct, you know, and I'm gonna. I'm gonna keep, like. I'm probably gonna keep the more advanced and more kind of heavy interpretations for Patron Only videos, because I did. I recently did like a pretty intensive interpretation of a. Of a Fairy Tale of Yvonne and the Gray Wolf on the channel. And it didn't get that many views because I don't think it's for everybody. All right, but you guys who watch the Q A, usually you like. You like a more kind of intensive stuff. Stuff. That's my impression, at least. All right, so here we go. So I'm going to start on my website on Symbolic World. And the first question is from Josh the Mover. So the phenomenon of people chanting I can't breathe coinciding with the wearing of mask is particularly alarming. Breath is the most fundamental and seminal aspect of physical life. It seems if we are at a societal loss for breath, that perhaps we are just about to hit some kind of dead end. Where is there left to go? Things have been relatively predictable for the last few years, but it seems like that predictability has come to an end. Is there something beyond breath? Obviously, we Christians believe in spiritual realities beyond physical breath. But how does this translate into a symbolic societal level? Hope or doom? So it's not that complicated. The idea is that this idea of I can't breathe, whether it's from one side in terms of the mask, whether it's from the other in terms of the perception of oppression from the system. And the other one being oppression as well, but as well, one related to racism, the other related to the coronavirus. It has to do with a flood, it has to do with drowning. And so it has to do with this descent into the waters. As society breaks down, one of the impressions is that. That we can't breathe. And so we kind of. Society breaks down. And so, you know, there's a relationship also with the anonymization, the anonymity which comes with wearing the face masks. I've talked about that before, how it is a breakdown of identity as well, a breakdown of communion and a breakdown of identity. All these things are kind of happening at the same time. And the image of I can't breathe means I don't have access to heaven, I don't have access to spirit, I don't have access to that which is above. And so we kind of fall down and we start to fragment below. So. Hi, Jonathan, can you go into the symbolism of the muse? Is this an example of the feminine framing the question? I don't know if I would say it's the idea of framing the question. It has to do with. It has to do with an inspiration in the sense of. Because the thing about. About the Muse is that what she does is she connects the divine, the. The patterns with reality. And so that is something. It's kind of like a birthing or a. And so it's not just about the pure patterns, because the muse won't give you the pure patterns. Right. The muse. What. What the muse will do is give you inspiration to write something or to make music or to create something, because it's that it's kind of like you are uniting yourself with the muse and it's creating this. It's creating a new body, a new creation. Right. It. It's kind of a union with a, you know, this vision of the feminine which will then create a new work of art. So it mostly has to do with that. It has mostly has to do with the idea of uniting yourself with something to create a productive new life or productive new body. And so CS Stritzel asked two questions, but I'm only going to answer one question per person just because it's too many. So C.S. stritchell asks, I believe both you and your brother have referenced Abram later, Abraham being in a place where everything is corrupt. Egypt, if I recall correctly, you both discussed Abraham's inverted or bad actions, these inverted hierarchies, as being justified or accepted, because if he acted otherwise, it would actually cause him to be highlighted or targeted. This story reminds me of Viktor Frankl's book, Man's Search for Meaning, where he states that no one who survived the concentration camps was good or noble because one became corrupted just to survive there. All the good and noble people were the first to die. Can you. Can you expand on this theme? How it relates to our current social, political situation and how we as individuals should conduct ourselves in an inverted time and place? I feel that I may be taking the wrong meaning from these stories, and I would appreciate any clarification you can offer. And so it mostly has to do with the idea of not acting straight. And so it doesn't necessarily have to be morally corrupt because obviously it's dangerous to act in. In, let's say, in corrupt ways or in kind of ways that are against your own values or whatever. But there are ways to not you, when you are the foreigner, like when you are the foreigner, when you are not in your homeland, it is very difficult to, to act straight because you don't have access to the center, you don't have access to the ident. So you kind of have to act. You have to act, let's say in a circular manner or kind of on the, on the outskirts. And so, and so in terms of how to apply it to our life today, it. Most of it would have to, would be something like you have to be cautious. You also have to, you, you have to not necessarily trust when you're in a new place that you don't know anybody. You have to, when you're going to do it normally, you're going to be cautious, you're going to be attentive. You're not necessarily going to engage in the same way you would if you were among friends or if you were in your house or if you were in your church or something like that. So there's something about that in there. But there's also something about the idea that, you know, I talk about this where, when the world is, let's say right now, so when the world is upside down, even acting straight looks crooked to the world. And so, you know, if everybody is corrupt around you, if you try to be, if you try to be straight, it's going to look crooked for people that are there. And you see it right now in terms of, you know, the idea, let's say the idea that in our world right now, the idea of getting married and having children can be seen by some people as being evil, as being a horrible thing that you're doing for the environment, a horrible thing you're doing for overpopulation. And so in that sense, to act normally, to act in a straight and normal manner, which is uniting yourself with someone, man and woman, and having a family, you know, a large family is, is you acting crooked in a world that's crooked. But you're not, You're. You end up acting straight. And so I think that that's probably in turn in, in terms of our, in terms of how to act or how to behave. I think that's probably the best thing to get out of that because. But it is important to understand in stories why it happens that way. Because like, for example, when we talk about Sir Gawain and the Green Knight, I'm going to show you how this is exactly what happens to Gawain when he is out in the land of the Green Knight. He ends up acting upside down where he is a prey, right? Usually he's the knight, he's the one combating, he's the one wooing, he's the one attacking. But now in this world, in this, when he's in the house of the, of the foreign person, then he is being wooed and he has to be careful, you know, and he is the prey. And so anyways, we'll talk about that more in the video. But it's a good example of seeing if you, you need. It's good to understand that pattern because it, it's not always moral, but it is something about how when you're outside, when you're, when you're, when you are the foreigner, then you will see this, this pattern kind of manifesting itself. And so Isidore asks. An individual tree is a stable symbol of order. But a forest is a chaos. Where Hansel and Greta lose their way and encounter a witch, there Snow White flees and find the outcast of dwarves. The traditional forest is ancient and untamed, where the demons lurk and. And outlaws hide. Rather than being a microcosm of a forest, they are in a ways, opposites. How does this fit into a traditional worldview? And so the thing is, symbolism is multi, is multivalent. It's polyvalent. You could say things don't only have one meaning. Things can be seen through different angles. And so the idea, like you said, of a. So let's say you have a garden. And so the garden is a place where the tree acts in the man because it is tamed. And so in a garden, the tree, like in the Garden of Eden, the tree acts as this connection of heaven and earth. Whereas in the wild or in this, there's also the concept of the wild, of the untamed. Then like you said, then the trees are in a wild space. They're in an untamed space. And so they take on a different. They take on a different symbolism. But nonetheless, sometimes trees and some kind of sacred forests that have existed in the past where often where the brush at the bottom is kind of gone and the trees are really, really big. And so they create like these, you know, these domes. And you're kind of in this sparse forest. You can also have this sense that they have sacred forests and that these sacred places also have a kind of special spiritual meaning in several cultures. So it just really depends. But what's important is mostly to understand symbolism within the frame that it's being posed. And so in a story like for example, Hansel and Gretel or in Snow White, or Little Red Robin, Little Red Riding Hood, then you can understand because of the way the forest is used in the story, which aspect of the forest is being manifested? What is it? Is it the tree, tree aspect of it or is it rather kind of haphazard, wild aspect of it? And in that case it is indeed the haphazard wildness of it. And this is true for almost all symbolism. You know, that certain things, depending, it's like an algebra, it's like a algebra, it's like a formula. And then depending on where things are in the, in the formula, they can take on different meanings. And so, you know, a good example is for example, in terms, let's say, just a simple idea of feminine and masculine. You know, I am masculine, let's say in terms of my wife, but, but I am, let's say feminine. I have a feminine place in relationship to authority, let's say, or in relationship to Christ. But those aren't confused. There's no contradiction because there are different levels of reality and they're just different places. And so it's important to kind of be able to see things in their proper place and in relation to all the other symbolic terms, to be able to really understand what the symbolism is. That's why I hate symbolism dictionaries. I really don't, I don't own one symbolism dictionary because I find them, those to be extremely superficial because they try to just say this symbolizes that. And it never works that way. So Benjamin Rva asks, it seems that a majority of modern Christians lack the grammar to defend themselves from multiculturalism without stepping outside their faith into political ideology. Is this a bug or feature of true Christianity? I have a hard time embracing a faith that currently appears incapable of mustering more arguments against what our ancestors would have understood to be invasions. And I'm concerned that Christian universalism is functioning as a social solvent in a world with global mobility. This is a stumbling block for me and I would appreciate your insights. Thank you for your work. And so I don't, let's say in a, in a traditional world, let's say in a traditional Christian world, you are allowed to have your group like you were allowed to have your nation. There was, there was not this idea that, that we need to have some kind of global one world culture or whatever. Like none of that was a traditional Christian trait. You know, in, in, you know, the Byzantine Empire, you had, you had different groups. You had the Greeks, you had the Armenians, you had the Latins, you had the, you had, at least at the beginning, you had the cops, you have all these different groups and, you know, and there was probably crossover between them, but there was also a certain sense of identity that wasn't attacked, let's say. And so there. It's normal that there will always be some. There. There's always mixture at the edge of all identities. There's always places for. For. For contact and. And exchange and mixture and all of that. But the problem that we have now that we're seeing is rather there's an active hostility, right? And so it's not just. It's not just that we notice that, yes, if there are Greeks and Armenians living in a. In a place and there's. There's going to end up always being some mixture between them, you know, but there is. There isn't. Now what we have is this idea that if you are attached to being a Greek or an Armenian, you know, that's evil. Like you're not allowed to be attached to your group, whatever that is, you know. You know, even in terms of Christianity itself, you know, that if you are too attached to your Orthodoxy or to Catholicism, then, you know, though, there's something wrong with you. Because we all need to be ecumenical and all be together. And there's this kind of idea of this universal thing, but that is. I don't think that's a traditional Christian trait at all. I think it's rather a kind of weird progressive thing that came about in the 19th and 20th century, and it led to atheism and it leads to kind of atheistic, kind of weird atheistic universalism. So, you know, that's what I thought. That's how I see it. I think that it's difficult. The conversation is so difficult today because it feels like people only see the world in extremes. They. They feel like it's either, you know, they feel like it's either that we need to just accept everything and not. And not have any attachment to. To, let's say that are the hierarchies in which we are. It's either, you know, it's either we just have to be open and everything is the same or, or. Or it's like we hold on to our identities and we create really strict borders. And that's been the 20th century, and it seems like in the 21st century, you know, we're more on the. Still on the side of the openness, but it feels like it could clamp down at any time. So. All right, all right, let's keep going. I struggle to look at the chat while I'm talking, but at least if I have it there, maybe once in a while, I can catch something in there. All right. All right, let's keep going. Where were we? Okay. All right. So David Flores, who I'm sure is going to be very happy that I'm doing it on Sir Gawain and the Green Knight, says, in your recent video on Prince Ivan, you talked about the relationship of the mount and the rider. You also discuss the firebird coming down to eat the seeds. Is the rider of principality and the mount a body when in communion, a joining of heaven and earth? Yes, indeed. That's exactly what a rider and a mount is. It is really a joining of heaven and earth. And, you know, it's like a positive joining of heaven and earth. So you can imagine, you know, that image that you see sometimes there are different versions of different traditional societies of, like, an eagle eating a snake or, you know, a bird above and something below. It's often an eagle and a snake. So it's like there's this eagle eating the snake and there's the snake attacking the eagle, let's say. So that is the. That is like the hostile relationship between heaven and earth. And the idea of the predatorial bird which comes down and picks things up is related to that predatorial idea of the writing of heaven and earth. But like, you noticed, the idea of someone riding a horse and kind of directing the horse and using the horse's power, but also caring for his animal is a very powerful image of the joining of heaven and earth. A good example of that is in the Psalms, you have this image of God riding through heavens on the back of a cherub. And so he's. The cherub is his mount, which is also represented as a chariot in Ezekiel. So the idea of the divine chariot and then, you know, God coming down and joining himself with the divine chariot or riding the divine chariot across the sky is. Is exactly this unite, this uniting of. Of the two opposites. All right, so Nash asks. He started to bear with me on this question. Hopefully I formulated in a comprehensible way. So let's see. I should tell. I should read these questions in advance to see if I can fight. Okay, so do you think that if someone like Columbus had discovered the Americas when an ancient biblical cosmology was predominant, that there would have been less of a shock at that discovery? Seems to me that world became bigger to everyone, that even the edge of the world, in a way, disappeared. It also looks like there would have been just as much confusion, though not in the same ways that is thinking that the native peoples are some of the lost tribes plus modern types. There seems to have been a scramble to figure out where the natives were mentioned in the Bible. I'm not sure what kind of reaction would have happened if this occurred before the end of the first millennia. Hope that makes sense. And so, I mean, the question is, the big question is why do you think that, that, why do you think that Columbus was. Discovered America? I don't, I don't, I don't think that. First of all, I don't think Columbus discovered America. You know, we know now that the Vikings were there before, maybe not that long before still like at least three centuries before, maybe, maybe more or less. And why do you think that there weren't people who went there before that? I don't know why people. I don't know why people don't. There are stories in the stories of the saints, for example, St. Brendan and different saints who travel west and discover, discover lands with people and stuff. So it's just interesting. There's something about the Renaissance and the Enlightenment and that period where they act as if nothing existed before them and everything they did was just, you know, was it. And so to be honest, I don't, I'm not, I wouldn't be surprised at all if, if there had been people who came to Americas in the Roman times or, or even before that. Why not? Like, I, it's insane to think that, that. Anyways, so that's one thing. And so, and so, you know, I think that one of the, one of the problems that happened in the time of Columbus and after that, one of the biggest reasons why it caused such a big stir is also because there was an expansionist desire, of course, in the way that they were doing things and the exploration was framed in economic terms, very, very strongly in economic terms and then ultimately in political terms. So I think that that's what made the biggest difference. The idea that some explorers would have gone there to North America and just talked to the people or, you know, stayed there or died there or, you know, come back with a few things, you know, is more related to the idea of, let's say Marco Polo of, of the voyager who goes out, but Columbus and the people who followed him, they. It was all done in a, in a kind of weird pseudo scientific desire to map everything, but also in economic and political terms. And that's why it had such such a big. That's why it made such a big difference, because it ended up changing the world. They invaded all those lands and so they it changed everything. So Phil asks, hi, Jonathan. I'm seeing the color purple used frequently in social media ads, sometimes related to public health COVID 19 messaging, but also in other messages that ostensibly convey safety and security. Bank government. Does purple convey a special meaning in line with this? So it depends on which purple. Like there is a. There is a purple. I don't. I would have to see the images you talk about. There are some purples that are related to kind of royalty. And we still have a memory of the purple as being an image of. Of empire and of class and something that is very important. So in that sense, it could be related to safety and security and all that. There are other forms of purple, kind of lilac purple, and those types of purple that are used mostly as a kind of fusion of blue and red and tend to be used in a way in places where they want to confuse the colors. I mean, confused in the sense that to manifest hybridization. And so purple is often used in those. In those places. All right, so Mark Sniffin asks. All right, you guys have to write shorter questions. Sorry, Mark. All right. So I've heard you use the words inevitable a few times, and I'm trying to understand how inevitable experience is or perhaps how simply to talk about inevitability. I thought a fair bit about free will versus determinism, but I feel that conversations framed that way reduce the universe and its agents to causal machines. They also pit too simplistic extremes against each other. I found that with most extremes, opposites, they need to be integrated into something that actually reflects reality. Patterns seem inherently inevitable. And how do we decide what to do when we live in and are a pattern? My instincts now is to use language like aim at being the right place, which might be the center, as opposed to trying to predetermine specific actions. Am I barking up a dead tree? And so in terms of inevitability and freedom and free will versus determinism. I think I mentioned this before. We have to get away from the idea of free choice as this idea of, let's say, ultimate free choice. The real free choice as this idea of, you know, you've got sardines or this other kind of fish, and you choose between the two. Or you, you know, you choose between this color or that color. That is not true choice or it's not primordial choice. The only, let's say like in Saint Max and the Confessor, you have this idea that the only free will you have is to choose God. Your only. Your will is only free if you choose God, if you choose. If you choose sin or if you choose your passions, then your will is not free. Then you. You. You actually become determined by the patterns of your passions. Whereas if you choose God, then you are free in the sense that you start to rise above the little patterns, right? Just like you go up a mountain and then you start to be above the particular pattern. And so you free yourself from the little patterns of death and of these cycles of passions that we kind of get into. You know what I'm talking about, right? And so that is true freedom. And so that is the way we need to understand freedom. And so freedom doesn't mean that you're free from the patterns. Freedom means that you move. You move up the mountain and you. You move towards the center. You move towards the sacred space. And in that. That's where you are free. And. And like I've said, you're never to. To. If you're free from the passions, you're a slave of God. If you're. If you're. If you're free, if you try to free yourself from God and you choose the passions, then you come a slave of passions. And so we're not. We are always in a hierarchy. And it just depends on where you want to place yourself in that hierarchy. That's inevitable. We're not completely free in the sense that we're not God. We can't create the world. We are bound by the possible. We are bound by all these things. We can't do whatever we want because we are bound. And. And often we're not doing whatever we want. Most people who say that they're doing whatever they want are the most, are the worst slaves of their passions because it's an illusion. They're actually just following their. Their passions. All right, so ten Mooseman asks, my choir director dismissed a concern I had with scorn. I suggested that men wearing masks was a head covering and that it was not fit inside the church beneath a man's dignity. Guys are looking for fights. After watching your talk on Mask as Veils, I'm more convinced that I wasn't just being legalistic, but perhaps. What do you think? Is this a head covering not fit for Christian men in church? I've heard this is a sort of secular Sharia and it feels like a foreign ritual observance, which is not Catholic in my case or generally Christian, but pagan. Maybe as I ask you, if this is a hill we're dying on in church, would you could explain why it's not fitting of a Man's dignity to veil where it is for women. And then he says, my whole family is on board with the Jonathan Pedro inspired symbolic movement now. Thank you for all you do. So to be honest, I do not think that. I do think that in something like wearing a mask, which is not a. Can I say this, at least for now? I would say that you need to submit to your authorities and you need to follow what your spiritual authorities are telling you to do. And it doesn't mean that if you feel like the church is going in an odd direction and that following these rules are, like you said, are kind of submitting the spiritual to physical concerns completely, then I understand you. And I think it's good to be attentive to that and to be thoughtful about it, to still remain wise as a serpent. And we need to watch where this is going. To be honest, I don't think that right now, asking people to wear masks in church, at least in terms of the parishioners, I don't think that it's enough to rebel against your authorities. And so, you know, if people, if people this, for example, if a church says that from now on we're never going to have communion anymore because it's not hygienic and we can't do it, you know, then I would say that's. Those types of moments are the moments where you kind of have to ask to start looking around, you know, and seeing what's going on and maybe asking more questions and being a little more. Pushing things a little real, a little more so. And I like, like with all the lockdowns here and everything that's happened and how complicated it is, I have to be honest, you guys, I haven't been. I haven't been to church since COVID I haven't. I haven't gone back. And, and, and, and to be honest, like, to be honest, it has something to do with what you said. And maybe I'm wrong, maybe it's not okay for me to do that. But it's like I think I would struggle. I would struggle with. With wearing the mask in the church. And so until now, I've kind of avoided it, which is probably hear me giving you advice, but probably not the right advice because I don't think on the. I don't think on that in that this case that I am right. I think that I am. That I might be just avoiding the question, which it's gonna. Well, right now we're being locked down anyways now, so now it's gonna be all closed Down. So. All right, guys. It's been crazy. Okay, so Luka Ascovic asks. I have a degree in fine arts, but I sort of gave up on art even before I got my diploma. After several years of working on jobs and doing nothing art related, I'm looking to come back to art since I realized that the only thing in which I have practical knowledge in and do enjoy it when I can focus. So my problem is I'm very easily distracted to the point I don't notice that I'm focusing on my work. And I can't even dedicate an hour or two a day on drawing. And I do have free time. My mind wanders all the time when I'm by myself, and it's followed by this cluster of emotions and thoughts that I have other things to do. I'm not good enough. This is not the thing I should dedicate my life to. Do you have any advice on how to be more focused on work? What do you do to be more focused? You know, to be honest, Luca, I'm kind of like you, you know, if you noticed that, you know, my videos are not organized in categories. I don't kind of follow a thread or do a systematic teaching of something. I tend to kind of hop around. And so I have that kind of artistic disease of being distracted and also not being. How can I say this? Of sometimes struggling to find the energy to do things. And what I've done in my case is I've set up. It's different from you because I work, this is my job, so this is what I do full time. What I've done is I've set myself up in a way that I have a lot of things to do in terms of working on my videos, working on my carving on the Orthodox Arts journal, working on the symbolic world, writing, you know, also having discussions with other people, inviting people on the. Participating in other people. There's all these things that I have that I can do, and in those, I also have different things to do. And so what I tend to do, the way I do things, is, is that I have so many things to do in different spheres that when I feel like I can't concentrate on one, I often seems like I have energy to concentrate on the other. And so what I do is I try to shift my attention based on what I'm able to focus on. And then that ends up. In my case, it ends up that I'm actually able to be extremely productive because, you know, I just kind of. I just kind of. I just. I Just kind of take this and do this for a while, then go to this and do this other thing for a while and do something, do these other things. And so that's the way I do it. In your case, what I would say is, I would say to find something, okay, it depends on you. Like one of the things that I would do if I were you is I would draw when I'm doing something else. And so, for example, it depends if you're able to. It's like, for example, like we sit around the table with my kids and we kind of chat and we talk and we all sit there and we draw. And so I draw while I'm sitting with my kids and I'm talking with them and doing something else sometimes actually helps me to focus. Another thing I do is I listen to podcasts. So while I'm carving, I listen to podcasts, I listen to audiobooks. And then it prevents my, my mind from wandering because I'm focusing on the podcast or on the audiobook. And then I can, then I can carve when I'm doing that, I can carve like all day if I'm listening to, to, to different things because then I don't tend to, I don't tend to wander. And so that's something I can suggest doing. You could read the scripture, you can listen to scripture readings, you can listen to. You know, just like in monasteries, that's what they do during lunch in order to prevent people from minds from wandering and to kind of also vain conversation. They tend to read the text from, from scripture or from, or from the church fathers. So Masar, Sorry. So Eddie T. Asks, why are abstract concepts like liberty, justice and wisdom personified as female? I would have to think about that. I don't know. I don't know. I don't know why the, the modern. These are all modern personifications, you know, these are all kind of enlightenment personifications. And so I don't really know why all the enlightenment goddesses are all women for some reason. I never really thought about that to think about it. All right, so Messar asks in your recent talk about angels and demons, I'm wondering if angels are capable of possessing someone as demons are. Can an angel be incarnate in the flesh as the Logos was? What is the meaning of Socrates's demon? Was it benevolent? Is not Greek stoic idea of the universal Logos not based in part on this demon? Is this a pre figuration of Christ? And so no, angels should. You should. Angels should not possess you because that notion Of, Of. You wouldn't call it the same thing as possessing, right? You wouldn't call it the same thing as possessing, because possessing it means it has something to do with obsession. And so when you're possessed by a demon, there's also an obsession which comes with it, a type of acting, you know, despite yourself, you know, giving into your passions. It can be as, as subtle as, you know, a passion like pride or lust or whatever, but it can be as immediate as someone who is, you know, trying to scratch their eyes out or trying to pull their hair out or acting in a manner which is actually physically damaging to the person. And so that is what the idea of possession looks like. Now this is. This, this. So I, I believe that you can manifest higher principalities that. And this is not done in a way that is a possession, but rather it's the idea, let's say a good way to understand it would be to imagine that if you are a warrior, for example, let's say you're a soldier and you have a patron saint, or you have. St. Michael is your patron, I think that it is possible that you would manifest the strength of St. Michael, right? That you could manifest some aspects of a higher principality, but it would not appear to you as a, as a possession, because it wouldn't be something that would, that would kind of take over and, and, and overwhelm your, your will, but rather it would be a lifting up of yourself and you would feel in a way maybe like you're even more yourself as you are manifesting the virtues of these saints or of the, of the, of the angels. And so maybe that's a good way to understand it. Now, in terms of Socrates's demon, I think that really here you really do have to imagine Socrates's demon, maybe something more like a. Something like, you know, the angel and the demon that you see on the shoulders in the cartoons. I think that it has something to do with that and that it has something to do with rather with the idea of his higher self or like you said, something like the aspect of himself which is connected to something higher. And so he would have access to that. He could in certain guises, kind of like someone who is praying or someone who's meditating could have access to some higher aspect of himself and that then he would, it would bring wisdom in him like it would manifest wisdom. And so I think that that's. I think that that's possible. And I, like you said, I, I don't necessarily think that Socrates's demon is the same thing that we talk about when we talk about demons, because I definitely don't see Socrates as being taken over or overpowered by. By some behavior or passion or something. So. All right, so we are done with the Symbolic World. I just also want to remind you guys that there are a lot of amazing articles getting published on the Symbolic World blog today. There's this wonderful article which was published on a Georgian kind of festival ritual and I forget the name of the person who wrote it, which is horrible, horrible. Let me find it quickly just because it was really great. Okay. And so it's by Daniel Padronos and it's called the Symbolism of the Supra. Really great article. Going through the ritual and then showing how it is really is this manifestation, this union of heaven and earth, even using some of the patterns that Matthieu uses in his book Language of Creation. And so it's really great. There's Nicholas Kotar wrote a great article recently as well, called the Constellation of Fantasy. And so I'm just. I'm just really excited to see all this stuff that's going on. So I'm really encouraging everybody to get involved and to read, write comments, get involved in the discussion. All right, so here we go. So going to subscribestar. So Dorothy K.K. asks. Hi, Jonathan, When I read the Bible, When I read the Bible and get to a verse or some other part that really speaks to me, I recognize it as an advice or a warning for my personal life, is this some form of mapping the pattern onto my life or am I just seeing something that isn't there? Can a pattern always be mapped to the personal life or just sometimes? No. The Bible, the traditional way, like even the traditional Western medieval way of understanding the Bible, is that it. It has interpretations at different levels and it has a metaphysical interpretation, it has a kind of theological interpretation. There's a more social interpretation, and then there's also a personal interpretation. And so yes, there is room for the Bible to manifest itself at the personal level. You know, I would say that to be careful with that a little bit. I would say that if you're in a church that you should always read your Bible, let's say, within the authority of the church. And, you know, the best would be to have someone who can kind of guide you, to kind of guide you in that as well. To be. To be sure, to be careful not to fall into kind of prelest a kind of idea that spiritual pride, you could say, where you feel like God is talking to you through the Bible and that you know, you need to do this or that. God is showing me to do this or that God can show you to do things. But there is a danger going down that road where people kind of get carried away and can kind of end up blindly following their own disillusions, thinking they are following God. So it's better to have people that you can ask advice from. Hi, Jonathan, what would you say to someone who insists that God could have created the world without evil because God can do anything? I think you may have talked about, talked a little about this before, but I would appreciate any more you could say on it. Okay, I should laugh because it's like it's, you know, it's the problem of evil and the problem, suffering is the biggest problem in terms of theology. But I would say that God could not have created a world that was truly, that was truly fully one and many, that really had this relationship of the one and the many without the possibility of evil. Because you can't have many without the possibility of fragmentation. Because if, if God would just impose himself, his goodness down into everything in a way that doesn't leave room for things to have autonomous existed existence or real existence within God, then. Then what is it? Then it's, it's not, it's not, does it, it's not actual existence. So for something to actually exist, there has to be in it the possibility of multiplicity and therefore the possibility of fragmentation. If it doesn't stay united to that which is its origin, that's as good as it's going to get for me. But you know, it is, it is a difficult question in the. The problem of evil and the problem of suffering. So what is the importance of St. John? Okay, so Nicola asked, what is the importance of St. John the Baptist? We have had other prophets announcing the coming of Christ. Why is it important for Christ to have a prophet announcing him as he is entering the stage, so to say? And so in the sense. And St. John the Baptist really is very important because he's also not just a prophet who's announcing Christ. You know, there aren't a lot of stories about him in scripture, but he's presented at least by Christ as the last prophet, as the ultimate prophet, as the culmination of the prophetic tradition. And so in a way, he is a condensation of the prophetic tradition. And then you can imagine, like he's not an incarnation, but he's like a condensation of the whole prophetic tradition into one character. And then that character is pointing to Christ. And is saying, there he is. Right? And so that is the. That is the importance of St. John the Baptist. And also because there is this idea that before the Messiah comes, Elijah comes to clear the way. Elijah comes to level the road, you know, and so St. John the Baptist has a. You could call it like a kind of destructive character. Not in a bad sense, but in the sense of, you know, he calls out the king, calls out hypocrisy. He tells people to repent. He's trying to break down the corrupt system. So Christ, actually, Christ doesn't have that as much. Right. Christ is trying to save the lost sheep, but he doesn't spend his time attacking, especially not the political authority. Christ does criticize the spiritual authority, but he doesn't criticize the political authority in the way that St. John the Baptist does. And so I would say that that's the importance of St. John. All right. And so. All right, let's move on to Patreon. Patreon always has the most questions. See, this is how. This is how much I can do with the chat, is just look there and see if there's people I know in there. All right, so. Okay, so here we go. So Paul Dumal at Masla. I don't know if you're pronouncing your name right. Paul. Paul Dumasla says, hi, Jonathan, could you please elaborate on the fact that Christians do not go to heaven? Does this misconception come from misguided materialist reading of Dante's Divine Comedy? Thank you for your work. So, yeah, so there. There is a way in which. So the best way to understand it is that there is a way in which Christians go to heaven in the sense that there is this ascension, right? This ascension towards that which is above always this going up the mountain, you know, ascending the divine ladder. And. And so you can see in all that imagery, this idea of ascending has to do with the notion of going to heaven. But the problem with. When I say Christians don't go to heaven, it mostly has to do with this idea that people think that you die and you go to heaven. You don't die and go to heaven. You could say that you're trying. You're reaching towards heaven. Your whole life, you're reaching towards heaven, your whole existence, you're ascending the hierarchy, the spiritual hierarchy of virtues, your whole existence. And so the idea of dying and going to heaven, that's not the. That's not how it works, right? It doesn't work. Not because you die, that you go to heaven, going to Heaven is a transformation of the person, this ascension of the person up the, the, the, the levels of the spiritual hierarchy. That's what going to heaven is. And so in terms of eschatology, in terms of what happens after you die, there's rather the idea of the resurrection as the final result of the totality. So there's this idea that nothing is lost, right? Nothing is lost in the world. Consciousness, the pattern of consciousness is something which exists beyond your current body. And that there is a manner in which that pattern is, is going to exist in the totality of things, and that includes a form of bodily existence. Now, I don't know what that is. I, I don't want to speculate on what that means, but it's rather understanding that, that patterns. For patterns to really exist, they need to have a body. There. There are no pure patterns. You know, the pure patterns is. The only pure pattern is the divine Logos. And the divine Logos manifested himself in the flesh, and his. The, and his body is the communion of the saints. So you could understand that that creation, you know, ultimately all of creation becomes something like the, the body of the divine Logos, something like that. And so things exist in, in, in bodies, not necessarily physical bodies all the time, but it could be subtle bodies as well. That's a whole other question. I keep promising you that I'm going to talk about subtle bodies, but I need to find the right ways to talk about it so it doesn't sound like I'm just spouting gibberish. All right, so Kyle Reddy's asks, I am an artist who's being pulled into the beauty and wonder of iconography. Any suggestions to someone that is new to painting icons, how to keep it traditional but alive in the present? Any current past iconographers to study? Thank you. God bless. And so I think the best way to, the best way to connect to iconography is to find teachers. It is possible to learn iconography on your own, but it's probably best not to. It's also probably best, if you're going to study iconography, to do it within the confines of the church, because this is, it's a traditional art that is part of a bigger set of relationships. You know, I've talked about this before, where icons don't exist in a vacuum. Icons are related to the church architecture, are related to the processions, are related to the liturgy. They're not, they're not isolated in terms of their, in terms of their existence. That's probably best. But, you know, it is possible also to, if you Want to. If you want to kind of start out and, and, and try to see what you can learn on your own, there are some books that you can look at. Aiden Hart's book, what is it called? Techniques of Icon and Wall Painting, I think it's called. Sorry if I get it wrong, but that Aiden. Aiden Hart's technical book is really amazing. It has everything in it you need to know in terms of. Of studying iconography, the. The practice. There are also people online who are giving some drawing classes. And so. Yeah, so you can, you can look at that on. On. I forget her name. I'm horrible with names. If she knows that I forgot her name, she's gonna. Very angry with me. There is an iconographer on Patreon who's doing kind of weekly classes on drawing, and so she films herself drawing. And that can be helpful to learn to draw. At least learn to draw from the inside. Okay, so Ari Fisher asks. Hi, Jonathan. So you've just about gone and fully evangelized me. And I'm currently wrestling with the decision between Catholicism and Orthodoxy in many ways. I myself do not actually care about it so much, but a lot of the debate between the two seems to revolve around the papacy. I'd like to hear your thoughts on the legitimacy of the papacy. It seems to line up with the pattern of hierarchy. And seeing as you're a confessed monarchist, I wouldn't necessarily guess that you've had a problem with concentrating all the authority in one person. But maybe it's different with the Church. In most areas, I'm more attracted to Orthodoxy, but I must admit it seems pretty effective. The Catholics have a living authority they can turn to for the final decision if need be. And it also seems to give them more unity. Thanks for everything you do. And so not everybody would have the same opinion on the Pope. I tend to think that at the outset, the notion that Rome had some kind of supremacy, let's say a kind of supremacy of autoritas in the way that the Romans understood it. And so the Romans understood a torritas and potestas as different. There was this idea that authority is a kind of informal influence you get from being the. The superior, like the older brother or something like that. Right. The older brother has more authoritas. And so because he's the older brother, he, he. We look to him. We look to the elder, we look to the. To the, to the person who is there, who's, like I said, the eldest, to kind of help us out, to maybe sometimes arbitrate some things or whatever. And that's the way the Orthodox perceived the, the function of the Pope. And so the Roman Pope was kind of like an older brother, someone that could arbiter, let's say disagreements, someone people look to. But he didn't have potestas. He didn't have legal capacity to manage all the local churches. And I think that that's mostly in terms of papacy, where the, the Orthodox Church disagrees completely that the, the Pope can't decide the bishop of a local place. You know, that all the churches have their own independence. To a certain extent. Each bishop is the head of a local church. And you know, and some bishops are more, let's say, important in terms of their influence, but they don't have legal authority, like even for Orthodox, you know, the Patriarch of Constantinople. If the Patriarch of Constantinople tries to decide who my priest is at my parish, no one's going to listen to him. He doesn't have that capacity to reach down and influence all the way down. So I think that that's one of the biggest problems people have in terms of the papacy. And also there's some things like obviously the idea that the Pope is, is infallible in certain situations. I think that is, that can be problematic if, if it's abused. Yeah, the Orthodox Church tend to see collegiality as the, the source of, of truth in the church, that is that there's a communion and collegiality and that manifests the, the, the reality of something. All right, so Christian Sakura asks. I've watched the God's Angel Demons podcast and enjoyed hearing about the Token Lewis attempt to work higher order beings into their writing. Have you ever read or heard of C.S. lewis's space trilogy? Sure, you've got plenty of reading recommendations, but I think they're the, his best attempt at describing principalities and they, they seem to go mostly unnoticed. You know, I really, I've tried to read those I read, but it was a very long time ago. I read the first book and I remember kind of liking it and then I started reading the second book and I, I just kind of fell off and so maybe it's time for me to look at, you know, I don't read enough CS Lewis. So, you know, I keep telling myself, okay, I'm one day I'm going to do an audiobook binge of C.S. lewis's book. But it hasn't happened yet, so. But yeah, sure, I mean, I'd be happy to read it at some point. All right, so AJ Del Toro asks my question is on a topic you've already discussed. The literal versus symbolic meaning. I have to admit I'm still having a hard time while reading the Old Testament because I think, I'll think, did this actually happen? For example, did the Israelites actually escape Egypt or no? That said, I've tried to summarize your view as best as possible as I understand it. Can you let me know if I'm close? Deepest reality consists of patterns and the best way for us to grasp these is through stories and symbols. Therefore, even if something in the Old Testament didn't actually happen in the most literal way, the specific way that event has been remembered and handed down may still convey truth about this deepest reality. A. I think it's just interesting. I think that we really, I think that I just a don't think like you. I just don't think that way. I don't, I don't have the same categories. And, and I, I, I understand that this can be frustrating for people. We don't have the past. You don't have it. It's not there. It's, it's the only place where the past is, is in the present. The, the past doesn't, doesn't exist anymore. It exists as memory. And so I don't understand like, I don't understand the, the pain you have in asking yourself whether or not the Israelites escaped Egypt thousands of years ago. Like I just don't understand that pain that you have. For me, that is a totally non existent pain. And so something like that, that is something like did the Israelites actually escape Egypt or no. Is almost impossible to prove or disprove using historical methods. It's so long ago it, and so I don't, it's like I just don't have the same categories. So my answer to that is yes, it did happen and let's just move on. Does it describe the events the way that modern historians would describe the events? The answer is no, it doesn't. But the way that modern historians describe events is also maybe not the standard by which we should describe events. And so I think that maybe the problem you have is rather that you're, you're holding on to a way of describing that is maybe even non existent. Like anyways, I, I, I don't, I struggle. I, I made, I'm sorry, I know I'm, I'm disappointing a bunch of people when I kind of answer this way, but this is really the, this is really how I, I view, I view the world. I really don't. And, and you Know what? Like, ask me. Also, like, ask me. Did, did the Trojans, did the, did the Greeks invade Troy? And my answer is going to be yes, too. It's going to be yes. The tro. The, The Greeks invaded Troy. And, and, and that doesn't, I don't have any qualms about saying that because that's the, that's the story that our ancestors told. And that story is, is more true than any statuette that they find in the desert. Because that statuette is going to be unproven or reproven or dis. Or, or something else is going to pop up. You know, all scientific truths, all historical and scientific truth have a, A, a kind of expiration date on them, you know, because they get, they get upended by some other, like, thing that they find in the desert or, or some reinterpretation of how things were. You know, it's like, when did Rome fall? And then people are going to start to, to argue. So I don't know. I just don't. I just don't. I just don't. Sorry, man. I hope. I know I'm disappointing you, but that's just how it is for me. So, Sander Cuter asks, hopefully some stability has returned to your home. Now, how did your children manage their new school environment? Thanks for your love, man. Now they're locking us down again and our house is not finished and they're locking down. All businesses are going to be locked down to 25% capacity. And so I don't see we're going to be there before Christmas now because there are already massive delays for everything. We were using to fix up the house in terms of redoing the floor, in terms of. It's just been crazy trying to find people to do stuff. And so now that we've heard today that we're being locked down again, I don't know when we're going to go back, but, but how are my children managing the new school environment? I would say that pretty well. In fact, they're doing quite well. And yeah, that's been pretty positive. Of course, it depends. Like, my son is pretty keen on recognizing propaganda, so he sometimes comes home and says, do you know what they said at school today? Can you believe what they said? And I'm like, yeah, we told you it's going to be like that. You just have to stay, keep your eyes open and be attentive. See, with my younger one, she's, she's younger, so I don't know how that's going to go. We'll see. They might close the schools anyway, so it would just all be homeschool again. All right, so Vic Serta asks. Hey, Jonathan, hope all is going well. My question is, what is the meaning of the staff of Moses turning into a serpent and eating the opposite opposing serpents of Pharaoh's magicians? Heard you say that the staff of Moses is related to the cross of Christ, but how does it come into play here? And so if you understand it. So using the cross of Christ is probably the best way, the best way to understand this staff of Moses doing what it's doing, you know, and the staff of Moses, okay, so the staff of Moses turning into a serpent and eating the Pharaoh's magician serpents is the same story as, as Moses putting a serpent up on the staff. And then people who look to that serpent are healed from the serpents below that are biting them. Okay, so those two stories are completely analogous to each other. To each other. They're almost the same story. Okay? And so, so the way to understand it, is it related to this idea of turning the death against death? Is. And so you have a situation where there is this, the staff of Moses, there are these serpents attacking. Say you have Moses and you have the serpents attacking, and the staff becomes a serpent and kills the other serpents and then becomes a staff again. And so you can imagine Christ is the king, is the divine. Logos, is the highest thing ever. He comes down, he becomes death, he becomes sin in order to defeat sin and in order to defeat death. And so that is the, this idea that I always talk about of this flip, this turning of death against, against death, the transformation of death into glory. All these things are related to this notion. And so you can understand it as a, you can understand it as the, the serpents, you know, or the, the serpent as a circle, you know, or the periphery as a circle. And so you, you, you have to understand the circle also as having two extremes, one which is lower and one which is higher. In Bible, it's represented as the dividing of the waters. So there's the waters above and the waters below. And there is a way, and this is the mysterious idea of the incarnation. It's the mystery of the fall. It's the mystery of redemption, it's the mystery of resurrection. There's a way in which the lower waters can be flipped and transformed into the higher waters. There's a way in which death can be flipped and transformed into, into glory. And so, yeah, that's as good as it's gonna get. All right. So J. J asked. Hello, Jonathan. My question is, what is a symbolic view of humor? And, and how does it relate to play theory or the other theories? I did a video on that. You might want to check it out. I think I called it. I forget what it's called. Something about the purpose of laughter. So you can try to find that and you'll get a sense of what I talk about. I think that the laughter has to do with everything that's on the outside, everything that's on the periphery. It's a. Laughter is an involuntary reaction to an event, right? It's a loss of control. And so in the sense. So in one way, laughter can be, you know, there are. There's some traditions which say something like, Christ never laughed, okay, Because Christ never lost control. Christ never gave in to the world, at least not involuntarily, right? And so that is really the symbolism of laughter. But laughter also has the capacity to question, right? To question authority, to question the system, to question the. And so when a system is broken, then you can see laughter as a way to break it down. And so an example I use all the time is, of course, Elijah. When the prophets of BAAL have set up a kind of upside down world in Israel, then Elijah comes and he mocks them and he makes fun of them and he laughs because, you know, he is trying to break down the corrupt system. And so that is the. That is the capacity or the possibility of laughter. And so I think, you know, one of the reasons why I talk about watch the fools, watch the clowns is because one of the things that's been happening is that laughter, at least in the last few years, has been used by several people to kind of restore a vision of order or a vision of a vision of a normal world. All right, so Lucas Fernback asked, could you talk about Gideon and the symbolic meaning of his story? My grandfather picked gladius Domini, Egidion, the tuba, torch and sword for our family crest. My profile pic. Secondly, could you give your opinion about the laws and rules in. In 5 mosaic? I don't know what that is. 5 mosaic 1226 in the context of today's liberal society. I'm not sure what that is. I'm sorry, I can talk about, I can talk about the. The story of Gideon a little bit. The story of Gideon, it has to do with tricks, with tricking. It has to do with the idea of these upside down things that kind of manifest and are able to take over. So a lot of things that are happening in the moment Where Israel is taking back the land have to do with this type of behavior, this kind of. Of tricking, turning around the city, you know, in the. In the story of Joshua, where they turn around the city and they. They break down the. The city. So it has to do with. With something like that where Gideon kind of tricks the different people by having more. You know, he has these. These flames, and so they think that they're more than they are. But I would have to look at it again, because, to be honest, it's like I don't. I. I'm trying to call back the full story, but I'm missing because I even, like, I know that the story with the water, where they drink the water, it's like I even forget which ones are the ones that are in his army. Are they the ones who bring the water to his mouth or go down in the water. So I'd have to look at it again. There's. And then there's the whole idea of the fleece and the dry and wet. I'd have to think about it again, for sure. It's a. It. My memory of it was that it had very. A lot of symbolic. A lot. A lot of symbolic stuff. But I would have to re. Go over it again, sorry, also, because right now. All right. Okay. So Charlie Longoria asks, so do you have any advice for someone who has become a catechumen in the Orthodox church? I've been attending the church since June 2020 and have not decided to become academic. Unfortunately, after that first service I attended, our priest was struck ill. Not Covid related. So we've only been having typical services for the past few months. A priest from San Antonio is. San Antonio is able to come once a month to give communion. A priest is slowly recovering. However, this is not an ideal solution. No, man, I feel for you. I'm sorry. Yeah, I don't. I don't know. I would say it is. I would say that maybe you can talk to your priest about resources that you can start with on your own. You know, just ask him if there are some books you could read or if there are people even. I know it's not ideal, but if there are people online, so say some priests online that are willing to kind of help while he is kind of getting better and having more energy to help you through this. But at least for now, I would say that's the best you can do. But I would say maybe ask your priest, who's recovering, what he suggests. You know, what he suggests you should do in terms of Being a catechumen, so Norm Grande asked, in the Great Adventure Bible, the nation of Israel is described in the section of the Conquest and Judges, Joshua, judges, and 1 Samuel as falling into a continuous cycle of sin, servitude, supplication, salvation, and silence. In light of your recent emergence, talk with John V and Paul V. You discuss the idea of story and the breakdown of meaning. Elsewhere, you discuss the idea of loss of memory as an inevitable consequence of moving further and further away from the center. In what ways might this breakdown of meaning be a symptom of forgetting? Silence. In what ways might this breakdown of meaning be a symptom of forgetting? I don't know why you put silence there, because I don't see silence as forgetting. And so the Book of Judges. So the, the Book of Judges is showing you how when you don't have a stable authority, then you, you have extremes. You have these extremes and this cycle. And so, yes, you're right. What it is, is it is this cycle, right, of this movement of cycles. And you can see that in the Book of Judges, it's continually saying something like, you know, Israel did not have a king, right? Israel did not have a king in the land. And so it's actually, it's something like the story of the, of the Greek tragedies, you know, where you, you, you have the. My brain is completely gone. I'm sorry, guys, what's the name of the cycle? The Greek tragedy cycle. There's a Greek tragedy cycle where you have this, this breakdown of meaning where all the taboos are broken and, you know, things starts to cycle and then there starts to be like the son killing the father and the children killing the parents. And there's this kind of cycle of chaos and madness. And then finally it's solved by Athena, who establishes law in Athens. And so this, the establishing of law and a stable like hierarchy is what stops the cycle of vengeance and cycles of fall and everything. And so that is what is represented in this story of the Bible as well, is that the, the. Although the problem, although kingship has its problems in scripture and even the prophets talk about what the problems are going to be, nonetheless, it ends up being a stabilizing force. They build the temple, which is a stabilizing force in terms of the religious practice. They also create laws which will stabilize the identity of these tribes that are fighting amongst each other and ripping each other apart. And so I think that that's the best way to understand it. And so if you think of my brother's book, you can Understand it as the Book of Judges is being a slave to the cyclical pattern, right? To be a slave to the cycle of time. Whereas establishing space in the center, establishing the temple and establishing Jerusalem as the capital, the king is what is going to stop this kind of endless cycle of turning that happens in the Book of Judges. All right, so Jan Peter Jaeger asked, do you have advice for Christian artists who make paraliturgical art, as Ivan Moody puts it, in a secular domain, who want to escape the egocentric, praise focused and prideful culture surrounding it? How can I become less and Christ more in that specific context with the criteria this domain of art sets? I would say that to establish purpose for what you're doing would definitely be helpful, you know, and I don't know what your art is, but it can be something. The purpose doesn't necessarily have to be super high, let's say, but it can still be a purpose. So, for example, if you say, if you, if you make visual art, you could say that your. The purpose of the object is to be beautiful and to decorate building. And that might sound like a very low purpose, but it's actually a higher purpose than a lot of contemporary art has right now, which is to kind of be a object of speculation and also an object of thought. It's just something that you think about and write, theory about. And so you can imagine that you have a purpose, which is to. So, for example, if you write music, it could be something like you want to write music which will. You could write quiet. You could find a. I don't know, I struggle a little bit with the concert music. I don't. It's okay. But ultimately it's folk music and, you know, music that leads to that can be something that's used in weddings or used for different occasions. Like dedicated music, you could say is probably something which would be better. And so in the past, even what we now call concert music was a really concert music. It was, you know, music written for the coronation of a king, or music written for, you know, for, for dancing, or music written with a purpose. And so I would say to rediscover purpose is something that will help you. And also I do think that. That I do think that if you imbibe the Christian story and the Christian pattern, then that also will flow out into secular art as well. And so if you look at medieval secular art, it still had a flavor and it still had something aspiring towards the sacred in it. So Leo asked, do you have any thoughts on Systema, the Russian martial art that allegedly was developed by orthodox monks many centuries ago. It has an important school in Toronto. Maybe there's such a thing as Christian martial arts after all. I have to admit I have been really kind of curious about this, this thing. You know, I, I don't. There are. No. If there aren't, there's no one teaching it around here. And so I've been just curious about. Like you said, I've been curious about its origin because I know that they use the Jesus prayer and they also use like a kind of breathing within the system. But I don't know enough about it to know whether it's legit or whether it's just something some guy made up. You know, I've seen some pretty impressive things. It's always hard to know when you're watching videos whether or not it's authentic, But I've seen some pretty impressive things of people really giving powerful. It's kind of powerful kung fu looking punches where they hit someone and the guy goes kind of flying back. And so it seems like it has something like. It's not completely bunk, at least that it has some kind of. So I would say, you know, I would say look into it, you know, be curious about it. Also be careful if it's some, if it's some kind of weird kind of new agey stuff. But I would say, I mean, I don't know the story. Yeah. But I have, I have to admit that I have been kind of fascinated by it. So. Christopher asked. Seeing the connection being made between my wife and, and daughter during breastfeeding is beautiful. I always think of the phrase the priest uses during liturgy. Take, eat. This is my body, man. Is there a connection between the two or am I making connections where there are none? Okay, I would say it's not the same. It's not the same. In a certain manner, it's opposite. And so in scripture, there is the bread of heaven, the manna which comes down from heaven. And then there's also, let's say, the food of the earth. And so the mother is the one who gives body. So the food that comes from heaven is not one which is there to provide body, it's there to provide seed. You would say it's there to come down as a, as light or come down as seed or, or, or concentrate. Right. This concentrated thing. Whereas the, the food which comes from below or comes from the mother is, Is the sustaining food. It's the, the food that gives body. And so it has to do with the home, it has to do with the House with the womb. All this image of the, the, the womb as body. Right. As your first home, your first house. And so that's what it has to do with. So I would say it's, in a way they're complementary. You would say, and so there's the food which comes from heaven and then there's the food which comes from the earth and you need both. All right. So Chase and Litzy asks, hey, Jonathan, I'm curious, what is going on with Saul's search for his father's three donkeys? I feel like there is a lot more going on there than a random donkey chase across an unusually large span of land. I have a feeling the cities that Saul passes through probably all meant something to the ancient Hebrews that might be lost on modern person. I also feel like there is some significance with the anti climatic revelation of Samuel that the donkeys were already found. Do you have any insight on this introduction of Saul? To be honest, I've never thought about it. And so it is something that I would have to think about and I don't want to speak out of place. And so for sure, donkeys, I mean, I can say something about donkeys for sure. Donkeys in scripture always represent a kind of wild body, you know, and so, you know, there's probably a connection between this Saul searching for his three donkeys, his father's donkeys, not finding them, all of that. There's probably a relationship between that and Christ entering into Jerusalem on a donkey, mastering, mastering the donkey. And so there's probably a relationship with that, but I'd have to think about it more. All right. So Kevin Patterson asked. Hi, Jonathan. We've just passed the 19th anniversary of September 11th attacks. As an Australian who was too young at the time to comprehend it, I want to understand the symbolism of this event as it involves outsiders taking possession of technique, machines of the sky, large towers of business and trade, religious conflict, conspiracy theory, and people choosing to jump off. What can we unpack here? My goodness, you've said a lot of stuff. You know, apologies if it's a tentative topic. The only thing I can say about September 11th in terms of understanding symbolism is that the terrorists attacked the highest thing of American civilization. They attacked the God of American civilization. You know, they attacked the idol. They broke down the idol. And so by attacking the, the World Trade center, they attacked the highest thing American civilization. Not just America, but Western civilization has pretty much given themselves to economy. And economy has become the, the God of our civilization. We, we think of everything in terms of economy. We, we make all our decisions in terms of economy. And. And so. And so I think that that's maybe the best thing to understand there. And that's why it was a. They did it in a symbolic act of attacking the most important thing. So. Yeah. So Drew McMahon asks. Hi, Jonathan. In the story of the woman caught in adultery, Jesus is asked by the scribes and Pharisees what her fate should be. And his response is to initially write in the sand, emphasized by being mentioned twice. I believe we are not told what he writes and he appears to ignore the question at first and goes right to writing what is the symbolism of his gesture? Writing on the ground happens at other times in the Bible as well. Man, I'll be honest with you. I've thought about that for a very long time. I've kind of tried to ponder that. You know, there are some people, there are some traditions about what is written in the sand. Some people say that Christ was writing the sins of the people in front of them. It seems like if what he was writing in the sand was important, it wouldn't have been said. I think that the idea of Christ writing in the sand seems like it has to do with. With giving meaning to the sand. It seems like it has to do with creation. It has to do with blowing breath into the sand or the dust that became Adam. That's what I think it has to do. So I think that it. It's. Christ is manifesting who he is by writing on the sand. So, so being the putting meaning in the earth. Right. And so. And so I think that that's what it is. I think that it's. It's Christ manifesting that. Now why it happened there during the story about the adulterous wife is something that. I'm not so sure. It could be something to do with him being. Being the one who. I'm not sure, like the one who's able to free her, who's able to kind of rise her up from her accusers because he's the one who gives meaning and let's say, is able to. To bring meaning into something that is fallen. So it could be something like that. But I'm stretching here. But for sure, I do pretty sure that him writing in the sand has to do with him connecting meaning, heaven and earth together. So take that for what it. For what it is. So. Hey, Jonathan, I was wondering why no hewn stones for an altar? Why are tools and Exodus said to defile the altar? Is it something to do with tool supplement being a product of the fall and thus sinful. I find it interesting that it comes just before the plans for many wrought items of worship. Kind of related. How do you sharpen your wood carving tools? Okay, yes, I do believe that it has to do with that. I do believe that the idea of having unhewn stone for the altar has to do with something which is untouched, something which is pure, something which is not worked. It has to do with virginity. And so it's related to the notion of the Mother of God. It has to do with this idea of something which is not modified, something which is untouched. And so it is related to the problem of the need to work the earth after the fall. Right. When Adam and Eve fall, God says you must work the earth. And hewing stone, like cutting stone is related to this work. And so in that sense, then the altar becomes the. A place before the fall, but also related to the Sabbath and to the idea of untouched. You know, the untouched part, the part that isn't, that isn't, that isn't transformed. And so I think that that's what it has to do with. So like you said, you say you find it interesting that it comes just before the plans for many wrought items of worship. So you can imagine that the middle. So you. So like that's the first thing that said is they talk about the. All this altar as being this untouched thing or this kind of virginal thing. And then after that there can be all these other things that are worked. But it's mostly, mostly has to do with that. Anyway, that's how I understand it. So the wakeful as Jonathan, as a monarchist, do you acknowledge Queen Elizabeth II as your true and rightful ruler and respect her title of defender of the face? Thanks, Daniel. Man. I really struggle with that. I struggle with that because I'm French. When I'm joking, I say, I say yes. When I'm joking with people around here, I always say, I always kind of say, what are you talking about? Like, we have a queen. There's a. You look at the $20 lick letter money. She's everywhere. Obviously we have a queen. But I think in practice, I would say probably to a certain extent, yes, but in, in practice it doesn't mean much. Although the, the, the structures are still there. Like the Governor General is still the head of the government in theory in Canada. And so it's like, it's like there's this latent structure which is still there in, in the Canadian government that still has a latent royalty which could at some point maybe be reactivated So, I mean, is she a defender of the faith, though? I mean, I don't know about that. I do have a problem with the. With. With the notion that the. That the kings and queens of England are, you know, considered like the head of the church. You know, that is something that I always found to be problematic. But I don't know if it's still true. But I know that it was for a while. All right, so Nina Morris asks. My teen is hooked on symbolism from hearing me listen to you. That's hilarious. So now we watch movies looking for it. She asked me, what is the symbolism of Toy Story? In her analysis, she suggests a push to see each other as playthings and more robotic, perfect than human. Cowboy versus alien or astronomy. Person from far away. Seems to be an old story. I never thought about the story, about Toy Story. So, I mean, in terms of the symbolism of the story, there is this idea that you can imagine it as you have a microcosm, right? A microcosm where the toys are there to serve the boy, to serve the child. And so the toys are. It's almost like the child is God and they are the church or they are the communion of toys that need to get along in order to serve and to be, you know, companions to this boy. And so I think that that's mostly what the symbolism is about. At least the first movies. I don't know about the other ones. I don't. I forget even what the last one was the last ones were about. But, like, the two first ones that I remember, they seem to always be about, you know, staying connected to the boy, staying connected to the child. And. And, you know, also being jealous that the child loves one toy more than the other and has favor, has the God's favor. And so it's like the first Toy Story can always be like a Cain and Abel situation where, you know, Woody has lost favor from God, you know, and what's the other name? Buzz has the favor of the higher aspect of the hierarchy. And so then there's a conflict between the two. One tries to kind of. To betray or to. Or to kind of sabotage the other in order to regain favor with the child. And so I think that it has more to do with that. So. Yeah. All right. All right, guys. Let's see. We're almost done. We're almost done. So Walrus King 14 says, both you and Matirvi's book, I talked about the symbol, the symbology of force in the past, primarily within the context of encircling a city the city and its walls are ordered stability while which are holding back the constant growth of the chaotic force that surrounds. To me, this gives forest a sort of frightening and bewildering presence, which makes sense for those who have ever walked through a deep forest, especially at night. However, in many folk stories and fantasy novels, forests are lived in by various peoples or races. Elves and Lord of the Rings, a very heavenly, almost angelic race, often stick out to me at first. How does living inside a forest work symbolically? Can you roughly go over the symbolic symbolism of the forest in general to make sure I'm on the right track? So the idea would be that the forest is the place of chaos and this dark, frightening place, but it's also the place of potential. And so it's also the place of adventure. It's the place where you could find surprises, where you can discover treasures, where you could discover something surprising. And so I would say that even in Lord of the Rings, my understanding is that the, the, let's say the forest elves are the least, let's say divine of the, of the elves. Like they're the lowest elves. They, at least that's my memory of it. And so in that sense there's a reason why they would live in the forest, whereas the other elves don't. And so that's. That is how I would say that it needs to be understood. But you can also go to, let's say the hermit also lives in the forest. And so there's also hidden knowledge in the forest, just like there's hidden knowledge and hidden sparks in the waters. Right? This idea of the fish in the waters, or the idea of Peter who goes out and finds a gold coin in the mouth of the fish, fish is related to the fact that hidden in the darkness, hidden in the forest are these gems and these treasures. And so that's also one of the reasons why, you know, people go out on adventures and go kind of outside themselves and then find a gem or find a pearl. And so that is the, that's the symbolism of the forest. So Kenan Wang asked, what is the meaning of Jesus's miracles in particular? How are we to interpret some of the ones that seem like magic? Curious, Curing leprosy, multiplying physical food. I heard you talk about magic in a previous video and that the Christian story is not about magic. So curing leprosy, multiplying physical food, etc, so all of Christ's miracles are different. They're different, they're not the same, they have different meanings. They usually all have to do with the Incarnation. And so they all have to do with the effect of, of, of the Incarnation. One of them, for example, is healing bodies. And so the, you know, the light from heaven comes down and it, it is able to heal the body. It's able to give meaning to something which is breaking down. We give cohesion to something which is breaking down. So that those are the, those are the miracles that are related to, to, to healing. There's also the, the miracles related to food. And that has to do with this idea of fishing, right? And so it has to do with the capacity of the Logos to go into chaos, into, into unknown, and to gather that which is useful and then make it into something which has cohesion. And so there's a, there's a mass of people and they don't have enough, or it looks like they don't have enough. And they at least publicly only have so many fish and so many loaves. But by the time Christ is done, then he has been able to gather all this other food out of the crowd and bring it kind of manifest it out of the crowd. And so that is another miracle. And so it just depends. All these miracles, like Jesus walking on water is obviously the same, same this idea of mastering chaos, mastering possibility. So anyways, there are too many and so I can't go into all of them. But every single miracle that Christ, that Christ performs has to do with manifesting who he is and kind of embodying or making real what it means for the Logos to become flesh. All right, all right. So in theory, we are done with the question, so let me check in the super chats. All right. And so here we go to the golden thread. For $10, should we have faith that your fellow countryman, the Niviana, will not ruin Dune? I hope so. He's a good storyteller. I mean, you know, it's like I had my little problems with Blade Runner, but it was really, still really well put together together and well told. And you know, I will have to see, you know, if anybody can do it. I think he can. You know, I'm a little worried that they're not going to make a lot of money because it's not, it's not like Dune is as famous as other stories. So be interesting to see. For sure, for sure. It'll be interesting to see how they play the weird, all the political need to, to put in political messages in Dune. And so that'll be interesting to see, see if they, they feel like they're forced to do that or if they, they try to play it more straight laced. So Andrew Johnson for $5 asks, do you plan on retelling any more brief stories the way you did with the story of the Silence of Silence in Merlin? Sure, I would love to do that. I. It's like, it's funny. I don't feel like people are interested in that. But if I did, I would have to find stories that are lesser known, you know, maybe doing some of the Alexander story, and also find things that I feel are relevant and that I'd like to see how people interpreted that I really like. I enjoyed that because it was fun to watch people do a pretty good job at interpreting the story of silence, especially in the context today. So I thought that was good. So I'd have to think about which ones though. So David furtado asked for 5 BRL. I don't know what BRL is. Does today's marriage have the same meaning as in the Bible? Can we consider today's getting married on paper as to becoming one flesh? And so I would say yes. I would say that if you involve, if you get involved in the, in marriage in a, in the, in a way that is really, how can I say, this is really a promise to the other person and you do it in, in completely. Even if it's a secular wedding, it'll still have an effect and it will still create that effect of the two becoming one flesh. And so the Christians always recognized secular marriage even as being legitimate. You don't need to be married in the church. I mean, I think in the Orthodox Church they actually do, but in the Catholic Church they actually kind of, they tend to recognize natural marriage, they call it. And so. But I think that, yes, I think that, that you should, people should get married because it's a, it'll shake you to your core. You know, making that kind of promise is very important to becoming an adult. And if you don't do that, then you should take vows and become a monk. Because making those kinds of promises are very important in becoming a grown up. So shaky raindrop for 999 says thank you. You're welcome. Mason Bradford for 10 aud, which I don't know what that is. What is the unforgivable sin? And is there anything like it in the Old Testament? I never thought about the Old Testament question. And so the unforgivable sin is the sin against the Holy Spirit. That's the unforgivable sin. And so like, I don't want to step on anybody's toes But I think it's the best way to understand it is that the unforgivable sin is the sin of not wanting to be forgiven. It's the sin of not. It's the sin of refusing God. And that's the unforgivable sin, like of refusing the transformation that God can make in you. And if there's a direct correlation, it's like if you don't want to be transformed by the Holy Spirit, then you won't be transformed. You won't be transformed by the Holy Spirit, and that's the unforgivable sin. So if you don't want to go up the mountain, then you're not, you're not going to go up the mountain. It's not going to happen. So that's how I see it. So tomorrow. So Thomas Anderson asks tomorrow's Michael Mass, what is Orthodox view on the name Michael, who is like God? Any unique markings on his icon to make him out from other angels? I mean, for sure, St. Michael is one of the most important I one of the most important angels. And so, but I don't know if there's any unique things about his icon to mark him out. He tends to be represented as a warrior because he's the one who kills the Leviathan and he has a kind of warrior position in the army of God. He tends to be represented in red, especially in the traditions in which he's opposed to St. Gabriel, who's in blue. And so that sometimes St. Gabriel will, will be dressed in kind of ecclesiastical garb, will look like a priest or a bishop, and whereas St. Michael will look more like a warrior. And so you also have this relationship between spiritual authority and temporal power. So maybe that's the most I can say about that. So Andreas Stomatakis, sorry, I grew for 5 USD says I grew up Orthodox and was resistant to learning about my faith. But now I feel the lack. What can I read to regain that connection? I mean, Andreas, I would say the best, the best way to do it is to connect to community. And I say that in the time of COVID when I just told you that I haven't been to church since the beginning of COVID So I'm being a very hypocrite in saying that right now, but I still think that that's the best thing you can do is to, is to, is to connect to people. And then if you want to read, there are some really good books that have been written in the modern age. The Orthodox Way by Bishop Callisto Swer is a Very accessible, but still very profound book that can kind of help you get a sense of orthodoxy, you know. And then obviously there's some modern theologians that have written about orthodox theology. I really like Vladimir Lasky myself, although he's a little harder to read. But I would say that the orthodox way is a good kind of start if you want to learn a little more about your faith. And so Paul L for $99. Wow, Paul, that's. Thank you for that amazing gift. And doesn't even ask a question. So let me check if. More. More. So here's the last one. And so no more super chats after this. So a man born blind for $5 says, on the cross, did Christ curse God and die in a way Job never did. My God, my God, why has thou forsaken me? That's a really, really interesting question, man. That is an interesting question. I would say easy answer is no. I would say difficult answer is I would say that the difficult answer is that he didn't curse God and die, but that it's as if he comes. He's manifesting the extreme, right? He's manifesting the extreme, which is actually impossible. He's manifesting the impossible extreme of this idea of being abandoned by God. And so he's going to the very, very edge. He's going to the edge of existence itself, Right? The edge of existence itself, which doesn't exist, which is impossible. And so he really is. That phrase, of course, is the most. Is the craziest phrase in Scripture. It's one of those things that is just going to break every category for you. Break, break everything. And so I don't think that he is cursing God and dying, but I think that it is referring to that. I think that it is. It is solving the puzzle. It is solving that puzzle that happens in that. In, in Job. And it's going there. But he's not cursing God. He's asking, why have you abandoned me? And. But he is going to that edge where he's at the end of meaning, right at the end of the. Of possibility. So. So, yeah, that's how I see that. But it's a crazy sentence. It's. It just, it's like, don't think about that too much because thinking about a phrase like that will drive you crazy. And so, so, guys, thank you for. Thank you for your. Your time. And I feel like I wasn't as annoying as I could have been considering I just found out that we're back in the lockdown. So hopefully that's true. I hope you enjoyed this episode of the Symbolic World. The Symbolic World is edited by Justin Ward and it is based on a series of videos that you can find on my YouTube channel, Jonathan Pageau's YouTube channel. You can also get involved There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description and so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course leaving a review on itunes. Everybody knows that's the best way to get the podcast out there to get it heard. And if you want to get involved, you can also support the podcast financially going to www.thesymbolicworld.com support or else on Patreon Pageau videos as well and on subscribestar. All those links you can find on my website or in the show description. So thank you and I will see you soon."}
