{"episode_id":"SW - #087 - 2020-01-08 - Benjamin Boyce - Masculine Actualities and Feminine Possibilities","start":12.56,"end":39.37,"speaker":"Jonathan Pageau","text":"This is Jonathan Peugeot. Welcome to the symbolic world. I think by now most of the people that watch my channel know you. And then probably similar. We're in the same space, so we could just. We could just discuss and think it would be fine."}
{"episode_id":"SW - #087 - 2020-01-08 - Benjamin Boyce - Masculine Actualities and Feminine Possibilities","start":39.93,"end":47.69,"speaker":"Benjamin Boyce","text":"You know, what, you say that, that we're in the same space, but that makes me think that we're in the same safe space. I wanted to be in the same danger zone."}
{"episode_id":"SW - #087 - 2020-01-08 - Benjamin Boyce - Masculine Actualities and Feminine Possibilities","start":47.93,"end":108.44,"speaker":"Jonathan Pageau","text":"I think we're in the same space, but I don't think we're on the same sides of it. And so we're kind of like on these. I think we have. We're in the same discussion, but we're not. Maybe not in the same. I've been impressed. I've been. To be honest, I've been impressed to see like the variety of interviews you're able to get. Like, it's pretty intense. I think it's a testimony to your true desire to discuss that you're able to. Because, you know, you, you did the. You did the. Because you did Evergreen. And then so everybody kind of could have pegged you in a certain way because you, you were criticizing the way that Evergreen was making decisions, but now you're having all these discussions about transition with transsexuals and everything. I was like, wow, how did, how is he able to. How do they trust him? You know, and so I think that's. That's a test, definitely a testimony to, to your, Your style or the way that you engage in conversation."}
{"episode_id":"SW - #087 - 2020-01-08 - Benjamin Boyce - Masculine Actualities and Feminine Possibilities","start":109,"end":149.69,"speaker":"Benjamin Boyce","text":"Well, I think that it's similar with you. I think there's something that causes both of us to be able to be sojourners on an intellectual level, because you're able to do the. To walk into any story, any narrative, and make a home out of it. Like, you can go into these different movies and you make a home out of it. You can make sense of what's going on or you can make. It makes sense to other people in a way. And that's a testament trying to. Either to your plasticity or the tool set you have is one of those multi tools that can just fit in."}
{"episode_id":"SW - #087 - 2020-01-08 - Benjamin Boyce - Masculine Actualities and Feminine Possibilities","start":149.85,"end":209.54,"speaker":"Jonathan Pageau","text":"Well, I think one of the things that I'm always trying to do, if I'm showing some symbolic structure, I'm always trying to show all the sides. And so it's like, you know, I talk about, let's say I talk about marginality. I can talk about the dangers of the margin, but also the opportunities of the margins. And I always try to shift between the two so that people don't think that I'm just advocating a simplistic moral position, you know, where I'm trying to kind of paint a picture of reality. So hopefully. Yeah. And I think in a way I've seen. I've been surprised sometimes of the people that have said that they like what I'm doing, you know, and people on both sides that like what I'm doing and then people on both sides that don't, depending on how they want to perceive me, like, depending if they want to. It's interesting. And what for sure, the extreme seems to dislike what I'm doing. Like the, the. I get a lot of criticism from the hard. Like the hard right are criticizing me. You know, they come."}
{"episode_id":"SW - #087 - 2020-01-08 - Benjamin Boyce - Masculine Actualities and Feminine Possibilities","start":209.54,"end":212.34,"speaker":"Benjamin Boyce","text":"So, like, what's their. What's the essence of their critique?"}
{"episode_id":"SW - #087 - 2020-01-08 - Benjamin Boyce - Masculine Actualities and Feminine Possibilities","start":213.53,"end":279.37,"speaker":"Jonathan Pageau","text":"Well, they don't like that I'm. That I not openly criticize. Like, I'm not constantly criticizing Jordan Peterson. They don't like that because they really dislike Jordan Peterson. And so they wish that I was more. It was harder, let's say, in terms of certain ideas, because it's like I want to show. Let's say I want to show the advantage of having an authority, let's say, but there's also serious disadvantage of authority, too. Like that there's a danger in authority and there's advantage in authority. And so I'm not going to just show one side because I think that's lacking. But if you're in a political fight, then you want a weapon, right? And so it's like I don't feel like I give people weapons. And so I think that's why. It's why that's a place where I think both of us are kind of on the same page, where that's not what we want to do. We want to help create space for discussion and a space where people can at least try to understand each other rather than just give people weapons to beat each other on the head with."}
{"episode_id":"SW - #087 - 2020-01-08 - Benjamin Boyce - Masculine Actualities and Feminine Possibilities","start":279.53,"end":329.66,"speaker":"Benjamin Boyce","text":"Yeah, yeah. That's interesting about what you're bringing up about authority. And I was just watching your video on the symbolism of 666. And in that video, as in with many of your videos and your talks, you mentioned the church Father. And that kind of evokes like literal patriarchy, which is kind of an interesting term right now. It's been kind of commandeered by. As a negative symbol from the standpoint of feminist theory. But when you say the church fathers, I can feel that there's this warmth in that relationship that you have with those fathers. Would you like to talk a Little bit about, like, the symbolic form of the patriarchy."}
{"episode_id":"SW - #087 - 2020-01-08 - Benjamin Boyce - Masculine Actualities and Feminine Possibilities","start":329.66,"end":476.13,"speaker":"Jonathan Pageau","text":"The patriarchy. Someone asked me a question about this in Chicago a few weeks ago, and they asked me, they said, why do you advocate. Can you explain to us why you advocate patriarchy? And I was like, really? I don't think that I advocate patriarchy. The problem is that, let's say. I see, let's say masculinity or the masculine aspect, as we could use the word patriarchy. Let's say we use the word patriarchy. And so I think that there's a type of discourse, a type of reality, a hierarchy in society. There's a hierarchy in society. And that hierarchy, you could call it patriarchy if you want, because it does tend to have a certain masculine characteristic because it's public. It has a certain amount of use of authority, all of that. But the thing is, is that that hierarchy cannot exist without the space in which to exist. And so the mother or the feminine is extremely important. It's primordial. The only problem is that it becomes difficult if you try to talk about it, because it is the secret. It's the secret. It's the mystery. It's the. It's this. It's the space in which discourse happens. It's the. The question. It's all of these aspects of reality, the private sphere, the home. There's all these images of the feminine, of the womb, let's say, that are. That are important. But the problem is that if you try to make them into. If you try to make them into patriarchy, then you're. You're. You're actually acting against the power of this feminine symbolism. Like, if you, if you want the feminine symbolism to act like an authority in the world with a sword and like, beating there like, that's, that's not. That's just it. Now you're becoming a man and you're acting in a masculine manner. And so, So I don't necessarily advocate patriarchy. I advocate, to me, the way to see it is a. Is that one needs the other. You need. For any hierarchy to exist, you need a space in which it exists, you know, but that space also is given form that they are given an answer or given some structure through what you would call patriarchy or a hierarchy. Does that make sense? Yeah."}
{"episode_id":"SW - #087 - 2020-01-08 - Benjamin Boyce - Masculine Actualities and Feminine Possibilities","start":476.13,"end":517.95,"speaker":"Benjamin Boyce","text":"Do you think that in the Bible there's an Old Testament God and a New Testament God, and they're both referred to as father or kind of in the masculine, I believe there's some. They pronoun at the very beginning, but it's usually assigned to a he. Do you think that in the Bible, just off the top of your head, I don't know if you've done any thinking about this, but is there an evolution of the masculine going from an authority figure into the Son, like the transit from the Father into the empowered Son or the sacrificial Son? And is there a softening of the masculine in that process?"}
{"episode_id":"SW - #087 - 2020-01-08 - Benjamin Boyce - Masculine Actualities and Feminine Possibilities","start":519.24,"end":689.04,"speaker":"Jonathan Pageau","text":"Well, I don't. How can I say this? I don't think so. I mean, I think it's important, at least for Christians. It's important to think that the God of the Old Testament is the same as the God of the New Testament. It's not like another God. But it is true that the Incarnation creates a difference in the sense that the Incarnation opens up a space of communion or shows communion to be the manner in which we are. We can become the body of God or the body of Christ or the body of the Messiah. And so there is a manner which shows more clearly the way in which we can participate, let's say, in the life of God. And we see that happen in the New Testament. But there are already hints of that in the Old Testament as well. There are these. The classic image is the image of Elijah who goes into the cave and is, you know, he's distraught and he's trying to understand the will of God. And, and there's this storm and there's tempest, and it says God is not in the storm. And the tempest then finally says, there's the still soft voice. And then he hears God in the still soft voice. So there are images of, let's say, this difference that Christianity is going to bring is there already, is already there in some places in the Old Testament. There definitely is, let's say, the aspect of rigor which you find in the Old Testament, the kind of more, let's say, the harsher aspect of reality is there trials. But we have to be careful because we can't deny that that's part of reality. You just can't avoid it. If you try to think that there isn't a certain harshness to reality or there isn't a manner in which if you don't, if you're not in line, that you're going to face the consequences of not being in line, then you're missing an aspect of reality. It's like if you, if you, I don't know, if you cheat on your wife and you beat your kids and you, and you start drinking and you do this and you think that there's no consequences to those actions. It's like no reality has. There's a certain amount of objectivity to the way reality lays itself out. And if you, if you don't adhere to that, then you're going to. You're going to eat, you're going to suffer. It's just going to be inevitable. And the church fathers really do represent the idea of God's judgment as the consequence of your actions themselves. So it's not. They don't imagine God as this, although it can be portrayed that way. But they don't imagine God as an exterior being that is saying, oh, you did this, now I'm going to smack you around. It's like, well, if you don't fix the dikes in your city, then there's a flood. Well, that's God's judgment, but it's also the dikes that broke because you didn't fix them."}
{"episode_id":"SW - #087 - 2020-01-08 - Benjamin Boyce - Masculine Actualities and Feminine Possibilities","start":689.04,"end":689.44,"speaker":"Benjamin Boyce","text":"Yeah."}
{"episode_id":"SW - #087 - 2020-01-08 - Benjamin Boyce - Masculine Actualities and Feminine Possibilities","start":689.44,"end":694,"speaker":"Jonathan Pageau","text":"Like the natural consequences of your actions is the judgment of God."}
{"episode_id":"SW - #087 - 2020-01-08 - Benjamin Boyce - Masculine Actualities and Feminine Possibilities","start":694.48,"end":700.08,"speaker":"Benjamin Boyce","text":"Yeah. There's an Indonesian proverb, I believe, that says, don't fear God, fear your own actions."}
{"episode_id":"SW - #087 - 2020-01-08 - Benjamin Boyce - Masculine Actualities and Feminine Possibilities","start":700.24,"end":764.17,"speaker":"Jonathan Pageau","text":"Yeah, yeah, that's it. And in the end. But it does end up showing you the nature of reality. So you could say something like, it does end up showing you the will of God, because it's the way that reality lays itself out. It's not arbitrary. There are other actual. It's a reality that shows itself, you know, but then the, you know. So what Christianity tends to do is to, first off, place the human person and the love of the human, of people between themselves and their love towards God is the solution to the problem in the sense that, like I take the example of a dyke, again, like, if you love your neighbor and you. And you love. Let's say if you're a leader and you love the people who are under you, then you're going to fix the dike, but you're not going to leave it because you care. And so you're going. And so that. That love becomes the tool by which reality can be transformed and can become more. Can become more cohesive, you could say."}
{"episode_id":"SW - #087 - 2020-01-08 - Benjamin Boyce - Masculine Actualities and Feminine Possibilities","start":766.43,"end":788.67,"speaker":"Benjamin Boyce","text":"So what do you think about that accusation that you're promoting the patriarchy, then? What is it about the masculine, at least in history, at least in your tradition, that's apparent. And that can be construed as suppressing the woman or keeping the feminine or the female under wraps or under control or something like that?"}
{"episode_id":"SW - #087 - 2020-01-08 - Benjamin Boyce - Masculine Actualities and Feminine Possibilities","start":789.63,"end":892.68,"speaker":"Jonathan Pageau","text":"I mean, I think that. How can I say this? I think that on the one hand, so you can see it this way, you could see it as There's a positive and negative aspect of masculinity. There's a positive and negative aspect of femininity. And those, to a certain extent, are inevitable. They're just in the very structure of reality. If you have a hierarchy, the hierarchy can be a point of, like a head. It can be the point of coming together of a group or whatever, but it can also be an abusive thing where it eats. You know, it eats its members and doesn't give back. So. So it can have both. The feminine can also be the same in the sense that the feminine can be. The space is the space in which things happen. It is the frame, the question, the beginning, like the opening of discourse of. So it has an amazing quality of nurturing, of being the safety. All of that is related to the feminine. But then it can also be subversive. It can also be. How can I say this? It can also be a destabilizing agent as well, because it's the space. If you ask a question is great because it actually frames reality. But if you drown the world in questions, then all of a sudden you have no certainty anymore. And then things start to fall apart. I don't know if that makes. I'm speaking in very metaphorical language here, but it's hard to. Sorry for that noise there. It's hard to talk about these things and try to talk at all levels at the same time."}
{"episode_id":"SW - #087 - 2020-01-08 - Benjamin Boyce - Masculine Actualities and Feminine Possibilities","start":894.76,"end":904.74,"speaker":"Benjamin Boyce","text":"Do you think that that's a fault in certain modes of discourse, that they try to constrain thought or sen. To one level?"}
{"episode_id":"SW - #087 - 2020-01-08 - Benjamin Boyce - Masculine Actualities and Feminine Possibilities","start":905.14,"end":958,"speaker":"Jonathan Pageau","text":"Yeah, yeah, definitely. And I think that that's the. I think that that's been, in a certain manner. The problem of the leveling of thought, I would say, has been one of the problems of the modern age, in the sense that we tried. We see everything at the same level. We don't. We're not able to understand that, you know, that. Like a good example. I'll give you an example of something that happened to me recently. I was giving in Montreal and the subject fell on purity, right? And the idea of purity. And so then all of a sudden I realized, like, the people in the audience were. Had taken the stance that purity is evil. Like, purity is bad, right? Because purity is an exclusion. You exclude people, you discriminate, all that stuff."}
{"episode_id":"SW - #087 - 2020-01-08 - Benjamin Boyce - Masculine Actualities and Feminine Possibilities","start":958,"end":959.44,"speaker":"Benjamin Boyce","text":"Like shame."}
{"episode_id":"SW - #087 - 2020-01-08 - Benjamin Boyce - Masculine Actualities and Feminine Possibilities","start":959.6,"end":989.67,"speaker":"Jonathan Pageau","text":"Exactly. So acts of purity. And to the Nazis were wanted. Purity. And all of this is this evil thing, like a pure race, a pure people, a pure identity. All of this is bad. And so they were like, why do people engage in this? And this lady asked Me this question. She said, why do people engage in purity? Why do they engage in that type of behavior? And I was like, I couldn't believe this question. I thought the reason why she asked me this question is because she's not able to think at all levels at the same time. Right?"}
{"episode_id":"SW - #087 - 2020-01-08 - Benjamin Boyce - Masculine Actualities and Feminine Possibilities","start":989.67,"end":992.35,"speaker":"Benjamin Boyce","text":"She's not even able to think at two levels at the same time."}
{"episode_id":"SW - #087 - 2020-01-08 - Benjamin Boyce - Masculine Actualities and Feminine Possibilities","start":992.67,"end":1132.98,"speaker":"Jonathan Pageau","text":"And so I said, you know, so I said, okay, let's take a case study. It's like, let's say you have guests at your house and they're staying over for dinner and then they're hanging out. And they're hanging out and you're looking at the time and then it's like, you know, it's 11 and it's 11:30 and it's 12 and it's one o' clock in the morning and the guests are still there. It's like at some point you are going to ask the guests to leave. And when you ask the guests to leave, you are engaging in an act of purity. You are saying, this is my home, this is my house, this is my thing, my family, whatever. Like, it can be just. You could be your family. And then you have people who come, you have guests who come, and at some point it's great, you have disengaged, but at some point they have to go because you need to find your identity again. You need to find. So you're actually engaging in an act of purity by at some point having your guests go out the door and closing the door, locking your door, and then you go to bed. It's like that, that is an act of purity. And it's totally fine to do that, but you could have the same. Imagine the same situation where someone comes to your door, knocks on the door and wants to just ask you something, and you open the window and you scream, you say, get out of here, I'm going to call the cops. And so that's also an act of purity. It's just one is normal and one is excessive. So it just depends. But you have to be able to think at all levels. And so when you talk about immigration, it's like people aren't able to think. Also to understand it, you will have to find some level of purity in terms of immigration. The question is, what is too much? What is normal? What is a normal level of hospitality? Or what is a normal level of engaging with that which is foreign or that which is new or strange or the stranger, whatever. Like, you need to just find that balance. But if you're not able to think about it, and you just think, purity bad. Then you're gonna. Then it's gonna come back. It's gonna come back and you're gonna engage in it in ways that you don't realize. In the way, like, for example, when you see social justice activists engage in extreme acts of purity without even realizing that they're reproducing the very thing that. That they hate, the very thing that they're trying to fight in terms of white privilege or all this stuff that they go after."}
{"episode_id":"SW - #087 - 2020-01-08 - Benjamin Boyce - Masculine Actualities and Feminine Possibilities","start":1133.78,"end":1176.72,"speaker":"Benjamin Boyce","text":"Yeah, I was just thinking about that because I'm working on the Evergreen documentary, and there's this extended hour of students going off about how much they hate the police. And at the end of this session, they all start to focus on one man who's typing on their phone and start accusing him of taking pictures and uploading them to, like, Breitbart or something like that. And then. And then you see that they really love to police. They don't want to be policed. They want it like community policing is them having the power, which doesn't really shake out because it's just the will of the mob and whoever can claim the most victimhood and stuff like that. It's crazy."}
{"episode_id":"SW - #087 - 2020-01-08 - Benjamin Boyce - Masculine Actualities and Feminine Possibilities","start":1176.96,"end":1229.2,"speaker":"Jonathan Pageau","text":"Yeah. And I think that that's why, if you're able to think about these things clearly, then you don't. You don't get stuck with them by accident. And that's always the thing. It's like if you don't deal with reality, like if, for example, if you don't. If you think that we talked about the idea that God, let's say there's an aspect of God which is like. Which is harsh, let's say, that has a harshness to it. If you don't want to engage with that and think about it in a reasonable manner, then it's going to come back to bite you and you're going to find yourself acting like that, and you're not going to realize that you're doing it as you're saying how it's horrible that the God of the Old Testament has harshness to him, and then you'll end up doing it because it's part of reality. It's an aspect of reality that you have to deal with in a balanced manner."}
{"episode_id":"SW - #087 - 2020-01-08 - Benjamin Boyce - Masculine Actualities and Feminine Possibilities","start":1230.88,"end":1266.48,"speaker":"Benjamin Boyce","text":"Do you think that? No, it does. I would like to explore how do we diagnose that leveling of thought without necessarily getting conspiratorial and saying that like the mainstream media is doing. I think we're doing it to ourselves. But maybe, maybe, like, maybe it's working to the advantage of some people. But what do you think it is about in modern times? You said, or you framed it as a modern problem. What is it about modernity that has led us into, you know, this leveling of thought or this, this almost, not even binary, because they can't see the flip side?"}
{"episode_id":"SW - #087 - 2020-01-08 - Benjamin Boyce - Masculine Actualities and Feminine Possibilities","start":1267.76,"end":1352.16,"speaker":"Jonathan Pageau","text":"Well, I think it's horrible to say this, but I think it's the. It's not horrible, but a lot of people will be annoyed that I say this, but I think it is in a certain manner the fact that scientific thinking has, let's say scientific thinking has taken over the horizon of thought and that people want to approach everything as if it is equivalent to a scientific problem. Because scientific problems are usually quantitative and they're usually phenomena that is measured in terms of quantity. But if you want to think at different levels, you can't level everything like that. You can't. You have to be able to see hierarchies of purpose, hierarchies of. Hierarchies of reasons why things exist, hierarchies of beings even. And you have to be able to see it that way. And that's why there's so much going on right now, which is good in the sense that the fact that everybody's trying to talk about emergence, complex systems, all of this stuff is showing that the simplistic leveling of thought that we had only 50 years ago, or for sure 100 years ago, has run its course. And now we have to try to find, to understand that in fact the world has levels like it manifests itself in hierarchies of beings. And you can't, you can't avoid that."}
{"episode_id":"SW - #087 - 2020-01-08 - Benjamin Boyce - Masculine Actualities and Feminine Possibilities","start":1353.92,"end":1390.06,"speaker":"Benjamin Boyce","text":"Do you think that it was necessary to kind of clean up all the symbolic. The problem with symbolic thinking is that it can get really messy and get really associative. I mean, you can have a very rich dialogue with the tarot deck, but you can also kind of get lost in it, right, and just allow it to see everywhere. You know, you can kind of go astray. And the scientific mindset is to snap it down into a literal this than that kind of way. So was it not necessary to kind of go through that, at least to contact the physical world in a way where we can completely master it or manipulate it?"}
{"episode_id":"SW - #087 - 2020-01-08 - Benjamin Boyce - Masculine Actualities and Feminine Possibilities","start":1391.26,"end":1470.28,"speaker":"Jonathan Pageau","text":"I think yes, if what you want is to make better pavement or to have energy efficient windows or whatever, like whatever it is that technology does and science does. But when you try to turn that thought back on the human person, you run into serious problems. Like you run into serious problems. Because, because we do have hierarchical thought. We do have, we do have. We do use metaphor. We do use analogies. We are, we are beings that thrive on meaning and on analogy and on pattern. And so if you, and so if you just try to eliminate that when analyzing a human person, then you, then you run into serious problems. And so although, let's say analogical thinking can be problematic, can be messy, it's also the way in which you can move up the different levels, like the different levels of being. If you want to understand a, let's say how a group works, or a city or a nation. If you can't understand the analogy between a person and a city and a nation, if you don't see that there are analogies at those different levels of being, then you're going to really, you're going to have some serious problems."}
{"episode_id":"SW - #087 - 2020-01-08 - Benjamin Boyce - Masculine Actualities and Feminine Possibilities","start":1470.52,"end":1508.87,"speaker":"Benjamin Boyce","text":"You know, I do see that, like my original diagnosis when I first started talking about just the evergreen phenomena on YouTube was that they are trying to take a sociological level of thinking about groups and apply it to the individual. And it completely destroys the individual on a variety of levels, beginning with their agency, their responsibility, their self worth, their self respect. And then the respect and agency towards other people, like, it completely ruins like the bonds between the particles because it's looking at."}
{"episode_id":"SW - #087 - 2020-01-08 - Benjamin Boyce - Masculine Actualities and Feminine Possibilities","start":1509.03,"end":1704.8,"speaker":"Jonathan Pageau","text":"Well, they're trying to swallow. And that's it. So imagine you have a hierarchy. And this is what I talked about when the problem of hierarchies is that you can have a hierarchy that tries to swallow its parts, right? Tries to completely consume its parts so that its parts don't have independent existence, right? And so that is what happens in ideological groups. That's what happens in the religious sects, like cults and stuff, where it's like everything. Or, you know, when you have like a really charismatic leader and then everybody just gets totally sucked into that person. It's as if the people that are under him become almost like members of his body. Like they're just extensions of him, right? And so that is, that is, that is extremely dangerous when that happens. Because the way one of the things I talk about is love, I tried to explain that love is the balance between unity and multiplicity. So if you, let's say you have a family and there's love in that family, there will be enough communion, there'll be enough to make you a unit, to make you a whole. But the very same process, the love, would also make you respect the individuality of each person. And so the way to find a way to Balance is to always be moving between unity and multiplicity, to always be finding. It's hard to find the exact. It's never the same, it moves. But it's like a dance where you're dancing and you're always trying to find the balance between making sure everybody has their own existence and everybody is also aimed towards the same goal or moving towards each other. And that's communion, that's love. That's basically what Christianity is supposed to be, is to have that play. And it happens. So it happens between people, then it happens between. So you have. In Christianity, you have this idea that we're the body of Christ. And so it's like Christ is above and we're the body. And then we are well fitted together through love. So we love each other and that makes us join with Christ without losing our individuality. And then all of that, it's like all of that can be the way that the whole world exists. Like all of creation, all of reality is always playing between multiplicity and unity in order to find that balance where everything can continue to exist in, in. In. In a cohesive manner. But when you have ideological groups, like you said, it's. What happens is they try to impose the higher identity, let's say the group identity, the race, the gender, whatever. They try to impose it in a manner which is tyrannical all the way down. It's like everything has to just be a manifestation of this thing that unites us, right? So if you're a man, it's like, I have identified the things of man. And you're. That's all you are. You're not Benjamin. You're not all these other things that you are. You're not a complex system of different aspects. You're just a man. And I'm going to judge you completely based on that one thing, and that's. That destroys the world. Like, you can't. The world can't exist that way."}
{"episode_id":"SW - #087 - 2020-01-08 - Benjamin Boyce - Masculine Actualities and Feminine Possibilities","start":1705.36,"end":1745.79,"speaker":"Benjamin Boyce","text":"Well, it's interesting because, and I don't mean to offend anybody by saying this, but if that, that rigidity of thought like that, that man category is your full existence that defines every aspect of your character. But then that doesn't really work in this system of thought. So they build in the self ID clause where now you can identify with the other category and nobody can question you. You can just jump entirely into this other category and get all of the strengths and weaknesses of this completely other category. So it's one way to do a loophole that actually shows how maddening these categories are."}
{"episode_id":"SW - #087 - 2020-01-08 - Benjamin Boyce - Masculine Actualities and Feminine Possibilities","start":1745.95,"end":1819.77,"speaker":"Jonathan Pageau","text":"Yeah, but it's an interesting thing because it also. But then it also ends up happening. The same thing happens in that case too, even almost to a higher degree where, you know, especially in these kind of variant. In these variant, like sexual identities, like when someone latches on to an identity, even if there is a thousand, even there's like a hundred of them, then it's almost as if. I mean, they're swallowed up by that thing. And so it's as if it ends up being all they talk about, all they. All they live for, all their whole identity has been swallowed up by this one thing. Whereas usually it's like they say, you or I. It's like, I, yes, I am a man, but I'm also. I'm also the father, and I'm also. I also have this job and I also have interests and I also have. And these things. And I'm also a member of a church. I'm member of this. It's like. So it's like I have all these aspects of my personality which are. Which are dancing together in order to create Jonathan Pedro. But like, there's not one aspect of myself which is completely swallowing me, you know?"}
{"episode_id":"SW - #087 - 2020-01-08 - Benjamin Boyce - Masculine Actualities and Feminine Possibilities","start":1819.77,"end":1820.25,"speaker":"Benjamin Boyce","text":"Yeah."}
{"episode_id":"SW - #087 - 2020-01-08 - Benjamin Boyce - Masculine Actualities and Feminine Possibilities","start":1820.33,"end":1868.68,"speaker":"Jonathan Pageau","text":"And I think that that's, That's. That's a really. It's a dangerous. Because it's really difficult. It's really difficult to talk with people to whom that has happened. Like, if you meet someone that has been completely swallowed up by that one identity, I mean, and it could be any, anything. It can be race, could be nation, too. You meet someone who is like super nationalistic. It's as if you can't. It's really difficult to talk to them because they, they. They're so, like, their visors are on so straight, you know, and then they interpret everything through their thing. It's like meeting a conspiracy theorist. You know, they have this one thing and it's like the whole world has to fit in this one thing and they can't view other, Other. Other. Other types of relationships. Mm."}
{"episode_id":"SW - #087 - 2020-01-08 - Benjamin Boyce - Masculine Actualities and Feminine Possibilities","start":1868.76,"end":1875.72,"speaker":"Benjamin Boyce","text":"And how do you. Have you seen people, like, go through that and then come out the other side and have you seen that kind of break down?"}
{"episode_id":"SW - #087 - 2020-01-08 - Benjamin Boyce - Masculine Actualities and Feminine Possibilities","start":1876.76,"end":1928.49,"speaker":"Jonathan Pageau","text":"Yeah, I think, I think it is possible. I think it is possible to not. I think it is. I think it is possible to be possessed by something, and it really is a form of possession. You know, it is possible to be possessed and then to kind of free yourself from this, from possession. And I think, I mean, I think I've seen it in the past few years. I've seen A lot of that. I think Jordan Peterson has kind of broken down a bunch of doors in that sense where people, some people who were really kind of caught up in an ideology on both sides of the, of the fence have been able to kind of clear the. Open their visors up a little bit and be able to see that the world is bigger than your thing like that. Identities, you can't reduce everything to one identity. It just doesn't work that way."}
{"episode_id":"SW - #087 - 2020-01-08 - Benjamin Boyce - Masculine Actualities and Feminine Possibilities","start":1928.89,"end":1931.13,"speaker":"Benjamin Boyce","text":"Or even just a multiplicity of identities."}
{"episode_id":"SW - #087 - 2020-01-08 - Benjamin Boyce - Masculine Actualities and Feminine Possibilities","start":1931.53,"end":1932.09,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #087 - 2020-01-08 - Benjamin Boyce - Masculine Actualities and Feminine Possibilities","start":1933.69,"end":1941.61,"speaker":"Benjamin Boyce","text":"How do you, what are some of the steps that you think that could happen or help that process, facilitate that."}
{"episode_id":"SW - #087 - 2020-01-08 - Benjamin Boyce - Masculine Actualities and Feminine Possibilities","start":1941.61,"end":1942.97,"speaker":"Jonathan Pageau","text":"Process of man."}
{"episode_id":"SW - #087 - 2020-01-08 - Benjamin Boyce - Masculine Actualities and Feminine Possibilities","start":1945.45,"end":1950.09,"speaker":"Benjamin Boyce","text":"Identity idolatry? There's some sort of complex there."}
{"episode_id":"SW - #087 - 2020-01-08 - Benjamin Boyce - Masculine Actualities and Feminine Possibilities","start":1950.57,"end":2016.63,"speaker":"Jonathan Pageau","text":"Yeah, man. I think for sure, for sure. I think that one of the things that can help is contact with other people in the sense that a lot of time these like narrow, narrow furrows are dug because you end up in these, you know, where they, they call them these, these bubbles or whatever. These, these, these ideological bubbles. And so, so, so people aren't actually meeting others who are different from them and that, that they just don't have other identities that are not even, they're not even in your, on your spectrum. Like, you know, especially. It's so funny because it's like you meet the, the really woke types and I always want like, I wish a lot of the woke types would go and just hang out with just poor people and realize that even. It's so funny because even in terms of racism, you know, I used to be, I actually used to be pretty. I used to be pretty woke myself. Like when I was a teenager, I was the guy who would always like stand up and if someone is making some kind of racial joke, I would always call them out in public and like anyways."}
{"episode_id":"SW - #087 - 2020-01-08 - Benjamin Boyce - Masculine Actualities and Feminine Possibilities","start":2016.95,"end":2020.35,"speaker":"Benjamin Boyce","text":"But I was always the guy calling out the guy that's calling everybody else really."}
{"episode_id":"SW - #087 - 2020-01-08 - Benjamin Boyce - Masculine Actualities and Feminine Possibilities","start":2020.35,"end":2154.6,"speaker":"Jonathan Pageau","text":"There you go. That's good. But, but then when I started meeting like poor people, I realized that they just had another. There's a completely other way of looking at things. Completely other way of. And so you go to a poor neighborhood where there's. You meet a poor white guy who has way more chance to have in his job around him to have people from other races and he'll have a kind of weird, like kind of weird low level racism to him, you know, and it's all, it's, it's, it's in words and it's kind of like, ah, these guys are like this, these guys are like that. And it's kind of off putting at first. Then when you, when you look at them and you kind of explore their world, you realize, okay, yeah, they say that, but then they'll have lunch with this guy who's Mexican or this guy who's from here or whatever. And you know, it's like, if you ask them, it's like, oh no, it's not, it's not a big deal. Like he's not like that, you know, and it's not thought out, but there's like an organic reality which is that even though they can use certain words and they have certain discourse, it tends in real life they actually have more contact with other groups than these liberal woke elites that have barely any contact with people from other types of people. And so they're policing their language and they're policing their thought, but they're not actually engaging with people that are different from them. And so it's like I would, I really prefer some working class guy who once in a while will say something that is off putting and kind of racist but in reality is way more, is actually probably way more, way more possible he's gonna end up dating a Mexican girl or some Vietnamese girl or whatever. Just because in real life it's like, you know, it's like he's actually in contact with people from other groups. Groups. That makes sense. But that's kind of the thought that I've, at some point I've kind of come to where it's like there's this weird political thing and then there's just reality where it's like people are messy, people say stupid things, people, people don't think things out. But if they're just basically good people, in the end it's not going to, it's going to play out fine."}
{"episode_id":"SW - #087 - 2020-01-08 - Benjamin Boyce - Masculine Actualities and Feminine Possibilities","start":2154.6,"end":2222.6,"speaker":"Benjamin Boyce","text":"You know, it seems that there is a, there's some sort of. You brought up purity earlier and it seems like on that, that kind of earthy blue collar racism, it's. They're playing with or they're just evincing a natural category and they're playing with the category by pointing it out. And they, they even know that this is a, this is a way that they can distinguish themselves from the pure class, the aristocrats, in a way. So it's kind of like virtue signaling among their kind. They can take the joke and give the joke. They're free to do that in a way. Whereas the aristocrats are, the puritanical class aren't able to do that. But the danger is, is when you have somebody that starts playing around with that rhetoric on the national scale, which, which Trump did and continues to do. And I'm not going to say that Trump is necessarily fascist, but he likes to, he likes to play with that. And, and it gets really a little too close to comfort because you can start to play around with those. Once those, those kind of earthy, friendly tensions replicated on another scale, they actually do turn into tyranny."}
{"episode_id":"SW - #087 - 2020-01-08 - Benjamin Boyce - Masculine Actualities and Feminine Possibilities","start":2222.6,"end":2273.88,"speaker":"Jonathan Pageau","text":"No, I agree. No, I agree. I agree that, that you do see that, and you do see that in some populist movements where the, let's say the leader will spot normal tensions or just normal differences that exist, you know, and that people notice and make jokes about or whatever, and then they can use it to get attention and also to unify, because it does work. You can unify someone by pointing to a stranger. It actually works. It works in the social justice world as much as it works on the right wing. If you can find the person who has to be canceled, then you make your group stronger. And so I definitely agree that it can happen and it does happen, and it definitely has happened in history, that's for sure."}
{"episode_id":"SW - #087 - 2020-01-08 - Benjamin Boyce - Masculine Actualities and Feminine Possibilities","start":2274.68,"end":2302.93,"speaker":"Benjamin Boyce","text":"It's interesting because Bernie Sanders tweeted a couple weeks ago about how billionaires shouldn't exist or something like that, which is interesting. It was like this politics of this unity by anger, unity by hatred. And, and I'm always just wary of that. But it seems like there's a. Well, yeah, and then it's like, okay, 150,000 heirs, should they."}
{"episode_id":"SW - #087 - 2020-01-08 - Benjamin Boyce - Masculine Actualities and Feminine Possibilities","start":2302.93,"end":2317.73,"speaker":"Jonathan Pageau","text":"Yeah, I think they should exist. I think. Is there a word for that? 100,000 heirs. Rich are always, always relative. It's like, it's so funny because Bernie Sanders is a millionaire. I'm not a millionaire. Hey, Bernie, you shouldn't exist. What are you talking about?"}
{"episode_id":"SW - #087 - 2020-01-08 - Benjamin Boyce - Masculine Actualities and Feminine Possibilities","start":2318.45,"end":2355.95,"speaker":"Benjamin Boyce","text":"Well, it's interesting because it seems like a tactic to pick a group that you can't, that you would slander yourself to defend. If I started to defend a billionaire, like there's a built in incentive not to defend the billionaire. It's, it's this little hack and the same rhetoric with anti racism. If you start to criticize anti racism, that means because you're racist. Right. Like it's built in. And I don't know if it's purposely built in or not, but it just works that way to revolution the self reinforcing system that then leads down this road of categorical thinking."}
{"episode_id":"SW - #087 - 2020-01-08 - Benjamin Boyce - Masculine Actualities and Feminine Possibilities","start":2355.95,"end":2376.03,"speaker":"Jonathan Pageau","text":"Yeah. And you have both, you have both sides. And that's the history of the 20th century or the 19th to 20th century. It's like you have let's say the left or on the left you'll have the desire to criticize the aristocracy because like you said on that side anybody who is above you is fair game. Right?"}
{"episode_id":"SW - #087 - 2020-01-08 - Benjamin Boyce - Masculine Actualities and Feminine Possibilities","start":2376.9,"end":2377.18,"speaker":"Benjamin Boyce","text":"Yeah."}
{"episode_id":"SW - #087 - 2020-01-08 - Benjamin Boyce - Masculine Actualities and Feminine Possibilities","start":2377.18,"end":2417.61,"speaker":"Jonathan Pageau","text":"And then you have the other side, which is that anybody who is strange, anybody who is, who is an exception and he's on the margin is fair game, you know. And, and the thing that's interesting is that on both, on both sides you end up dealing with a minority. Like you're, you're dealing with a minority of people. And so it's easy to focus on them because we're the majority, they're the minority. Either the aristocracy or the, the foreigners or the people who are weird are just different from us. And so we can just like we can, we can point to them and say it's their fault that everything is going wrong. So it's the same game, you know."}
{"episode_id":"SW - #087 - 2020-01-08 - Benjamin Boyce - Masculine Actualities and Feminine Possibilities","start":2418.09,"end":2444.31,"speaker":"Benjamin Boyce","text":"Yeah. You just made me think. Because there's that term punching up which the left allows you to punch up, whereas the right's more. You punch out. You punch to the out group. And it's interesting, I'm totally getting woo woo symbolic here. But like it's. The left has a problem with authority in the, on the vertical axis and the, the right will kind of vilify that which is the horizontal axis or the, the outsider in a way."}
{"episode_id":"SW - #087 - 2020-01-08 - Benjamin Boyce - Masculine Actualities and Feminine Possibilities","start":2444.31,"end":2543.99,"speaker":"Jonathan Pageau","text":"Yeah. And it really is, I always say like this, I've been saying this forever, that the, I think the modern world is a deincarnation. It's. As we move away from Christianity, we're actually seeing a deincarnation. And so we, things tend, things are pulling apart in a manner. So for example, like that cross, that is how reality exists. Right. For those two to come together. Right. For that we, the, let's say the inevitability of hierarchy. But that the reason for hierarchy is so that those that are above care for those that are below. Like that. Let's say that's the Christian answer. Let's say that's the, that, that's the Christian description of the world. But if you have, if you pull it apart then it's like you have just hierarchies that are hierarchies of power. And then you end up having the grumbling of the, of the lower, lower groups who are grumbling against the authority. And so it's like it's pulling apart and then it gets really crazy at some point because at some point that thinking can become very extreme where you, let's say you actually think that those that are different from you. Let's say the foreigners or the, the people outside of your country are better than you. Like that's the extreme of, let's say the left versions. And then you have the idea that the people that are different from you or outside of you are parasites, they're rats, they're insects, they're like in the Nazi era or the Tutsi genocide. It's like these are the extremes that we have to be really careful not to, not to go because they're easy."}
{"episode_id":"SW - #087 - 2020-01-08 - Benjamin Boyce - Masculine Actualities and Feminine Possibilities","start":2543.99,"end":2551.83,"speaker":"Benjamin Boyce","text":"The magical immigrant. I was just reading a write up at Evergreen about. They talk about the magical outsider. You know, you're like, okay, really?"}
{"episode_id":"SW - #087 - 2020-01-08 - Benjamin Boyce - Masculine Actualities and Feminine Possibilities","start":2551.83,"end":2552.39,"speaker":"Jonathan Pageau","text":"Okay."}
{"episode_id":"SW - #087 - 2020-01-08 - Benjamin Boyce - Masculine Actualities and Feminine Possibilities","start":2552.63,"end":2554.15,"speaker":"Benjamin Boyce","text":"You have access to all this special."}
{"episode_id":"SW - #087 - 2020-01-08 - Benjamin Boyce - Masculine Actualities and Feminine Possibilities","start":2554.63,"end":2598.9,"speaker":"Jonathan Pageau","text":"It's just falling into this. Do this dialectic, this, like this breaking apart of. This breaking apart of the world and then coming to see everything in that, that, that, that vision. There's going to come a point, and I think it's already there, where people are going to think that like robots are better than us, that robots are more human than we are. We've already seen narratives like that, already seen narratives where. I think, was it, what was it? It's iRobot. Where robot. It's like the robot that is, that is moral and we are immoral. It's the apes. Planet of the Apes. That's a great example. The apes are the good guys, the humans are the bad guys. That is that dangerous narrative of seeing that which is outside as better than the inside."}
{"episode_id":"SW - #087 - 2020-01-08 - Benjamin Boyce - Masculine Actualities and Feminine Possibilities","start":2600.33,"end":2603.77,"speaker":"Benjamin Boyce","text":"Why is that so dangerous? Because it devalues."}
{"episode_id":"SW - #087 - 2020-01-08 - Benjamin Boyce - Masculine Actualities and Feminine Possibilities","start":2604.73,"end":2606.49,"speaker":"Jonathan Pageau","text":"You're going to cease to exist. That."}
{"episode_id":"SW - #087 - 2020-01-08 - Benjamin Boyce - Masculine Actualities and Feminine Possibilities","start":2606.49,"end":2610.01,"speaker":"Benjamin Boyce","text":"Or what does it do? What's the outcome of that?"}
{"episode_id":"SW - #087 - 2020-01-08 - Benjamin Boyce - Masculine Actualities and Feminine Possibilities","start":2610.17,"end":2710.03,"speaker":"Jonathan Pageau","text":"Well, the outcome of that is that you're, I mean, the outcome of that is that you'll, you'll, you'll. You'll drown. Like, you'll just drown and you'll stop. You'll just cease to exist. Because, because you can't. Let's say. How can I say this? It's like, like if you, I mean, I can give you an example. I can give you an example of. I try, I always try to bring it close to home so that, you know, right. So you can see. Because if you make it too, people stop seeing it. But like you, you, you have your house. And then let's say you have that thinking where you think that those that are outside of your house are better than you, that they're magical, that they're, that they're this, this image of ethics and everything. And so then you, so let's say you, you, you, you see Someone who's in trouble outside. And you say, you know, you see a homeless person, you say, well, you should come live in my house, right, because you're actually better than me. And you invite them in, and then you invite another one in, and you invite another one. Let's say you invite 50, because there's an indefinite amount of them. There's always more on the outside than there is on the inside. That's just the nature of reality, of any identity, always has more on the outside. So you're like, okay, well, let's just invite everybody who needs something to come live in my house. Well, how long before you cease to exist? Like, how long before your family doesn't exist anymore? I would say even before you reach, like, the equal amount of people in the family. Like, if you. Let's say you're three people or four people in your family and you have another three people live in your house, your family is going to stop existing. So that's just reality. It's like that for. How can I say this? It's like that for everything."}
{"episode_id":"SW - #087 - 2020-01-08 - Benjamin Boyce - Masculine Actualities and Feminine Possibilities","start":2712.27,"end":2731.13,"speaker":"Benjamin Boyce","text":"Is there a word that's the opposite of hierarchy or not the opposite of hierarchy, as in, like, just inverting the hierarchy, but, like, what is that principle that organizes the horizontal plane? Is there one? Do we just take it as granted that geography exists and that there's a line around us?"}
{"episode_id":"SW - #087 - 2020-01-08 - Benjamin Boyce - Masculine Actualities and Feminine Possibilities","start":2732.17,"end":2809.15,"speaker":"Jonathan Pageau","text":"To me, let's say the counterweight or the balance of hierarchy. You could call it something like a frame, or you could call it a question. You could call it a space. All those images, they're really feminine images. Jacques Derda talks about Korra, like, the space. He has a book on that. And it is very good in terms of trying to understand the problem of articulating the space without naming it, because this is one of the reasons why it's difficult to talk about. It's difficult to show the value of the feminine because you have to be careful not to make it masculine. As soon as you try to show the value of it. You know, it's like if you give a medal to the feminine, then it's like you're playing the game. You're playing the masculine game. By doing that, you're, you know, you're giving a prize. You're. You're doing all these things which are kind of like these weird hierarchical things of winners and losers and all that. But it's like if you want to actually admire, venerate the feminine, then it's another game. It's another. It's another type of interaction."}
{"episode_id":"SW - #087 - 2020-01-08 - Benjamin Boyce - Masculine Actualities and Feminine Possibilities","start":2811.63,"end":2819.39,"speaker":"Benjamin Boyce","text":"Does that happen through art? Better than words, I guess. The visual rather. Or the sensual rather. The musical, maybe."}
{"episode_id":"SW - #087 - 2020-01-08 - Benjamin Boyce - Masculine Actualities and Feminine Possibilities","start":2819.39,"end":2819.87,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #087 - 2020-01-08 - Benjamin Boyce - Masculine Actualities and Feminine Possibilities","start":2819.95,"end":2820.99,"speaker":"Benjamin Boyce","text":"Yeah, maybe."}
{"episode_id":"SW - #087 - 2020-01-08 - Benjamin Boyce - Masculine Actualities and Feminine Possibilities","start":2820.99,"end":2859.01,"speaker":"Jonathan Pageau","text":"But I think that, like I said, understanding the value of a question, understanding the value of the opening or the frame of a discourse, something you usually don't see but is there. It's necessarily there. I think that that is how you. But it's usually there's like a weird, secretive power to it. It has, like, a secret power, you could say. And it's like, once you understand, let's say that without a question, there's no answer, that the question comes first."}
{"episode_id":"SW - #087 - 2020-01-08 - Benjamin Boyce - Masculine Actualities and Feminine Possibilities","start":2859.09,"end":2859.49,"speaker":"Benjamin Boyce","text":"Quest."}
{"episode_id":"SW - #087 - 2020-01-08 - Benjamin Boyce - Masculine Actualities and Feminine Possibilities","start":2859.73,"end":2895.95,"speaker":"Jonathan Pageau","text":"Right. The quest comes first. And so it's like the need comes first. Right? So it's like. That is extremely powerful. It's powerful if you understand it even in terms of, let's say, a religious language, which is that you pray. You pray so that the world will happen in a certain way. You open up a space for the divine to manifest itself. I mean, that is. That is extremely powerful."}
{"episode_id":"SW - #087 - 2020-01-08 - Benjamin Boyce - Masculine Actualities and Feminine Possibilities","start":2897.79,"end":2954.13,"speaker":"Benjamin Boyce","text":"But there's a. Yeah, it is mysterious. I remember trying to. During my youth group era, trying to get people to define what prayer is. And, you know, because they would. They would talk about what. It's not like you're wishing for a new car, but, like, really getting into the nitty gritty of how do you have an intention that's open? Like, how do you become. How do you become a flashing cursor? You know, where. Where you're not overstepping the bounds of reality, but you're. You're allowing that space to. To happen and initiating. It's a whole level of psychological preparation or this facing towards reality that's got me into studying mysticism more. Because the direction that that goes is preparing your awareness and becoming aware of your consciousness and working on that."}
{"episode_id":"SW - #087 - 2020-01-08 - Benjamin Boyce - Masculine Actualities and Feminine Possibilities","start":2954.61,"end":3090.29,"speaker":"Jonathan Pageau","text":"I agree with you. And I think that to understand the. The power of a question and to understand the power of opening up a space or presenting a need which is authentic, I think is extremely powerful. I tell this story a lot, but there's a story in the Gospel at the wedding of Kana, which is really revealing in terms of understanding this, where there's this idea that Christ is hidden, that Christ has not yet shown himself to the world. No one knows who he is. Really. The only person who knows who he is is his mother. And his mother comes to him, and at this wedding, they run out of wine. And she comes to him and she says, they ran out of wine. And it's like. And then Christ answers. He says. He says, my time is not yet come. Which is like a crazy answer to say to something like, there's not enough win. There's no more wine. But when you understand, the subtext, when you understand is that she's saying, she's opening the door. She's saying, here's a problem. You're the divine, you're the Logos. You're the answer. Now you manifest yourself in this space. I'm giving you the space. I'm saying, here's a problem. And so. And what he understands is that if he does that he's actually entering on. He's opening. He's starting on down a road which is going to lead him to die, basically. And so she. It's like she's saying. She's like, she's opening the space. She's saying, now's the time. I'm open. Here's the question. You start. You start to answer it. And so she's actually acting as like this. The opening up of his ministry, the opening up of his entering, of showing himself to the world. It's like, it's her request which starts it. And you see that in the history of Christianity, all through the history of Christianity, it's crazy. It's systematic. You can do a search on your own. There's always a woman who converts first. So, for example, the mother of Constantine, the mother of Vladimir of Kiev. The."}
{"episode_id":"SW - #087 - 2020-01-08 - Benjamin Boyce - Masculine Actualities and Feminine Possibilities","start":3090.98,"end":3091.22,"speaker":"Benjamin Boyce","text":"The."}
{"episode_id":"SW - #087 - 2020-01-08 - Benjamin Boyce - Masculine Actualities and Feminine Possibilities","start":3091.78,"end":3113.54,"speaker":"Jonathan Pageau","text":"It's always like a wife or a mother. For every king, every emperor, every important person that converts, there's always a woman who converts first. And then there's a secret exchange. We don't hear about the exchange. There's like a secret thing, and then the visible figure converts. And then like, the whole country converts or whatever. But that's the structure of being."}
{"episode_id":"SW - #087 - 2020-01-08 - Benjamin Boyce - Masculine Actualities and Feminine Possibilities","start":3116.83,"end":3148.91,"speaker":"Benjamin Boyce","text":"What about that coming into being in our world right now? Like, how would that. That prompt surface in this time right now, where there's these really extreme, rigid madnesses happening, you know, where people are completely lost their. Their balance? What, What. What's the frame? What's the. What's the secret question? What's. What's the. What's the need right now? How do we. How do we get to a point where. Where we start to ask that, Create that space for that central figure, that centrist."}
{"episode_id":"SW - #087 - 2020-01-08 - Benjamin Boyce - Masculine Actualities and Feminine Possibilities","start":3148.91,"end":3164.79,"speaker":"Jonathan Pageau","text":"That's crazy. That's tough. I never. I don't know why. Like, it's like, I haven't even thought about that, but I should be thinking about that. It's like, of all people, I should be thinking about that. And what's the. Like, what's the question or what's the opening up? Hmm."}
{"episode_id":"SW - #087 - 2020-01-08 - Benjamin Boyce - Masculine Actualities and Feminine Possibilities","start":3165.27,"end":3185.84,"speaker":"Benjamin Boyce","text":"I mean, because it seems like if we look at Peterson's work. Well, we can work at Peterson's work, but I'd like to look at your work. Like, the way that your work is interacting with people is that you are. You're saying, wait, there's something more here. There's. Look at. Look at this movie. There's something more here. Like, what is. What is playing out here? There's a."}
{"episode_id":"SW - #087 - 2020-01-08 - Benjamin Boyce - Masculine Actualities and Feminine Possibilities","start":3187.92,"end":3258.47,"speaker":"Jonathan Pageau","text":"I mean, maybe this is. So Maybe now it's like you got me thinking in a way that I never thought before, which is good. Which is good. Maybe that is that in a way that's been what I've been trying to do from the. From the beginning in the sense that it's like one of the things that I'm trying to do is actually help people see the world differently. So it's like I'm not trying to change the terms of what's being said. I'm just trying to say your frame by which you interpret the world is lacking. You need something which is more connective and connects the different layers of reality together. So I have to think about it. Maybe that, in a way, is a feminine move. Like, in the sense of saying. It's like it's not the terms, it's not the things that are in the story. It's the fact that you've lost the frame. And because of that, you don't understand how powerful the story is. You don't understand how deep it goes and how it connects everything together. Because you've limited. You're limited in your frame. Maybe that's interesting to think about that."}
{"episode_id":"SW - #087 - 2020-01-08 - Benjamin Boyce - Masculine Actualities and Feminine Possibilities","start":3259.19,"end":3330.09,"speaker":"Benjamin Boyce","text":"You know what? Maybe I'm gonna get in trouble for saying this, but, like, we're secret feminists in a way. In the way. Well, in a way, like, I'm thinking about, like, my. I had this. I have this analogy about, like, the work that I do and that it's the. It's a metaphor based on, like, these role playing games, like these online role playing games where. Where five characters come together to defeat a problem. And there's a tank person who takes all the damage and has everybody focus their anger on him. And then there's the dps, which are the ones who do all the damage to kill the enemy. And then there's the healer that keeps everybody alive. And the way that my channel works out is that I have my tank, which is my documentary or like, the big question that I'm exploring and a long form. Then I had the dps, which is the little mouthy, snarky, tiny videos. But like, what keeps it all together, I think is the healer, which would be the. The interviewer, where I am no longer the actor. I am the, you know, I'm the audience. I mean, I become the audience. And. And that. That's principally a feminine spatial behavior."}
{"episode_id":"SW - #087 - 2020-01-08 - Benjamin Boyce - Masculine Actualities and Feminine Possibilities","start":3330.17,"end":3407.75,"speaker":"Jonathan Pageau","text":"That's totally right. The interviewer is a great. Is actually an amazing image of what you're talking about. Because what you're doing is you. By asking the questions, you're framing the discourse and you can give the authenticity. By framing the discourse properly, you have the power to open or close down spaces. And we see it all the time. Because when we watch mainstream interviews, or you watch certain types of interviews, you can see that the interviewer is actually trying to shut it down. Like in their question, they're actually trying to completely shut down the conversation. But if you can be a good interviewer and you're able to open up spaces, then I think you're right that that will be a healing thing. Just that without even, like you said, not even saying anything. Even if in your videos you can say things that people will find offensive. If when you engage people in conversation, you have this desire to open up a real space for them to exist, like you said, I think that's unbeatable. So, yeah, that's a great analogy. The video game ones. The video game thing is great. I love that."}
{"episode_id":"SW - #087 - 2020-01-08 - Benjamin Boyce - Masculine Actualities and Feminine Possibilities","start":3409.99,"end":3432.57,"speaker":"Benjamin Boyce","text":"You brought that image, which is really, actually nightmarish to me. Like somebody having the power to open and close space. That's very like primordial power to say, I'm going to close that down. It's like this ability to control possibility, not actuality, but like the precondition of actuality, which is possibility, which is."}
{"episode_id":"SW - #087 - 2020-01-08 - Benjamin Boyce - Masculine Actualities and Feminine Possibilities","start":3432.73,"end":3528.86,"speaker":"Jonathan Pageau","text":"And the thing is that most people don't see that. Most people don't see those preconditions. And so there's something magical about that capacity. You know, there's something magical because people don't realize that what you're doing, if you're asking the right questions, then people will. At the end, they might think that it's only the person answering the questions who had a place, who was discussing, but they can't see the opening, like you said, the pre. Logical. The opening of the space. They don't see how without that, things would be completely different. And so it is an extremely powerful thing. So if you look at my videos, like you said, we're secret feminists. It's like if you look at the logo for my YouTube channel. It took a while for people to realize that it's actually the creation of Eve. That's the story. That's the image. You have to see that it's like. Because I think that the modern world is overly masculine. It's too masculine. It's actually the feminine which is disappearing from the world. And so I think that. I think that that's a really dangerous place to be. And we see it in the reduction of community, the destruction of private space. All of this is being eclipsed. Everything is becoming public. Everything is becoming a form of showing yourself voyeurism and showing yourself. Everything is that. And so I think helping to open up the feminine space in a reverential way, I think is something that is vulnerable. Yeah."}
{"episode_id":"SW - #087 - 2020-01-08 - Benjamin Boyce - Masculine Actualities and Feminine Possibilities","start":3531.9,"end":3534.7,"speaker":"Benjamin Boyce","text":"This seems like we're ending on a high note. We should probably."}
{"episode_id":"SW - #087 - 2020-01-08 - Benjamin Boyce - Masculine Actualities and Feminine Possibilities","start":3536.46,"end":3548.46,"speaker":"Jonathan Pageau","text":"Sure. Yeah. I don't even know how long. I don't even know how long we've been talking. What time is it? Yeah, we've been going for, like, 45 minutes. We could totally finish here, and I think that'd be good. Good."}
{"episode_id":"SW - #087 - 2020-01-08 - Benjamin Boyce - Masculine Actualities and Feminine Possibilities","start":3549.18,"end":3552.7,"speaker":"Benjamin Boyce","text":"Cool. It's always a pleasure. Yeah."}
{"episode_id":"SW - #087 - 2020-01-08 - Benjamin Boyce - Masculine Actualities and Feminine Possibilities","start":3552.7,"end":3565.8,"speaker":"Jonathan Pageau","text":"We should do this more often. You've definitely got me thinking something that I've like, you definitely got me on the line that I'm going to finish this conversation. I'm going to go sit down and be okay. All right. Benjamin's messing with me. I gotta get through this."}
{"episode_id":"SW - #087 - 2020-01-08 - Benjamin Boyce - Masculine Actualities and Feminine Possibilities","start":3569.72,"end":3571.24,"speaker":"Benjamin Boyce","text":"Just open. Open to the question."}
{"episode_id":"SW - #087 - 2020-01-08 - Benjamin Boyce - Masculine Actualities and Feminine Possibilities","start":3571.56,"end":3572.2,"speaker":"Jonathan Pageau","text":"That's right."}
{"episode_id":"SW - #087 - 2020-01-08 - Benjamin Boyce - Masculine Actualities and Feminine Possibilities","start":3572.36,"end":3580.72,"speaker":"Benjamin Boyce","text":"Weird. Yeah. Yeah. I feel, like, full now. I feel like I need to go. Think we started poking something. There you go."}
{"episode_id":"SW - #087 - 2020-01-08 - Benjamin Boyce - Masculine Actualities and Feminine Possibilities","start":3580.72,"end":3583.2,"speaker":"Jonathan Pageau","text":"Well, thanks for doing what you do, by the way. It's great."}
{"episode_id":"SW - #087 - 2020-01-08 - Benjamin Boyce - Masculine Actualities and Feminine Possibilities","start":3583.2,"end":3593.67,"speaker":"Benjamin Boyce","text":"Yeah, well, you too, man. I mean, it's amazing. And I'm so glad that you guys are. You're having so much success and now you have, like, a Clips Channel. And it's fun."}
{"episode_id":"SW - #087 - 2020-01-08 - Benjamin Boyce - Masculine Actualities and Feminine Possibilities","start":3593.91,"end":3641.55,"speaker":"Jonathan Pageau","text":"It's definitely fun. And what's fun is, like, the Clips Channel, for example, is going to be run entirely by volunteers. It's like people are going to be running it for me. And so it's. For me, it's great because it's like people who are willing to make clips so that I know I'm going to end up knowing what it is that I'm saying that people are really latching onto. And so it's like, that's going to be helpful for me because then I can be mindful of that when I'm speaking. So I'm excited about that. I think that's the thing that's been the most exciting for Me is to watch people kind of all of a sudden have a new vision of the world and then kind of run with it. There's a new podcast coming out, new orthodox symbolism podcast that just started, and there are different people trying to get into that same space. So that's exciting. It's a lot of fun."}
{"episode_id":"SW - #087 - 2020-01-08 - Benjamin Boyce - Masculine Actualities and Feminine Possibilities","start":3642.35,"end":3678.31,"speaker":"Benjamin Boyce","text":"Well, earlier you were. I can't reconstitute what we were talking about, but I wanted to ask about that. You were talking about the individual, that if you frame everything in love, then the individual can go to the family, the family can fit into the unit, and then going up and down. And I'm like, well, you're putting your individuality right out there and engaging with the community all the time. And I was just. I wanted to ask about that, but I didn't know how to frame that. Like, watching that process of, like, you being a particle and then watching something grow around you in this. In this social space."}
{"episode_id":"SW - #087 - 2020-01-08 - Benjamin Boyce - Masculine Actualities and Feminine Possibilities","start":3678.55,"end":3717.13,"speaker":"Jonathan Pageau","text":"Yeah, it's exciting. It's dangerous. I have to be careful. It's like, it's hard. It's hard. You have to be. I mean, it's like you always have to fight the tendency to think that it's you. Like, oh, I'm doing this. Like, you know, this is great, you know, so it is dangerous. Luckily, I have a. You know, I go to confession. That helps for that. But it's like, the pride element is sometimes difficult in that. In that sense. Like. Like, all of a sudden, people talk about your ideas or talk about your videos. So it's like, okay, okay, Jonathan. But it's good. My wife smacks me around, like, that's great. She's like, she has no. She has no time for my arrogance. And that's really useful."}
{"episode_id":"SW - #087 - 2020-01-08 - Benjamin Boyce - Masculine Actualities and Feminine Possibilities","start":3718.17,"end":3722.65,"speaker":"Benjamin Boyce","text":"That's another positive aspect of the negative feminine. It keeps you in line."}
{"episode_id":"SW - #087 - 2020-01-08 - Benjamin Boyce - Masculine Actualities and Feminine Possibilities","start":3723.05,"end":3790.11,"speaker":"Jonathan Pageau","text":"It's great. It's great. I hope you enjoyed this episode of the Symbolic World. The Symbolic World is edited by Justin Ward, and it is based on a series of videos that can find on my YouTube channel, Jonathan Pageau's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by, of course, leaving a review on itunes. Everybody knows that's the best way to get the podcast out there, to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon Pageau videos as well and on SubscribeStar, all those links you can find on my website or in the show description. So thank you and I will see you soon."}
