{"episode_id":"SW - #116 - 2020-09-16 - Postmodernism is a Virus","start":0.72,"end":1368.57,"speaker":"Jonathan Pageau","text":"One of the aspects of this strange time is how the extremes start to meet and how certain discourses can be held in opposition within a very same team, and then can also be held the two opposite discourses can be held within the team that they're supposedly opposing. So what I want to do right now is that in the wake of the COVID crisis, as we're still going through it and it's still playing out politically, I want to show you some postmodern strategies and how postmodern theorists and postmodern activists used the structure of viral infection to affect society. They did this consciously, they did this deliberately. And so we're going to look at that and how it is very strange to see the discourses flip one side and the other in this situation. This is Jonathan Peugeot. Welcome to the symbolic world. One of the reasons why I am quite worried right now, to see where things are going, and this, of course, has been I've been sounding the alarm at different levels since I started speaking online. Obviously not doing it all the time, because who wants to hear someone screech all the time? But I haven't sounded the alarm at the danger that is ahead of us of noticing the extremes start to manifest themselves, to notice the extremes of chaos and mixture and madness, right up to the extremes of control and order and, you know, hyper naming, the idea of completely identifying and controlling on the other side. And so one of the fascinating and disturbing things that have happened Since World War II is, of course, the rise of postmodern thought and postmodern action. Now, I've talked about Jacques Derrida before, and so I want to quote something from Jacques Derrida. I'm going to go through two quotes, one from Jacques Derrida and another from a more contemporary source on queer theory. And we're going to look at how they use the image of infection and the virus to defend the way or to talk about the manner in which they wish to affect society. So the quote from Jacques Derda comes from a series of interviews that he gave called Positions. And so Jacques Derrida says this. He says, all I have done is dominated by the thought of a virus, what could be called parasitology, a virology. The virus is in part a parasite that destroys, that introduces disorder into communication. Even from the biological standpoint, this is what happens with a virus. It derails a mechanism of the communicational type. It's coding and decoding. On the other hand, it is something that is neither living nor non living. The virus is not a microbe and if you follow these two threads, disrupting writing inscription and the coding and decoding of inscription, and which on the other hand is neither alive nor dead, you have the matrix of all that I have done since I began writing. So what is going on here? So Jacques Derrida tries to show, by emphasizing the exceptions, by emphasizing the margin, by emphasizing all these categories that I talked to you about in terms of the, the in between categories, the monster, the stranger, and also the virus. That is, the virus, the parasite is something which does not, is not part of your original identity, you would say, but nonetheless is living on your body in a manner that is transforming the reality of your, of your body. And so the virus will infect you and will break down the manner in which your body communicates amongst its different elements. And so that is what postmodernism is. And if you understand that that's what postmodernism is and the postmodern strategy is, you can understand why it emphasizes the things it does. You can understand why, why we have seen this glorification of the exception, the glorification of the outsider, the glorification of in between identities, of identities which neither fit one side or the other. Because by introducing these monsters within discourse, what it does is by pointing to the exception, you can, what you can do is you can put an exception in something and that exception will start to feed on the main body, just like a virus or a parasite will feed on the body that it occupies. And so the body, the parasite, can grow and grow and grow and will disrupt the normal functions of that body until they consume the body completely, until they deconstruct the order of the body. So that is what a virus does, and that is also what postmodernism tries to do. Now, Jacques Derrida did this in language, he tried to show with reason, because if you understand the traditional worldview, you understand this hierarchy of manifestation. And that's why I talk about gargoyles and monsters and all these exceptional beings that are on the edge of the world, the carnival, the place where order breaks down, where it starts to flip and spin, spin and do funny things, humor, irony, all of these types of meaning making structures that are on the edge of being. I want you to understand them because these are the tools that are used by postmodernism to destroy the world. And the way that I want people to understand them is to understand that they are also an inevitable aspect of reality. And that you also should be very careful in trying to completely cutting off these marginal elements, getting rid of them because there is a connection between these marginal elements and the untouched. And there's also a relationship between these marginal elements and transitions, between identities. And we need these buffers, like veils, like the, like sphinxes, like all these in between characters, these guardians of identities are also at the same time the those that if you're not, if you don't encounter them properly, they can devour your identity. Now, the best example of that, of course, is in the story of the Sphinx, where this Sphinx poses an enigma. And the enigma that the Sphinx poses is not just the question that he asked, but it's also his own existence is the enigma which is being posed to Oedipus. And Oedipus has to answer the riddle of the Sphinx and discover what it is that he's talking about. Well, I won't go into the answer to the riddle. I think I've talked about it in other videos. But the idea is that the Sphinx is this riddle. And if you answer the riddle of the Sphinx, then you can cross over, you can enter into the next world or enter into the sacred place, or enter into, you know, enter into the house, enter into whatever it is that this marginal thing is guarding. But if you don't, if you're not able to answer the question or the enigma of this, this exception, then that thing will devour you. And so this is the place where postmodernism puts its foot in. In to the discourse and starts to use the methods of parasite, end of exception, to try to destroy the rule and to try to. For the exception to devour the rule. And I think that if you're attentive to social discourse, I don't have to give a million examples because we see that happening all around us in terms of the way in which. In way in which society is laying itself out. So I want to read for you another quote, and this is a more recent quote. This is from a paper which was published in the. It's published in the Journal of Queer Social Studies. Oh no. Of Gay and Lesbian Social Studies. I think that's the title of the journal. And it's called Fetishizing the Health Queer Theory as an Intervention by Tyler M. Arguello. And so his quote goes like this. Queer theory also recasts the meanings of viral and hybrid identities. The health sciences privilege essentialized notions of human beings and populations, encumbering them with objectivity and empirically determined values. But beliefs, attitudes, risks and social trajectories. HIV calls into question the centrality of this certainty through contesting binaries and continually exposing social iniquities. Whereas medicine pathologizes hybridity as the subjectivity of contagion, one that creates instability around human identity. Queer subjectivity tries to interfere in the reciprocal constitutions between the naturalized body and the normative social order enabled by medical discourse. Queer theory looks to dislodge this concordance through insistent adoption of viral processes of rapid transformation, mutation, and momentary identity processes against which the normative subject wishes to defend itself. On one level, the end game of queer theory would be to use these viral processes as a way to infect and hence transform the body politic. So I want to go over the elements of this quote with you because it's using, you know, scholar speak and kind of theory speak. But what it says is quite clear and quite simple to understand. If you look at what it's saying now, it says what queer theory does is it recasts the meaning of viral and hybrid identities. And so it talks about how ordered identities, let's say the world privileges essentialized notions of human beings and population. So we have identities. A man, a woman, you know, a human, an animal, and a, an American, a Canadian, you know, you have all these different identities, a father, a mother. All of these are essentialized identities. That is, they are identities that are above your individual but also normalize your potentiality, normalize the, your. All the, let's say, the messiness of your being. They normalize it by giving you an identity. Like I said, man, woman, father. There's all these different identity. And so this is what the health science also privileged this, according to this theorist. But you can understand it in general as a notion that ordered societies, ordered structures, privilege essentialized, essentialized ideas, beliefs, attitude, all of this is there. And so what he says is that hiv, it calls into question this centrality. And so what it does is it's not just hiv, of course, but quite queer theory itself. What it does is that it goes into the idea that, that hybrid identities, that parasites, that these marginal things, these in between things that are there, it changes their function instead of seeing them. It de. Essentializes the identities. And so it goes in and by creating identities that are rapid succession, that change. So you want to. One day you're this, one day you're that, you know, one day you're this sexual orientation, the other day you're that you have this desire, you have that desire by, by bringing in this type of rapidly changing and, and indefinitely multiple identities. What it does is that it questions the supremacy of these essentialized identities, right? And so Even though we, we tend to pathologize hybridity, we tend to see things that are mixtures between to other things as something which is dangerous and which is not normal. And so what it does, what HIV does and what queer theory does is that it tries to break that pathology, pathologization. It tries to, to open up, you know, this notion that the relationship between, the relationship between. I know it's crazy because it sounds like this shouldn't be possible, that what a virus does to a body is not a pathology. Right? It's not, it's not. Disease is not a pathology. Disease is a way to decentralize these normalized identities. It breaks down identities. And in that sense it has to be encouraged. You know, it has to be, it has to change the way we, we view discourse. And so it interferes with this, these constitution between what he calls a naturalized body and the normative social order. And so what these queer identities, what they do is they jam themselves between the essence man, let's say, and the body, which is kind of a mess of jumbled possibilities. And so in normal, in society, there's a connection between the two. But what this type of theory does is it goes in there and it places a bunch of different identities in order to open up the space of chaos, which, right, to kind of put, to put chaos, lift chaos up and kind of bring it up into the normalized order in order to break apart the relationships of authority and power. And so you would think that this, Most people don't realize how conscious this is. Most people look at what's happening, they see all the kind of breakdown that's happening and they, they're surprised. They don't realize that this is actually a conscious action. It is a conscious action to break down the normative order. There's nothing else that's going on. Now one of the craziest things and one of the scariest things is that in order to understand this, in order to understand the relationship between the way that postmodern theory and postmodern activism, especially the way that it views itself and the way it acts in the world, and the way that it recognizes things like, you know, like a kind of glorification of the exception of the in between, of the hybrid of the virus, of the virus, all of this is actually happening. But to order, understand it in a complete sense, you have to understand what it's reacting to. You have to understand that this is a post World War II phenomena. And you have to understand that the Nazis and the fascist states, they actively Viewed the exception, the foreigner, the in between categories, the hybrids. They viewed this exactly in the way that Jacques Derrida and this queer theorist is saying. They viewed it as disease. If you read Mein Kampf or if you listen to some of the speeches that Adolf Hitler gave, he talks about this disease which is in this state, and he identifies it with all the same things that the postmodern theorists will talk about. So what you end up having is a crazy situation which is you have this Nazi idea that everything which is exceptional and hybrid and marginal is acting like a disease which is breaking down the normative order of a society and in their opinion, has to now be cut off and chopped off of society. But facing it right ahead, across from it, you have the postmodern type theorists saying, yes, yes, what you're saying is absolutely true. We are doing that. We are that, and we are doing it consciously. We are trying to destabilize normative order. We are trying to destabilize the identities of family, of men and women, of countries, all of this. We are trying of religious identities. We're trying to disrupt all these identities. And so it's a scary moment. It's a scary moment to realize that, you know, that, you know, the unironic. Yes, meme. The Chad, yes meme. Well, this is what you have. You have one side saying you're a virus, and the other one saying, yes, that's what you've got. And so it's a scary thing. Now, what's scarier and why I'm bringing it up today is that as we reach the end of this weird process, because we are dealing with the narrative of a pandemic, then we have these really dangerous flights, flips, these really dangerous extremes that are manifesting themselves. And so on the one hand, you have the demonstrations, you have the riots and the demonstrations which are there to manifest the side of the viral postmodern kind of weird neo Marxist philosophy. And then you also have the clampdown, the masks, the social distancing, this kind of social clampdown to prevent infection and to eradicate infection. Because at first they said we're just gonna slow down the virus. But no, it seems like that's not what they're doing because. Because all these measures are continuing and are still, are still being emphasized. It means that they have this weird idea that there can't be anybody who gets this disease. We won't stop until nobody has this disease anymore. So there is a strategy of eradication. And so. And the same people who are on one side are emphasizing the other side in terms of the disease. And the same people. The people who are on the other side are emphasizing the other side in terms of the disease. Maybe it's not as clear in terms of size, but what I mean is that the tendencies, let's say, of two opposing forces. And so we're in a very, very precarious and dangerous situation because this is all happening in a somewhat. Maybe not. Maybe not. Unconscious. I was gonna say unconscious. Maybe it's not unconscious. Hopefully it's unconscious. If it's conscious, it's even scarier. But this is happening at the same time. And these contradictions and these flips of discourse between one extreme of closing down and. And the other extreme of opening up on both sides in different ways is leading to an explosion. It's leading to. It's leading to an explosion which. It's not clear which side it's gonna go on. Or maybe it's gonna go on both sides at the same time, which is just the most frightening possibility, it seems, you know, when there's crazy meme that you might've seen this notion that it feels like we. That there's 1984 and Brave New World and Fahrenheit and all these dystopian novels and that somehow we're able to join them into a oncoming dystopia because you don't see, it doesn't seem like you could join 1984 and a brave New World, but because of our weird, like, entertainment culture mixed with a massive clampdown of control. And all of this is very, very. It's just very, very frightening and dystopian. And so look, what I mostly wanted you to do is to notice this and to see it and to understand that one of the reasons why I talk about the importance and the value of the margin in its proper place, why I talk about the possibility of St. Christopher, of the holy monster, of the cherub, of the Sphinx, of the, you know, all of these marginal creatures, is to hopefully help people understand on both sides the role and value of these. These identities on the edge. Because if people don't understand them, what's going to happen is there's going to be a fight between the margin and the center. And we saw that happened. There's going to be a fight between hierarchy and equality or kind of inverse higher or upside downness. And we saw that happen 100 years ago. It wasn't pretty. And so we definitely don't want it to see it happen again. And so, guys, sorry for the dark tone of this, but you know, these are dark times and all I can say is thanks for your attention and thanks for your support and I'll see you very soon. I hope you enjoyed this episode of the Symbolic World. The Symbolic World is edited by Justin Ward and it is based on a series of videos that you can find on my YouTube channel, Jonathan Pageau's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description and so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course leaving a review on itunes. Everybody knows that's the best way to to get the podcast out there to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon Pageau videos as well and on subscribestar. All those links you can find on my website or in the show description. So thank you and I will see you soon."}
