{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":0.16,"end":59.17,"speaker":"Laura Diaz","text":"Tucson, the weight is over Mediweight loss. They're officially open on North Oracle road. That's right. No more counting down the days. You can walk in right now and start your journey to a healthier you. Hey, it's Laura Diaz from iHeartRadio. And you can trust me. This isn't just another weight loss clinic. I know that because it's where I lost weight safely with real medical support. GLP1 medications. You can see them everywhere online right now. But the truth is your health shouldn't be a DIY project ordering these meds without the professional guidance. It can lead to dangerous mistakes, wrong doses, no oversight, and serious risks. At mediweight loss. I got the same medication, but with a customized plan, weekly check ins, and a licensed physician guiding me every step of the way. And the cost? The same as those risky online options. Tucson, your moment is here. If you're ready to take control, feel better and lose weight the right way, mediweight loss is ready for you. Walk in, get started and see real results. Call or visit mediweightloss.com to learn more and book your free consultation today."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":59.25,"end":210.86,"speaker":"Jonathan Pageau","text":"That's mediweightloss.com the reason why, for example, even in the kind of early Christian tradition or the late Jewish tradition, this idea that the demons are the spirits of the nephilim, right, of the great men before the flood. This is exactly what you're saying. Like, it's exactly what you're saying is that there are these principalities, these great men of old that were kings and great men before our world and they still linger and they still have influence, but they're not. They're disconnected from the hierarchy right now, you know, and that's what happens in, not just in our mythologies, but it's also the way that the ancient mythologies are set up, which is that once, you know, once Zeus has become the king of the gods, then the Titans are now a bunch of monstrous demons that, that are. That. That are dangerous and, you know, live on the outskirts of the world. All these different levels, this is also how it functions. And you can understand that there are memories that participate in your story, that in your family story, in everything that are fragments of worlds before you, that you don't completely understand but that nonetheless are part of your. Of your world, right? Of doing things that your mother does, that if you asked her why she does them, you don't know. She doesn't know why she does them. Like you said, this is just how we do things. Jonathan, I don't know what it is, but it's, it's connected to some ancient pattern that no longer has meaning but is still influencing you. Right. And so we're not. This is not just woo, like there is a woo aspect of what we're saying, but this we're actually talking about how the world kind of plays itself out. This is Jonathan Peugeot. Welcome to the symbolic world. Hello everyone. I'm here with Deacon Seraphim Richard Rowland. We're going to start this way. He is the same person. He is. He is now a deacon and he dresses like a deacon. He's got a nice haircut too. You seems like you've got a better haircut since you're a deacon. Is that."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":210.86,"end":220.54,"speaker":"Dcn Seraphim Richard Rowland","text":"Yeah, I actually haven't cut my hair since I was made a deacon. I just had to put a bunch of stuff in it to make it all lay down because otherwise it poofs."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":221.1,"end":223.58,"speaker":"Jonathan Pageau","text":"So are you gonna have the ponytail at some point?"}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":225.5,"end":227.86,"speaker":"Dcn Seraphim Richard Rowland","text":"Seems to be the direction things are going. Jonathan."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":227.86,"end":229.1,"speaker":"Jonathan Pageau","text":"All right, all right."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":230.08,"end":257.84,"speaker":"Dcn Seraphim Richard Rowland","text":"I think there's one of my dear beloved now brothers in the Lord, a wonderful proto deacon who sometimes listens to these episodes, who. I'd break his heart if I didn't at least try. Also my wife has just been trying to get me to grow my hair out long for a long time. So anyway, so we're going to try it. We're going to try it. I don't know, it's a podvig, that's for sure. But we're going to try it."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":259.28,"end":262.36,"speaker":"Jonathan Pageau","text":"And so today Repo, we're recording this."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":262.36,"end":265.68,"speaker":"Dcn Seraphim Richard Rowland","text":"On the 4th of July on the birthday of America."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":265.68,"end":269.68,"speaker":"Jonathan Pageau","text":"There you go. And so, you know, we have the birth of July here."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":270,"end":275.48,"speaker":"Dcn Seraphim Richard Rowland","text":"We've got to teach you things about American history for the inevitable, you know, when Canada becomes."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":275.48,"end":291.07,"speaker":"Jonathan Pageau","text":"When Canada becomes the 51st state. Yeah, well, we have the 1st of July here in, in Canada, but in Quebec where I am, we literally do not celebrate it except for a few English speaking places. So where I am there are towns that do celebrate it and towns that don't celebrate it."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":291.95,"end":294.75,"speaker":"Dcn Seraphim Richard Rowland","text":"That's, that's a problem."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":294.91,"end":302.35,"speaker":"Jonathan Pageau","text":"Yeah, we celebrate the 24th of June, which is the St. John the Baptist day, which is our Quebec, like French, French Canadian national."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":302.99,"end":308.91,"speaker":"Dcn Seraphim Richard Rowland","text":"I mean that's how it is. It's just. You're just trying to flex on me here with the, the St. John thing. I mean."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":308.91,"end":312.71,"speaker":"Jonathan Pageau","text":"Yeah, we actually, our, our nation national holidays is a saints day."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":312.71,"end":317.78,"speaker":"Dcn Seraphim Richard Rowland","text":"Okay, all right, all right. Well I gotta grudgingly give that one."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":319.06,"end":322.98,"speaker":"Jonathan Pageau","text":"All right. So how do you Want to go about this. You want to talk about a lot of things today."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":323.86,"end":358.35,"speaker":"Dcn Seraphim Richard Rowland","text":"So 50 years after the signing of the Declaration of Independence, which happened on this day, 50 years after signing the Declaration of Independence, John Adams and Thomas Jefferson died on July 4, within, like, an hour of each other. Wow. And, in fact, John Adams is famous for having said, like, his last words were sort of a grudging Jefferson lives. You know, kind of like, I thought I was going to outlive him, actually. Jefferson wasn't alive. Jefferson had died about an hour or two earlier. It just. Adams didn't."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":358.35,"end":360.99,"speaker":"Jonathan Pageau","text":"Just didn't know. Didn't have the Internet at the time."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":361.15,"end":408.76,"speaker":"Dcn Seraphim Richard Rowland","text":"Yeah. So, yeah, that. That's. That is true, Jonathan. They did not have the Internet at the time. These are the kind of profound historical insights you get when you come to the symbolic world, everybody. So I would. I would just suggest that in a thousand years, whenever, whatever America has become or whatever is left of us or whatever. I mean, God knows, right? Whatever America has become in a thousand years, this is the sort of story that if people remember it, they will look back on it and say, this is probably made up. Like, obviously, this couldn't have really happened. It's a little too tidy. It would be like saying Abraham Lincoln and JFK were assassinated on the same day."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":408.84,"end":409.32,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":411.96,"end":412.68,"speaker":"Dcn Seraphim Richard Rowland","text":"Which they were."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":412.76,"end":413.32,"speaker":"Jonathan Pageau","text":"I know."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":413.96,"end":594.28,"speaker":"Dcn Seraphim Richard Rowland","text":"Yeah. Like, like, like, that would just be a little too tidy. That would be a little too convenient. It's a little too, you know, legendary, mythical, et cetera. Right. So I. What I want to talk about today is, is the. Basically the idea of, like, a titular spirit. And this is. This is having. This has to do with kind of connecting to the last. Last couple of. I know it's been a little while since we. We did one of these just because of schedules, but the last. Last couple of universal history videos that we did, we're looking at the voyage of St. Brendan, right. And kind of dancing around all of this stuff. We've been kind of hanging out, you know, in. In Hibernia, like, hanging out in Ireland a little bit. Obviously, one of the big things that people are very interested in right now, and it seems to be something I'm getting asked about more and more in just various contexts. Doing the stuff that I do is like, well, what's. What's going on with the fairies? Like, are fairies real? And if they are, is that a problem? And, like, what's the deal? And are they maybe this kind of neutral spirit and all these different things? And there's that crazy passage in the voyage of St. Brendan, where it's like they come to a church on an island, and the church is not inhabited by humans. They're not humans. They're not angels. What's going on there? Brendan is basically told, it's not really any of your business. You don't need to worry about it. You know, it's like, okay, what's going on out there, by the way? There are these. These legends even. Even quite late. I mean, not even really in the. Like. Like in the early modern period, in 1433, there were sailors in the Baltic Sea who fished up a merman. A merman who had a. A bishop's miter sort of growing out of his head and a staff in his hand and, like, either wearing a robe or, like, stuff that looked like a robe. Of course, modern people are like, oh, they just fished up a squid. And they were confused. Well, the problem with that explanation is that they took him to the king of Poland, where he remained alive for several days and wanted to basically keep him as a curiosity. And then he didn't speak. But he's supposed to have sort of begged all of the other bishops who had come to see him, like, sort of begged them in a kind of a brotherly way. Let me go back to my element. So two of the bishops take him back to the sea, and he jumps back in the water, makes the sign of the cross, and disappears under the waves. I mean, this is a story. It's written in. It's written in a couple of different chronicles from that era. And I probably shouldn't have just let out with that guy, because."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":597.56,"end":599,"speaker":"Jonathan Pageau","text":"Fourth of July, you know."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":599.16,"end":664.11,"speaker":"Dcn Seraphim Richard Rowland","text":"Yeah, yeah, Fourth of July, guys, you know. But, I mean, that's a. Obviously, it's a crazy story. Like, what do you do with that? Like, it's not just mermaids. It's like bishop mermaids, which I suppose at some point, you know, if there's at least one baptized mermaid, eventually they're gonna need a church down there, you know, I don't know. But, yeah, it's this idea that there might be another group of people that has another group of beings that has something to do with us, but not anymore. Or that maybe used to have something to do with us, but doesn't anymore, or who have a third order of existence. This is basically the idea that develops with fairies. So I. I actually want to kind of look at that idea, but I want to go back a little bit further than fairies a little bit and maybe actually get your insights on a couple of things from the Bronze Age, and then we'll kind of, you know, set it up. So I feel like. I feel like we just. We're going to cover all of this today."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":664.19,"end":670.11,"speaker":"Jonathan Pageau","text":"All right? Yeah. From the Bronze Age to the death, Jefferson."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":670.11,"end":1371.25,"speaker":"Dcn Seraphim Richard Rowland","text":"Yeah. Yeah. I think we can do it all in like a tidy four or five hours. You know, it's been a while since we did one of these. We got to catch up. All right, so over on the Great Tales podcast, which I've been doing with Father Andrew Stephen Damick, we've been covering the Theban plays by Sophocles. You know, so these are the stories of Oedipus the king, Oedipus a Colonus, and then Antigone, which, you know, a lot of people probably read in school. And it's been really fun reading them and just discussing them. I think they're extremely. I mean, the plays really hold up. There's a reason that we read things, you know, written, you know, more than 2,000 years ago, and the plays really hold up. And in fact, I strongly recommend to people, first of all, you go check out those episodes if you want to deep dive on those also that you check out audible.com has a really cool audio drama of, like, audio drama of those trilogy of plays. And it's like Hollywood actors doing all the parts. And yeah, it's quite. I mean, they're quite good. That's what I was. I was working, you know, like 18 hour days this last week, and so I was just like listening all day to audio dramas and plays and things like that. And they're really, really strong and I think much more compelling than just reading them on the page. But in these plays, obviously, I think most people know the story of Oedipus. This is a guy who famously, you know, had a psychological condition, you know, a complex named after him. You're basically like, your one goal in life is never to get a psychological complex named after you. I feel like, yeah, so this is famously, you know, he's the guy who kills his father, marries his mother, has four children, curses the land because of the sins that he's committed in the eyes of the gods. And all of this, of course, he does, completely unwittingly, which is why the story is actually compelling in some way. You know, it's. It's because he's. The whole reason that this has happened is because his parents sent him away to try to avoid their fate. And then he comes back to them trying to avoid his fate. And so it's, you know, everybody's there's all these prophecies, but the prophecies are just sort of just fuzzy enough that people try to. People actually bring them about by trying to avoid them. So all these things happen to Oedipus and he's not able to. He's, you know, doesn't know what's going on. He's kind of caught up in the web of everything. The first play in the order, though, it's actually the second one that was written Antigone, which happens after Oedipus death was actually written first. In fact, when Sophocles wrote Antigone, they thought it was such a good play that they made him a general, because obviously, that's what you do with great playwrights. That's how it works. Yeah. Great playwrights probably can also lead armies. And he was actually a relatively successful general, by the way, just to say he lived through a pretty violent period in the history of Athens and made it to old age. So. Yeah. So in the very first play in the series, chronologically speaking, it's all about, basically, Oedipus is like, everything's going wrong. There's famine, there's plague, all these different things. And they're happening because the land is cursed, because the king is cursed, because of the things that he's done that he doesn't know he's done. And then sort of everything, within the space of like an hour, he finds out the truth about everything. And it culminates with, you know, Jocasta, his wife slash mother. You know, she hangs herself, and then Oedipus takes her cloak pins and puts both of his eyes out. The description of the scene, because all of this happens sort of off stage, and then you have, like, the servants describing it afterwards. But the description is incredibly dramatic. I mean, it's so bad. It's so great. It's so great. But also it's just like the whole. You're just wincing the whole time. So Oedipus puts his eyes out and begins to wander. And the beginning of the second play in the trilogy, which happens some number of years. It's not really clear, but some number of years after the first play, Oedipus the king, we have Oedipus at Colonus, where Oedipus comes to Athens and he comes to a grove that is dedicated to the Furies, which will turn out to be quite important. And once he finds out that's where he is, you know, obviously he's blind, so he has to ask people. But once he finds out, that's where he is. He realizes that this is going to be the fulfillment of the prophecy, you know, that there's another prophecy. So we had all those prophecies about him and, you know, the curse on his family in the first play. In the second play, we find out there's another prophecy, which is that he's going to come to a place that's sacred to the Furies, and that's where he's going to be buried. And his burial, his tomb, will be a blessing to those whom he is buried with. That is, he'll sort of protect them. And then he'll also. He'll be a curse to those who cast him out. That is his native city of Thebes. So the rest of the play is actually a conflict between his two sons and between the. You know, who are in a civil war with each other. And then the city of. The men of the city of Athens, led by Theseus. Theseus, you know, the famous hero who killed Minotaur. All of this to base, basically. Like it's a contest or it's a struggle over who's going to get Oedipus's body when he dies. Right. And so eventually Oedipus dies, and he's buried there at Colonus in Athens, right under Mars Hill, the Areopagus. And I mean, the site is still. I mean, still there to this day. And then in Sophocles day, there were at least three tombs that were purported to be the burial site of Oedipus. One was outside of Thebes. One is there in Athens near the Areopagus. And the other is in a different Colonus. Colonus is the name of a neighborhood outside of Athens. It's now inside of Athens proper, since the city has grown. But then also, there's another Colonist somewhere in. In Greece. So the play is basically saying, no, he was. He was. It was bared at colonists. But it's like this one. It's this one here. This is the real tomb. This is the genuine tomb. But one of the things that happens over the course of that poem that is very interesting to me is the. Over the course of the play that's very interesting to me is the way in which Oedipus is transformed into a. What we would call. Or what they would have called a daemon. Right. You know, that is. You know, obviously, this is where we get our word demon from. I think sometimes people make a big deal about. And I'm pretty sure I've done this, so I'm not picking on anybody, but about the. You Know, like the word demon or devil and how it means to, like, divide, you know. But that was that. That was taken in a mostly positive sense in the ancient world. So the idea was that a daemon, or you could say, like a titular spirit, the spirit of a place is the one who divides and says what's in and what's out. Right. What's in the. You know, what's. You know. So these are. They're like boundary spirits or territorial spirits. Different ways of thinking about it. And over the course of the play, Oedipus kind of starts transforming into one. So he goes from being this sort of totally helpless person, which he's been since the end of a previous play, you know, blind and helpless and everything, to suddenly he's given prophetic powers. He's not going to Apollo for oracles. Instead, he's able to actually pronounce blessings and curses. He's able to predict the future. He's able to sort of see, here's what's going to happen when, you know, when I'm dead, when I'm buried, when I'm gone, here's what's going to happen to my sons. Here's how, you know, there's a very vivid scene in which he curses two. You know, the two of his sons, blesses his daughters, curses his sons, and. And then he's buried. And the reason that Oedipus is able to transform in this way is because Oedipus is a hero, Right. In the old classical sense of the term. So heroes in classical mythology are people who kill monsters. That's pretty much the only qualification. They don't have to be, like, morally exemplary people, even kind of by the standards of their own time, but they have to be people who kill monsters. And so if you think about, like, all the heroes from that generation, so this would have been the generation before the Iliad and the Odyssey. All the heroes of that generation are the heroes who fought the Medusa and who fought all the different things Hercules fought, and who fought the Minotaur and so on and so forth. Right. So it's sort of by. By fighting the monsters, they are then the ones who kind of get to draw a line around the city, Right. Who get to draw a line of the civilis around the civilization and say, this is what's in and this is what's out. And so when they die, they become these titular spirits. Yeah. So anyway, I've talked a long time. Do you want to. There are a couple of things about the Oedipus story. That I would really like to actually get your insights on. So the first is the encounter with the Sphinx. I think people kind of know the story. This is one of the things Oedipus is doing when he's a young man, before he comes to. Before he becomes the king of Thebes. Thebes is being basically tyrannized by this Sphinx, Sort of like a half woman, half lion monster, right? It's related to the cherubim and like all these other kind of riddling hybrid creatures. And the Sphinx has a riddle and nobody can solve the riddle. And basically, eventually Creon says, okay, whoever solves the riddle can be king of Thebes. So Oedipus goes to the Sphinx and gets the riddle. And the riddle is something like, you know, what has four legs in the morning, two legs in the afternoon, and three legs at night? By the way, this riddle is not in the play. The play just refers to the fact that Oedipus solved the riddle and killed the Sphinx, but it does not actually recount the riddle in the play. There's a couple of different versions of the riddle, but this is the best best known one. And then Oedipus says, oh, obviously it's a. It's an old man, you know, it's a, it's a. It's a baby in the morning because he's crawling on all fours. And then a fully grown man in the middle of the day. And then an old man, you know, who has to like, go with a staff, right? So he's being led by, you know, so, so basically the riddle has to do with the kind of the, the, the. The cycle of man, the life of a man, right? And the Sphinx gets really upset by this. And in some, in some versions, she kills herself self, and in other versions, Oedipus kills her. But in any case, Oedipus defeats the Sphinx. So, like, what's going on with this riddle, Jonathan?"}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":1373.57,"end":1423.61,"speaker":"Jonathan Pageau","text":"What's going on with the riddle? I mean, it's not that. It's not. It all. It's all the same thing. So that is the Sphinx, the riddle, riddle as a riddle, and then the riddle itself, they all manifest the same problem, which is how do you see unity in difference? Or how do you. In multiplicity? Or how do you see unity and change, right? So you have this situation where you have different things that are presented to you, and how do you capture what it is, Right? And so that's what killing a monster is like, because a monster is always a hybrid. It always presents itself as an excess as something that is that. That doesn't seem to make sense. It doesn't fit."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":1423.61,"end":1424.09,"speaker":"Dcn Seraphim Richard Rowland","text":"It's."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":1424.09,"end":1539.66,"speaker":"Jonathan Pageau","text":"It doesn't. And so killing the monster in some ways is fixing it, right? So the image of. Especially the image of St. Michael, right, piercing the dragon, what you're doing is you got something that you can't get a grip on. It's. It's slithering. It doesn't. It doesn't make sense. It's confusing. It doesn't have an identity. And so I fix it, right? I smash it and I stop it from moving and I make it into something. So that's what's important about understanding the idea of what the monster is and then what a riddle is, right? A riddle is a question. It's a puzzle. And then you have to solve the puzzle. But then in the riddle itself, which is the Sphinx presents three things that don't seem to fit together. And the answer, of course, is man. But it's a bigger question than that because in some ways he's asking something like, what is identity? Like what? Man is the solution to the riddle. Man is the solution to all the riddles, right? Because man is the one who's able to. To do that. Man is the one who's able to see unity and multiplicity. Man is the one who's able to see pattern and is able to fix things. You know, animals don't so much. They can't, like. They don't so much like, fix identity. They don't name things. So you can think that when. When Oedipus is killing the Sphinx, he's naming the Sphinx. It's one version of it, right? He's basically making it into an inhabitable place, something that is related to him. And so that's why often killing a monster is related to setting up a land, right? So you kill the monster, and then the monster becomes the land in which you live. It becomes your nation. It becomes. Because that's what. That's what killing a monster is."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":1539.82,"end":1558.58,"speaker":"Dcn Seraphim Richard Rowland","text":"Well, the origin story for the people of Thebes is that, you know, the hero Cadmus kills a dragon, and then he sews the earth with the dragon's teeth, and those teeth grow into the people of Thebes. Yeah."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":1558.58,"end":1579.16,"speaker":"Jonathan Pageau","text":"And so that's. But there are so many examples that we can't even, you know, I mean, the Israelites go into the promised land. What do they find? They find giants. You have to kill the giants and then establish yourself, you know, and you can understand. This is a harder one for people to understand because there's a relationship also between the monster and the strange or the stranger."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":1579.56,"end":1579.96,"speaker":"Dcn Seraphim Richard Rowland","text":"Yeah."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":1579.96,"end":1626.8,"speaker":"Jonathan Pageau","text":"You know, and so you, you, you go, you. There's strangers in a place and they don't. They're not connected to you. And so you have to find a solution to that. You have to join them with you. There are different ways to do that. And in the stories, one of the ways is. Is to get rid of them, you know, sadly. But that's part of how. That's how you establish one of the ways. You establish a. A land. And so that's why, I mean, and so that's what that story is, a very powerful one. Because in some ways what's happening there is if you can do that, then you become the king, which makes sense, right? If you can establish the land, then you become the king of that land, if you can. And so this has practical applications in anything. It's like you start a new job presents itself."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":1627.36,"end":1630.27,"speaker":"Dcn Seraphim Richard Rowland","text":"Sorry, we don't actually have kings today because it's July 4th."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":1630.98,"end":1664.09,"speaker":"Jonathan Pageau","text":"Right. But, you know, you start a new job and you. And it's a puzzle to you. You don't know what it is. And so you have to figure out a way to make it into not a monster anymore. You have to tame it. Once you've tamed it, then you become the king. Right. In some ways, you rule over that area of your life. And that, That a sin is like that too, right? A sin is something that is not fitting, right. It's pulling you apart, it's ripping you into pieces. And so if you can master it, you kind of fix it, then you become the king."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":1664.09,"end":1921.97,"speaker":"Dcn Seraphim Richard Rowland","text":"Right. So the monster, that crossroads seem to have a really important place in the story of Oedipus. So. And this will come up because I promise we're going to get to weird fairy stories before the end of this recording. We're actually doing really good on time, so I'm optimistic. So crossroads have a very important place in the story of the life of Oedipus. His, you know, famously, he kills his father, Laios, at a place where three roads meet. The Sphinx is also kind of like terrorizing the city. But she's not inside the city. She's at the crossroads. She's basically like keeping anybody from going in or coming out of the city. Right. And there's also. There's also some other interesting things. I mean, even the place where. Even the place where Oedipus finally, you know, has his final rest is. It's at a. It's a. It's. It's it's outside of the city, in this case, it's outside of the city of Athens at this particular time in history. And it's, it's in a grove that is. That is, you know, dedicated to the Furies, or sometimes as they would call them, like the kindly goddesses, which is directly relevant, actually, to talking about fairies, because the Furies are only kindly goddesses, like in the same sense that people, like, call fairies the. Right. It's a, It's a euphemism at best, you know, wishful thinking. It's kind of like because, because anybody who has read any of the stories that involve the Furies knows that, you know, you don't want to get their attention. You know, if the Furies are showing up, it's, it's, it's a bad time. But the idea is that the Furies are the final court of appeal for people who have violated social taboos. And so, typically speaking, people who would make appeals to the Furies are husbands or wives whose spouses have been unfaithful to them. They are parents whose children have dishonored them or betrayed them. They are people who have been betrayed by their rulers or rulers who have been betrayed by their people and so on and so forth. So, like, here's Oedipus, who's a hero, you know, he's the one who killed the Sphinx. He's the one that gives identity to Thebes, all this different stuff. But also he's the person who's like, transgressed all of the. Basically two of the three most fundamental social taboos. If he had ever violated the guest host relationship, then, then he'd have like, the trifecta, right? So he's, he's committed incest. He's. He's committed patricide. And he. Boy, this is going to get this video demonetized, you know, somehow we'll be fine. I don't know. But, but, but he's basically. He's violated all of these social taboos, and yet he's going to become a hero and he's going to inhabit the place where the goddesses who are in charge of enforcing exactly the kinds of laws that he broke, you know, unwittingly in his case, but it doesn't really matter, right? You know, like, like pollution is pollution. Doesn't matter if you meant to do it, right, but, but. And there's a whole sort of like one of the important parts of the story is that there, there's like a certain purification, right, that he has to do or that somebody has to do on his behalf to kind of appease the Furies so that his body can rest there. And I guess the other thing that I would love to kind of get your ideas on is that the way that this purification. Right. Is done, it's very specifically pointed out that he's not to use. You're supposed to pour out a drink offering. It's kind of a typical way of appeasing a local spirit in the ancient world. You're supposed to pour out a drink offering. And very specifically, it's supposed to be water and honey mixed together, but no wine. And as very specifically said, you can't use any wine for this. And there's a phrase that is used throughout this play regarding Oedipus that he's the sober man or he's the man without wine."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":1922.21,"end":1922.69,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":1923.09,"end":1966.13,"speaker":"Dcn Seraphim Richard Rowland","text":"So he himself, you know, is kind of, like, associated with this kind of very strict sobriety, but then also the goddesses. And I've done some digging into this, and it does seem as though this is a real ritual detail, that the Furies, you know, very specifically them and a couple of other kind of what are called chthonic deities, like earth deities, you know, tend to be older, scarier, darker gods in general that they don't have that they're, you know, very specifically, you know, in what we know about the rituals and the ways that they were worshiped, that wine is very specifically prohibited in their worship. Yeah."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":1966.77,"end":1969.17,"speaker":"Jonathan Pageau","text":"So what's going on in all of this?"}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":1969.25,"end":1972.53,"speaker":"Dcn Seraphim Richard Rowland","text":"I mean, the theories and all that stuff."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":1972.77,"end":1984.01,"speaker":"Jonathan Pageau","text":"Let's start with the first part in. And so. And so the. This is going to be this again. It's one of these things where you're kind of forcing me to talk about stuff that's very difficult to talk about."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":1984.01,"end":1985.81,"speaker":"Dcn Seraphim Richard Rowland","text":"Yes. I mean, that's the only reason I'm here."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":1985.81,"end":2004.25,"speaker":"Jonathan Pageau","text":"Jonathan, you just. All right. And so. Okay. But the way to understand it is really to understand it through Christ. Christ gives us the key to the story of Oedipus. Right. Which is that there is a difference between Oedipus and a normal transgressor of the taboos."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":2004.25,"end":2004.57,"speaker":"Dcn Seraphim Richard Rowland","text":"Right."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":2004.81,"end":2007.59,"speaker":"Jonathan Pageau","text":"And the difference is, of course, that he's innocent."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":2008.23,"end":2008.59,"speaker":"Dcn Seraphim Richard Rowland","text":"Right."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":2008.59,"end":2021.03,"speaker":"Jonathan Pageau","text":"He actually isn't guilty in. In. In himself. He's going through the motions that it. He's actually transgressing the taboos, but he's not doing it in a guilt. In a guiltful way."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":2021.19,"end":2021.59,"speaker":"Dcn Seraphim Richard Rowland","text":"Yeah."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":2021.59,"end":2129.02,"speaker":"Jonathan Pageau","text":"And so it's a kind of poking. There's an insight about that. There's a kind of poking about what you could say the. The issue of the center or the issue of establishing a land and how it is that in order. In order to establish something, you also have to gather in the things that don't. That don't participate into the. Into for it to become something, right? So this is the problem. It's like at first you have a monster, and then the monster becomes the land in which you inhabit. What's the difference. What's the difference between the land that is, what's the difference between the bitter waters in Exodus and the sweet waters? Right? They're the same waters. Like what happened for one to become the other. And there needs to be a kind of transformation which will make something exist. And the insight that the ancients had was that the character that does that in some ways has to kind of encompass everything, has to in some ways be both the king, but also the one that establishes the limit and transgresses them. And so how do you. But you can't. It's like there's this almost like poking at this, like, how do we get this? How do we get. So you see that in scapegoat imagery as well. Rene Girard has analyzed this where there's a sense in which the person that is made the scapegoat and is in. Is some ways led into transgressing the taboos, is then killed. But then they become a kind of protective figure for the. For the town, right? And these are things that are hard to. But in Christ, we see how in some ways, Christ does all of that and more, right? Because Christ does. We."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":2129.02,"end":2129.34,"speaker":"Laura Diaz","text":"We."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":2129.34,"end":2193.64,"speaker":"Jonathan Pageau","text":"We have a thing. We have a way in. In the story of Christ, where Christ goes to the end of those of death, right? In some ways transgresses the. The. The taboos, does it both accidentally and willfully at the same time, which is that he does it by submitting to the passion, like being led by others. But he also willfully does it, which is different from Oedipus. Oedipus, in some ways is completely like. He's completely like a kind of, you know, taken up by his own fate. Like the fates make him do it. You could say his fate makes him do it. But Christ. Christ accepts willfully to go down that path and to kind of become the one who is sacrificed outside the city, you know, who. Who in some ways is made impure in all these different ways, you know, in order to kind of reach that limit. So I think that that's the way to understand why the imagery of these types of characters it seems so confusing."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":2193.72,"end":2194.16,"speaker":"Dcn Seraphim Richard Rowland","text":"Yeah."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":2194.16,"end":2210.41,"speaker":"Jonathan Pageau","text":"Is because you're trying to get a grasp at how reality functions. And you kind of have. Like I said, you have to understand that the taboos are part of the limit. Like, taboos make the land too. That which is forbidden. St. Paul kind of pokes at that as well."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":2210.41,"end":2210.69,"speaker":"Dcn Seraphim Richard Rowland","text":"Right."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":2210.69,"end":2226.13,"speaker":"Jonathan Pageau","text":"It's like the law. Like that which is forbidden participates in the existence of that which is permitted. Like it. It has a kind of weird. There's a weird relationship between the two. Does that make. Does that."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":2226.13,"end":2227.89,"speaker":"Dcn Seraphim Richard Rowland","text":"Does that kind of make sense? Yeah."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":2229.18,"end":2289.6,"speaker":"Jonathan Pageau","text":"And why. So. And. And at the crossroads, in some ways, they are up. They are. Like I said, this is the hardest symbolism to talk about because with. People get it wrong, they become like, they. They become Satanists. Like when people get this. This symbolism wrong, they become. That's what happened with the. The. That's what happened with the Sabbateans. That's what happens with the. These kind of canine type fingers. They get this. That's what happens with Tantrism. Tantrism gets this wrong, but they're playing with this symbolism, but they get it. They get it wrong. But it's that the crossroad is both a place that can be a center, and that is ambiguous at the outset because what is it? Right, so it's like a place where one becomes many. Right. And so is that the many or is that the one? Which one is it? It's like, is it the place where the many happens or is it the place where the one happens? And so it has this weird kind of situation. So that's why you meet the devil at the crossroads still today."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":2289.6,"end":2289.92,"speaker":"Dcn Seraphim Richard Rowland","text":"Right."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":2289.92,"end":2304.12,"speaker":"Jonathan Pageau","text":"All of these legends about. About. About the, you know, about the. The selling your soul to the devil is at the crossroads. But then also Christ is at the center of the crossroads too, by the way, because he's at the center of the cross. Yeah."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":2306.6,"end":2321.09,"speaker":"Dcn Seraphim Richard Rowland","text":"Sorry. I always think about. I mean, even like St. Paul meeting Christ on the road, like of kind of all places seems to somehow kind of participate in that. Yeah."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":2321.09,"end":2429.78,"speaker":"Jonathan Pageau","text":"But it. And what's important to kind of understand is, you know, there is a mistake that people make in this symbolism. And like I said, it's the tantric mistake. It's this idea that where people notice that the taboo plays a part in the. In the. The story. And therefore they have this sense that in order to encompass the whole story, they have to break the taboo, that is that they have to engage in. In a kind of sinfulness. And this is where a lot of occultism comes From. And a lot of. A lot of that stuff. But like I said, once again, Christ shows us the difference. Right. Christ does not. Christ said scandal must happen, but woe to those by who it happens. You know, Christ says, Christ goes down all that road. He becomes everything the Tantrists talk about. But he does it in a manner that is not willful. Like, willful in the sense of he does it, he does it, but without wanting it for himself, without wanting it, he lets it happen to him. And. But then he also participates at the same time. So it's. This is. That's why, like, for example, that's why we, as Christians, we see martyrdom as the highest state, because martyrdom is to become impure. Some of the stories of the martyrs are crazy because the things that happened to them in an ancient society would have made them exactly the type of impure being that. That Oedipus becomes. And. But Christians always say, you cannot go towards your own martyrdom. You are not allowed to seek out your martyrdom. That is a sin. Like, that is a very dangerous sin for your soul to seek out your own martyrdom."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":2430.5,"end":2433.78,"speaker":"Dcn Seraphim Richard Rowland","text":"Yeah. So I don't know."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":2434.1,"end":2435.94,"speaker":"Jonathan Pageau","text":"This is very dangerous conversation."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":2438.82,"end":2442.98,"speaker":"Dcn Seraphim Richard Rowland","text":"I don't know if you've read the timeless way of building those books."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":2443.14,"end":2445.06,"speaker":"Jonathan Pageau","text":"Oh, but Christopher Alexander."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":2445.06,"end":2742.07,"speaker":"Dcn Seraphim Richard Rowland","text":"Yeah, yeah, yeah. So I just finished reading the first one. The second one is like a lot more very practical, kind of if you're building a house, here's the things you should know kind of a thing. But the first one is all of the. It's the forms. One of the things that he talks about is the importance of. I'm going to get this a little bit wrong, but it's the importance of a transition point between the street and your front door. So there has to be a place which, in the old days, it would be like a courtyard or something like that. Now it's a little rinky dink porch, but it's a place where the view from that transition point is not the same as the view from the street or as the view from the house. And so he says this is one of the things, it gives us pleasure when we see this executed well. So what's interesting to me is when you start really digging down into stuff that has to do with fairies, that fairies are associated with. Or you could put it this way, if you're ever in danger from fairies. And what everybody in the medieval world agreed on is two things. One is that fairies exist, and the second is that they're quite dangerous, that you could Accidentally sort of stumble into one or accidentally encounter one, or just brush it up against one without realizing it. And you would become. You'd become elf shot, you'd become sick, you'd become touched in some particular way which would not be good for you. And there are certain kinds of places that are more dangerous than others. And with fairies in particular, it seems to be crossroads and doorways, these sort of, like, transition points, these places where one become many. So the idea that I want to kind of put forward to people is imagine a world in which you have a. You have all of these heroes, you have these titular spirits, you have these territorial spirits, these daemons. Maybe they're just sort of like nature spirits. Maybe they're the souls or the ghosts or the shades or the daemons, whatever you want to call them, of great heroes who lived in the past and who's. By their. By their heroism, by their actions, they're the ones who conferred identity upon your people. And now those are the spirits that you have to placate. If you want to do something and have it, you could just say, genuinely be accepted as a cohesive part of the identity of the place where you are. Again, to bring up Jefferson and Adams, America has certain territorial spirits. And they seem to be. We seem to be having kind of a. What a European friend of mine very politely calls a public discussion right now about basically, like, you know, which territorial spirits, which titular spirits, really encompass the American identity and which actions truly placate them, appease them, versus versus which actions are so un American that if we do them, America as it is will cease to exist. And there's always sort of. This is always. The situation of being an American is that you're always just. I mean, if you listen to the news, doesn't matter which news you listen to. If you listen to the news, we are always one election cycle away from completely dissolving as a country forever, right? It's just like, get this next vote wrong and you can lose everything, right? And so you always have this kind of strong sense of urgency, but deep down inside of peeling back the layers of the sensationalism and propaganda and everything, there is this idea that it's like if you. If you violate the spirit of the place too much, that whatever help that spirit was giving you to help hold your identity together is going to be completely lost, right? So, like, there are things that you can do that'll make George Washington sad, right? And if you make him sad enough, you might not get to be a country anymore, right? That's Kind of the idea, right?"}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":2742.07,"end":2746.23,"speaker":"Jonathan Pageau","text":"Yeah, yeah, yeah. Then the Furies. Then the Furies."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":2746.55,"end":2748.39,"speaker":"Dcn Seraphim Richard Rowland","text":"Then the Furies come, right? Yeah."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":2749.03,"end":2751.11,"speaker":"Jonathan Pageau","text":"Hi, this is Sarah from Hamilton and."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":2751.11,"end":2761.23,"speaker":"Dcn Seraphim Richard Rowland","text":"I'm very happy to announce my first course with symbolic world Scripture, the key to reality. Over the span of five weeks, we will look at the scriptural vision of."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":2761.23,"end":2763.19,"speaker":"Jonathan Pageau","text":"Reality through the lens of the Temple."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":2763.59,"end":2807.78,"speaker":"Dcn Seraphim Richard Rowland","text":"We will see how all the details of scripture orbit around the person of Jesus Christ, the eternal word of God and archetype of the world. And we will see how that christological vision firmly earths in place the concrete details of Israel's Torah and story. Through that lens, you will come to see how meaning and matter intersect and intertwine not only in the text of scripture, but in the very tapestry of reality unveiled by the Bible. So what I want to sort of like propose then in a sci fi scenario would be Jonathan's like, what are we doing? Where is this going?"}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":2807.78,"end":2808.62,"speaker":"Jonathan Pageau","text":"What's happening?"}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":2808.78,"end":2916.6,"speaker":"Dcn Seraphim Richard Rowland","text":"What's happening? Imagine that you live 3,000 years from now. A thousand years from now. You know what, screw it. 300 years from now, right, In a place that used to be called America. And something has happened. The great calamity, the great catastrophe. We voted wrong one time. Or all the bombs went off or the emps went off, or Canada. Yeah, well, let's not. It's science fiction. It's got to be, you know, it's not fantastic. Yeah. But something, you know, something happens, right? And you know, America breaks up into a bunch of smaller countries or another civilization comes along and replaces us or whatever, Right. Certainly would not be the first time something like this has happened in world history. Right? But you've still got these legends. There were these guys, Adams and Jefferson, and 50 years after they wrote the document that found. They signed the document that founded the previous civilization, they died on the same day. And you know, there was this Hamilton guy and he was a rapper for some reason, and there was this, right? So you've got the sort of. The titular spirits, the territorial spirits of America are still lingering. They're still lingering somewhere in the background, right. In a more enchanted age than the one that we live in now, possibly the one that we are headed into. You know, God knows it's not unreasonable to imagine, you know, things like it's the 4th of July, we have to leave out, you know, a beer and a Big Mac for, for George Washington or whatever. Like, who's that? Oh, don't worry. It's just some old, some old spirit. It's a fairy."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":2916.6,"end":2917.8,"speaker":"Jonathan Pageau","text":"Yeah, it's Something we do."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":2918.12,"end":3091.19,"speaker":"Dcn Seraphim Richard Rowland","text":"Yeah, yeah. It's a thing that we do. Right. It's midsummer. You know, I think one way of thinking about what fairies are, one way of understanding what they are, is, you know, is the old. The old spirits of the crossroads. Right. The old titular spirits, the old territorial spirits, and the things that are left when something else has moved in. And in the case of a place like Ireland, it wasn't just that Christianity came in and replaced paganism, it's that there were successive invasions, you know, famously seven, according to legend, of where one civilization would completely wipe out the old civilization, but all that would be left are the gods or the spirits. And you do this where one hierarchy replaces another one, over and over and over and over again. And then Christianity comes along. Yeah. And so it creates this situation, this kind of strangely enchanted world. And I said there were three things. Maybe I said two. But there are three things that everybody agrees about fairies. One is that they're quite dangerous. Second is that you're most likely to bump into them at a crossroad. But the third is that fairies are concerned with the question of their own salvation, and that this is actually, for them, a kind of an open question. And it's going to be difficult for me to make this connection, Jonathan, but I kind of feel like sometimes the things that we're going through, the. The question about whether or not fairies can be saved is really a question about whether or not your pagan ancestors, whether there's any hope for them. Right. Yeah. And. And different Christians at different times have come down in kind of different places around this question. Famously, in the west, during the Middle Ages, most people are hardliners. There's no salvation for the pagans, you know, who are not baptized. Yeah. I'm not saying that's the, you know, what all Christians everywhere at all times would believe, but during the Middle Ages, that's kind of the. But the fact that there's this open question about the old ancestral spirits, that is itself, it's kind of saying there might be a little bit of wiggle room here, or maybe there's a little bit of ambiguity here, but I feel like this is what we're going through, you know, to speak about America for a moment. Right. This is kind of what it feels like we're going through right now is a question about those old titular territorial spirits, the ones that have shaped and defined and given meaning to what it means to be American. And the question everybody's sort of asking now, and we cannot help but frame it kind of in a Christian sense is whether or not those spirits can be saved. Right."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":3093.51,"end":3105.58,"speaker":"Jonathan Pageau","text":"So I want to say. I want to say a few things. One is maybe to help people understand this, because obviously when we're talking in images and people can go a little nuts."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":3106.54,"end":3107.1,"speaker":"Dcn Seraphim Richard Rowland","text":"Yeah."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":3107.18,"end":3226.37,"speaker":"Jonathan Pageau","text":"You know, the reason why, for example, even in the kind of early Christian tradition or the late Jewish tradition, this idea that the demons are the spirits of the nephilim. Right. Of the great men before the flood. This is exactly what you're saying. Like, it's exactly what you're saying is that there are these principalities, these great men of old that were kings and great men before our world, and they still linger and they still have influence, but they're not. They're disconnected from the hierarchy right now, you know, and that's what happens in. Not just in. In our mythologies, but it's also the way that the ancient mythologies are set up, which is that once, you know, once Zeus has become the king of the gods, then the Titans are now a bunch of monstrous demons that. That are. That. That are dangerous and, you know, live on the outskirts of the world. And so this is. This is how. This is how it functions. And, and of course, you know, it functions at all these. All these different levels. This is also how it functions. And you can understand that there are. How can I say this? Like, there are memories that participate in your story, that. In your family story, in. In everything that are fragments of worlds before you that you don't completely understand, but that nonetheless are part of your. Of your world. Right. Ways of doing things that your mother does, that if you asked her why she does them, you don't know. She doesn't know why she does them. Like you said, this is just how we do things. Jonathan, I don't know what it is, but it's connected to some ancient pattern that no longer has meaning but is still influencing you. Right. And so we're not. This is not just woo. Like, there is a woo aspect of what we're saying, but we're actually talking about how the world kind of plays itself out."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":3226.45,"end":3269.78,"speaker":"Dcn Seraphim Richard Rowland","text":"And because. Because time is accelerating so much right now, the distance between, you know, me and George Washington is much more similar in certain ways. Like, how do I put this? George Washington didn't live all that long ago in the scheme of world history, but basically he could have lived in a different age of the world for all. And it's not to say that's sort of the big debate is whether or not the country that he and the Founding Fathers envisioned whether or not that country has any relevance in the modern world where circumstances are so greatly changed. Right."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":3270.02,"end":3278.66,"speaker":"Jonathan Pageau","text":"But I think one of the things that you can see, and this is important for people to understand what's happening, is that. What is that project? Was it the 17, whatever."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":3278.82,"end":3281.08,"speaker":"Dcn Seraphim Richard Rowland","text":"16 16. 19."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":3281.24,"end":3282.42,"speaker":"Jonathan Pageau","text":"1619 project."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":3282.5,"end":3282.9,"speaker":"Dcn Seraphim Richard Rowland","text":"Right."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":3283.14,"end":3388.23,"speaker":"Jonathan Pageau","text":"And so you have to understand what it is that this project is. Right. The project is trying to place the founding in America of America before this foundry and say that this. The slave ship that came to America, that is supposedly the real founding of America. And therefore. Right. So what you have is you have someone. You have people who are trying to realign the titular spirit of America to something which is disconnected to the story right now, which is a fragment of the past. It's like a detail of the past that isn't usually contained in the story. And they're trying to say, no, this is the spirit you're under. This is the God that you serve, the God that you serve, the spirit that you serve, the one that binds you, is this spirit from 1619. And therefore, that's the secret, real story of America. And there's a desire to. It's a desire to destroy America is what it is. It's a desire to destroy it by allying yourself with the old gods. Like, this is a. This is like a. This is like a story trope, folks. What you want to do is you want to ally yourself with the old gods. You want to raise. You want to. You know, like in the Hellboy story, for example, like, you want to raise these. These Titan gods that are out there in the cosmos, and you want to bring them into the world in order to destroy the current story. And this is what. This is what the 1619 project is. So it's just important to understand how relevant what it is you're talking about is because it is not just a. It's not just fun to think about this. Like, these are strategies. These are magical techniques that people use to transform reality."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":3388.55,"end":3549.16,"speaker":"Dcn Seraphim Richard Rowland","text":"Yeah, I mean, that's exactly what it is. Like, things like that are spells. And I don't know how much we're allowed to say about this. I guess if I shouldn't say this, somebody can edit it. As part of your indoctrination as a good American, we took you to a private museum full of early American artifacts. But the individual who started this museum, which is the largest private collection in the world of this stuff, as far as I know, he started it because there were literally people kind of pushing for that 1619 project who were buying up early American artifacts, you know, papers, memorabilia, et cetera, and then just destroying them. Right. In a kind of like a willful attempt. It's a kind of iconoclasm, actually. Right. It's like a willful attempt to try to destroy the relics of what, this world? Yeah. You know, of this particular world that we're living in. You could say the American civil religion. And I'm not saying that in a cynical way, by the way. Like, that's, you know, just. It is what it is. Right. So this individual who put the collection together, put it together basically so that it would be so that these things could be preserved and they could kind of be saved from destruction. And so among other things, we got to hold. Like, I still haven't shared the picture because I don't want to trigger all the Masons out there, but like George Washington surveying compass and the shirt collar that Abraham Lincoln was wearing when he was assassinated, it's still got his blood on it. Jonathan touched Lincoln's blood. So he is more American than most of you guys now. And a bunch of other crazy things, obviously, including Hitler's keys. But true story. True story. Yeah. So, yeah, I think that these different stories that we're currently trying to tell. So I wasn't recently sort of thinking about talking about America, but then it's like it's the fourth, and all this stuff. I woke up this morning and just all the stuff was jumbled in my head. But there are some really kind of potent spells that people are trying to cast right now on the right and on the left. And it's all about trying to either suppress or destroy these or bring back into being to embody again these different sort of territorial spirits that are all kind of carving up pieces of the American story. Yeah."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":3549.16,"end":3699.59,"speaker":"Jonathan Pageau","text":"And one of the things. So one of the things. This is important if you want. People want to understand. Now, we're definitely talking magic in ways that I usually don't talk about, but anyways, so one of the things to understand is that, okay, so a story has dark parts in it. A story, a Characters have sins, character have weaknesses. And one of the things that we try to do, especially when we try to establish a world, is we tend to want to hide. Right. The sins of the father. And that's okay to do it to some extent. Right. That's what Noah's sons do when they cover his name. So it's not like that's wrong in itself, but it does have certain side effects. And those side effects are that Those sins, they're still kind of hidden there. And what someone can do is they can go into that. And that's what the 1619 project is, right, is to say George Washington had slaves. So now let's. And we try to kind of not talk about that. We try to kind of make it something that we don't want to be too much part of the story. So then what we do is we go into that and we take that side effect and we say, you know what? That's the secret, actually. That's the secret reason. And you lift it up and then you say, this is the true cause. This is the true reality. And so the way that we have to do that, the way that we have to deal with that is we have to integrate it properly. We have to be able to say, yes, this is the sin of our founder, and we don't hide it. We don't. We. We. We still revere the. The. The founder, but we don't hide the sin. We don't pretend like it doesn't exist. There's a way to kind of integrate, you could say, and we could say, like, we are learning from the sins of our Father. We're not going to repeat the sins. We're going to follow their example but not repeat their sins. But if we don't do that, you know, then what's going to happen is we give power to the enemy, like you're giving power to the enemy of your story. Because that secret will just constantly be trying to. Someone's going to use it to try to make. And to try to make you think that this is the true thing that is founding the. The story. So this is. This is related to a lot of the stuff that I've been talking about, of course, in terms of. In terms of like, World War II and all of these things. Like, we kind. I think that if. Unless we kind of reintegrate things properly, then we're. We're going to be in trouble, you."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":3699.59,"end":3704.79,"speaker":"Dcn Seraphim Richard Rowland","text":"Know, that's for sure. All right, so I'm going to tell you three quick little stories about fairies to round this."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":3704.79,"end":3705.19,"speaker":"Jonathan Pageau","text":"All right?"}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":3705.67,"end":3721.93,"speaker":"Dcn Seraphim Richard Rowland","text":"Okay. And I hope the connection will be kind of evident to people. Kind of see the way we're talking about all these different things. But mostly I also just want to read these stories because I've been promising that kind of teasing this for a long time. This question of whether or not the fairies can be saved."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":3722.09,"end":3722.73,"speaker":"Jonathan Pageau","text":"Yes, of course."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":3723.45,"end":3843.37,"speaker":"Dcn Seraphim Richard Rowland","text":"Which is related again to all the things that we've just been talking about, like, can these Old territorial spirits. Can these old titular spirits. Can the old heroes, you know, what's the. Is there a salvation for them and sort of the new order? So I'm just going to pick three, and there is not going to be enough information here to draw a firm conclusion. Okay, so the first is about a neck. Neck, which is a Swedish. It's like a water spirit. It very often takes the form of a horse. It's related to equine water spirits in a lot of other cultures. Very often it also takes the form of a beautiful young person. It's a kind of fairy. You could say it's a kind of elf. But it's particularly associated with water, and it is extremely, extremely dangerous because the danger is that it will lure you into the water and then you'll drown. Right. The thing that the neck can teach you is music. And so he's got, like, sort of these amazing harping skills. And if you. There's all kinds of. There's all kinds of stories about people who wanted to learn harping skills. So they would bring, like, an offering, usually of, like, a black lamb. Again, I'm not suggesting you should do this, folks, but also if you want to get the next favor, then you should express hope for his salvation. And if you want to, like, sort of like get rid of him, then you tell him that he's going to be damned."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":3845.45,"end":3846.65,"speaker":"Jonathan Pageau","text":"So nice."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":3847.69,"end":4043.59,"speaker":"Dcn Seraphim Richard Rowland","text":"Right? So there's a story. There's a couple of different versions of this story, but it usually goes something like this. There's in. There's a neck who's. There's a kind of neck who takes up his abode underneath a bridge. You know, like a troll under a bridge kind of a situation. They're usually called Stromkarl. And so he's there, and he's playing on his harp and he's singing. And once he's heard by the peasants singing, I know and I know and I know that my redeemer lives. And so these two boys come along and they say, what's the point of what you're doing here? What good is this? You're never going to enjoy eternal happiness. And the neck begins to weep bitterly. And then a priest comes along, and the priest sees the neck there weeping under the bridge, and he basically says, hey, what's going on? And the neck asks the question, do you know if there will be any redemption for me and for my people? And the priest says, he's got a cane in his hand, and he says, sooner shall this dried cane that I hold in my hand grow green in flower, than thou shalt obtain salvation. And so the neck throws down his harp, and he sits by the water weeping bitterly. And the priest gets on his horse and he continues on his way. And as he's riding, he looks down and he notices his cane has started to put out. Green shoots and leaves and flowers and fruits. And so he goes back to the neck and he says, behold, now my old staff has grown green and flowery like a young branch in a rose garden. So likewise may hope bloom in the hearts of all created beings for their redeemer liveth. And the neck is very happy about this news. And he takes up his harp and he starts playing again. Now, this is associated in a little bit of a way to a bit of Roland family lore. Okay. Which I'm now going to tell you about. I don't know if I've ever told you this story. So in my wife's family. So this is actually like Shab Kirch Gessner family lore. My wife's family from Germany. In my wife's family, there is one of her ancestors who was accused of witchcraft and burned at the stake. And she said, as she was being taken to be burnt, she said, if I'm innocent, after my death, this fence post is going to bloom and put out fruit. And they take her and they burn her. And they. The story is, as they come walking back after the execution, there's the fence post that's blooming and putting out fruit. And of course, for some of my family, they were like, oh, well, maybe she really was a witch kind of a thing."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":4043.59,"end":4046.83,"speaker":"Jonathan Pageau","text":"But she was able to make it."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":4047.31,"end":4051.47,"speaker":"Dcn Seraphim Richard Rowland","text":"There could be other reasons. There could be other reasons. Yeah. All right."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":4051.47,"end":4098.85,"speaker":"Jonathan Pageau","text":"So by the way, this story that you've said and the relationship between the neck is there in the story of St. Christopher. So one of the versions of the. The story of St. Christopher is that when he crosses the water, he plants his staff, and then the staff grows. And the. The regrowing of the dead staff is the symbolism itself of the fairy being saved, because it is something that has been cut off from the tree is a disconnected branch. It doesn't participate in the structure anymore. But then there's a miracle by which that. That now branch can reconnect, you could say, to the tree in a way that is mysterious after crossing the waters, after the transition."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":4099.41,"end":4334.15,"speaker":"Dcn Seraphim Richard Rowland","text":"Yeah, no, that's very good. So here's another one that's a little less cheery. This one comes from Scotland, and the story goes that once upon a time There was a pious clergyman on his way home after having administered the last rites to a dying member of his flock. It's late at night. He has to pass through a good deal of what the Scots would call uncanny ground, you know. But he's a clergyman, he's a conscientious minister of the gospel. He's not afraid of all the spirits in the country. So he reaches the end of a lake which stretched alongside the road for some distance, and he hears these beautiful, melodious strains of music. If you ever find yourself just walking along in the dark and you come to a body of water and there's beautiful music, you should be cautious. And so he sits down to listen a little bit to the music and trying to figure out what its source is. And he'd not been sitting for very long at all when he can see a light now gliding across the lake towards him. And instead of taking to his heels, he decides he's going to just sit there and see what's going on. He's a priest. What does he have to be afraid of? And so the light draws near, and eventually he sees what appears to be an individual, let's say resembling a human being, walking across the water towards him, surrounded by several much smaller, like, little people, like diminutive musicians, some of them with lights, some of them with instruments. And this is obviously the source of the beautiful music that he's been hearing. And eventually the taller individual lands on the shore next to him, walks up to him, makes a bow, and he says, I'm sorry for bothering you, Father. And the priest says, oh, it's no problem at all. Have a seat. So they sit down together. And eventually the priest says, all right, so, you know, he says, who art thou, stranger, and from whence? And at this point, with a sort of downcast eye, obviously it's a fairy. He explains that he is one of those sometimes called the Dan xi. These are men, which means the men of peace, or the good men, the good people, which, again, as I mentioned, is very much a euphemism. And he explains that he is one of those angels who were cast out of heaven, but, as they say in Scotland, landed on their feet. That is, they were not cast all the way down to hell. And that he was now doomed, along with millions of his fellow sufferers, to wander through the seas and the mountains until the coming of the great Day of Judgment. What their fate would be, they don't know. And he says, and that is why I've come to you, is to learn your opinion as an eminent divine, as to our final condition on that dreadful day. And so here the priest enters into a long catechetical conversation with a fairy, which we will pass over, touching on the various principles of faith and repentance. And having received several unsatisfactory answers to his questions, he finally says, all right, let's try this. Repeat after me. And he begins the paternoster. And the fairy says, our Father. But when it comes to the word art, he's not able to say it, no matter how many times he tries. He says, our Father, who wert in heaven, as in, you know, the devil."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":4334.15,"end":4335.11,"speaker":"Jonathan Pageau","text":"The devil, yeah."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":4335.11,"end":4361.96,"speaker":"Dcn Seraphim Richard Rowland","text":"Okay. All right. And eventually the priest says, well, listen, if you can't even call God father. And the fairy throws himself into the lake. Now for the really weird one. And this one, I've actually found several."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":4362.04,"end":4376.36,"speaker":"Jonathan Pageau","text":"You want me to just say one thing about this, please? A few things about this one. So you know these stories, people? You know the stories, right? This is the story of the gingerbread man, right? This is what. This is what you're dealing with. This is."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":4376.6,"end":4379.8,"speaker":"Dcn Seraphim Richard Rowland","text":"No, no, I don't know that at all. Jonathan, please explain that."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":4380.28,"end":4381.8,"speaker":"Jonathan Pageau","text":"Do you don't know the story of the gingerbread man?"}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":4381.8,"end":4385.22,"speaker":"Dcn Seraphim Richard Rowland","text":"I do know the story of the gingerbread man. I just don't see how this one connects."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":4385.22,"end":4410.18,"speaker":"Jonathan Pageau","text":"So, yeah, it connects in the sense that you have these. You have these ambiguous beings that come across the water, and the question of whether or not they're going to make it into the next world is not. Is not a. It's not a. You know, there are some things that don't fit, like, they. They just won't. There's something that won't get. Can't be integrated. And that's just."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":4410.25,"end":4410.41,"speaker":"Dcn Seraphim Richard Rowland","text":"Just."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":4410.41,"end":4505.4,"speaker":"Jonathan Pageau","text":"That's just part of. I mean, if you take it at the outset, at a fractal level, if you take it at a lower level, you realize that there's some things that just can't be integrated. There are some. So think about, like, okay, so think about, let's say, America as a land where people come. And you think so people come with their traditions, their behaviors, their. Their own laws, their own kind of local things, and those things slowly get integrated, but some of them can't. Right? And so if you come from a society that practices child marriage, that practice will not be integrated into America. It's not going to come in. Like, if you practice female genital mutilation, that practice will not be acceptable and will not be integratable into America. So you have these ambiguous things that come from the strange lands, they cross the waters, they come here. And then, then there's a, like, then there's a big question how much of this can be integrated and how much of it can't. And then it plays itself out and some of the things are integrated and some of, some of those things aren't. So this image of the alien beings that come across the waters and that basically ask like, can I be so, okay, think about it this way. So someone comes to America and says, I want to be integrated. And then the guy says, okay, you want to be an American? It's like, yeah, I want to know if I can be an American. And they say, well, all right, say the Pledge of Allegiance, right?"}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":4505.4,"end":4505.84,"speaker":"Dcn Seraphim Richard Rowland","text":"Yeah."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":4505.92,"end":4538.4,"speaker":"Jonathan Pageau","text":"And then they're like, well, no, I can't say the Pledge of Allegiance. I'm not going to pledge allegiance to your flag and to God. Well, it's like, if you can't pledge allegiance, then you're not going to be part of America. Like, you just can't. There's no room for you in the identity because you actually don't want. There's something about you that is not able to participate. And so like, it's just to help people understand the structure of these stories, like, it's always easier to. When you apply them at lower level than when you, I mean, there. It's going to be saved. It's like, that's a harder one. That's a bit, It's a question that's so."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":4538.4,"end":4640.02,"speaker":"Dcn Seraphim Richard Rowland","text":"Yeah, yeah, yeah. It's hard to, I mean, if, I mean it's, it's not at all unrelated to the question of like, would a non orthodox person. Visits are my church. Right. You know, before communion we always make an announcement. The Holy Eucharist, being the very body and blood of Christ, is reserved only for those Orthodox Christians who have prepared themselves with prayer, fasting and a recent confession. Right. And so what we're saying is we're drawing kind of a boundary around the chalice and saying this is for people who confess the same faith that we confess, but also who have like properly prepared themselves. You're not supposed to just come up and just like willy nilly take communion even as an Orthodox Christian, if you haven't, you know, fasted and prepared and things like this. And so this is one of the things that visitors sometimes struggle with. And it's always kind of odd to me in the sense that, I mean, like, I get it, but also like, these are people who don't believe it's the body and blood of Christ. Very often, you know, these, like, you know, Protestant visitors, they don't believe that it's the body and blood of Christ. They don't believe our church is the true church, let alone a true church. Right. You know, and so. But they feel kind of offended that they're being excluded. And I always, you know, kind of tell people, I'm like, listen, we'd be very happy to give you communion. There's just a couple of things we need to do first. Right. You know, and it's sort of like, can you integrate? Can you accept the authority of the church? Can you put yourself under the authority of an orthodox bishop? Can you say the creed the way that we say it, mean what we mean when we meet, when we say it, and so on? Right. That's sort of just that question of, you know. You know, there. I don't know, I'm rambling a little bit, but."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":4640.02,"end":4739.76,"speaker":"Jonathan Pageau","text":"No, no, no, no. Trying to give examples to why the question of whether the fairies can be saved is an ambiguous one. It's one that cannot be answered in a definite. In a definite way. It can be only answered in a manner that seems to move back and forth because that's what crossing the waters is. Right. And so the. The what. What makes it through the waters? Right. The Egyptians don't make it through the waters, folks. The Egyptians, they stay in the Red Sea, and the Israelites make it through the waters, and that's what happens at that crossing. And so the question of the. Of the fairies crossing over the water, you know, it's like, that's the question that's being asked, like, what makes it through? And the thing is that. So now let's talk about the. The problem of what kind of makes it through. So the fairies that cross over the waters and ask if they can be integrated or that play music under the bridge, they are the image of the residues or of the remaining influences of old worlds that, although haven't been completely integrated, are still lingering. They're still kind of hanging out, like they still have influence on us. And sometimes you could say that some of these influences, the question of whether or not they can be fully integrated is still up in the air. They feel like strange influences or unknown patterns that we participate in that we don't completely understand the reason for, but are still kind of there despite ourselves, you know?"}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":4740.16,"end":4922.88,"speaker":"Dcn Seraphim Richard Rowland","text":"All right, so related to that neck, by the way, you'll notice all three of these have to do with kind of water spirits. Yeah. Which most fairies seem to Be of that type. If you just sort of like read through all the books, many of which are not in English, if you read through all the books, a lot of the things that we call fairies are some kind of a water spirit actually so related to the neck. There is the. In German, it's called the Nixie. In Breton folklore, so this would be, you know, Little Britain, Brittany, on the Celtic coast of France, there's a. They're called the Korrigan, but it's the same kind of idea. It's a feminine water spirit, usually very beautiful, who loves. Who basically like loves or seduces men and wants to sort of bring them down into the waters. And there's a. Actually in Breton folklore and in German folklore, the Corrigan or the Nixies mortal enemy is the Virgin Mary. And so because Saturdays are dedicated to the Virgin Mary, at least traditionally in Europe and still are actually in the Orthodox Church, since Saturdays are dedicated to the Virgin Mary, Saturdays are always the days that you have to be extra careful because they're the days that the Nixie or the Corrigan is most likely going to act up. And they're the mortal enemies of the Virgin Mary, essentially because the Virgin Mary is the one who guards the purity of young people. Right. So there's this Nixie, this is out near Einbeck, near Guben in Germany. There's a spring there called the Ostere Spring, probably has, you know, Oster is probably related to like East Easter, etc. Right. But the Ostera spring, which is a spring really prized for its healing powers. And there was a Nixie that lives in the springs. And one day she sees and falls in love with a young man from the local village by the name of Heinrich. And she has a lot of sort of secret meetings with him. She's trying to seduce him, but ultimately his piety, his fear of God are stronger than his love for her. So he dedicates himself to the Virgin Mary and resists all of her temptations. And she is tormented and also really, really angry. And she says. So she comes up with this idea which is that she's going to infiltrate the service of the Virgin Mary so that she can learn the Virgin Mary's power. So she takes the form of a beautiful woman, goes to the nearest convent."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":4925.12,"end":4926.16,"speaker":"Jonathan Pageau","text":"Becomes a nun."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":4926.32,"end":4927.36,"speaker":"Dcn Seraphim Richard Rowland","text":"And becomes a nun."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":4927.52,"end":4928.32,"speaker":"Jonathan Pageau","text":"That's crazy."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":4929.33,"end":5021.45,"speaker":"Dcn Seraphim Richard Rowland","text":"And as a. I mean, this is the story which is I found in three different books. It's a pretty well known story, or at least was back in the day. So the story is that as a lay sister, she performs all the hardest and most menial services to the monastery. She's silent, she's unrecognized. And that in the course of this humility, this is. This is what the story says. It says that Christ entered her soul and filled her with the blessings of the Gospel. And her hatred for her rival, the Virgin Mary, is turned into love. And eventually her humility and piety become recognized. And so eventually she becomes a nun, takes the name Paula. This is how specific this story is, by the way. Then she becomes a sub. Prioress, and then a prioress, and eventually she becomes the abbess of the convent. And because of her sort of healing powers, you know, and then also her. Her love for God, she becomes. She. She. She begins to have this reputation for holiness. Now, there's two things that I should mention at this point. One is it seems to be. It's actually not explicit in the story that. That I found until the very end, but it seems to be that someone, maybe it was the Virgin Mary, had basically told her, if you can endure in my service for seven years, then you can become a human or, like, your soul can be saved."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":5021.93,"end":5022.57,"speaker":"Jonathan Pageau","text":"Real girl."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":5022.81,"end":5086.86,"speaker":"Dcn Seraphim Richard Rowland","text":"Yeah, you can become a real girl. Right. The other thing is that although nixies can take the forms of human women, there's always one tell. And this will be helpful information out there for young men and women wandering through the forest of Germany. They're water spirits, and so they always. The hem of their robe is always damp. Right. This is the one thing that they cannot hide. It's like the fringe of their robe is always damp. Yeah. So no matter how carefully she tries to hide the damp hem of her veil, it does not escape the eyes of one of the younger nuns there who figures out her secret. And sooner or later, her secret becomes known to the whole convent. And at that point says that the whole. That the nuns all. It says that the hearts of the nuns became alienated to her."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":5087.02,"end":5087.42,"speaker":"Jonathan Pageau","text":"What?"}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":5087.82,"end":5174.12,"speaker":"Dcn Seraphim Richard Rowland","text":"Cold greetings, lurking looks, secret whispers. And eventually the confessor, the father confessor of the convent learns the secret. And so, in his zeal for the salvation of the Church, he questions her in the confessional. And she stands up, wrings her hands, lamenting, confesses that she's the Nixie of the Ostara Spring. And now she has to go back to her damp dwelling. And this is six years in. This is six years in. So one more year, her seven years of trial would have been over. Her soul would have been saved. Close to her goal, she's now farther than ever from it. And it says in the story, because of the hasty zeal of the nuns. So she leaves the convent. She leaves all the sacred objects. She leaves all its inhabitants. And at this point, the nuns are full of regret and they begin to weep, because they all really did love her. And she goes back silently to her cold former dwelling. And since then, so it is said, she's often been seen walking through the cloisters of the convent late at night in her nun's habit, particularly on the eve of the 15th of August, the remission or the assumption of the Virgin Mary. And the story concludes, she has never done harm to anyone. So, man."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":5177.16,"end":5179.56,"speaker":"Jonathan Pageau","text":"That'S some deep, deep ambiguity there."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":5180.92,"end":5182.04,"speaker":"Dcn Seraphim Richard Rowland","text":"These are the stories."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":5186.12,"end":5189.48,"speaker":"Jonathan Pageau","text":"When is this story from? Do you know?"}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":5190.68,"end":5229.15,"speaker":"Dcn Seraphim Richard Rowland","text":"So it's from. I mean, it's from medieval Germany. Yeah. It would be hard to. It's copied. I found it three or four different places, I think it would be hard to nail down the particular year. Maybe somebody else out there will find it and will know. The book that I read this in is a German book published in 1862 that's just like kind of a collection of different fairy stories. It's all in German, but. But there's. That's. The account that I gave you comes from that. But I've come across this account in similar books, other places. Yeah."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":5230.99,"end":5234.67,"speaker":"Jonathan Pageau","text":"So then make it six years."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":5235.55,"end":5253.68,"speaker":"Dcn Seraphim Richard Rowland","text":"Just one shy. Just one shy. Yeah. Yeah. There's some interesting. I mean, there's a lot of interesting things in there. The hem always being of her veil still being damp. I think that, you know, that the point is basically made that this is someone who could have been integrated."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":5255.76,"end":5256.8,"speaker":"Jonathan Pageau","text":"Just didn't make it."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":5256.96,"end":5264.28,"speaker":"Dcn Seraphim Richard Rowland","text":"But people were a little overzealous. Yeah, yeah, that's. I mean, that's quite interesting to me. Yeah, yeah."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":5264.28,"end":5275.04,"speaker":"Jonathan Pageau","text":"Right. In some ways that it's like because of their excess of zeal, they've actually pushed away a good thing. And they all, even for themselves, like, they basically lost a good thing."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":5276.16,"end":5276.48,"speaker":"Dcn Seraphim Richard Rowland","text":"Yeah."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":5277.36,"end":5278.08,"speaker":"Jonathan Pageau","text":"Yeah, man."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":5278.72,"end":5285.76,"speaker":"Dcn Seraphim Richard Rowland","text":"All right, so there we go. Bronze Age to Thomas Jefferson to the. The convent Nixie."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":5286.48,"end":5309.83,"speaker":"Jonathan Pageau","text":"Yeah, yeah. And by the way, like, the. The one of the. In America, one of the recent, like, obsession with also native kind of aboriginal legends and stories and a desire to, in some ways, give back the."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":5311.75,"end":5312.15,"speaker":"Dcn Seraphim Richard Rowland","text":"Land."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":5312.15,"end":5340.41,"speaker":"Jonathan Pageau","text":"To those spirits, you could say, you know, in different ways is also part of the same kind of 1619 trope, which is, in some ways, to recognize the allegiances and principalities that were there before the founding of our story and then ally ourselves with those spirits and try to destroy our world by using the old gods, by using the old spirits."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":5341.29,"end":5538.7,"speaker":"Dcn Seraphim Richard Rowland","text":"It was really interesting. I was in Alaska a couple of weeks ago for The Glorification of St. Olga of Alaska, which is the newest American saint. She's glorified by the Orthodox Church in America, our church. And she's just a really wonderful. I would love to actually do a whole universal history episode on St Olga and on her life, because one of the interesting things. One of the interesting things that's kind of been going on has been even a discussion, even among, let's say, Christians, saying things like, well, Orthodoxy is never going to be truly American, so it can never actually integrate into the American story. Right. I've seen people even, like, coming at me on Twitter to have a debate about this. And so it was really interesting being with. I mean, Matsushika Oga was a native Alaskan. Is a native Alaskan. And so we were there. And we were there in a cathedral with probably about 8, 900 people. Just really wonderful, beautiful liturgy. Nine bishops. Eight or nine bishops and, you know, like 40 priests and five deacons and, you know, just, you know, hundreds of people. I mean, it was a really glorious day, really beautiful day for the whole American church. But one of the things that, you know, was really interesting was kind of sitting down and talking with some of the native clergy and also even, like, some of the lay people, you know, tribal elders and so on, for whom, you know, they've been. Their families have been Orthodox longer than Alaska has been part of this country. And so for them, actually, being Orthodox is synonymous with being a native and with, like, preserving the sort of native culture. Right. And so for them, it's the certain missionaries from other Christian groups, Presbyterians, I think, in particular, who kind of, you know, came in and basically did violence to their native culture, trying to basically convert them. And they were like, we're already Christians. What are you guys doing? You know, So, I mean, it's really interesting because, you know that. I know that a lot of people have talked before about the ways that the native Alaskans, you know, the ways that Orthodoxy integrated native Alaskan culture without sort of, like, just destroying it. And that's. It was just really amazing to see how that continues to be preserved. Not that it's not very difficult up there. I mean, there's a huge clergy shortage in Alaska. Alaska's basically just the hardest place to live in the country, I think. But, I mean, it was really, really beautiful. And it was really. Definitely had a sort of a sense as an American and as an Orthodox Person living in America and being American. Going to Alaska was kind of very much kind of going to the Holy Land in a certain sense. It was like, you know, this is kind of. This is where it began. So."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":5539.42,"end":5623.91,"speaker":"Jonathan Pageau","text":"But it's interesting to think about, like, how the difference between that and the kind of this weird fake, like, worship of aboriginal culture that we see today. Right. I keep thinking that one of the greatest things, I think, even for, like, one of the great things that could happen for America would be in, like, that Black Elk read, because Black Elk is up for first for becoming a saint. Like, these kinds of gestures could be very powerful. Powerful gestures. You know, you can see how. You can see the difference between that true, like, embodiment and the desire to continue to. The desire to find ways to integrate our past with the faith and to kind of do it in a way that's organic and. And natural and the kind of politicized desire to kind of use Native culture as a. As a political tool for the deconstruction of America. Like, those two things to me seem very, very different. One has a kind of real narrative power, like a true. And what the other is, is like. Is a. Yeah. Is akin to. To kind of aligning yourselves with the old gods in order just to destroy the current state of things."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":5624.15,"end":5628.55,"speaker":"Dcn Seraphim Richard Rowland","text":"Yeah, that's right. So. Well, I think we've just covered everything today."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":5628.63,"end":5632.07,"speaker":"Jonathan Pageau","text":"Pretty much talked about all kinds of things."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":5632.55,"end":5634.71,"speaker":"Dcn Seraphim Richard Rowland","text":"Real, real efficient episodes."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":5634.79,"end":5635.15,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":5635.15,"end":5639.99,"speaker":"Dcn Seraphim Richard Rowland","text":"Well, Jonathan, this is good to talk to you. It's been a little while since we recorded together, so. Thanks."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":5639.99,"end":5643.59,"speaker":"Jonathan Pageau","text":"Well, I hope you have a great Fourth of July that you're going to do. American things today."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":5644.05,"end":5652.21,"speaker":"Dcn Seraphim Richard Rowland","text":"I do some very American things. Yeah. Yeah. I mean. I mean, basically we're going to, like, you know, grill and turn on the sprinkler for the kids, but there you go."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":5653.01,"end":5655.21,"speaker":"Jonathan Pageau","text":"Do you have fireworks on the 4th of July? Is that a big thing?"}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":5655.21,"end":5813.74,"speaker":"Dcn Seraphim Richard Rowland","text":"Oh, yeah, that's a big thing here especially. Especially, like, it's a big part of kind of like I hide it well, but I'm really just a redneck at heart. And so it's a big part of kind of like, you know, like, I don't know, rural American culture, redneck culture. Right. You know, setting off fireworks. So anyway, you definitely got some plans related to that today. Having some people over for a barbecue, and we'll be, you know, obviously praying for our country. I mean, it's very important that. I mean, this is one of the things that in the early apologists of our faith, when they were being persecuted by the Romans, you know, would write to the Roman emperor and say, listen, we love being Roman more than anybody else does. We pray for you better than anybody else does. And I think really, no matter what country that you find yourself living in, if you're an American or you're, God help us, Canadian or you're. Or you're English or you're French or whatever else, right. I think those are the countries. But no matter what country you find yourself living in, you should love that country. And it doesn't matter if the country is great, and it doesn't even matter if the country is good. The fact that you live there is a, you know, that you were born there or that you chose to move there. That's reason enough to love your country. And you should pray for it. And you should pray for your rulers and you should pray for your fellow citizens and for the world that your children are going to grow up in. So that's what we'll be doing today. Going to celebrate. We're going to have some beers so that George Washington is not sad. And by the way, by the way, I'll just say this is how American I am. So Mount Vernon, which is Washington's plantation in Virginia, it's like a historical site. You can still go there. They still grow tobacco and distill whiskey. There's. And there's a thing you can do a few times a year where you go and you're, like, sitting in George Washington's library and you can smoke a cigar made from tobacco grown on the site and drink, like, corn whiskey that was distilled on the site. And I feel like this would be the most American thing that you could do. So next time you come down, let's do it. Next time you come down. Yeah. Yep. All right. Thanks, everyone."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":5814.46,"end":5815.66,"speaker":"Jonathan Pageau","text":"It was great to see you again."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":5816.54,"end":5818.7,"speaker":"Dcn Seraphim Richard Rowland","text":"Happy 4th, everybody. All right, bye. Bye."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":5818.78,"end":5833.82,"speaker":"Jonathan Pageau","text":"If you enjoy these videos and podcasts, please go to the symbolicworld.com website and see how you can support what we're doing. There are multiple subscriber tiers with perks. There are apparel and books to purchase. So go to the symbolicworld.com and thank you for your support."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":5834.47,"end":5897.37,"speaker":"Laura Diaz","text":"Tucson the weight is over mediweight loss. They're officially open on North Oracle Road. That's right. No more counting down the days. You can walk in right now and start your journey to a healthier you. Hey, it's Laura Diaz from iHeartRadio. And you can trust me. This isn't just another weight loss clinic. I know that because it's where I lost weight safely with real medical support. GLP1 medications. You can see them everywhere online right now, but the truth is your health shouldn't be a DIY project ordering these meds without the professional guidance. It can lead to dangerous mistakes, wrong doses, no oversight, and serious risks. At mediweightloss, I got the same medication but with a customized plan, weekly check ins and a licensed physician guiding me every step of the way. And the cost? The same as those risky online options. Tucson, your moment is here. If you're ready to take control, feel better and lose weight the right way, Medi Weight loss is ready for you. Walk in, get started and see real results. Call or visit mediweightloss.com to learn more and book your free consultation today. That's mediweightloss.com looking for your next Go."}
{"episode_id":"SW - #402 - 2025-07-31 - Universal History - Dcn. Seraphim Rohlin - The Spirits Beneath America - Fairies and Founding Fathers","start":5897.37,"end":5962.72,"speaker":"Dcn Seraphim Richard Rowland","text":"To Smoke Shop Stop scrolling. I've got you. Headshop.com is the number one online smoke shop already trusted by over 100,000 happy smokers just like you. They've got it all. Dab rigs, vaporizers, glass bongs, smoking pipes, even thca flour all in one place. Need a new daily driver? Grab a smooth glass bong or a classic smoking pipe. More of a concentrate fan. Their dab rigs, E rigs and wax accessories are designed for smoother, harder hitting sessions. And yes, they've even got legal THC flower. Best part? Every order ships fast and discreet, which is why thousands of smokers keep coming back. So don't waste time hopping between shops. Shop the best in dab rigs, vaporizers, glass bongs, smoking pipes and THCA flower right now@headshop.com the number one online smoke shop, headshop.com has what you need. Check it out today. Oh, and because you're listening right now, you get 10% off your next order when you use the coupon code HSHOP at checkout. Go to headshop.com now and smoke smarter."}
