{"episode_id":"SW - #028 - 2019-02-08 - Jordan Peterson and Jonathan Pageau Q&A at Seattle Conference - Oct. 2017","start":0.24,"end":38.78,"speaker":"Jonathan Pageau","text":"I would like to welcome you to episode 28 of the Symbolic World podcast. On this episode I will be playing for you a Q and A that I did with Jordan Peterson at the Seattle conference of which I posted last week my talk, Sacred Space In Secular Terms. Jordan and I go into different subjects. We kind of bounce off each other and there are a few other panelists there as well. And so enjoy. This is Jonathan Pageau. Welcome to the Symbolic World."}
{"episode_id":"SW - #028 - 2019-02-08 - Jordan Peterson and Jonathan Pageau Q&A at Seattle Conference - Oct. 2017","start":49.82,"end":62.75,"speaker":"Moderator","text":"So we're going to begin our discussion today with a question that is for each one of you. And that question is what three resources would you recommend to high school or university students who would like to pursue a career in your field?"}
{"episode_id":"SW - #028 - 2019-02-08 - Jordan Peterson and Jonathan Pageau Q&A at Seattle Conference - Oct. 2017","start":63.23,"end":333.54,"speaker":"Jordan Peterson","text":"So I'm just going to speak about this practically and I'll speak about becoming a clinical psychologist and that's associated in some ways with becoming a professor. So that'll do the trick. So you have to take a bachelor's degree, likely in a science oriented field. I would recommend, especially if you're going to university now, to stick fairly close to the disciplines that have at least one foot in science. That would include psychology generally, although there are more scientific subdomains of psychology and less scientific subdomains. If the people that you are being educated by have to know something about the brain or about biology, it tends to discipline them quite nicely. And so that keeps them from falling too far astray into the more cult like elements of the modern university. You have to do exceptionally well in your last two years of your undergraduate degree to have a chance to become a clinical psychologist. You need an A average, with really without exception. And you have to do extremely well on your graduate record exam, which is kind of a general purpose entrance exam. So it's very competitive. And then so that's the practical issue. And then there's another practical thing to consider which is that if you want to become a clinical psychologist, you don't get to pick the school you're going to go to. Unless you are unbelievably well qualified as an undergraduate. You have to apply. If you want to get in to a clinical psychology program, you have to apply to like 30, including places you think you'd never go, because you can always say no. If someone says do you want to come? And you have a couple of choices, well, lucky you. And if you only have one choice, well, and it's not a school that you would normally consider, it might be a lot better than nothing, especially because you educate yourself in many regards. And then having said that, so those are the practical issues, I would say Read the great clinicians. There's a very large number of them that were stretched across the 20th century. I've put a number of books of that sort on a reading list on my website. And you can't go wrong by reading Freud and by reading Jung and Adler and Carl Rogers and Abraham Maslow and the people who established clinical psychology as a discipline and the behaviorists as well, who have very many extraordinarily intelligent things to say about the way that human beings and animals as well, learn. So, and then the other thing I would say is if you're going to be a clinical psychologist, you know, what do you need to be like temperamentally? And you have to be interested in people, you know, you, and you have to be interested enough to really listen to them because a huge part of what you do as a clinical therapist, and this is also true if you're a physician, by the way, the data on this is quite clear, is that you listen to people and by doing so you might ask them questions when you can't understand what they're telling you. But a lot of what you're doing as a listener is helping people sort themselves out. You know, like, you just can't believe how many people have no one to talk to. And so, and people, most people think by talking, it's actually really hard to think because to think properly you have to be like three people in your own head because you have to have an argument, you know, and all of those different little avatars of yourself have to be well armed and ready to have a battle and you have to be able to tolerate that. And it's, it's a really difficult technical exercise. It's not like everyone knows how to do it. And just because something pops into your mind doesn't mean you're thinking. It's the testing of what pops into your mind that's the thinking. And so the way that people do that when they don't think, which is really almost all of the time, is that they talk to someone else. And then the thinking is watching how the other person reacts to what they're saying, you know, with a lift of the eyebrows or maybe, you know, the person dozes off, which is not generally a good sign. Or, you know, you're getting feedback from the other person constantly about what you're saying. And, and, and you also listen to yourself and that can clue you in a lot because you'll end up saying if someone's listening to you, you'll end up saying things that you don't necessarily agree with. And you won't even notice that till you put them out on the table. And so the other thing, if you want to be a clinician is like, there's nothing bit. And if you want to be a good partner to someone, for that matter, there is absolutely nothing better that you can do than listen. So that would be my two cents, I suppose."}
{"episode_id":"SW - #028 - 2019-02-08 - Jordan Peterson and Jonathan Pageau Q&A at Seattle Conference - Oct. 2017","start":336.58,"end":533.42,"speaker":"Jonathan Pageau","text":"Well, I would say if you want to become an artist, I would say don't. It's really not a good idea. There are too many artists and we don't need any more. So that's the first thing. So if after I've said that you still really want to be an artist, I would say for any art you make, I would say draw. That's. Learn to draw from. Draw from observation. You know, copy the masters and then learn to draw from the structures, from the inner structures. Learn proportion, learn about how to lay things out, Learn composition. All those things that's really. And that you can do. You can do that on your own. You can do that. You can take life drawing workshops. You can do all that kind of thing. The second thing I would say is to make sure you have people around you that are ruthless and that will not try to make you feel good. That's one of the things I really disliked art school for, the kind of postmodern ideology that was taught there. But one of the things that you do learn, even today in art school, is that you learn to be criticized. And you learn to have people around you that are looking at your work and are just going to go at it with a hacksaw. And you have to take it. Because when you're making art for yourself and you're making art for your family, and it's all nice and cozy, that's all good. But if you really have the idea of doing it professionally, you have to have people around you that aren't there to make you feel good about yourself, and they're going to rip your things apart. So I think that that's really important. And in terms, I would say, of being a liturgical artist, because that's what I do. Like becoming an iconographer, that's really the hardest part. Because ideally you would have to find a teacher, and there aren't really that many teachers around. And so if you want to become an iconographer, first of all, I would say, again, don't, because there are too many iconographers. It's the same thing. But if you really want to do it, I would say you need to find a teacher. If you can't Find a teacher. Luckily, online now we have. There are people like, I was lucky I didn't have a teacher. And when I started to learn to carve, I told you that story yesterday. I was lucky to have some really good icon carvers that were willing to be ruthless with me and just look at my things and just hack at it and take it down so that I would become better. And so I know that iconographers, they love iconography. And so if they see someone who is really dedicated, who's putting in the work, you know, who's doing the drawings, who's going full at it, they will be happy to give you criticisms of your work and if they see that and to kind of help you along, because artists are actually really excited to see other people that can. That are coming and that are doing great things. So that would be my basic advice."}
{"episode_id":"SW - #028 - 2019-02-08 - Jordan Peterson and Jonathan Pageau Q&A at Seattle Conference - Oct. 2017","start":539.34,"end":547.9,"speaker":"Moderator","text":"Dr. Peterson, this next question is for you. Is deconstructionism and gender theory the final phase of the iconoclasm heresy?"}
{"episode_id":"SW - #028 - 2019-02-08 - Jordan Peterson and Jonathan Pageau Q&A at Seattle Conference - Oct. 2017","start":551.02,"end":563.82,"speaker":"Jordan Peterson","text":"I don't know if I understand that question well enough to answer it, to tell you the truth, because I don't know enough about the iconoclasm heresy. So can you define it?"}
{"episode_id":"SW - #028 - 2019-02-08 - Jordan Peterson and Jonathan Pageau Q&A at Seattle Conference - Oct. 2017","start":565.5,"end":566.46,"speaker":"Patrick","text":"He didn't write the question."}
{"episode_id":"SW - #028 - 2019-02-08 - Jordan Peterson and Jonathan Pageau Q&A at Seattle Conference - Oct. 2017","start":568.14,"end":569.26,"speaker":"Jordan Peterson","text":"That's very simple."}
{"episode_id":"SW - #028 - 2019-02-08 - Jordan Peterson and Jonathan Pageau Q&A at Seattle Conference - Oct. 2017","start":571.35,"end":658.62,"speaker":"Jonathan Pageau","text":"So the iconoclastic controversy was a moment in the time of the Church where they began to doubt whether or not it was possible to represent Christ in an image. And the idea, of course, is, going back to the Old Testament, that this idea of a transcendent God, which you can't represent, and the final argument given by the Church is that, no, indeed, when God becomes man, when God takes an image, then we represent him as man in that image. And it's become this notion that God manifests himself through image and in the world has become the cornerstone of Christian tradition. And kind of like the final. When they said that they call it the Last Ecumenical Council, it's like the last moment where the whole church agreed on something, was that the images were going to be part of the church. It was like a seal that said, yes, God does manifest himself in the world, and those things can be encountered and engaged with. And so I think that the person asking that question is asking whether or not postmodernism is a continuation of this idea of iconoclasm, which. Where forms, where structures, where images cannot contain sparks of divinity, can't contain actual meaning."}
{"episode_id":"SW - #028 - 2019-02-08 - Jordan Peterson and Jonathan Pageau Q&A at Seattle Conference - Oct. 2017","start":659.74,"end":664.54,"speaker":"Jordan Peterson","text":"So how do you think that's related to the idea of gender studies, let's say, or gender?"}
{"episode_id":"SW - #028 - 2019-02-08 - Jordan Peterson and Jonathan Pageau Q&A at Seattle Conference - Oct. 2017","start":664.62,"end":665.9,"speaker":"Jonathan Pageau","text":"Maybe I should answer the question."}
{"episode_id":"SW - #028 - 2019-02-08 - Jordan Peterson and Jonathan Pageau Q&A at Seattle Conference - Oct. 2017","start":665.9,"end":669.74,"speaker":"Jordan Peterson","text":"Well, maybe you should yeah, it sounds like it. So far, you're doing a pretty good job."}
{"episode_id":"SW - #028 - 2019-02-08 - Jordan Peterson and Jonathan Pageau Q&A at Seattle Conference - Oct. 2017","start":674.78,"end":738.85,"speaker":"Jonathan Pageau","text":"The problem with the new gender theory, it does indeed have to do with. With iconoclastic controversy, because the idea is that there is no. There is no relationship between. Let's say, there is no necessary relationship between, let's say, the idea of male and the manifestation of masculinity. And so they're divided. And so you could either see that either as an iconoclast, as a continuation of the iconoclastic controversy, which in a way is. Is really a pursuing of the Gnostic heresy, which is to believe that what's really important is what's these abstract things, ideas up there and the world. There is no direct connection between the two. And so with that thinking, you can say, well, masculinity is just an idea. And so if you want to be masculine, you can. There is no necessary connection between, let's say, your body and masculinity. They're separate."}
{"episode_id":"SW - #028 - 2019-02-08 - Jordan Peterson and Jonathan Pageau Q&A at Seattle Conference - Oct. 2017","start":738.93,"end":756.29,"speaker":"Jordan Peterson","text":"Okay. And so the. The people who are promoting this theory describe people who believe, the scientists, for example, who believe in. In a direct connection between that as biological essentialists, and they regard that as a form of intellectual fascism. Right, right. Okay. So that's. That's. That's. That's how that's reflected in the secular world."}
{"episode_id":"SW - #028 - 2019-02-08 - Jordan Peterson and Jonathan Pageau Q&A at Seattle Conference - Oct. 2017","start":756.77,"end":809.94,"speaker":"Jonathan Pageau","text":"And postmodernism has. Has that as well. It's the idea that. That all forms are equal, like any form will do. Right. And so you can make a painting of the most insane thing, and it's equal to an icon of Christ because there is no necessary hierarchy, there is no necessary relationship in form between the ideas and their manifestation. Whereas the liturgical idea, and really the traditional Christian idea, is that liturgy is that Christian life is the union of those two things together, and that appears as the cross. It doesn't mean it appears only as this glorious golden thing. It does, but it also appears as a dying. So there's an aspect which is true in that when the divine appears in."}
{"episode_id":"SW - #028 - 2019-02-08 - Jordan Peterson and Jonathan Pageau Q&A at Seattle Conference - Oct. 2017","start":809.94,"end":810.38,"speaker":"Dr. Bissonnet Petrie","text":"The world."}
{"episode_id":"SW - #028 - 2019-02-08 - Jordan Peterson and Jonathan Pageau Q&A at Seattle Conference - Oct. 2017","start":812.94,"end":851.82,"speaker":"Jonathan Pageau","text":"It can appear as sacrifice, so that the form can be sacrificed than to be resurrected in a glorious form, whatever that means. But there is a relationship, I think, between iconoclasm, let's say, and the postmodernism. It's mostly a neo Gnosticism. I think it's probably the better way to see it is that this idea that we're spirits and our bodies don't matter, and we can kind of make our bodies fit whatever imaginary spirit that we have, but that's not the image of the person in the Christian tradition, the idea of the person is really this union of heaven and earth into a being."}
{"episode_id":"SW - #028 - 2019-02-08 - Jordan Peterson and Jonathan Pageau Q&A at Seattle Conference - Oct. 2017","start":852.38,"end":915.96,"speaker":"Jordan Peterson","text":"Yeah. So just a bit of comment on that is like one of the things that has, I would say, astounded me to some degree about the idea of the divinity of the body is that that seems to be an idea that's very hard for modern materialists, who maybe have a spiritual bent to accept. You know, they tend to think of the soul as something that's completely disembodied. And the problem with that is that it. It doesn't address the problem precisely because the problem or it makes the body into a problem that has to be solved without having a body. And that's actually not much of a solution. It's actually a denial of the utility or the divinity of the body. And so that's another danger in separating the spiritual too much from the. Or the ideational too much from its embodiment. It's an escape from the embodiment or an escape from incarnation. It's something like that. And that might be equivalent to the denial of biological reality, something like that. So, anyways, definitely Jonathan could answer that question better."}
{"episode_id":"SW - #028 - 2019-02-08 - Jordan Peterson and Jonathan Pageau Q&A at Seattle Conference - Oct. 2017","start":918.04,"end":928.95,"speaker":"Moderator","text":"So in that answer, though, both of you discussed the concept of postmodernism. And so any of you could speak on this topic, but would you say that there is any hope for postmodernism?"}
{"episode_id":"SW - #028 - 2019-02-08 - Jordan Peterson and Jonathan Pageau Q&A at Seattle Conference - Oct. 2017","start":929.35,"end":1275.66,"speaker":"Jordan Peterson","text":"Well, there's something right about it. What's correct is that there is a very large number of ways of interpreting any small set of phenomena, and it's actually in some ways a testament to the possibility that's embodied even in a determinant actuality. Like, I mean, this is a water bottle, but it could be a rather ineffectual weapon. You know, like, there's all sorts of possibility in every situation. And the postmodernists made that diagnosis correctly in some sense, and it was discovered at the same time in all sorts of other fields. So, I mean, the people who were first building artificial intelligence systems, who were influenced by the behaviorists, more or less thought of the world as we see it, made out of determinant objects with defined borders that were actually there in some real sense, independent of us. And so they thought of figuring. They thought that figuring out how to act in the world was going to be the difficult problem for artificial intelligence. But what they learned very rapidly was that the difficult problem was seeing the world because the boundaries that are so obvious to us are not so obvious out there in the external world. It's not, you know, and Jonathan made an allusion to that today when he talked about grouping things to go to the gym, it's like, well, why are those things in your gym bag? Well, it's a category. Things that go in my gym bag. What kind of category is that? Well, it's defined by embodied purpose. And this is actually quite well understood in cognitive psychology. So, for example, there's a guy named Gerd Gigerenzer who's quite a brilliant psychologist, and he talked about our ability to generate categories on the fly. And his favorite example is things to take out of your apartment when it's on fire. Right. And you know, while you think about the things you take out, they bear no objective similarity to one another, Right. They're united by something like purpose. So anyways, the postmodernist claim is that there's a very wide variety of ways to interpret the world, and that turns out to be exactly right in a very, very deep sense. But where they go wrong and completely and utterly wrong is to assume then, and Jonathan also alluded to this, that all the solutions to the problem of perception are equally valid, and that's just wrong. And the way they gerrymander that is, in a sense, by denying the reality of the objective world, because. So there's lots of ways of looking at this situation, but there are only a set number of ways that will get me through that door without causing conflict with all of you. Like, if I walk to that door and I just pushed you all out of the way or hit you, then the probability that that's one way of getting out, you know, it really is. And it's. It's one of the many ways I could get out of here. But the problem is, is that you would likely object to that. And so it's a perceptual possibility, but there's no way of instantiating that in actuality. And so here's the problem with postmodernism, and I think Jean Piaget had this figured out a very long time ago, is that out of that infinite number of possible perceptual, out of that infinite array of perceptual possibilities, you have to extract out that tiny set of solutions that not only fulfills your. Your aim in the. In the actual world, but fulfills it in the actual world and the social world at the same time in a way that doesn't interfere with you doing it again in the future, and in a way that if, if you do it really well, that also facilitates what other people are doing at the same time. And, man, that's a serious. That's A serious number of constraints, right? And it's sort of akin to the child who's playing a sport as a good sport, who gets invited to play again. And so you have to organize your behavior as a consequence of your perception so that it actually not only lays itself out in the world in the manner that you intend and desire, but so that it does it in a manner that everyone else is happy with and that propagates itself properly across time as you play iterated games. And there's a very small number of solutions to that problem, and we even know some of them. So we talked a little yesterday about dominance hierarchies, which was a term that I objected to, but let's call them hierarchies of competence for the sake of further discussion. I mean, I mentioned that hierarchies of that sort are at least a third of a billion years old. And virtually every animal is, even if they're not social animals, even asocial songbirds have hierarchies in the distributed social community. And the reason for that is that there just aren't that many solutions to the problem of how to get along in the world when other creatures are trying to do the same thing. And so the postmodernists are correct in that they make an allusion to the complexity of the world. They're correct in saying, well, there's a very large number of ways to interpret shape, and how do you know which one is right? And so it's like a stupid question in some sense, because like it, like it, Interpretations of Shakespeare that get you killed aren't practical. There's a simple way of talking about it. So they don't take into account the constraint systems that are part and parcel of being. And they gerrymander that away with this intellectual sleight of hand, which is something like, well, the objective world doesn't really exist anyways, and society is infinitely malleable. And, you know, it's like, no, sorry, that's just not right. And so I don't think there's much hope for it on that end because it's just. That's wrong and we know it's wrong."}
{"episode_id":"SW - #028 - 2019-02-08 - Jordan Peterson and Jonathan Pageau Q&A at Seattle Conference - Oct. 2017","start":1275.82,"end":1541.48,"speaker":"Jonathan Pageau","text":"So, yeah, I just want to add something about postmodernism for myself. I have a lot of quite. I have more sympathy for postmodernism than maybe I show at first glance. Reading some of the postmodern authors are what helped to shake my. To shake the certainty of modern absolutes, let's say. And you know, what's interesting to know is that a lot of the Postmoderns, a lot of those that created the. The idea of polysemy, which is this notion that there's multiple interpretations of texts and that texts say multiple things. You know who they were actually reading? Medievalists, they were reading authors that were interpreting traditional Christian texts or traditional rabbinical texts. Because in a traditional world in the Middle Ages, let's say, no one had a problem with the fact that text had multiple meanings. It was just a given. Everybody knew that the text had multiple meanings. Everybody knew that the Bible had multiple meanings, that the myths had multiple meanings, that, you know, the different traditions and multiple meanings. It was not a problem. The problem is when there's no hierarchy. And so the medieval Christians, they would say that texts have multiple meanings, but then they would immediately structure those multiple meanings into a hierarchy. Metaphysical meaning, spiritual meaning, social meaning, personal meaning. And then those would be lined up. So then you see a structure in a text. You can apply it at different levels of reality. So what the postmoderns did is they just took the polysemy and they got rid of the hierarchy. And then they started to show that there are patterns in the text which are not there at first glance. If you look into it, these other patterns emerge, and it's often these counter patterns. Because if you say something, you're always secretly saying the opposite. You have to. There's no way around that, because to declare something is to secretly declare its opposite as a buffer, if you want. And that's what the postmoderners do, is they go into the text and they find that line of opposite, the string of things that show the counter text, and they bring it up and they flip the world upside down and they say, well, why don't we put the countertext on top? Let's say, and say. They can make texts say the opposite of what we always have thought that they would say. And it's possible to do that. And it's actually. Sometimes it's actually perfectly coherent. But what they're missing is exactly what Jordan is saying, is that the countertext is a marginal thing. And it's a marginal thing for a reason. For all the reasons that I. That I talked about, let's say today, or that I've talked in my other talks about. The margin has a function, and it has to be on the edges of our perception. If you put it in the middle, the world falls apart. So there's something valuable. Actually, I read Jacques Derrida. I read Jacques Derrida quite a bit when I was in college, and I realized that if you read Jacques Derrida, you can actually just tap him back and he flips back on his feet. You can do the same thing that he does to the text. You can do to him. You can use his arguments and you can just twist them so that a traditional world comes back into being. That's really the post. Post modernism. You can do that. And what's happening is. What's happening right now is exactly that what we talked about yesterday, this whole idea of these gestures, these gestures that are acting as a kind of double turn where the clowns are bringing the world back on their feet. We're seeing it happen before our very eyes. So I would say, everybody pay attention. It's going to be a very interesting time for the next few years because you're going to see a lot of things come back, even in a traditional way. You're going to see it happen. And it's going to be these wild people, like Jordan. We're going to. Sorry, you're not that. Well, it's going to be these outliers who are going to act as a. Yeah, it's the wheel of fate turns upside down and then it comes back and it's. You know, it's going to happen."}
{"episode_id":"SW - #028 - 2019-02-08 - Jordan Peterson and Jonathan Pageau Q&A at Seattle Conference - Oct. 2017","start":1541.56,"end":1552.83,"speaker":"Jordan Peterson","text":"You really see that with Milo Yiannopoulos. I mean, you know, like, what the hell is up with him? You know? I mean, he's an impossible person, fundamentally."}
{"episode_id":"SW - #028 - 2019-02-08 - Jordan Peterson and Jonathan Pageau Q&A at Seattle Conference - Oct. 2017","start":1553.15,"end":1593.22,"speaker":"Jonathan Pageau","text":"Well, there's an article with. He did an interview for this super liberal Catholic. I don't even know. I don't know a lot about the Catholic politics, okay. But he did an interview with this extremely liberal Catholic magazine. And they thought they were gonna get what they wanted from him. Right? They thought they were gonna get exactly what they wanted from him. So they did this long interview, and then they didn't publish it. Cause the whole interview. He criticizes homosexuality during the whole interview. And so they just didn't publish it because he was like, wait, how does that work? How does that fox. Doesn't make any sense anyways, so. Yeah, who thought I was. I joke. This is really a joke. But my constant joke is that I never thought the end of the world would be so funny."}
{"episode_id":"SW - #028 - 2019-02-08 - Jordan Peterson and Jonathan Pageau Q&A at Seattle Conference - Oct. 2017","start":1600.42,"end":1603.38,"speaker":"Patrick","text":"I hope you've noticed nobody wants a postmodern surgeon."}
{"episode_id":"SW - #028 - 2019-02-08 - Jordan Peterson and Jonathan Pageau Q&A at Seattle Conference - Oct. 2017","start":1609.4,"end":1619.56,"speaker":"Moderator","text":"In the Varieties of Religious Experience, William James spoke of the religious temperament. Do you see any correlation between innate temperament and personality and religious experience?"}
{"episode_id":"SW - #028 - 2019-02-08 - Jordan Peterson and Jonathan Pageau Q&A at Seattle Conference - Oct. 2017","start":1619.72,"end":1866.57,"speaker":"Jordan Peterson","text":"Oh, yeah, we've done some studies on that. So if you imagine that a religious system has two elements, let's call it the dogmatic element and the mystical element, the mystics are the liberals, and the ones who are more concerned with the dogmatic element are the conservatives. And I'm not saying that one of those is preferable to the other, by the way, because one is about structure and its maintenance, and the other is about change and dynamism. And you need both of those things. They feed into one another mutually. And if you let the mystics get the upper hand, then everything dissolves into a chaotic confusion. And if you let the dogmatists get the upper hand, then everything stagnates and turns into a tyranny. So, you know, you need to have the dynamic going. And it's the same in the political realm, essentially. And I think what the basic personality difference is that the liberal types. So the people who are liberal or lean to the left are high in trait openness, which is the proclivity for divergent thinking and lateral thinking and creativity, essentially, and low in trait conscientiousness. And the conservative types are low in openness and high in conscientiousness. And so. Well, so what that. There's a bunch of practical implications of that. One is that it's the liberal types who start businesses, but it's the conservative types who run them. And so that's, you know, it doesn't take much thinking to figure out that that's a pretty good deal. You know, the entrepreneurial types are definitely creative types, and they tend to flit from project to project like they're interested in what's novel and what's radical and what's transformative, but they're not interested in. In tracking things and ordering them and putting them forward in this sequence and doing their duty. That's for more conservative types of people. And the liberals, when you look at what they regard as. Lots of liberal types, say, well, I'm not religious, but I'm spiritual. And really what they mean is that, well, I have a hard time with adhering to tradition, and I'm not necessarily very disciplined, but I certainly have the capacity to experience awe, let's say, or aesthetic experience. And those things, you really need to know that those things are deeply grounded in temperament. It's important to know that because you tend to think that the differences between, say, liberals and conservatives are matters of opinion, but they're not. They're deeper than that by a lot. They're really differences in the manner in which the world presents itself to them because the very template that governs their perceptions is not the same. And it's deep. These are very, very deep differences. They're neurological differences, they're characterological differences. And there's also those different personalities have their niches as well, so they're necessary. And part of the way that. Well, here's another way of looking at it, is that liberals don't like borders and conservatives do. And it's not just borders between states or countries. It's borders, period. The liberals think, geez, we shouldn't have borders between things because that delimits them, which does. And the conservatives say, no, no, no, we need to have borders between things because that keeps them properly separate and distinct. It's like, well, the problem is that both of those are right, and it depends on the situation to some degree. And I'm not arguing for moral relativity at all. I'm saying that in order to determine which of those principles applies in the particular situation that obtains in the moment, you have to have a dialogue between the different temperamental types to come up with a consensus that hopefully does something like, approximate current reality. And that's really what a democratic system does. Right. That's why I'm such an advocate for free speech. It's like we have different viewpoints and different religious viewpoints, for that matter. And the way that we stay oriented as a consequence of those genuine differences is by communicating with one another constantly. Because the alternative is you swing too far in one direction or the other, or you start to go at each other's throats and like, unless that's what you want, that's not a very good idea. So."}
{"episode_id":"SW - #028 - 2019-02-08 - Jordan Peterson and Jonathan Pageau Q&A at Seattle Conference - Oct. 2017","start":1869.61,"end":1889.27,"speaker":"Moderator","text":"Speaking of the importance of communicating with each other, one of the ways that obviously one does that is through art. And Mr. Pigeot, that is your specialty. So this next question is for you as well as Dr. Peterson or others. Is contemporary art, including commercial art, such as Disney, Nintendo or DC Comics, a route out of nihilism for today's Lost Boys?"}
{"episode_id":"SW - #028 - 2019-02-08 - Jordan Peterson and Jonathan Pageau Q&A at Seattle Conference - Oct. 2017","start":1894.07,"end":2073.57,"speaker":"Jonathan Pageau","text":"Well, that's one of the bets that I started making, especially with these YouTube videos that I've been doing, is that there's an interesting thing that's happened, like, let's say, since the 90s, maybe more explicitly. It started happening before that, but there's been a deliberate attempt to include within popular culture religious and mythological motifs. And it's really deliberate. It comes through Joseph Campbell a lot, but then, you know, other. Other ideas. And it's really. It's a practical thing. Like, it's. For them, it's a practical thing. They realize, oh, there are these stories, these patterns that underlie our experience. We put them in the stories. People will come see Them, we make a lot of money, everybody's happy, Right? So it's not like they're wanting to create illumined beings, let's say. But there is this growing tendency to put those in there. And sometimes it appears in dark and twisted ways. I'm not trying to defend what's there, but what it's done, and I'm seeing that it's happening, is that it's opened up a space that maybe wasn't there a little while ago. It's opened up a space of perception that wasn't there. And I think it is possible to enter into that space, show people, I hope, show people those patterns, and then say, okay, does that get you excited? And a lot of people are like, yeah, that's exciting. And then you say, well, that's nothing compared to what's like, in the Bible. Like, it's like it's dust on a. I mean, the patterns are there and they're real and they're powerful. But, like, if you really want to see how beautiful the world is, if you really want to see how amazing structures can exist in human society, it's like, look here instead. And so I think so. And we're seeing it. It's really weird. Like this Gamergate thing. It's really weird to see what's happening. It's as if these men. It was as if gaming was the last hiding place for men. You know, there's nothing left in society except for when they're. Because they're not allowed to express their aggressive behavior. Not allowed to be aggressive in any way. Not allowed. There are no warriors. We don't celebrate warriors. We don't celebrate honor and courage and all those things, but only in video games we still do. And so it's like this last refuge. And then all of a sudden with this weird Gamergate thing, there's this whole group of gamers that all of a sudden became social commentators and are on YouTube. They're not even talking about gaming anymore. They're basically engaging the world and talking about politics. And a little group of those and a part of those, they discovered Jordan. And now they're saying, oh, there's also this spiritual aspect to this. It's not just politics. It's like they're moving and moving. And so, yeah, it's weird. I wouldn't have predicted it, but I can see it happening, that's for sure."}
{"episode_id":"SW - #028 - 2019-02-08 - Jordan Peterson and Jonathan Pageau Q&A at Seattle Conference - Oct. 2017","start":2073.81,"end":2081.09,"speaker":"Jordan Peterson","text":"Yeah. Oh, that's a good. That's a good answer. We'll leave it at that."}
{"episode_id":"SW - #028 - 2019-02-08 - Jordan Peterson and Jonathan Pageau Q&A at Seattle Conference - Oct. 2017","start":2081.25,"end":2092.04,"speaker":"Moderator","text":"So the next question is for Dr. Patrick with a follow up for Dr. Bissonnet Petrie. How would a scientist talk about Grace erupting into a person's life? That's for Dr. Patrick."}
{"episode_id":"SW - #028 - 2019-02-08 - Jordan Peterson and Jonathan Pageau Q&A at Seattle Conference - Oct. 2017","start":2092.91,"end":2397.07,"speaker":"Patrick","text":"Thank you. The same as anyone else, except that the arenas where it pops up are going to be different and there's plenty of examples within the scientific history. We don't know it. You see, I mentioned this morning very briefly that both Einstein and Kepler and the guy in this city who picked up the double reading frame, they all insisted they didn't work that out. They saw it. The gift is there. In my own way, I can point to that sort of thing as well. Science is not this cold, predictive thing that it's presented to be. There's a huge amount of intuition involved in it. At any given time there are hundreds of thousands of experiments you could do. The art form of science is to do the right experiment at the right time. I say to Christians, we've got to start on that one. Pray about what you do next. That's worth praying about. And it also changes the way that you look at things. Grace appears on my CV. There's one paper that, I mean, I'm 20 years out from publishing. I get emails every week about work I did 20 years ago. It's very, very rare in science and one of them ought to have my mother's name on. Saved a lot of lives over the years and I don't understand it to this day. I went to Jamaica to try and understand malnourished children and I'd been fortunate to invent a new technique so that I could get at cells and look at the behavior of one of the major transport systems, the sodium pump. Because the problem with a malnourished child is not that it's sick, but that it is alive. It ought to be dead. All our standards, that child ought to died months ago, but it's not. It's alive. So the major question to begin with was how's that done? And when you looked at the amount, they're about 30% more efficient than any other child of that age. But they purchased that efficiency at a price. And they're only really, if you think of yourself as a bloated cell, there are really only two systems that could give that amount of energy savings. One is protein synthesis and the other is membrane transport. And I happen to be fortunate to be the only one to get at membrane transport at that point. Very much a surrogate, but nevertheless a real one. So I had a very simple hypothesis that it would be turned down and after About a year or so, I managed to get enough studies done that it was worth looking at the data. Sure enough, I was right. But when I looked at the data and I still plotted data by hand. People lose a lot by sticking the data in a computer and having a printout. Things happen in your head when you do it by hand. So when you're doing something new, it's good to do it by hand. And there were about five outliers. Now, they were well over five standard deviations from the others. And the standard scientific procedure is just to dump them. Something went wrong, don't know what it is, it doesn't matter anyway. But my mother imprinted on my backside when I was quite small, quite a hard addiction to truth telling. And I didn't know any reason why I should have got a different result. So at least I had to look at them. Now, by this time, we got to the stage where we were saving almost every child that we got through the first 12 hours. But there were a little group of about 5% that died later when we tried to feed them, and we had no idea why. They died very quickly and we had no clue. And lo and behold, when I went and got out the notes of these outliers, they were the children who died later. And to cut a long story short, that led to an intuition about how you might treat that, and it worked. I would never, most people would never have looked at that data. I only looked at it because of all that history behind me. And that's the way it works. Things go on for years and years and years. And then somebody realizes. I mean, we first had microscopic looks at bacteria in the late, what, 1600s, early 1700s, and yet we didn't get to microbes in medicine until 1860. Why did we spend 150 years not doing anything about it? Because we were locked in a mindset that medicine was about letting blood out and making you puke or squit, you know, that was it. And doctors made money, so why would they change it? That's the way it is. The world doesn't work in this cold, predictive way. There's all sorts of things going on that you need to be willing to be humble about. You learn that particularly in Africa. I mustn't start that."}
{"episode_id":"SW - #028 - 2019-02-08 - Jordan Peterson and Jonathan Pageau Q&A at Seattle Conference - Oct. 2017","start":2399.39,"end":2408.75,"speaker":"Moderator","text":"So, Dr. Bisson Petrie, the follow up to that question about grace for you is. Is grace something like the right brain being granted re entry after a prolonged exile?"}
{"episode_id":"SW - #028 - 2019-02-08 - Jordan Peterson and Jonathan Pageau Q&A at Seattle Conference - Oct. 2017","start":2412.28,"end":2598.59,"speaker":"Dr. Bissonnet Petrie","text":"Oh, yeah, probably. That's one way to look at it. Grace is the way in which heaven and Earth come together. And that's through the divine Spirit of God. And the divine Spirit of God dwells within the human person. And it's like ripples that we have no idea how the presence of the divine within our being is affecting other people. I mean, we do know that. We do know that the presence of the divine is transforming us into virtues. We can look at that and we can see that. We can reflect on that. We can look at other people and we can see that they're moving towards virtues. And then we have to say that, well, where did these virtues come from? Well, the person was working very hard on themselves, and they were. But there's another level of it. And that is that we have an infinite effect upon. Upon other people. And the presence of the divine has an enormous effect for the good. The opposite is true also. And I don't think we have really any idea just how much of an effect that presence of the divine has within us. I know that it was explained to me by one priest that said that, you know, we know that from the Catholic faith. We are a combination of body and spirit. And they're just so united. They only split at the time of death. And then we. We believe, of course, that the spirit then lives on, but they're not split. So we have an enormous effect on each other's spirit. And that's what we can't really measure. But we do have an enormous effect upon each other's spirit that we don't even really perceive. But when you're in the presence of someone who is really, really good, really holy, who has the presence of. Of the divine Spirit within them and really manifesting itself interiorly, you don't know that, but you feel peaceful, you feel good in their presence. You feel safe, you just feel good. And we perceive that. And the opposite is true too. When we're in the presence of somebody who is really very angry and hostile, we feel that too. So we know that we're having an effect upon each other. And we don't really even know how to describe it. I mean, some of the modern psychiatrists are talking about this reverberative energy that's going back and forth between people because they know there's something that's going on. We don't really know how to put it into words. But I would say that when the human person is really infused with the presence of the Holy Spirit of God, then there is it. That's grace. And then that grace pours forth through that person to other people."}
{"episode_id":"SW - #028 - 2019-02-08 - Jordan Peterson and Jonathan Pageau Q&A at Seattle Conference - Oct. 2017","start":2600.99,"end":3036.23,"speaker":"Jordan Peterson","text":"So I'm going to try to make an answer to that that's very concrete, but nonetheless serves the purpose. So, as we've discussed just a bit ago, there's a very large number of ways of looking at any set of phenomena. And so then the question is, well, what determines what you see? And the answer is what you aim at. And this isn't a metaphor. This is exactly how perception works. So, for example, if I look at that door now, my eyes are moving back and forth very rapidly, otherwise I wouldn't be able to see at all. And most of what I see is very low resolution. So, for example, if I'm looking at the door, I can only see you people over there as vague shapes unless you move. And then I can see a little bit more clearly. And you people right in the way of me. I can more or less see your faces, including your noses. But you people over here, I can't get your facial features at all. And so my aim determines the manner in which the world manifests itself to me. And there's almost nothing that you can understand that's more important than that. And so, and so now, then you got to think about that, because then you got to think about, well, what are you aiming at exactly? Now, imagine you're a scientist and you're looking at a set of data. And the data can be handled in very many ways. And like statistics, isn't this process whereby you feed in a bunch of numbers and you get out an answer like, that's not how statistics works. It's more like a set of surgical tools where you're cutting apart something insanely complex. And if you're very fortunate, you might find something. And so statistical analysis is actually dependent on a very large number of ethical decisions, like maybe a thousand ethical decisions or 10,000 ethical decisions. And how you make those decisions determines in no small part what answer is going to reveal itself. So, for example, let's say you're really career oriented and you have an experiment that you know you really want to publish because it'll move your career ahead. And the data is a bit sketchy, and you have to make some decisions about outliers. That might be a good example about which statistical technique you're going to use or which part of the story about the experiment you're going to tell, because you're not going to tell the whole story because you can't write a thousand pages, you have to condense it, eh? And so it's kind of a post hoc story, and you try to make that represent the truth. But then the question is what's the truth? Now if you're the sort of scientist say that has decided that the truth is going to rule above all, including your career stims, then you're going to come up with whole different experiments and interpretations than someone who's like 30% admixture of insane careerist and 20% narcissist and maybe 10% truth seeker. Everything is like that. So then imagine that you live inside a hierarchy of values that determine your aim. A and you do, that's how it works. Because if you stop a kid at university and you say well why are you in this class? Well they'll say well I need, they might say I'm interested in it. But they might say well I need this class to why are you studying? Well, I need to get a good grade. And why do you need a good grade? Well, because if I don't get a good grade then I won't get my degree. And why do you want your degree? Well, I want my degree because I need to have a job. And then you ask them why do you have a job? And you know, then they have some rationale about the job and you ask them why they believe in that rationale. And like about four questions in they're annoyed at you because they're out of answers. But the thing is that every single thing you do is nested within a hierarchy of morality. And at the very extremes of that hierarchy, so the highest ends, there's this decision between good and evil essentially that that's part and parcel of every decision you make. Because the fundamental question to some degree is something like are you aiming at making the world a better place or are you aiming at making the world a worse place? Every decision you take is a choice between good and evil in that sense. And so part of the way that you might say that God's grace operates, if you want to be mechanistic about it, is that if you're oriented towards the highest good, then the things that come to you as you're perceptions orient themselves around your aim are going to serve that purpose. And that's actually like there's not a single element of that that's metaphorical. That's actually how your perceptions work. And then your motivations and your emotions line up around that and so do your actions. And so it is the case that the, the manner in which the world presents itself to you depends on your ethical aim. That's how it works. And so if you're really trying to make the world a Better place, let's say. And the more deeply that's the case, then the more likely it is that the manner in which you might traverse that pathway is going to reveal itself out of the infinite number of possibilities that are arrayed in front of you. So it's very, very like we actually really understand how this works. And it's not metaphorical. It's not even some sense, it's not even spiritual. It's just actually real. And maybe that's the best of all possible worlds when that's the case. So, you know, here's an example, and then I'll be quiet about this question. Let's say you're having a dispute with your wife. It's like, what do you want out of that dispute? You want to win? Well, then she loses. Well, then you have a loser on your hands. And maybe you want. Maybe you want to be married to a loser. Maybe that's part of what you're aiming at, you know, because then you get to be the good person in the relationship and she gets to be the bad person. And, well, then you can have all the joys of martyrdom. That's pretty entertaining. And you've got moral virtue at your fingertips because if you defeat her a hundred times in a row, then she's going to be bitter and hate you, and then you can really play the martyr and be the superior person. And you know, all of that's going on when you have the discussion. And maybe what you want instead is peace. You actually want peace and tranquility. And so you think, well, I'm going to listen because maybe I'm even going to help her make her argument against me just on the off chance that she might be right. Because actually, what I want is peace. And that determines the course of the dispute. And it determines whether it's a battle for victory or a battle for the solution of the problem, so that you can both move ahead in union, which is what you're supposed to do. And that's another example of how your ethical aim determines the manner in which the world reveals itself and unfolds itself. And none of this is metaphor, and none of this is. None of this is. It's absolutely concrete reality. It's how it works. It's how we perceive. And, well, so there, you know, the grace of God is manifest when you aim at the highest possible good. It's like aiming at the cross on the church that, that Jonathan talked about today. You have to be oriented all the time to creating the sort of world that you would want to bring into being. You have to decide what sort of world that would be. And then everything falls into alignment behind that, either for good or for evil. And."}
{"episode_id":"SW - #028 - 2019-02-08 - Jordan Peterson and Jonathan Pageau Q&A at Seattle Conference - Oct. 2017","start":3039.67,"end":3431.5,"speaker":"Patrick","text":"Can I make a follow up comment? I should have done this before Grace in a slightly different way. Some years ago, I had a call from a professor in Minnesota and he said, I want you to write down your faith story. To which I replied, no, I don't do that. And he said, why? I said, I'm not interested in a sentimental project. And then he made me explain. He said, look, you, how soon do you teach? And I said, never before fourth year. Why would I? He said, you ought to. I didn't. But the point of the matter is, for you who send your children, your grandchildren to university, especially in a research university, they're not going to meet a tenured professor in the first two or three years. In most cases, they'll be taught by people much lower down the order. And he said, that means they won't hear a positive comment about Christianity from their teacher from the lectern, because if you declare yourself to be a Christian in a western university, you lower your chances of getting tenure dramatically. So he said, I'm trying to find tenured professors who've done something people know about and getting them to write their face stories down. And in the end I did. And he published a book with 22 professors in. It's called Professors who Believe. I think it's still in print, published by ibp. I was worried about it, but when I got it, I couldn't put it down because it really was Grace. I think my favorite one. I've forgotten his name at the moment. He was a biophysicist at Princeton, a geophysicist at Princeton, and he was a complete naturalist. He worked hard at his work and he was a scientist first, second, third and fourth. And he used to go in on Sunday morning because it was the only time when there weren't graduate students around to wreck his work. But then he got the Augustine syndrome. You all know the end of the first paragraph of the Confessions. Our hearts are restless until they find their rest. Indeed, he had the restless heart. He couldn't settle down. So he started going to Princeton Chapel, where there are a few vestiges of liturgy remaining, but enough for a smart man to realize that there's something here that I don't know about, and perhaps I should. And after a few weeks, a woman was preaching one Sunday morning and she said, you guys out there in the congregation, you only respect the opinion of other People with respect to your work, probably only 10 people in the world you care about. But when it comes to Christianity, your knowledge is roughly at kindergarten level. And he was smart enough to say, my goodness, she's right. I've never even read the Bible. And he says, so I started to read it. And he doesn't tell you anymore because he doesn't know what happened to him in a way that he can describe. And yet his life was picked up and turned around and faced in the opposite direction. Grace like that happens and I love it. It's the one thing that really gets to me in this world as I travel. I have a very good friend. I had a very good friend, he died two, three years back who said to me I had meningitis so that you. I had meningitis so that he could become a Christian. Amazing. At the beginning of my PhD, I don't know, nine months a year into it, I didn't have a single result. Nothing was working. I knew what I wanted to do, but it wasn't working. And then I got meningitis. I'd done infectious diseases for the two previous years, never got sick. There I was with a fairly serious disease which took me off work for three months. David moved in next door to us in our little apartment in London. And he, like me, came from a blue collar background. And his dad had told him, David, get out to earn some brass. Age 15. But his teacher said, David, you're smart. Go to night school. He got an external degree in mathematics in no time flat, less than three years from London University. He was working for roles as apprentice electrician, but they're a good company. They realized this wasn't an apprentice electrician so they promoted him. Shortly he was running the heat flux analysis division for Rolls Royce in their nuclear engines division with just an undergraduate degree. And of course Americans would come and visit and they'd say, this is wonderful work, Dr. Dawson. And he would say, Mr. Dawson. Rawls were embarrassed. They said, Please get a PhD. We'll play for it. And he said, what the hell do I want a PhD for? I have to teach those guys what to do. And he wouldn't do it. Eventually I persuaded him to do a one year master's course at Greenwich Naval College in nuclear engineering. So he agreed to do that to have a year in London and he moved in next door to us. What I didn't know was that this man for whom everything that he touched was turning to gold, was so sad inside. There was no meaning in his life. He could do Anything. He built his own house. He never bought a new car. He got a couple of scrap ones and built a new one out of that. The course was boring him. So he came home early and we started playing chess in the garden. And, you know, you get headaches after meningitis of one afternoon. I had to leave the chess. I said, david, I've got to go in and lie down. He said, fine. The next day, when he came back from Greenwich Naval College, he said, have you got any more books like that? I said, oh, that's where it went. And I don't know anybody else in the world who was converted in two days by reading a commentary on the Book of Habakkuk. But he did, because it spoke to his soul. And he came back and said, have you got any more? I gave him Lewis's Mere Christianity. And on Sunday he said, can I come to church with you? And his life, his perception of the world, was totally transformed. He went back to Derby to his village. He said, I've been there a dozen years. Never noticed that the kids didn't have a youth group. So he started one, and he started looking at his research group. And he said, I realized they got problems I could help with, and I'd never done anything about it. So he started doing it. Before long, he was personnel director for the whole of Rolls Royce. That's grace. That's how it works. So if you're sending a grandchild or a son or daughter to university, think about getting that book and putting it on the shelf, because there's some 22 professors in there covering a pretty good range, including one you might know, Tinder from Boston College. Wonderful stuff. Grace is real. We need to bear witness."}
{"episode_id":"SW - #028 - 2019-02-08 - Jordan Peterson and Jonathan Pageau Q&A at Seattle Conference - Oct. 2017","start":3437.1,"end":3475.53,"speaker":"Moderator","text":"So for Jonathan, just a moment ago, in his answer, Dr. Peterson used the analogy of a pathway. And that was an analogy that you also used this morning, and you opened your lecture with it. So the question for you is about the other analogy that you used, and that was of a pillar or of a point of reference to orient yourself from and to find a sense of direction. You also mentioned how this pillar is made through people binding together and having a sense of community. How could one apply this idea to the lifestyles of great thinkers and artists like Rilke and Nietzsche, who spent most of their time in solitude and who even argue that being in solitude is a key factor in making great art?"}
{"episode_id":"SW - #028 - 2019-02-08 - Jordan Peterson and Jonathan Pageau Q&A at Seattle Conference - Oct. 2017","start":3477.6,"end":3638.7,"speaker":"Jonathan Pageau","text":"Well, the thing about that image of the pillar is that it's the shape of everything. That's kind of how you have to see it. It's the shape of the cosmos, it's the shape of a community, it's the shape of a family, it's the shape of a person. And so a person has a center, has a heart. And now I'm going to use, I'm going to really use orthodox mystical language here. So a person has a heart. And the idea in traditional mysticism is to gather your thoughts and to gather yourself and enter into your heart. And when you enter into your heart, your heart is like the cup on the altar. It's the same thing that's there. Your heart is the same thing as the cup on the altar. And once you gather yourself within yourself into your heart, then you become a locust of divinity, as much as it's possible for a human being to be united to the divine. So that's why Christianity also has a monastic tradition. Because the same reality that let's say a normal Catholic or a normal Orthodox or normal Christian community would encounter, the anchorite will go through that very. In his cave on his own. It is a possibility. But the idea is that even if someone is alone in and is doing that as, I mean, I don't know, I'm not, by the way. This is not experience. This is all theory. I've done this. But if you read the Fathers and if you read the Philokalia and if you read the mystical teachings, what they tell you is that once you enter into the heart, you find the whole universe is there and the whole church is there as well. And so even though that monk is alone in their cave and is spending their whole day in meditation and prayer, once they enter into that divine spark that is in the center of themselves, they find that they're in communion with the entire universe and they're in communion with the entire church at the same time. And so even for the, let's say, the monastic approach of solitude, the trip is the same as the community who moves in towards communion. So yeah, I don't know about Rilke and Nietzsche, but that's at least, least the monastic tradition."}
{"episode_id":"SW - #028 - 2019-02-08 - Jordan Peterson and Jonathan Pageau Q&A at Seattle Conference - Oct. 2017","start":3639.82,"end":3648.94,"speaker":"Jordan Peterson","text":"I wanted to make a comment on the pathway. Kind of tired today, so I might get this quote wrong, but Christ said that he was the way and the path and the way."}
{"episode_id":"SW - #028 - 2019-02-08 - Jordan Peterson and Jonathan Pageau Q&A at Seattle Conference - Oct. 2017","start":3648.94,"end":3649.58,"speaker":"Dr. Bissonnet Petrie","text":"Truth and life."}
{"episode_id":"SW - #028 - 2019-02-08 - Jordan Peterson and Jonathan Pageau Q&A at Seattle Conference - Oct. 2017","start":3650.22,"end":4053.07,"speaker":"Jordan Peterson","text":"Yes. Okay. The way is the part that I'm particularly. And no one comes to the Father except through me. Right. Is that okay? Yes, yes. Good. So, and I use this idea of the path, you know, and people are path taking creatures that, that's what we're like, we're directional creatures. And so the question Is like, if you're walking out of the door, well, why are you walking out of the door? And I'm re emphasizing this idea of this nested sequence of hierarchical values, like, are you going, what's your purpose in going out through the door? What are you going to do out there? And that purpose can imbue. Like if the purpose is the highest of purposes, then that purpose imbues everything you do with divine significance. And that's actually correct. I mean, I try not to be metaphysical about things if I can possibly avoid it, because it adds a level of complexity that isn't strictly necessary. Well, I know, I know, but I'm not denying that at all. But it helps to make things simple as well, you know. And it is the case that you have a reason for walking out the door. The question is, what's the reason? And you know, you might say, well, it's a jumble of reasons, some positive or negative. Well, that's true because you're not this united thing that Jonathan was talking about, right? I mean, Carl Jung certainly believed that the united human psyche was roughly equivalent to the self and that Christ was. He called the image of Christ an image of the self, the united self. And so the idea that the integrated human being is in some sense in relationship with the ideal human being is a profound psychological idea. But like, when you're walking out the door, the question is, what path are you on? And that is actually the question. It's like you have mixed motives. Let's say, you know, some of you is dark and some of you is light. It's like, well, get rid of the darkness. And then when you walk out the door, you're on the path of light. And then the question is, well, what will happen to you if you're on the path of light? And the answer to that is quite straightforward. That is the best that can happen to you. Whatever that is. It might not be easy. It isn't going to be easy. Easy and best aren't the same thing somehow. I mean, you don't want your child's life to be so easy that they just lay on the couch and have a machine drop grapes into their mouth every 30 seconds, right? That isn't what you want. You want something like optimal challenger, heroic struggle or worthwhile engagement or something like that. It's not just the absence of effort and like a kind of neutral being. It's a call to adventure and to great things. And so you can have it so that everything that you do partakes in that to the degree that you're willing to work to make that possible. And then everything that you do is imbued with this sense of meaning because it's related to intelligibly, to the highest of goals, you know, And I always use the. Often in this sort of discussion, use the example of Geppetto in the Pinocchio movie, you know, when he makes Pinocchio, who's just a puppet whose strings are manipulated by forces beyond his control, like, that's a person, that's a human being. You know, that's what we're like. And Geppetto, who's a good father, praise. He lifts his eyes up above the horizon to the highest point that he can conceive of, and that's the star that glimmers in the darkness, right? And if you watch the movie carefully, you also see that that's the star that signifies Pinocchio's birth. And, like, the meaning of that should be relatively obvious, you know? And, I mean, it's a nativity scene as clear as can possibly be portrayed. And Geppetto lifts his eyes up above the daily concerns and aims at the highest good at which that he can conceive, and then wishes for that for his puppet. Then that's what starts the transformative process that turns the puppet into a real human being. And really, that's what you're trying to do in your life and with the people that you love, it's like, okay, well, sit and meditate and think, okay, well, what's the highest possible good that I could aim at? It's like, well, I'd like my life to be in order. And then I'd like it to be in order so that everyone else's life is in order. Maybe even the people that I. That I consider enemies, maybe even their life could be in order if I lived my life properly. And then. And you don't know that that's not possible. Maybe you're terrified that it is possible. I think that's the most fundamental terror that that might be possible, you know, and then maybe you're ashamed because you're not living up to that. And I would certainly say that was the case. So. Well, so that the pathway idea is an extraordinarily profound idea. And it's also one of the things. That statement of Christ in the New Testament is one of those things that really strikes you because you think, well, what sort of creature would say something like that? It's such a. You're either completely out of your mind to say something like, you can't even explain it that way. And people try, you know, they talk about messianic delusion or that sort of thing, but it's a statement that has such an unbelievably deep meaning that you can hardly imagine that anyone could say it. And, and that's. Well, you know, you can take that as evidence for whatever you think it might be evidence for, but it is really an unbelievably deep truth. It's something. And one more thing about that, you see, you might say, well, what is that ideal path and how is that symbolized by the idea of the crucifixion? And see, what Christ did in part is to accept the, the terrible burden of being voluntarily. And that's a really hard thing to do because the burden of being is terrible. Tragedy and evil, those are terrible things. And you can decide that you're going to be responsible for that. Right? That's the highest of all possible moral goods, is take on responsibility for suffering and evil. And I don't see how that's deniable. Well, I mean, I can't see how you can think of something that would be better than that. Like it's almost by definition, nothing can be better than taking responsibility for that because what you're trying to do is ameliorate suffering and reduce evil. Well, how is that not sort of self evident? And then that can imbue everything you do, even this, even this simple job of taking a pathway. And you're always on a pathway. So decide where you're headed and then your life has the sort of meaning that justifies it in some sense. And that way you can have your cake and eat it too. And so, you know, that's. Well, that's a pretty good deal if you can pull it off."}
{"episode_id":"SW - #028 - 2019-02-08 - Jordan Peterson and Jonathan Pageau Q&A at Seattle Conference - Oct. 2017","start":4055.47,"end":4101.47,"speaker":"Moderator","text":"So Dr. Peterson, you just went into depth into the idea of the pathway, an analogy used by both you and Mr. Pagel. But the other analogy, the other image that has been used was that of the pillar in his lecture today. And that was an image that he just described as, among other things, the center of the family. And the family is something that you've also provided commentary on over the years. So the next question is from an audience member who says to Dr. Peterson, I have heard you speak on the pathological family and having the misfortune of being born into such a structure. My question is, how does the innocent child within me forgive my family without excusing their evil and at the same time avoid the seductive temptation of the power that comes with the innocent victim card that many Play."}
{"episode_id":"SW - #028 - 2019-02-08 - Jordan Peterson and Jonathan Pageau Q&A at Seattle Conference - Oct. 2017","start":4108.67,"end":4139.97,"speaker":"Jordan Peterson","text":"Well, I think more importantly, in some sense than forgiveness is a very complicated thing because you just don't distribute that randomly. Like, there are preconditions that are, as far as I can tell, that have to be in place before you can forgive someone. Like, if someone has done something terrible to you, you don't want to carry that as a burden any more than is necessary because it just propagates it in your own life. Right? So there's like a psychological necessity to forgive in that you need to move beyond that."}
{"episode_id":"SW - #028 - 2019-02-08 - Jordan Peterson and Jonathan Pageau Q&A at Seattle Conference - Oct. 2017","start":4139.97,"end":4140.33,"speaker":"Patrick","text":"Right."}
{"episode_id":"SW - #028 - 2019-02-08 - Jordan Peterson and Jonathan Pageau Q&A at Seattle Conference - Oct. 2017","start":4140.65,"end":4322.34,"speaker":"Jordan Peterson","text":"But for someone to be forgiven, they have to, I believe they have to have recognized what it is that they've done, and then they have to repent, which is to say that they know it's wrong and then that they have to change their actions so that they won't do it again, because otherwise there isn't much difference from forgiveness, between forgiveness and ignoring something terrible that's continuing. So. But you do have to lighten your own soul to some degree. I would say that your goal is to do what you can to sew together the tattered fabric of being that you've inherited so that you don't propagate that forward in your own. In your own family. And that is definitely something that people very frequently do. So here's a interesting statistic. So many people who abused their children were abused as children, okay? And so you might think, well, there's a causal pathway. If you're abused as a child, then you abuse your children. But that's actually not how the statistic works, because if you take the total population of people who were abused as children, most of them do not abuse their children. So, you know what I mean? You're looking at it from two different perspectives. If you take only the abusive population, then you can trace it back to childhood abuse. But if you take the entire population who were abused, most of them, dampen that down. And you can think about that mathematically very easily, because if it was any other way, you know, let's say a person has a couple, has four children, and abuses them all, and then all four of those children have four children and abuse them all. And then like in 10 generations, everybody's beat to death all the time. And that isn't what happens. What happens is that it tends to dampen across time, which is nothing short of a miracle. And I've seen lots of people in my clinical practice who had pretty miserable childhoods, you know, where they were punished for their virtues, which is really the way to make someone miserable. You don't punish someone for doing something wrong. That's amateur stuff. You punish them for doing something right if you really want to hurt them. And so. But they grew up and they had children and they didn't carry that forward. You know, they decided they learned from what had happened to them not to do it instead of learning to do it. And so now did I answer the question? That's a good question. I think what you do is you decide what you want. That's the other thing, is that you do a decent analysis of what's happened to you and the costs, and maybe you try to figure out what the antecedent elements are so that you can see it from your parents perspective to the degree that that's possible. And then you relate it to some way, in some way someone to talk to that's rather wise can help you with this. You relate it to the suffering and the evil in the world at large and try not to take it as personally as you might. And then you do what you can to move forward without carrying it in any more burdensome way than you absolutely have to, you know, and swear in some sense that you won't do the same thing. And that's about the best you can do with a situation like that."}
{"episode_id":"SW - #028 - 2019-02-08 - Jordan Peterson and Jonathan Pageau Q&A at Seattle Conference - Oct. 2017","start":4322.82,"end":4601.9,"speaker":"Patrick","text":"So I'd like to add one thing to that. We say the Lord's Prayer frequently, but we ought to take a little bit more notice of the verse that follows the Lord's Prayer in the Sermon on the Mount, which is, if you do not forgive, you will not be forgiven. The basic thought, I think, is that we are all fallen creatures, and to that degree we are all capable of any evil that we can imagine. It's only by the grace of God that that is not the case. And so what Christ is doing in the Sermon on the Mount, as I understand it, is he's asking you to develop a way of living day by day, thinking your way through a sequence which makes you not just a mere believer, but a disciple. And it's incredibly wise. He says, first of all, the first beatitude is you've got to practice seeing the truth about your own soul. Blessed are the poor in spirit, because if you get down on your knees and say to God, show me what I look like to you, I guarantee it will never be good news. First sight, we are all in trouble. But Jesus says, the moment you become that honest, you are on the way to the kingdom. He says, you've got it. You don't know it yet, but he knows it because he is the truth. So if you pursue truth, you get to him, but that isn't enough. He says, now you must repent. Blessed are those that mourn because they are the ones who are comforted. Lewis puts it in the Screwtape, not in mere Christianity like this. He says, God does not demand repentance of you. Repentance is simply a description of what happens when you come to God. Coming to God is repentance because he's holy. And that's when you receive comfort. What that does is it changes your approach to life at another level, which is blessed are the meek. The word that's translated meek, is used to describe a horse that's been broken in and trained to ride into battle. You are meek when you wake up in the morning and you realize you are forgiven for no reason except grace. And the person who gave that grace is going to ride you into battle today if you'll let him. Isn't that a wonderful metaphor? And it's so releasing, isn't it? The horse doesn't have to have any big plans for the day. Just obey. This can take anything nasty that's been done to you. You put it through this process and you come out the other end. You are now really caring about the person who did the harm. It's an astonishing thing because the next thing that happens, of course, because it's working, you start hungering and thirsting for righteousness, which Jordan Peterson is doing very well. I mean, he can hardly open his mouth without hungering and thirsting for righteousness. The promise is he's going to be satisfied. That's what Jesus says in this, that that makes you in turn the one that we probably need in our society as much as any, particularly in church. He said, now, blessed are the merciful, for they shall receive mercy. This is if you do not forgive, you will not be forgiven. If you can't be merciful to somebody else, it's because you haven't seen what you are really capable of. So if you're in trouble with not being able to forgive, you've got to go back to the beginning. That's the way it works. It's an iterative loop. And ask God to show you what's this, hanging on to this, doing to my soul, show me how I can release myself, be released from this, and that will happen. And then you move on to the next one, which is blessed are the pure in heart, for they shall see God, which, as Kierkegaard put it beautifully, is to will one thing, a life that is only concerned with thy will be done. It's very hard to injure you. I mean, people can't hurt you. It's amazing because the moment they try, that sequence kicks in and you start praying for them. I've seen it happen, because the university is a very nasty place. And that's my response. I'm praying silently, of course, but I watch people look and wonder what's happening to them. I know what's happening. And then you go on to the next one, which is you become a peacemaker. Because academic snips go on for years, and sometimes it gets so bad they want somebody to calm it down for a bit. So it has to be somebody who's transparent, that both sides trust, and then they persecute you afterwards. Nothing serious in our world, really, but that's how it works. So whoever asked that question, here's an experiment for you to do. Read the Sermon on the Mount every day for the next month and work your way through that sequence every day. I think you'll be a different person at the end of the month."}
{"episode_id":"SW - #028 - 2019-02-08 - Jordan Peterson and Jonathan Pageau Q&A at Seattle Conference - Oct. 2017","start":4605.26,"end":4899.1,"speaker":"Jordan Peterson","text":"I have one more comment about that. I guess I was thinking there was images running through my mind here during this discussion, and I remembered a trick that my wife and I learned when we were trying to figure out how to settle disputes. You know, and if you're not having a dispute with the person you're living with, you're not living with them because you're different people and you face very complex situations. And so there has to be disputes, because if there isn't, you're not communicating, because life is very hard and you're not the same. And so then the question is, well, what do you do about a dispute? And while you're tempted to win, as I said earlier, especially when you get angry, because anger wants to defeat, especially if it's not integrated properly. But one of the things we learned to do was to. If we were at loggerheads and we couldn't figure out how to. How to advance, we'd separate and go into different rooms. And then the rule was you had to go in there and like, I suppose it was a form of meditation. You had to sit there until you thought of something stupid. You did within the last six months or so that increased the probability that this idiotic fight would occur. And, you know, it's really annoying. I think it's a form of prayer because it's really annoying, because you're just not that bright and you make mistakes all the time. And so if you sit down and you think, okay, how am I Stupid. It's like, believe me, you're going to figure out a whole bunch of ways that you're stupid. And one of them will rise up above the rest, and it'll say, well, you know, here's something wrong with you that's making this more probable. And then you have to go tell the other person what that is, and they have to do the same thing. And then, you know, you're both humbled by that, I would say, you know, because you're not arrogant enough to think you deserve to win anymore. You think, yeah, well, I'm an idiot. And the other person says, well, hey, I'm also an idiot. And then you think, well, the hostility and the desire for victory goes out of it, and then you can talk again. And then. So with regards to being misused, you know, one of the ways also to get out of that, in some sense, I'm not saying, let's say not if it's ongoing, because that's a different story. But if it's in the past, I mean, it is really useful. Solzhenitsyn, when he was in the prison camps in Russia, he was having a pretty damn rough time, there's no doubt about that. And, I mean, he was there basically because of Stalin and Hitler, roughly speaking. And so he had every reason not to, you know, to feel that he was victimized. And in some sense he was. But what he learned in the prison camp was that he had participated in the process that had imprisoned him. He was a staunch communist at one point in his life, and he was an arrogant intellectual, and he learned often from watching people who had very deep religious convictions, as it turned out, which he didn't have, at least at that time, that that it was possible to act honorably, even under very difficult conditions, and that he hadn't done that in many places and times in his life. And so he said he went over his life with a fine toothed comb and tried to figure out everything that he had done wrong by his own admission, not according to some other person's moral standards, but when he could remember through his life when he decided to do something he knew to be wrong. And then he tried to do everything he could to fix that in the moment, whatever that was. He sort of asked himself in some sense, or maybe he asked his higher self, I don't care how you think about it precisely. But then he tried to do everything he could to rectify that in the present. And the consequence of that was the writing of the Gulag Archipelago, which basically took an axe to the trunk of the Soviet system. So it was a pretty big deal that he managed this. But the thing is that you can't really concentrate too much on the evil that other people do to you, because there isn't much that you can do about that. In some sense, you're not in control of them. But what you are in control of, if you want to be, is the evil that you do to others and to yourself. And then you might say, well, why don't you just concentrate on that? Because you could actually do something about that. And then what you find is that the more you concentrate on that, the stronger you get. And maybe if you get strong enough, then the things that happened to you that weren't so good, you understand them much better and you can forgive them more, and they run off your back like water off a duck's back, and away you go. And that. I mean, the alternative is misery and resentment and. And hostility and the desire for revenge and all of that. And that's just. That's a kind of hell. And that's not. Unless that's what you want. Well, you know, people want that. That's the thing, you know, and it's something we can't forget, is that people do want that because they're angry, and they're very angry. They're angry at being. And they're willing to walk down a destructive pathway, that. That's for sure. And if you can't see that about yourself, then you're not paying attention. So."}
{"episode_id":"SW - #028 - 2019-02-08 - Jordan Peterson and Jonathan Pageau Q&A at Seattle Conference - Oct. 2017","start":4902.78,"end":4937.13,"speaker":"Moderator","text":"So our last question dealt with the topic of the family. And in Dr. Peterson's final answer, he discussed an example of something that he had learned throughout his marriage. Marriage, of course, being the sacramental basis and foundation of the family. The next question is, nowadays many people are waiting longer to get married and have kids. Do you think this is positive for women as it allows them to develop more of a sense of self apart from children before committing themselves to motherhood? And this is for anybody. But as it is about womanhood, perhaps we'll begin with Dr. Bissonnet Petrie."}
{"episode_id":"SW - #028 - 2019-02-08 - Jordan Peterson and Jonathan Pageau Q&A at Seattle Conference - Oct. 2017","start":4938.41,"end":5418.26,"speaker":"Dr. Bissonnet Petrie","text":"Well, there's lots of ways to look at that. And my current bias is that it's not good for women, and it has to do with what is the individual woman's goal. And I believe that most women have a very deep, deep desire that comes not from any conscious part of themselves, but very, very deep to be a mother. And so it's really in the current culture, which I mentioned in my talk yesterday, that prior to contraception, there was a very big Pool of men and women. And there was one man to one woman. And you had many choices, and you were very likely to meet up with a suitable partner and have a very good marriage. What happened after contraception was that the pool of men and women, which had been one on one, one man, one woman, divided into what's called a pleasure pool and a marriage pool. So in the pleasure pool, you know, we all know what that is. You just are not interested in really getting married. You're not interested in having children. You're interested in pleasure. And how many women, how many men are in that pleasure pool? It turns out that there's one woman to six men in the marriage pool. Those who want to get married, there are six women to one man. Now, this has created a lot of difficulty for women because as they. Well, how do they meet and marry a suitable partner? It's more and more difficult. So what we see is that there are fewer and fewer marriages and there are more and more divorces because people are marrying people that are not suitable to them. Now, women have tried to cope with this by investing in their own capital. And by that we mean that they go to school, they become nurses, they become doctors, they become lawyers. They're trying to invest in their capital to make themselves more interesting and because they feel motivated to do that. And of course, our culture has encouraged that immensely, which is just fine. But then they end up finishing their education and they're 30, and it's very difficult to find a suitable partner, a man, at that point. And then their biological clock is ticking, and are they going to be able to have the best of both worlds? A career, children and a marriage and children. And I have talked with a lot of women in medical school. Now, when I went to medical school, there was one woman in my class besides myself. It was just. We were not. And my father had actually said to me, women should not be doctors. You should be a teacher to prepare yourself for marriage and children. And my mother was not really happy as a mother. And that's. That influences you. Well, why would I want to be a mother? My mother's not happy being a mother. So I took this other path of, you know, really. And I had been encouraged to do that because if you have a brain that does well on tests, then they encourage you, especially if you're good in science. They want women to move forward. This. Back in this, you know, in the 60s. So I, you know, I ended up going into my career because that was the, you know, that was the path that, that and Fortunately, I was able to marry and have children and do the whole thing. But I came to the point where I realized that there was a deep, deep longing inside of me to have children. And, you know, I was in. I was about 27 years old, and I was still in my training because training takes forever. So, you know, we went ahead and. And had children. And I tell you that I have never experienced the wonder of life until I had a baby. I mean, it was like, this is what I was created for. And I fell in love with that baby like I had never loved any other creature in the whole world. And I thought, why didn't I know this? Why didn't somebody tell me? And it's one of those things that. That if you grow up with a mother who isn't really happy being a mother, then you just kind of think, well, gee, that's kind of the way it is. But this is the most wonderful experience of my entire life. I don't care about being a doctor anymore. I just want to stay home with this baby. And so I worked everything out, because if you're a psychiatrist, when I went into practice, you were able to set your own hours. So I was able to work for 10 hours at work. And then when they went to school, I worked longer. So I was able to work it all out together. But I don't think that women have that privilege, have that many opportunities to do that today, just because the practice of medicine has become so industrialized that you can't be in a private practice and you can't set your own hours, you have to work for an institution that's going to tell you the hours that you're going to work. So I really am concerned about the current. The current situation with women. And there are many, many women in medical school, and when this is told to them that there are six women to one man in the marriage, but they all go, yeah. And yeah, we've experienced this. This is reality. But they've invested in their capital by making something of themselves. So I asked a young psychiatrist who's in training, a young man, and I said, well, you know, when. Oh, yes, okay, one thing before I get to that. So a young woman who finished her training in gerontology and has a practice and is working as a physician, fell in love, and she was really happy. And she was telling me all about this through the email. And so I saw her at a conference in September, and I said, I understand your engagement, and this is wonderful. No, we broke up. And I said, well, what happened and she said, well, you know, he was really a wonderful Catholic man, but he wanted me to stay home with the children. And I just couldn't possibly stay home with the children. And I felt really sad for her because, you know, I think that it's not, I'm not the only woman who says, wow, this is the most wonderful experience of my life. When you have a baby, I think men feel the same way, but how do you tell somebody that before they have the experience? And so basically I just said we really have to try to look at things from many, many perspectives and try to figure out what your goals are. And I just backed off because she was really adamant that she was done the right thing, that she's made the decision not to marry this wonderful man because he wanted her to stay home with children. With the children. And of course you could see it from his perspective. I mean, children do much, much better if one or the other of the parent is with them. So I think that the culture has changed so much that I think it is really important for women to take a look at what the culture is dictating to them. They don't want to, maybe they don't want to stay in the pleasure, pleasure pool. They want to move into the marriage pool. And women do move into that marriage pool sooner than men. Then how many choices are you going to have? And of course, the younger you are, the more choices you do have. And then if you want to have children, you've got to think about that and your biological clock. So does that answer your question?"}
{"episode_id":"SW - #028 - 2019-02-08 - Jordan Peterson and Jonathan Pageau Q&A at Seattle Conference - Oct. 2017","start":5421.7,"end":5739.78,"speaker":"Jordan Peterson","text":"Well, I'll say something about that. I guess I'm not going to give advice to women because. Well, because it isn't all that useful to give advice to people, period. Because they have to figure out their own pathway. But I do think that one of the things I am not very happy about in relationship to our culture is the way that we think about children and the way they're also represented. And you know, my experience has been that once I had kids, it's like I would rather be with my kids than with any other people. Now, you know, you kind of have to understand kids. You know, if you want to go out to a restaurant with your wife and you have a two year old, it's like you can go out for 45 minutes, that's it. Because that's about as long as the kid, even if they're very well behaved, can manage it. So you got to kind of clue in and watch. But it's wonderful to have kids because one of the things they do for you, apart from the fact that they really like you, is that. Which is not a trivial thing, man. You know, it's a big deal to have someone want you around that much. I mean, they're really funny. They're ridiculously funny and comical and amusing and they're always doing crazy things. And so that's. They're very clowny and so that's really fun. And the other thing that's really cool about kids is that, you know, as you get older and we know this neurologically, even you stop seeing the world. And what you do is you see more and more of your memory. So like, if I'm walking down the street, I'm 55, like, I don't look at houses, I just have an icon of a house in my mind. I've seen like 50,000 houses. I don't have to look at a house, you know. And so I'm sort of walking down the street and it's full of these icons that are drawn from my memory. And there's a deadening that goes along with that because you replace the rich reality of what's in front of you with the simplified representation that's functional and it's efficient in all that. It really is, but it's not rich. But then when you have around a kid, especially a little kid, well, that just changes because you can see through the kids eyes. And then all these things that you take for granted get revitalized. It's like living with a little artist. Because artists do that for you too. They revitalize your perceptions and. And I found being with little kids was just an absolute pleasure. And I mean, you have to have enough sense to discipline them properly, you know, and that's hard for modern people because they're really guilty about even about the idea of discipline. Sounds like, you know, some sort of Nazi tyrant with a big stick. It's like that isn't what discipline isn't that at all. It's trying to help your children behave in a way that helps other people like them, you know, which is an act of love, that's for sure. But so I think we do a very bad job of selling children to our children, you know, because we say, well, your youth is over and you know, now you have to take on this responsibility and all the fun has gone out of your life. And it's like, well, you know, your life just wasn't that fun when you were single, you know, you don't remember that exactly. And then, well, what about all the joy that you have with your family. And like, is there something wrong with that? Is that not like the central fact of life? You know, and you have to have a hell of a career before it's better than having a family. And maybe even then it doesn't work. You know, for me, I've had a really, I would say, like, I've had a career that would be as good a career as you could hope for, let's put it that way. And still, you know, coming home to my family was always a relief and, and something extraordinarily positive. And then as I've got older, now I have a grandchild, and as I've got older, the relative importance of my family has just grown and grown. And I think that's inevitable as you get older. And so I think we do a really bad job, especially in relationship to young women, because we teach them a pack of lies about what the world is like and we don't inform them, for example, about the phenomena that you just described, which is someone else's baby, that's a baby, but you're baby, that's like, that's like a whole new human being, that's like part of your family. And it's, it's this extension of this sort of magical relationship you have with hardly anyone else in the world. And all of a sudden you have another relationship like that. It's like this is like the image of Mary and the Christ child is a sacred image for a reason, right? It's, it's there for a reason. Societies that don't honor that die and we don't honour that. And that's a big mistake. And it isn't a moral mistake, you know, Exactly. It's just a big mistake. And we need to figure out how to organize our society so that women who want to have kids can figure out how to do that without working themselves to death on a parallel career and taking care of kids. It's really a hard thing to do. And this is one of the things that I really dislike about modern feminism is that they don't. The feminists don't ever seem to me to work for mother infants. You know, they don't. They're not oriented towards that. And that's a big problem because that is what most women who have any sense want. They want other things as well. But, you know, it's a big issue and it would help if we at least stop lying about what children would like. So that would be a good start."}
{"episode_id":"SW - #028 - 2019-02-08 - Jordan Peterson and Jonathan Pageau Q&A at Seattle Conference - Oct. 2017","start":5740.91,"end":5749.95,"speaker":"Moderator","text":"And this is for the two professors to what extent Is the educational system kindergarten through graduate school the cause of society's problems?"}
{"episode_id":"SW - #028 - 2019-02-08 - Jordan Peterson and Jonathan Pageau Q&A at Seattle Conference - Oct. 2017","start":5750.83,"end":6085.04,"speaker":"Patrick","text":"Who do you want to start? I mean, it's what I do now. I hugely responsible. That's why I'm still working and teaching every week at my age. 25 years ago, six of us at Oraway U had been watching students arrive at university with a faith and depart without one. That faith taken away by professors who were outrageously unethical in what they did. And we didn't know what to do about it. So we started reading. We read everything we could find for about five years, starting with the Greeks and ending with Alasdair MacIntyre. It was the best seminar I ever went to. No advertising. We counted, I think it was 19 languages around the table. One day, one, one time, and there would be about 20 people there every week. We were even headhunted by the Chinese government 25 years ago because they knew that corruption was a problem of not having enough children who are properly educated. The teaching ethics to 23 year olds is a total waste of time. It's too late, because the problem is not ignorance, it's a problem of the will. And the will has got to be properly trained. A lot earlier we didn't know how to do it. But slowly it became clear to us that almost all of your children don't know who they are. And they don't know they're heroes that they should know. Now, to truncate a long argument, I'll turn it to my favorite way of teaching. Anyway, as Jesus would a story, but a true one. In the next 90 seconds, I'm going to tell you the story of a man whose name you should all know. Raise your hand. It'd be interesting for me to watch when you recognize who it is. He was born in London to a very poor family. His father was a blacksmith. What education he had was in the church where he would be two or three times a week. He was smart, but by the time one at the back so far, by the time he was 11 or so, he was an apprentice bookbinder. Fortunately, he had a smart boss who realized he was a smart boy. He said, you can read some of these books, you know. So he started reading the books he was binding. Another one goes up. And he loved the science. So he started going to the free public lectures at the Royal Society and the Royal Institute. He took excellent notes, which you still have. And by the time he was 15 or so, he knew he did not want to spend his life binding books. What he wanted to be was the lab tech who set up the experiments to go with the talks at the Royal Institute. So he bound his treasured notes beautifully, entrusted them to the post and sent them to the President, who, fortunately was a good man. And he read these notes, was impressed. To cut the story short, he got the job in due course. And very shortly he became indispensable. The boss started taking him around to meet the great scientists of the day. So all around the world they knew there was a very smart young man in London who'd never been to high school. Eventually, he became president of the Royal Institute. He turned down the Royal Society twice, said he was too busy. He was known to stop the Royal Institute's committee meeting so that he could get to his prayer meeting. And only two of you put your hand up to say you know who he is. Yes, who is it? That's right, Michael Faraday. Deeply committed Christian this is. We need to know these things. So when you start teaching this, our students go away. They're proud of our history. We've got nothing to be ashamed of compared to everybody else. We've got everything to be proud of and to emulate if we can. I mean, what have these people got in common? Just to take one stream of learning, Copernicus, Galileo, Kepler, Newton, Boyle, Faraday, Clark, Maxwell, Eddington, every single one of them believed seriously. If you take the 17th century, the golden age of science, and take the top 200 scientists, only three of them were skeptical. The rest all believed, and 50% of them devoutly. There's no war between science and faith. We've lost our educational process because we don't have enough motivation. We've reduced it to mere information. T.S. eliot saw it coming. He wrote in choruses from the rock in the 1930s. Where is the wisdom we have lost in knowledge? Where is the knowledge we've lost in information? I usually add my own couplet. Information is a medical student useless. Knowledge is a resident dangerous. What you want when you die is wisdom. That's a guy who knows that he shouldn't be fiddling with you too much at this stage. But we now pride ourselves in our university of having an information rich environment. It's wisdom we need. So, yeah, education's lost its way completely. But what we've been doing over the last 20 years, it works. You talk to the ones that are here. Raise your hands those of you. You see them, they're back there. They'll tell you what it's like firsthand so that you don't think I'm hyping It I'm not, I'm absolutely amazed at what can be done and it's got to be done, otherwise we've lost."}
{"episode_id":"SW - #028 - 2019-02-08 - Jordan Peterson and Jonathan Pageau Q&A at Seattle Conference - Oct. 2017","start":6097.17,"end":6256.58,"speaker":"Jordan Peterson","text":"Well, I'm a practical person. I don't teach things that I don't think are useful and that's not the same as imparting facts because there's, as the postmodernists point out, there's an infinite number of interpretable facts. And so it's necessary to help people figure out how to apply the facts and to what. And I suppose to some degree that's wisdom. And one thing that I've learned well over my entire teaching career, because I've always been teaching that way, but especially in the last year, is that there's an unbelievable hunger for that. It's just absolutely beyond belief. And no wonder, because it doesn't happen and people don't have direction and they don't even believe that direction is possible, which is worse than not having direction, right? I mean, that's bad enough, but then to think that direction isn't possible, that's death and it's wrong. And so I don't know why the humanities precisely have lost their way. I mean, I'm a fan of Nietzsche's ideas on that, you know, that it is associated with the death of God, so to speak. I think that's the correct diagnosis. And you know, I've spent 30 years, I suppose, delving into deep stories, trying to re. Establish something like a foundation, I suppose for me at least. And then I suppose to people who are listening to me thinking and well, maybe the time has come for us to work towards transforming our institutions back in the direction of wisdom and characterological development. I mean, that's education, right? Education is the development of character because character is what you use in life. And again, that's not moralistic hyperbole, it's just the barest statement of the most self evident fact. Life is difficult and you better be awake and attentive and tough and courageous and truthful and forthright and, and articulate to manage it properly, to stop it from turning into hell. And that's the purpose of education, is to produce people who are like that. And it's a noble enterprise. And the universities have let it go in many ways and I don't understand why exactly. And well, hopefully something can be done about it and it would be good for us to all try to do something about it and maybe then it'll happen. So I think it happened to some degree at this conference. So hooray for that."}
{"episode_id":"SW - #028 - 2019-02-08 - Jordan Peterson and Jonathan Pageau Q&A at Seattle Conference - Oct. 2017","start":6263.86,"end":6284.16,"speaker":"Moderator","text":"So at this conference, we've certainly gotten a picture how each one of you is trying to use your skills to. To make the world a better place. With respect to that, in your efforts to do that, to make the world a better place, could you give us a brief snapshot of what's going to be your next step, perhaps starting with Mr. Pigeot?"}
{"episode_id":"SW - #028 - 2019-02-08 - Jordan Peterson and Jonathan Pageau Q&A at Seattle Conference - Oct. 2017","start":6286.96,"end":6397.07,"speaker":"Jonathan Pageau","text":"Well, I have to say I've been taken on a hurricane whirlwind. And it's all his fault, really. I mean, this last year, since Jordan. I met Jordan in 2015. So before all of this kind of happened, all of what happened to him, and since we did this little interview and it wasn't even related, supposed to be related to what was going on with him, we did this interview online. And then. Since then, things have strangely tumbled for me. And so I am just. I am. In one way, it's like I'm amazed and I'm excited and I'm exhausted and I'm just like, okay, what's the next thing? And I just keep going one step at a time. So I really have no idea where this is going in terms of my own participation in it. All I know is that I have seen and I've heard and I've read and people are sending me messages every few days and there's something that's happening and there's people that are changing, and I can't not do it. I mean, I can't. I have to or else I'm going to regret it for the rest of my life. And so, yeah, so it's just I started these YouTube videos because people kept writing me and saying they wanted to hear me talk about things. So, okay, so let's do YouTube videos. And then people start asking me to come speak. And so, okay, let's go and speak. And now next week, for the first time, I've always been. It's always been in religious situations. And now for next week, for the first time, it's like a political group, like a secular political group who's asking me to come talk to them. Okay, what am I going to tell them? I don't know. I don't have no idea. So it's just like one step at a time. But all I can say is."}
{"episode_id":"SW - #028 - 2019-02-08 - Jordan Peterson and Jonathan Pageau Q&A at Seattle Conference - Oct. 2017","start":6400.67,"end":6400.95,"speaker":"Patrick","text":"I."}
{"episode_id":"SW - #028 - 2019-02-08 - Jordan Peterson and Jonathan Pageau Q&A at Seattle Conference - Oct. 2017","start":6400.95,"end":6439.52,"speaker":"Jonathan Pageau","text":"Feel like there is something rising up, that there's something. Young men in their 20s, 30s, up to maybe 40, like you said, there is a group of them that are waking up and starting to ask the right questions and moving in the right directions. And all I hope for is that there's going to be a sufficient mass of those so that when things start getting really wacky, there'll be some anchor that can hold the center and that can give us hope for something better to come out of this. So that's all I can say."}
{"episode_id":"SW - #028 - 2019-02-08 - Jordan Peterson and Jonathan Pageau Q&A at Seattle Conference - Oct. 2017","start":6451.12,"end":6732.11,"speaker":"Jordan Peterson","text":"Well, so I've been trying to figure out for a whole year what I'm doing and. But some things have become clear, as many of you know, or some of you at least. I've been doing a series of lectures on the psychological significance of the biblical stories. And I'm going to keep doing that until I can't do it anymore. And by then maybe I'll get through Exodus or something. So. And I'm learning a tremendous amount doing that. And it's stretching me, stretching my intellectual horizons constantly, and having the deadlines in place is very useful for that. And so there's something about that that seems to be a fundamental import. And so I'm going to do that. And then I have a book coming out in January called 12 Rules for Life and my publicist says I have to tell you that it's available on Amazon, so you can go. I was supposed to bring out some flyers, but I forgot those. So. And so I'll likely be going around talking about that. I mean, that seems likely. And I might do a tour of American universities next year. I've been talking to some people about that and that might be ridiculously amusing and entertaining. And so I'm thinking about that. And. And then I talked about an online university, and that's a tougher one. That's a major league project and I'm not sure I'm up to it. Maybe if my health has been somewhat shaky over the last while, though it seems to be improving. If that improves and I have the normal levels of energy that I have, then I can probably manage that. I have talked to lots of people in Silicon Valley already about how something like that might be structured. And I have a plan sort of laid out in my mind that I've talked about with a number of people. And so that would be really exciting because I think that it might be possible to give people a very high quality humanities education and also teach them to write and also teach them to speak online for very little money and in a very efficient way. And so that would be. I've learned how powerful the online video technology is. Right. It's a comperting or who invented the Gutenberg? It's a Gutenberg revolution. It's a second Gutenberg revolution, and we certainly aren't Taking advantage of the technology to the degree that will be possible. So that would be really something exciting to do. And so, and then as Jonathan pointed out, when things change around you in a tumultuous way and in a chaotic way, which has certainly been the condition of my life for the last year, you also just sort of keep up with what happens day to day. And people write me and they ask me to do this and that and I try to figure out what I should be doing and then I go do it. And I do pay a lot of attention to each day and I guess it's a way of managing this. And so I'm going to continue to do that. And my wife helps me, she's here with me, Tammy, and she helps me very much with that. And so it's useful for everyone to know that. But I guess what I'm doing in part, and this is with regards to, mostly to young men, by the apparent, by the, by the, by all appearances, is to fight against this pervasive cynicism and nihilism that's an anti masculine spirit that's invaded our culture, which I think is, will kill us. It's a terrible thing. And you know, I, one of the things that's been very gratifying about what's been happening recently is that wherever I go, young men in particular come up and say that, you know, they were, they, their lives were a mess and they were living a chaotic lifestyle and desperate and useless, all of those things. And that they've figured out that that's not right and that there's better things to do and they're doing it. And God, that's so great to come out to places and have people come up and tell you that. It's just like you couldn't ask for anything better than that. That's just absolutely amazing. And so, so I'll try to make sure more of that happens because that's a really good thing. And you know, like I said, you can't ask for anything better than that. So I'm trying to figure out how to do that most effectively. So."}
{"episode_id":"SW - #028 - 2019-02-08 - Jordan Peterson and Jonathan Pageau Q&A at Seattle Conference - Oct. 2017","start":6742.11,"end":6747.71,"speaker":"Moderator","text":"Thank you all for sharing your experiences with us. Ladies and gentlemen, please join me in thanking the panel for their answers."}
{"episode_id":"SW - #028 - 2019-02-08 - Jordan Peterson and Jonathan Pageau Q&A at Seattle Conference - Oct. 2017","start":6760.42,"end":6816.16,"speaker":"Jonathan Pageau","text":"Thank you for listening to the Symbolic World podcast. As you know, this podcast is for now based mostly on my YouTube videos, which I am transferring into audio format. Please go ahead and visit my YouTube channel. There are more videos there on different subjects that I'm not going to put into audio. And please share this to your friends. I know a lot of people know about the YouTube content, but not so many people know that this is also a podcast. So share it to your friends, share it on social media. And if you can, feel free to support this financially as well by going to my Patreon page, which is Pageau videos. Strangely, you can go there and you can support it at any amount that you want. A month for all the patrons. I do a monthly Q and A, a live Q and A in which people can ask questions in the chat, and I try to have a more connection with people. The YouTube comments have become difficult to follow and to answer. I'll see you soon."}
