{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":12.56,"end":16,"speaker":"Jonathan Pageau","text":"This is Jonathan Peugeot. Welcome to the symbolic world."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":26.25,"end":36.89,"speaker":"Adam Friended","text":"Hey, everybody, it's your friend Adam. I'm here with Jonathan Pujol. We've been talking about having a conversation for a while, and my fans are dying for me to talk to you, just so you know. That's hilarious, everybody."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":36.89,"end":49.37,"speaker":"Jonathan Pageau","text":"Well, I've been seeing you for years, like, just especially. I mean, since the Jordan Peterson thing happened. I've been seeing your videos, watching a few videos, and just kind of seeing you around with Paul Vander Klee and different people. So I'm happy to talk to you finally."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":49.45,"end":173.35,"speaker":"Adam Friended","text":"Yeah, I'm a pro Christianity atheist, so I'm hated on both sides often. So I'm much less hated by the Christians because obviously I'm pro Christianity. I grew up Christian, so I feel qualified to talk about Christianity because I grew up within the religion. I grew up Southern Baptist. And though I kind of grew into atheism because of my being a fan of science and evolution and all that kind of stuff, I've sort of become an atheist. I still understand the value of Christianity and an ethical system and an ethical package. And really, the people that despise me are what I call the antitheists, which I like to separate the atheists from the antitheists, because atheists just lack a belief in God. A lot of times antitheists will say, well, atheism is just a lack of belief in God. And I'll think, yes, that's true, but you have a belief in something different. You're an antitheist. You believe the world would be a better place without religion. That's the central motivating feature of your ideology. I do not believe the world would be a better place without religion. I lack a belief in God. I'm an atheist. You're an antitheist. So I make that separation, that distinction. But we were talking a little bit before we started about. You recently did a talk with Rationality Rules, and I listened to that talk. I thought it was interesting. But I agree that with some of the people saying that there was a little bit of talking past one another. So I thought, you know, our. It made me want to have a conversation with you even more because I thought we're probably less likely to talk past one another. Ironically, like, Rationality Rules made this video completely savaging me. I made some response videos to him and I thought he and I would have a constructive dialogue. That never happened. Like, I'm closer to his position. Like, he did a video recently. It's funny because. Okay, so let me give the Backstory here."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":174.31,"end":176.63,"speaker":"Jonathan Pageau","text":"I didn't know about this story. I didn't know this has happened."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":176.79,"end":258.91,"speaker":"Adam Friended","text":"So Rationality Rules was making Jordan Peterson videos and just straw manning the hell out of Jordan Peterson. It was driving me crazy. It was driving my fans crazy. So they wanted me to do response videos because I understand Jordan Peterson's argument. Jordan Peterson's argument is surprisingly close to Bret Weinstein's argument about metaphorical truth. So I'm doing these videos explaining how Rationality Rules is completely straw manning the argument here. Later on, Rationality Rules does a video where he's all in favor of metaphorical truth. And I'm like, why are you crapping all over Jordan Peterson? If you're in favor of what Jordan Peterson is talking about? Just you're not necessarily understanding it. So I made some response videos to him. He made a response video to me, basically just dismissing me as some Internet troll. And I'm like, I've been on YouTube longer than you, man. I know everyone on YouTube. I don't necessarily understand where you're coming from. So I thought I would have some kind of a constructive dialogue with him about this stuff. But it's funny to me that now he's kind of making videos that are my position. So. So that's actually a good thing. Like in the long run, if he's going to come around to my position anyway, regardless of whether or not we get along, I'm comfortable with that. But you evidently have a problem with his position and."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":259.15,"end":296.17,"speaker":"Jonathan Pageau","text":"Well, I, I saw him. I had been. I've seen his videos. Like, just. Anyway, you know, I've seen all. A lot of the different types of atheists and different types of. I, you know, people who have different ideologies on YouTube for years, you know, I've been, I've been now on YouTube for about four years and I'd seen his videos, kind of his anti Jordan Peterson videos. I had written one comment on one of his videos saying that I think that he misunderstands the argument. And we had a little bit of an exchange on one of the videos. But then I thought, I don't think we could understand each other. And then recently I did see his video on Brett Weinstein's Metaphorical Truth."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":296.17,"end":296.57,"speaker":"Adam Friended","text":"Right?"}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":296.73,"end":423.45,"speaker":"Jonathan Pageau","text":"And I was really surprised at some of the things he was saying. And I thought, oh, wait, actually, so if, if he can find some ground in Brett Weinstein's argument, then maybe there could be a point of contact where we could talk, at least, at least kind of try to understand each other. Because until then, I felt like we'd probably completely talk past each other. And he has been really super gracious. He was extremely generous. We had a private conversation first to kind of to just say, okay, look, this is what I'm going to say. We weren't trying to. The idea is, like, we don't want to trap each other. Like, that's not the point. You really want to try to explore the ideas. And it's been really positive. For me, at least, the conversation has been positive. I do feel like you said that in the conversation, a few things happened. I think one thing that happened was we did end up talking past each other on certain points, and I feel like he hadn't realized the extent to which I'm actually a Christian. And then I think that that surprised him. And so then he was kind of taken off guard because, you know, at some point he says something like, wait, so you really believe in God? And I was like, well, yeah, you know, and then I think that that surprised him a little bit, because I think he saw me more on Jordan Peterson's side, let's say. But, yeah, in the end, I do feel if you watch the comment sections on both our channels, it's clear that we are still talking way past each other, because it's very radicalized. Like the comp. The comment sections. Like, on my side, they're saying, he didn't understand what I was saying. And on his side, they're saying, I'm just trying to speak around. I'm just basically saying things to justify my Christian position and not really engaging with the argument. So it's too bad. I don't know. For me, it was like a test. It was like, I'm going to find the person that I feel is kind of the furthest from my position that I could actually talk to and then try to see if we can understand each other. So I'm not sure it happened, but I'm not totally giving up yet, let's say."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":423.85,"end":566.46,"speaker":"Adam Friended","text":"Well, personal feelings aside, I think he's cultivated an audience of antitheists. I harp on this distinction all the time because it's so important. He has an audience that wants to believe the world would be a better place without religion. Even the LGBT stuff came in your talk with him. Like, a lot of those people who are antitheists are LGBT activists. They feel religion is dangerous to the LGBT movement, and maybe they have an argument there. Like, I don't necessarily disagree with them. In America, we have this thing, and I'm sure it's the same. You're in Canadian, right? In Canada, I'm sure it's pretty much the same thing. Like if. If you're LGBT and the. And the church has prohibitions on lgbt, then you can leave the church. Like, nobody's forcing you to stay there. This isn't Islam or anything like that. Go enjoy your life without the church. So as long as it's not being forced upon you. I feel like they have less of an argument there. But one of the things that I thought we could talk about that would be more interesting is that I feel like I could get past some of the talking past one another that you had with him. Because the thing about Steve, or Rationality Rules, whatever he's calling himself these days, you if that. I'm not sure that he can win that audience over, but he has more of a chance of winning that audience over than either of either you or I have. And I know that when he was making response videos to Jordan Peterson, they very much saw Jordan Peterson as just like this Bible thumper that was winning people over to Christianity. But the reason Jordan Peterson was winning people over to Christianity, I think, is because he was putting a rationalist, scientific spin on Christianity that made it make sense for a lot of people who were scientifically minded atheist types. So it was just a misunderstanding that Rationality Rules had about Jordan Peterson that a lot of my response videos were trying to explain. And it's funny that you are probably closer to the type of person that he thought Jordan Peterson was than I."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":566.46,"end":567.3,"speaker":"Jonathan Pageau","text":"Think Jordan Peterson was."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":567.3,"end":567.38,"speaker":"Adam Friended","text":"More."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":567.38,"end":574.26,"speaker":"Jonathan Pageau","text":"I'm more like, I go to church. I don't go to church now because of COVID but in a normal world, I go to church."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":574.26,"end":575.38,"speaker":"Adam Friended","text":"Totally. Yes."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":576.02,"end":583.86,"speaker":"Jonathan Pageau","text":"And I pray and I have taken on all the traditional practices of a Christian, that's for sure."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":583.86,"end":602.2,"speaker":"Adam Friended","text":"Do you think Jordan Peterson, because we have this running bet going with Jordan Peterson is like, is Jordan Peterson really just an atheist that understands Christianity, but he just doesn't want to say he's an atheist because he loses all his street credit? I believe Jordan Peterson is probably closer to the atheist position."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":603.56,"end":708.45,"speaker":"Jonathan Pageau","text":"I think that he's the thing, this is the thing about Jordan, is that Jordan is what you see. There are no two Jordan Petersons. And that's something that is important for people to understand, is that whatever you see of him, none of it is like a show. If you see him hesitating on a question, it's because he's hesitating on a question. He's not doing it. He's not doing it as a way to Play a game. I had a conversation. I mean, I haven't talked to him a lot recently because of the hell sick and everything, but I had a conversation with him maybe about a year and a half ago where he started talking about Genesis again. And he was just like, wrestling with the thing, wrestling with the story. And then he says, what if these stories really were true? What if they were true? And he was excited about it on the phone. And I was like, are you like, really? I was like, come on, man. I thought, like, from my side. I thought we were past this, but I think he's really kind of. He's really wrestling with these questions existentially. And so that's what it is. So I think that he's not an atheist, but I think that he doesn't have faith. Mm, let's say it that way. That is, there's a difference between saying. There's a difference between saying that you believe that God refers to something which has value, let's say something like that, and faith, which is a celebration of that which is above you and a participation in that story. So those two things are different."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":709.42,"end":727.34,"speaker":"Adam Friended","text":"So do you want to get into your conception of God? First of all, just since we're talking about the rationality rules talk, is there anything that you'd like to say that you felt wasn't said there or after you've had some time to reflect on it? What are some of your afterthoughts?"}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":727.98,"end":927.57,"speaker":"Jonathan Pageau","text":"Well, for sure, I do feel like I wasn't able to communicate what I wanted. And it's been helpful, to be honest. It's been helpful to watch. Paul vanderkly did a comment on the talk, and I've been reading his comment section in my comment section. And so it's been. I think it's going to help me in the end because these things are hard to talk about. And so I feel like I wasn't able to communicate one basic thing, which is that I could maybe summarize it this way, which is that I have a cosmological frame. And this cosmological frame is actually universal. It actually isn't limited to Christianity. Christianity has some key puzzle elements of that cosmological frame, which I think are extremely important. I would say make Christianity truer than anything else. But the frame itself is the same in Daoism and in Hinduism and in all the religions. It's a basic cosmological frame. And the applications of that pattern are what cause all the rules in terms of morality that I believe in. And so if you're going to argue against some moral position in the Christian. In the Christian worldview, then you have to be able to tell me what it is. First of all, from which position are you arguing that? Because I know, like, I have a whole pattern that tells me how a pattern that is as useful to my moral positions than they are to how I build houses and how you build cities and how you organize government. All of these things come down from this cosmological pattern. There's variety. It's not a totalitarian thing. There's variety. So if you're going to tell me that this moral position of Christianity is wrong, then you have to be able to argue your frame to me, not just this position. And you also have to be able to tell me what is the good you're aiming towards, because I know what the good I'm aiming towards is, whether I succeed or not. We can argue about the application and say this application doesn't lead to that goal. But if you're going to tell me that it's not good enough and you need something better, you have to tell me what the better is. And I feel like that's the place where we were stuck, where I was saying, if you tell me this aspect of Christianity is inadequate, then you have to be able to tell me towards what I need to modify it to. If I'm going to modify it towards what is it liberty? Is it equality? Is it what is the value? I don't. I'm not sure I could understand what that is. Is it comfort? Is it more people alive and less people dying? Is what is it like? What is the thing you're aiming towards? What is the telos? And so I think that that's the. That that was where, to me, at least, it stuck. And we were unable to kind of get past that. But I feel like it's maybe because I didn't articulate enough the idea that. That I don't care as much about the. The particular laws and rules that you don't like in Christianity. Because the frame is so powerful that I'm willing to even accept some things that I might disagree on in detail, because it's worth to keep this frame and to live inside this story and to participate in these communities. It's worth it to accept a few things that I might even disagree with."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":929.01,"end":987.86,"speaker":"Adam Friended","text":"I forgot to mention too, that we're both artists, so I think. I think we have that in common. But just back on the topic, the arguing against the morality, I think, like, I've hung out with these people enough and you know, I'm sort of tacitly part of their tribe. I think they would say something to the effect of, you know, truth, scientific truth, materialist truth has a higher survival value than just because of. They always want to point to medical advancements and things like that that go. Putting all of our eggs in the metaphorical truth basket would be more detrimental to the survival of more people than to focus on scientific truth. So I think that is really their biggest disagreement or argument against your ethical package that I think that they would pull out."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":989.3,"end":1058.26,"speaker":"Jonathan Pageau","text":"So this is something that has come up with Brett Weinstein as well, which is. So on the one hand, you have this evolutionary thinking and this basic scientific thinking, which is also bound up in evolutionary thinking. And these two things are strangely bound up together. And so what I hear is, on the one hand, I hear people saying that scientific truth is the highest, it's the most important. And then I hear at the same time, the same people saying, we need to break our evolutionary code. We need to move out of our evolutionary code because it's dangerous, because it leads to genocide, because it leads to rape, because it leads to all of these horrible tribalistic things. And so they're saying we need to be able to now, to now transcend our evolutionary impulses. And my question is again, towards what? Like, where are you standing? Like, if you're. If you're not then in the evolutionary camp and you're in another camp, then tell me what's your camp? Tell me where you are and what you're aiming towards."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":1058.34,"end":1064.27,"speaker":"Adam Friended","text":"What do you think the evolutionary camp is? Because you're a believer in evolution, right? I mean, you're not."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":1064.75,"end":1067.87,"speaker":"Jonathan Pageau","text":"I think evolution happened. I don't know if I believe it."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":1068.83,"end":1070.87,"speaker":"Adam Friended","text":"Okay, what would you."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":1070.87,"end":1076.03,"speaker":"Jonathan Pageau","text":"Or believe in it? How about if I don't really believe in it, but I don't mind it?"}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":1076.19,"end":1078.99,"speaker":"Adam Friended","text":"So maybe we're just talk. I don't want to talk past each other."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":1079.15,"end":1079.63,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":1080.19,"end":1087.95,"speaker":"Adam Friended","text":"So you, you believe evolution by natural selection is happening today? You know, the origin of species, you believe in that?"}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":1088.75,"end":1090.11,"speaker":"Jonathan Pageau","text":"I think I definitely think that."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":1090.11,"end":1091.71,"speaker":"Adam Friended","text":"Or you think it's true? I guess."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":1091.71,"end":1097.06,"speaker":"Jonathan Pageau","text":"Powerful. It's a very powerful process that has been brought to light in the last few centuries."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":1097.06,"end":1107.14,"speaker":"Adam Friended","text":"Believe is a tough term. I think that's a term we're getting hung up on. You accept that it's true, that evolution is happening? Evolution by natural selection?"}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":1107.7,"end":1109.66,"speaker":"Jonathan Pageau","text":"Yeah, I'll say yes, that's fine."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":1109.66,"end":1110.18,"speaker":"Adam Friended","text":"What is it?"}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":1110.18,"end":1111.42,"speaker":"Jonathan Pageau","text":"I can say yes, that's okay."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":1111.42,"end":1118.9,"speaker":"Adam Friended","text":"Reproduction, variation, selection, I think is what you can nail it. Down to. Okay, this also happens culturally. Do you accept that?"}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":1119.54,"end":1120.26,"speaker":"Jonathan Pageau","text":"I think so."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":1120.66,"end":1146.41,"speaker":"Adam Friended","text":"Cultural evolution happens through the same process. Right. A bunch of people think, let's try something different. Let's all switch our genders and form a commune and see what happens. Maybe this will be a successful cultural adaptation. If it's not successful, if it doesn't reproduce offspring, it dies out. And that cultural mutation dies. Correct. Same way as organisms themselves reproduce and die."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":1146.65,"end":1154.74,"speaker":"Jonathan Pageau","text":"Yeah, well, that has some. Even in evolutionary terms there's a problem because there's a limited amount of energy you can expand found."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":1154.82,"end":1155.58,"speaker":"Adam Friended","text":"Sure, totally."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":1155.58,"end":1173.98,"speaker":"Jonathan Pageau","text":"Most evolutionary processes are actually hyper conservative, very much so, because you have very little energy. And if you start to, you start to put all your energy in these experimental forms, then you're going to be dead before you have the time to even know whether or not all these forms you're trying to experiment with were going to be fruitful."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":1173.98,"end":1207.55,"speaker":"Adam Friended","text":"And this is the best argument against the celebrity atheists like Dawkins and Harris and those guys. Because like religion is all these costly, has all these costly features to it. Evolution is the best argument that religion is doing something useful evolutionarily or why would it exist? We're expending all these costly energies going to church, helping people, meeting other, meeting together, forming coalitions. All of that stuff has to be evolutionarily advantageous somehow or other because as."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":1207.55,"end":1211.77,"speaker":"Jonathan Pageau","text":"Religion leaves the public sphere, the, then the birth rate goes down. So sure."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":1211.77,"end":1228.09,"speaker":"Adam Friended","text":"Exactly. That too. That too. So, so you, you are probably in agreement with Brett Weinstein that evolution or that religion is some sort of, of extended phenotype, I think is the way that he referred to it in his talk with Richard Dawkins. What's."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":1228.09,"end":1233.37,"speaker":"Jonathan Pageau","text":"It doesn't bother. Like, I, I obviously do not view the world primarily in evolutionary terms."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":1233.37,"end":1233.77,"speaker":"Adam Friended","text":"Right."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":1233.77,"end":1288.45,"speaker":"Jonathan Pageau","text":"Like I, I, I interpret the evolutionary terms based on, I think that the frame, the cosmic frame that is given by, let's say traditional society is more powerful than that. But I don't mind it in the sense that I think it's fine, I think it's okay. But I think that when you try to apply these types of patterns to religious thinking, what happens is you catch a few things, you catch a few things that are true and a few things connect. So you look at the rules and the scripture and you, and you're like, oh, I can explain this through this, this evolutionary process, I can explain this. But then there's like 80% of it that you still think is nonsense. But even if you do believe that it's a It's like this emergent thing that happened. Then it, it needs for it to have been selected for. It needs to have some coherence or at least some, some, some application."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":1288.61,"end":1290.77,"speaker":"Adam Friended","text":"Are you talking about Christianity specifically?"}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":1291.3,"end":1314.02,"speaker":"Jonathan Pageau","text":"Total nonsense for thousands of years. You know, I don't think that, that that's true. And the frame that I'm trying to explain to people makes sense of it all. Like it doesn't. None of it falls to the side. There's nothing in scripture which falls to the side if you use the basic cosmic pattern that, that, that you find, that you find in religion itself."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":1315.06,"end":1377.33,"speaker":"Adam Friended","text":"Okay. The. I'm not, I'm not completely sure what you're meaning on the cosmic pattern, but we'll get back to it because I just if, Well, I want you. One thing that came up continuously in your talk with rationality rules was like the goal, what's good, that kind of stuff. So I just think as impartial observers of evolution, like we both believe it's reproduction variation selection. What is the goal of reproduction variation selection in the context of physical organisms? To me it seems like it has to be something on par with utilitarianism, like the most well being for the largest number of people. And it's, it's perspective oriented because it is going to be the. You know, obviously what's good for us is not necessarily what's good for chimpanzees. Like there's a reason why humans have dominated this planet and chimpanzees have not. Right."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":1377.89,"end":1397.25,"speaker":"Jonathan Pageau","text":"But why is it the most good for the most people? I really can't get there with evolutionary thinking because, because it can be to your advantage to, to massively dominate other populations evolutionary in an evolutionary way. It's, it's way. It's your advantage to completely dominate the other lines."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":1397.25,"end":1398.21,"speaker":"Adam Friended","text":"Yes. No, I agree."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":1398.29,"end":1400.45,"speaker":"Jonathan Pageau","text":"So that your line is advantaged."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":1401.25,"end":1426.61,"speaker":"Adam Friended","text":"I agree. That's why I specifically said that it's perspective oriented. Because obviously the utilitarian argument for lions is going to be different than the utilitarian argument for human beings because the most good for the most people is different than the most good for the most lions. The most good for the most lions is the frame of reference for a lion. Though they're obviously they would like to be in the humanity role right now."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":1427.54,"end":1431.3,"speaker":"Jonathan Pageau","text":"And lions will eat the offspring of other lions if they, if they."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":1432.26,"end":1473.4,"speaker":"Adam Friended","text":"But that is actually, that is actually a bad thing in the utilitarian argument because the most thriving for the most organisms in that species is going to help. Because you got to admit, numbers Matters especially in an evolutionary game. So while different, different speed, different humans form different tribes that competed against other tribes, a bigger tribe always had a better advantage. Correct. Like if I have 100 people versus 10 people, obviously you'd put your money on the 100 people, right?"}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":1473.4,"end":1475.28,"speaker":"Jonathan Pageau","text":"Well, not always, I don't think that's why."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":1475.28,"end":1475.68,"speaker":"Adam Friended","text":"I know."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":1475.68,"end":1486.5,"speaker":"Jonathan Pageau","text":"Obviously that's also why. That's why you have moments in history where the small, like Mongolian tribe comes in and savages the Chinese empire."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":1486.5,"end":1502.26,"speaker":"Adam Friended","text":"Why though? Why? What is the advantage that they have over the numbers? The technological advantage or flexibility? Okay, so they have a better ethical system. Sorry, so they have a better ethical system, a better strategy, like they have."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":1502.26,"end":1523.86,"speaker":"Jonathan Pageau","text":"A better system to dominate. Because when you have, let's say you have a system which is too big, then it had lack flexibility. And so when the bigger it gets, the more chance you have of a small thing coming in and piercing the bubble. Right. And because it has massive flexibility, then it can wiggle itself into a space and take over."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":1524.18,"end":1555.64,"speaker":"Adam Friended","text":"But if you have two teams like that and one has a superior, I call it an ethical system. Because that's basically what ethical systems are. They're the rules of engagement between a group. So if that group has a rule, has a ethical system that allows them to form a bond of 10 guys that can beat a hundred guys, that ethical system, everyone's gonna look at and go, that's a good ethical system. I think we should adopt it. And pretty soon that 10 guys is 100 guys and they can beat a thousand people. Right?"}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":1555.64,"end":1558.44,"speaker":"Jonathan Pageau","text":"Yeah. So that ethical system, then there's another."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":1558.52,"end":1561.68,"speaker":"Adam Friended","text":"10 guys with a different ethical system."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":1561.68,"end":1604.49,"speaker":"Jonathan Pageau","text":"Maybe the ethical system will change as societies. That's why societies change. As you, as you get rich and as you get, as you stabilize, then your world is going to start to look like what you are. It's. You can't just, you can't, you can't be. You know, it's like, Jordan, it's like you can't be a boxer, a super aggressive boxer, if at some point you stop fighting for your life. Like at some point you're gonna lose your edge. You need to find ways to keep your edge. But it's going to happen all it's going to happen by itself. It's just going to be part of your success is going to be that you're going to lose that edge that you had at the beginning. It's just a normal cycle of things."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":1604.81,"end":1619.77,"speaker":"Adam Friended","text":"Well, I view Christianity and different religions as these ethical systems that are uniting people and allowing people to Cooperate with one another. That's the way that I see these ethical systems."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":1619.93,"end":1750.07,"speaker":"Jonathan Pageau","text":"So what if we could say that it's not an ethical system system? I don't think Christianity and I don't think religions are ethical systems. I think that that's one of the problems which makes it hard for people to understand religion is because if you think that if they're an ethical system, then you don't understand why you have to build an ark of the covenant and have two angels with their wings touching. And you don't understand why you need to have veils around holy places. All of this stuff makes no sense if it's just an ethical system. You know, it's actually more than an ethical system. It's a frame of reality. It's a way to understand value and to understand. Not to understand, but to participate in hierarchies of being so that these hierarchies lay themselves out and create units. So it has more to do with identity than it has to do with ethics, has more to do with who you are, what your place is in the world, and what's your relationship with others. And then downstream from that, you have rules and regulations and, let's say, ways of acting. But at first, it's like we worship the thing that unites us. We celebrate the thing that unites us. Just like a basketball team will celebrate their logo, their mascot. They will find rituals to cohere and they'll have a totem, like a mascot that will go out into the crowd and get everybody to cheer for the team. That's the most important part. It has to do with identification and social cohesion through participative identity. More than the moral stuff, the moral stuff comes downstream from that. Once you understand that, then a lot of religious stuff is going to make way more sense to you. You're going to understand why people gather together, why they sing together, why they pray together, why they look in the same direction, why they eat a meal together. All of these things are manifestations of participation in the same identity under a God, under something which unites them, an identity which unites them together."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":1750.47,"end":1785.05,"speaker":"Adam Friended","text":"Well, from an evolutionary frame, all of this makes complete sense. So it's. It's. I can understand it from my frame, and I think you can understand it from my frame. I don't know that I completely understand what you're talking about. From your frame. Well, no, and that's. That's. I mean, that's the goal here, right? I mean, what is your goal? What are you trying to accomplish with your YouTube channel, and you're just talking about this kind of stuff."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":1785.46,"end":1969.92,"speaker":"Jonathan Pageau","text":"So what I'm noticing in the world is a breakdown. There's a breakdown happening. There's a fragmentation of identities. There's a fragmentation of. All the places in which we find our communion, in which we find unity, are breaking down and people are just surfing through, surfing as if this is normal. But at some point it's going to move towards more chaos, riots, all of this stuff, the chaos that we see, that we saw in 2020. And it's also going to move towards authoritarian clampdowns. Because one of the problems which happens when normal identity starts to fragment is that there's an overcompensation on the other side. And so what I'm seeing downline is very dark. There's a very dark horizon. And one of the reasons why it is is because we've ceased to understand what makes things exist as one. Like, why do we think that nations have identity? Why do we think families, why do we think a person has unity? And this is because we've lost the cosmic frame. We've lost the frame, this traditional hierarchy of being which. Which is shown in the temple, in the church, in the. In the story of Genesis, and all of these images that help us to understand and participate in how things are 1. Jordan talks about this all the time, which is the problem of. John Vervicke uses the words combinatorial explosion. There's too much stuff in the world. Like, there's just too much phenomena. And so there are ways in which phenomena, phenomena coalesces into identities in which you're able to see that a chair has parts, but is also one. Like, why do we think that a chair is one thing? It's not one thing. It's a million things. And why do you think that that chair participates with other furniture? And we can see it as one room? And why do we see one room as one house, or one house as one, all these houses as one city? There are processes by which this is possible. And if we attack ritual and we attack the notion of concentric spaces, or the idea of the way in which society communes, then it's going to become the suburbs. All of reality is going to become the suburbs. It's going to become a flat, a flat distribution of particles that have no coherence. It's going to happen in the way we build houses. It's going to happen in our morality, where everybody has their own morality. It's going to happen in our identities, where everybody has their own identity. And there's nothing joining us together. And we're going to not know our neighbors, which is already happening. We don't know our neighbors. We don't know the people next to us. We have nothing binding us. There's no glue. And that glue is ritual. It's based on concentric. It's based on worshiping the same thing."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":1970.32,"end":1971.28,"speaker":"Adam Friended","text":"No, I agree with you."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":1971.28,"end":1973.76,"speaker":"Jonathan Pageau","text":"You have to celebrate the same thing in order to be together."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":1974.08,"end":2023.25,"speaker":"Adam Friended","text":"This is Jordan Peterson's idea of God. God is the thing that you orient yourself towards. And different communities orient themselves towards different things. Like I would say the social justice community is oriented towards fighting for the rights of the oppressed. That is technically their God because that's what they're orienting themselves, the antitheists they orient themselves towards. The world would be a better place without religion. That is their God. That is the God that they serve every day with every video that they make. They're trying to turn everyone else into antitheists. Well, actually, and you know, by extension into scientists. Because they worship truth. They think religion is bad because it doesn't worship truth over well being."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":2023.57,"end":2027.01,"speaker":"Jonathan Pageau","text":"Even though it's funny that actuality is what they worship."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":2027.17,"end":2046.16,"speaker":"Adam Friended","text":"Well, but you said one thing. I think, I think I want to go back to the, the fragment. You see fragmentation as a problem. I'm torn over whether or not the fragmentation is due to material conditions or whether it's due to philosophical breakdown. I think there's good arguments for both, but I."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":2046.24,"end":2047.44,"speaker":"Jonathan Pageau","text":"They go, they go together."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":2047.84,"end":2051.44,"speaker":"Adam Friended","text":"Yeah, they do. They kind of feed off of one another because you're in Christ."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":2051.84,"end":2061.67,"speaker":"Jonathan Pageau","text":"That's why Christianity has an ascetic aspect to it. Right. The idea that we accumulate all this stuff, we think that it's good in itself is not necessarily, necessarily, not necessarily."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":2061.67,"end":2073.03,"speaker":"Adam Friended","text":"So that's, see, that's where the philosophy shapes the material conditions. Because if you're living in horrible material conditions, it's helpful to have a philosophy that makes you enjoy not having anything. Well, the guy."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":2073.03,"end":2078.63,"speaker":"Jonathan Pageau","text":"Well, monks could live in very lavish conditions. They wanted to. They choose not to."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":2078.63,"end":2078.95,"speaker":"Adam Friended","text":"Right."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":2078.95,"end":2173.4,"speaker":"Jonathan Pageau","text":"Like monasticism is a voluntary choice. It's not a, it's not a, it's not caused by the outside world. It's, it's, it's. The ascetic spirit of Christianity can flower even in the empire. Like, even if when Constantinople was the most glorious city in the world, there were still monks standing on pillars and living in caves. So the ascetic tendency is not just based on, it's not just based on a lack of material Possibility, there's something else in the ascetic thing. But I just want to say one thing about what you said in terms of the gods. And I think you're right. They really are gods. And one of the problems we're seeing, one of the things we saw in the last few thousand years is through Christianity, through Islam, through Judaism, through Neoplatonism and other versions of tradition, some aspects of Hinduism, like let's say Vedanta Hinduism, there's this idea that the gods stack up. And so the identities of these different things, they stack up. And they stack up towards something which moves towards a point. And you could call that point being, you could call it the origin. There's all ways of talking about it, but they stack up. So it's like you have modes of being, let's say that social justice God, the God of war, the God of money, the God of this, you have all these gods and they're all competing and they're competing in society, but they're also competing in you, right? So you have desires."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":2173.4,"end":2173.96,"speaker":"Adam Friended","text":"Not me."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":2173.96,"end":2215.61,"speaker":"Jonathan Pageau","text":"Those desires are fighting amongst each other. And you can feel the same. You can feel two at the same time, right? You love someone, hate them at the same time. It's ripping you apart. And so let's say that the Christian answer, and it's not just a Christian answer, but is that there's a way to unite those into a single mode of being which unites all other modes of being. And that's the movement towards the transcendent God, which is. Who is not like all the other gods. It's not that you can't. One of the problems that people, when people. The kind of weird atheist argument, which is that, like, everybody's an atheist, you just believe in, you know, you just believe in one more. I just."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":2215.61,"end":2217.05,"speaker":"Adam Friended","text":"One less God than you do."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":2217.05,"end":2217.29,"speaker":"Jonathan Pageau","text":"Right?"}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":2217.29,"end":2217.61,"speaker":"Adam Friended","text":"Yeah."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":2217.61,"end":2247.16,"speaker":"Jonathan Pageau","text":"It's like, no, that's not true. I believe in all the gods. I think all the gods exist, exist. But the infinite transcendent is not the same as all these particular gods. Just like in order to unify the different cities in the United States, you need an identity which is higher, which is the state. And if you want those states not to fight amongst each other, you need an identity higher, which is the country. And so you need these transcendent identities in order to unify things below them."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":2248.84,"end":2287,"speaker":"Adam Friended","text":"So the. In the context that I said, like an idea can become a God in the sense that it's some idea that a community orients around social justice. We talked about antitheism, we talked about what would be the central idea that Christianity revolves around. I, I have my idea, but my idea is through an evolutionary framework, obviously. But your idea and everything that you're saying, I don't disagree with anything that you're saying. I'm kind of translating it into an evolutionary framework in my mind that I."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":2287.24,"end":2288.28,"speaker":"Jonathan Pageau","text":"I think it's love."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":2288.92,"end":2289.32,"speaker":"Adam Friended","text":"Love?"}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":2289.96,"end":2290.4,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":2290.4,"end":2290.84,"speaker":"Adam Friended","text":"Okay."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":2290.84,"end":2371.74,"speaker":"Jonathan Pageau","text":"And so what love, love, what love does is that it is the, the balance of the unity and multiplicity. So love is when you can have, let's say, unity amongst people, but that unity doesn't dissolve the difference, the multiplicity. You know, it's like if you love someone you don't like, suck them into you, you don't like, you know, just like the way that you like to eat something, that type of desire. That's not what Christian love is. You don't make everything the same. Through love. There's a recognition of the unity and also recognition of the multiplicity at the same time. And it creates this kind of balance or this dance between one and many. And I think that that's the highest value of Christianity. And it manifests itself in the incarnation where Christ is seen as both fully transcended, fully God fully, you know, and at the same time fully incarnate, fully multiple, fully linked down, all the way down into death, you know, and so it's like there's this joining of absolute fragmentation and multiplicity in all the way into death with the ultimate transcendent principle."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":2372.06,"end":2381.82,"speaker":"Adam Friended","text":"You're, you're expert at talking in the metaphorical truth frame. Like so much of this is, I can see this driving, does it sense."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":2381.82,"end":2383.73,"speaker":"Jonathan Pageau","text":"You are, does it sound like I'm just spouting gibberish?"}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":2383.73,"end":2383.96,"speaker":"Adam Friended","text":"Gibberish?"}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":2383.96,"end":2384.96,"speaker":"Jonathan Pageau","text":"I hope I know a little."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":2384.96,"end":2406.04,"speaker":"Adam Friended","text":"It's, I, I, I can understand it and, and respect it because I respect the idea behind metaphorical truth. But I think a lot of like scientifically minded types, it sounds like gibberish too, because they don't, they can't necessarily grab onto it into, in a, like a materialist type framework, you are, you are talking about hierarchies."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":2406.04,"end":2407.56,"speaker":"Jonathan Pageau","text":"Let me use a scientific example."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":2407.88,"end":2408.68,"speaker":"Adam Friended","text":"Okay, Right."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":2408.76,"end":2415.28,"speaker":"Jonathan Pageau","text":"And so you have a transcendent principle, right? That's, you could call it a theory."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":2415.44,"end":2426.56,"speaker":"Adam Friended","text":"Is it? Okay, so it's like the theory of evolution. So that's like you have a pattern, right? Selection, variation, reproduction."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":2427.28,"end":2440.76,"speaker":"Jonathan Pageau","text":"It doesn't matter which one it is. Any scientific theory will do. And that is a pattern. And that what that pattern does is first of all, it tells you what to look At. Because you could look at a million things in the world."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":2440.76,"end":2441.56,"speaker":"Adam Friended","text":"Sure, totally."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":2441.56,"end":2444.52,"speaker":"Jonathan Pageau","text":"So the theory, first of all, frames what you're talking."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":2444.6,"end":2446.04,"speaker":"Adam Friended","text":"A little slice of reality."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":2446.68,"end":2468.28,"speaker":"Jonathan Pageau","text":"Right. It frames the slice, and then it also gives you the parameters by which the pattern of this thing is going to happen. Okay. So that's the heaven of that scientific thing. And then there's also earth, a lower part. And that's all the multiplicity of facts which you encounter. All the variety of facts that the."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":2468.28,"end":2470.8,"speaker":"Adam Friended","text":"Pattern creates in sort of a fractile type sense."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":2470.8,"end":2490.72,"speaker":"Jonathan Pageau","text":"Yeah. But it doesn't just create them. It also kind of. It, let's say it has to recognize them also. And it's not just about creating them, because those facts, you know, have a way of speaking like they, you know, and sometimes the facts will start to contradict the theory."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":2491.12,"end":2491.52,"speaker":"Adam Friended","text":"Mm."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":2491.6,"end":2497.2,"speaker":"Jonathan Pageau","text":"And so then you have to find a way to balance the theory with the facts."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":2497.2,"end":2497.76,"speaker":"Adam Friended","text":"Correct."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":2497.92,"end":2516.24,"speaker":"Jonathan Pageau","text":"If you un. If it's not balanced, then either the theory will, like, start to crush the facts and will start to suppress the facts that they don't. That it doesn't like. So that it will continue to make the theory look plausible. Yeah, it'll start to marginalize facts."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":2516.24,"end":2518.72,"speaker":"Adam Friended","text":"This is where the metaphorical truth comes in. Right here."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":2519.68,"end":2520.8,"speaker":"Jonathan Pageau","text":"This is what happens, Right?"}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":2521.12,"end":2522.2,"speaker":"Adam Friended","text":"Well, definitely. Yeah."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":2522.2,"end":2533.56,"speaker":"Jonathan Pageau","text":"If it's not metaphorical, it's like this is scientific. So you have facts and you're looking at them through your theory, but some of them don't fit. If a few of them don't fit, that's fine. Right? You kind of leave them to the side."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":2533.56,"end":2533.92,"speaker":"Adam Friended","text":"Yeah."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":2533.92,"end":2538.16,"speaker":"Jonathan Pageau","text":"If a lot of them, they start to push and push and push them. At some point the theory is overturned."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":2538.32,"end":2538.72,"speaker":"Adam Friended","text":"Yeah."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":2538.72,"end":2543.72,"speaker":"Jonathan Pageau","text":"It's going to split apart. And this, the theory and the facts would just won't fit together anymore."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":2543.72,"end":2544.48,"speaker":"Adam Friended","text":"Correct. Yes."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":2544.48,"end":2546.32,"speaker":"Jonathan Pageau","text":"Reality will stop to be coherent."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":2546.32,"end":2552.27,"speaker":"Adam Friended","text":"Well, what they do in science so is they throw the theory away. They say, okay, we need a new theory. Yeah."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":2552.27,"end":2553.67,"speaker":"Jonathan Pageau","text":"You need a theory which is more."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":2553.67,"end":2556.15,"speaker":"Adam Friended","text":"Explains these facts better. These new facts."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":2556.15,"end":2556.63,"speaker":"Jonathan Pageau","text":"Exactly."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":2556.63,"end":2557.03,"speaker":"Adam Friended","text":"Yeah."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":2557.03,"end":2574.15,"speaker":"Jonathan Pageau","text":"And so that. But when the theory and the facts are together and there's a balance between the unitive capacity that the theory offers and the variation at the bottom, that's love."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":2576.31,"end":2579.11,"speaker":"Adam Friended","text":"And then you go to something that's completely subjective."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":2579.58,"end":2582.66,"speaker":"Jonathan Pageau","text":"A completely not subjective. How is love subjective?"}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":2582.66,"end":2589.66,"speaker":"Adam Friended","text":"Well, there's different. Different types of love. There's like, loves. Love that you have for your family, and then there's love that you have for, like, your wife, which is."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":2589.66,"end":2593.42,"speaker":"Jonathan Pageau","text":"Well, let's. Let's use. Let's use the Christian agape love."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":2593.42,"end":2722.46,"speaker":"Adam Friended","text":"There's love that you have for your brother, there's love that you have for your friends. I don't disagree on the love thing, but there's a specific aspect of the love in Christianity. One of the reasons why I think Christianity has dominated the world and has so many adherents and so many people. I mean, going back to the example that I have of those 10 tribes with the 10 guys with a superior ethical system that could beat 100 guys. That ethical system of Christianity is spread around the world because it's so incredibly useful, especially in modern times. One of the hardest things to do in society is to foster an attitude of forgiveness. Forgiveness makes the modern world possible. Like, a lot of accidents happen, a lot of terrible things go on. If people aren't able to let go of those terrible things, they can consume a lot of their resources, a lot of their family resources, a lot of their individual resources, a lot of their tribes resources. Like, we have a lot of contention going on in politics and whatnot. Until somebody has the capacity to step up and say, okay, let's start over. I'm going to forgive everything that's happened up until then, and I encourage you to do the same. Let's move forward with a fresh slate. Like, things can go off the rails. This is how genocides happen, right? Things spin in the wrong direction. But the center of the Christian narrative is a dude on the cross doing this grave act to forgive the world for all of the injustice in it. So, I mean, that is a powerful idea, and it definitely plays into the love thing that you're talking about. But it's more specific than that because it does take an extreme type of love to forgive your enemies. It's easy to love your love your neighbor, love your family, love your friends, but to love the guy across the street, that's been a pain in your ass, like, as long as you've lived there. That's an extreme type of love. And I think the."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":2724.3,"end":2808.04,"speaker":"Jonathan Pageau","text":"Christian narrative, the love your enemy thing, it's important to understand it, is that one of the problems of reality is that these hierarchies, let's say the hierarchies of tribalism, the hierarchies of identity, they're inevitable. You can't avoid them. They have to exist or else the world stops to exist. The world ceases to exist. And so how do you deal with it? And so a lot of the Christian answers are something like that, which is love your enemy. And so love your enemy doesn't mean he's not your enemy. It's not saying this person's not your enemy, saying this person is your enemy. But you have to find it in yourself. And you could still defend yourself actually, like in terms of Christian understanding, in terms of a country, like no Christian country would ever say you need to let yourself get invaded by other countries. But the idea is you need to also be able to continue to see the humanity of even the person that's attacking you and to see that they share something in common with you, even though they are your enemy. Those are the kinds of answers that Christianity gives which are based on this finding a balance between the unity and multiplicity, this finding this space where you have the best relationship between the tribal aspect and also this openness towards the outside. All of this manifests itself in the incarnation."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":2808.84,"end":2864.14,"speaker":"Adam Friended","text":"So you said one thing also in your previous talk that I didn't quite understand because the argument that you seem to be making is, which I completely agree with. The only way that you can really change a system or a group or an identity or a community is from within. And the implication that you made was really you need to join Christianity and help change Christianity from within. But that argument applies to any group. I completely agree with you that the only people who are going to listen to you are people within your tribe. Other people will tend to dismiss you. But until you. I mean that that attitude is also applies to communism, which I wouldn't imply. I wouldn't advise anyone to join the communist community and improve it from within. So."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":2864.14,"end":2867.66,"speaker":"Jonathan Pageau","text":"Yeah, well, communism is, Is deficient at the outset. It's."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":2867.66,"end":2868.98,"speaker":"Adam Friended","text":"Yeah, it's a bad ethical tactic."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":2868.98,"end":2878.38,"speaker":"Jonathan Pageau","text":"It's the same at all. Yeah, like trying to put communism on the same level as traditional religious systems is just really. It's. It's really hogwash. It's just not. It's. It really isn't."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":2879.26,"end":2901.98,"speaker":"Adam Friended","text":"But do you do understand, we're in agreement though, that you can conceptualize religion as. As a thing that people orient around and communism is a thing that people orient around and therefore can be conceptualized as like a Durkheimian view of religion can be conceptualized as a religion. It's like social justice can be conceptualized as a religion."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":2901.98,"end":2909.26,"speaker":"Jonathan Pageau","text":"Well, everything can become a religion. Money can become a. That's why we have the idea of idolatry in Christianity."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":2914.38,"end":2940.85,"speaker":"Adam Friended","text":"Specifically. I'm talking about a goal or a cause that a community orients itself around. So making money. I don't know that money itself can become a religion, but I would conceptualize any corporation that, you know Works together to make money by doing some service or product could be conceptualized as a religion, not necessarily."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":2940.85,"end":2975.17,"speaker":"Jonathan Pageau","text":"You could understand that the God of, the God of, of, of our system is money, like, or mammon. And the God of the communist system is this weird equality thing. And so it's like they worship equality and so, and, and then they want to make the world in the image of equality. And it's actually probably worse than the other one because it obviously itself destroys in just a few generations. Like communism doesn't, just doesn't have legs as soon as you put it together."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":2975.41,"end":2994.61,"speaker":"Adam Friended","text":"I don't want to get self destruct. I don't want to get sidetracked on communism because I could very easily. But the, the I, the argument about, the argument that you're making, I didn't understand. And I think, think other people. If I didn't understand it, other people didn't understand it. So maybe you could make it clear. What, like what exactly are you advocating for?"}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":2995.09,"end":3028.02,"speaker":"Jonathan Pageau","text":"You have to understand it in the general context of what I said I did. Wasn't able to communicate properly, which is that I have a cosmic mythological frame in which I exist and participate and I live in. Now you're standing somewhere and you're telling me there are aspects of your mythological, your aspects of what you're doing which is wrong. And my question is, okay, I'm saying."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":3028.02,"end":3028.58,"speaker":"Adam Friended","text":"That about."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":3030.42,"end":3045.34,"speaker":"Jonathan Pageau","text":"The critique of the new atheist, let's say the critique of the atheist type, which is that this practice of Christianity is wrong because it's factually incorrect. Yeah, well, it's not, it's not about prescriptions are not factual descriptions."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":3045.34,"end":3074.07,"speaker":"Adam Friended","text":"Well, no, but I'm just saying that's what their critique would be. Their critique would be you believe untrue things. Believing untrue things is dangerous because the next thing you know you're a suicide bomber. Like that's basically their argument. No, am I wrong? I mean that's basically their argument. They're like, if you could be tricked. I'm like, everyone believes untrue things. Like you can't get out of bed without believing untrue things because like there's things that you don't have the facts on."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":3074.71,"end":3097.03,"speaker":"Jonathan Pageau","text":"And there's also. This is, the thing is that this is what I mean. We're getting sidetracked again. But there are, this is going to be hard for people to understand, which is that there are truths which are more immediate to you than scientific truths. Scientific truths, I agree, are actually abstractions most of the time."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":3097.35,"end":3099.59,"speaker":"Adam Friended","text":"Are you a fan of Donald Hoffman, do you?"}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":3100.07,"end":3100.87,"speaker":"Jonathan Pageau","text":"Yeah. Okay."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":3100.87,"end":3112.91,"speaker":"Adam Friended","text":"Yeah, I'm a huge Donald Hoffman fan, so. And Donald Hoffman and Vervaeke are really going at the same kind of ideas from different perspectives. Vervaeke is more on the philosophical side and Donald Hoffman's more on the scientific side, so."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":3112.91,"end":3199.71,"speaker":"Jonathan Pageau","text":"But I think Donald Hoffman makes a mistake. He makes a mistake in his original premise, which is fine because he's a scientist, but he makes a mistake in his original premise, which is that we experience illusions. And there is this other thing behind which is more true than what we experience, but we can't experience it. And I'm like, okay, I don't know. Why don't you posit your experience as the first frame and then the rest as secondary? So the experience that we have, all our meaning is made out of it. All our meaning is made out of that experience. And so I'm not saying that scientific truths are untrue. Of course they're true. But they're secondary to that first experience. Like, you don't experience H2O, you drink, you experience wet, you experience cold. These are the first categories, and they're not subjective. They're personal because they're human experiences. But everybody has. It's a universal personal experience. But you don't experience molecules, you don't experience atoms, you don't experience the solar system. All of these things are abstractions from your experience. And they're useful and they're valuable, but they come after. They come after the first experience."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":3200.03,"end":3218.74,"speaker":"Adam Friended","text":"Well, Donald Hoffman would say, yes, it's all experience. So I don't. I don't disagree with you there. The. Just to bring it back to the Christianity thing. I. Do you believe the world would be a better place if everyone was Christian? Is that. Is that your position or."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":3219.22,"end":3222.62,"speaker":"Jonathan Pageau","text":"Well, if I believe that the world would be a better place if everyone was Christian."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":3222.62,"end":3229.38,"speaker":"Adam Friended","text":"Well, that's kind of the implication when you say, you know, I have this frame of reference, we have the best way of looking at the world."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":3229.63,"end":3290.37,"speaker":"Jonathan Pageau","text":"What I mean is that I have this frame and I have ways of knowing what's good inside of it, and I have these ways of making it better. And you standing in a place that I don't know where you are, let's say, in my discussion with rationality rules. He's standing in a place that I don't know where he is. He's talking to me about a good that he won't define yet. He's telling me that I should improve my thing. It's like, I don't know what you want from me, like, where should I go? Where. Tell me where to stand, Tell me where to. Tell me what's your frame? And then. And help me understand it so that I can evaluate. But for now, like, this seems way superior to whatever it is you're offering me because you're offering me something which is vague and imprecise and a good. That I don't. That I can't. That I can't really identify. And so it's like, this is where I am. I'm speaking out of. I know what I'm speaking out of. Like, I know what my frame is, but I don't think you do."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":3290.69,"end":3317.19,"speaker":"Adam Friended","text":"The major contention that came out of the dialogue there was over the LGBT stuff. He was basically saying, you have an ethical package that 5% of the population can't use because they're homosexual, and the ethical package castigates their entire lifestyle. So the ethical package is unavailable to them."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":3318.31,"end":3323.95,"speaker":"Jonathan Pageau","text":"Yeah, I know. I think that my difficulty with that is several fold."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":3323.95,"end":3331.67,"speaker":"Adam Friended","text":"Well, he would say change your ethical package. He would say make your ethical package inclusive of homosexual lifestyles. And we're having a conversation."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":3332.15,"end":3332.71,"speaker":"Jonathan Pageau","text":"What about?"}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":3333.19,"end":3341.69,"speaker":"Adam Friended","text":"Well, no, he wouldn't say that because obviously the truth about reality lifestyles. See, that's just. That's just. What about ism? The."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":3341.69,"end":3343.17,"speaker":"Jonathan Pageau","text":"No, it's not what about ism."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":3343.17,"end":3344.77,"speaker":"Adam Friended","text":"We just literally said what about."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":3345.33,"end":3351.69,"speaker":"Jonathan Pageau","text":"No, but what I mean is that if you have to give me a reason why to change it, I don't."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":3351.69,"end":3354.33,"speaker":"Adam Friended","text":"Disagree that 20 years from now, 20."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":3354.33,"end":3365.19,"speaker":"Jonathan Pageau","text":"Years from now, there's amount of patterns of behavior that exist. And those indefinite amounts of patterns of behavior can also say, why don't you accept my behavior?"}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":3365.27,"end":3504.87,"speaker":"Adam Friended","text":"Well, my understanding of the world is there are different strokes for different folks. Different people will utilize different ethical packages more successfully. I think we're in a better situation if we have 10, 15% of the population that are atheist, scientific types. Why are you laughing? I'm dead serious. Like, if we have 10, 15% of the population, when you have a football team, you have an offense and a defense, right? You have different positions for different people. Like, it doesn't. You can't form a football team if you have, you know, everyone is a quarterback, that team is not going to be successful. But I see a lot of our ancient software is, if we don't go kill the tribe over the hill, they're going to come and kill us. Therefore, we're in a safer world if everybody is the same as us. That's ancient, ancient primal programming. And a lot of the disagreements that I see online are people just advocating for their tribe, saying, I would feel much safer in a world where everyone was Christian, or I would feel much safer in a world where everyone was lgbt, or I would feel much safer in a world where every. No one believed in. In religion because they might become a suicide bomber and end up on the bus that I'm on. This is really the dialogue that we're having, but really the system that we need to work on. And I think Bret Weinstein is brilliant in illuminating this fact. The system that we need to work on is a system that interfaces between the ethical packages. Because in certain ethical packages, you have kill all apostates, kill anyone who's not inside our group. That's a bad thing, because that ethical package becomes caustic to the rest of the ethical packages. And it's helpful to have 10 to 15% of the population, that's atheist, scientific types, working on medical advancements that everybody benefits from. They don't necessarily believe in evolution, but when they show up at the hospital, they have help. There's help for them. There's help for them and their family. So what is your position on that multiplicity of ethical packages?"}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":3505.75,"end":3538.01,"speaker":"Jonathan Pageau","text":"So this is the thing. This is also, in terms of, first of all, like I said, one of the difficulties that religion is not first and foremost an ethical. An ethical package. It is a communal package. It's a package which makes us know that we are in communion with each other, that we have things in common that help us to see each other as together. You could see it that way."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":3538.49,"end":3544.13,"speaker":"Adam Friended","text":"Everything that you're saying goes along with my beliefs. Maybe the term ethical package is incorrect, but."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":3544.13,"end":3547.39,"speaker":"Jonathan Pageau","text":"And in that, there's a hierarchy of practices."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":3547.63,"end":3548.59,"speaker":"Adam Friended","text":"Sure. Yeah."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":3548.59,"end":3562.99,"speaker":"Jonathan Pageau","text":"And so there are things which are high up on the normative ladder, and there are things which are low on the normative ladder, and there are things which are considered sinful. Now, the thing about the sinful part is that everybody sins."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":3564.03,"end":3564.47,"speaker":"Adam Friended","text":"Yeah."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":3564.47,"end":3589.96,"speaker":"Jonathan Pageau","text":"It's not like there's a particular type of person that sins and everybody else doesn't. Sin is just a normal part of reality. And so the idea that certain behaviors are prescribed as sinful doesn't mean that they don't exist because everybody sins. And that's one of the aspects of Christianity is to say, don't judge your name, don't judge the other. Because you also have that in you."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":3589.96,"end":3599.36,"speaker":"Adam Friended","text":"The way that you're framing this is completely offensive to the atheist. I want you to know, because you're basically, I'm asking you about the."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":3599.36,"end":3606.76,"speaker":"Jonathan Pageau","text":"It's so much better though, because you don't have the totalitarian movement move in what I'm saying there's no totalitarian move because you can't say."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":3607,"end":3620.84,"speaker":"Adam Friended","text":"So are you saying now that the atheists, the atheists, like we're comparing a Christian. I'm talking about the peaceful cohabitation of the atheist tribe and the Christian tribe. And you're saying the atheist tribe is always going to become totalitarian?"}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":3620.84,"end":3621.48,"speaker":"Jonathan Pageau","text":"No, not always."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":3623.24,"end":3625.88,"speaker":"Adam Friended","text":"Just 40% of the time, 50% of the time."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":3625.88,"end":3661.05,"speaker":"Jonathan Pageau","text":"No, no, no. Well, what I mean is that the idea of having a normal hierarchy of norm, normativity is the way that you kind of deal with this stuff. And so, and so the idea is that there. So let's say in terms of sexuality, the Christian sexuality, traditional Christian sexuality, is radical. Like it is very radical. It says all sexuality, even your thoughts, has to be geared towards a monogamous relationship, which is in the pattern of procreation. Yeah, that's a great."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":3661.61,"end":3664.65,"speaker":"Adam Friended","text":"How can you not see the evolutionary advantage of that?"}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":3664.65,"end":3704.79,"speaker":"Jonathan Pageau","text":"Right, exactly. And also everybody sins, everybody falls short of that. Everybody. No one doesn't fall short of that. And so that's the way that Christians have approached it. And so the idea that in Christian societies there are always behaviors which go outside of that, that goal is just normal. It's just going to happen. So homosexual behavior has always been part of Christianity. Adultery has always been part of Christianity. Masturbation has always been part of Christianity. It was prescribed, but it was also understood. Everybody is tainted by it."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":3704.79,"end":3713.78,"speaker":"Adam Friended","text":"Everybody framing it, though as sin, as something that is a. Missing the mark at framing it as sin, though, is offensive to people who don't view it as sin."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":3713.78,"end":3724.38,"speaker":"Jonathan Pageau","text":"They have a different ethical package, the mark of sexuality. Well, I listen, in an evolutionary term, what's the mark? When do you hit the bullseye when."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":3724.38,"end":3726.74,"speaker":"Adam Friended","text":"You, when you read grandchildren?"}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":3726.9,"end":3727.58,"speaker":"Jonathan Pageau","text":"There you go."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":3727.58,"end":3727.98,"speaker":"Adam Friended","text":"Yeah."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":3727.98,"end":3731.26,"speaker":"Jonathan Pageau","text":"So missing the mark means going aside from that."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":3731.26,"end":3759.72,"speaker":"Adam Friended","text":"But they would, the, they would argue that they live in a society where it's not necessary for every single person to be churning out and that they might live a more meaningful life to them if they forego having children and have a same sex marriage or even not have a same sex marriage, but screw around with every single person that they come in contact with. Like, maybe that's their beautiful life, their thriving life. Christianity."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":3759.72,"end":3763.08,"speaker":"Jonathan Pageau","text":"There always have been people who do that. It's not like, yeah, but they are."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":3763.08,"end":3766.62,"speaker":"Adam Friended","text":"Welcome inside the Christian. They aren't welcome inside the Christian church, though."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":3767.89,"end":3770.85,"speaker":"Jonathan Pageau","text":"You think prostitutes don't go to communion Once a year. Well."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":3773.25,"end":3775.81,"speaker":"Adam Friended","text":"We'Re getting away from my point here. My point."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":3776.05,"end":3791.13,"speaker":"Jonathan Pageau","text":"It's important. It's a really important. It's because we're so used to like weird totalitarian systems where we think that everything which is illegal, there's going to be a cop at your door putting you in jail. But in normal societies, that's not how it works."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":3791.13,"end":3791.53,"speaker":"Adam Friended","text":"Do you."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":3791.53,"end":3798.73,"speaker":"Jonathan Pageau","text":"The fact that they're prescribed actions doesn't mean that they are all enforced through like force of police state."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":3799.05,"end":3826.22,"speaker":"Adam Friended","text":"If a, if a, if a person wants to live a LGBT lifestyle, have a same sex marriage, maybe adopt kids, even if they become a part of Christianity, I don't necessarily think it's going to be a comfortable fit for them. I mean, I have friends that are gay and Catholic and just love it. So I mean, it's definitely not without the realm of, outside the realm of possibility. I've seen it happen."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":3826.86,"end":3849.09,"speaker":"Jonathan Pageau","text":"But it becomes a private question. It becomes a question of private life and a private relationship with your priest, with your confessor, with, you know, it becomes something which is not in the normative prescription of the system. But it, like I said, we all have those. He has those things that aren't normative."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":3849.32,"end":3867.88,"speaker":"Adam Friended","text":"It has entered the public sphere though, when you have laws against gay marriage being funded by the Mormon Church. So it definitely does enter the public space in ways that are not necessarily good in a utilitarian way for everyone."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":3868.92,"end":3872.84,"speaker":"Jonathan Pageau","text":"Well, that depends. What exactly is the purpose of gay marriage?"}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":3873.8,"end":3881.3,"speaker":"Adam Friended","text":"The purpose of gay marriage is for people, for freedom, liberty, people to be able to pursue the lifestyle that they want. The whole reason that we're able, able."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":3881.78,"end":3886.74,"speaker":"Jonathan Pageau","text":"To have the purpose of marriage. Like what, what is, what was the traditional purpose of marriage?"}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":3887.14,"end":3898.58,"speaker":"Adam Friended","text":"The body system like? Well, in the model, no, the traditional purpose was to have kids, but it's changed over time. Now it's more the buddy system. It's so you have someone that you can share your life with."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":3900.26,"end":3905.7,"speaker":"Jonathan Pageau","text":"So it's like. Yeah, so it's basically living together with a contract. Is that."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":3905.94,"end":3913.41,"speaker":"Adam Friended","text":"Yeah, sure, yeah, yeah, contract. You know, you're not gonna, you're not gonna leave me. It's the buddy system."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":3915.01,"end":3915.41,"speaker":"Jonathan Pageau","text":"So."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":3916.53,"end":3952.22,"speaker":"Adam Friended","text":"But I mean, you understand that marriage can, can function in different ways as well, right? Christianity has a specific way of defining marriage that works for Christianity. That way of defining marriage is not going to work for everyone. And what I'm saying is it's better to have a world where we have different groups that pursue different avenues of thriving and those groups have a system for interacting with one another. That doesn't end up in genocide."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":3953.9,"end":3960.97,"speaker":"Jonathan Pageau","text":"I agree with the last part in terms of not ending up in genocide. Right, but you also have to be careful not to, like."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":3962.09,"end":3963.53,"speaker":"Adam Friended","text":"I mean, I'm not convinced."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":3963.53,"end":3970.33,"speaker":"Jonathan Pageau","text":"I'm not convinced diverse. That it's like chocolate pudding and then someone's going to come in with a knife and cut you up."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":3970.49,"end":3981.93,"speaker":"Adam Friended","text":"I'm not convinced that if the shoe was on the other foot and the LGBT community had the numbers that they wouldn't genocide the Christian community. I'm not convinced that that wouldn't happen."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":3982.97,"end":3984.98,"speaker":"Jonathan Pageau","text":"Yeah, well, they can't have the numbers."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":3984.98,"end":3999.3,"speaker":"Adam Friended","text":"They can't have the numbers because the LGBT is like 5% of the population. Yeah, no, but I'm saying, like, the. The LGBT community is worried about the Christians genociding them. Like, they basically."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":4000.02,"end":4004.34,"speaker":"Jonathan Pageau","text":"But they have a. They have total. They have reason to. My goodness."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":4004.58,"end":4005.94,"speaker":"Adam Friended","text":"Okay, so we're in agreement."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":4005.94,"end":4025.51,"speaker":"Jonathan Pageau","text":"I totally agree. Look, I think that a lot of the stuff that we're seeing now is because of an excess of insane regulation that happened in the 1950s and the early 20th century. Like castrating. Chemically castrating people and putting people in jail and all this insane stuff that happened in terms of attacking people's lifestyles."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":4025.51,"end":4025.95,"speaker":"Adam Friended","text":"Yes, exactly."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":4025.95,"end":4107.12,"speaker":"Jonathan Pageau","text":"I think that that's crazy. I think that that is what led to the movement. And so I have a lot of sympathy for what happened. Like, I totally understand. I think that in a normal, traditional world, there's a lot more flexibility for people to live out their idiosyncrasies. You know, and there isn't this, like, weird police state enforcement of people's private lives. Like, you know, just. There's. There. There's room. Like I said, traditional societies always had prostitutes. Like, prostitution is just part of. You can prescribe it and then also not enforce. Not enforce it. It's just happens. It is part of society. You say that's taboo, but it's still going to be there. And that's the same with all kinds of other behaviors which have always existed from all time. And so I think that the modern clampdown on the pathologization of homosexual behavior, which happened actually with scientific reasons, led to a crazy backlash. It was actually more the scientists that ended up castrating homosexual than the Christians. The behavioral. All the behavioral psychologists, all of these people who said that it was the disease that needed to be cured and needed to be. You know, that's a modern phenomena. It's not an ancient phenomena."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":4107.36,"end":4162.99,"speaker":"Adam Friended","text":"The system, the thing that I'm talking about, the system for interaction between systems. I think Christianity has an advantage on developing that system because it has the one ethic that is important that must be in this system to system management ethics package, basically. And that is the love thy neighbor or love thy enemy thing. Because if there's any conflict between those tribes, like the tribalism is so embedded in our psychology that that tribalist program takes over so quickly that if you don't have that forgive the enemy ethic involved in your, in your ethics package, there's no way that you can stop that. Like, we're down the road."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":4163.39,"end":4163.91,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":4163.91,"end":4178.62,"speaker":"Adam Friended","text":"To the next genocide. So this is the, these are the things that I think, you know, Brett Weinstein is talking about a lot. I think rationality Rules was talking about in your conversation with them, but not necessarily as specifically as I'm talking about them."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":4179.02,"end":4185.42,"speaker":"Jonathan Pageau","text":"Yeah, but you need, you would need to. So if, if you want to create something which navigates."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":4185.42,"end":4188.3,"speaker":"Adam Friended","text":"Super system. Let's call it the super system."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":4188.62,"end":4199.22,"speaker":"Jonathan Pageau","text":"That the problem with the super system is that it's, it's being brought about by people who don't. Aren't aware that, that, that the system is not arbitrary."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":4199.22,"end":4201.38,"speaker":"Adam Friended","text":"No, nobody's driving the ship now, John."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":4201.38,"end":4222.4,"speaker":"Jonathan Pageau","text":"Exactly. And so, and so I, I'm afraid of anybody who wants to place themselves above the systems. Like, I'm really afraid of that because they have a blind, they have a blind side. Like they, they're blinded by, by something and that they think that they can stand outside."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":4222.72,"end":4249.64,"speaker":"Adam Friended","text":"We definitely want the right. We want the right people in charge of it. I totally agree with you. Well, actually, it's better if they, if we don't have anyone in charge of it. I believe in institutions. Like, we need to build institutions that allow terrible people that basically force terrible people to do the right thing. We want an institution that's strong enough that even if terrible people grab the reins, there's not too much damage that they can do. Building institutions is the important thing."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":4249.64,"end":4261.97,"speaker":"Jonathan Pageau","text":"Well, for sure. The US System at least seems like that's what it was made for. It seems to have lasted for a while. It might be stretched to its own."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":4261.97,"end":4267.01,"speaker":"Adam Friended","text":"Don't talk like that. Don't talk like don't. We're doing just fine down here."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":4267.01,"end":4273.73,"speaker":"Jonathan Pageau","text":"You're doing just fine. Okay, that's good. Sorry, I'd have to stop paying attention to you, to what's being said on Twitter, that's for sure."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":4273.73,"end":4333.76,"speaker":"Adam Friended","text":"I only have about 15. 15 or 20 minutes left, but I want to talk about something before we go, because you're in a very, a very famous video With Jordan Peterson. And is it. I think it's Brett Weinstein where you're talking, where Brett Weinstein makes an argument and you guys never really get back to the argument. I don't think Brett Weinstein even finishes the argument. But the argument is that the argument is what we're talking about. Science is the super system because science is the way that we mitigate between the other systems. I don't, I don't know that I totally agree with that. Science is a component of the super. Super system, but the super system has to be, has to have a moral component as well. And we both know where science falls down. Like science is not prescriptive, but prescriptive. Yeah, exactly. But the super system needs to be proscriptive. Like, obviously, it has to have. All of our ethical packages are proscriptive. That's the whole point of the ethical package."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":4334.08,"end":4338.81,"speaker":"Jonathan Pageau","text":"Yeah, it has to have. It has to be able to identify the good towards which it's aiming."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":4338.81,"end":4360.77,"speaker":"Adam Friended","text":"Yeah. So you. So in that, in that talk, just to sum it up, they were. You're, you're talking about the various systems. Christianity is one of the systems. But Brett Weinstein makes the argument that science is the, is the highest, the top of the hierarchy. And I know, like, you're. One of your things is hierarchy. So I could see. Oh, he's getting triggered here. He doesn't like this."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":4361.97,"end":4366.39,"speaker":"Jonathan Pageau","text":"It has to be. So I would think about this a lot. I think that a good way to understand science."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":4367.35,"end":4375.11,"speaker":"Adam Friended","text":"Let's give the background a little more for people who haven't necessarily heard it all. So you were there. That's why I'm. Do you. What, what exactly happened there?"}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":4375.59,"end":4427.3,"speaker":"Jonathan Pageau","text":"Well, it was mostly about, it was mostly about this, this idea of the, the problem. Because I did, I did a video on the, the, the idea of metaphorical truth because he made. Brett made a video on metaphorical truth where he talked about how he was saying that science is the higher truth, science is above the other truth. I was trying to point into him the performative contradiction, which is that he was using metaphor to make science higher. And I was joking in the video. I said, I looked at it on the top shelf, my room, and I couldn't find science. Like, it just wasn't there. And so it's like if I stack science on top of a pile of other things, it's like if you're, if you go down into the materialist scientific frame, this idea of a hierarchy just doesn't make any sense."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":4427.3,"end":4506.21,"speaker":"Adam Friended","text":"So your, your argument is that if you're going to make an argument that science is higher than metaphor. You're literally using a metaphor to make that argument. Yeah, I mean, which makes sense. So you're saying metaphors. Are you saying. But I don't necessarily understand because I understand Brett's argument. Brett's argument is there are all these ethical systems. They all believe different and contradictory things. Science is the only one that can discern truth among those things in a materialist way. Therefore, if truth is really what you're looking for, because there's also well being. Like, one system may be terrible at truth, but they are very good at well being. Like, the people who live there are very happy. None of them believe anything in the real world, but they're so happy, they're producing kids. They're thriving over time. So one of the things that I'm always talking about is one of the ironies of the world is where truth and well being often diverge. So the antitheist community, they want to see truth and well being be on the same page, but it's. That's not necessarily how the world works. So. But you understand the argument that Brett is making. You're just making."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":4507.33,"end":4508.53,"speaker":"Jonathan Pageau","text":"I definitely disagree."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":4508.69,"end":4510.53,"speaker":"Adam Friended","text":"Okay, so how do you disagree? That's it. That's."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":4510.53,"end":4528.83,"speaker":"Jonathan Pageau","text":"Well, I disagree. Because the jump between different levels of all reality is not a scientific jump. There you cannot, you have to take a category for granted before you analyze it. The analysis of a category will not."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":4528.83,"end":4533.51,"speaker":"Adam Friended","text":"Give you the category, but you analyze it. How? Because Brett would say science."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":4533.51,"end":4572.03,"speaker":"Jonathan Pageau","text":"Science is taking bounded. Taking bounded phenomena and then giving a description which is good enough so that maybe you can predict what's going to happen. Right. And so you bound a phenomenon and then you describe it in a way that is so good that then you can actually predict other versions of it or how it's going to act, let's say, how it's going to continue. So that is what scientific things do. But the category of a car is not a scientific category. You need the category first before you analyze the car. You need the category of a mountain before you analyze a mountain."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":4572.75,"end":4573.31,"speaker":"Adam Friended","text":"Okay."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":4573.47,"end":4578.73,"speaker":"Jonathan Pageau","text":"The world is fluid. Like, the boundaries between phenomena are permeable, but they're not."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":4578.73,"end":4581.41,"speaker":"Adam Friended","text":"There are different ways to analyze a category, though."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":4581.73,"end":4582.21,"speaker":"Jonathan Pageau","text":"Sorry."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":4582.21,"end":4584.69,"speaker":"Adam Friended","text":"There are different ways to analyze a category."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":4585.17,"end":4595.25,"speaker":"Jonathan Pageau","text":"Right. But the science, all it does is analyze the categories for truth. For truth categories are not scientific themselves."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":4595.41,"end":4605.63,"speaker":"Adam Friended","text":"Science only. And science only analyzes for materialist truth claims. That's all it analyzes for. For."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":4605.63,"end":4608.39,"speaker":"Jonathan Pageau","text":"It analyzes for factuality."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":4608.47,"end":4608.99,"speaker":"Adam Friended","text":"Yes."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":4608.99,"end":4609.31,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":4609.31,"end":4609.71,"speaker":"Adam Friended","text":"Yeah."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":4609.71,"end":4638.85,"speaker":"Jonathan Pageau","text":"But it doesn't give you even the categories. It's like a river is not a river is a category of meaning. So if you're going to study what lives in a river, a species, it's like, why do we think that species. We have arbitrary, not arbitrary. We have meaningful ways of differentiating species, but those are not in the, you can't find them in the actual analysis of the category."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":4639.33,"end":4674.38,"speaker":"Adam Friended","text":"What would be your rebuttal? What would be your argument or your rebuttal to Brett's argument? So if Brett is saying that science is the only way that you can study how the study the truth claims between the various ethical systems or religions, whatever you want to call them, and he's saying that's why, that's the, that is the defining factor of science over the different systems. What you're, and you're saying, no, science is. You're saying what is, what is the."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":4674.38,"end":4677.62,"speaker":"Jonathan Pageau","text":"Highest is at the bottom of the hierarchy, but in a good way, not."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":4677.62,"end":4678.46,"speaker":"Adam Friended","text":"In a bad way, at the bottom."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":4678.46,"end":4698.16,"speaker":"Jonathan Pageau","text":"Of the hierarchy, in a very good way. Because what it does is it helps you understand how things work. Right? And so, for example, like the top, let's say a car, at the top of interacting with the car is why does the car exist? Like, it's. To go, you need to drive. Transportation is higher in the hierarchy."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":4698.24,"end":4701.52,"speaker":"Adam Friended","text":"Transportation is higher than understanding how it works."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":4702.24,"end":4714.42,"speaker":"Jonathan Pageau","text":"Driving the car is higher in the hierarchy than understanding how it works. If you don't understand how it works, obviously, you're going to have a problem driving it. But the reason why you even want to understand how the car works is because you have a goal, you have a. You haven't."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":4715.86,"end":4717.74,"speaker":"Adam Friended","text":"Yeah, utility. So what."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":4717.74,"end":4746.59,"speaker":"Jonathan Pageau","text":"And so that's, that's what I think is higher. It's just inevitably higher on any hierarchy of meaning has to be purpose and goal and, and the frame of, you know, the, the category itself that you're then using science to, to, to decipher. But those categories are meaning categories. They're not, they're not, you know, you, you don't. This is the problem of emergence. You can't get to the higher level being just by analyzing its parts."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":4748.19,"end":4816.91,"speaker":"Adam Friended","text":"Lay out the hierarchy here with. Well, Christianity is a system of interacting between people, an identity, like you say, a way that you're going to interact with the world and with other people in Christianity and other people outside of Christianity. Like, there's rules in Christianity for that as well. Scientology is a different way of interacting with people. And, well, it's, it's just one of the packages out There. And science is a. Is a different way of interacting with people and. And the world. There is a hierarchy there that Bret Weinstein would say science is at the top of the hierarchy because science can explain the workings of Christianity and of Scientology in a way that Scientology cannot explain the workings of science and Christianity. If this simple hierarchy of three things where you're saying science would be at the bottom of that hierarchy and Christianity would be above it. But where does Scientology fit in that hierarchy?"}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":4817.31,"end":4822.08,"speaker":"Jonathan Pageau","text":"The thing that's above the hierarchy is the logos. It's not Christianity."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":4822.08,"end":4831.28,"speaker":"Adam Friended","text":"Okay, so that's what I want to get at right there. So what's above? What is above all? Science, Scientology, and Christianity. What is that thing?"}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":4831.68,"end":4865.32,"speaker":"Jonathan Pageau","text":"Well, the divine logos, like the divine logos is the. Is the reason and origin and end of things and those. Those that. You could see it as the highest version, but that scales down all the way down to anything you can identify. And so every category, in terms of every category, has an unitive aspect to it. Right. Has something which makes you know that it's one."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":4865.56,"end":4865.96,"speaker":"Adam Friended","text":"Right."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":4865.96,"end":4867.4,"speaker":"Jonathan Pageau","text":"Even though it has parts."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":4868.12,"end":4868.76,"speaker":"Adam Friended","text":"Okay."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":4868.92,"end":4872,"speaker":"Jonathan Pageau","text":"Okay. And so I know that that's hard. It's so hard."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":4872,"end":4876.99,"speaker":"Adam Friended","text":"I know we have to dumb it down to atheist speak here. You have to give me the materialist version of it."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":4877.06,"end":4877.38,"speaker":"Jonathan Pageau","text":"Okay."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":4877.38,"end":4879.78,"speaker":"Adam Friended","text":"Because I understand how metaphors work."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":4880.42,"end":4895.86,"speaker":"Jonathan Pageau","text":"It's not a metaphor. It's not a metaphor in the simple sense. So let's say it's harder for smaller things because people. Because they see them physically together. So a chair is a good example. So a chair has parts, right?"}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":4896.5,"end":4896.98,"speaker":"Adam Friended","text":"Yeah."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":4897.38,"end":4899.02,"speaker":"Jonathan Pageau","text":"And those parts also have parts."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":4899.02,"end":4900.98,"speaker":"Adam Friended","text":"Yeah, no, it's a conceptual category."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":4900.98,"end":4905.35,"speaker":"Jonathan Pageau","text":"Also have parts. So why do you think that a chair is one thing?"}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":4907.59,"end":4931.89,"speaker":"Adam Friended","text":"Well, it's based on the utility of the chair. Obviously, once a certain amount of matter coalesces in a way that it has a certain utility, we start categorizing it by that utility. You're talking to a Jordan Peterson fan here. Like, obviously, we want the drill for what it does. We want the hole that the drill puts in the wall. We don't care necessarily about the drill. It's about the utility."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":4932.13,"end":4951.57,"speaker":"Jonathan Pageau","text":"Right. And so that. That is not a scientific description. Right. The. The reason why something exists is not. Is not. Is not a. It's not a scientific description of that thing. You could. You could bring it into a scientific description of something above it, but not of the thing itself."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":4951.89,"end":4988.63,"speaker":"Adam Friended","text":"What is the. What is the utility in categorizing the world this way? Because Jordan Peterson connects this way of categorizing things to evolution. He says utility is what we're geared to look for. It's the same thing that Donald Hoffman is talking about. Donald Hoffman is saying we look at things by their evolutionary advantage. They're like a point system. So we don't look at them in a scientific way. Like, we don't look at the chair and say, you know, break it down to its parts. We look at it as something that we can use to sit on."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":4989.03,"end":5024.12,"speaker":"Jonathan Pageau","text":"Yeah, exactly. But then that scales up, like, way up in the sense that it's easy for a chair because a chair is physically. You can see it as physically together. But let's say the category of all chairs are not physically together. But. But all chairs share an identity. Like they are a body and they have a logos which is above the individual chairs. Right. And so that truth is higher than the analysis of what a chair is made of."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":5024.84,"end":5031.88,"speaker":"Adam Friended","text":"So you're saying what's at the top of the hierarchy is just the system that we categorize things by."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":5033.25,"end":5034.33,"speaker":"Jonathan Pageau","text":"It's the. It's the reason."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":5034.33,"end":5036.53,"speaker":"Adam Friended","text":"The ability to categorize things."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":5037.65,"end":5041.77,"speaker":"Jonathan Pageau","text":"Yeah, yeah, something like that. You could. I mean, I could. I could go that far."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":5041.77,"end":5044.45,"speaker":"Adam Friended","text":"The ability to see utility in things."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":5045.49,"end":5053.25,"speaker":"Jonathan Pageau","text":"Or the inevitability of seeing utility in things in the sense that that's one of the reasons why they appear to us as categories in the first place."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":5053.41,"end":5053.81,"speaker":"Adam Friended","text":"Right."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":5053.89,"end":5060.06,"speaker":"Jonathan Pageau","text":"Because. Because there is no. There is no neutral reason to posit categories."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":5062.14,"end":5089.67,"speaker":"Adam Friended","text":"Well, that's super interesting. But I mean, that is this thing that we do, that we turn objects into utility. Like, our people have said this for a long time, like humans. That's what separates us from other animals. Now we realize that other animals use tools all the time. I don't see how you can look at the elaborate nest birds make and think, oh, yeah, we're the only species that uses tools."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":5089.83,"end":5090.31,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":5090.31,"end":5091.39,"speaker":"Adam Friended","text":"So, but you're."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":5091.39,"end":5095.51,"speaker":"Jonathan Pageau","text":"I think logos. Logos definitely goes down into the chain of."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":5095.91,"end":5098.31,"speaker":"Adam Friended","text":"Specifically, what does logos mean? Specifically?"}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":5098.55,"end":5121.04,"speaker":"Jonathan Pageau","text":"It just means. It means the reason. Reason for things. And the reason for things appear in the way that they're ordered. So it has to do with reason in the sense that we understand. And so the. The. The order of something. So the order of something is bound up in its reason. Right. The order of the chair is bound up in the reason why the chair exists."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":5121.12,"end":5122,"speaker":"Adam Friended","text":"Correct? Yeah."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":5122,"end":5124,"speaker":"Jonathan Pageau","text":"The utility that it has in the world."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":5125.12,"end":5127.36,"speaker":"Adam Friended","text":"Man. We're making a utilitarian argument here."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":5127.36,"end":5143.67,"speaker":"Jonathan Pageau","text":"It's not a utilitarian argument in my vision. It's more like a Platonic argument because this scales up in reality because the thing, the problem with the utilitarian argument is that it's nonetheless posits a neutral reality."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":5144.63,"end":5151.67,"speaker":"Adam Friended","text":"Is there anything above the category system in the hierarchy?"}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":5151.83,"end":5152.31,"speaker":"Jonathan Pageau","text":"Yes."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":5152.47,"end":5156.07,"speaker":"Adam Friended","text":"Okay. Oh my God. Okay."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":5156.79,"end":5177.96,"speaker":"Jonathan Pageau","text":"That's what God does. God is beyond category. God is infinite. That's the reason why we say things like God is infinite or God is, is beyond all, name all definition. Because God is the darkness out of which the categories come from. The divine darkness is."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":5178.04,"end":5181.96,"speaker":"Adam Friended","text":"God creates the categories. God is the impetus behind the categories."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":5182.28,"end":5229.99,"speaker":"Jonathan Pageau","text":"The God creates the categories through the Logos. That's why we say in Christianity, we say, I believe in one God, the Father Almighty, creator of heaven and earth. And it says that he created all things through the sun, through the Logos. So God doesn't create directly because God is beyond all categories. And so in God there's a principle of manifestation which then manifests the categories. And so beyond everything. It's hard to talk about this stuff, man. It's hard to talk about this stuff. We don't have to talk about it at a level that. But I hope, like, like I know that now at this point, what we're talking about, people are going to say, okay, sky, daddy, fairy tall."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":5229.99,"end":5231.11,"speaker":"Adam Friended","text":"Exactly. Totally."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":5231.11,"end":5233.39,"speaker":"Jonathan Pageau","text":"No, you're on, you're on the right page, sadly."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":5233.79,"end":5245.55,"speaker":"Adam Friended","text":"It's good that you're. It is good, John, that you're self aware to know, to know this, because a lot of people aren't necessarily self aware. They don't even really know the other side's arguments. So they don't know what the other side is thinking."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":5246.19,"end":5257.19,"speaker":"Jonathan Pageau","text":"So think about it at the chair level. Let's go back to the chair. Right? So you have a chair. Right. This chair has an order. It has a way for you to recognize that it's a chair."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":5257.51,"end":5258.55,"speaker":"Adam Friended","text":"Yes, yeah, right."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":5258.55,"end":5262.31,"speaker":"Jonathan Pageau","text":"That that order is bound up in its purpose."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":5262.31,"end":5266.95,"speaker":"Adam Friended","text":"The way that, the way that you recognize though is in your head, it's not in the chair. Correct."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":5268.39,"end":5271.35,"speaker":"Jonathan Pageau","text":"What is the chair without the category?"}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":5271.43,"end":5275.42,"speaker":"Adam Friended","text":"Well, if you look at it like language, we come up with, what is."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":5275.42,"end":5282.74,"speaker":"Jonathan Pageau","text":"The chair without the category? It's just a bunch of parts. And then those parts are also made of parts. Just a quantum field without a category. Right."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":5282.74,"end":5294.9,"speaker":"Adam Friended","text":"But until somebody conceptualizes it as a chair and uses it for the utility. I mean, the category of chair is inside our heads. It's just. I mean, a rock could be a chair."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":5296.9,"end":5302.16,"speaker":"Jonathan Pageau","text":"Well, rock can function as a seating place. Not really a chair, but it could function as a thing to say."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":5302.16,"end":5307.84,"speaker":"Adam Friended","text":"Okay, so I thought you were talking More broadly, like something to sit on. Like anything to sit on."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":5307.84,"end":5340.49,"speaker":"Jonathan Pageau","text":"That's fine. It doesn't matter what the category is. Like it. There. There are hierarchies of categories, you know, and so they, they all. It's a dynamic hierarchy of categories. It's not just. They're not just one. One. And also objects can have several identities. They don't have just one. Right. And so you can. When do you. If you, if you take a rock and you throw it at someone, it's not the same. It's not the same thing as the rock you're sitting on. Are you even. It's physically the same. Are you familiar with transformation, which occurs when you pick the rock up and bash someone over the head?"}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":5340.49,"end":5348.93,"speaker":"Adam Friended","text":"Yeah, totally. The utility changes. Like it changes categories as you use it. Soon the rock's a hammer, soon the rock is a sling."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":5349.57,"end":5351.25,"speaker":"Jonathan Pageau","text":"It's totally possible for that to happen."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":5351.41,"end":5361.9,"speaker":"Adam Friended","text":"The. When you're. This comes off a bit like a presuppositionalist argument. Are you familiar with pre suppositionalists?"}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":5362.38,"end":5364.58,"speaker":"Jonathan Pageau","text":"No, I'm not sure they have this."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":5364.58,"end":5404.01,"speaker":"Adam Friended","text":"Argument and I'm not super familiar with it either. But their argument is that without a belief in God, logic doesn't exist. So therefore, if you're using logic, you're basically admitting that God exists, which I, I don't necessarily understand how they do the math on that one. But this comes off a little bit like that. Like, if you're using this category system that I would argue is just innate in human psychology, then you're admitting that a God exists because the category system literally comes from God. You're saying God is the top of the hierarchy in the category."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":5404.73,"end":5429.5,"speaker":"Jonathan Pageau","text":"It's not a mental game. It's an embodied experience. Experience. It's not as simple as just saying when you believe in God or whatever, it's mostly that, that you. You. So the, the problem is always this positing of something which exists outside the category system. Like what is this other thing that you, that you. That you posit that exists outside. There is no avoiding the categories."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":5429.5,"end":5433.22,"speaker":"Adam Friended","text":"No, I agree. I agree. The category system is like an innate."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":5433.22,"end":5436.95,"speaker":"Jonathan Pageau","text":"Goes all the way down. It goes all the way down to potentiality."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":5436.95,"end":5448.35,"speaker":"Adam Friended","text":"But I, I would argue in a Donald Hoffman sense that the category system is part of our user interface with the world. I would argue that it's operating inside our head, that it doesn't actually."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":5448.51,"end":5450.91,"speaker":"Jonathan Pageau","text":"But the other thing."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":5451.47,"end":5452.19,"speaker":"Adam Friended","text":"What's that?"}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":5452.67,"end":5456.43,"speaker":"Jonathan Pageau","text":"He. He seems. He posits another thing that he has no access to."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":5457.31,"end":5530.47,"speaker":"Adam Friended","text":"Correct. Well, he does have Access to it, but only through the user interface. But he's saying that the user interface strips out so much information just for people who are listening and they don't know. The Donald Hoffman argument. Donald Hoffman, really quick makes an argument that the real world is very different than the world that we see and understand, that we have what is effectively a user interface, a graphical user interface like you use with your computer. Many different operations are going on inside your computer than what we see depicted on the screen. We all understand the screen of the computer very well. And he postulates that all of science, for as long as we've been studying the natural world, all we've been studying is the screen, the user interface, and we've never looked inside the computer to what's actually going on. So what we're talking about here is. I'm saying that that category system is part of the user interface, the screen, and not necessarily. I mean, I don't want to speak for you, John. Are you postulating that God is what is inside the computer?"}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":5530.95,"end":5534.39,"speaker":"Jonathan Pageau","text":"No, I'm postulating that there is no other."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":5535.43,"end":5536.95,"speaker":"Adam Friended","text":"There's only the screen."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":5537.35,"end":5543.99,"speaker":"Jonathan Pageau","text":"No, that's not what I mean. But what I mean is that you can posit as much as you want, another reality."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":5544.31,"end":5544.71,"speaker":"Adam Friended","text":"Mm."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":5545.19,"end":5550.95,"speaker":"Jonathan Pageau","text":"That has cat that some kind of categories behind the screen. But it's always categories."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":5551.11,"end":5551.83,"speaker":"Adam Friended","text":"Yeah, I agree."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":5552.87,"end":5553.51,"speaker":"Jonathan Pageau","text":"Through meaning."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":5553.75,"end":5554.87,"speaker":"Adam Friended","text":"Well, the like."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":5555.27,"end":5557.11,"speaker":"Jonathan Pageau","text":"So the way to the categories are."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":5557.19,"end":5565.91,"speaker":"Adam Friended","text":"The categories are essential to us understanding the world as pixels are on the screen. Like if you don't have pixels, you don't have a user interface."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":5566.15,"end":5594.71,"speaker":"Jonathan Pageau","text":"So the Aristotelian or even Christian way of positing it would say that behind it is chaos. Potential. It's a potentiality. And then out of. And then logos, light logos comes down on potentiality and then forms identities into that potentiality instead of. Those identities are the realest thing because the potentiality is just potentiality instead of chaos."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":5594.71,"end":5596.48,"speaker":"Adam Friended","text":"Could you say raw materials?"}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":5598,"end":5602.48,"speaker":"Jonathan Pageau","text":"You could say raw. I mean, I guess if you want."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":5602.48,"end":5605.76,"speaker":"Adam Friended","text":"Well, you're saying all the way down potentiality, possibility."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":5606.08,"end":5614.96,"speaker":"Jonathan Pageau","text":"Like it goes all the way down to a field of. Of. Of particles that are possibly somewhere. Right. That are. That are in flux. Let's say we."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":5614.96,"end":5619.52,"speaker":"Adam Friended","text":"I've got to wrap it up. Yeah, I know you have a heart out too, but this has been a fascinating. We can talk again."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":5620.24,"end":5620.8,"speaker":"Jonathan Pageau","text":"All right."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":5620.8,"end":5622.36,"speaker":"Adam Friended","text":"Hopefully. Hopefully. Like I."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":5622.36,"end":5624.64,"speaker":"Jonathan Pageau","text":"But it's not giving me hope. That's for sure, man."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":5624.64,"end":5625.04,"speaker":"Adam Friended","text":"Really?"}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":5625.44,"end":5642.1,"speaker":"Jonathan Pageau","text":"Oh, yeah. Because I'm like, I'm. I'm realizing just how hard it is to Communicate certain things to people who haven't had a certain intuition. Like, it's just really hard to communicate. It's like trying to find words in a language which is another language. It's difficult."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":5642.34,"end":5719.13,"speaker":"Adam Friended","text":"Yeah. I had one of my fans, watchers, reach out to me and they really like your stuff. They really wanted this conversation to happen, so. And they. Your stuff has been super meaningful to this person. So I know that you're making an impact on people and people. People like your stuff and there are people that understand it. I. I guess one of my things is. I'm just. I'm trying to bridge that gap. So many people see things that they don't understand and they have just like a visceral disgust for it. Like, they think that it's a threat to their identity or. Or whatever it is. And I. I don't. I think that's just a bad way to look at the world, I think. I mean, obviously you're a smart guy. I'm trying to understand what you're saying. Well, it's not like it's completely a mystery to me. And I feel like what we've articulated here has been useful. I mean, obviously people leave comments on this. There are people on your side that might be able to explain things better that are. To sort of bridge that gap. And same for you. People on my side might be able to explain things a little more to you, so."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":5719.85,"end":5721.45,"speaker":"Jonathan Pageau","text":"Well, I hope so. I hope so."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":5721.61,"end":5725.77,"speaker":"Adam Friended","text":"Don't get frustrated, though. Why? Don't get frustrated? Seriously, Are you."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":5725.93,"end":5747.87,"speaker":"Jonathan Pageau","text":"I think I'm frustrated with myself. Like, I'm frustrated with the perception that there's definitely, like a wall. And it's like I. And I know. And I know that it's a failure of my capacity to communicate it. And so when I see the confusion in someone's eyes, I'm like, damn. Like, I can see in your eyes the confusion."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":5747.87,"end":5753.23,"speaker":"Adam Friended","text":"But, like, there's no. Nothing wrong with confusion, though. Like, confusion is. I mean, that's what's wrong."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":5753.23,"end":5761.66,"speaker":"Jonathan Pageau","text":"It's annoying when you're trying to explain something to someone and you see confusion in their eyes, that's obviously not explaining it the right way because then I would see confusion in your eyes. Confusion."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":5762.29,"end":5785.01,"speaker":"Adam Friended","text":"Confusion is how we begin any engagement with a new topic. I mean, it's. That's normal. That's completely to be expected. So the thing that bothers me is not the. Not, not the fact that people are confused. I. The thing that bothers me is people are dismissive. That's what bothers me because there's absolutely no attempt to even, even understand. So that's what bugs me."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":5785.25,"end":5787.79,"speaker":"Jonathan Pageau","text":"Well, hopefully people won't be too dismissive."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":5788.34,"end":5790.34,"speaker":"Adam Friended","text":"Yeah. Well, this was a great conversation."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":5790.34,"end":5791.7,"speaker":"Jonathan Pageau","text":"All right, I'm gonna talk to you, man."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":5791.7,"end":5796.1,"speaker":"Adam Friended","text":"I'm gonna upload it to my channel. I can send you a copy if you want to upload it to your channel too, so."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":5796.26,"end":5801.06,"speaker":"Jonathan Pageau","text":"Well, we'll see. Yeah, I mean, upload it, send me the link and. And I'll see how things go in the next few weeks."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":5801.06,"end":5803.3,"speaker":"Adam Friended","text":"Okay. Take care, man. It was great talking to you."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":5803.3,"end":5804.14,"speaker":"Jonathan Pageau","text":"All right, Bye bye."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":5804.14,"end":5804.66,"speaker":"Adam Friended","text":"Bye bye."}
{"episode_id":"SW - #136 - 2021-01-15 - Adam Friended - Religion and Materialism","start":5805.78,"end":5870.73,"speaker":"Jonathan Pageau","text":"I hope you enjoyed this episode of the Symbolic World. The Symbolic World is edited by Justin Ward and it is based on a series of videos that you can find find on my YouTube channel, Jonathan Pageau's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by, of course, link leaving a review on itunes. Everybody knows that's the best way to get the podcast out there to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon Pajot videos as well and on subscribestar. All those links you can find on my website or in the show description. So thank you and I will see you soon."}
