{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":12.56,"end":54.43,"speaker":"Jonathan Pageau","text":"This is Jonathan Peugeot. Welcome to the symbolic world. So, hello, everybody. I'm really excited to be back with Richard Rowland for our third discussion on mythical history. On this universal history. For this episode, we're going to dive into Ethiopia. And I'm really excited about this because I have been a big fan of just this mystery of Ethiopia. I traveled to Ethiopia and I've just been fascinated with how its role is not just in the Bible, but in other ancient cultures as well. And so I'm really looking forward to. To exploring this with him."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":54.75,"end":256.25,"speaker":"Richard Rohlin","text":"Yeah, I'm very excited about this conversation. I have been actually, since I was a little kid. We had this textbook. I think it might have been like a middle school textbook or something like this, but there was a single paragraph in this world history textbook, a single paragraph, probably three to four sentences that mentioned the once great Christian kingdom of Aksum in Northern Africa, and then basically said, but it was wiped out by Islam and there are no more Christians there anymore. And this isn't a textbook. It's actually a fairly well known history textbook. I won't say which one, but. And so I sort of, as a kid, like, I had this romantic idea in my head and then of course, many years later discovered actually, you know, there are still Christians in that part of the world. And, you know, now I've actually been able to meet a few. Archbishop Dimitri, who's the sainted founder of the, the diocese that I'm in, he was very, he had a very loving relationship with the Ethiopian and Eritrean communities here in the Dallas Fort Worth metroplex. And so we actually have some, you know, Eritrean folks who are actually, you know, were received into our parish and are members of our parish and they, they, you know, once a year we do, Right, right before Lent, we do this big Eritrean meal. But there's also. I've just had random encounters with Ethiopian and Eritrean Christians. Very strange, very wonderful encounters. I don't want to use up all of our time to talk about them, but both here in the Dallas Fort Worth metroplex. But actually, most often when I travel, I always seem to run into these Ethiopian Orthodox Christians. I've just got a really deep love for the culture. And obviously there's some really cool things that Ethiopian Christianity seems to preserve for us. Stuff like the Book of Enoch, for instance. The only full copies that we have of those, of those Enochian manuscripts are all from Ethiopia. So I think that if somebody wanted to know, why would we want to talk about Ethiopia? I'd say, first of all, it's because Ethiopia is a very interesting proof case when we're talking about universal history and why it's still important to us. If you can understand why the place of Ethiopia in the scriptures and in the medieval universal history, then that will actually tell you something about the importance of Ethiopia today. And then so it's a good way to show how the legends of a people, their sort of symbolic identity, participates in the larger universal narrative. And then ultimately, I think maybe that helps us understand the ways that Ethiopia might be. I want to be careful here because I won't sound like I'm trying to make prophecies or something like that, but the role that Ethiopia still seems to have to play in the Christian story, the big story. Yeah. Which is, of course, ongoing. Right. Yeah. So I thought what we could do is start out by talking about Ethiopia in scripture, and that would probably bring us up all the way to the Queen of Sheba and the Ethiopian Eunuch, which are two things that actually you have to understand together to understand them at all. And that's probably as far as we're going to be able to get in a single video. But maybe we can just sort of tease Ethiopia in medieval universal history and how that relates to Alexander."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":256.49,"end":283.61,"speaker":"Jonathan Pageau","text":"Yeah, definitely. I think that we might be doing a few episodes on Ethiopia at some point, because it. I think, in terms of a role, like you said, going to Ethiopia. I was in Ethiopia for a few weeks, and that's. You can see that it's a place that still is full of magic, that there really are possibilities that exist there that seem to be completely evacuated from the rest of the world. I was on Lake Tana, where all these monasteries are. These, like, round monasteries, which are amazing."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":283.72,"end":283.88,"speaker":"Richard Rohlin","text":"And."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":284.19,"end":323.61,"speaker":"Jonathan Pageau","text":"And I'm on the lake and I'm going towards the monasteries and I'm looking at this lake and it's something. It's like out of a fairy tale. And the guide was like this Rasta guy, obviously not like a very. If he was a Christian, he was obviously not extremely, you know, he was just a guide. And I looked at him and I looked at the lake and I said, is there a monster in this lake? And he, like. He hesitated. He didn't want to really answer because he didn't like the question, I guess. And he kind of looked at me and he goes, yeah. And he says, it's a monster that will take its victims, will pull it down into the water for six days and release them on the Sabbath. And I was like, I just couldn't believe it."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":323.61,"end":324.57,"speaker":"Richard Rohlin","text":"I was like, man, that's amazing."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":324.57,"end":331.29,"speaker":"Jonathan Pageau","text":"Of course, it was nonstop, like all my time in Ethiopia, non stop. These just amazing stories that I was getting from people."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":331.53,"end":333.21,"speaker":"Richard Rohlin","text":"What else would there be in that way?"}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":333.21,"end":335.77,"speaker":"Jonathan Pageau","text":"Exactly. It's like, how could there be anything else in this?"}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":336.72,"end":467.21,"speaker":"Richard Rohlin","text":"All right, well, okay, so let's begin with Ethiopian scripture here, because we might come back to that late thing here in a little bit. So the first reference that we have to the land of. And I'll say in the Old Testament and the Hebrew. Old Testament, the word is usually cush. Ethiopia is a Greek word. It first appears in Homer. So some translations of the Bible, like the King James use Ethiopia, and then maybe more recent translations will say the land of cush. But it's talking about that same area, the area that's kind of on the Horn of Africa there. So the first reference that we get to this is in the four rivers that flow out of Eden. And of course, you've done some great videos on what are the rivers and what do they. What are they doing symbolically and all this stuff. Eden's not a terrestrial location in this, you know, in this way. But so we're told that this name of the second river is the Gihon. It is the one that flowed around the whole land of Kush or the whole land of Ethiopia. Now, nobody totally agrees on exactly which river the Gihon is the Ethiopians themselves associated with the Abe river, which is the Blue Nile. So it's one of the two major tributary rivers that flows into the Nile. What's really interesting is that a lot of Arab authors actually try to identify it as being a river that's in or around the Hindu Kush. Now, this might seem very contradictory. Obviously these are two very divergent locations separated by thousands of miles. What you have to understand, though is that India and Ethiopia are very closely related in ancient, let's say, ancient geography or ancient cosmology. Homer, who is the first person to mention the Ethiopians as a people, writes that they are to be found at the extreme east, which is in India, and the extreme west, which is northern Africa, of the Greek world. So they're divided by the sea into the eastern. So, so the idea is it's the land that the sun touches. Right. So that the land of the extreme east, which is India. Right. The sun rises in the east and the extreme west, where it goes down. Yeah."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":467.21,"end":472.33,"speaker":"Jonathan Pageau","text":"So it's understanding them as the place of the extreme, like they are. They are the people that live on the extremes."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":472.33,"end":572.36,"speaker":"Richard Rohlin","text":"Exactly. So later writers of late antiquity and even the early Middle Ages, for instance, there's a Latin account, I'm going to say it's maybe 7th or 8th century. There's a Latin account of the conversion of the Ethiopians that actually calls them Indians. It conflates India and Ethiopia. This is a very natural thing to do. One useful way to kind of understand the relationship in economic terms, which is the most boring way to understand anything, but maybe it'll help some people, is that there is the major trade route in the ancient world for goods, especially spices, coming from. From India. Was that they. Was that that trade route passed through the Horn of Africa. So anything for anything to enter the Roman world from India, it almost always came through the Horn of Africa, through Ethiopia. So you can see, you can see kind of the relationship there. So, so Ethiopia or Kush, it's a complex geographical term in ancient literature because it can refer to, like, the ancient regions of Aksoum, Kush of Nubia. It can be more generally used for anything in sub Saharan Africa. Right. So this phrase. And there's a phrase that appears over and over again in biblical literature and also elsewhere in the ancient world, beyond the rivers of Ethiopia or beyond the rivers of Kush. Right. So basically it's. And this shows up in prophetic literature. It also shows up in, like, you know, talking about, in the Book of Esther, when it talks about the. The empire of Artaxerxes, right, that he ruled from such and such a location to beyond the rivers of Ethiopia. In other words, to the end of the world. So it refers to this, the extreme end of something originally, both east and west, the extreme end of the known world."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":572.84,"end":600.84,"speaker":"Jonathan Pageau","text":"Yeah, that's exactly the. And if we're talking about mythical history and we're talking about the role that a people or a nation or an identity plays in the. Not only like in the spatial understanding of how the world lays itself out, but also in the story, then we don't have to get hung up too much on where exactly the ancients thought it was on the map, but rather understand what role it played for them in the way that they talked about it."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":601.64,"end":642.6,"speaker":"Richard Rohlin","text":"So the Ethiopians, if we look at the table of nations, for instance, In Genesis chapter 10, the Ethiopians are. Or the Kushites are descendants come from the sons of Noah, and they come from Ham, in this case. And it's. It's interesting to point out here that there was definitely a, let's say, a species of American Christianity here in the south, even until quite recently, that basically, you know, identified, you know, black people as because they're the son of, you know, the descendants of Ham, that they, they, they have this curse on them, you know, and it was, it was actually one of the, one of the arguments used to justify slavery."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":642.76,"end":643.2,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":643.2,"end":659.71,"speaker":"Richard Rohlin","text":"And that the thing to kind of understand about that is that these people, you know, as, as Jesus would say, you do not know either the scriptures or the power of God. Like, if you, if, if you, if you're reading Genesis and you come away with that take on this, then then like you have it read to the end of the story."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":659.71,"end":663.99,"speaker":"Jonathan Pageau","text":"Right, Exactly. You don't, you're just like not getting it, how it plays out."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":664.23,"end":735.09,"speaker":"Richard Rohlin","text":"Yeah. You don't understand the pattern. So. So according to the Book of Aksum, which is. It's a late collection of text that's based on basically a collection of a bunch of much, much earlier oral traditions. The etymology of the name Ethiopia. Ethiopia has three potential etymologies, and I think you can understand these as all revealing something different about the pattern of what Ethiopia represents. Symbolically. Obviously the most common one, the one that the Greeks assigned, was that it just meant like burnt face or red brown. But scholars today think that Ethiopia might have come from an Egyptian word which means the stealer of the heart. The stealer of hearts. So, yeah, bracket that. We're going to come back to that in a minute because that's really interesting. But in the Book of Aksum, they derive Ethiopia from the name of Ethiopia. Who is a. He's an extra biblical son of the biblical Cush. So he comes from the city founding line. Remember, it's Cain, you know, that built. Who builds the first city."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":735.41,"end":738.33,"speaker":"Jonathan Pageau","text":"So the Book of Aksum, is it. This is an Ethiopian source."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":738.33,"end":785.62,"speaker":"Richard Rohlin","text":"Yeah, yeah, it's a, It's a. It's their, it's their sort of collection, actually. There's a bunch of legal texts, there's a bunch of annals. It's just like a collection of like their older tradition that sort of codified at a certain point in the Middle Ages, but it's much older stuff. So they had, they actually had an extra biblical son of Cush who they believed came to this part of Africa and built a city. He's believed to have built the city of. I think it's Mazebor or I'm probably saying that wrong. But anyway, that's the original capital of the kingdom of Aksum. So note that he comes from the city founding line of Cain, but then he goes beyond the place where Cain and his descendants founded their civilization in the Fertile Crescent. So he goes on to Found his own city. It's kind of a city on the edge of the world. Yeah."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":785.7,"end":793.78,"speaker":"Jonathan Pageau","text":"And it's important to understand, like this is where it becomes important to understand the manner in which the people self identify."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":793.94,"end":794.3,"speaker":"Richard Rohlin","text":"Right."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":794.3,"end":820.67,"speaker":"Jonathan Pageau","text":"And so the Ethiopians themselves see them, they see themselves as descendants of Kush. And it's important to see that like they see themselves in a certain line. And so when we talk about how other nations understood them, we look at how they understood themselves. And, and it's interesting sometimes to see how these things actually come together. So there's a, there's a negative and positive aspect to whatever descendants you take."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":820.91,"end":822.27,"speaker":"Richard Rohlin","text":"To any symbolic pattern."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":823.15,"end":849.08,"speaker":"Jonathan Pageau","text":"The northern people, like the northern people understood their own, their own challenges. And so they saw themselves, some of them saw themselves a bastard son, like, oh, not a bastard son, but this like weird son that was born on the ark and was not completely accounted for, let's say. And so in the same with Ethiopians that, that we need to understand all these stories to see the positive and negative side of the role that they played or that they can play in this giant cosmic story."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":849.08,"end":922.62,"speaker":"Richard Rohlin","text":"Right. And of course, as you know, even, even today Ethiopia is famous for having churches, monasteries and settlements in these really extreme locations. I mean, you can just go like, look online, look at documentaries or pictures on Google of these monasteries that are in these totally inaccessible, craggy mountaintops. There's actually a place called the Finca Herbera site. I think it's Finca or Fincha Herbera site. This is in the Bale Mountains of Ethiopia. And they found remains of a really ancient human settlement, like a really long lived human settlement. It's 3,469 meters above sea level. It's the highest continuous human settlement ever discovered. We don't even know how they lived up there because if humans spend any time at that altitude without, you know, oxygen and you know, specialized clothing, they. You start to suffer from hypoxia and extreme weather conditions. So we don't even know how they did it. We don't even know how they survived up there. So the idea then is, you know, this idea of a city being founded on the edge of the world, right? That you sort of like going to the extreme edge of being, but then you're building a city. There's. Right."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":924.14,"end":955.27,"speaker":"Jonathan Pageau","text":"And that's what everything as we notice, like as we look at the tradition of Ethiopia, even how, even the, the ones that are still alive today in Ethiopia, this is what we will see is that it is a manifestation of the extremes in almost Every case, like everything about this, their saints, their stories, the things that they celebrate, it's a. It's like this amazing. This amazing capacity to kind of. To move into these extremes. And so you'll see, we'll see it as we talk about it. People will see how it manifests of. It's pretty amazing."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":956.15,"end":993.42,"speaker":"Richard Rohlin","text":"So once you start to understand that there's this overlap and this polyvalence between India and Ethiopia, you know, the extreme east and the extreme west, we can understand the way, what you just said, like, the way that Ethiopia participates in the symbolism of being the extreme edge of something. Right. That is both the source of great wealth. This is where all the really great gold comes from. Right. Solomon gets it. You know, when the Queen of Sheba comes, you know, she brings spices, spices that nobody's ever, you know, beaten. Like, these are the best spices that anyone has ever seen. Right. So it's a source of great wealth, of great potential. It's also a source of great danger."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":993.58,"end":994.14,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":994.7,"end":1014.75,"speaker":"Richard Rohlin","text":"And so this danger is often expressed in the Scriptures as being. And I'm going to tease the Queen of Sheba, but we can't get there yet. But. So just, just. But, but it's. It's often expressed in the Scriptures as being sort of like the mysterious feminine or even the idea of what. What, you know, the Book of Proverbs would call the strange woman."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":1014.83,"end":1015.31,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":1015.31,"end":1057.36,"speaker":"Richard Rohlin","text":"And the idea is that a stranger who comes as a captive, but then who captivates in her turn. So there's this reference in Ezekiel when it talks about Ethiopia. It speaks of it as being the land of all of the mingled people. And it says, Ethiopia and Libya and Lydia and all the mingled people and Chub and the men of the land that is in league shall fall by the sword. So this is a prophecy, but the reference here to Ethiopia is as. Ethiopia is a land of mingled people. And of course, you've talked a lot about hybridity, being on the edge. So when we come to the edge of something, this is what we would expect to find. Yeah."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":1057.36,"end":1064.4,"speaker":"Jonathan Pageau","text":"And you can see, like, that's why. That's why, for example, in the Greek culture, the Sphinx was said to come from Ethiopia."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":1064.4,"end":1064.76,"speaker":"Richard Rohlin","text":"Right."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":1064.76,"end":1087.1,"speaker":"Jonathan Pageau","text":"The Sphinx is this hybrid. It's dangerous, but it also hides a secret. It keeps this secret. And if you can unlock the secret of the Sphinx, then you have access to this almost like secret knowledge or this secret, all these, these, These possibilities that you didn't have before. But it's also dangerous. If you play with it, then it can eat you."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":1087.5,"end":1215.1,"speaker":"Richard Rohlin","text":"Right. So, and on any level you want to look at, this is true. Like, ancient Ethiopia itself was made up of multiple nations. Like, it would be way too complicated and time consuming to talk about, like, all the different dynasties and migrations and things like this. And although they're sort of originally what is considered an Afro Asiatic or Afro Asian or a Kushite language that's actually Kush, like, gave his name to that particular family of languages. Even today they're made up of multiple nations. And so they came to speak a Semitic language. So it's this Kushite people who then come to speak a Semitic language through the. Through an influx of a group, people, group called the Sabians, who are descendants of Shem in the biblical. And the biblical narrative. So they represent this very interesting kind of a hybrid between the Gentile and the Jew, between the descendants of Ham and the descendants of Shem. And this is a hybrid that results, let's say, in certain elements of the original, becoming more extroverted and therefore more strongly preserved. And by the way, you see the same kind of hybrid repeated, for instance, on a smaller scale in somewhere like Samaria. So the Samaritans were originally this. In the biblical story, they're this hybrid between the nations that the Assyrians brought in who intermarry with the Israelites who are left in the land. Right. And so they develop their own particular culture, their own particular religion. And even though they're excluded from the Jewish people through, you know, through whom salvation comes, as Christ says, they do preserve certain things that we, you know, for instance, their version of the Torah agrees more closely with, like, the Dead Sea Scrolls and the, and the Septuagint than the Masoretic texts, the modern, like the medieval Hebrew text that everyone uses for the Hebrew Bible now. So it's like, it's like they're more, they're, they're, they're a hybrid. But somehow that hybridity has resulted in preserving a more extreme or more extroverted element of the original."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":1215.26,"end":1261.71,"speaker":"Jonathan Pageau","text":"Yeah, and the way to understand that in terms of pattern is to understand that the edge of the world is also a container. And so if you can understand the world as the mountain, as the pyramid, the way I show it, the bottom of the world is like a cup. And so things get preserved in the cup, right? No, the edge of the world is a place where things get. Get preserved in a way that. How can I say that? Like you said, preserved outside of. Almost kind of outside of the narrative. In a way. They're just kind of held there Almost like as a secret that's hidden in the waters or this pearl that's hidden in the field. And so you can imagine something like Ethiopia or the edge of the world as the field, and in which the pearl gets hidden and the fish in the bottom of, you know, the fish shining in the ocean. It's all of that type of imagery that. That the edge also can represent."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":1262.11,"end":1284.67,"speaker":"Richard Rohlin","text":"We were. We were talking a little bit earlier, before we hit the record button, about the symbolism of the nest. Right. So the nest is something that's made up of remainders. It's like little bits of twig and fur and lint and whatever else. But then the. It forms a protective, you know, shelter around. Around the egg, the seed of life right at the center. Right. When I think that's something. Something similar going on here. Right?"}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":1284.83,"end":1289.83,"speaker":"Jonathan Pageau","text":"Yeah. And you can understand why then something like the Ark of the Covenant has cherubs on it."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":1289.83,"end":1290.23,"speaker":"Richard Rohlin","text":"Yes."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":1290.23,"end":1311.12,"speaker":"Jonathan Pageau","text":"But it has these hybrid creatures on it as a kind of seat. You know, talk about the mercy seat or whatever. It might be a bad. A bad translation, but there's a reason why we say that. That it's like this container, this resting place for the glory. And it's. And so this is. All of these things are kind of coming together as we understand the role that Ethiopia plays in these stories."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":1311.84,"end":1428.97,"speaker":"Richard Rohlin","text":"So before we can get to the Queen of Sheba, there's actually, like, let's say, a prototype of the Queen of Sheba in the scriptures. And this is something that maybe a lot of people don't know about, but this is the. This is Moses either first or second wife. There's no. There's no clear chronology for this in the scriptures, but according to legend. According to legend, it's. It's. It's Moses first wife. So. So let me just ask you a question. Have you ever seen the Charlton Heston Ten Commandments film where Charlton Heston is Moses? Right. You know, so remember at the beginning of that movie when Moses is just coming back from, like, his successful war in Ethiopia and, like, they bring. He brings in, like, the king and the princes of the Ethiopians, and there's this very strong subtext that at some point that princess and Moses got it on like, it's. It's their. They're. You know, everyone's picking up on it. Nefertiri is definitely picking up on it. Okay. If you haven't seen this movie, everyone. I mean, it's a great movie, and it's very symbolically rich. I think it's an interesting film. But anyway, it's a. It's kind of a classic. So it. I watched that movie like a million times as a kid. So many times. What I didn't realize until much later on is that that particular princess of the Ethiopians is an actual. Like, she's a person. She's a historical, you could say like a legendary person. Ok, so there's this very cryptic mention of this. And as far as I know, it's the only mention of this in scripture. It's in Numbers, chapter 12, verse 1. It says, and Miriam and Aaron spake against Moses because of the Ethiopian woman whom he had married, for he had married an Ethiopian woman. And it's just mentioned there and it never comes up again. But in ancient legend, like ancient Jewish legend, and this is actually, it's referenced by Saint Irenaeus. Right. So one of the Apostolic fathers actually refers to this legend as something that the Jewish community of his time and he considered to be credible."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":1429.29,"end":1433.77,"speaker":"Jonathan Pageau","text":"Yeah. That Moses, that Moses reigned in Ethiopia, was the king of Ethiopia for a while."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":1433.77,"end":1434.33,"speaker":"Richard Rohlin","text":"And so what?"}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":1434.33,"end":1439.29,"speaker":"Jonathan Pageau","text":"So the legend, like, people are gonna freak out. They've never heard this. I know saying it, it's totally normal."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":1439.53,"end":1589.51,"speaker":"Richard Rohlin","text":"So the legend here is that, is that this princess, her name is Starbus, okay? And she was actually Moses first wife, whom he married while he was still a prince of Egypt. So the legend concerning her, this is very important, is that he was besieging the city where she lived, and she saw him from the city walls, fell in love with him from a distance, and then met him secretly and offered to turn the city over to him if he would marry her in return. So this is the legend that Saint Irenaeus refers to. So in later medieval legend, there's like an expansion upon this, which is that after they get married, Moses is like, well, now that I've conquered Ethiopia, it's time for me to head back home to Egypt. And Tharbus refuses to let him do this. And so Moses makes. Moses, as we're told, is the most skilled man in astronomy, which means magic in the world. And so he makes two magical rings, one which makes the wearer forgetful, and the other one which makes the wearer remember everything. So it's right hand, left hand, right. So he keeps the second ring, the one that makes you remember everything. And then he gives the forgetfulness ring to Tharbus. And once she forgets about him, he escapes away into Egypt. This is a very interesting legend, I think. And though this, this doesn't seem totally compatible with. Let's Say the biblical chronology. And like, you just got to not worry about that because it is, it is a, it is a legend. Like, even in the Middle Ages they would have been like, you know, this is a fun story. Yeah, but, but Numbers chapter 12 does seem to indicate that Moses Ethiopian wife is either with him at this time or that, you know, even though we don't get a timeline for when he might have married her. So is this Moses first wife? Is it his second wife? It doesn't, it doesn't totally matter for our purposes. What, what does kind of matter is why is this something that Miriam and Aaron are objecting to? And of course, I've heard people say, well, this is like an early example of racism or something like that. But you have to understand, we know from linguistic evidence that a whole lot of the people from the tribe of Aaron are black. And if you're curious about this, Father Stephen the Young talks about it quite a bit in his podcast, the Whole Council of God, which is like a Bible study podcast. You can just go listen to him talk about the evidence for this. So it's not the fact that she's black, it's the fact that she's an Ethiopian. Right."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":1590.63,"end":1614.28,"speaker":"Jonathan Pageau","text":"I think, look, when I read it, I think that it's not in. It's not the same in terms of racial. In terms of racial. But there seems to be something about her being dark in the story, and I'll tell you why. Because Miriam, Miriam is basically criticizing Moses because he has a foreign wife. It's mostly the most foreign wife, you could say. But there is something about her being dark."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":1614.28,"end":1614.64,"speaker":"Richard Rohlin","text":"Right."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":1614.64,"end":1617.8,"speaker":"Jonathan Pageau","text":"Also being foreign is already being dark. Like."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":1617.8,"end":1623.21,"speaker":"Richard Rohlin","text":"Yeah, yeah. I'm not trying to say. And of course, Miriam, her punishment is leprosy. Right."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":1623.77,"end":1630.49,"speaker":"Jonathan Pageau","text":"But it's not just leprosy. Like, the way it's described is that her punishment is that her skin becomes white."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":1630.73,"end":1631.21,"speaker":"Richard Rohlin","text":"Yeah."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":1631.45,"end":1646.65,"speaker":"Jonathan Pageau","text":"And so it's like she criticizes. She's acting what I call an excess of purity. She's criticizing Moses for not being pure enough. And then as her punishment is to become so pure that she can't function in society anymore."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":1646.82,"end":1647.1,"speaker":"Richard Rohlin","text":"Yes."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":1647.1,"end":1654.42,"speaker":"Jonathan Pageau","text":"She has to be excluded because she's too pure in a bat in a bad sense. Like, she doesn't. She. She doesn't have access to, to others anymore."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":1654.58,"end":1665.66,"speaker":"Richard Rohlin","text":"Yeah. And I'm not. Yeah. Let me clarify and say I'm not trying to separate the darkness of her skin from her being an Ethiopian. I'm trying to separate like our, our current moment."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":1665.66,"end":1666.06,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":1666.06,"end":1711.37,"speaker":"Richard Rohlin","text":"And are some of our current Hangups around race from what's going on here. Right. Because. Because they're not. I mean they're, they're close and they seem close enough that we could just like read in what we're dealing with as a culture right now. And that would actually cause us to miss something really important in the story. Which is that, which is that, you know, this manifestation, like the manifestation of the extreme version of the strange woman. Yeah, right. This is the, this is the one who is captured and in her turn conquers her conqueror. And by the way, there's another African queen, she's not Ethiopian, but there's another African queen lady named Cleopatra who manifest this unlike not. It's not even a legendary level. Like it's completely historical. Right."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":1711.37,"end":1720.17,"speaker":"Jonathan Pageau","text":"That's the trope. The trope of Caesar is exactly that. Trope of being captured by this stranger that this like strange woman who fascinates."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":1720.41,"end":1735.93,"speaker":"Richard Rohlin","text":"Right. And so remember that one of the possible etymologies of Ethiopia of Ethiopian is the stealer of the heart. Yeah, right. One who. That can play out on kind of multiple levels. We talked about the Ark in a minute. I think that's really, it's a nice."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":1735.93,"end":1738.33,"speaker":"Jonathan Pageau","text":"Really on the nose, I don't know, happens moment."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":1738.33,"end":1842.27,"speaker":"Richard Rohlin","text":"But, but, but you can see this happening with, with Tharbus, right? That, that she, she's conquered by Moses, but then she steals Moses heart. And so, and it's again, I, I think that there's probably like a lot more to that story into that legend than just what I'm bringing out here. Maybe this will just like introduce people to something they probably didn't know about Moses. Yeah, yeah. So this brings us then to the Queen of Sheba. Right. So the details that were given about the Queen of Sheba, these come primarily in First Kings, chapter 10, which is also like, if you've got an orthodox study Bible, it's third kingdoms chapter 10. This is the same book. And we're basically told that when she hears the fame of Solomon concerning the name of Yahweh, she came to him to prove him with hard questions. So she comes posing a riddle. And you mentioned the Sphinx earlier, right? Yeah. So she comes to him and she brings tremendous wealth with her. We're told that she comes to Jerusalem with a very great train, camels that bear spices, much gold, precious stones. Right. So basically the whole figurative wealth of the East. Right. She brings with her and she comes. And she comes to him and it first says that she tried him with hard questions. And then it says that she communed with him of all that was in her heart. So, yes, that Solomon told her all of the questions. There is nothing hid from the king, which he told her not. And when she saw his wisdom, then she speaks of, speaks of his fame, she blesses his God, etc. And she gives him a bunch of gold, spices, a very, very great store, precious stones."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":1843.87,"end":1903,"speaker":"Jonathan Pageau","text":"And you have to understand this, there's so much going on in this story. Like there's so many layers, because it also has to do with the feminine itself, right? With the feminine, which, which is a question which, which. Which asks to be answered. Just like the mother of God asking Christ posing a problem, like saying they have no, here's a problem, solve it, you know, and everybody under anybody who's married, who has relationship with women understands this. Relationships, like the woman frames the situation. Ask the question, you know, the neck, right? That tells you where to look. And then, and then the masculine kind of answers or attempts to answer, let's say. And so it's like this idea of like, the woman as bringing a question, a mystery that needs to be solved, a puzzle that needs to be answered. And then that is how the seduction happens, right? It's like in answering her question, in resolving her puzzle, then that is how they commune. That's how they commune in her heart. Like, let's say it becomes a very sexual imagery."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":1903.24,"end":2020.25,"speaker":"Richard Rohlin","text":"So to sort of speak to things too high for me for a moment, okay, this is the relationship that the church has with Christ. You know, that, that. And that's, that's a really, that's a really strange thing to me. You know, you don't think of yourself as like posing a question to Christ, right? But, but, and, and this is where, this is where attempts to like, define the church that are, you know, let's say I, I don't want to just like, pick on, on like Western Christianity, but this is where, where attempts to define the church that aren't, aren't able to see it as the bride, right? They're not able to see as the feminine, right? And so, and so you attempt to nail them with the churches and let's say just a really masculine way, and hopefully people will know what I mean by that. It's not just that they're wrong. It's more like they're unconvincing. Like there's nothing beautiful about them. It might be the sort of thing that offers a high degree of certainty, okay, I know who is in and I know who's out. And that's really attractive for a little while. But. But it's got no power to seduce. It's got no power to really, like, charm you and draw you in. And, I mean, similarly, you can take different approaches to talking about the Mother of God, but ultimately the best. The best approach is really not to talk about her. You know, it's. You know, it's to kiss an icon. And it just sort of. Sort of. I don't know. It's. It's. It's a really mysterious thing. So here's what's interesting, is that in medieval iconography, the Queen of Sheba is used to represent both the Church and in particular, the Gentile Church, The Gentile nations coming to Christ. But also the image of the Queen of Sheba enthroned was seen as a prototype in medieval art, especially medieval Western art, of the coronation of the Virgin."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":2020.49,"end":2020.97,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":2021.21,"end":2039.58,"speaker":"Richard Rohlin","text":"So this is interesting because you have this. This figure who. She's a Gentile. She either is either seduced by or seduces Solomon. You know, and a lot of. A lot of medieval commentators saw her as being. Being the. The historical context for the Song of Songs. Yeah."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":2039.58,"end":2042.14,"speaker":"Jonathan Pageau","text":"That she's the Shulamite that Solomon talks."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":2042.14,"end":2047.94,"speaker":"Richard Rohlin","text":"And she says, I am. I am. I am dark but fair. Right. You know, so."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":2048.1,"end":2052.42,"speaker":"Jonathan Pageau","text":"But you can understand then why this would come into the Church as being an image."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":2052.77,"end":2052.93,"speaker":"Richard Rohlin","text":"Right."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":2052.93,"end":2099.12,"speaker":"Jonathan Pageau","text":"And why, for example, like, you would have a tradition of Black Madonnas that would appear in the Western Christianity, which happened almost accidentally, like the Black Madonnas, in terms of material causes. It's just because the wood gets darker with time and the smoke and everything. But that people would celebrate this image of the Dark Madonna as the idea of pure possibility, or this pure potential which is offered up and which is kind of asking for enlightenment, which is. Which is becoming pure in this. It is becoming dark. Right. And becoming just pure space. And so that's our role as the Church. Right. That's what we do. We try to eliminate our own thoughts and eliminate our own passions to then be open up to the illumination that Christ offers us. And so it does end up being this masculine and feminine relationship."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":2099.6,"end":2250.84,"speaker":"Richard Rohlin","text":"So. And you'll also enjoy this because we've talked a lot about the Sibylline oracles. Most medieval authors who were reading the Sibylline oracles believe that one of the Sybils identified in there was the Queen of Sheba. Hmm. So she's also connected to this late antiquity, early medieval oracular tradition. So the reveal, it's like the revealing of the mystery, you know, but even then, the mystery is like veiled in a mystery. You know, it's, like, revealing, but also, you know, concealing. Yeah, one might say. So this story here, the story of Solomon, it's the beginning of a long history of interaction between, let's say, Ethiopian culture and Judaism. Now, to speak from a modern historical perspective for just a quick. Just a quick second. Just a quick second, historians don't agree on exactly when. The current consensus seems to be that sometime around the 8th century, which is about three centuries after probably when Solomon lived. But there was. We know that from the historical record, sometime at or before the 8th century, there was a huge influx of Jewish settlers who came to live in Ethiopia. They brought with them not just Jewish customs, but also Jewish religious practices. There are actual Jewish temples that were built in Ethiopia. There's one at Yaha in the Tigray province, which is very old, and it's believed to basically be an architectural copy of the Jerusalem Temple. And there are other examples. For instance, on some of the monastery islands of Lake Tana, which you were just talking about, there's. There are some ancient stone altars dating back to 800 years before Christ. Wow. Which seem to have been built in the manner of Jewish sacrificial altars. They've. And they've been profound. Found not only preserved in good condition, but still containing blood residue in the way that the altar is purified with a sprinkling of blood in the Jewish ritual, you know, of. You know, of atonement. So all of this seems to have indicated that 800 years before Christ, there is a culture in Ethiopia that is already strongly adhering to some version of Mosaic law. And it's not exactly. Because obviously they're not going to the Jerusalem Temple to worship. So this. I mean, we could say from a perspective of, you know, Old Testament, you know, religion, this is problematic. But the point here is that. But it's also."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":2250.84,"end":2260.96,"speaker":"Jonathan Pageau","text":"It was problematic when the temple was destroyed, and it was problematic when the Jews scattered in different. So it's like. It wasn't like the ideal situation imagine these days."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":2261.12,"end":2283.43,"speaker":"Richard Rohlin","text":"But even in the Old Testament, you know, one of the things you're not supposed to do is, like, build a high place, you know, supposed to go worship at the tabernacle. This isn't like the era of the Judges and the early kings. Before the temple is built. You're not supposed to build a high place. You're supposed to go worship at the temple or at the tabernacle. But then we find people like the prophet Samuel going and offering sacrifices at the high Places all the time. So it's like, well, I don't know."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":2283.51,"end":2284.47,"speaker":"Jonathan Pageau","text":"It's complicated."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":2284.47,"end":2287.91,"speaker":"Richard Rohlin","text":"I don't know what's going on here. God apparently knows. But."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":2288.15,"end":2306.51,"speaker":"Jonathan Pageau","text":"And what's fascinating about the Ethiopians in terms of this. These proofs that people find is that the Ethiopians have no desire to, like, prove to the modern world that they are what they say they are. This altar that they found and that they have proved that they were able to get blood samples or whatever. There's other stuff there that they don't want to show you."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":2306.51,"end":2306.99,"speaker":"Richard Rohlin","text":"Oh, yeah?"}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":2306.99,"end":2312.71,"speaker":"Jonathan Pageau","text":"Care to show you? They don't want. They don't need to prove to all you scholars that they are what they say they are. They know what they are."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":2314.15,"end":2502.91,"speaker":"Richard Rohlin","text":"So. So I think that the stories of this connection we have, and there are legends about this that get written down in the Middle Ages, but I think they really represent some much older oral history. And I'm not the sort of person who, by the way, when I say oral history thinks that's unreliable. Right. Remember that Socrates basically said, well, oral history is reliable. It's when people start writing things down that we're going to be in trouble, you know, so it's. So I'm. I'm definitely not of the opinion that oral history is in any way, like, less reliable than what's written. But so. So the story about Solomon and Sheba, and I'll just go off of the. Off of the Ethiopian version of it here since, you know, there's actually. There's actually so much material written in Jewish, Christian and Islamic sources in the Middle Ages about the Queen of Sheba that you could fill an entire library with it. Like, there's just so much written. There's all kinds of stuff. But to just go off of the. To go off of the Ethiopian version of the story, we're told that the Queen of Sheba, whose name in the Ethiopian is Makita or Makada. Again, I'm sure there are people out there like my buddy John Wayne Coatney, who actually knows how to say all these Ethiopian words. And I'm just super sorry for getting it all wrong. Just a dumb Anglo. But. But Queen. Queen Makita makes a pilgrimage to Jerusalem. And by the way, some scholars think that Makita is. Is the. Like that Candace is like a. Is like the Candace, the Ethiopian queen in the Book of Acts. That. That. That's actually some rendering of Makeda in Greek. Okay. And that. That's actually a title. It's like. Like Caesar would be. And. Yeah, yeah, yeah, In Roman culture. So she makes this pilgrimage to Jerusalem. She wants to hear Solomon. She test him during her stay. So going back to this idea of the strange woman, the one who is captured but then also captures, she. She becomes so enraptured. Solomon becomes so enraptured with her beauty that he just decides he's got to have her. Of course, this is a thing that Solomon, you know, it was a thing. And so. So the story. And I'm going to just tell you this story and then I want you to just, like, help me understand it symbolically, because it's very strange. So no pressure. You're on the air. So one evening, he orders his royal cooks to increase the amount of pepper in the meal that they're being served for dinner. But he also orders the water bearers not to bring water to anyone unless they're specifically authorized to do it. And then to place a really big jug of water in his bedchamber. And so Queen Makita, she realizes his trickery. She plays along thinking that she can just go without water for the evening. But eventually she becomes dehydrated, the pepper is too much. And so she finally gives up and goes to his bedchamber, ends up sleeping with him. Right. And this affair leads to the birth of their son, Menelik the first, who is like the first Solomonic, what's called the Solomonic dynasty, the first Solomonic king of Ethiopia. Now, what the heck is going on with the water and the pepper? Jonathan Peugeot."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":2504.82,"end":2515.62,"speaker":"Jonathan Pageau","text":"Okay, well, I mean, for sure it has to do with trickery. That is the first thing. And I think all the different versions of how they end up together is always has to do with some kind of trickery."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":2515.62,"end":2516.02,"speaker":"Richard Rohlin","text":"Right?"}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":2516.26,"end":2569.53,"speaker":"Jonathan Pageau","text":"But it's like a trickery that she is also conceding to. It's not. It's not. Obviously, it's problematic for our, like, standards and today, whatever. But like, in terms of the story, it's the idea that he's trying to trick her into giving into him. And so that's the first thing. And so then the second thing has to do with the difference between water and spice. And so spice is the extreme, right? It's the extreme in the sense of. It's like. It's the flavor without the meal, it's the flavor without the. It doesn't sustain you, right? It's flavor without sustainment. And so that's what spices. And so you. It's. It has to do with the foreigner themselves, right? Foreigners are like spice in a system. Strangeness is like Spice. So you want a little bit in order to kind of question that saying."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":2569.53,"end":2572.81,"speaker":"Richard Rohlin","text":"Variety is the spice of life. Right? It's. It's exactly right."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":2572.81,"end":2575.65,"speaker":"Jonathan Pageau","text":"Variety is the spice of life. That's good that you went there."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":2575.65,"end":2576.09,"speaker":"Richard Rohlin","text":"Yeah."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":2576.89,"end":2608.54,"speaker":"Jonathan Pageau","text":"And so, so, so there's a relationship between spice and strangeness because it's like these things, like you're, you're eating what you're eating potatoes. And so it's like you don't want to just. You add something to it to make it different from potatoes. It's still basically potato, but it has a. It has an extra, an extra kind of next extra aspect to it to, to titillate you, let's say. And so that's what. So that's what's going on. And so he's. He's trading, he's giving water for spice. So he's, he's giving, he's spicing her up, like making her what she is."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":2608.54,"end":2608.9,"speaker":"Richard Rohlin","text":"Nice."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":2608.9,"end":2641.56,"speaker":"Jonathan Pageau","text":"And then he's offering water. And so there's a relationship between. It's not the same. People are going to get angry. But how Christ offers the source to the Samaritan woman, right? It's like source of life. So this is what's, this is what's going on now. The water becomes like active water, you could say, not passive water, like the ocean, but like fresh water is a way to understand it. So he's offering her fresh water, which comes down, and then she's full of spice and she's full of this strangeness. So it makes sense in terms of the basic symbolic pattern."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":2641.88,"end":2663.8,"speaker":"Richard Rohlin","text":"I think that there's two biblical associations that come readily to mind are one, that. And of course, this is part of what's going on in the story of the Samaritan woman is that the patriarchs always meet their wife by a well, right? They always meet their wife by the well. But then also, even in Proverbs, when Solomon is talking about the strange woman."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":2663.88,"end":2665,"speaker":"Jonathan Pageau","text":"That'S how he presents it."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":2665.4,"end":2669.48,"speaker":"Richard Rohlin","text":"And what he'll say is, drink waters from your own well. Drink waters from your own cistern."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":2669.63,"end":2672.19,"speaker":"Jonathan Pageau","text":"He says, don't let your fountain run into the streets."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":2672.19,"end":2672.59,"speaker":"Richard Rohlin","text":"Right?"}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":2672.59,"end":2724.36,"speaker":"Jonathan Pageau","text":"So, but Solomon does that like Solomon does exactly that. And Christ does that too. Just that Christ succeeds like Christ, his water flowing into the streets doesn't disperse him. Whereas like in, in the sense of the way Solomon talked about the strange woman, it's like it leads to death, right? But there's a mystery. There's this mystery there because death or the edge or the limit is also potential. And so that's why the queen of Shiva brings riches, because she's offering more body. You could say she has more body. She's further out. She has. She's out on the limit. And she was offering more potential for Solomon to, let's say, to pour his water over, let's say, and, like, kind of fill. But it's a dangerous game. Like, it's a dangerous game. And that's what happens in the legend of Solomon, right? At least in the kibernagas. It's a dangerous game because it leads to the ark being stolen, right?"}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":2724.68,"end":2801.01,"speaker":"Richard Rohlin","text":"So that's where this legend goes, right? And that's that Menelik is raised by his mother as a Jew in Ethiopia until He's in his 20s, and he goes to Jerusalem to meet his father for the first time. Right? And there are different varieties of the story, but in the one that you just referenced, which is kind of the most common version, he either refuses or is refused the throne after Solomon's death. Like, Solomon wants him to become king, but he's either not willing. Willing to succeed him because he wants to live in Ethiopia, or the elders of Israel are not having it. You know, like one of those are two different versions of the same thing. But essentially he can't become king or he's refused the throne after Solomon's death. And so he sends his servants to break into the temple and to steal the Ark of the Covenant and take it back with them to Ethiopia. And when Solomon discovers what they've done, he allows it. And the reason that he allows it is that he believes that God has allowed the theft. He believes that, you know, if God hadn't. I mean, this is the ark. We all know what happens when you touch the ark without permission, right? And so the fact that. That nobody has died, Solomon takes as being a sign that. That this is something that God has allowed. Yeah. And this is the legend of how the ark gets to Ethiopia."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":2801.17,"end":2828.73,"speaker":"Jonathan Pageau","text":"And there's so much like, I wish I could unpack. I could unpack this for hours because there's so much mystery in this event and there's so much going on. And it helps you understand how symbolism is neither just positive or just negative, right? Because the imagery that is used to tell that story is the very imagery in Proverbs when King Solomon says, like, don't go to the strange woman because you'll lose the strength of your work."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":2828.97,"end":2829.33,"speaker":"Richard Rohlin","text":"Right?"}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":2829.33,"end":2853.76,"speaker":"Jonathan Pageau","text":"Like, you'll actually. Your strength will be dispersed into the edge and you'll lose the fruits of your labor. And it's like, that's exactly what happens to him. Right. But then it ends up, in the end, working towards this kind of universal salvation, which is the surprise, like this kind of weird surprise at how things flip. You know, God uses things and turns them on their head and brings them back to participate in salvation, let's say."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":2854,"end":2882.53,"speaker":"Richard Rohlin","text":"So you have. So you remember then that the. Again, one of the possible meanings of Ethiopian is the stealer of the heart. Yeah, right. That the Queen of Sheba comes and we could say in like, you know, in our modern romantic parlance, you know, we say, oh, she's. She stole Solomon's heart. But then, like, she literally stole the heart and steals the heart of Israel, steals the heart of, you know, the visible presence of Yahweh among his people."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":2883.41,"end":2889.26,"speaker":"Jonathan Pageau","text":"And understand that this is a story that the Ethiopians tell. Like, this is. It's like their sacred history."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":2889.42,"end":2889.82,"speaker":"Richard Rohlin","text":"Yes."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":2889.82,"end":2959.8,"speaker":"Jonathan Pageau","text":"So they understand their origin as a theft, a relationship. So I've talked about this before, where the relationship with the stranger is often a relationship of trickery because we're not in the same identity. And so what happens in the end are these ironies and flips and switches that are what trickery is about. Like how Jacob acts in the. In the Laban's. Laban's court and how Laban acts with him are these relationships of trickery, like, of trying to trick the other. And so you see this as the very origin, the way that the Ethiopians understand themselves as their origin anyways. But it plays out. It plays out in the whole story as something amazing. But it's just important to understand that even in the story of King Solomon, how he tricks the Queen of Sheba to sleep with them, and then he ends up being tricked as the ark is stolen out. And so see the story of Jacob, how he tricks. He tricks Laban, tricks Jacob and Jacob tricks Laban, and then he steals the idols from them out. It's like this is the same story that's going on."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":2960.04,"end":3059.16,"speaker":"Richard Rohlin","text":"And even Jacob's two wives, right? You know, which. Which have all this varied symbolic resonance, you know, the. The active life and contemplative life and things like this, but they're also the. The wife of your youth and the strange woman, right? Because one of the things, One of the paradoxes about the strange woman is the strange woman is like, she's usually not fertile, right. You know, she. Because she can't give you. She can't give you a legitimate heir. Yeah, right. And so. So then, like, Jacob has these two wives and like his heart is drawn after one of them, but it's the other one that keeps giving him heirs. And, you know, and. But same thing with Moses, right? Moses has two wives, right? He's got Zipporah, who's not an Ethiopian. She's a, you know, she's a Ishmaelite, Midianite. Right. And then. And then you have. So she's. She's Semitic. She's of. She's. She's of an Abrahamic people, you could say. And she gives him his legitimate son. But even there, there's something about Moses where he's like, unable to. I mean, talk about circumcision, right? He's unable to cut off the remainder. And so he still has this Ethiopian wife. He doesn't circumcise his son. There's something about that that I think is really interesting. And I think part of what's really interesting here is that the legend is that Solomon had many, many wives, obviously, but the only ones who ever produced him a son were the queen of Sheba and then the mother of Rehoboam, whose name I can't remember right now. So Rehoboam is the king whose arrogance and foolishness eventually results in the splitting of the kingdoms."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":3059.16,"end":3059.64,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":3059.72,"end":3079.67,"speaker":"Richard Rohlin","text":"And so the idea seems to be here in the legend that if Solomon's son, Menelik, could have been the good son who kept the king, like, he could have been the good son, the good heir who actually kept the kingdom from falling apart if he could have stayed. But of course, he can't stay for various reasons, ultimately, because it's not part of the pattern that he's in. Yeah."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":3079.82,"end":3083.74,"speaker":"Jonathan Pageau","text":"And it's convenient in the legend because Menelik steals the ark and then Israel gets."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":3083.74,"end":3085.02,"speaker":"Richard Rohlin","text":"Then Israel falls apart."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":3085.1,"end":3089.42,"speaker":"Jonathan Pageau","text":"It's like that's the actual hidden cause of the separate. The breakdown of."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":3090.06,"end":3104.94,"speaker":"Richard Rohlin","text":"Yeah. And so. So, you know, he returns to his native land, he takes the heart with him. Right. And what this ironically does then, if you follow the legend, is that it allows the ark to be preserved after the Babylonian conquest. Yeah, Right."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":3105.02,"end":3112.15,"speaker":"Jonathan Pageau","text":"That's the mystery of the edge. Like this mystery, it's like a scandal, right. Then it. Then it turns into a mysterious keeping."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":3112.23,"end":3152.47,"speaker":"Richard Rohlin","text":"So the symbol of the symbolism of Ethiopia seems to be on an intuitive level, is really, again, talking about the nest. Right. The idea that it's this collection of the remainder, but the remainder becomes a safe space in which the egg, the seed of new life, the heart of something, can be hidden and protected. And of course, as a historical site, the rulers of Ethiopia. And we probably shouldn't talk too much about this in this video, but the rulers of Ethiopia still take the title the line of Judah, you know. You know, quite recently because they. They continue. They. They trace their lineage all the way back to Solomon. Yeah. So I don't know how we're doing on time. I don't know."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":3152.47,"end":3154.63,"speaker":"Jonathan Pageau","text":"I think we could. If you're okay, I think we should keep going."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":3154.63,"end":3155.11,"speaker":"Richard Rohlin","text":"Okay. Yeah."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":3155.11,"end":3156.71,"speaker":"Jonathan Pageau","text":"Let's got good stuff and we just."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":3156.71,"end":3188.13,"speaker":"Richard Rohlin","text":"Let's keep going because I want to get into. I want to get into Ethiopia. At least start teasing the role of Ethiopia in the Christian story that we've kind of laid this. This. We've laid this groundwork and we've estab. Basic pattern. Right. So that's the symbolic identity of Ethiopia as the extreme edge, the outsider, the hybrid, the strange woman. Right. But then this idea, you know, if you think all of the stuff is totally negative, that's going to be really complicated by the Old Testament, by. By the prophecies of the Old Testament itself."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":3188.45,"end":3190.61,"speaker":"Jonathan Pageau","text":"Yeah. And some stories in the Old Testament too."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":3190.61,"end":3191.49,"speaker":"Richard Rohlin","text":"Yeah, yeah."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":3191.65,"end":3196.52,"speaker":"Jonathan Pageau","text":"So there's an idea that the. That this is also part of resurrection."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":3196.68,"end":3197,"speaker":"Richard Rohlin","text":"Right."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":3197,"end":3273.6,"speaker":"Jonathan Pageau","text":"There's an aspect of resurrection which is related to this change, this weird flip that happens in death. And the best image of it is Jeremiah, who is in the cistern. And it's a really fascinating image because Jeremiah is in the cistern and he's kind of stuck there and he's in. He's in this, like, mire. You know how the psalmist talks about sinking into the mire and all that stuff? So there he is in the mire. And the person who pulls Jeremiah out is an Ethiopian. He pulls him out with rotten rags. And so he put these rotten rags around him and he pulled them out of the cistern. And it's like, if you want to understand the mystery of resurrection, there's something about that, about the relationship with the relationship. You have to. For resurrection to happen, there has to be reconciliation with the stranger, because it's a. The universal story has to not. You have to find a way to bring this all together. Like, all of it has to fit. And so the idea that in the end. So I mean. And you have it. There's a, like, the scandal of resurrection has to do with that. And you see that in Christianity, one of the reasons why Romans become Christians has to do with the scandal of the stranger becoming. There's a stranger participating in the return of the seed."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":3274.19,"end":3311,"speaker":"Richard Rohlin","text":"Right. So there are these. There are these prophecies. Let's. For instance, in the Psalms, Psalm 68, in the. Like, the. The numbering most people use, talks about princes coming out of Egypt, and Ethiopia shall soon stretch out her hands unto God. Now, this particular line, that Ethiopia will stretch out her hands unto God, this becomes really important in the way that Ethiopia is viewed in the Byzantine and Byzantine apocalyptic tradition. So maybe just bracket that, because that's. That's going to have to be another video. It's like the ultimate tease. I know, I know."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":3311,"end":3317.64,"speaker":"Jonathan Pageau","text":"Like how the relationship between Ethiopia and, like the end of. The end of everything and the final resolution."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":3317.8,"end":3407.69,"speaker":"Richard Rohlin","text":"Yes, yes. Literally, the end of everything. Right. Ethiopia shall soon stretch out her hands under God. Psalm 87 speaks. This is one of my favorite psalms. I think that we read it every. Every Monday or not every Monday, every Wednesday night in the Orthodox church at Wednesday vespers. So. So we hear. I always hear this. I hear the psalm read every week. And it goes a little bit differently in the Septuagint translation we use in my parish. But in the King James, it says, I will make mention of Rahab and Babylon to them that know me. Behold Philistia and Tyre with Ethiopia. This man was born there. The idea is that people from the edges of the world, right, from all of these. These places and these. These places function differently. Babylon is not the same as Ethiopia symbolically. It's a totally different, you know, kind of a thing. Philistia is more closely related to Ethiopia, Tyre, you know, so. But the idea is that all these different Gentile nations, with all of their symbolic resonance, that the people from these nations are going to say of Jerusalem, that's my city. I was born in her. And of course, the most important Ethiopian church, which is in the town of Aksum today, which is sort of the spiritual heart of Ethiopia, is Saint Mary of Zion. That's the church. And of course, the church fathers read this particular psalm as resonant, speaking both of the church and of the Mother of God. Right? As Mary is sort of the new Jerusalem somehow."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":3408.01,"end":3441.31,"speaker":"Jonathan Pageau","text":"And that's why, man, when you go to Ethiopia, it just becomes so intense in terms of seeing that. Because Ethiopians seem to identify themselves as Mary, like in a very mysterious analogical way. There's an image in one of the churches. I forget the name of the place, where all the little angels are on the ceiling, where they have the great Theophany festival. I forget the name of the church. I'm sorry, but in that church, there's an image of Mary, who's. Who's in the Shape of Ethiopia."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":3441.71,"end":3442.51,"speaker":"Richard Rohlin","text":"Like, oh, man."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":3442.59,"end":3452.91,"speaker":"Jonathan Pageau","text":"So I gotta look that up her head and she's holding. And then her veil, like, how her veil kind of falls at the bottom of how she's presented. She's actually taking up the shape of Ethiopia."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":3452.91,"end":3453.51,"speaker":"Richard Rohlin","text":"Oh, my goodness."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":3453.51,"end":3454.43,"speaker":"Jonathan Pageau","text":"It's pretty amazing."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":3454.59,"end":3457.91,"speaker":"Richard Rohlin","text":"Yeah, I'm gonna have to look for that. Oh, man."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":3457.91,"end":3459.83,"speaker":"Jonathan Pageau","text":"Maybe I can add it and when we edit this, we can put."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":3459.83,"end":3462.67,"speaker":"Richard Rohlin","text":"Yeah, that would be good. That would be good. And then I'll watch the video so I can."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":3462.75,"end":3463.67,"speaker":"Jonathan Pageau","text":"So you can see it."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":3463.67,"end":3533.72,"speaker":"Richard Rohlin","text":"So I can see it. Yeah, so. So there's this. So the idea is that. That this, the ultimate stranger. Right. Would then identify with the ultimate center of things. And I personally, I have to say that I love this verse. I love this song. Because for me, as a. As a. You know, I'm a. I'm a Gentile, I'm a, you know, a wasp. I'm a. Like, I live in North Texas of all places. Right. For me to be able to say Zion is my city and I was born in her. Right. That's, you know, with. With all of the sort of the mystical layers that that entails. To me, that's a deeply. That's actually a deeply comforting thing. Comforting thing. And it's deeply reaffirming of. Of my identity in Christ, you know, as part of. As part of the church. So. So there's. There's this idea that. That the Ethiopians are going to be drawn to Jerusalem. They'll identify it. They'll claim their lineage from it, and they'll worship the God of Israel. And because of the symbolism, the Queen of Sheba is often, as I mentioned earlier, she's used the medieval iconography as a type of sort of a shorthand of the entire Gentile church."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":3533.72,"end":3534.2,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":3534.36,"end":3546.12,"speaker":"Richard Rohlin","text":"That the hybrid, the multiplicity of all the nations of the Gentiles is united with the center in such a way that it actually preserves the unity and the unique identity of the people of God."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":3546.36,"end":3559.22,"speaker":"Jonathan Pageau","text":"Yeah, that's the image, like, just the image of Pentecost, the ancient image of Pentecost as having all the nations gathered into the. The door to receive the spirit of God. Like that is this the Queen of Sheba is a condensation of that type of imagery."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":3559.3,"end":3615.76,"speaker":"Richard Rohlin","text":"And this is also what I mean when St. Paul talks about the Gentiles becoming sort of the ultimate means of salvation for the Jews, you can even see that playing out in a symbolic level in that only in Ethiopia is a certain form of Judaism preserved. That was actually kind of like the dominant. One of the dominant strains of Judaism at the time of Christ, you know, but it hasn't, it hasn't been preserved anywhere else. And even, even things like, even things like some of the. Some of the, let's say the crazier, you know, scriptural books, things like Enoch and Jubilees, which, which aren't in our canon, you know, and they're not in any. Certainly they're way outside any Western canon, you know, but in Ethiopia, they were preserved. And the reason they're. They're preserved in Ethiopia is because they'd already been preserved by the Jewish community of Ethiopia. So these are like, these are really important texts to what a lot of people call Second Temple Judaism or Second Temple Judaism. These are really important texts, but it's only in Ethiopia that they really survive."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":3616.8,"end":3672.51,"speaker":"Jonathan Pageau","text":"And so, but it's so fascinating to see how the layers come together, which is the idea that Ethiopia has the ark, the idea that Ethiopia has all these texts. It's like Ethiopia is the ark. It has, it is the place where things end up kind of being preserved. This box, this home, this. This hidden place where you put. It's like in the ark, what did they put? They put the Ten Commandments, they put the staff, they had the mana, they had these tokens of the tradition which were held in the box. So you can understand that that's what Ethiopia, the role that Ethiopia kind of played, even in terms of modern Bible scholarship. Without Ethiopia, the narrative of the Book of Enoch would not be full. We wouldn't have this full. And it's playing a role, like, just like the Lord of Spirits, it's playing a role in what's going on. Like this restoration of Christianity is going to go through that type of story. That's the thing."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":3672.51,"end":3680.75,"speaker":"Richard Rohlin","text":"Like, I don't know if this is too crazy to say, you know, on a recording or not. I guess you can edit it out if it is. But, like, you wouldn't be doing the thing you're doing right now without Ethiopia."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":3680.75,"end":3681.19,"speaker":"Jonathan Pageau","text":"Exactly."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":3681.19,"end":3685.31,"speaker":"Richard Rohlin","text":"You're like, lord of Spirits wouldn't be a podcast right now without Ethiopia."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":3685.5,"end":3752.75,"speaker":"Jonathan Pageau","text":"No, you're totally right. There is, There is something happening, like in terms of the. The capacity to recapture the ancient story, to recapture, let's say, the more mythical aspects of Christianity are coming through what the Ethiopians have. Have preserved and have kept. But, but it's. It's more than that. Like, it's hard to explain to people. It's more than that because the magical world is still alive in Ethiopia. Like this kind of enchanted Reality is still there. If you go there, you'll, you'll, you can't get around it like this. I was in, I was in a, on a mountaintop and this, this insane mountaintop is super high up. It took us like half the day to go up there. And then you wake up on a Sunday morning and you look out in the valley and you see all these little white dots that are, that are climbing up the mountain just to go to church. And they're going into this cave where this church is. And you know that there's, they're like walking for two hours just to. Two, three hours just to come to church on a Sunday and to ascend this mountain to be in this cave. And you're thinking, like, where else, like where else is this even possible?"}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":3752.91,"end":3758.27,"speaker":"Richard Rohlin","text":"It's just astounding, man. I don't, man, I don't know what to say."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":3758.51,"end":3762.31,"speaker":"Jonathan Pageau","text":"I complain because I've got to Drive in traffic 45 minutes to go to church."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":3762.31,"end":3768.64,"speaker":"Richard Rohlin","text":"Yeah, I was just thinking about my 30 minute drive to my parish and like, Lord of mercy."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":3768.64,"end":3771.52,"speaker":"Jonathan Pageau","text":"Yeah, let's all be shamed. But we can accept to be shamed."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":3771.52,"end":3956.72,"speaker":"Richard Rohlin","text":"Okay, so the Queen of Shiva, she represents both the church, the Gentile church, but also we see this movement from the strange woman to the new Jerusalem. Of course, we have this wonderful hymn that we sing instead of. It is truly meat during the paschal season, which is now past. You know, singing, singing, you know, the angel cried to the lady full of grace. It's this announcement of the annunciation, if you will, of the resurrection to the Virgin. But then she's. But then we sing shine, shine, oh, New Jerusalem. So that hypnography closely identifies. It's not the only place. Obviously it's very frequently found in our tradition, but the hymnography closely identifies the Virgin with the new Jerusalem. And so we see the enthroned Queen of Sheba being used in medieval art to represent the coronation of the Virgin Mary. And so all of this kind of culminates in the Ethiopian Eunuch, which is maybe, I think we'll get to the Ethiopian Eunuch and then maybe we could just tease the business stuff for next time. Yeah, yeah. All right. Yeah. And I've got a great teaser for that. So, okay, so with the Ethiopian Eunuch, you have to remember, what's the Ethiopian eunuch reading? When Philip meets him on the road, he's reading the scroll of the Book of Isaiah. And of course he's very famously reading that chapter 53, which is about the suffering servant. Right. But if you go to the book of Isaiah and you look at the stuff that comes before that and after that, of course, he's reading it on a scroll. So you don't flip around on a scroll. You sort of start at one end and you kind of work your way across a few chapters before talking. This is in chapter 43 and chapter 45, we say. We see Yahweh, the God of Israel, saying, I am the Lord thy God, the Holy One of Israel, thy savior. I gave Egypt for thy ransom, and Ethiopia and Sheba for thee. And then he says. Then he says, talks about, thus says the Lord, the labor of Egypt and merchandise of Ethiopia. And of the Sabeans, the Sabians, or this group that came into Ethiopia, men of stature, they shall come over unto thee, and they shall be thine. They shall come after thee, they shall fall down unto thee. They shall make supplication unto thee, saying, surely God is in thee. And there is none else. There is no God. So here's the. Here's the Ethiopian eunuch, and he's on the road between Ethiopia and Jerusalem, and he reads in the scroll, and it says, ethiopians are going to come to Jerusalem and say, God is in you, and there is no other God than you. You know, like. Than your God. So then he reads Isaiah, chapter 53. And that's when Philip shows up, and that's when he gets baptized. Yeah, okay. But then you go three more chapters down, and we get this crazy verse in chapter 56. It says, neither let the son of the stranger that hath joined himself to the Lord speak, saying, the Lord hath utterly separated me from his people. Neither let the eunuch say, behold, I am a dry tree."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":3957.84,"end":3958.4,"speaker":"Jonathan Pageau","text":"Interesting."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":3958.72,"end":3975.04,"speaker":"Richard Rohlin","text":"Thus says the Lord unto the eunuchs who keep my sabbaths and choose the things that please me and take hold of my covenant even unto them. I will give my house and my walls and a place and a name better than that of sons and daughters. I will give them an everlasting name that will not be cut off."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":3975.2,"end":3980,"speaker":"Jonathan Pageau","text":"That's amazing. I never knew that that was there. Like, I never knew that that was in Isaiah."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":3980.72,"end":3982,"speaker":"Richard Rohlin","text":"I mean, this is incredible."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":3982.48,"end":4008.08,"speaker":"Jonathan Pageau","text":"Yeah, it's incredible because there's something about the eunuch. It's. Everything about Christianity is in that story in terms of the Ethiopian union. Because he is from the edge of the world. He's the ultimate stranger. But he's also, in terms of Jewish law, he would not have been allowed to go into the temple because he was castrated. And so he is the reject, like he is really is. He represents the edge in every way."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":4008.5,"end":4019.42,"speaker":"Richard Rohlin","text":"You couldn't be, you couldn't be more on the edge of the ancient Jewish world than him. Like, because he's both a Gentile, he's an Ethiopian, and he's a eunuch. Like, it's, he's a mystery that's being."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":4019.42,"end":4091.35,"speaker":"Jonathan Pageau","text":"Shown, and it's being shown in the stories that the eunuch is like, is the garment of skin in this story. It's. Because in the story, it's trying to show you that there's a relationship between Elijah and the story of the Ethiopian eunuch. Because when Philip baptizes the eunuch, it says that Philip ascended into heaven and was no more. And the text, the phrase it's used in Greek is the exact same phrase in the Septuagint, which, it says that Elijah went up when he tried to cross the river. And so this is like the story of Christianity, like, condensed into an amazing moment because he crosses over the river, he goes into death with the garments of skin, Philip goes up like Elijah, and then the blessing falls down on the Ethiopian. And so now the stranger becomes the body of Christ. Basically, it's like a little repetition of even the ascension of Christ in a way. Like Christ goes up and then down. The people below become the body. And so this is what is happening in the story where this garment of skin is transformed into a garment of glory before you're very eyes. In, in, in the story, the edge becomes the body of Christ."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":4091.67,"end":4148.07,"speaker":"Richard Rohlin","text":"And that's, that's. And that's exactly what Isaiah says. He says the eunuch will be the house of God. Yeah. And the eunuch will be the place where God puts his name. Right. And that he is going to bring the eunuch to his holy mountain in verse seven of chapter 56. And what's really interesting to me is that this is the context when Christ is in the temple, is purging the temple, and he says, it is written, my house shall be a house of prayer. He's quoting this passage that, this passage of. And like, this is some symbolism that I'm still trying to wrap my head around because. Because what Christ is doing is an act of purity, right? It's an act of purgation. He's. He's purifying the temple because the temple has been defiled with commerce, but commerce is related to Ethiopia, you know, and he's, he's, he's, he's, you know, it's the, it's the influx of, you know, from the Stranger coming in. And so he's, he's purified."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":4148.07,"end":4152.11,"speaker":"Jonathan Pageau","text":"That's what money changing is too. It's about, it's about strange currencies."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":4152.51,"end":4328.76,"speaker":"Richard Rohlin","text":"But, but, and this is my obligatory Ethics of Beauty reference for this video because I just have to talk about this book all the time. One of the beautiful things, and I think this is what Dr. Petitsa actually did his whole dissertation about for his PhD, but is the idea of the Liturgy of Holy Week as a city founding ritual. And so in the ancient world, all these cities have, the various cities had these city founding rituals that they would enact every year. And what's, I mean, they're different, a little bit different from city to city. But basically the pattern would be that the king comes into the city and he ascends to the center of the city where the holy place is, and he enters into the holy place and he spends a ritual night with the city. You know, of course, in a pagan context, this is with like a temple prostitute. But in, in. But what, what Dr. Patitza argues is that, is that you can read, especially in the Gospel of John and you know that you can actually read Christ's movement into one of the interesting things that we're, we are never told in the Gospels that Christ spends the night in Jerusalem. Never happens. He always goes out of town to Bethany, which is like the, the, the ghetto, right. That's where the poor are. So he always goes outside of Jerusalem to Bethany to spend the night. We're never told that he spends the night in Jerusalem. So this is what's really interesting is that in the Holy Week narrative you have Christ ascending and he gets to the high place. He gets the holy place of the city. But then what he finds is it's totally defiled. So he purges it. He cast out the money changers, and then he leaves the city and goes outside and the bridal knights for the story of Holy Week becomes the bridal chamber of the tomb. Yeah. And so we see Christ sort of like consummating his relationship with the new Jerusalem. Right. And constituting a new people. So that's Dr. Petita's argument in his book and in his PhD thesis. I think it's brilliant. But here's the thing Christ is saying, is quoting this passage. What is this passage about? This passage is about God constituting, bringing in the stranger, bringing in the eunuch, and constituting a new people of Yahweh, the God of Israel, bringing in the Ethiopian and the eunuch, and saying, this is my people. And what constitutes it. He refers to it over and over again as, these are the ones who keep my Sabbath. In other words, they're the one who preserve the remainder. Right. And that this is where he's going to put his. This is where he's going to make his new people. And he's referring to that as he's purging the temple, which is somehow participating in this idea of a city founding liturgy. And this idea of. So this is a. This is an idea that's not, like, fully formed in my mind yet, but I've been. I've just been noodling on this a lot the last few weeks. Yeah. There's something really mysterious happening here. And always, you know, Father Stephen DeYoung talked about this. Whenever the New Old Testament is quoted in the New Testament, you have to go back and look at the rest of the passage because it's like a hyperlink."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":4328.99,"end":4329.15,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":4329.15,"end":4363.33,"speaker":"Richard Rohlin","text":"You know, so you got to click that and go to the rest of the passage to see what is Christ talking about. So he's not just saying, oh, you're supposed to pray in church, and instead you're selling stuff in church. That's not what he's really saying at all. I mean, he is saying that, but what he's really saying is, is I'm going to make a new people for myself. Right. He's saying. He's saying I'm going to make a new people for myself. I'm going to make a new temple. Right. That the temple of my body is going to be destroyed, and it's gonna. I'm gonna rebuild it, and it's gonna be the church, and it's gonna bring in these people of things. Yeah, that's going to be where I put my name."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":4363.33,"end":4436.45,"speaker":"Jonathan Pageau","text":"But so you can understand it. Like, you can maybe understand if you can compare the money changes to Pentecost, when maybe an interesting way to understand it, where money changing is like. It's like this equivalency of identity that just gets kind of traded back and forth. And. And there's like, you know, it's almost like it's really. Is like this kind of weird mixture and mitigation. You could say, whereas Pentecost, there's a sense in which the one truth gets embodied in all these particulars. So the particulars commune together by preserving their particularity, but are able to see each other as brothers, and they're able to see each other as. In a way to transcend that. It's like the way to transcend their particular, but it doesn't mean it also affirms the reality because people were hearing. They were hearing the speech of the apostles in their own language. And so it's like this filling up of multiplicity. But you're right, it's difficult because there's a thing happening here in terms of the place of multiplicity and unity together, how it plays together in Christ when it comes together. And it's sometimes not easy to see through it because it seems to be such foundation that sometimes it's hard to see the foundation of something."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":4436.77,"end":4440.05,"speaker":"Richard Rohlin","text":"Yeah. So maybe at this point, I'll just tease."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":4440.21,"end":4441.01,"speaker":"Jonathan Pageau","text":"All right, let's go."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":4441.4,"end":4503.6,"speaker":"Richard Rohlin","text":"Okay, so here's the thing. We all know, and I'm sure somebody out there, some. Some very zealous person out there is like, well, why are Richard and Jonathan talking so much about Ethiopia? Ethiopia? Don't you know, we're in schism with them? You know, so I'm just going to say this. In the Byzantine apocalyptic tradition, there's this idea that the seed of Rome, and I really literally mean the seed of Rome because it's the son of Romulus, that the seat of Rome is preserved in Ethiopia. Kind of like the seat of Solomon being preserved in Ethiopia. It's the same pattern, the seat of Rome being preserved in Ethiopia. But the place where that happens in the Byzantine apocalyptic tradition is at Chalcedon, which is where the Fourth Ecumenical Council where the Chalcedonian churches and the non Chalcedonian churches wanted to schism, was that. That council. So, and the thing is, like, when. When this is being written, when this prophecy is being written, this was a few hundred years after that had happened. It's totally deliberate."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":4503.68,"end":4507.36,"speaker":"Jonathan Pageau","text":"Wow. So there's a sense in which there's a mystery and a separation."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":4507.6,"end":4508,"speaker":"Richard Rohlin","text":"Right."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":4508.16,"end":4513.68,"speaker":"Jonathan Pageau","text":"There's a mystery and the fragmentation of the church, which is going to play out in. In the Apocalypse."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":4513.76,"end":4514.2,"speaker":"Richard Rohlin","text":"Yeah."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":4514.2,"end":4515.96,"speaker":"Jonathan Pageau","text":"That's amazing. That's amazing."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":4515.96,"end":4571.24,"speaker":"Richard Rohlin","text":"That's a little teaser. People need to. Need to tune in for that next one. We'll talk about Ethiopia and the Byzantine apocalyptic tradition, and maybe we can talk and you know more about this than I do. So maybe we can talk and you can kind of talk and I'll listen and ask questions about. About Ethiopia today and about, you know, recent history. You know, there's. There's this recent emperor of Ethiopia who, like some people worship, and I've actually met a couple of those people now, and of course, they eventually became Ethiopian, you know, widow Christians. So. So, yeah, I have a lot of. I just have a lot of questions about all that. But also in the Byzantine apocalyptic tradition, Ethiopia is very closely tied to the myth of Alexander. So I think that's going to be a really natural segue into talking about Alexander and about all of these great imitators of Alexander in the medieval universal history. Awesome."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":4571.24,"end":4600.75,"speaker":"Jonathan Pageau","text":"And I think I also want to talk about. In our next discussion on Ethiopia, I want to talk about the traditions of Ethiopia. The way that we talk about the extreme and to what extent their traditions preserve extremes that to us sometimes look so fringe that it's hard to. It's hard to talk about them. But it's interesting to understand that this accumulation of extremes does seem to be the reason also why they were able to preserve texts that we have forgotten and that we have kind of set aside. So we can look at all that."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":4600.75,"end":4631.64,"speaker":"Richard Rohlin","text":"In one more teaser then. Yeah, the preservation. And I would say that most, like, textual scholars don't think this is true from, like, a historical critical perspective. Okay. But the tradition is that the reason that Enoch and Jubilees are preserved is because of a group called the Nine Saints. Yeah. And the Nine Saints were these people who, at the Chalcedonian schism, they came out of the Byzantine Empire, they went into exile, and they went to Ethiopia, and they brought with them all of this learning that was not preserved anywhere else."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":4631.64,"end":4634.68,"speaker":"Jonathan Pageau","text":"And those Nine Saints, man, they are wild bunch."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":4634.84,"end":4635.32,"speaker":"Richard Rohlin","text":"Yeah."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":4636.6,"end":4643.08,"speaker":"Jonathan Pageau","text":"I won't go into it too much, but there's one who, like, committed suicide to imitate Christ. Like, crazy stuff that we don't have in our traditions."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":4643.16,"end":4649.72,"speaker":"Richard Rohlin","text":"Yeah, yeah. And don't necessarily want in our tradition in some cases, but it's there and it's."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":4649.96,"end":4657.73,"speaker":"Jonathan Pageau","text":"Yeah, yeah, yeah. Like I said, it's good to understand this as this kind of extreme. And so we'll talk about it next time. Okay. Because we can just keep going now."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":4657.73,"end":4659.13,"speaker":"Richard Rohlin","text":"Next video is going to be awesome. All right."}
{"episode_id":"SW - #173 - 2021-09-02 - Richard Rohlin - The Mystery of Ethiopia","start":4659.13,"end":4741.98,"speaker":"Jonathan Pageau","text":"All right, everybody. So thank you for your time. I hope you're as excited about Ethiopia as we are. And so, you know, and so stay tuned. We're gonna. We're gonna keep going, you know, as long as everybody's interested, we're definitely gonna keep going and talk about this universal history. So thank you, everybody, for your attention, and we'll see you very soon. I hope you enjoyed this episode of the Symbolic World. The Symbolic World is edited by Justin Ward and it is by based on a series of videos that you can find on my YouTube channel, Jonathan Pageau's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments. And as well, you can always help the podcast by, of course, leaving a review on itunes. Everybody knows that's the best way to get the podcast out there, to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon Pajo videos as well, and on subscribestar, all those links you can find on my website or in the show description. So thank you and I will see you soon."}
