{"episode_id":"SW - #368 - 2024-12-13 - Symbolism Explained - Tucker Carlson Attacked by a Demon","start":0.16,"end":62.13,"speaker":"Laura Diaz","text":"Tucson, the weight is over Mediweight loss. They're officially open on North Oracle Road. That's right. No more counting down the days. You can walk in right now and start your journey to a healthier you. Hey, it's Laura Diaz from iheartradio and you can trust me. This isn't just another weight loss clinic. I know that because it's where I lost weight safely with real medical support. GLP1 medications. You can see them everywhere online right now. But the truth is your health shouldn't be a DIY project ordering these meds without the professional guidance. It can lead to dangerous mistakes, wrong doses, no oversight, and serious risks at mediweight loss. I got the same medication but with a customized plan, weekly check ins, and a licensed physician guiding me every step of the way. And the cost? The same as those risky online options. Tucson, your moment is here. If you're ready to take control, feel better and lose weight the right way, mediweight loss is ready for you. Walk in, get started and see real results. Call or visit mediweightloss.com to learn more and book your free consultation today. That's mediweightloss.com hello everyone."}
{"episode_id":"SW - #368 - 2024-12-13 - Symbolism Explained - Tucker Carlson Attacked by a Demon","start":63.17,"end":415.97,"speaker":"Jonathan Pageau","text":"I think that many of you at this point will have seen a video clip going around with John. Here's interviewing Tucker Carlson. It's part of a project to make a movie called Christianities and I'm happy to announce that I will be participating in that project. I'll also be one of the people being interviewed. But I was really kind of shocked and surprised to see John and the team published this one clip of Tucker Carlson talking about how he was attacked in the night by a demon and how that attack in some ways woke him up to spiritual realities in a way that he had never been before. It's funny because I actually knew about that story. It had been told to me by someone about a year and a half ago, maybe close to when it had happened. Someone had told me the story and I didn't think that Tucker would talk about it in public, but seems like there it is, there he is talking about it in public. And so it's brought up a lot of questions for people because especially the way that I talk about the notion of principalities or the idea of spirits and how in fact there is a cask, a chasm between, let's say, principalities in the physical world and that in principalities can't touch the physical world. You know, just like ideas can't touch the physical world or how, you know, things that don't have bodies, can't touch the physical world. And the question is, what's going on? How is it possible that he might wake up in the middle of the night and have massive claw marks on his body and have this dreadful sense because you had this nightmare about not being able to move, if I remember correctly, you know, being kind of frozen there and this pressure on him, you know, before he woke up. So how is this possible? This is Jonathan Peugeot. Welcome to the symbolic world. You know, for those of you who haven't watched it, I did a video a little bit about, called did the Witches Win? That I had recorded in 2020, where I talk about this a little, where we talk about what we call secondary causes. And the idea that once you see the purpose of something, you or the. The symbolism of something, or the reason for something, you can talk about how they happen through secondary causes. What that means is that there's no direct relationship between the mechanical causes that bring about the phenomena and the ultimate impetus, the vertical cause you could call, or the meaning cause that makes it happen. And that might seem strange to people at the outset, but in fact it's actually how all phenomena that finds its origin in meaning making happens. Because any type of thing that happens in the world which originates in meaning, you can't trace the relationship between the meaning or the purpose that is being given, the order or the suggestion or the, the question that's being asked, and the mechanical causes that make it happen. Okay, and so let me give you a simple example, which is I ask my son to go get, you know, something in my room. I'm like, could you go get this for me in my room? And then he goes up the stairs, goes into my room and finds the thing, brings it to me. And so that's an exact example. There's absolutely. There's actually lutely no connection, direct, mechanical connection between the meaning making aspect of it and the actions that he took in the world. You know, him moving his knees and the blood pulsing through his vein and, you know, getting things out of the way, opening the door of the room, going in, getting the thing, bringing it down and giving it to me. If you only analyze the mechanical causes of it, you could never find that. I asked him to bring that to me, you know, and it's the same with any kind of meaning making structure that manifests itself in the world. So how, for example, does passing a law affect the world? Well, it affects it through secondary causes. And so the person that's passing the law that creates the the, the constraint on society at the top of the ladder, you could say of meaning doesn't predict like which police officer or which judge will act on what day you know, next to this or that phenomena. They don't have to because those are secondary causes. The formal cause, the first cause, which is the meaning cause, doesn't have to take into account the secondary cause elements. Those secondary cause elements have their own mechanical reality at the level they do, you know, inspired by the formal cause. Okay. And so that is how actually all reality works. And so we have to just remember that as we look at the more extreme examples, which are the ones that you see in the case of what Tucker is describing. Now, in the case of what Tucker is describing, what you're not, what you can see is something like. We could call it a reverse."}
{"episode_id":"SW - #368 - 2024-12-13 - Symbolism Explained - Tucker Carlson Attacked by a Demon","start":416.05,"end":477.77,"speaker":"Laura Diaz","text":"Tucson, the weight is over Mediweight loss. They're officially open on North Oracle Road. That's right. No more counting down the days. You can walk in right now and start your journey to a healthier you. Hey, it's Laura Diaz from iHeartRadio. And you can trust me. This isn't just another weight loss clinic. I know that because it's where I lost weight safely with real medical support. GLP1 medications. You can see them everywhere online right now. But the truth is, your health shouldn't be a DIY project ordering these meds without the professional guidance. It can lead to dangerous mistakes, wrong doses, no oversight, and serious risks. At mediweightloss, I got the same medication but with a customized plan, weekly check ins and a licensed physician guiding me every step of the way. And the cost? The same as those risky online options. Tucson, your moment is here. If you're ready to take control, feel better and lose weight the right way, mediweightloss is ready for you. Walk in, get started and see real results. Call or visit mediweightloss.com to learn more and book your free consultation today. That's mediweightloss.com Miracle."}
{"episode_id":"SW - #368 - 2024-12-13 - Symbolism Explained - Tucker Carlson Attacked by a Demon","start":478.09,"end":1737.74,"speaker":"Jonathan Pageau","text":"You know, I've talked about miracle before. I tried to explain them the best that I could as the way in which you could call it strong emergence, you could call it. You could use different words. You could talk about how there are sometimes even in the biological world or in the physical world where there's absolutely no way of accounting between the two. Like there's. There seems to be a complete disjunct between the. The. The. You can't even trace the line. So like in. In the case of, for example, me telling my son to go get my shoes. Let's say at the entrance of the door, you can, you can still kind of trace the idea of the original cause or the, the meaning making cause, the formal cause. And then you know, you can kind of see how there's, how can I say this? That the actions are at least aimed at that cause through other meaning making structures, right? So you have, in order for that to happen, like in a city or the way I talk to my son, you need other meaning making beings to be involved that are implementing the order or the meaning at the higher level. So we pass a law in the town and then we need people to hear or to read the law and then those people to then act according to the law and enacted at the level where they are. And so there is this sense that there's a kind of meaning making, meaning making agents that are there all along the way of the causality chain you could call it. But in the case of miracles, you absolutely cannot account or you don't have a way of accounting for the relationship between the meaning making and the effect that it has in the world. Now this is something that happens more than you think, right? Because we don't think that it functions that way. Only when we think that meaning making agents are completely separate from all other types of causalities, that there's absolutely no relationship between the meaning making agents and other types of causes. But when you realize that these are all integrated together and that in fact meaning is part of the universe and meaning making agents are types of causes in some ways the most important types of causes that bring about reality. You can notice that, for example, there are many, many example of scientists that dream of something, that have a dream of a type of causality and then down the line that thing is found to be true or that they think it up in their mind and they, they kind of have a vision of something, of something that can happen and then it happens. It, it's shown to be true in the future, even though they don't have the, the mathematical proofs, they don't have the empirical, you know, proofs, they just have this kind of intuition that this is true. And then, then it, then later we discover that it is in fact, in fact true. And so in miracles, this is what you're always seeing, is that in some ways there seems to be a direct relationship, or at least there's no at all accounting for the way that the causes happen in any way. Like you can't even trace it through meaning making agents and how something happens based on meaning making. And, you know, you. You know, if you read the, the, the. The stories of the miracles, they're always a reflection of a higher order meaning, right? It's like you're seeing a higher order meaning imprint itself onto reality and order. Reality directly or seemingly directly. And it doesn't mean that. Can I say this? It doesn't mean that the idea or the purpose or whatever. How can I say this? It doesn't mean that the idea or the purpose or whatever has a way to touch physically the mechanical things. Just in the same way that me telling my son to go get something isn't like me physically bringing him to do it. But nonetheless, this is what miracles manifest. And they manifest it, like I said, in a way that points to higher forms of order. You know. Now, the thing is, is that it doesn't mean that there aren't mechanical causes. That means that is that even if there's a miracle, it doesn't mean that you couldn't, at the. At the, you know, at the outset, look at what is happening at the mechanical level. You could. You probably could. And sometimes, sometimes the desire for people to do that has sometimes led to them invalidating things, which in my estimations are really miracles, you know, because the mechanical causes don't seem to function the way they do. I'll give you an example that I saw a while ago. You know, it was that there was a Catholic church in which a statue of the Virgin Mary started to cry. And. And so drops of red liquid, whatever, were appearing on her cheeks and were kind of strolling, you know, streaming down her face. And people were saying she's crying blood. And it was crazy because imagine you're standing there and you're. You're in a church and you're praying, and you look up, there's a statue of Mary. And then all of a sudden there are, like, tears, red tears that are streaming down her face. And so. And I remember that I read an article that was debunking this because they said, well, they looked into it and they analyze it, and they realized that there was a hole in the roof exactly in the right spot above, you know, the statue. And that. That there was rusty water in that, like, hole. And then that rusty water fell exactly right next to her eye and then would come down as a teardrop, you know, on her face. And therefore, that's not a miracle. And you're like, do you know what a. Maybe you don't know what a miracle is. You know, maybe you don't understand how a Miracle are these are exactly like that. It's not that there isn't any mechanical causes, that those mechanical causes come together to reveal meaning, you know, that can't be accounted for in those mechanical causes. And so I would say that something like that, that actually is a miracle, right? In the sense that there it is, you stand in front of the Virgin and she's crying and there's nobody trying to trick you. Like, there's no one who is doing it out of malicious intent and is like putting drops there in order to. To. To manipulate you or to get money from you or to do something that is off. It's actually just happening in front of you and you have an. You have a statue of the Virgin that's cry. Now, is it possible that you could have, let's say, mechanical causes that would be even more or even less directly, you know, collated to the meaning that's even possible? You know, there are all kinds of. Of events that happen in our lives and stories that we hear from people that we love and care about that seem to manifest, you know, this type of thing. And so this seems to be that, you know, in the case of what Tucker is explaining, you know, the question is, what happened to him? Let's look at it at the most basic element, right? So he had a very horrible dream in which he felt deep spiritual oppression and felt weighed down and held down and that he couldn't move and that he couldn't do anything. And then when he finally woke up, he had huge claw marks on his body and everybody else was fast asleep. It's like, does that mean something? And the answer is, yes, it means something. And in his case, it meant a lot. It meant that it connected him to a world of principality that could affect him, make him feel a certain way, that that could make him suffer in a certain manner. And that it. Not only that, but being in contact with that transformed his perspective and made him start to believe in God, for example, or start to read the Bible and like, kind of move in that direction. Now, once again, does it mean that there are no mechanical causes? I mean, you know, you could say, well, you know, you're sleeping with his dogs in his bed. Maybe that's the origin of it. Maybe, maybe not. I don't know. There probably are mechanical causes that brought about the scratch marks that are on his body or the claw marks that are on his body. But the idea is just like, when can I say that? Just like when I ask my son to go get things for me, I am not Preoccupied by what shoes he's wearing or like, you know, or I'm not preoccupied by, I don't know what obstacle he'll have to move in order to get the thing that I'm asking him to get at the time, you know, and when he comes back, I'm not curious that, curious about all the secondary causes, you know, and how many neurons fired in his brain and how many muscles moved in his body and you know, how, what quantity of blood left his heart went into his arteries in the time that he was getting that thing from me. All those are mechanical causes for him to be able to do that. But I'm not that preoccupied, you know, by the mechanical causes because what interests me is the meaning. What interests me is the way in which a phenomena came together, you know, because if, if, if Tucker had only wok, let's say, if Tucker Carlson only woken up with scratch marks on his body, wouldn't he have had the same experience? And the answer is no. If he had woken up after that sense of like, oppression and pressure on his chest and, and, and, and let's say just the pressure on his chest, would he have had the same experience? No. If it had just had been a bad dream where he's dreaming and, and he feels like something is attacking him or something, and he would have woken up, he would he have felt the same thing. And the answer is no. Now it's all of those coming together, you know, that made the event, let's say a curse or made the event a reverse miracle or a dark moment, a moment where he encountered a principality that was trying to hurt him, you know. And so therefore that is a way to kind of understand, you know, how it is that events like that can happen and how they, they're real and they are a way in which wills or purposes can touch us and can affect us, even though we don't know how to account for all the mechanical causes that made it happen in reality. But that, like I said, it's important to remind us, so that's how all meaning making causality function. All causes that are produced by meaning have that same problem. It's just that some, you could say more stretched than others, you know, and some are, let's say, less difficult to believe in or less difficult to, to, to see through the, the meaning making causes, how something like that could have happened. And so, you know, I think it's important to kind of understand that that is in some ways you could say how also how blessings and curses function, you know, and so blessing and curses can and do affect other people. And sometimes you can trace, you could trace more easily the meaning making causalities in order to, to understand that, right? So think about it again in a way that is closer to the, the idea of the, of a, a placebo effect, for example, right? Where you could understand that a placebo effect could help you understand how a blessing could affect someone. Because you know, the doctor has authority and the doctor tells the patient, I'm going to give you this thing that's going to heal you. And even though they give them a sugar pill, the person experiences a healing. And so you can see that this is a kind of blessing, right? It's not exactly a blessing, but it can at least help you understand how blessing functions, which is that it is possible to affect someone's well being through meaning making by encouraging them by, by, you know, let's say using your authority in order to change their, their physical, even their physical state, you know. And so the question is, can you do that also negatively? The answer is of course you can. Of course you can do that negatively. You know, of course you can look at someone in a way that can make them sick. If you know what you're doing, you can say things to someone that will make them physically ill, right? That would make them lose their confidence, that will make them trip, they'll make them fall, you know, and it's not like a, just like all meaning making causalities. They're not, it's not direct, right? If I, if I throw a baseball at a certain strength in a certain direction, you can predict how it's going to fall. But if I ask my son to go get, to go get my, my shoes, for example, you know, then he might decide that he changes his mind on the way there. He might, you know, he, he might get distracted by something else. It might not happen. That's the problem with all types of causalities that happen through meaning. Like you could pass a law. And doesn't mean that everybody's going to follow the law. There are all kinds of things that can happen that would prevent it from happening. But it's also ridiculous to say that those types of causalities don't exist. Of course they exist because we see them experience them all the time. It's just that they don't have the same kind of mechanical predictability as, like I said, just measuring the arc of a projectile, for example. But we can't discount them because they're part of the world and we use them all the time. And so can you curse someone and that this will affect them and that this would make them have bad dreams or that it would make them have all kinds of bad effects on them? Of course that's possible. Now the question is, how much is it possible? Like, how far can that go? You know, and how many, like, layers of secondary meanings could you go through in order to do good to someone or to harm them? You know, for example, like, can I make you sick by saying bad things about, about cursing you through others? Like, could I do that? Could I say bad things about you to other people to make you, to put you in trouble? And the answer is, of course, you know that that's true, you know, and you could do it positively too. Can I bless you by going around and let's say, blessing you through others? And the answer is, of course I can. Now what's the extent to which that's possible? That's a harder one to, to delimit, right? It's a harder one to know how far it goes. But when you see something like that, like when you see someone like Tucker, who is a very honest person, who, he. He's constantly telling the truth and this happened to him like a year and a half ago and he finally said it to someone, you know, he. He's been keeping this private for a very long time. Is it possible that he was being attacked by someone or by a principality directly? And the answer is, I think it is possible. You know, now I kind of hesitate to talk about this kind of stuff. As you can tell, it's the first time that I actually talk about this directly because just because something is possible doesn't mean it's happening all the time. And this is again, one of the issues with meaning making causalities is that sometimes it's bullshit. Sometimes people who say they have influence or think they have influence are lying to you and they don't have what it takes to make it happen. And some, sometimes people say that things have happened to them that aren't true, and that's what makes it difficult, is that there is such a thing as someone who is. Becomes paranoid and sees demons attacking them all the time and sees, you know, all people that want ill of them cursing them or sending things to them or, you know, like there are people that, that, that are delusional and that is completely possible. But just because people are delusional doesn't mean that it can't happen. It's the same with miracles, by the way. You know, people will tell you that miracles don't exist by pointing to People who lied about miracles. And it's like the fact that people lie about miracles doesn't mean the miracle don't exist. And that's a ridiculous, that's a ridiculous thing, you know. You know, just like fraudulent, you know, vaccines doesn't mean that oh there therefore all vaccines are impossible or that, you know, fraudulent medicines or people who lie about certain, certain effects that certain medicines would have doesn't mean that then medicine is invalid. And it's the same with these types of events. It's the same with things that are caused by meaning. There are all kinds of delusions and illusions and people pretending and lying. All of this exists. But you know, there are moments when these things also happen for real. And so I know that I might be pushing the more kind of secular types maybe beyond, beyond my reach. And, and I might get criticism that I haven't gotten yet before because I am trying to suggest that meaning really does, really does cause reality. And some people can do it in ways that it's difficult to account for how it is that the connection between the meaning and the event is. But, but I also believe that to be true. I also believe that, that these things are possible. And you know, and I've seen it happen. And we don't see these things happen as much here, but they in. There are certain places in the world where these types of actions are still very much available to people and people engage in them all the time and others actually feel the consequences of that. So. So anyways, hope this was helpful. It's kind of like a post Halloween, maybe post a video. Hope it was helpful to kind of help you understand a little bit of how it is that these things are possible or maybe not. At least it will get you to start thinking about it. And so thanks everyone for your time. And don't forget, you can always sign up to the symbolicworld.com we have different levels of membership. Members have access to all kinds of things, extra videos, discounts on our different, different courses and all kinds of great stuff, including a great community with people that you can interact with. So thanks again for your time, your support and I'll talk to you very soon."}
{"episode_id":"SW - #368 - 2024-12-13 - Symbolism Explained - Tucker Carlson Attacked by a Demon","start":1737.74,"end":1803.21,"speaker":"Laura Diaz","text":"Bye bye Tucson. The weight is over. Medi Weight Loss. They're officially open on North Oracle Road. That's right, no more counting down the days. You can walk in right now and start your journey to a healthier you. Hey, it's Laura Diaz from iheartradio and you can trust me, this isn't just another weight loss clinic. I know that because it's where I lost weight safely with real medical support. GLP1 medications. You can see them everywhere online right now. But the truth is your health shouldn't be a DIY project ordering these meds without the professional guidance. It can lead to dangerous mistakes, wrong doses, no oversight, and serious risks. At mediweightloss, I got the same medication but with a customized plan, weekly check ins, and a licensed physician guiding me every step of the way and and the cost the same as those risky online options. Tucson, your moment is here. If you're ready to take control, feel better and lose weight the right way, mediweightloss is ready for you. Walk in, get started and see real results. Call or visit mediweightloss.com to learn more and book your free consultation today. That's mediweightloss.com Limu Emu and Doug here."}
{"episode_id":"SW - #368 - 2024-12-13 - Symbolism Explained - Tucker Carlson Attacked by a Demon","start":1803.21,"end":1812.02,"speaker":"Jonathan Pageau","text":"We have the Limu Imu in its natural habitat, helping people customize their car insurance and save hundreds with Liberty Mutual."}
{"episode_id":"SW - #368 - 2024-12-13 - Symbolism Explained - Tucker Carlson Attacked by a Demon","start":1813.14,"end":1817.14,"speaker":"Laura Diaz","text":"Fascinating. It's accompanied by his natural ally, Doug."}
{"episode_id":"SW - #368 - 2024-12-13 - Symbolism Explained - Tucker Carlson Attacked by a Demon","start":1817.7,"end":1821.82,"speaker":"Jonathan Pageau","text":"Limu is that guy with the binoculars watching us. Cut the camera. They see us."}
{"episode_id":"SW - #368 - 2024-12-13 - Symbolism Explained - Tucker Carlson Attacked by a Demon","start":1821.82,"end":1823.9,"speaker":"Laura Diaz","text":"Only pay for what you need at libertymutual."}
{"episode_id":"SW - #368 - 2024-12-13 - Symbolism Explained - Tucker Carlson Attacked by a Demon","start":1823.9,"end":1829.86,"speaker":"Jonathan Pageau","text":"Com Liberty Liberty Liberty Liberty Savings Ferry. Underwritten by Liberty Mutual Insurance Company and affiliates. Excludes Massachusetts."}
