{"episode_id":"SW - #401 - 2025-07-25 - Robin Hood - The Original Green Man (Nottingham talk)","start":0.16,"end":59.17,"speaker":"Laura Diaz","text":"Tucson, the weight is over Mediweight loss. They're officially open on North Oracle road. That's right. No more counting down the days. You can walk in right now and start your journey to a healthier you. Hey, it's Laura Diaz from iheartradio and you can trust me. This isn't just another weight loss clinic. I know that because it's where I lost weight safely with real medical support. GLP1 medications. You can see them everywhere online right now. But the truth is your health shouldn't be a DIY project ordering these meds without the professional guidance. It can lead to dangerous mistakes, wrong doses, no oversight, and serious risks. At mediweight loss. I got the same medication but with a customized plan, weekly check ins, and a licensed physician guiding me every step of the way. And the cost? The same as those risky online options. Tucson, your moment is here. If you're ready to take control, feel better, and lose weight the right way, mediweight loss is ready for you. Walk in, get started and see real results. Call or visit mediweightloss.com to learn more and book your free consultation today."}
{"episode_id":"SW - #401 - 2025-07-25 - Robin Hood - The Original Green Man (Nottingham talk)","start":59.25,"end":645.99,"speaker":"Jonathan Pageau","text":"That's mediweightloss.com as Robin Hood kind of develops, you know, into the Tudor period, you really get the sense that one of the things that motivates Robin Hood, two things. One is his love for a virtuous maiden, which at the time would have been seen as very much an honorable pursuit. His love of Maid Marian becomes something that is beyond his. His thuggery, you could say. But then the more interesting part is the idea that he is. He's an aristocrat, right? He's a lord that has lost his. He has lost his place. Because now Prince John or the sheriff of Nottingham or whoever's in authority is corrupt and has taken from him that place. But he also knows that he is not the king, that he can't take that role. And so he remains faithful to the true king, right? He remains faithful to King Richard who is away. And he just finds a way to exist in that inverted world where the authority has become illegitimate, pokes at it, plays with it, and tries to survive until the king returns and restores order. And so what happens in that place is that Robin Hood becomes an image of everything that opposes authority. But does it? We'll see as we look at the story, does it in a very fascinating way which is different from simple rebellion and simple revolution. This is Jonathan Pedro Welco. Welcome to the symbolic world. What you're about to see is a talk I Gave in Nottingham, England on Robin Hood. As some of you know, I've been traveling quite a bit in the past few weeks. I was in England, in France, Also went to Istanbul to film a documentary with John Reva. But this little part was something that I couldn't refuse. I was invited to come speak about Robin Hood in his area near Sherwood Forest, obviously in Nottingham. It was at the Southwell Cathedral there. And so it was really quite a joy. What's funny is that the person who organized the event gave the talk a title because I was just not giving her a title. And the title was something like Robin Hood, the Original Green Man. And so this title forced me to think about Robin Hood in a very different way and end ended up with me making a relationship between Robin Hood, a very strange character in the Quran, and Merlin. And so I think you will definitely enjoy this. And don't forget, if you love what we're doing, don't forget to go to the symbolicworld.com and you can sign up, become a member for free. You can participate in a community of people discussing symbolism, but it's also the place where you can support what I'm doing financially. People who support it, support my work financially, also get extra videos, all kinds of other little perks. But it's also the way that I support my family doing this. And so I hope you enjoy this conversation. I certainly had a great time there looking at that cathedral. It's also amazing with all the little monsters and gargoyles all over the cathedral. And so please enjoy. It's really a joy to be here. I was coming to the UK to do a few things, and just completely out of the blue, I get a message from Alison's husband, John Milbank, on Twitter, something about Robin Hood. And I gave a little quip about what I think Robin Hood is about. And then he said, do you want to come to Nottingham to talk about Robin Hood? Well, how could I say no to that? So it's really a joy to be here. And so I am very much the opposite of those historians. You know, I care about the manner in which we remember stories, the manner in which we celebrate them. And so for me, the entire story of Robin Hood, from the origins in terms of the first ballads, all the way to the Disney movie and to the way that it's been transmitted and remembered, is part of the legend. There's something at the core of that that in some ways you could say that people are asking. What are the questions that people are asking? Stories are not just for entertainment. They have a function in society, like working out things you could say in images to try to understand certain aspects of the world. And one of the things I think that Robin Hood is doing, you could say for us, is he's trying to help us understand. What do you do when authority becomes illegitimate? How do you deal with that? How can you be a virtuous rebel? Is there such a thing as a virtuous rebel? What's the difference between a virtuous rebel, common thug, a revolutionary? What is the difference between all those types of characters? And I think that the Robin Hood story, as it develops, starts to refine and to ask questions about that. There are, of course, all kinds of historical contingencies which bring the story to where it is. You could say necessarily the Reformation has an effect on the character. Now, thinking about rebellion somewhat differently, thinking about the relationship to authority differently. The Tudor period also. So all of this we can say, yes, there are definitely historical contingencies which bring us that bring the character along and skew or start to twist the way that he's told. But we can mostly, and more interestingly, just look at the stories themselves and what it is that the stories are doing and how it is that we receive them and interact with them. And so another thing that I started to ask myself as I was looking at the question of Robin Hood is, does he resemble other characters? One of the stories, I always. I'm a Christian. I always look back to scripture, and I ask myself, when any. For fairy tale, for any kind of story, I ask myself, is there a version of his story in the Bible? And it turns out, actually there's quite a bit of Robin Hood in the scripture. Took me a while to kind of get it, but when I found the line, I realized that it actually follows quite powerfully. And you see it in the story of King David. There's actually quite a relationship between the story of King David and the story of Robin Hood. Because the story of King David is also, at least the first part, the part before David becomes king. It's about how to be honorable, how to be a heroic figure, and how to live in a world where authority has become illegitimate. Not only illegitimate, but hostile to you. Right? How do we. How to act when the king is trying to kill you? But you also know that killing the king is wrong. If I kill the king or if I try to put myself in the place of the king, that revolutionary act will bring about a breakdown, will bring about chaos. And so the parallels become very, very interesting as Robin Hood kind of develops into the Tudor period. You really get the sense that one of the things that motivates Robin Hood, two things. One is his love for a virtuous maiden, which at the time would have been seen as very much an honorable pursuit. His love of Maid Marian becomes something that is beyond his thuggery, you could say. But then the more interesting part is the idea that he is. He's an aristocrat, right? He's a lord that has lost his. He has lost his place. Because now Prince John or the Sheriff of Nottingham or whoever is in authority is corrupt and has taken from him that place. But he also knows that he is not the king, that he can't take that role. And so he remains faithful to the true king, right? He remains faithful to King Richard, who is away. And he just finds a way to exist in. In that. Let's say, in that inverted world where the authority has become illegitimate, pokes at it, plays with it, and tries to survive until the king returns and restores order. And so what happens in that place is that Robin Hood becomes a image of everything that opposes authority. But does it? We'll see as we look at the story. Does it in a very fascinating way, which is different from simple rebellion and simple revolution. When I proposed this talk to Alison, I was very busy and I was moving around, and I never gave a title to the talk. So Alison just made up a title. She said, I have to put a title on the poster. And so she said, I don't even remember. It's Robin Hood, the original Green man, you know. And when I finally saw the title, I thought, oh, that's not really what I wanted to talk about."}
{"episode_id":"SW - #401 - 2025-07-25 - Robin Hood - The Original Green Man (Nottingham talk)","start":647.99,"end":649.03,"speaker":"Alison","text":"Just ignore it."}
{"episode_id":"SW - #401 - 2025-07-25 - Robin Hood - The Original Green Man (Nottingham talk)","start":652.15,"end":1866.53,"speaker":"Jonathan Pageau","text":"But then I thought, how is it that I can. How can I connect all of these things together? What's the connection between the Green Man? I've had a lot of joy to come here and visit the cathedral and. And go through the church and see all of the little funny figures and all the little monsters and gargoyles, you know, on these architectural. These architectural transition spaces, either on the outside or on the screen, that is this kind of transition between these holy spaces. And of course, many of those are these kind of green men. And then I started to think and to wonder, like, where have I seen this? You know, today is the day of Pentecost. It's very fascinating that I'm giving the talk today. I'm from an Orthodox tradition. I follow Eastern Orthodoxy. On the day of Pentecost, you know, what we do in the church, we actually decorate the entire church with greenery. No flowers, just green. We bring in boughs of different plants that have just come out for May. We put them up on the icon screen. So the icon screen just covered with this greenery. It looks like you're in this wild. This wild place, this wild garden. And I also remember in the story of the Green Knight that he poses his challenge on Pentecost, right? In the story of Gawain and the Green Knight, he comes in to King Arthur's court and he proposes this challenge. Who would be willing to cut his head off on the day of Pentecost? And so what is happening? Very odd. Very odd relationships. And, you know, Robin Hood is the green man for all intents and purposes. That's how we represent him in popular culture. If you try to get an image of Robin Hood in your mind, he's wearing green, he's got that hat. And so we have this connection with Robin Hood and the notion of the green. And in the earlier stories of Robin Hood, we know that at the end of the story, even though he becomes reconciled with the king, he has this desire to return back to the forest, to go back into the woods. You know, he is in some ways an image of what the forest represents for us, that you could call the forest in this sense. It's like a. It's the border of that which is ordered, right? It's the place where the city stops. And now you go into the mysterious liminal spaces of the outside. And that's what Robin Hood comes to represent. He seems to be gathering all of these images of liminality into himself. But interestingly enough, he takes them in and finally puts them into the service of the king, which is not ridiculous. You know, it makes sense. We do have these monsters on our churches. And so in a church, the gargoyles are all of that. They are the merry men for all intents and purposes, right? They are these funny creatures that make us laugh, that break protocol, that break the rules, that present us hybridity and strangeness and all kinds of twisty things. But ultimately, they are there in a greater story to kind of serve. To serve God, ultimately, which many Protestants I remember I grew up in a very kind of very fundamentalist Protestant world. And it was very difficult for people to understand gargoyles. It's like, why do they have these little devils on the churches? What is the role of that? And it's honestly, it's not that hard to understand. If we get into it. It has to do with humor, has to do with Jest, Right. It has to do with the secular in general, which is where the Robin Hood tradition kind of comes up. But Robin Hood doesn't come out of a religious tradition. It comes out of the secular world. The early stories really are in some ways a way for the folk to poke at the hierarchy, a way for the folk to make fun of the clergy, to make fun of the authorities. And this is a. This, you know, it's the. It's a carnival of some sort. It's a kind of carnival aesthetic where there's a moment in the year, there's a place in society for poking at the king. Right. We have that jester character that is in the court of the king and is in some ways there to show the insufficiencies and takes on all the roles that when you look at them at face value, they're actually subversive. It's a subversive gesture, but ultimately it's a subversive gesture that acts to show you the limit of the authority that is there in place. Because one of the problems with any authority, even legitimate authority, is that sometimes it can start to take itself for God. It can start to think that it is so divinely ordered that it cannot go wrong, that it cannot make mistakes. So we need a little bit of humiliation for those people on the edges. It's almost necessary to kind of make the system. Make the system function properly. So that's why Robin Hood has all of these. He's a trickster. He dresses up, he goes out, he pretends to be something else. He steals from the rich. Ultimately, we say that, then he gives to the poor. And so again, even in that gesture, he's different from a common thug, because a common thug steals from the rich for himself. And so he would become just a mirror of the sheriff who steals from the poor for himself. So we often. We have tropes in our culture which are in some ways revenge tropes. You know, we have kind of comeuppance tropes. And those are interesting and they're fine. But ultimately, if you want to have a full story, the idea that, you know, a poor person steals from a rich person just to fill their pockets morally is not. See, it doesn't seem that better than the other way around. And so this funny little aspect of the Robin Hood story, which is that he steals for a higher purpose, it's very odd. It's not a normal morality. It's a strange morality of the edge, you could call it. But it does participate in the way that Robin Hood is in some ways a trickster for trickster for the true purpose, a trickster for the king. You could maybe even say a trickster kind of trickster for God, you know, in the way that King David becomes. So let's look at King David, because that's what I started you off with. And some people, not that many people, know the story of King David that much. But King David is anointed king in a time when there's already a king. So the prophet anoints him, and so he's hidden. He's a secret king. And there's already a king in power. And that king is becoming tyrannical, he's becoming authoritarian. And David in some ways now becomes a slippery snake that tries to avoid getting caught by King Saul. There's a little story that exemplifies all of that, a very small story where David is a musician king, right? And he. The music, the musical part, is importantly part of this story. You know, if you think of the merry men, you obviously, they're singing necessarily in your imagination, you know. And also all of these are secular ballads that would have been in the folk, and people would have heard these ballads in the very secular spaces. So this aspect of music and ballads is there already in the story of King David, where he's sitting and playing music for the king to rest the king's soul. And the king loses his temper and tries to pin down David with his lance, tries to pin him to the wall, to fix him, you could say. And David has to escape that tyranny, has to escape the power that tries to fix something, to hold it in place. And it's funny because even in scripture, but we have another version of that story, a story of an authority figure that pierces something with the lance. Who can remember it? I don't know if you have images of it here, right. That even in England, we see it often, that image of St. Michael or the image of St. George, of this kingly figure, this knightly figure that pins down the snake. But in this case, the whole thing is upside down. The whole thing is reversed. Now it's the snake who's the hero in this story. The snake is the one who's trying to avoid authority, who's trying to avoid being pinned down, struck down, held down by the authority, the authority figure. So you realize, oh, there's stories like that in scripture. Yeah, yeah, yeah. It's very interesting. Scripture is really a great story. Once you start to see what it is that's going on, then after that King David now has to escape King Saul and what does he do? He joins with a group of thieves and of debtors, of discontented men, and he lives in the wilderness and he lives in a cave in order to hide from King Saul. Right, interesting. Sounds a lot like our friend Robin Hood, who lives out in the forest with his band of merry men and his band of discontents, of people that don't have a place in society. You know, somewhat raucous clergy, you know, giants, and all of these rather odd figures that don't seem to fit in society. Those are the figures that Robin Hood allies with in the forest. And already in the story of King David, you see that that relationship is already there. One time David finds himself in a bind and he has to pretend that he's crazy and he makes himself look like a madman and he drools and I think he comes up to the door and he drools on the door of the city and he's able to escape because he pretends and he hides and he wears costumes and all of that beautifully. Again, is in the story of Robin H. Where Robin Hood has to pretend to be something he's not. Now that. Think about that, pretending to be something you're not. You could say that that is, on technical terms, that's what we called sinning, right? Doing something, thinking something, and doing the opposite, right? The idea of the trickery that is, in some ways, technically, it's something like a sin. It's missing the mark. It's pretending to be something and then doing something secretly at the same time. But in this case, all of a sudden, that type of behavior, because it's secretly for a higher good, becomes part of the story, right? So now the trickery is almost like a. You could say it's not usual trickery, but you couldn't tell if you saw it from the outside. But if you just saw Robin Hood and his men in the woods ambushing a nobleman and taking their money, there'd be no way to know that in their heart, right in the secret of their heart, they're actually doing this to help the people in need. They're actually doing this to help the poor. And so this is what's interesting about this place in the story, the place of the character. This is the carnival place or this kind of upside down place in stories where things are not what they seem and the trickster is acting in all kinds of ways. In this version, everything kind of turns back ultimately in the end. Another aspect of the story of King David that is Definitely related to this is actually the story of killing Goliath. And this is where in the Robin Hood story. I think this is weird to say this, but I think that Robin Hood outdoes David as a trickster to some extent. And I'll tell you why. When David comes and kills Goliath, there's a little part of the story that often we ignore, but can help you understand what it is that's going on. There's a type of story that's really universal. You could call it a river crossing story. It's a. It's a water crossing story. So you come to the end of something like an end of a world or the end of a land. And now there's a river. And the river presents itself as a test. And the test can be all kinds of things. It could be the Billy Goats Gruff, where you have an ogre under the bridge and the ogre comes up and wants to eat you to prevent you from crossing over. If you know the story of the gingerbread man, same story. Gingerbread man gets tricked by the fox, gets on its back. So he doesn't make it across. He goes across, the fox eats him. Many, many. There's so many stories. Actually, one of the greatest ones is the one in Genesis. The whole world falls into corruption, corruption, corruption. And now we have this problem. We have giants that are roaming the land, these horrible monsters that are roaming the land. And so God destroys the world, but gives one man a boat so that he can cross the waters, right, and start the world again. Another version. Sorry, I'm just listing them off here. But it's interesting. When the Israelites go back to the promised land, they repeat that story backwards. The story of Genesis, interestingly enough, they get to the Jordan river, and then they cross the Jordan river with a different kind of ark. And now they have to fight the giants in the land of Canaan in order to reclaim their land. So this interesting connection of the giant, the river, the crossing, the monster, all of this is there. And one of the things that happens in the story of King David is we forget that when King David comes to fight Goliath, it says that before he fights him, he takes five stones from the river. So it's there to remind. You can see it in your mind. So it's, he's walking towards the giant on the other side of some kind of brook, and then he takes the stones and then he fights the giant. So you think, oh, that's super interesting. But David kills the giant. Maybe the reason why David kills The giant is because he's secretly the king. That's what I think is going on. But Robin Hood is much more of a trickster. Everything about Robin Hood is much more topsy turvy because Robin Hood also encounters a giant at a river, right? You know the story he meets Little John on a log bridge, and so Robin Hood wants to cross the bridge. It's such a mythical theme, you know, this monster in the liminal space. And now you have to cross the bridge, but the monster won't let you cross, so Little John won't let you cross. And he says, well, fight me, and if you beat me, I'll let you cross. But Robin Hood loses. That's very interesting. Robin Hood actually loses to Little John, falls in the river, and it's by losing to Little John that he gained, that he wins him, all right. It's by losing to the giant that he brings the giant into his band of merry men. I think it's very unique. I tried to find other versions of this, and they're very. I couldn't really find one. The only thing that kind of looks like that story that I could think of is actually the story of Jacob. In the story of Jacob, you have a little bit of that because you know that Jacob fights the angel and he loses to the angel, right? And in losing to the angel, he receives a blessing. What people usually forget again in that story, for a reason that I don't understand, is that it also says that it's next to a river. He fights this angel right next to a river, and in losing, he joins, but it's not exactly the same, because an angel, sometimes it can be a bit of a monster, but it's not quite a monster. But in this case, he loses. And then when you look at Robin Hood's story, you'll see that, oh, there are several versions, iterations of this game that Robin Hood is playing about how on the edge of the river, he actually loses. Right. If you know the story of Friar Tuck, there's one version of his meeting with Friar Tuck that has to do with this. Robin Hood discovers that Friar Tuck that there's this wily friar that supposedly can handle a bo staff that can fight. So Robin Hood goes to see him next to a river, of course, and he demands of Friar Tuck. He says, cross me over the river. I'm going to get on your back and you're going to cross me over the river. And so Friar Tuck agrees, puts Robin Hood on his back, crosses him over the river. But the joke on the other side is Friar Tuck says, okay, well, now it's your turn. You have to cross me back over the river. And Robin Hood is saying, no, I'm not going to do that. So, okay, so that means that we have to fight. And so they fight, they duke it out, and again, Robin Hood loses the fight. He loses the fight. And then he does carry Friar Tuck back over the river to the other side. And so this funny, interesting situation where this trickster lets himself be tricked or becomes tricked, and in that ends up serving, you know, ends up bringing these people into his band. And so he actually then becomes their leader, which is weird, right? Usually think of just any mythological story. Think of Gilgamesh. And Enkidu is a great example of this usual trope where Gilgamesh is this image of the king of authority, of power. And Enkidu is a wild man who lives in the forest and is half animal, half man. He's representation of all the greenery, all of that kind of all of that forest figure. But Gilgamesh beats Enkidu and in beating him, becomes his friend and joins him into his, you know, into his service. But now again, Robin Hood flips that upside down. And that is what is, to me, interesting about the Robin Hood story, that there is a sense in which, in the story there is a. There is a very Christian element there. There's something about the idea that it is possible to. How can you say this? That it is possible to submit or to lose or to. To give up, but then ultimately to win. That it's not that. The, the image of power, right? The image of subjecting the. Subjecting the, the snake to, you know, all of that is fine. Doesn't mean that we get rid of that story. But in the Robin Hood story and in these kinds of story, you can see this trick that's happening, this surprise that's happening, you know, of in some ways giving in and then ultimately, but ultimately serving. Doing that to serve a higher purpose or to kind of join someone to a higher purpose. And that's what's amazing about the Robin Hood story is because all of these elements kind of come together in his story to show that that's what. That's what it is that he seems to be representing. In some ways, he is this upside down world, right? This kind of carnival jesting world of laughter and of merry men and of transgression and of thievery. All of these things are part of his world, but ultimately they are not revolutionary. They are not there to remove the power that's in place, but ultimately actually to serve the highest power."}
{"episode_id":"SW - #401 - 2025-07-25 - Robin Hood - The Original Green Man (Nottingham talk)","start":1867.57,"end":1909.53,"speaker":"Sarah","text":"Hi, this is Sarah from Hamilton, and I'm very happy to announce my first course with symbolic world Scripture, the Key to Reality. Over the span of five weeks, we will look at the scriptural vision of reality through the lens of the Temple. We will see how all the details of Scripture orbit around the person of Jesus Christ, the eternal word of God and archetype of the world. And we will see how that christological vision firmly earths in place the concrete details of Israel's Torah and story. Through that lens, you will come to see how meaning and matter intersect and intertwine, not only in the text of Scripture, but in the very tapestry of reality unveiled by the Bible."}
{"episode_id":"SW - #401 - 2025-07-25 - Robin Hood - The Original Green Man (Nottingham talk)","start":1913.62,"end":2433.05,"speaker":"Jonathan Pageau","text":"It's good to think about that for us, because, you know, there might come a time, and there has been times in the world where that has happened, right? Where even though maybe we're Christians, I don't know if everyone here is. I know I am. And you come in a position where all of a sudden authority becomes to act in an illegitimate way, or that authority becomes illegitimate or that it becomes corrupt. And so how do we act? Facing a corrupt authority and resisting that authority, while also understanding that if I replace it, imagine if Robin Hood had said, king John, Sheriff of Nottingham, obviously these are corrupt officials. So what am I going to do? I'm going to take their power. I'm going to declare myself the king, declare myself the sheriff. Well, we know what that looks like. We know what happens when something like that happens. We've seen too many stories of revolution in the 20th century, and we know that it always leads to tyranny. It always leads to a form of tyranny, because the person that takes the power for themselves has no way of justifying it except for force, right? They have no legitimacy in their power except for force. So the problem is, how do we act? How do we play the trickster? How do we evade the corruption? How do we evade the authority while serving a higher good? And they're really. There's some interesting examples in the. Our own tradition, the Christian tradition, where people have done exactly that in a beautiful way. One of the. One of the versions that I, That I love to. I want to make sure I don't forget some things here. One of the versions that I love the most is St Francis of Assisi. There are some beautiful stories about St Francis where he comes, you'd say, and someone presents to him a corrupt priest and says, look at this one, you know, look at him I don't know. He has a mistress or he's doing. He's a corrupt priest. What about him? What do we do about him? And St. Francis in this particular story, he says, oh, no, he says, I am not worthy of being in this, of this priest's presence. And he bows down to the ground and he kisses this priest's feet, you know. And in lowering himself before the priest, he shamed the priest in a way that any other behavior would not have done. And he shames them so much that the priest changes his ways. And there are many interesting versions of that. The most powerful version is of course, the ultimate trick that Christians believe in, which is the trick of the crucifixion. That is the ultimate trick, the biggest trick ever played in the history of the world. There's a. There's an apocryphal text called the Gospel of Nicodemus in which it describes Christ going down into death and said, the way the story goes in this version is that Christ is being crucified and in hell. The devil and Hades are talking to each other and they're celebrating. Finally we did it. Finally we killed the great king. Finally we killed the great one. We are, we've now won. And then suddenly they hear a noise and they hear this explosion and they're. What is happening? And they realize that in having killed the incarnate one, all of a sudden that means that now he's coming down into death, that he's breaking down the doors of death and he's coming down. And all of a sudden what they thought was a victory was actually a loss. And the devil and Hades start to panic because now hell is being. Is being taken by Christ who's coming down and gathering all the people in order to bring them out of Hades. That is the ultimate version of how this trickery can kind of turn on itself. Another version that's interesting too is the story of St. Christopher. If you know this story, it's one of my favorite stories. And you also see this trickery kind of turn on itself in a way that serves a higher good. So St. Christopher, in this version of the story, what you get is you get a little bit of this story from the perspective of the monster, from the perspective of the giant. St. Christopher is a giant. In some versions, he's a giant dog headed, you know, kind of monstrous thing. And he wants to serve the strongest man. He, he realizes he's just this beast. He wants to serve the, the king, or serve a strong king. Finds this king, starts to serve the king. And then he realizes that the king is afraid of the devil. And so he tells the king, he says, who's this devil figure? Because Christopher wants to, his name is Reprobus. At the beginning he wants to serve the strongest man. So the king doesn't want to tell him. And so Christopher tricks the king. He says, well, if you don't tell me who the devil is, then I will leave your service. So the king is forced to reveal who the devil is to Reprobus. And of course it's a trick because then Reprobus leaves the king to go serve the devil. And so Reprobus goes, finds the devil, starts to serve the devil, and then one day he realizes that the devil is afraid of the cross. So he asks the devil, he says, what is this cross? Like what is this? What is this figure about? And of course the same thing happens. The devil says, I won't tell you because if I tell you leave my service, Reprobus plays the same trick, says if you don't tell me, I will leave your service. So the devil tells him about Christ. And Reprobus leaves the devil's service, has tricked the devil, which is not bad. Tricking the devil is pretty good. And then he goes to look for Christ. He can't find him, can't find Christ, can't find the strongest, can't find the greatest, the strongest emperor that has ever existed. And he meets a monk on his ways. And the monk says, well, I can help you find Christ if you want to find him. And he says, well, the way you can find Christ is you should pray. And you know, Reprobus is just a giant dog headed monster. I say I can't pray, I'm sorry, it's not going to happen. So okay, the monk says, well, maybe you could fast. If you fasted, maybe that would help you find Christmas. So Reprobate says, nope, I can't fast, that's not possible. And so the monk tells him to stand next to a river. Now we have the river reappearing in the story. He says, stand next to the river and you can carry people across. So Christopher stands by the river, carries people across, and one day a little baby, little child, little infant comes up to him and asks him to cross him over the river. And Christopher agrees, starts to cross him. And as he's crossing him, of course the baby becomes heavier and heavier and heavier. And Christopher is saying, what is, how is this possible? How can you be so heavy? And the child says, well, it's because I'm carrying The sins of the world. And so Christopher crosses him over the river and in different virgins. Sometimes that's where he's baptized as Christopher. Sometimes he is changed back into a normal person. But what's interesting is that it's a trick. The whole thing is a trick. The whole story is a trick again. In serving the weakest, he finds that he's actually serving the strongest. In the story, he's looking to serve strong people. But then finally, when he serves the weakest thing that you can imagine, this little baby, this little child that he is being tricked into serving the. The strongest. And so this idea of. In the Robin Hood story, in some ways of him losing to King John and losing to Friar Tuck, and in some ways being this marginal figure that is engaged in all this trickery and all of this, it's related to. It's related to these other stories. It's kind of playing amongst these other stories to help us understand what is the role of these. What is the role of these marginal figures? What is the role of carnival? What is the role of trickery? And then ultimately, what is the role of even these gargoyles that we see on the. On the churches? I want to make sure I don't go too long. What time is it?"}
{"episode_id":"SW - #401 - 2025-07-25 - Robin Hood - The Original Green Man (Nottingham talk)","start":2433.13,"end":2434.05,"speaker":"Alison","text":"Five more minutes."}
{"episode_id":"SW - #401 - 2025-07-25 - Robin Hood - The Original Green Man (Nottingham talk)","start":2434.05,"end":2772.35,"speaker":"Jonathan Pageau","text":"Five more minutes. All right. Okay. And so I wanted to bring it back to the idea of the Green man and this idea of the. Of this greenery. In the story of the greenery, there are all these interesting characters that appear. And one of the most interesting ones is actually from. Actually from Islamic tradition, there's a character in the Quran. He's not named in the Quran, but he's known in Islamic tradition as the Green Man. His name is Al Qadir. And in that story, you see this trickery playing out as well. In the story of Al Qadir, what happens is Moses finds out that this character who doesn't have a name in the Quran is the wisest character. And he wants to follow. He wants to receive teaching from this character. So he goes and finds him. And the character Al Qadir says, yes, you can study with me, but never question. Never question my teaching. If you question my teaching, you know I'm going to cast you out. So Moses agrees to do this, kind of starts to follow Al Qadir, and then Al Qir does horrible things. There's things that are completely nonsensical. One of the things he does is he goes into a city, finds a boat of a poor fisherman, and he rips a board off the boat and walks away. And there are different versions of what it is. And he does these things that. Look, one of them is actually kills a young man, which. That's pushing us, you know, a little far. Yeah. It's not. How can I say this? Like it is a Muslim story. It doesn't have exactly the same morality as ours, but he does these kind of horrible things. And every time, Moses is like, what are you doing? How could. Why are you ripping a piece off this boat? Why are you doing this? And every time, you know, Khidr says, you're not supposed to ask. You're not supposed to ask questions. And then at the end, finally, Kadir reveals all the secrets. He says, the reason why I took the piece off that boat is because there's a king who's coming to claim all the boats that are functional in the land. And so by removing a piece of the boat, the king won't take it from this poor man. And so a gesture that looked like it was nefarious was secretly hiding, a positive gesture. And what's interesting about the Al Qaedir story is that there's a version of that story that for some, I don't know how it happened, but it seeps its way into Christianity, it seeps its way into our legends, and it becomes a Merlin legend. So there's a legend of Merlin in a romance called the Romance of Silence, where Merlin is a wild man. He lives naked like an animal in the forest. And there's a character in the story who pretends to be a man because in order to inherit money from her father, so she's raised as a man. She pretends to be a man, but nobody knows. And for complicated reason, the king sends her out to find Merlin and to tame Merlin to bring him back to the court. And so she goes out and she finds Merlin. She tames him with, like, milk and meet. It's like this really interesting scene. And then Merlin, coming back, sees all of these scandals, too. He sees a woman who is mourning her husband and a priest that's sensing the tomb. And Merlin's laughing. He just laughs. He sees these poor children that are begging on the side of the road. And Merlin laughs and he laughs and he laughs. And all through this, he's just laughing. Then he gets to the king, to Arthur's court, and. And he sees Arthur come out with his wife. And he laughs and he laughs and he laughs, and he's just laughing at everyone, mocking everyone. And finally the king says, you have to tell us what you're doing, or else you're in trouble. So finally, Merlin reveals all the secrets in the same way. He says he was laughing when the man that was dead and the wife was mourning him. She says, actually the wife, her lover is the priest, and the man that is dead is better off dead at this point. And then he says that for all he says, the children that were crying in front of this wall, what they don't know is that there's a treasure hidden right under the wall where they're begging. And that in fact, the biggest riches are there just hidden beneath them. So he reveals all the secret, and he reveals that this lady is actually a lady and everything is returned to order. And that's how the story of Robin Hood ends. You know, in this final version, really, it ends that. All of the trickery, all of the slipperiness, all of the taking from the rich and giving to the poor. When the king returns, the carnival ends and everything gets put black, gets put back into its proper order, right? And Robin Hood enters the service of the king and everything kind of returns into the normal order. And that's really the way to understand this story. But if you, you know, you're from around here, that's the way to understand all the carnival things that we do, right? All the. All of these jesting feasts that exist in the Christian church, some of them you have here now, right. On May Day during. During the Pentecost season, there are some of these kind of carnival traditions. And so hopefully this has helped you kind of understand a little bit how Robin Hood is one element of this way in which it is possible sometimes and in a certain way for upside down behavior and trickery to serve a higher good. So thank you."}
{"episode_id":"SW - #401 - 2025-07-25 - Robin Hood - The Original Green Man (Nottingham talk)","start":2785.61,"end":2804.17,"speaker":"Alison","text":"That was so rich. I'm sure it's going to have sent our minds in all sorts of interesting directions. Does anybody want to start us off on the first trail? I can see a hand. Yes. With the beer."}
{"episode_id":"SW - #401 - 2025-07-25 - Robin Hood - The Original Green Man (Nottingham talk)","start":2804.65,"end":2805.45,"speaker":"Jonathan Pageau","text":"Is there a."}
{"episode_id":"SW - #401 - 2025-07-25 - Robin Hood - The Original Green Man (Nottingham talk)","start":2806.17,"end":2812.57,"speaker":"Audience Member","text":"Is there a link between Little John and St. John as he throws him into the river and baptizes him?"}
{"episode_id":"SW - #401 - 2025-07-25 - Robin Hood - The Original Green Man (Nottingham talk)","start":2812.65,"end":2856.54,"speaker":"Jonathan Pageau","text":"Oh, I've never. Yeah. He said, is there a relationship between Little John and St. John? I've never thought about it. It could be a jest. A lot of the things in the Robin Hood stories, you always have to see them as kind of reversal. So it could be seen as a kind of. As a way of joking in which an accidental baptism happens, right. It's like it becomes a baptism story because a lot of the river crossing stories are actually baptism Stories like the story of St. Christopher. Right. I hope you got the sense that Christ was baptizing St. Christopher as he's carrying him across the river. So that's an interesting idea. It might be. Right. Yeah. Good insight."}
{"episode_id":"SW - #401 - 2025-07-25 - Robin Hood - The Original Green Man (Nottingham talk)","start":2861.83,"end":2862.87,"speaker":"Alison","text":"Yes, thanks."}
{"episode_id":"SW - #401 - 2025-07-25 - Robin Hood - The Original Green Man (Nottingham talk)","start":2863.67,"end":2883.95,"speaker":"Audience Member","text":"You mentioned Gawain and Green Knight at the beginning, and that got me thinking as you were talking about this kind of trickery. But there is a trick at the end of Gawain, right, where it eats the sash. And then ultimately that does work out well. But there, it strikes me there's something different going on in that. It's not ultimately for the. Initially at least, it's not for the highest good."}
{"episode_id":"SW - #401 - 2025-07-25 - Robin Hood - The Original Green Man (Nottingham talk)","start":2883.95,"end":2884.39,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #401 - 2025-07-25 - Robin Hood - The Original Green Man (Nottingham talk)","start":2884.71,"end":2886.88,"speaker":"Audience Member","text":"So I always want to invite you to say something about that."}
{"episode_id":"SW - #401 - 2025-07-25 - Robin Hood - The Original Green Man (Nottingham talk)","start":2888.16,"end":2991.24,"speaker":"Jonathan Pageau","text":"Yeah. So this is the story. I mean, the story of Gawain and the Green Knight is so subtle. It's a very, very subtle story, but I think the way of. Of understanding that aspect. Right. Because Gawain transgresses. Right. He actually sins in this case. It's an actual sin, and it's really considered to be a sin in this case. But I think that what the story is trying to kind of help us understand is more like the story of Jacob that we. That in our Christians, actually, our humility and our recognition of our sinfulness is secretly to our glory. Right. And so Gawain. Gawain beats his chest. Gawain sees himself as someone who missed and marked. And then everyone around him is saying, no, no, no, you did the best thing you could. You know, Arthur's saying, you did the best thing you could. I forget the name of the Green Knight character. He's saying, no, you did the best you could. But Gawain is not prideful. Right. He actually moves in humility. And I think that is in some ways the right way to see that trick, particular trick. Of course, the whole story of Gawain is about trickery. You know, he's being tricked in the castle. He's being tricked all the way through. And then finally that little part. But I think that's. If you load a little bit around the story of Sir Gawain and the story of the Order of the Garter, there's something of that going on where in some ways there's something embarrassing that happens. And instead of pretending and hiding it, you actually just call it out. You just say, yes, this happened. This embarrassing thing happened. And then it becomes a. It becomes to your glory."}
{"episode_id":"SW - #401 - 2025-07-25 - Robin Hood - The Original Green Man (Nottingham talk)","start":2993.48,"end":2994.36,"speaker":"Alison","text":"No, it's the best."}
{"episode_id":"SW - #401 - 2025-07-25 - Robin Hood - The Original Green Man (Nottingham talk)","start":2994.52,"end":2996.2,"speaker":"Audience Member","text":"Following on from the first question."}
{"episode_id":"SW - #401 - 2025-07-25 - Robin Hood - The Original Green Man (Nottingham talk)","start":3001.24,"end":3017.62,"speaker":"Jonathan Pageau","text":"Well, what I would say to that is I think you need to come to Alison's talk, because that is what her talk is going to be about. But everything that I think of that I've actually gotten from her, and I think that. Yes, but come to the talk. Yeah."}
{"episode_id":"SW - #401 - 2025-07-25 - Robin Hood - The Original Green Man (Nottingham talk)","start":3020.42,"end":3030.34,"speaker":"Alison","text":"And then when the king returned, did Roy would sort of keep his same standing or did he sort of go back into the forest and loose?"}
{"episode_id":"SW - #401 - 2025-07-25 - Robin Hood - The Original Green Man (Nottingham talk)","start":3030.58,"end":3053.12,"speaker":"Jonathan Pageau","text":"Yeah, there are different. I think in the early stories, I think he goes back to the forest, but I think in the early stories it's also that he's not necessarily seen as a noble that has lost. He's just a. He's more like a rebellious figure who will. Who allies with the king. But in the stories where he is in some ways a noble that has lost his title, then I think, yeah, he does then is restored. Everything is kind of restored. So."}
{"episode_id":"SW - #401 - 2025-07-25 - Robin Hood - The Original Green Man (Nottingham talk)","start":3053.12,"end":3055.04,"speaker":"Alison","text":"Yeah, there's somebody right at the back."}
{"episode_id":"SW - #401 - 2025-07-25 - Robin Hood - The Original Green Man (Nottingham talk)","start":3055.04,"end":3055.48,"speaker":"Jonathan Pageau","text":"Yes."}
{"episode_id":"SW - #401 - 2025-07-25 - Robin Hood - The Original Green Man (Nottingham talk)","start":3057.16,"end":3063.8,"speaker":"Audience Member","text":"I'm wondering what the difference would be between giants and monsters. Do we think figures on the periphery?"}
{"episode_id":"SW - #401 - 2025-07-25 - Robin Hood - The Original Green Man (Nottingham talk)","start":3063.8,"end":3141.82,"speaker":"Jonathan Pageau","text":"Yeah, I mean, different monsters have different characteristics, but ultimately, in terms of their meaning, usually they. They play the same kind of roles. You can think of a monster as something that doesn't fit. That's really the best way to think of a monster is that it's either. So it could be a very little man or a very big man, or it can be a mixture of things. It's basically things that don't fit that present to us as hybridity or excess or abnormality in that way. So a giant plays that role. The giant, per se. What it usually ends up representing in most of tradition is something like a body without a head, something like that. It's too much body. Right. So that's why giants, you know, their appetites, they eat. They want to eat you. That's part of that. They're very strong. You know, they hold up the sky. All of these old stories about these kind of giant figures that are in some ways power without authority. Right. So you know these stories about, you know, the. The cliche of the dwarf on the giant. Right. That's in some way like a kind of joke about. About something that's. That's more. It's like. Let's say it's something's more like a seed and then the body that's joined together in that kind of weird way."}
{"episode_id":"SW - #401 - 2025-07-25 - Robin Hood - The Original Green Man (Nottingham talk)","start":3148.78,"end":3161.15,"speaker":"Alison","text":"What you say and the references, a lot of that kind of confusion and trickery and so on. But it seems to me that at the bottom of it all, it's intentionality."}
{"episode_id":"SW - #401 - 2025-07-25 - Robin Hood - The Original Green Man (Nottingham talk)","start":3161.15,"end":3161.67,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #401 - 2025-07-25 - Robin Hood - The Original Green Man (Nottingham talk)","start":3161.75,"end":3178.78,"speaker":"Alison","text":"What is being intended. And sometimes it's. It's obscured by some of the. Like the man with the boat spoiling the boat. But this is surely it, isn't it long, the moral line. It's intentional."}
{"episode_id":"SW - #401 - 2025-07-25 - Robin Hood - The Original Green Man (Nottingham talk)","start":3178.78,"end":3179.18,"speaker":"Laura Diaz","text":"Yeah."}
{"episode_id":"SW - #401 - 2025-07-25 - Robin Hood - The Original Green Man (Nottingham talk)","start":3179.18,"end":3242.56,"speaker":"Jonathan Pageau","text":"Now, the thing that's interesting about intentionality is that in some ways, when there's a separation between the outward appearance and the intentionality from the. When you just look at what's happening, you can't tell the difference. It's a secret. Right. The difference is a secret. And that's what a lot of these stories are representing. It's to kind of show that when things are going wrong, when things are falling apart and the relationship between intentionality and outer gestures becomes impossible to discern, the intentionality appears as a secret. And that's what I mean, in some ways, that's what the story of Jesus. A lot of the story of Jesus has that in its story where he ends up being treated as a criminal. Anybody who would have walked by and seen this character being crucified would have said, well, yeah, here's a common chronicle being crucified, like all the other common criminals. And that there was no way to discern from just outward appearances what it is that was truly happening, the secret behind it. Yeah."}
{"episode_id":"SW - #401 - 2025-07-25 - Robin Hood - The Original Green Man (Nottingham talk)","start":3245.84,"end":3251.92,"speaker":"Audience Member","text":"Do you see a Robin Hood among any of our contemporary or recent political leaders?"}
{"episode_id":"SW - #401 - 2025-07-25 - Robin Hood - The Original Green Man (Nottingham talk)","start":3259.13,"end":3311.3,"speaker":"Jonathan Pageau","text":"Robin Hood? I mean, I think that it's. Robin Hood can't really. I don't think Robin Hood can really be a political leader. You know, I think that he has to be on the. On the edges. Right. He also has to. He has to be playing on the edges. And so, you know, it's hard because this is high. These things are highly political. But let's say there are characters that are contenders for that, people that are persecuted by the state very much. And then you find out that actually that we got the story wrong. That in fact that person was in the right. And that the state has, you know, kind of gathered this. Gathered all this energy to lie and to persecute and to slander and to do all that. And so you can think of your own version. But there has been several, you know, I think. Yeah."}
{"episode_id":"SW - #401 - 2025-07-25 - Robin Hood - The Original Green Man (Nottingham talk)","start":3313.38,"end":3315.06,"speaker":"Alison","text":"One at the front and another at the back."}
{"episode_id":"SW - #401 - 2025-07-25 - Robin Hood - The Original Green Man (Nottingham talk)","start":3315.14,"end":3319.7,"speaker":"Audience Member","text":"Sorry, just going to ask about the marksmanship element of Robin Hood."}
{"episode_id":"SW - #401 - 2025-07-25 - Robin Hood - The Original Green Man (Nottingham talk)","start":3319.86,"end":3352.43,"speaker":"Jonathan Pageau","text":"What you thought about that? Yeah, I mean, I think that that's actually to show this. Exactly what the lady there was saying is that he has aim, he has true aim, and that, you know, that true aim appears even though he's in costume, even though he's tricking, even though he's stealing. And he's jesting that all of a sudden, you know, all of a sudden if you're. If you're paying attention, you'll see that his arrow is absolutely true. And therefore it's kind of showing what he really is. Is that someone that has true aim got a good."}
{"episode_id":"SW - #401 - 2025-07-25 - Robin Hood - The Original Green Man (Nottingham talk)","start":3352.43,"end":3353.63,"speaker":"Alison","text":"A true vision of the good."}
{"episode_id":"SW - #401 - 2025-07-25 - Robin Hood - The Original Green Man (Nottingham talk)","start":3353.63,"end":3415.12,"speaker":"Jonathan Pageau","text":"Yeah, yeah, exactly. Yeah. Aristotelian says, yeah, he's not. Because the thing. This is actually just to add a little bit to this, because they just understand that it's not arbitrary, is that jesting is distraction. That's what jesting is. Jesting is playfulness. It's distraction. It's drinking, it's merrymaking. And shooting an arrow is the very opposite of that. Shooting an arrow is absolute attention, absolute vision, absolute directionality. And so that's the play, I think, that's happening in the. And just aesthetically, if you think of the character and the situation where he's acting a little silly and ridiculous and he's wearing a costume, and all of a sudden the arrow goes straight to the point. And then you think, oh, this is not. I'm not in the. Sit. I'm not where I thought I was. You know, he is, actually. And you. There are a lot of stories in fiction. You'll find these stories of someone who looks like he's drinking, that he's getting drunk, but then all of a sudden, like, you know, you realize that he's completely sober, completely attentive. So these are narrative tropes that are also fun because kind of it's a little flip in the story that you can do."}
{"episode_id":"SW - #401 - 2025-07-25 - Robin Hood - The Original Green Man (Nottingham talk)","start":3416.73,"end":3417.97,"speaker":"Alison","text":"There was somebody waiting at the back."}
{"episode_id":"SW - #401 - 2025-07-25 - Robin Hood - The Original Green Man (Nottingham talk)","start":3417.97,"end":3419.45,"speaker":"Jonathan Pageau","text":"Please. Thank you."}
{"episode_id":"SW - #401 - 2025-07-25 - Robin Hood - The Original Green Man (Nottingham talk)","start":3420.01,"end":3429.29,"speaker":"Audience Member","text":"You're talking about intentions and aims and the highest goods, the ends, just by the means. Are you saying that?"}
{"episode_id":"SW - #401 - 2025-07-25 - Robin Hood - The Original Green Man (Nottingham talk)","start":3429.77,"end":3523.85,"speaker":"Jonathan Pageau","text":"No. So I think no. But I think that in the case of Robin Hood, you know, how can I say this? At least what I understand is that he doesn't. He plays in that world, but he always careful to remain honorable in his actions. Right. So he takes from the rich and he gives to the poor, but his ultimate aim is, hopefully, is the restoration of the king. And so then even his means end up actually secretly being fine. Like, even his means are not complete. They're not completely out of bounds. Like, he remains honorable and he'll show that. Honorable. I mean, I don't know if there are stories of him just killing the people he steals from. I don't think so. At least if there were, in the older stories, those have been kind of eliminated where it's usually some kind of humiliation and then leaving the character there. And so, yeah, I would say. And especially like a story where the idea of the end justifies the means would probably end up looking more like a revolutionary story. Right. Because what's interesting about Robinhood, too, is that he accepts to be humiliated himself, or you see that happen. That's why the Little John story is so funny. That's why the Friar Tuck story is so funny, is that he's actually humble. Right. He's not. He gets taken down and he laughs about it. And that creates this kind of amicability. Like he's very. People appreciate him for that. So, yeah. So obviously, I don't believe that the end justified the means here."}
{"episode_id":"SW - #401 - 2025-07-25 - Robin Hood - The Original Green Man (Nottingham talk)","start":3527.14,"end":3528.82,"speaker":"Audience Member","text":"Do you think Robin Hood was religious?"}
{"episode_id":"SW - #401 - 2025-07-25 - Robin Hood - The Original Green Man (Nottingham talk)","start":3529.54,"end":3582.79,"speaker":"Jonathan Pageau","text":"That. If Robin Hood was religious, like the actual Robin Hood, the one. The historical one. I think in the stories. I mean, all I have is the stories. I think in the stories, I think that it is a secular manner, a way to be in the secular sphere and to have everything that's secular. So it's important to see that. So it's like he's drinking, he's merry making, he's with a kind of rebellious friar. So there's. He's in. He really is in that secular world. But that underneath that, there's a way to kind of bring that together towards something which is attuned to God. But it's very. It's not explicit because it's not a religious story. It is a second. It's a second story through and through. I think so. But it ultimately. Well, maybe you'll. You'll. You'll have another opinion about the."}
{"episode_id":"SW - #401 - 2025-07-25 - Robin Hood - The Original Green Man (Nottingham talk)","start":3583.19,"end":3585.91,"speaker":"Alison","text":"You just take time out occasionally to go and pray."}
{"episode_id":"SW - #401 - 2025-07-25 - Robin Hood - The Original Green Man (Nottingham talk)","start":3585.91,"end":3601.11,"speaker":"Jonathan Pageau","text":"To pray. Okay, so there you go. So he is. There you go. So he is a Christian, then. Yeah, well, you. You said that because this is. I don't want to impede on your talk, but you said that in the early versions you had a great dedication to the. To the. Our Lady."}
{"episode_id":"SW - #401 - 2025-07-25 - Robin Hood - The Original Green Man (Nottingham talk)","start":3601.11,"end":3603.83,"speaker":"Alison","text":"Yes. Yeah, I'm not going to say more of yes."}
{"episode_id":"SW - #401 - 2025-07-25 - Robin Hood - The Original Green Man (Nottingham talk)","start":3603.83,"end":3607.31,"speaker":"Jonathan Pageau","text":"No, leave that as a. Yeah, just hold that space."}
{"episode_id":"SW - #401 - 2025-07-25 - Robin Hood - The Original Green Man (Nottingham talk)","start":3608.27,"end":3610.27,"speaker":"Alison","text":"Anybody waiting? Oh, yes, sorry."}
{"episode_id":"SW - #401 - 2025-07-25 - Robin Hood - The Original Green Man (Nottingham talk)","start":3610.27,"end":3618.43,"speaker":"Audience Member","text":"I'm wondering. There's a lot of different locations in the area, like the church, there's the cape. There's a major overhead."}
{"episode_id":"SW - #401 - 2025-07-25 - Robin Hood - The Original Green Man (Nottingham talk)","start":3618.99,"end":3620.15,"speaker":"Jonathan Pageau","text":"Do you have any thoughts on how."}
{"episode_id":"SW - #401 - 2025-07-25 - Robin Hood - The Original Green Man (Nottingham talk)","start":3620.15,"end":3622.27,"speaker":"Audience Member","text":"These locations relate to the stories?"}
{"episode_id":"SW - #401 - 2025-07-25 - Robin Hood - The Original Green Man (Nottingham talk)","start":3624.11,"end":3665.06,"speaker":"Jonathan Pageau","text":"I mean, I don't. I'm not a historian, but one thing I can maybe say about that, just to. It's something that Alison mentioned at the beginning, which is that you. What I understand he's had historians coming here and debunking all of these things, you know, debunking that he was here and there and was born there. There's a whole other way to get to this. And it has to do with celebration and memory, which is more important, honestly, than just finding some birth certificate. You know, the fact that some people remember something, celebrate it. And even, interestingly enough, even the fact that legends prop up, pop up around characters, you know, the modern historian might tell you, oh, this is a deformation."}
{"episode_id":"SW - #401 - 2025-07-25 - Robin Hood - The Original Green Man (Nottingham talk)","start":3665.06,"end":3665.34,"speaker":"Sarah","text":"Right?"}
{"episode_id":"SW - #401 - 2025-07-25 - Robin Hood - The Original Green Man (Nottingham talk)","start":3665.34,"end":3738.32,"speaker":"Jonathan Pageau","text":"It's a deformation of memory. It's kind of memory going off its rails. But I think it's the opposite. I think that it's actually when legends pop up around a character, it's so that we remember him. Right. It's not that we're forgetting. It's that it's actually an effort to remember and to kind of add a little bit so that that story doesn't go away. And I think that in terms of places, that's also true. The value of the memory that people have of Robin Hood hiding in this cave or going through this part of the forest or everything, it has a value in its own. And in the end, the historians, they can't. Historians can't know this. They have absolutely no way of knowing these things. How are they going to prove or disprove that a bandit living outlaw, like, lived in this or that place or this or that cave? They have no way of doing that. We're gonna find a paper trail for Robin Hood. It's ridiculous. So the celebration and the memory and our participation in that story is far more actually, I think, dependable in understanding what the story is than finding some. I'm being a little. Yeah, a little cheesy, but yeah, there you go. A little cheeky."}
{"episode_id":"SW - #401 - 2025-07-25 - Robin Hood - The Original Green Man (Nottingham talk)","start":3738.63,"end":3746.15,"speaker":"Alison","text":"So, yes, it's just interesting that this neighborhood, this area has found those stories generative."}
{"episode_id":"SW - #401 - 2025-07-25 - Robin Hood - The Original Green Man (Nottingham talk)","start":3746.31,"end":3746.79,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #401 - 2025-07-25 - Robin Hood - The Original Green Man (Nottingham talk)","start":3747.19,"end":3750.71,"speaker":"Alison","text":"That they live and so they're telling us something about ourselves."}
{"episode_id":"SW - #401 - 2025-07-25 - Robin Hood - The Original Green Man (Nottingham talk)","start":3750.71,"end":3751.35,"speaker":"Jonathan Pageau","text":"That's right."}
{"episode_id":"SW - #401 - 2025-07-25 - Robin Hood - The Original Green Man (Nottingham talk)","start":3752.15,"end":3758.95,"speaker":"Alison","text":"I don't know what anybody else."}
{"episode_id":"SW - #401 - 2025-07-25 - Robin Hood - The Original Green Man (Nottingham talk)","start":3758.95,"end":3759.91,"speaker":"Jonathan Pageau","text":"I think there's here the same."}
{"episode_id":"SW - #401 - 2025-07-25 - Robin Hood - The Original Green Man (Nottingham talk)","start":3760.87,"end":3775.44,"speaker":"Audience Member","text":"I'm just wondering if you can say something about the role of humor in Christianity. Because I'm reading the New Testament at the moment and I'm just not seeing humor in there. And I think it should have an important place. And I'm wondering, could say, yeah."}
{"episode_id":"SW - #401 - 2025-07-25 - Robin Hood - The Original Green Man (Nottingham talk)","start":3777.2,"end":3846.91,"speaker":"Jonathan Pageau","text":"There are, there are jokes in the Bible. You just have to. You have to know where they are. There is a joke in the New Testament that there's at least one. And it's. It's actually, it's in the darkest place ever. It's actually one of the darkest place is that when the disciples run away. You know that story, and it's in the Gospel of St. Mark where it says that one of the Roman soldiers grabs onto his coat and he runs away naked. That's a joke. It's a joke because they're. They're in a garden, right? They're in the Garden of Eden. And then this character ends up naked, but in a completely upside down way. Like in a completely ridiculous manner in which he's actually kind of fleeing the garden naked and his clothing is being taken away from him. So it's like the opposite of the Genesis story. So the book of Jonah is a. The whole book is a joke. The whole book of Jonah is. Read it with a bit of humor and you will. You will laugh out loud. It's quite funny. Yeah, it's all. It's all twisty and turny and upside down. It's really funny."}
{"episode_id":"SW - #401 - 2025-07-25 - Robin Hood - The Original Green Man (Nottingham talk)","start":3849.07,"end":3907.82,"speaker":"Alison","text":"I think Jesus tells a few little jokes. I think he's telling them to the woman at the well. For example, I wanted to ask you a bit about the trickery because it's a very traditional way to think about the death of Christ and meaning for Christians. And sometimes Christ is called the cheese in the mousetrap or in the early church. But then when you get to the time of. Into the later period, they begin to think it's not fair to trick the devil and therefore you can't have it anymore because you're tricking him. But are you really tricking him? That's the point. You gave a lovely example from the Gospel of Nicodemus. Well, did Jesus set out to trick the devil? Is Robin Hood. I mean, Robin Hood is obviously setting out to trick people, but is he really?"}
{"episode_id":"SW - #401 - 2025-07-25 - Robin Hood - The Original Green Man (Nottingham talk)","start":3908.54,"end":4065.53,"speaker":"Jonathan Pageau","text":"Yeah. So the best, I think if we take the story of the gospel, what's important to see is what a trick, like what a trick is and also what it means to kind of turn something upside down. Right. It's like to do something and then the opposite is what your true intention is. Okay, so that's kind of what a trick is. Right? You're doing something here and I'm actually doing something there. Right. Now, the nature of reality itself means that. That at some point will be turned back. It's going to turn back. It's going to be revealed to be false, to be an illusion, to be a lie. And so it is very important to understand the crucifixion and resurrection of Christ as a trick because the story starts as a trick in the garden, right. The devil, the snake, tricks Eve into taking the fruit. And so that trick has to undo itself. And the trick that we say that Christ plays on the devil is bigger than you think. It's bigger. It's cosmic. Christ is saying, you know that thing you did at the beginning, it led to this, right. You thought that you had it all. You thought that you had done this thing at the beginning, and that this was going to lead to a world of death. But actually it's leading to something which is greater than what was at the beginning. And so the resurrection of Christ becomes the final trick in the sense that it turns what happened in the garden back up on its feet. But even in a way that's even greater than what was there at the beginning, this image of the Incarnation as being in some ways, more than what Adam was in the garden. And so I think it's important to see that as the story and to understand that that's how trickery always kind of functions. And you can actually recognize a holy fool, you could say, from a regular fool, is that the holy fool wants the trick to come back on him. Usually that's the story of St. Francis, is a good one, where he ultimately, he humiliates himself. That's how the clown story is supposed to end. Right. The clown comes out and he puts a banana peel on the ground, and he gets everybody to trip on the banana peel, and everybody's laughing. The only way to end that sketch is for the clown to finally get distracted and then slip on the banana peel himself. That's how you end that story, because that's what tricks are, and that's how tricks function. And that's why the carnival ultimately leads to the restoration in the end. So."}
{"episode_id":"SW - #401 - 2025-07-25 - Robin Hood - The Original Green Man (Nottingham talk)","start":4067.37,"end":4070.01,"speaker":"Alison","text":"That'S wonderful. Thanks. Yeah."}
{"episode_id":"SW - #401 - 2025-07-25 - Robin Hood - The Original Green Man (Nottingham talk)","start":4070.01,"end":4072.01,"speaker":"Jonathan Pageau","text":"Just taking your comments."}
{"episode_id":"SW - #401 - 2025-07-25 - Robin Hood - The Original Green Man (Nottingham talk)","start":4072.65,"end":4075.22,"speaker":"Audience Member","text":"You've just made this quite a lot of these things."}
{"episode_id":"SW - #401 - 2025-07-25 - Robin Hood - The Original Green Man (Nottingham talk)","start":4075.22,"end":4077.3,"speaker":"Jonathan Pageau","text":"There's a sort of degree of multiplication."}
{"episode_id":"SW - #401 - 2025-07-25 - Robin Hood - The Original Green Man (Nottingham talk)","start":4077.38,"end":4083.26,"speaker":"Audience Member","text":"Isn't this idea that if you do something, then it will turn to the sender double or triple?"}
{"episode_id":"SW - #401 - 2025-07-25 - Robin Hood - The Original Green Man (Nottingham talk)","start":4083.26,"end":4083.7,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #401 - 2025-07-25 - Robin Hood - The Original Green Man (Nottingham talk)","start":4084.66,"end":4086.5,"speaker":"Alison","text":"With trigger, is there always that sense."}
{"episode_id":"SW - #401 - 2025-07-25 - Robin Hood - The Original Green Man (Nottingham talk)","start":4086.5,"end":4092.9,"speaker":"Audience Member","text":"Of an intensification or magnification that what comes back is greater than what?"}
{"episode_id":"SW - #401 - 2025-07-25 - Robin Hood - The Original Green Man (Nottingham talk)","start":4094.1,"end":4166.73,"speaker":"Jonathan Pageau","text":"Yeah, maybe. Yeah, in some ways. Because I don't. I don't. I never thought about it that way. But for sure, this whole, you know, it goes around, comes around idea that's captured in the idea of karma or whatever. We have these instant karma reels that you can see online. And so I think that that's right. What's interesting about that, I've never thought about it but one of the things you could think of is that what happens in a trick when you kind of try to falsify reality is that there are fruits. It has fruits. It actually brings about certain consequences. And by the time that those consequences have become ripe, when they come back to haunt you, they're actually much bigger. They've gathered a lot of body, right? And you know that every time, you know, it's like anybody here who's lied knows that. It's like you lie. You know, you try to dissimulate what's real and you lie. And then you let that fester. And then the consequences of it, they begin to grow. And all the things you hadn't planned that were part of the lie start to start to kind of gather. And then finally, when it comes to catch you, it's pretty. It's a dragon that's swelling you up, you know. So that's a good. I think that's good insight. Gosh."}
{"episode_id":"SW - #401 - 2025-07-25 - Robin Hood - The Original Green Man (Nottingham talk)","start":4166.81,"end":4168.97,"speaker":"Alison","text":"Well. Oh, okay, one more."}
{"episode_id":"SW - #401 - 2025-07-25 - Robin Hood - The Original Green Man (Nottingham talk)","start":4171.37,"end":4190.74,"speaker":"Audience Member","text":"If we just. If we can push the parallel between Jesus and Robin Hood and the idea that green man nature can manifest as a man who achieves victory through, marries the king and finally returns, and that's a secular story, why do we need that in parallel to the gospel stories?"}
{"episode_id":"SW - #401 - 2025-07-25 - Robin Hood - The Original Green Man (Nottingham talk)","start":4191.22,"end":4191.94,"speaker":"Jonathan Pageau","text":"What do you mean?"}
{"episode_id":"SW - #401 - 2025-07-25 - Robin Hood - The Original Green Man (Nottingham talk)","start":4193.3,"end":4198.18,"speaker":"Audience Member","text":"When we have the answer, perhaps the story in the gospel and the Bible. Why do you have a section?"}
{"episode_id":"SW - #401 - 2025-07-25 - Robin Hood - The Original Green Man (Nottingham talk)","start":4198.34,"end":4323.77,"speaker":"Jonathan Pageau","text":"Well, because. Because all the good stories are downstream from the gospel story. We would have no stories. You know, Rocky Balboa is downstream from the gospel story. Like any story that attracts your attention and kind of points you towards something that's good and true ends up being downstream from that story. The resurrection story, the story of Christ contains all the stories. I don't want to go into detail now, but it's actually. It's not just something that you say that sounds mystical, but, like, Christ actually is. If you look at it on face value, it could be, like, very contradictory because there are narrative tropes in ancient myth and in ancient stories. And Christ, for some reason, he just kind of has them all. And so he's like, he's a king. He's also a shepherd, and he's also an agriculturalist. He's a technician. You know, he's an artisan, he's a criminal, he's a teacher. I could keep going. He just weirdly accumulates all of these story tropes and characters in his story, and somehow it works. And then you end up with this very, very, very unique story. So I think that what you Asked about Robin Hood is true about the entirety of the Arthurian corpus. It's true of Dante, it's true of of all of the legends, all the fairy tales, all of that, that they contain a sliver of Christ. But so in terms of what you're saying now, let's say that this idea of the trickery that Christ plays is one aspect that's not what Christ is. Christ is not a trickster. There's an aspect of the trickster in Christ, but he's not a trickster. I mean, he's the king, for goodness sake. So Christ is the king and the trickster, right? He's all of the character. He's just all of the characters at the same time. So he becomes the source of our storytelling. That's really probably the best way of understanding it."}
{"episode_id":"SW - #401 - 2025-07-25 - Robin Hood - The Original Green Man (Nottingham talk)","start":4324.25,"end":4332.05,"speaker":"Alison","text":"And this is the Feast of Pentecost, when the disciples receive the Holy Spirit and immediately they start telling stories, right?"}
{"episode_id":"SW - #401 - 2025-07-25 - Robin Hood - The Original Green Man (Nottingham talk)","start":4332.05,"end":4363.07,"speaker":"Jonathan Pageau","text":"But not only that, but then they also tell the story in a way that everybody can understand in their specific context. And that's a good example. It's like Robin Hood or these different types of legends. They can be a sliver of the story of Christ which is accessible to regular guy who goes to the pub, you know, doesn't necessarily go to church very often, a few times a year. But he still is, without even knowing, participating on the margins in that story. You know, it's still part of his life."}
{"episode_id":"SW - #401 - 2025-07-25 - Robin Hood - The Original Green Man (Nottingham talk)","start":4366.06,"end":4378.86,"speaker":"Audience Member","text":"Between two. So we talk in the scriptures and we're talking sense story scriptures. So you cast in the scriptures as a story, you cast in Rob as a story."}
{"episode_id":"SW - #401 - 2025-07-25 - Robin Hood - The Original Green Man (Nottingham talk)","start":4380.94,"end":4382.3,"speaker":"Jonathan Pageau","text":"So both of them are stories."}
{"episode_id":"SW - #401 - 2025-07-25 - Robin Hood - The Original Green Man (Nottingham talk)","start":4397.56,"end":4406.44,"speaker":"Audience Member","text":"But I was saying that what we know is true. Jesus Christ is definitely true."}
{"episode_id":"SW - #401 - 2025-07-25 - Robin Hood - The Original Green Man (Nottingham talk)","start":4407.08,"end":4508.6,"speaker":"Jonathan Pageau","text":"Well, part of the story. So this. Yeah, so the story of Jesus is clearly a story, right? And in The Gospel of St. John, not only that, but it says that if we had written down all the things that Christ had done done, it would fill there would be not enough books in the world to contain them. And so we basically picked elements in the story of Christ which contract his story in a way that reveals who he is. Right. And so it's told as a story necessarily because nobody's telling me about like, you know, what color were his toenails, or like no one's telling me about what he ate on a tube. Like there are a bunch of things that Jesus did that we don't tell. We contract that into a story form. But part of the story of Jesus for it to be what it is, is that Jesus had to be a man that lived in the first century and he had to die and be crucified. Without that, the story would be a self contradiction because it's actually part of what the story is. Is that in the case of Robin Hood that it's not as important. Right. Because Robin Hood. I think Robin Hood is based on true memories of someone who existed. But to the extent that legends accumulated around him and the fact that some of these things might not have happened is not a big deal. Because in the story we don't depend. Our life doesn't depend on Robin Hood and our salvation doesn't depend on Robin Hood as it does on Christ. But in the case of Christ, it's important that the events that happened in his life are describing a man that lived in the first century and died and the tomb was empty. All of these things. But it still is a story. It has to be."}
{"episode_id":"SW - #401 - 2025-07-25 - Robin Hood - The Original Green Man (Nottingham talk)","start":4508.68,"end":4515.76,"speaker":"Alison","text":"I don't think we have time to explore all these questions now. But as you said, you know, the gospel is a true story."}
{"episode_id":"SW - #401 - 2025-07-25 - Robin Hood - The Original Green Man (Nottingham talk)","start":4515.76,"end":4516.6,"speaker":"Jonathan Pageau","text":"Yeah. Yeah."}
{"episode_id":"SW - #401 - 2025-07-25 - Robin Hood - The Original Green Man (Nottingham talk)","start":4516.76,"end":4527.98,"speaker":"Alison","text":"And I think you can all relax. Sue, I just want to thank Jonathan so much. I mean, it's been unbelievable. Unbelievably rich, I'm pleased to say. Have you recorded?"}
{"episode_id":"SW - #401 - 2025-07-25 - Robin Hood - The Original Green Man (Nottingham talk)","start":4528.06,"end":4529.74,"speaker":"Jonathan Pageau","text":"I hope so. We'll see if it works."}
{"episode_id":"SW - #401 - 2025-07-25 - Robin Hood - The Original Green Man (Nottingham talk)","start":4529.82,"end":4531.02,"speaker":"Alison","text":"Will it be going out?"}
{"episode_id":"SW - #401 - 2025-07-25 - Robin Hood - The Original Green Man (Nottingham talk)","start":4531.18,"end":4533.34,"speaker":"Jonathan Pageau","text":"Yes. I'll put it on my own YouTube channel, please."}
{"episode_id":"SW - #401 - 2025-07-25 - Robin Hood - The Original Green Man (Nottingham talk)","start":4533.42,"end":4550.14,"speaker":"Alison","text":"If you want to revisit this, go to his YouTube channel and watch. And we're just so grateful to you to coming to us. And I don't think I shall ever think about King David or Robin Hood ever the same again. Completely blown by."}
{"episode_id":"SW - #401 - 2025-07-25 - Robin Hood - The Original Green Man (Nottingham talk)","start":4550.38,"end":4550.94,"speaker":"Announcer","text":"Thank you."}
{"episode_id":"SW - #401 - 2025-07-25 - Robin Hood - The Original Green Man (Nottingham talk)","start":4554.29,"end":4569.17,"speaker":"Jonathan Pageau","text":"If you enjoy these videos and podcasts, please go to the symbolicworld.com website and see how you can support what we're doing. There are multiple subscriber tiers with perks. There are apparel and books to purchase, so go to the symbolicworld.com and thank you for your support."}
{"episode_id":"SW - #401 - 2025-07-25 - Robin Hood - The Original Green Man (Nottingham talk)","start":4569.73,"end":4632.78,"speaker":"Laura Diaz","text":"Tucson the weight is Over Mediweight loss. They're officially open on North Oracle Road. That's right. No more counting down the days. You can walk in right now and start your journey to a healthier you. Hey, it's Laura Diaz from iheartradio and you can trust me, this isn't just another weight loss clinic. I know that because it's where I lost weight safely with real medical support. GLP1 medications. You can see them everywhere online right now. But the truth is, your health shouldn't be a DIY project ordering these meds without the professional guidance. It can lead to dangerous mistakes. Wrong doses, no oversight and serious risks. At mediweightloss, I got the same medication but with a customized plan, weekly check ins, and a licensed physician guiding me every step of the way. And the cost? The same as those risky online options. Tucson, your moment is here. If you're ready to take control, feel better and lose weight the right way, Medi Weight loss is ready for you. Walk in, get started and see real results. Call or visit mediweightloss.com to learn more and book your free consultation today. That's mediweightloss.com looking for your next Go."}
{"episode_id":"SW - #401 - 2025-07-25 - Robin Hood - The Original Green Man (Nottingham talk)","start":4632.78,"end":4698.08,"speaker":"Announcer","text":"To Smoke Shop Stop scrolling. I've got you. Headshop.com is the number one online smoke shop already trusted by over 100,000 happy smokers just like you. They've got it all. Dab rigs, vaporizers, glass bongs, smoking pipes, even THCA flower all in one place. Need a new daily driver? Grab a smooth glass bong or a classic smoking pipe. More of a concentrate fan. Their dab rigs, E rigs and wax accessories are designed for smoother, harder hitting sessions. And yes, they they've even got legal THC flower. Best part? Every order ships fast and discreet, which is why thousands of smokers keep coming back. So don't waste time hopping between shops. Shop the best in DAB Rigs, vaporizers, glass bongs, smoking pipes and THCA Flower right now@headshop.com, the number one online smoke shop, headshop.com has what you need. Check it out today. Oh, and because you're listening right now, you get 10% off your next order when you use the coupon code HSHOP at checkout. Go to headshop.com now and smoke smarter."}
