{"episode_id":"SW - #349 - 2024-07-17 - Explaining the Fall to Atheists","start":0.4,"end":1149.06,"speaker":"Jonathan Pageau","text":"One of the things that it is very difficult for people to understand is the notion of the Fall, the idea that humans, that the world, that creation is somehow fallen. It's very difficult for secular people to understand that. But I do believe, in fact, that people experience that every day and that it is in fact, the idea of being fallen is in fact, deeply knitted into the very structure of their experience, everyday experience. You know, even in their own criticism of religion, this, this structure of fallenness is inserted. So what I want to do is I want to look at all of that, think about it, and hopefully give you some examples that will help you understand why we talk about the notion that creation, that humans are fallen, and what that means. This is Jonathan Pedro. Welcome to the Symbolic World. And so if you enjoy what we're doing here at Symbolic World, before we start, make sure to go to the symbolicworld.com and become a member. You can become a member completely free and join a community of wonderful discussion. But, but there are also ways that you can support what we're doing, and you can get access to the monthly Q and A, to a free monthly video, as well as discounts on some of the, on some of the products like the courses that we're doing. And so thank you for your support. It is truly appreciated. Now, one of the issues of the Fall, one of the things that makes it difficult for people to understand what the Fall is, is a criticism that I brought to many of the secularists, is that in some ways they struggle to see their position. They struggle to see where they are. And you see that, for example, in the Enlightenment, you can see that in Voltaire's criticism of Christianity, in some ways he criticizes Christianity for not doing what he thinks that should be done, for not doing the good that he thinks that should be done. And he sees the Enlightenment and kind of Enlightenment, the movement towards Enlightenment, as doing the good things in the world that should be done. Now, the problem with that type of thinking is that if you say that you nonetheless have this sense that there's a gap, that there's a gap between what you think should be and what is in the world. And that gap is very particular. It's very strange because if the world is fallen, like, I mean, not even. I won't use the word fallen yet, if the world is meaningless, if the world doesn't have telos, if the world isn't bound in higher intelligence and purpose and reason, then where does the gap come from? Why do we have this sense of the distance now on the Other hand, if on the opposite side, if the world is created by God, by a loving God, and you know that it is full of meaning and tales and purpose, then why is there a gap? Then, you know, and this is of course, something which can be explained by the notion of the fall. Now, the Gnostics, they perceive that, right? You can see that in Gnostic heresies and Gnostic thinking, where people notice the difference between what they think they should be and their current state. And so what they have to posit is that the world itself is. Is born in some evil, that creation itself is evil, that the world itself is intrinsically fallen, and that we have to escape the world into some higher sphere to some spiritual state in order to be able to escape the reality of the world. Now this, of course, is also a problem because then why does the world exist? And so you have to posit that the world is evil in itself and, and that the cause of the world, wherever it is, if you imagine some dark, fallen God, is the cause of the world, but you still keep putting the problem further back, at some point there has to be some kind of cosmic fall which accounts for the gap. Now, can the God only be evil and this is something that you can see, or can the world just be dark, meaningless and without purpose? And that, again, that causes the problem that I mentioned at the outset, which is, if so, then where does our moral sense come from? If the origin of all things is simply dark and, you know, nihilistic ultimately, or evil, or either way you want to think about it, then where does our sense that something is wrong and that we should do good? Where does our capacity to judge morally come from? Now this, of course, is the problem with Voltaire himself. This is what Tom Holland has pointed out in his book Dominion, that ultimately what Voltaire does is he does a Christian criticism of Christianity. He uses his kind of taken for granted Christian point of view and criticizes Christianity with it. And so we have to be able to account for this gap. Now, this is really a good way to understand it. Now, if people struggle to go with the story of the fall of Adam and Eve that we find in Scripture or the fall of the angels that we find in more kind of extra biblical sources as the cause for the gap and a way to enter into an explanation of the gap, then you nonetheless have to account for that gap. And this is a serious problem. You have to be able to understand what, why it is that we experience the difference. Now, a good way to understand it is that in terms of our Existence, our existence is bound in purpose. This is something that we've been talking about all the time. Like when Jordan Peterson talks about the idea that. And I've talked about this myself, and John Vervecki talks about this, which is this Cogsci idea, that what you see in the world are purposes, like what you see in the world are paths towards action. And so every identity that you perceive is put into a hierarchy of identity and a hierarchy of purpose, and things appear as obstacles or tools in order to get to your purpose. And so the very structure of the way reality presents itself seems to have at least the possibility of the Fall in it. And what do I mean by that? What I mean is that if we see the world in telos, if we see the world through purposes, that is, you know, I have certain purposes that are important to me as a human, and I establish my map of the world. The identities that I perceive in that hierarchy, first of all, then all my perceptions, all my identities are participating in the sense of distance from purpose. And so you can see how that is akin to the Fall, which is the perception that there is a gap between my state and the state that I want to be. And this is, of course, what Dante describes in the Divine Comedy, the way that even classical philosophers talk about the relationship, the motor of eros, right, the motor of desire which moves us in our lack towards the telos that presents itself to us, and we find rest in that movement. So, of course, it sounds very abstract at the outset, but it's very, very practical, which is that, you know, I have to go to the store to go shopping. I see the door, and now I experience the. My. I experience my purpose as a kind of suffering. That is a very small suffering, but it's a suffering that is, in the sense that I am now not in line with my purpose. I have to cover the gap between what it is that I'm aiming at and my current state. And you could say that that is a definition of suffering, because you are not in your control of the situation. The aim that you have is not manifested in the world. There's a gap between that, so you suffer and that suffering. It's a very small suffering, but it is a suffering of desire that I suffer my distance from the door. And now I move towards the door, and once I reach the door, then I am absolved, like I am healed. I find rest from that suffering. Now, of course, that suffering, you could say, or that desire is embedded in more and more desires, so that, you know, I'm always Kind of moving from purpose and telos and desire into other purposes and telos and desires. And so our very perception of reality and our very engagement with reality seems to account for the gap, this distance between my state and the state that I'm looking for. Now of course we can see that in a proximal way, right? Which is, you know, I need to go to the store and then I have this, this little process of, let's say, covering the fall and moving towards the light, moving towards the reason, and then finding rest in that, in that purpose. But of course, you know, all of these are, you can also see it in a more kind of abstract way, which is, what is the purpose of my life? What is the purpose of my, you know, the purpose of my job? You know, is it just to make money? But then why am I making money if it's, you know, if I, if I want to have pleasure, but then that pleasure is serving what purpose exactly? There seems to be something in us which is constantly, let's say, yearning. And so you could describe it in many ways. You could talk about the whole, the God shaped hole in the human being. And that God shaped hole is that gap. It's the gap between the good that I perceive even in intimation, these higher goods that I perceive and my state of distance between the two. Now the story of Genesis is in my opinion is in my perception the best way to understand this gap, you know, because it is to become conscious of the distance. You could say that the knowledge of good and evil is in some ways to become conscious of your existence in a kind of duality of inside and outside, a duality of me and the purpose. There's this duality of the fact that I see the good and identify myself in the place of bad. And now I have, all of a sudden I'm in this weird position where I have to cover that distance. And so this, this, it's the act of self consciousness itself which is related to this problem of all of a sudden seeing myself and seeing my distance to the good that I am, that I'm pursuing. And so the description of one of the facets of the description of the fall in Genesis is related to the very, a very desire to explain that distance within us and to make it and to help people understand that it's related to self consciousness, it's related to duality, it's related to the perception of good purpose, telos, reason and bad, which is distance, sinfulness, you know, the missing, the mark being far from the mark being far from the thing that I'm aiming at, right? It's the distance between the two. And this is, of course, exactly described in Genesis. Now the question is, how do you cover the gap? And this is, of course, what Christ comes to show us. But it's not a very pleasant one, at least at the outset. It doesn't seem very pleasant, is that in some ways we have to say yes to the dying. We have to say yes to the state of death that we're in. Yes, in the sense that we have to die on purpose instead of dying on accident. We have to sacrifice everything towards the aim that we have. And that in that sacrifice, the suffering will become more than suffering. It will be a kind of attractor, a kind of thing that sucks us into the good that we're aiming at. And we will find a type of joy in the suffering. Not a kind of masochism, not an enjoying of the suffering, but a joy in knowing that we suffer in order to come closer to the purpose that we're aiming at. And that definitely seems to be the path that Christ takes. And the path of the martyr, you could say, of course, the martyr is an extreme version where all of a sudden the martyr has to eschew all their proximal goals, all their little goals, right? The goal of feeling my belly, the goal of having a family, the goal of doing this and that. And they end up, let's say, being willing to suffer, all the lack of those little goals. And in order to be able to reach the highest purpose. And then you realize that, once you realize that, you realize that you do that all the time, actually, that in fact, that structure of being willing to suffer in purpose towards proximal goals is something you do, right? That people who train, or people who learn to write, or people who learn anything, when you're learning you are suffering. I mean, we have to be careful how we take this suffering in the sense that we are sacrificing our time and energy, and there's a kind of a pain that is submitted to a higher purpose. But if we know what the higher purpose is, and we're moving in that higher purpose with a kind of consciousness of our situation, which is a consciousness of the distance between the two, then that suffering can be a kind of joy. And even the discipline of learning something, the kind of sacrifice that you put into the higher things, can become a type of. Like a type of glory and a type of joy. And that's what we ultimately see, of course, in the martyr as the ultimate example, which is everything his whole life, everything about them. They're willing to sacrifice and to give up all these proximal goals in order to look at the highest goal. And you could say that in the fall of the Garden of Eden, this is particularly true because Adam and Eve, when they eat the fruit of the knowledge of good and evil, they have access to the tree of life, and so they perceive far more before they ate the fruit. You know, it's like they couldn't see the tree of life. This is, of course, the way it's presented in Saint Ephrem, the Syrian especially, you know, that it was a kind of barrier for the tree of life. And once they took the. The apple of the knowledge of good and evil, then they saw the good, and then they saw it from the position of distance, and then had to cover that distance in pain. And they refused to suffer, they refused to die at that moment. And that brought about the entire loop of human history and everything about it. But Jesus seems to show us a different way. But for sure, what's important to understand is that the image of the fall, of course there's a moral element to it, because we usually experience that in morality terms. We see the good that we want to do, and then we realize that we're not doing it, and we see the consequences of not doing it. And so we suffer from our sinfulness because we can't get to the good we want. But this is true of everything. It's not just true of moral questions. It's true of all aspects of moving towards purpose. Every time you move towards purpose, you will have that problem of the gap between where I want to go and where I am. And no matter how much of a secularist you are, even if you refuse to accept the story version, the mythological imagery and the image of the falling of the angels because of pride, the. The image of the taking of the fruit for oneself, you still have to be able to account for that. And then that causes a problem. Because usually what happens when people don't try to account for it is they end up being a kind of critic of religion, critic of Christianity, a critic of the religious aspect or a moralistic aspect of the world, while ignoring their own position, not knowing that they are unconsciously perceiving that good that's calling them, and they're using the light of that good to criticize the failures of the current models. But then they don't try to account for that, and they don't try to make it part of their worldview, and they don't have a way to make it part of their worldview. Because if we're just a bunch of random, know, whatever particles hitting each other and that, and there is no sense that there is a structural relationship between our state and what we're perceiving as being good, then, yeah, then we're deluding ourselves. And so this, I know this was a little difficult, but I've been thinking about this for a long time. So please tell me if, if this is clear in the comment section, I would love to see what your thoughts are, because I'm trying to refine this argument, obviously. And then hopefully, you know, if there are ways to improve what I'm saying, I will try to take another pass at this and try to get it even clearer and better. But I'm really on the edge of my thinking with this. This is really kind of pushing my thinking as hard as I can and, you know, as much to the edge as what I can. And so I thank you for your attention. I thank you for your support and I will talk to all of you very soon. Bye. Bye. If you enjoy these videos and podcasts, please go to the symbolicworld.com website and see how you can support what we're doing. There are multiple subscriber tiers with perks. There are apparel and books to purchase, so go to thesymbolicworld.com and thank you for your support."}
