{"episode_id":"SW - #029 - 2019-02-25 - Garments of Death and Garments of Light","start":0.72,"end":1959.1,"speaker":"Jonathan Pageau","text":"I would like to welcome you to episode 29 of the Symbolic World podcast. And so on this episode I'll be playing for you a discussion of the symbolism of garments in the Bible and in the Christian tradition, garments of death and garments of light, and how the fall brought about a series of transformations in the person which follows all through the Bible all the way to the end. And so it is not obviously only about the Bible, but can help us understand the shape of the world and how reality lays itself out for us. And so enjoy. This is Jonathan Peugeot. Welcome to the Symbolic World. For the people who are supporting me on Patreon, at least a ten dollar level, I'm offering the possibility of suggesting and then voting for subjects for the future videos. And so recently I put up a question and I got many answers. I think I got like 30 suggestions. But one of the suggestions which got the top votes, which got the most votes, was suggested by John Moore. And it is to discuss the notion of the robe of light. In the Christian tradition, there is this idea that before the fall, Adam and Eve, though in the Bible they're described as being naked, they were also clothed in glory. We could say that they were surrounded by light. And so someone had asked me to talk about what exactly that could refer to. And so it, I was actually happy to see this. I think I said the suggestion was made by someone named John Moore. And so I'm pretty excited to talk about that because it's something that I have been pondering for quite a while, especially the relationship between what you could call the robe of light and the garments of skin. And so first of all, what is this notion of the robe of light? Why would we talk about that? Now the idea that we are clothed, we have to compare, we have to oppose the two. Now, when Adam and Eve fell in the garden, in the text it says that God placed around them garments of skin. Now, the idea of garments of skin, there are several aspects to it, and I hope to make a video that talks just about the garments of skin. But a very important part of what the garments of skin mean is, is that they're a covering, they're a protection from what is outside. Okay? And so around Adam, because Adam had fallen, because there was something lacking in Adam, there needed to be a, something added to Adam in order to protect him from the outside. Okay? And so now the garments of skin can be seen as many things. And in the tradition, it's seen as our biological body or biological existence. The, the, the very notion that we need to add Things to our nature. In order to survive, we need to eat, or else we'll die. The idea would be that in the garden, the need to eat had more to do with a kind of spiritual communion with things rather than just this notion of perpetuating this biological body in the kind of living death, let's say. But it also is whatever is added. And so all of technology, clothing being the first technology, all of technology is something which we add in order to protect ourselves as we move further and further out into the world. And so, you know, you, for example, we could not live in the north, where I'm living here in Quebec, were it not for the fact that we have layers around us, layers of clothing and then layers of a house which protect us from the cold. Without those layers of added layers, we would die in, in. In the world. So all of technology, cities, whatever technology is seen as an extension of this notion of the garments of skin, this added layer upon. Upon man. And this added layer is. Is dead. That is, it is not it. Not it doesn't come from our life, but rather is taken from the outside and added as these kind of coarse dead layers which at the same time protect us from death. So it's a, it's a. I keep using the image of a vaccine. It's a layer of death to protect us from death, okay? Now the notion that Adam and Eve would be clothed in glory, clothed in light, is the opposite of that. And so the notion that we would emanate light, let's say, you know, you hear that even in the kind of New age type interpretation, we have to understand it into what it means in terms of being. That is, light shows things, right? And so if you imagine Adam as generating light, then you imagine him as the source and the light moving out from him and casting light on things around him. So instead of him having, having to protect himself from the outer world, he becomes an active revealer of the outer world, okay? It's an extension of the idea that Adam names the animals. And so naming something has to do with shedding light on it, casting a light on something and participating in its popping out from the chaos, okay? In order for something, in the beginning it says, let there be light. And that's part of this notion that the logos, that light, there's a chaotic potential outside. And then light comes and reveals the forms that are there. Now you can imagine you walk into a dark room and you don't know where anything is. You don't know what's there. You're kind of Wandering, you're blind. You don't know what could kill you. You don't know anything. But when you turn on the light, then all of a sudden everything is revealed and you can see what is there. Now, for example, the ancients talked about this idea that the eye from the eye was this beam of light, that there was a beam that came out of the eye and would hit things in order to reveal them to the eye. Now, we don't have to understand that in a physical sense. We need to understand it more in a sense, in the sense of this relationship to naming. That is the capacity to focus on something, the capacity to pull out of the myriad of details in the world to create unity and to pull something out as having unity. Is this participation in how the world lays itself out? Okay? It's an active participation in how the world lays itself out. That's what we talk about when we talk about man being in the image of God, man naming the animals, the Logos, as what will pull out order from chaos. Okay? And so the notion that Adam and Eve would be clothed in light has to do with emphasizing that aspect of the human being as in its highest capacity to be able to participate in creation, to be part of bringing out order out of chaos and also participating in the life of God. That is. That is what God does. God creates the world. And so the human being, by being clothed in glory, is also participating in the life of God by naming the animals, by being the gardener, by doing all those things which. Which makes man in the image of God. So that can kind of help us understand what the garment of light is. And so if you look now in the story of Christ, you will see certain moments in the story of Christ where this, let's say, Christ is represented as manifesting this garment of light. And so in the transfiguration, there is the story where the disciples are with Christ on the mountain. They go up on the mountain, and then at the top of the mountain, all of a sudden, Christ appears in this cloud of light, and his garments are brilliant and white. And then next to him is Moses and Elijah, who all of a sudden appear in this kind of transfigured world. And this notion of the transfigured world is exactly this idea of light, of light as being able to manifest the true essence of things, being able to see beyond, let's say, just the fallen or kind of material world, in the sense of the world which moves out into chaos, moves out into fragmentation, but rather show the world of manifestation, that creation or the world of manifestation is bad, but rather, there's a way in which we can see it, in which it is full of light, full of meaning. Okay. Full of its connection together. Okay. So maybe that can kind of help us to understand the basic idea of the. The garments of light. But there is a really interesting. A really interesting situation in this story of Adam and Eve and the garments of light. And it's one which I think can help us understand how human beings understand things and how human beings come to remember things, because there's a. So we'll look at it, and it might help you to understand something else, which I'm hoping to get to more and more to help people understand why religious stories appear the way they do. The notion that Adam and Eve had garments of light actually comes from the very same text which says that Adam and Eve had garments, were given garments of skin. And so the word garments of skin, the word skin was interpreted in the first century before even Christianity kind of took its full shape, was interpreted by certain Jewish rabbis as having an alternate reading. So the word skin could also be read in some. Some transcriptions and some ways of. Of. Of reading it as light. So it's very interesting that the tradition about the garments of light are actually the same as the garments of skin. Then after that, in the Christian tradition, this was developed more and more as. As talking to what was there before the fall and then the garments of skin as after the fall. But the origin of the tradition came from the same text, which is this notion that Adam and Eve were given garments of skin, red, alternatively, as garments of light. Now, what does this mean? What it. As we look then in the story of the Bible, you'll see this pattern where the notion of the dead skins, this notion of death, or this notion of the monstrous or something similar being alternatively being able to be read as light or glory. Okay, now there are many examples in the text, and. And it's very similar to the tradition that we're talking about. Another famous example is in the story of Moses, when Moses goes up in order to encounter God. When he comes back down, the text says that his face shone. His face was shining with glory, and he had to cover his face because his face was shining. Okay, now you can imagine what that has to do. Moses goes back to the top of the mountain. He goes back to the same place in terms of symbolism, which is the center of the garden, which is the top of the. The garden where he is able to communicate with God. And so he becomes. He once again enters into the possibility of being, of radiating light, that is, of being the source of meaning. So when he comes back down with the law, which, which is the law of God, which, which will order the society of the. Of the Israelites, it's the same thing as him shining with light. Those two things are the same. It's just they're describing different, different aspects of it. He is radiating light. And the law. The law is, let's say, the. The Logos manifesting itself in the world as order, which. Bringing order to chaos. Okay, now there is. In, for example, St. Jerome, when he translated the text from Greek into Latin, he mistranslated the word which refers to glory, and instead he translated it as horns. And so in the Latin version, the. The reading of Moses coming down the mountain was that when he came down the mountain, he was actually. He had horns. And you can see that in certain representations in medieval art, even up to Michelangelo, you can see that Moses is represented with horns. And you think, wow, that is very strange that that would happen. But what's interesting is that in Jewish traditions, a similar thing happened when, where some rabbis began to say that in fact, the word which talks about glory that Moses came down wearing, with his face shining could be interpreted as being disfigured. So that in coming back down the mountain, Moses would be disfigured, and that's why he had to cover his face. Now, it's very interesting that those two things happen at the same time. There is a. That tradition. It's almost everywhere, even in the transfiguration itself. In the transfiguration of Christ, we see that it says that Christ's vestment was shining with light. But then it talks that he was surrounded by a cloud of light, and the disciples were overshadowed by this cloud of light. And so in the very transfiguration of Christ, you see this strange duality, this strange aporia, which seems like a contradiction, which is that on the one hand you have light, and on the other hand you have this notion that the disciples are overshadowed by a cloud, a cloud of light. And so it's this impossible bringing together of. Of darkness, of confusion and chaos, because in the text it talks about them also being confused, but also light, this extreme light which is radiating out of Christ. Okay, now what I want to bring to you, what I want to help, to try to talk to you about is to talk about these patterns. Now, what I think and what I believe is that this pattern, this pattern of this relationship between death and glory is one which is very, very deep and very, very profound. And part of our human constitution. If I even say that, if I even tell you death and glory, all these examples in your mind are going to come up of places where we align those together, where it be celebrating people who died in battle. We have all these. This imagery of the soldier dying and receiving a crown, this notion of the martyr who dies and receives a crown of glory. There are many examples of this relationship between death and glory. And in the very words those relationships are there. For example, in many languages, the word for crown and the word for horn, that is the horns of an animal, they're the same words. You can even hear it, horn, crown. In French, we say corne for horn and couronne for crown. And in many languages, the two are related. And so this notion of this animality, these horns, like Moses who came down the mountain with this animal aspect to him, like the dead garments of animal skins added to Adam, is related, is from the same source as the notion of a crown, let's say, of a king's crown, of this crown of glory. And it goes so far that you can even find this relationship in the. In fairy tales, for example, in the story of Cinderella, there is this notion that Cinderella has glass slippers. Well, in the original, the older versions, her. In French, we say that she had. Her shoes were made of fur. In French, the word for fur, a certain type of fur was. And so she had shoes made of ver. And then the word for glass is also ver. And so there's a slip that happened between this notion that she had shoes made of animal fur, which became shoes made of glass. And so the same relationship between something which is opaque and related to this added layer of death and something which is clear and. And which transmits light. And so it's just a structure which happens over and over. Now, one of the things that I think that happens, and this is going to throw a big monkey wrench in the way that historical kind of critical analyses happen, is that what I believe is that with the way we remember things, things that happened a very long time ago, sometimes even in. So people will say, for example, that these are just mistakes in transcriptions. And so someone in the Cinderella story wrote the word wach a little bit differently. And so it was interpreted by somebody else as being glass in this notion of garments of skin, garments of light. It was someone who had mistranscribed or a misreading of the text, which brought people to say garments of light instead of garments of skin. And you see, kind of the historical critical analyst always Making those types of criticism, wanting to rectify some mistake, horrible mistakes done by those stupid people in the Middle Ages, which we now, oh, now we understand that according to this reading. But that is a very. That's a. To me, that's a bad way of going about. Because what I think is that there are always mistakes in transcriptions. There are always. There are always moments where there can be little confusions. But. But when such a mistake persists, not only persists, but is also received and accepted by the tradition, by a group, by a community, it's as if, okay, so it's as if you have a pattern, okay, you have this pattern, and then the world, as it manifests itself in its chaos, will sometimes go out of the pattern or. Or sometime manifest something slightly different. But then what happens is, even through mistakes or through misreadings or through misunderstanding, it's as if things want to snap back into the regular pattern. All of reality is working to bring things back into the regular pattern. And so the fact that we take even a mistake in reading and persist with it for so long and we bring it back so that it manifests this pattern is just how reality works. And I know a lot of people will. Might be annoyed at what I'm saying, but what I'm suggesting is that when we look at the past and when we look at what people have transmitted to us, it is important not just to look at it in technical terms and look at, oh, those morons 2,000 years ago, those. They just misunderstood this aspect. They were missing a sentence in the text. They mistranscribed this part, all this baloney. I mean, not that it's baloney. Maybe it did happen. It doesn't matter. We also need to look at how something is remembered, because the way that it's remembered and the way that it persists through time actually can show us more about human nature and about reality, ultimate reality, let's say, than simply nitpicking at the details and how the details were gotten right or wrong. And that's really important. I've talked about this even in terms of, let's say, the history of the Trojan War. Let's say when you hear scholars who will nitpick at the text given to us by Homer and will try to find some archaeological proof that, you know, maybe some little part of the text is actually true and is actually historically real, and then they'll discount everything else and as if, you know, none of that has any value because we can't prove it archaeologically. Well, you're Missing the whole point of how the story of the Trojan War and the reason why it has persisted for so long is because it shows us something far more profound than simply an accurate representation of some event which happened, you know, 1500 years ago in. In Anatolia. It's like, that's not what. That's not what it. That's not what's important. Not that I'm saying the Trojan War never happened. I think it happens. It doesn't bother me to believe that the Trojan War happened, but the way it's described and the way that the pattern came to now synchronize itself, let's say, with the deeper patterns of being, that's important to notice as well, because it tells us way more about ourselves. And so then what is this deal about? This deal about the garments of light and the garments of skin? And what I believe is that the difference between the garments of light, between death and glory, really depends on how you see it, from what perspective you're seeing it. Now, in the story of Christ, what we see, we see Christ joining those two together. Just like Christ joins everything together. Christ takes this manifestation of the garments of skin, death, then he takes this notion of the garments of glory, and then he brings them together into one person and into one story. Whereas Christ is on the cross. This whole idea that he is both dying on the cross, but he is also extended and his body extends to the limit of the world, filling up the world that is both at the same time. This reaching out to the edge of death, this entering into death, but then changing death into glory. The same with the ultimate example that I keep bringing back, coming back to, is the crown of thorns. The crown of thorns is exactly those horns, those pointy defenses that were the consequence of the fall. In the Bible, when Adam and Eve fall, God is. Gives them garment, gives them garments of skin, but he tells them that the world is going to produce thorns, these thorns, as this defense against the outside. But this horn, now this pointy bit, this thorn, is transformed by Christ, by remain, although remaining what it is, transformed into this crown which he places on his head, which manifests also his glory. And so this capacity for taking that which is added, the best way to see it really is to see this notion of a periphery as a circle, right? As this added aspect as a circle. And the circle has a lower part, which would be death, right? And so everything that is dead, everything that is added, which is exterior. But there is a way to transform that and bring it up to the highest part, which is the crown it's not that obvious to know how that is, but you can see mysteries of that in the Christian church. A lot of people have asked me to explain relics, for example, because relics are very strange to the modern understanding. They are basically bits of dead people that become the actual. In the church. They actually become focus, the focus of the glory of the story of the church. And so how is that possible? Well, it really has to do with this notion that death can be changed into glory, that this idea of these peripheries that are added and added and added can become. They are in a way, in the deepest sense, they are the same mystery as light which comes out and manifests the world. And so this added thing, this thing that comes out, you can see it either as. It's as if the things that come to protect you can be transformed in things that make you strong. I don't think that that's, in terms of psychology. I don't think that that's, that's that hard to understand. You have these, you have these barriers that you, that you place, these protections that you, that you have, but that once you kind of understand that you have these, these protections to protect you from the outer world, you can actually flip them and transform them into ways in which you can then on the, on the contrary, instead of just protecting yourself from the other world, you, your courage, let's say, can be something that protects you, but then can act as something which then furthers you out into the world, which makes you engage further and further into chaos, bring more and more light into chaos. Those two things are linked together. And in the story of, the whole story of the Bible, you see it the, the most in this whole idea of how technology in the story of Genesis is part of the Fall. And so I've talked about this in other talks before, but this notion that the Genesis is actually not just one fall, but is actually a series of falls. And so God gives to Adam and Eve the garments of skin, and then after that you have another fall with Cain and Abel. And then Cain creates a city, so you have the garments of skin. Then Cain creates this city, and then he creates technologies, different technologies, including weapons of war, which bring about all these conflicts. And then that brings us all the way to chaos, all the way to the flood, which is this return to chaos now. So you can see it as a fall, fall, fall, fall, fall, fall, fall, until the world is completely destroyed. But now at the end of the Bible, this whole, whole big story at the very end of the Bible, you see in Revelations, this image of the heavenly Jerusalem. And so this notion of the city, but this glorious city, this shining city in which all the elements of the city are symbolically represented as gold and precious stones. And it's all to represent this notion of technology, of what was originally this garments of skin now transformed into this glorious manifestation, basically the crown of creation. And so the new Jerusalem is basically this crown because it talks about the new Jerusalem coming down from heaven. And so this crown which comes down on creation and then manifests the possibility of all of this coming together, of death, technology, and all these things being transformed into something higher which is full of light. And so I can't actually tell you how that can totally happen, but sometimes we have these small glimpses of how that could happen. I. I talked about this, this notion of. Of, let's say, of courage or how our own passions. Let's say we have these. These desires. Let's say we have a desire to eat. And this desire to eat can lead us out into. Into a kind of loss of control where we have this. These. This constant desire to eat certain things. And we think that, you know, and it. We feel like we're a slave to our belly. You know, everybody has had that, that. That, let's say that experience, but it could also be to sexual desire. It can also be to certain thought patterns, like, whatever. But then that, let's say that desire to eat food can then be transformed into something higher. For example, in. In. In the Christian liturgy, that. That's why communion, part of community is that we're eating. And so this desire to eat, which can actually bring you further and further, is transformed into something which actually brings everybody together and then manifests something which is higher. And so the very. And so that's just a small example of how something which leads you out into chaos can then be flipped around and transformed into something which actually brings everything together and manifests unity and light and all those things. And so that's a little bit of a glimpse of what the garments of glory can mean. And I hope that it was helpful. I know that when I talk about more religious things, sometimes it can get a bit. Sometimes a bit more abstract. So I hope that I'm being clear enough. All right, guys, so it was good to talk to you, and so, yeah, we'll see you soon. Thank you for listening to the Symbolic World podcast. As you know, this podcast is for now based mostly on my YouTube videos, which I am transferring into audio format. Please go ahead and visit my YouTube channel. There are more videos there on different subjects that I'm not going to put into audio. And please share this to your friends. I know a lot of people know about the YouTube content, but not so many people know that this is also a podcast. So share it to your friends. Share it on social media. And if you can, feel free to support this financially as well by going to my Patreon page, which is Peugeot Videos. Strangely, you can go there and you can support it at any amount that you want. A month for all the patrons. I do a monthly Q and A live Q and A in which people can ask questions in the chat, and I try to have a more personal connection with people. The YouTube comments have become difficult to follow and to answer. I'll see you soon."}
