{"episode_id":"SW - #293 - 2023-06-26 - Pricked by a Spindle - Symbolism in Sleeping Beauty","start":0.8,"end":8.88,"speaker":"Jonathan Pageau","text":"As you know, we are currently crowdfunding a beautiful storybook written by myself and illustrated by Heather Palantin, called Snow White and the Widow Queen."}
{"episode_id":"SW - #293 - 2023-06-26 - Pricked by a Spindle - Symbolism in Sleeping Beauty","start":8.88,"end":11.04,"speaker":"Jonathan Pageau","text":"It really is a desire to recapture."}
{"episode_id":"SW - #293 - 2023-06-26 - Pricked by a Spindle - Symbolism in Sleeping Beauty","start":11.04,"end":23.12,"speaker":"Jonathan Pageau","text":"Storytelling, to dive back into the old stories. And I thought that as we're thinking about fairy tales, it might be a good idea to put out some old patron only videos that I've done over the years which interpret fairy tales."}
{"episode_id":"SW - #293 - 2023-06-26 - Pricked by a Spindle - Symbolism in Sleeping Beauty","start":23.12,"end":24.44,"speaker":"Jonathan Pageau","text":"It'll give you a good idea of."}
{"episode_id":"SW - #293 - 2023-06-26 - Pricked by a Spindle - Symbolism in Sleeping Beauty","start":24.44,"end":374.62,"speaker":"Jonathan Pageau","text":"What those videos look like, what it means to subscribe to the symbolic world. But it'll also be, you know, a good time to celebrate these fairy tales. We'll start with Sleeping Beauty and look at why she pricks herself on a spindle. But then we will move on to Snow White, Jack and the Beanstalk, and maybe a few more. So if you haven't yet, please back Snow White and the Widow Queen. And in the meantime, enjoy. This is Jonathan Pedro. Welcome to the symbolic world. So, as many of you know, I am working on some fairy tales, working in part now. Right now I'm working on a version of Sleeping Beauty. And I've been thinking a lot about Sleeping Beauty, I guess, for years. And there's one thing that really kind of bothered me, I guess it was the question of the spindle. Like, why does she prick her finger on a spindle? And so I looked into it and I tried to figure out why that would be. So I thought that maybe bringing you through my process of figuring out what I think at least the spindle seems to manifest, could be helpful. And I mean helpful if you're interested in the question of Sleeping Beauty, but also helpful in order to see the process that I usually go through to figure out what these things are about. And so the first thing that I looked at was whether or not there are other traditions. And so this is important. A way to do that in the Bible is to often look at what you would call midrash or legends or things that surround the biblical text in order to notice if there are differences, if some details are different, sometimes even in scripture. So, for example, if you look at stories in the Book of Samuel, and then you look at stories in the Book of Kings, for example, and you can try to see what's the same, what's different. And sometimes seeing that something is preserved or something has changed can actually help you understand what is going on. And so when I looked at the traditions, there were two traditions, it seems, and one was that Sleeping Beauty pricked her finger on a spindle. For those who don't Know what a spindle is? A spindle is either on a spinning wheel or sometimes it can be a hand spindle. And so what it does is that you take flax, or usually it was flax at the time, but you could probably have it with wool as well. You would take flax and then you would attach the, the fl. I don't know how they started it. They would like attach the flax to the spindle and then as the wheel turned, the spindle would spin like this and it would spin the flax together and then with your hand, you would kind of just let it go and it would rotate around the spindle and then it would create a bundle around the spindle. So that's why the spindle has a kind of vertical shape. You know, it's a, it's a rod, but sometimes it's a little pointy because you want the thread to neatly, let's say, get gathered around the spindle. And so now the problem with that, let's start with the spindle. The problem with that is that spindles aren't pointy. Like, they're not pointy in a way that you can prick your finger on. And so that's something that people, you know, the same kind of person that the Same kind of 14 year old atheist but for fairy tales would be like, oh, it's ridiculous, you know, spindles aren't pointy. This is a silly story, this is nonsense or whatever. But usually when something doesn't make sense in a story, at least especially a story that's lasted a very long time, it's actually not a, it's actually not a, how can I say this? It's not a sign that the story doesn't make sense. It's a sign that the story makes so much sense, that the people who are remembering it are willing to accept a disjunct between the meaning of the story and actual manifestation in the world. And so if you look at even the idea, Saint Maximus and Origen and all these early church fathers, they talked about how in the text, in the biblical text, what they called the idea of ambiguous problems in the text, when there's contradiction even between the different tellings of the text, or when there's something which is very obscure and very strange, often it's actually a sign that there's a lot of meaning there. Because why would you tolerate, why would you tolerate for a very long time to preserve a story that is, that is just complete gibberish or meaninglessness? Now, it doesn't mean that that's the case all the time. I mean, obviously sometimes there can be gibberish and meaninglessness in Snorris, but. But the idea is that you don't necessarily just discount it, especially if it's an important part of the story, like the spindle in the Sleeping Beauty story. So that's one. So the other tradition was that she pricked her finger on a strand of flax. So now it's not the spindle where the flax gets transformed and turned around and coiled around this axis, but now it's actually the thing like the, the wild early part of the process, where it's just like a piece of straw, basically a piece of flax, and then she, she pricks her finger on that. And so, interestingly enough, it seems like those are actually opposite from each other. When you start to kind of understand what's going on, they seem like they're opposite from each other, but the fact of them being opposite from each other, this is another thing about symbolism, is that sometimes that can help you understand the meaning, because opposites are bound by a category. That's why they're opposites. And so you, you see that sometimes when people also mock stories, they'll say, well, it's not what you said."}
{"episode_id":"SW - #293 - 2023-06-26 - Pricked by a Spindle - Symbolism in Sleeping Beauty","start":374.62,"end":375.9,"speaker":"Jonathan Pageau","text":"It's the opposite of that."}
{"episode_id":"SW - #293 - 2023-06-26 - Pricked by a Spindle - Symbolism in Sleeping Beauty","start":375.98,"end":461.04,"speaker":"Jonathan Pageau","text":"Well, if it's the opposite, it's still bound by a higher category or else you wouldn't recognize it as an opposite. Right. The opposite of high is low. The opposite of orange is in a bowling ball. Right? It's like if it's an orange and a. If it's an orange and this finds something even weird, weirder, like an orange and a duck. And those two things like orange and duck, how do they fit together? You struggle to understand why one would be switched for another. But if it's like the spindle that gathers the thread around it and then the flax, which hasn't been gathered yet and hasn't been brought together, then you're like, interesting. You know, this is at least seems to be in the same category. So that is something to pay attention to when you're interpreting the. The text. And so the next thing to do is to not interpret the idea of what the spindle is apart from the story and not interpret elements that you're trying to understand apart from the story. You always have to try to stay inside the story as long as possible. And so you have to look at the, at the events. What are the events? So there's an evil fairy that is not invited to the Chrismation of the King's daughter. And because she's not invited, she gets annoyed. And then when the other fairies, they give her a blessing, and those blessings are usually virtues, you know, she'll be."}
{"episode_id":"SW - #293 - 2023-06-26 - Pricked by a Spindle - Symbolism in Sleeping Beauty","start":461.04,"end":464.12,"speaker":"Jonathan Pageau","text":"Beautiful, she'll be good, she'll be truthful, she'll be graceful."}
{"episode_id":"SW - #293 - 2023-06-26 - Pricked by a Spindle - Symbolism in Sleeping Beauty","start":464.2,"end":638.73,"speaker":"Jonathan Pageau","text":"It's all these goods that they are giving to Snow White as their blessing. And then the last fairy that wasn't invited to the party will come up, and so obviously she's going to prefer her curse. Now, what's interesting now about the curse is that the curse doesn't actually follow, at least in appearance, doesn't follow the other blessings. They're not. It doesn't see, it seems to be. To not fit. So the fairies will say, she'll be graceful as this, she'll be beautiful as that. You know, whatever. She'll dance, she'll be a great dancer. I don't know, like, giving her qualities. And then the evil fairy says, this is going to happen to her and she will die. So she'll prick her finger on a spindle, or she'll prick her finger on a piece of flax and she will die. So, like, why is it. Why does that go together? So this is where I've been meditating for quite a while and trying to figure out what was going on. And so the idea then, you know, this is kind of like what my brother talked about with Jordan Peterson. The idea is like, well, let's understand what a spindle is, what it does, what it. What it looks like. And so take some time watching YouTube videos about people spinning flax. It's like, what's going on? You don't even understand because they're not trying to explain to you what you want to understand. And also because these spinning wheels have changed quite a bit as you look at the spinning wheels, like, there's no even. There isn't even what seems to be the spindle on it. Where is it? Like, what's going on in the Disney version? Interestingly enough, they don't even. She doesn't even prick her finger on the spindle. She pricks her finger on something called the distaff, which is not the place where the thread gets wound up, but it's actually this, like, this big rod that people put on spinning wheels to tie the flax before it's processed. And so they'll tie this flax before it's processed, so it's kind of holding somewhere. And then they'll pull it into the process and so that it gets spun around the spinning wheel. And so it seems like the people who made the Disney movie didn't take the time to understand what a spinning wheel is. But I understand their intuition because they ended up making the. The spindle, which is in a spindle. They. They joined it with like the most vertical, kind of phallic, masculine thing that was on the. On the spinning wheel, which ultimately that. If you haven't guessed yet, that's definitely part of what the symbolism even of the spindle is. So what's going on in the. What's going on in the story? So there are several things that are kind of brought together. The first thing to notice this is where it really started. Well, the easiest one to notice is the idea of looking at other fairy tales and noticing the idea of someone falling asleep around the time that they're teenagers. And that when they fall asleep, it has to do with beauty. It has to do with. At least in this case, it has."}
{"episode_id":"SW - #293 - 2023-06-26 - Pricked by a Spindle - Symbolism in Sleeping Beauty","start":638.73,"end":639.49,"speaker":"Jonathan Pageau","text":"To do with blood."}
{"episode_id":"SW - #293 - 2023-06-26 - Pricked by a Spindle - Symbolism in Sleeping Beauty","start":639.97,"end":796.17,"speaker":"Jonathan Pageau","text":"In the case of Snow White, there's also. Before she eats the apple, there's also a pricking with blood where she falls. And so it's like, what's going on? And it does seem to have to do. And then she's, of course, woken up by a kiss. And so this is something I mentioned before. I think in some of these videos, it necessarily has to do with puberty and with the transformation of the body at the time that a woman becomes a teenager. And that the effusion of blood can either be the menstrual cycle itself, and that would have something to do with the wheal, or it can also be the loss of virginity, which would have something to do with the distaffer with the vertical part. And so those two effusions of blood, which can happen after a woman enters into. Into adulthood, seems to be what is referenced here, or what is played around, you could say, in terms of imagery. So you can imagine that you could read it in two ways. You can read it as a young woman who enters into the menstrual cycle and then she kind of loses, you could say she doesn't. She loses herself in the sense that she's caught in this cycle and she doesn't. And it's like she doesn't know what it's for. And that's also has to do with like this weird curiosity about the. The. About the spinning wheel. She doesn't. No one's told her what spinning wheel is for. Right. We've kept it away from her all this time. And so it's like she Gets there and it's a surprise. She starts her cycle and it's like, what the hell is this? Like, why? What is this blood? Like, what is going on? And so you can imagine that it throws her into a loop and she doesn't know what the reason for that is. And that is something like a kind of dying. And you see that, of course, if you compare the Sleeping Beauty to Jairus daughter, which I've done here, you can see how all of this is connected, right? You know, Jairus daughter dies at her puberty. It has to do with the fusion of blood of the woman that Christ heals on the way there. So it's all kind of connected together. But then there's also the idea of the actual prick of the spindle, which would have something also to do, let's say, with the idea of a young woman who, let's say, loses her virginity without totally understanding what is going on and what the consequences of that are. And then she kind of. She dies to the. Let's say to the world. She dies in the sense that she doesn't. She doesn't have love, you could say it that way. And so she. There's a. There's a relationship with her body, with sexuality, with everything that hasn't to do with the."}
{"episode_id":"SW - #293 - 2023-06-26 - Pricked by a Spindle - Symbolism in Sleeping Beauty","start":796.25,"end":796.65,"speaker":"Jonathan Pageau","text":"The."}
{"episode_id":"SW - #293 - 2023-06-26 - Pricked by a Spindle - Symbolism in Sleeping Beauty","start":796.73,"end":919.2,"speaker":"Jonathan Pageau","text":"With love, which would be the purpose or the joining, the joining with the male in the proper way through marriage and through, you know, that would bring her into the. Into womanhood. So it's all these things that are kind of being suggested now again. So why the piece of flax or the spinning and. Or the spindle, though? So why is it that in particular, especially considering that the spindle isn't sharp, you could kind of prick your finger on a piece of flax that maybe makes, you know, like on a straw that kind of makes a little bit more sense. And I think it has to do with what happens to the fairy. So think about it this way. The spindle is what gathers the string around it. So the spindle is a vector of unity. And so it makes sense. And so it also makes sense in terms of the masculine aspect of the spindle that, you know, it's the. The origin of the name, the origin of the seed, the origin of the. The identity of the family. And. And so the witch is not invited to the party. And so because of that, she basically tells Sleeping Beauty or tell the king that his daughter is going to prick herself on this unity. And so you can imagine it exactly that way. That is that the problem of excluding and Including. And the problem also of unity is that unity in its positive sense is the vector around which that you can gather things. But unity in its negative sense can be something like a sword, something like a prick that can hurt and that can appear, you could say. And so it's as if she's saying she will live with the negative consequences of masculinity, with the negative consequences of unity, because you've excluded me from the kingdom. And so it's the excluded one who then kind of calls back to the unity and uses it as a curse. So that is definitely, I think, the."}
{"episode_id":"SW - #293 - 2023-06-26 - Pricked by a Spindle - Symbolism in Sleeping Beauty","start":919.2,"end":919.96,"speaker":"Jonathan Pageau","text":"Way to see it."}
{"episode_id":"SW - #293 - 2023-06-26 - Pricked by a Spindle - Symbolism in Sleeping Beauty","start":919.96,"end":1181.87,"speaker":"Jonathan Pageau","text":"Now, if you see it the other way, then it also makes sense. It makes sense in the opposite way, which. This can also help you understand how symbolism also works, is that she's excluded and she doesn't fit. And so she's saying, you are going to be prick your finger not on the final process, but on the raw, wild straw before it's united. And so it's like, I am this wild straw. I am this piece of straw which was not brought into the string, which was not bound and wound around the spindle. And that is what she's going to prick her finger on. And so then it also. Then it's more related to the idea of the menstrual cycle and the remainder and the residue which is. Which is bound up in this story. Now, of course, it's important to understand that this is why symbolism is so powerful, is that none of the elements of the story actually directly mean the analogies that I pointed to. So it's not that the. The spindle represents a phallus or something silly like that. Right. That the kind of modern interpreters would love to say, it's that there are analogies between the imagery and the meanings. And those analogies point to something even higher, which would be something like the relationship between unity and multiplicity, the way in which things are gathered into one, the way things fray apart, the way in which things, you know, and the relationship between fraying apart, falling, falling, sleeping, dying, and then being awakened by love, by attention, by care from above. So there's all these images, but it's like you can still, if you see the analogies, can help you. And so the idea is that now, as I'm writing the Sleeping Beauty story, I can just slowly pull in images and threads and things that will point you or will help you have more insight into why it is that it's something like a spinning wheel and a spindle. Because like I said, at the Outset when you look at the story, and it might seem arbitrary to us, although it's clearly not, because stories that are preserved and remembered and cared for for a long time, you have to remember too that a good way to understand this is that like the Grimm Brothers or Perrot or the people who gathered the fairy tales in the 17 with the 17th, 18th century, they only gathered certain ones. Like, they probably heard a lot of versions of all these fairy tales, like maybe hundreds of versions, but they gathered them in a certain way. There are certain ones that they brought out and they kind of. Or they. They compress together in order to show them to you. But at the same, in Grimm's fairy tales, there are a lot of fairy tales that you've never heard of that have been forgotten, that no one cares about. But somehow some of these fairy tales are kind of persevere and become touchstones for culture and becomes like the main. That say, fairy tale stories that we know. And if there's an element in those that seems strange to us and we don't totally understand, we should be careful not to discount it, but rather pay attention and try to see. Well, if it's so illogical and random and arbitrary, then I don't think it would have been remembered this way. I don't think people would care for it and, you know, would celebrate it in the way that they did. And so, yeah, so I hope this is helpful to kind of, you know, I hope you see what my process is and how it is that I meditate on these things. Sometimes I meditate on these images for years. I just drop them in the. Drop them in the intuition box. I don't know what to say and just leave them there. And as I move along, sometimes they'll resurface and I'll have a bit more insight. They go back down, they come back up until. And then sometimes there's pressure, like, let's say I'm writing the story. Then there's like a pressure where I really want to understand this. So I kind of keep it on the tip of my tongue or right on the tip of my mind all the time, even as I'm cooking or as I'm doing other things. And then it's. It's ruminating is the word material likes to use. And then all of a sudden it clicks and I'm like, oh, yeah, that's what it is. So, yeah. So I hope this was useful, everybody, and thanks for your support and I'll talk to you very soon."}
{"episode_id":"SW - #293 - 2023-06-26 - Pricked by a Spindle - Symbolism in Sleeping Beauty","start":1181.87,"end":1182.15,"speaker":"Jonathan Pageau","text":"Bye."}
{"episode_id":"SW - #293 - 2023-06-26 - Pricked by a Spindle - Symbolism in Sleeping Beauty","start":1182.15,"end":1189.32,"speaker":"Jonathan Pageau","text":"Bye."}
{"episode_id":"SW - #293 - 2023-06-26 - Pricked by a Spindle - Symbolism in Sleeping Beauty","start":1191.07,"end":1228.13,"speaker":"Jonathan Pageau","text":"I'm Jonathan Peugeot And I'm inviting you to participate with us in our retelling and our celebration of one of the most iconic fairy tales of all. Snow White. A beautifully illustrated storybook, Snow White and the Widow Queen places our iconic character at the beginning of eight upcoming fairy tales which will speak to each other and harmonize in surprising ways. Snow White and the Widow Queen Queen rekindles an adventure which will make you remember, rediscover, but also marvel and wonder at our rich heritage of stories. A heritage that still has secrets to reveal, even after centuries of being passed down to us."}
{"episode_id":"SW - #293 - 2023-06-26 - Pricked by a Spindle - Symbolism in Sleeping Beauty","start":1228.61,"end":1230.29,"speaker":"Jonathan Pageau","text":"In the past few decades, we have."}
{"episode_id":"SW - #293 - 2023-06-26 - Pricked by a Spindle - Symbolism in Sleeping Beauty","start":1230.29,"end":1353.59,"speaker":"Jonathan Pageau","text":"Watched many of our stories, our fairy tales, our myths become completely exhausted by efforts to deconstruct them, to reinvent them, and sometimes to even invert their original meaning. It has come to a point where we've almost forgotten why we cared about these stories in the first place. I firmly believe that for this reason, it is now time to retell and redisrupt our original fairy tales. In a spirit of celebration, of admiration and unashamed joy, I've spent the past two decades meditating on the strange narrative elements of Snow White and other fairy tales. After much thinking, I'm now bringing this story to our common hearth. We find in the fire of time ready to present hidden treasures most of us have never noticed. To accomplish this, I have paired up with Heather Paulington, a world class artist and designer who has worked on some of the most beloved film franchises of our time. Her work mirrors my writing, a collaboration that has produced a powerful synthesis of medieval style with the best of 19th and 20th century illustration. I love the Kickstarter model because we can make the book more and more beautiful with every stretch goal we can offer art prints, a limited edition drawing by Heather, and even a Snow White illustration of my own. Finally, we're planning a super exclusive leather bound edition which pulls out all the snow stops. A storybook mantelpiece for sure. The profits of this crowdfunder will be used to start a new publishing company, Symbolic World Press, whose christening publication will be this very fairy tale series. Each book illustrated by world class artists. Jack and the Beanstalk, Cinderella, the Valiant Little Tailor and several more are next in line for publication. All existing in the same world and all fitting together like a puzzle moving towards the final surprising resolution. After all that, there's no limit to."}
{"episode_id":"SW - #293 - 2023-06-26 - Pricked by a Spindle - Symbolism in Sleeping Beauty","start":1353.59,"end":1354.47,"speaker":"Jonathan Pageau","text":"What we can do."}
{"episode_id":"SW - #293 - 2023-06-26 - Pricked by a Spindle - Symbolism in Sleeping Beauty","start":1355.59,"end":1362.71,"speaker":"Jonathan Pageau","text":"It's time to reset the clock to retell our stories. So please join us in this celebration and creative vent."}
