{"episode_id":"SW - #212 - 2022-01-04 - December 2021 Q&A","start":12.08,"end":6199.99,"speaker":"Jonathan Pageau","text":"This is Jonathan Peugeot. Welcome to the symbolic world. Here we are live, December Q and A. So I hope everybody is doing well and that you're having happy holidays despite the insanity, which continues to progress. And so, as some of you know, we are changing the format of the Q and A just because at some point, you know, we. At some point there was too many questions. And so I was not even paying attention to the chat. I stopped taking super chats. And so at some point it was like, why am I doing this live for the public? Because there doesn't seem to be any reason why I would be doing that. And so instead, what we're going to do from now on is this is going to be only streaming live, only for people that are supporting me somehow on Patreon, and then we'll. We'll make it public later. But hopefully what that means is that I'll be able to interact with the chat a little more than usual and. And there'll be less madness, less chaos. Nonetheless, Brad is in the chat, and so. And Lisa is there as well, which means that even though there's only 12 people watching, we don't. We will not stand for any chaos. And so. All right. So it's just. Yeah, so I'm feeling. I'm feeling a little spry despite the madness here in Quebec. As some of you may know, they are asking for Covid passports to go to church now. And so, yeah, so we are going reaching another level here. Yeah. All right. All right. And so a few announcements. My prediction for 2022, if you want to hear it, it's gonna keep going. Nothing's gonna change much. It's gonna get worse, I would think, because the. The measures that have been put in place in the past two years are going to look more and more political, and they are going to just be a slow burn into basically a surveillance state. So that's my prediction for 2022. So sorry to disappoint you, if you're hoping that I was going to bring you some good news. So Brad says when the world goes mad, Rokor is on the rock. Yeah, yeah, we know that feeling. I do think, and I have to say, and I might make some people in the. He's mad when I say this, but I do think that the manner in which people deal with the pandemic and the way people deal with the measures that are coming right now that will decide the health of the church to a certain extent, and those churches which favor communion will do much better than those that favor. That favor Safety and also favor just falling in line with whatever we were asked to do. So anyways, so enough of that. Enough getting in trouble. So let's go. Let's do this. All right, so I will start with the website and I will try to look into the, the, the chat and answer a few questions in the chat. For example, could you explain Tristan Matsuno, star with woman in the chat? There you go. I feel free to do that. Tristan Matsuno asked, could you explain the Headless Horseman symbolically? I mean, the Headless Horseman has to do, of course, with, say, moving towards the solstice. You know, it's like the losing of the head, the losing of meaning, which happens in winter when things start to die. And so that's what losing the head is, you know, and especially a horseman. It's basically just this kind of wild potential that has lost its reason, lost its purpose, and can act out of vengeance, can act out of all kinds of things which are more on the dark side. So that's the Headless Horseman, and it makes sense that he would appear, let's say, on Halloween and haunt the world as the world is getting darker and the sun is going down. All right, all right, so here we go. So we're going to start with the website as usual. No, last. This is the last need to make this last announcement, I guess, is that today, actually tomorrow is going to be the last day for the Gods Dog crowdfunding. It has been an amazing ride. We are probably going to reach 200,000 and we have like 3,300 backers, which means that all the stretch goals have been attained. People are going to get posters, people are going to get. Everybody's going to get a copy, PDF copy of the Secrets of God's Dog, which will have some articles from me on St Christopher, some sketches from our original designs, and the greatest thing that's going to be in there is going to be an article that Matzir is furiously working on right now. It'll be the first thing that he's published since his book. And, and so if you haven't gotten on board today and tomorrow is the time to do that, to get on board with God's Dog. So that's been a lot of fun. That's been a lot of fun. All right, so here we go. So we start with the website. And so David Flores asks. There's a story about a foreign king that visits Saint Simeon the stylite. Saint Simeon has been wounded in the leg and worms fall from the wound. The king picks it up and it turns into a pearl. Is the worm, which is of little value to Saint Simeon, a precious gift to someone at a lower level of being because he is higher up? Or is there more to this symbolism that I am missing? There's definitely more to this symbolism that you are missing, and I'm happy that you stumbled upon that story, because it's a pretty amazing story. And it's basically what Christianity is about, if you want to understand this story. It's what I've talked about in terms of the relationship between the crown of thorns and the crown of glory. It's an exact. It's a very discreet example of the transformation of death into glory and how there's a relationship between death and glory, depending on, let's say, the difference between accidental death and willful death or conscious dying to oneself rather than being a slave to death. So here is the example, which is that Saint Simeon basically lives a life of dying, a constant life of dying, to the extent that he doesn't notice. And part of the story is that he doesn't even care. He doesn't care that he had. Basically has, like, these worms that are rotting in his flesh. His flesh is almost like a living. It's almost like a rotting flesh. And the. The worms are falling to the ground, and they become pearls, they become. They become seeds, they become glory for, you know, images of glory. And so it's related to relics, the symbolism of relics. And it's a very. It's a very difficult symbolism for people to understand, but it's a. It's very concise, especially in that story. It's very, very concise. And so it is mysterious how that happens. But that's what Saint Simeon is about. All right, so Cormac Jones asks, have you any thoughts on the symbolism of linear perspective in art? What does it mean to view space this way? And so I think that there's something about linear perspective in art which can be somewhat useful in the sense that it can make you notice this perspective, because in a way, it's like the re. It's a side effect and kind of the reverse of the sense that you're standing here and you're looking out at the world. And so you have these lines or these rays that go out and, let's say, help you encounter things in space. And so linear perspective can be a reflection of that. And so you could have this. So you've read. Probably read the idea of how it's basically like this infinite recession in the back. And so it can help you kind of understand the point of attention, let's say, and how it structures the rest. All of that is, makes sense, but there's also a darker side, let's say, to linear perspective, which is a kind of solidification and freezing of experience, you know, and also the weird, kind of, the weird God's eye view, the weird abstracted view that the modern world seems to be related to linear perspective as well. You know, the, the thing I criticize when I, and I say that people aren't aware of what, where they are. Like where are. When I say things like where are you when you say that, you know, that there's a sense in linear perspective where. Yeah, that that's also kind of lost. But that's very intuit. Just an intuition on my part. All right, so CFTR asks, is the ongoing disappearance of the female hidden space one of the reasons why we have increasing trouble finding understanding and forgiveness? The changing of minds often only happens in the hidden space. This is hard to do when our nervous system is extended and exposed to the world via the Internet. That's for sure. That is for sure because there's also a sense in which when we are in public, you know, there are all these other factors which come into, come into question. And you're right that changing your mind and forgiveness happens in a kind of stillness. That's why you never see anybody change their mind during a debate, as if that's ever going to happen. That's why I don't like debates very much. You know, whatever, they're fine, you know, but they're usually for the people watching, not for. Definitely not for the people debating. And so. Yes, I definitely agree. All right, so arose says 77. Are the four living creatures of revelation the angels of the four Gospels? Yes, they are definitely related to the angels of the four gospels. They are the four faces of the cherub. Right, the four living beings. All of these. The four aspects of divinity. Yeah, the four manifest aspects of divinity. And so that's why they're related to the Gospels. The, the original notion of the four creatures comes from the book of Ezekiel where, you know, you have these chairs with four faces. But then this of course has also its version in the four creatures in, in Revelation. All right, so I, so Stephen Wong says. Hi, Jonathan, I read your article, the Samaritan woman, Baptism and the Hexagon. That article, article you mentioned, the Samaritan woman at the well is related to baptism, but I don't quite understand that. Can you explain why she is related to Baptism. Well, she's related to baptism because she's the waters. She's an aspect of the chaotic waters, you could say. And so there are two aspects of the waters below. There's an aspect of the waters which is something like purity of the lower waters. There's also an aspect of the lower waters which are something like the salt waters, the bitter waters, the saturated waters. Okay, so the Samaritan woman represents what you could call the saturated waters because she's had all these men, you know, and she's had six husbands, you know, she's had five. This. Her sixth husband is illegitimate. And now Christ appears as her seventh husband, the one that brings her. That brings her the water of Life, you know. And this water of life is the water of baptism. And it's related to Sabbath. It's related to the seventh day in the sense that it has also to do with death and with rest. The Sabbath is the day that Christ is in the tomb. All these images kind of come together. And so often. That's why often in the icon of the Samaritan woman, the shape of the baptismal font is a cross. There are different versions of it, but sometimes it's a cross because ancient baptismal fonts were in the shape of a. Of a cross or like the four directions, basically. And then the water. The water there in the. In. In this. This kind of, let's say, cross light on its side, let's say. And so that's why the Samaritan woman is related to baptism. I hope that makes sense. Yeah. And you can also understand it, like, in an interesting way, because this is going to flip your mind. Sorry, I. I guess I have to do it, which is that she's giving Christ the lower waters. She's saying. She's bringing up these lower waters and she's wanting to give them. And then Christ is saying, I'm going to offer you the water from above, you know. And so there's a sense in which the joining of the higher waters and the lower waters. That's the flood. That's the. That's the flood, by the way. That's death, you know. But it's also the change into. It's also like a kind of purification which. Which brings about a new world. And so when Christ. When the lower waters and the higher waters join together, it's also the joining, the creating of a new world. And so this imagery that Christ is bringing is as old as, like, the imagery of, like, Tiamat, the dragon of the salt water, the dragon of fresh water joining Together and creating the word. That's how old the imagery that Christ is invoking here is. And so it's a very, very powerful story, this story of the Samaritan woman. We have to be always really careful not to be tricked by the simplicity of the Gospel stories. And then also the Samaritan woman, Saint Phottini, you see her, she also gets thrown into a well. Her whole story, if you read her story as a saint, it's constantly related to the well. So the well is all about what Saint Phottini is about. And the well is also an image of baptism. So, okay, so Luka Skovic asks. I'm working on my master's degree. The thesis is on the structure of the icon of the Last Judgment. What literary sources would you recommend for this work? I'm not gonna lie. The main inspiration for this work is your Last Judgment video and the Lord Spirit podcast. That's fine. To be honest, like I said, I don't. I don't have a lot of literary work. I've been working on the icon of the Last Judgment myself for a very long time for like, 20 years, and studying it and writing about it. So I've written several. Several articles about it, Some of them which I haven't published, some of them which I actually did as in courses on iconography in university. So wish it could help you there. There are. There isn't a lot around. You have to. You have to parse it out yourself, figure it out, and, you know, you can discover what the elements in the icon are, and then from there, you can work from there. So good luck with that. So, Josh the mover asks, is there deeper significance to there being three different Marys of the Crucifixion, or is it purely happenstantial? Could a deeper significance apply to other instances of several different people appearing with the same name? The idea of Mary, the multiple Marys, I think, is very important. And I think that some of it. Some of that symbolism seemed to be a little lost to us, but there seems to be something related to how Mary. This idea of the difference between the. Let's say the Mary with a pure Mary and the saturated Mary. And so let's say Mary, the mother of God as the pure virgin Mary, and let's say Mary Magdalene, from whom Christ exercised demons. What is it, seven demons or something? And so the difference between those two, if you're interested in that, I wrote an article on the different symbolism of the different women in the church. And so there's a. In the tradition, you end up having Mary the mother of God and then Mary the Egyptian Saint Mary of Egypt in the Orthodox Church and in the Catholic Church, it's really Mary the mother of God and then Mary Magdalene and all the legends that. That appear around her about her being a prostitute and all that, which is not in scripture, but is. But it's kind of like this, the, the diff. The saturated Mary. Right. The. The difference between the pure Mary and the saturated Mary. That's what, that's the. Seems to be the symbolism that a lot of these Marys are playing in the gospel. But it's hard to totally kind of get it, especially with the three Marys. Like, what's the third one? She. Like the. Is she the joining of the two? Maybe? Not sure. Not sure. All right, let's see. In the chat, so Frederick Gopher Schmidt says, how do you know if it's God you're worshiping and not an angel or, or Mother Mary? Well, it's just that, I mean, it's the name. You're right. You know, the names of things are related to the things you. When you call upon things, you call upon things by their name. And so if you're calling upon the Divine Trinity, the Father, Son and Holy Spirit, if you're calling upon Christ, if you're calling upon the Father, then you're not worshiping other things, you're worshiping God. I mean, I know that maybe sound a little. There are moments when we are understanding of God is lower. And so sometimes. I've mentioned this before, where you're worshiping God, but really, let's say in practice, you're attending to God as if God was a lower aspect, as if God was an angel or was these different things. And I think that's kind of inevitable. But I also think that, you know, that's what grace is for. Right. Grace is there to kind of pull us up through the steps. You know, spiritual life is progress and it's a transformation. So you can't pierce the divine mystery of the infinite, you know, source of all being at the outset. That doesn't work that way. Yeah. And so someone says, it's a shame you skipped my concern over the NFT use. And so I will address the NFT thing. I'm thinking maybe we could do that now if someone wants to. Let me see. All right. So David Markham says, says, do you think it's possible to wade into the flood in order to piss in it without getting wet and raising the water level? Yes. I'm talking about God's dog NFTs and so. Well, David, first thing is. Thanks for making me swear that. Always appreciated. Not sure it was necessary, but that's okay. So let's look at, we need to look at this a little, a bit in a wider understanding. We have to look at it in terms of God's dog, the project in itself. Now the way you phrase your question is very fascinating because you know the story of St. Christopher is about a monster going into the water, right? You know that, that's the story, the story of St. Christopher is about a monster going into the, into the flood. That's what's actually the story is about. And the idea is that for some reason St. Christopher is able to carry the child across the waters and the. No, you can't do that without getting wet. And, and I think that, I think that maybe this is important to understand that a lot of the stuff that I'm doing, let's say the comic book, the God's Dog project and Even this, this YouTube stuff, this like little YouTube celebrity thing, you know, this has a cost, it costs something. It doesn't, it's not free. And the cost it has is something like becoming a dog at the edge of the table, which, that's what this costs. So you could say that. Not that, just the NFT project, the God's Dog project itself, making a comic book about a story like that and doing these YouTube things and these YouTube videos and doing interviews and talking about movies and doing that, all of that kind of stuff is something like losing crowns in heaven. And like, I'm not, I'm not, I'm not, how can I say this? I want, I want people to understand that I'm completely aware of it. And I'm, and I'm not want to excuse any of it, but I'm completely aware that it's walking into the waters. And so the NFT project is part of that. It is exactly part of that. And it is, in a way what we are doing is we are diving into the carnival completely. We're not skimping out, we're doing the carnival. And let's just say that we hope, and I hope that in the end the fruits of this will be worth, will be worth it. But I'm fully aware that this is like CPR guys. This is like, you know, you don't do CPR on a, on a healthy person because it will kill that person. You do CPR on a dying person as a last ditch thing to get it across the waters. And so, so I hope that makes Sense. And so, so I'm thinking about it quite a bit and I'm weighing the cost of it. So hopefully that helps and I hope that makes sense to you. All right, here we go. See STREETSO so birds are considered to be the living relatives of dinosaurs. Considering that birds relate to heaven and more spiritual elevated things and dinosaurs are extinct monsters on the edge of our understanding whose remains are found in the ground as fossil stones, what does this mean symbolically? Is there a parallel between angels and demons? Of course. Isn't a parallel between angels and demons there? How many stories do you know about demons being fallen angels or that there's a, that that which is below is a fallen version of that which is above? And so, but I'm not sure. I mean, birds are considered to be living relatives of dinosaurs. I mean, I don't know, like in this weird, like in these evolutionary things, the way that identity, they, they understand identity is so strange, so convoluted that it's like, you know, is, it's like, is the, is the Michelangelo considered a relative of, you know, like my driveway stones? Like, is that how it works? Like, how, how do they think of identity? So this is the weird thing about the idea of relatives. It's like what, you know, it's like, are dogs relatives of cats? I guess, you know, they, somewhere, they are somewhere down the line. Everything's a relative of everything else. And so I, I struggle to find a lot of meaning. I struggle to find a lot of meaning in, in the way that modern scientific people understand identity. I feel like it's, it's, it's somehow misunderstood and arbitrary, or at least it, or it's weaponized. Like, like it's weird to say that dinosaurs are relatives of birds. Like, okay, when do you decide that that's a fact? Like, why don't you say, why don't you say birds are relative to amoebas? Like, why don't you say that? Why do you say birds are relatives to dinosaurs anyway? Sorry, sorry, sorry, sorry, sorry. All right, no science bashing. We don't need more of that. All right, all right. So Brian H. Says. Greetings, Jonathan. I'm fairly new to the symbolic world and I'm interested in unicorns. Well, my four year old daughter is and as a parent I would like to have a deeper understanding of them. The Bible mentions them a few times and the atheists use it to mock the Bible as a fairy tale. And most Christians say that the unicorn is actually a mistranslated word for rhino. Is it just a Translation issue or is there the symbolic meaning for unicorns? Well, there's definitely a symbolic meaning for unicorns. And it's also fine to say that a unicorn is a rhinoceros. That's totally fine because a rhinoceros is a unicorn. I don't know what to tell you. As much as, as much as a hippopotamus is a river horse, a rhinoceros is a unicorn. It's a horse with one horn. It just depends how you categorize things. People ancient just had different types of categories. I don't know what to tell you. They just didn't have the same kind of taxonomical categories that we have. And so I'm totally fine with unicorns being Indian rhinos because African rhinos have two horns, but Indian rhinos have one. That's only fine. Now if you want to understand unicorn, you can understand the notion of. So that's why unicorns, on the one hand, they represent something magical because they represent unity. They represent, you know, the two becoming one. And there's actually some interesting, some interesting things about unicorns. There's a, somebody told me a crazy story about unicorns which is that there are, I don't know even where they do this, but there's some places where, when goats are very young, what they'll do is for one goat, they'll press the horns together like physically when like the skin is still malleable and everything is kind of mushy in there, but kind of press the horns together. And if you do it in a certain way or whatever for a certain amount of time, the horns will actually kind of stick together and then will grow up into one horn. So they'll be like goat unicorns. And those goat unicorns immediately become the alpha goats because of their one horn. So that's super interesting, right? If you think about a hierarchy at the top of a hierarchy. So that is very, very fascinating. And so, but then there's also a man in which the idea that unicorn is something which cannot be tamed because it's somewhat unreasonable, it doesn't stand on two, doesn't have two. So because it's almost like if you think of, you could understand a cyclops with one eye being something like the third eye and so having like an eye in the middle which balances the two eyes out. But you could also understand the cyclops as a maniacal in terms of single mindedness and something which is impossible to contain because it's so kind of focused on one thing. There's actually interesting, someone wrote a Great article about that for Symbolic World. So you can check that out if you want. But there's definitely something about what's going on now with unicorns that is very disturbing. You know, the whole, the whole like gender unicorn and the idea of, like the relationship between the unicorn, the kind of rainbow unicorn. That's what's interesting about that is it seems to have something to do with the idea that it is an imaginary being and that this whole kind of gender stuff that we're going through is about imagination and is about the reality of imagination, that you can imagine what you are and that you can kind of decide what is real. And so that's what's, that's why people seem to be obsessed with unicorns right now. It seems to be related to that somehow. So, yeah, that's weird. So, Kiana, a random man says, now I want to see Cyclops marketed to five year olds. You could probably do it if you did it properly. All right, okay, so here we go. So now we're moving to the Patreon site, to the Patreon side of the Q and A. So Christian Swensen asks, what is the symbolism of the butler and the baker in prison with Joseph? Good question, good question. And so the butler is the one who gives the wine to Christ. So the butler is the left hand of the emperor, and the baker is the one who gives the bread to the king, to the pharaoh. And so he is the right hand who of the pharaoh. Now, if you know your iconography, probably most of you don't, but if you look for an icon of Holy Communion that is usually represented as a fresco in the church, you will see Christ, sometimes Christ double, like two Christ, or sometimes one where with his right hand he's giving the bread to St. Peter, and with his left hand he's giving the wine to St. Paul. And what happened to St. Paul? Did St. Paul lose his head? Did he? Did St. Paul lose his head? Sorry to laugh at you, St. Paul, that's horrible. But I'm trying to point to how powerful the biblical symbolism is and just how contained it is and how the traditional symbolism is powerful. So in the story of Joseph the baker, both of them, at the end of the time, both of them are, let's say, elevated by. Elevated by the pharaoh. And one is elevated back into his presence and the other is elevated to lose his head. But I think actually that. I think that it's the opposite, if my memory serves me correctly, in the story, is it the baker that loses his head? I think so. But it. Whether it's one or the other, in a way, it doesn't matter because it has to do with that and has to do with the relationship between the right hand and the left hand, the bread and the wine. And also kind of how it crosses sometimes. It's very powerful and definitely worth meditating on more. And I should probably meditate on more because I don't even remember which one of them loses their heads. But it's definitely related to St. Peter and St. Paul, to the bread and the stone, to the wine and then St. Paul and the sword and losing his head. And it's all related. It's all like a big, giant puzzle that. That we should be meditating on, that is for sure. All right, so Matthew F. Says, I'm intrigued by your. I believe all the gods exist. Take. Can you help me understand why Scripture sometimes emphasizes idol worship as merely material? Example, 2 Kings 19:18, they have cast their gods into the fire, for they were not gods, but the work of men's hands, wood and stone. Therefore they were destroyed. Thank you. And so, you know, I think that you always have to understand, you have to see there are two tendencies in Scripture, and this is going to. You're going to see it all the time, which is that on the one hand, you'll have a sense that a good key to that is actually in the Orthodox liturgy. So in the Orthodox. And it has to do with the. I did a video, I think, recently about that, about kind of the difference between apophatic and cataphatic, the relationship between the two. So in the Orthodox liturgy, right before we take communion, the priest says, he lifts up the, the. The gift, and he says holy things for the holy. And then the church answers, one is holy, one is God, Jesus Christ, to the glory of God the Father. Amen. And so what is happening? Like, we're about to take communion, we're about to consume the bread and the wine. And all through the liturgy, we also praise the saints. We praise all these different aspects of the body of Christ. We bow before the priest, the priest bows before us. So what is going on? And so you see the same in scripture, where, for example, there's several places in the Old Testament where people bow down before the altar, where people bow down before their Father, bow down before people they've sinned against. All of this is kind of happening. There are other places, for example, like when you see the apostles, someone bows down before the apostles, and the apostles say, no, we are not like we are men like you. And so it's like, what is happening? And this is the problem of this whole question. And so on the one hand, you could say something like, nothing exists, only God exists. Right? You could say that, and in a manner, it would be true. Then you could also say that all that exists exists through God, and all that exists is an image of God, and therefore God is hidden in all the things that exist. Everything hides God in it, right? And so those two statements are so completely opposite, but they are necessary to maintain the balance of reality, which is, on the one hand, God is completely above all things, and all the other gods are all false gods. They don't. All the other gods don't exist. All the other gods are just imagination. They're whatever. They're all this stuff. But then there's also a sense in which all these layers also manifest are angels. They are messengers of the higher levels, down to the lower levels. So when you read scripture, you'll sometimes find some certain passages which emphasize just one side. Then you'll find other passages which emphasize the other side. And when you meet someone who just wants one side, right, that's what heresy is. Heresy is choosing one side and not. And blinding yourself to the other aspects. And so that's the great thing about our tradition and the great thing about Christianity and about the Bible is that you always kind of have to take it in its totality. You can't just take a verse, pull it out and say, see, see what this verse says? This verse says, you know, that. That you can't do any works. Like, all the works you do are dead. It's like, okay, yeah, there's also this other verse. But no, no, no, this is the one that's important. So you always have to take things all together. Hopefully that helps you understand why sometimes the. All these. These intermediary layers are seen as dangerous and bad. And there are other times where all these intermediary layers are seen as messengers and as angels coming down to talk to, you know, to tell the Mother of God that she's going to bear Christ, that angels come down to give messages, that they appear as the angel of the Lord. You know, all of that. You need both. All right, so Dusan Babik asks, what is the symbolism of Enoch and Elijah being taken into heaven while still alive and not experiencing physical death? Please elaborate a bit. That's so extraordinary, but I haven't found some deeper explanation of that. Okay. There are several things going on in those. In those stories. They're all ultimately related to Christ because Christ also ascends into heaven bodily. The one thing that it has to do with for sure it has to do with a transition of worlds. And it's there. It's there. The pattern is there. I'm telling you the pattern is, is, is so present, but it's hard to code totally understand why it has to happen that way. So there isn't. There isn't just Enoch and Elijah, right? There's Enoch ascends before what right? Enoch ascends before the flood. Elijah ascends at the fall of the Northern Kingdom. And so there's. And after crossing the Jordan, or before crossing the Jordan, you could say crosses once and then before crossing back, then Elijah goes up. And so you see Enoch going up before the flood and then you see Moses going up before they enter into the promised land. Because although Moses dies, there's a tradition which we find in the Scripture in the New Testament that says that his body was taken by St. Michael. So Moses's body was taken even though he died, his body was taken. And so you see again when the Ethiopian eunuch is baptized, then you see Philip being taken up into heaven. It's very vague about what that all means. And so there seems to be something about something about the head of something or the highest aspect of something going into heaven. And that is what causes the transition. You need that to happen for the world to change, for the world to find a new name, a new identity. So you need to have some kind of ascension. And so what it means bodily, it seems to have something to do with how in a certain manner the body is contained to a certain extent in heaven, in a certain way that the body is contained. You could say the potent. I'm going to say things that I'm going to regret later that like St. Paul said, there are spiritual bodies, that there are a capacity for the body to be contained in its principle, maybe let's say it that way, or the possibilities of the body contained in this principle. That is as close as I'm going to get to helping you understand that because that is some. That is like that is a understanding that symbolism man, and you know what is related to this and this is something that Matir has gotten me because that's also why in Revelation and Matthir really is the one who said, Jonathan, you're your anti Protestantism is preventing you from seeing a pattern which is that that's also why it says in Scripture that you know, the saints will be taking up into heaven and will meet meet Christ in the sky before the end And I was like, yeah, it's there with Enoch and Elijah and Moses. Now, I'm not saying I believe in the Rapture in a very. Kind of. In the very crass way that people are talking about the Rapture, but for sure that that pattern is the same. The pattern of the. Of being taken up into heaven before the end of the. The world is related to Enoch, Elijah, Moses, and all these figures. So, yeah, so I just gave you guys a nice doozy there, huh? That's really. From material. Material was really like. He was chiding me. He's, like, not getting it. All right, so Wyatt Lawrence asked, what is the symbolism of bearing spices? Myrrh? I don't know if myrrh. Is myrrh a spice. Isn't myrrh like a. Like an oil that is meant to. That is used, for example, for embalming and for all those kinds of things? So, yeah, so sorry, I don't know. I'm not sure it's a spice. So. Papercut ask. Hi, Jonathan. Reading Legends of St Nicholas, I found the story of the Evil Butcher. For those who don't know, it goes that three children were gleaning fields, stayed out too late and getting lost, found a butcher shop. The butcher lets them stay the night, but while they're sleeping, kills them, chops them up, and stores them in a pickling barrel. St. Nicholas arrives several years later, realizes what has happened, and resurrects the children. The story has a lot of symbolism of the Fringe remnant. Nice catch. Gleaning, yes. Night being lost, and the Butcher. But is there a particular symbolism of the pickling brine? Intuitively, it makes me think of bitter waters. Yeah, dude, you got it. What is the symbol of turning a man into a pickle? It also has to do with wine. It has to do with. Yeah. It has to do with changing, turning, fermentation on itself. It has to do with using the bitter waters, salt or vinegar, or fermentation to preserve rather than to destroy. So it's like one of the hidden aspects of the lower world, which is something that I've mentioned a few times. I think I've mentioned a few times, which is that this is why it's difficult sometimes to think about this symbolism, because the earth, let's say the lower part of the pattern, it's both dissolution, rotting, breaking down into elements, and preserving, which is why you find ancient things hidden underground, which is why you find. That's why you find treasures underground. You find stuff. You find precious things underground. And so that's one aspect of the lower. Lower part of the world. And so that's exactly what St. Nicholas does, right? St. Nicholas is already related to the solstice, is already related to, let's say, giving back seed, giving back value to things which have been devalued or have been turned into. That's why he saves the girls that are going to be sold into slavery by giving them a golden ball, by giving them an identity, by giving them a seed, a precious thing. He's able to save them from slavery. He's able to save them from falling into these lower aspects. And in here, you basically have the idea of. You basically have the idea of something like how Christianity is actually able to preserve and resurrect some aspects of the pagan world, like some aspects of the strange. You know, in the same way that, for example, Christianity is the one who preserved and gave new life to the. To the poetic, to the Eddas, that Christianity is the one that preserved and gave new life to. To the Greek, Roman myths, to all of these old stories. That is one of the mysteries of Christianity. And so, yeah, it's finding. Finding. Yeah, that's. That's what it is. And so it's a great story. It's a wonderful story. All right, so Chase and Lindsay says, hey, Jonathan, in the story of the frog prince, why is the violent action of the princess throwing him against the wall the event that finally causes his transformation into a person? Yeah, I've been thinking about that. I've been thinking about that. I think that in the story, what it's supposed to be, I think it has to do with the fact that the frog has to die. I think it's supposed to die. And I think that's why we see that gesture. You don't totally need it, but for sure. And it's one. It's. For some reason, it's an aspect of the story which often gets ignored when people retell it. But I think that's why that happens. I think the frog is supposed to die, and then in that death, you know, the prince is born out of that death. And so you can imagine, like, the boy has to die for the man to live. That's what an initiation is. That's what baptism is. That's what, you know, rites of passage are, where some aspect of you has to die in order for the new one to be. To be born. So I think that's what's going on there. All right, so Manuel Montiel says, when I discuss religious notions of demons and principalities with materialists, they always refer Back to some sort of physical phenomena to explain it and state that the religious notions were just a way of explaining something. The ancients didn't have the knowledge or right language, eg, an addiction to porn. More precisely be explained by hormone psychology instead of possession. Basically a game of linguistics to them where they have the proper, accurate language. I know they aren't wrong in describing the physical phenomena, but as if it completely ends there for them, as if I'm talking to a wall, since it's just word games for them. What do you think the appropriate response would be then to this claim? And so, look, man, I want to be honest with you. You do what you can and then at some point you stop throwing pearls to swine. Like, this is an exact example of throwing pearls to swine. Because you are trying to show them the identity of something and the pattern of something, and they are blind to it. They cannot see that there's an overarching pattern. And so I would say just, just, just do what you can and then don't take it personal if they, they don't understand it. Because some people are just blind. Like, if you watch some of the conversations I've had on my channel, it is so frustrating for people that have the insight and can see to watch someone not only dismiss what you're saying, but do it arrogantly, as if they. As if you're just a superstitious idiot, you know. And I would say, like, the best thing you can do is to actually find joy in that. You know, I actually find joy in it now because, you know, I get annoyed, but I usually just have a secret joy, which is that, look, man, you think I'm an. You think that I'm an idiot like you. You actually think that I'm a superstitious idiot. And you're like, there's something about that which brings me pleasure. I don't know what to say. So I wish I could help you, man. I wish I could help you. All right, so Ron would. What is the symbolism of honorable ritualistic suicide, especially harakiri harkiri, plunging weapon into one's belly, cutting a cross shape. I was able to participate in the kendo club in Japan. At the end of the practice, we would all sit and informally gather ourselves at the leader's instruction with hands clasped in a circle over the belly, similar to how the sign of the cross in the Orthodox church is said to land on the belly rather than the heart to signify conquering the passions. Is this perhaps partly why a cross is cut into the Belly during seppuku. I don't know. I really. I wish I knew. I don't know enough about Japanese symbolism to. To understand that. It probably has something to do with that. It probably has something to do with if you're doing. If you're really doing, like a cross gesture, that it's really about, like an X, right? Like, you know, how you cross out something to say that it stops existing. That's probably what it is. It's like a. You know, it's a. It's a. It's like, let's say the two intersecting aspects, you know, of identity and potential. But now it's basically cutting it open so that you cease existing. That seems to be the best I could do with that, but I would have to know more about that symbolism. All right, so Reuven Korf says, hey, Jonathan, has your symbolic worldview been much influenced by the four senses of scripture? Historical, allegorical, moral, and anagogical, developed from origins writing for use in exeges in the West? If so. If not, how would you see your own approach as interacting or responding to this kind of exegesis? And so I think that that's great. I think that that type of interpretation is. Is perfect. But I would say that. I would say that, for example, if Origen was able to describe the four senses and others in his wake, it's because they perceived a common pattern across the four senses. And so I think one of the things that we are free to do, which was maybe more difficult for the ancients to do because they were so imbibed in it. So in a certain manner, the fact that we are more alienated from this worldview means that we are also able to possibly be more fractal about these meanings and realize that the sense of scripture, these four levels, contain indefinite levels in between them and that. And that it really is a pattern of reality. And I think that if I. It's like, I. I might be arrogant, but I think that if I was sitting with Origin and Origen had the insight of the last, you know, 2,000 years and. And especially Modernism, I think that he would have absolutely no problem with that, that he would find it completely in tune with what he's saying. That's what I think. Hey, so Jacob is in the house. All right, Jacob, thanks for showing up. That's awesome. And seeing you here for a little while. So Arthur Holmes Brown says, do we eat our pets? I recently listened to yourself and meant to expanding the concept of eating. Yeah. As the life of our pet cat or dog. Is largely lived and given to bring us comfort and joy. Is that a form of gathering into ourselves that is eating? All right, so no, you have a good insight about it. And so how can I say this? It's harder for people to understand it the way you're describing, but it's right. Is that you have to understand your pets as extensions of. Of you basically in a similar manner as your children are. But sometimes what happens with pets, which is interesting, you know, if you want to know a lot about someone, look at how he treats his pets. Because the manner in which the. The relationship that you have with your kids or your family is mediated by, by a lot of psychology and a lot of other stuff. Competition, all of these things. There's a lot of stuff which when you see a master and his pet is not there, it's a more direct relationship. It's more of a mind to body relationship. And, and so you. And so you can get a lot about people if you watch their pets and how they treat them and how their pets interact with them. And there's also a way in which you can understand how the modern world will tend towards. The opposite will tend towards people treating their pets as their gods, like treating their pets as kings that they serve. And that is just an inevitable side effect of, of the kind of upside down world that we, that we live in. You know, I'm sure a lot of people are laughing hearing that right now because they know people that do that. All right, so Garth Natwick. Natwick says hello. Jonathan. Recently I decided to invest myself into the craft of stained glass. So I might as well ask the common cliche question on this channel. What is the symbol of stained glass windows? I mean, stained glass windows are wonderful. I love them. They're really more western for sure, in terms of their application. And I mean, it's great. You have light coming through images. How better could you get? So I think that that's what it was. I think it was the idea of being able to see these patterns, these stories, these images of people that we, that we revere basically shining to us in light. And so I think that that's the. So there's actually probably a relationship between the kind of automatic veneration people get from being on screens. I've mentioned this before, which is, I think one of the things that make us so strange, our strange interaction with people on screens is that you're looking at someone that's just light. You're basically looking at someone that's shining towards you. And so I think that. That. That's probably part of the star phenomena is. Is related to that as well. So. So that's what it is. And they're wonderful. Yeah, definitely. So Dorothea says. Are Christmas and Hanukkah symbolically somehow related, or is it a coincidence that they occur around the same time? No, they're definitely related. And not just Christmas, but theophany or epiphany is definitely related. And so epiphany or theophany is the older of the feast. It was celebrated before Christmas in the. In the. For by the early Christians. And it. If you look at the symbolism of epiphany or theophany, it is a symbolism of light. It is all about light. It's all about the revelation of the Logos, which is why at epiphany, you have. People might find it confusing because it's not just a celebration of an event. For example, it became that with time. Where in the Orthodox Church we celebrate the baptism, and in the west, people celebrate the kings who come to recognize Christ. But if we look at the different symbolism, it's all about the revelation of the Logos. And so you see at Theophany, there are allusions to the wedding of Canaan, there are allusions to the baptism, allusions to the birth, and then allusions to the Three Kings, that is the moments in which the light shines forth in the darkness or out of the darkness. So it has to do with preservation of light in the time of the solstice as well, like this light that is almost running out. And so you have this one light which survives into the new world and then shines brightly to kind of illuminate the new cycle or the new world. And so it's a very much a similar symbolism between Christmas and Hanukkah. And I think that probably to a certain extent, consciously so, that it just happened that way, because the Jews that transferred the celebration of Hanukkah into epiphany were very much aware of all the symbolism that was related to this little light that was preserved and shown in the darkness. Yeah. All right, so Jacob says, what. What did I do now, you guys? So Jacob and Bradley are fighting in the chat. You know, you need you, the family. Keep your family problems outside of the chat. Guys, we don't. We don't wash our dirty clothes in public. Okay. All right. So Christian Kleist says, hello, Brother Maximus. What is the symbol symbolism of the copia meme if you don't know what it is? Can you elaborate on why most icons of the crucifixion depict Jesus without the crown of thorns. Does it have something to do with him already being depicted with a halo? Thanks. Merry Christmas. So I don't know what the copium mean is copium. You guys just keep exposing my, my boomerness. So I guess it has something to do with the idea of like coping with some kind of. I don't know, guys, I wish I knew. I would have to check on it. But I can answer to you. Why Christ does not represent it with the crown of thorns on the cross is because Christ didn't have a crown of thorns on the cross. You know, the cross happens during the moment of the Ecce Homo moment when Pontius Pilate presents Christ to the crowd and he has a crown of thorns and he's wearing the, the, you know, the, the purple. He has a reed in his hand as a mockery of a king. And so that's why most of the time it's not represented on his head on the cross. I actually don't have a problem with representing the, the crown of thorns on the cross occasionally because, you know, for the same reason that icons condense events, right? They. They just condense events into one. And so I think that it could be you. It could be useful or it could be possible to do that, but it would, it would have to be an exception because it's really not traditional to do that. All right, so Midohamed Ali says, Bonsoir, Jonathan. The Bible contains many references to slavery, which was a common practice in antiquity. Biblical texts outline sources and legal status of slaves, economic roles of slavery, types of slavery, and debt slavery, which thoroughly explains the institution of slavery in Israel and antiquity. How do you reconcile these acts in today's world, especially in these verses in the Bible? And he named some verses to name a few. Merci. So, all right, I guess that was gonna. That was bound to happen one day. And so I think we need to understand that in the Bible, what's important is the manner in which we treat those that are around us. And you could say that the type of social hierarchy, this type of social hierarchy is that in some manner it is, let's say, inevitable. And so whether you understand a slave as the actual property of someone, whether you understand a slave as a type of servitude which you are required to offer to someone for whatever reason, whether you sell yourself to that person because of debt, whether you are taken as a prisoner during war, you owe servitude to the people that took you, all of these types of things. What's Important in the way that scripture talks about these relationships is rather how to treat those that are below you. That is the emphasis that is put in scripture. So the idea is not whether or not slaves should exist or not. It seems to me that to a certain extent in scripture there is a sense that it understands that these types of hierarchies are going to happen one way or the other. So there's an emphasis on the idea of rather how to treat the people that are below you and how to, even though they are socially below you, that they, that they are, let's say socially owe you money or socially owe you servitude, or owe you this or owe you that, that they are ultimately your brother and sister be in Christ if, especially if they are Christian. They are, you know, they are made in the image of God, you know. And so all of this is, is kind of, it's what is most important in scripture. Because like, I don't want to excuse slavery. There's no point in that. But let's say without, without something like slavery. It's a, in a traditional world you need, we have what we have today, we have massive, huge state funded welfare state. And that is a great way to avoid slavery. Because one of the problems of just thinking that slavery is bad is always bad in itself is that if you have someone, let's say imagine this, like, imagine you take prisoners of war from, from another country and now you, you take them, you kill, you know, you destroy their land, you destroy everything about them. Bring them, you just take them and then, then you just set them free. Free to do what? What are they going to do? They're going to die in the wilderness or not? Don't have any food, they won't have any, they won't have anything. And so there is a double bind in the idea of slavery, especially like a proper relationship, which is that if someone owes me servitude, I owe them too. I owe them to take care of them. Especially in a world that believes in God, especially in a world that believes in a transcendent good. And so this is the issue, this is what's most important in the way that Christians talk about this question is in the ancient world, now I celebrate as much as the next person that ultimately Christianity ultimately led to a world where slavery doesn't exist anymore. Because then the reality of the image of God and the other becomes far more bright and far more apparent and far more real in our experience. But I think that that's the best way to understand why it is that it continues to kind of exist in the. In the ancient world. And to be honest, it also exists today. It's like, how can I say this? Like, right now I am not allowed to leave my country. Right now I am not allowed to take a plane. Right now I am not allowed to go into a restaurant. So people who think that they're not a slave of something, they are deluding themselves. Just because you have the favor of your master doesn't mean you're not also a slave. And so, yeah. All right, here we go. Roman Glass. Hey, Jonathan. I keep coming across a phrase, both in fictional literature and secular spirituality, the journey is more important than the destination. You're listening to my Dinner with Sticks, weren't you? My question is, what are your thoughts on this? Is this at odds with the Christian story or the eschaton is the whole point of the story? Thank you. Merry Christmas and happy New Year. So how can I say this? This destination is the reason for your journey, and the journey provides the transformation necessary to acquire the destination. Okay. I think that that's the best way to understand it. And there's also, like, if you take that phrase, you know, and you just try to apply it fractally. Okay? Like, seriously, try to apply it fractally. Cooking is more important than eating your meal. Let's keep going. You know, it's like flirting is more important than having a date, and dating is more important than what. What it leads to. It's like, just try to apply that sentence fractally and you'll notice just how just silly it is. It's silly. And so the best way to understand it, let's see, from an orthodox perspective, is that the end goal or the eschaton is not a static thing. And also the end goal is not static in St. Gregory of Nyssa. St. Gregory of Nyssa talks about the movement from glory to glory. So you have to understand it as this moving up and these steps opening up towards more and always opening up towards higher and higher and more and more. And so it's not as if you reach the destination and then you're dead. It's that reaching these lower accomplishments and low, higher states will open up even higher and more lofty experiences and states for you. So I think that that's a more proper way of understanding it, because the other one sounds nice, but it's actually people who haven't thought it through, in my opinion. All right, so Maximus Magyar says, what are some good sources of orthodox lives of saint. The lives of the saints in The Horologion seem very sterilized and seem to exclude the parts of the stories that you would focus on. The Horologian also says that iconographers who depict St. Christopher dog headed are ignorant. Yeah. So I would say, you know, what a good place for the story of saints is right now, to be honest, is Wikipedia. Wikipedia is actually right now is a great source. If you can read it carefully and I'll be attentive to the places where they are ideological, then it tends to accumulate a lot of the stuff that the modern reformers of religion tried to get rid of. And so you can actually find some pretty interesting things on, on Wikipedia. So yeah, so Samuel Ramalera in the chat says our restrictions on Canada still that harsh. They are becoming harsher and they are not looking like they will let up. So yeah. All right, so here we go. So Roamer says. Hi Jonathan. I've been intrigued by the apparently far fetched idea that a figure likes St Christopher so easily imagined as simply a brute, could perhaps be seen as a brutish sort of translator. Something like a giant foreign two headed scribe carrying words, little logi from one language to the other, undertaking even greater and more difficult tasks, serving even more powerful voices until quite unexpectedly he finds himself carrying the divine Logos himself between two worlds. What do you think? Could the symbolism of translations be meaningfully transferred to the stories of St. Christopher and other bar Barians. Yes. Who strove to transport the word of God across the world. Thank you and apologies for the long question. No, I understand your, I understand your, your idea and I think that, I mean, yeah, sure. There's definitely a relationship between St Christopher the Translator and the translation and the idea of reaching the, the strange. You know, there's a. Relate. There's a relationship of taming too. There are some versions of the story of St Christopher where when he gets to the other side then he loses his ugliness. Right. He becomes a normal man. There are other versions of dog headed saints converting which have that trope. For example, in the legend of St. Andrew, the kind of all these stories about St. Andrew going around the world and evangelizing, he meets this brute called Abominable and it's a big giant dog headed, you know, cannibal monster. And when he converts he, he becomes human and then he changes his name from abominable to Christian. So it's like a beautiful fairy tale, you know, hagiography. So I know, I like your idea. I like your idea of, of the idea of, of this kind of monster that that crosses over like translation. All right, so Drew McMahon asks. Hi, Jonathan. Do UFC and MMA in general seem to be taking over the sports world? Or maybe it's just my bubble. How do you interpret the rise of combat sports and its crossover into mainstream? Lots of participation at local levels among everyday folks as well. Thank you. I mean, it's not surprising because. Because fighting is basically the. The boiling down all sports to one thing. Basically two guys fighting and then one being better than the other. So it's not surprising that that would happen. You know, I also think that as Christianity wanes, let's say, I think that. That it's inevitable that the kind of gladiatorial combat would. Would return. So, you know. All right, Connor, in your conversation with Matt, Fred, you use the example of a car being millions of things and one thing at the same time in the ontological hierarchy. How does an example like this necessitate a supreme being at the highest level? I'm struggling to see how you make the jump from car to God. Does it have something to do with God revealing himself as being three persons in one essence? Yes, it does. Exactly. Unity and multiplicity. And this quality of many beings being one is an attribute that all beings share. And so. Yes, but there is more than that. It's like if you ride the ontological hierarchy, if you write it up just conceptually, if you just do it conceptually, you run into a problem at some point because you come to the one. You come to the one which is behind all the multiple, right? And so that's why you have that move in something like Neoplatonism, you have that move in. In things like Hinduism, which is that as you, if you ride the. The category structure, the ontological hierarchy, you get to something like being, then you get to something like being and non being. Because for being to multiply, there has to be something like non being. Or else you can't. You can't escape the monad if you don't have some notion of non being. So, like being a non being as the ultimate one, let's say. So it's really is. Once you understand that that's how the world works and you. It just quickly becomes inevitable. But the mystery that Christianity reveals, I think, is that the multiplicity, the three is not lower from the one, which is a total mystery, but also solves a lot of problems. It solves a lot of problems in terms of the idea that the world is fallen and the world is like an illusion or Maya, or that the world is corrupt in itself. You See in a lot of kind of gnostic thinking and in some strands of Hinduism and Buddhism that we have to escape the world. We always have to escape because we have to escape into the monad. We have to dissolve back into the one. You know, if you read some mystics, like some Hindu mystics, for example, they had this, this sense in which, you know, you have to dissolve back into Brahma because everything is an illusion. All multiplicity is an illusion. This is something that the Trinity is an attempt to solve, which is that in the infinite unity and multiplicity are fully there. And therefore the multiplicity of the world is a bond of love rather than a scandal. And a kind of. And just fall can be a bond of love at least, even though we do see a fallen aspect of it, you know. So Janet Horseman asks, am I right to understand a garment of skin as something neutral? If so, is our current movement towards transhumanism just another garment of skin? My 20 year old can't wait to live in a world like Ready Player One and just sees it as an inevitable step toward in technology. But I find this idea terrifying. Is this overacting? And so the garments of skin are. The best way to understand is that the garments of skin are not neutral. Yeah, they're neutral, but neutral in the sense that they are positive and negative at the same time. Right. That they. The more you increase the garments of skin, the more in. You're in more and more danger of forgetting the essence, of forgetting the life or forgetting the meaning because you keep adding these layers and you're always in danger of forgetting, but you're also increasing your power all the time. And so. And one of the problems with the garments of skin is that they tend to seduce us into thinking that they're the thing. So for example, like your 20 year old, like you said, that can't wait to live in a world like Ready Player One. It's like already that's a serious problem because I mean, this is going to sound corny, but it's like he's not asking himself, how could I continue to love my neighbor in a world like Ready Player One? He's saying he's excited about the world itself. He's excited about the technology and the garment. He's not asking himself how it can supplement the true and the beautiful and the real. Sort of. That makes sense. So yeah, that's it. All right. So Charles Harrow says, what is giving you hope about the current situation of continuing lockdowns in government? Overreach, man. What's giving me hope. And I'll be totally honest with you, right now, I do not have much hope. And it's just a moment. It'll pass. But it's just because the news about how things are going to be dealt with, let's say, around me was given to me just a few days ago. And, and I haven't completely. Haven't completely digested it, let's say, and I'm struggling to. To deal with it. And so let me tell you what my only hope is in the current situation. My only hope is that adversity breeds strength and adversity breeds dedication. And so what I hope for myself is, is that losing, losing how easy it is to go to church and to worship and to be in communion will make me value it more and make me strive for it more. So that's my hope. All right. Patrick Varchola asks. Hi, Jonathan. My question is about ways in which principalities manifest in our physical world. What differences are there between people embodying principality willing or unwillingly, eg. King embodying angel, or the kingdom or demon of lust possessing a person, and principalities taking particular physical or rather visible form, IG Archangel Gabriel visiting Mary and how incarnation of Christ fits in all of this? Thank you. I don't know why that's so complicated for you. And so think about it this way. Think about it like everything that exists is both an agent and a body, is both someone, something that is acting on the world and something which is being acted upon and is a body for other things. Right? And so that's true of everything in the world. And especially intelligent, obviously, especially intelligent agents. So you are the body of your family, a part of the body of your family. You are a body for your state, your body for your Facebook group, or your body for whatever it is that you engage in that has a higher identity than you. Your body for certain causes, you're a body for certain political ideologies, you're a body for your city's recycling program, whatever it is that you act in. And you can be a body for that. Now, you're also a principal, for sure. You're a principal to a certain extent for things that are under your power, you could say, and so that's the way it works. And so you know the difference between, let's say, so there are more direct and indirect ways to act or to manifest. So sometimes things, let's say, let's say, let's think about it this way. Let me help you think about it this way. So let's say I'm the father of my family. And so in my house, my. My house mostly my wife and I, let's say my wife and I, our house functions as an extension of our relationship. And therefore there are certain implicit rules and certain implicit ways of being that have to be maintained in the house for that to continue to be true. So my kids, when, at this point now, without me saying, they know how to behave, they know what is acceptable, what is not acceptable. They know how to engage with each other. They know what their responsibilities are. And then once in a while, let's say it's time to do the dishes, and my child doesn't do the dishes, and so I have to go knock on their door and say, come do the dishes. And so one is a more direct implication of the. Of the principle where there's a direct communication which comes down and then informs you of what you need to do. And the other one is more indirect. Your will kind of imbibes the body of the thing that you're the head of, and then that just kind of naturally exists. So, you know. Yeah. Hope that helps. All right. Kevin Patterson asks, how does the structure of the Trinity relate to unity and multiplicity? We experience in communion, as in God is of one substance with three hypotheses. There's at once a unity and a multiplicity. Is it the same dynamic between God and his church? And so I'm afraid I'm going to skip that question, Kevin. It's not because I don't want. It's just because I really. I want to be careful with trinitarian theology and leave it to the experts on trinitarian theology. For sure, there's a relationship between you. There's a relationship of unity and multiplicity in the Church, you know, and Christ says, be one as my Father and I are one, you know, so there's a relationship there for sure. So any Crawford asked, did you watch A New Spider Man? No way. At home, or did you think more and more we have hero stories with no real villain. What do you think of this trend? And so I know I have not seen it, and so I can't go to the theater, folks. You know that, right? So I will see it when I can see it, and then that'll be it. But no, I have not seen it. All right. So Nom Gronai says, my question is about the orthodox prohibition on depicting Christ as anything other than himself and icons. If symbols are a way to point to a high truth of something, why not admit other representations of him, so long as they point towards divine glory, like Christ as the Lamb, for example. Thank you. And I hope and pray that you have a blessed Christmas. Yeah, that's a tricky one because I sympathize with the Western position on this for sure. But for sure, the Orthodox Church, we're not allowed to represent Christ as a lamb and we don't. I don't, I don't think I've ever have. And it has to do with how the old images that point to Christ was something like shadows and that we should represent Christ directly now that we have the Incarnation. And so I get it, you know, and it's fine. I won't go against the tradition, but I think there's something missing. I think there's missing the sense in which Christ also contains in himself all these shadows, you could say, are all these pointing. And so the point, the different parts of the Old Testament that are pointing to him are also like his body, you could say. And they are the, they're the reason or the, the manner in which we're able to recognize the one Christ in the Incarnation. So if you just say, well, we don't need those anymore because we've got the thing, I just find that a dubious explanation. And so sorry to go against the, I know I'm not going to go against, you know, the Fathers of the Council, but I just don't, I don't totally agree with that. I would have liked something, something like we should represent Christ as himself and then marginally represent him in his, in his shadow versions, let's say. But that, let's say in something like in the apse or you know, in the Holy of Holies or certain places in the church, we should only represent Christ as Himself. But let's say in the nave and the stories, we could represent him more symbolically. So yeah, you know, so Joe, Kelly o' Neill says, what can you tell us about the understanding of symbolism of specific colors, meaning of Rudolph's red nose? And so I have a, by the way, I have a video about Rudolph the red nosed reindeer. You should check it out if you want to. It's actually one of my less, my less watched videos for some strange reason. But I think it was a good video. I thought I really captured the symbolism of Rudolph. And so I mean, the symbolism of colors is really tricky, folks. I really struggle with a lot of it. You know, I tend, I tend to see symbolism as patterns. And so I struggle sometimes when people tell me like a color means this. So for example, like if I See, blue opposed to red. That. That makes sense to me. You know, cool, hot. There's. There's, like, a light, dark, you know, and there's a sense in which that makes a lot of sense. And so. And it seems to intuitively work with, like, right hand, left hand, you know, like, let's say green below, you know, and white above. Or glee, green and gold. I think that when you have them in pattern, I tend to kind of understand them a little more. But I struggle when people tell me, like, white, you know, yellow means this. And I'm like, really? Yellow means that. It's. I don't know, man. Like, when I eat a lemon, I don't have that experience of meaning. Like, I don't have that same experience of meaning. But, for example, like, red is definitely something that excites us, like, in our perception of it. So it's exciting in a positive and negative way. It's poison. It's also flush. Like, if, you know, when you're. You're. When you're embarrassed or when you're excited, your cheeks become red. And so I think that these are signs that. That have to do with red, with passion, with all that, you know. And so I think some of it is right. But. Yeah. So Nate Barker asks, hey, Jonathan, thanks for all you do. What is the symbolism or significance of the number three in that God is described as a trinity? You talk about the pentagram. I heard you say that four is a certain stability in two opposing pairs. So what's significant about three in this respect? Why three and one instead of, say, four and one or five and one? And so there's several aspects of symbolism of three. One is that three is. It's a dynamic number, you know, because there's no opposites there. Because when you have two, then you have two things looking at each other, and they. They tend to manifest themselves as opposites. If you have four, you have a similar problem, or not a problem, a similar reality, but three. The aspects of three tend to manifest either as dynamic, that is, each corner, each aspect relating to the other, or as a triangle, which is that there's one and then the two. So there's the opposites which are resolved into unity. And so that's usually the two aspects of the symbolism of three. And you see both of those aspects of the symbolism of three sometimes represented in the Trinity as well, or represented as images of the Trinity. So Garrett Widner asked. Hello, Jonathan. I've heard you speak on the meaning of some of the cardinal directions, north, associated with something like evil south with one's ancestors, but only in passing. I was hoping you could explain this a bit, especially address the meaning of the west. And so the meaning of the four directions is super important. It's very, very important, and it's very complex and it's very multiple. There's one aspect of the four directions which is directly related to the sun and the sun. The way the sun rises in the east and sets in the west and then moves to the south, does it move into the north? And so the north tends to be related to darkness, and then the south as. Let's say the. As heat or light, but not in the same way as the east, for example. And so let's say the. The bastion of light, you could say, or the cradle of light, you could say, is the south. And the cradle is a good image, let's say that in that sense. And so in the east, then you really have the origin and the end. So the east is the origin of light, and the west is the end of light. And so if you understand it related to the temple, for example, it's really important where the west is, where the tabernacle, the ark of the Covenant is. And so, you know, the light, you could say the glory of God rises up in the east, then lands in the west. Like it says, Christ is like a lightning bolt. The son of man is like lightning, which moves from the east to the west. And so it has to do with the origin in the end. But it gets very complicated very fast because depending on what direction you emphasize, and so ancient cultures tend to emphasize east, so tended to point to direct their prayers east or direct themselves eastward. And so then the north would become the left hand and the south would become the right hand. So then the north would be related to the left hand in the sense of darkness and in the sense of crooked, in the sense of all that. And then the right would be related to light, to a substitute for the center, all of that stuff. And then behind you is the west. And so it's related to death. It's related to that which is behind you. I don't know what to tell you. Right. You eat this way, and the residue is that way. You know, could keep talking about this for like an entire hour. I mean, obviously I should make a video about it because there's so much to be said about the four directions. Yeah. All right. So Luca Irimadza says, whose prayer does God hear when two people pray for opposite things? I would say he listens to both sides. I don't know what to tell you. All right. And I mean, what a strange question, like, which side does he. Which. Let me mess you up if you want. Whose prayer does God hear when two people pray for the opposite things? He listens to the one which the opposite things happen. Is that okay? Does that help you? Like, if two teams are praying to win, which prayer did God listen to? The one that. The prayer that the team won. But there's a man in which. This is so pathetic. Like it's. How could not pathetic. Sorry, sorry, sorry, sorry. This is not what religion is about. Religion isn't about praying to God to get things. I'm not saying it's not a little part of religion. It exists in religion, but it's definitely not very high on the scale of what religion is about. Religion is about transformative participation and moving up the hierarchy of being into God. That's what religion is about now. Yeah, some people ask for cars and some people ask for stuff and it's like, who cares about that stuff? I don't know what to tell you, man. Sorry. All right, I need to stop. Stop. All right, all right. Arizona man asked, to what degree do you believe the recent popularity in NFTs, and specifically the community element are serving as an updated placeholder for our inherent need to participate? Was this a technological solution? As a rubber band effect, juxtaposing the COVID lockdown from 1 to 10, how hard should we ape into NFT projects that are Christian centered? I really think that most the NFT stuff is just fluffy fluff, fluff, which is okay because fluffy fluff, fluff. It's not that that doesn't exist. It exists, but that's what it is. It's fluff. So fluff, let's say it's a, it's a bubble, right? Bubbles get really big, but also bubbles are very fragile. And so that's what NFTs seem to be. A lot of the crypto stuff is that in general, it's like it's a bubble. And so it grows and it gets big, but it also is fragile. And so I would say don't put a lot of your soul into NFTs. Don't put a lot of your, let's say central attention into stuff like that or crypto either. This is not what our lives are about, but there's nothing wrong with NFTs. We did it. It was a way to, like you said, to find ways for people to participate to a certain extent and to kind of increase the, the, the reach or the glory of the project, the God's Dog project. We were doing it, but for me, I saw it as a utilitarian thing. Like I, I saw it as adding to the God's Dog project and not as something in itself. So, so I would say be careful. So. But NFTs are just contracts, so there's a way in which it could be used in really interesting ways. So I'm still thinking about it. Like, I'm sure I'm going to do more and find some interesting ways to, to participate in it, but I definitely, I would, I would need to, it would need to be. Make sense to me and we need to be interesting. Everybody's going crazy with the fluffy fluff. Fluff. Yeah. Well, you know, I don't know what to tell you. That's what it is. So, so, so, so, yeah, but I really, like, I enjoyed the doing the NFT thing with you guys for the, For God's Dog. I really learned quite a few things and it was interesting to notice because we tried to do it in a way that was related to kind of narrative secrets and codes and stuff like that. So to me it was worth doing and I thought it was, like, it was valuable. And so we'll see what happens. I don't know what's going to happen with that. I definitely told people not to sell your shirt for this stuff because, you know, it's. Who knows what's going to happen? All right, so Nicola, Alexis asks. Orthodox church, as far as I know, prohibits marriage within seven degrees of kinship. In the Old Testament, we find Abraham and Sarah married, even though they are closest kin. I'm not sure what to make of this. Could you please help? And so, I mean, it has to do with Christianity being expansive, you know, and the idea is to spread the love, right, so that the Christianity grows. I think that that's what it is, but it's rarely applied, let's be honest, because it was crazy. Like, it's not just 7 degrees of kinship, but it was like 7 degrees of kinship plus 7 degrees of kinship to your godparents. So it was like 7 degrees of kinship to your own relatives and then 7 degrees of kinship to your godparents. So imagine like in a small village, it's like you don't have a lot of. So it, it was rarely really applied, but you could see that as an ideal, as an ideal for Christianity to expand. Expand through love instead of expanding through. Through war, let's say. All right, so, Ferret. Hi, Jonathan. What is the symbolism of sobriety? Can it Be a form of excess? In some cases, yes. If. Yes. How do we rec. How to recognize when it is? I mean, the thing sobriety is easily becomes an idol. And I think that that's when it becomes dangerous. You know, you say Maximus really talks about the idea of the sins of the right hand and sobriety is, could be a sin of the right hand where you, if you attain a certain sobriety, then you have a false confidence in yourself and you think that you've got it and you think that you're in charge and you're in control and, and that usually leads to pride and then it usually leads to a massive fall off. That's why Saint Maximus says that, you know, once you let the sins of the right hand enter, then it opens the door for the sins of the left hand and so all your sobriety collapses into different excesses and you might even be blind to sometimes. All right, so Matthew says, I have a question about the resurrection and monstrosity. A monster is that which can't be named. A hybrid of two things or more things. The resurrections can't be fully put into words and it appears like a hybrid between the human and the angelic example. The resurrected Christ eats fish and he can walk through walls. The problem is, besides the fact that Kong the resurrection and monstrosity seems to be blasphemous, it also seems incorrect. The resurrection is at the center, not on the borders where the monsters are. My question then is what am I misunderstanding about the monsters and. Or the resurrection? So you could say that the resurrection is, is involves the totality of the beings. And so you could say something like the, the resurrection contains the monsters or the, the margins. The resurrection contains the margins within itself in their proper place, you know, and so the gargoyles are on the outside of the church. That's an image of the kingdom of God. Right, and an image of the. Of. And so I don't can't totally tell you like what that means like in particular, but it has to do with something like the wounds of Christ remaining on the resurrected body of Christ, you know, like a mark of death which is part of the resurrection, you know, and so a breakdown which is part of the resurrection. How about that? That the, the part where Christ's body broke down, where the identity of his body broke down, which was, it was pierced, becomes part of its glory. So yeah. So Gregory Vus Vunis asks, here is mine. Do you have any advice for a new fantasy author? I don't know, maybe take, take our class that we're gonna set up if that happens. I hope it happened with M. With Nicholas Kotar and Paul Kingsnorth and a lot of cool people. In theory, we're putting together a writing seminar that will be focused mostly on fiction. And so these two are great. You know, Paul Kingsnorth is a great writer and you know, Nicholas Kotar is just a wonderful storyteller. And my part is going to be talking about kind of symbolic world and how to world build in a way that's coherent. So maybe that could be a way and something to do, but I don't know when it's going to going to come up yet, so. Oh, sorry. The question continues. He says, I've started writing a fantasy series that uses a lot of orthodox electrician thinking and the way it is structured, of course, this will probably not be obvious. That's what actually tries to see it. So yeah, that's great. I mean, that's awesome. I think that's the future and I think, yeah, I think it's the future. That's what we tried to do. So Christopher Mihaly asked, in your interview with On Broadcast, you both said that you wouldn't use owls in your artwork due to their symbolism. What is that symbolism? So I think the reason why we said that. I don't remember saying that, but I guess I know why is that. What I meant is that, for example, like, although I don't think pentagrams are evil in themselves, I wouldn't overtly use pentagrams in my art just because of the cultural associations with them and that there's no need to be scandalous just to be scandalous. And so if people identify a pentagram with things that are occult or satanic or whatever, or witchcraft, then like, I wouldn't use it because I don't. Why would I scandalize my brother? Like, why would I do things in a way that will overtly lead them into chaos? So I think that's the thing is that the owl now has become an image of all these things in terms of Moloch and in terms of like, in kind of popular thinking, the idea of. Of this ancient God. And so because of that, then I probably would use an owl just because it would confuse people. And, you know, why would I do that? So, you know, that's that. And so look at us. It's 10 minutes before the end of the hour, so it's pretty awesome. Not bad. So let's see, guys, chat. I'm giving you 10 minutes. You can ask questions in the chat. So it says, Nicholas Kotar was on the First Things Foundation YouTube channel. Cool. And he's written me some messages. I've been so out of it for the holidays. I don't think I've answered any emails, any messages or like very, very few. And I know he wrote me about something. So Nicholas, sorry, if you see this, I need to look at your messages and, and answer. So, Matthew Mole Brandon says, what is the symbolism of red light districts? Do you think they are a valid and. Or useful way to deal with inevitable transgressions? Gambling? I don't know. I think they're inevitable. I don't think they're valid. Like, that's a weird thing to say about that, but I think they're inevitable. And so I think that often what cultures will do will be try to manage that darker aspect of their society in a way that understanding that they can't totally get rid of it, they will try to isolate it. So I think that that's usually what happens and that usually makes sense. But it's a dangerous game to play too because if you isolate it, then you give it being and then that being tends to grow. And so let's say you disperse. So you have prostitutes all over like a little, few prostitutes all over the place. You know, it's annoying because then you have prostitutes all over the place and they're, they're, they're there and so, and so, so. But it. But then they also don't have a nation, right? They don't have land. And so but if you create a red light district and you're like, okay, all prostitutes and all that stuff go there, then what happens is that that will exist as a being, it'll have a principality and then it'll start to. The danger is that it can start to grow and to feed off, you know, and you can see that like, especially as the morality of society tends to break down, then you'll see that happen. Like in Amsterdam that's what happened. Whereas in New York they tried to do the opposite, which is that they tried to break down the kind of red light district type places to kind of scatter them. So they are, they're scattered, we're scattered in the city. They're more hidden, you could say. They're not as the cd. The city places in New York are not as obvious and not as, as clear. And so it's different strategies. I'm not sure one is necessarily better than the other, but you definitely will never get rid of that stuff, that's for sure. In the I mean, in the new Jerusalem, you know, but that's about it. So the ABC 123-45-6399 says, I asked Vanderklee about with the symbolism of icons and saints holding their hands over their chest area. And he chewed me out and told me to ask you. That's hilarious. I'd like to see that. I would have to see what you mean. What do you mean? Their hands over their chest area? Usually this. Like, there are a few icons sometimes that will show this. You'll see Samarit of Egypt sometimes does this. Usually it means that they're not worthy, if that's what you mean. But those are rare. There's not a lot of icons that do that. So I'm not sure. I'm not sure what you mean. Yeah, so that's usually what that means. All right. So Samuel Ramalera says, hi, Jonathan, could you explain how did the navigations and the discovery of America change challenge the medieval symbolic thinking? Thanks. From Brazil. And so I think that it probably wouldn't have had to, and I think it, in a way, really didn't. Because the idea that, like, I mean, it did in the sense that people hadn't completely understood that there was a land there, west. Some. Some people seem to understand that for sure. The Vikings knew that America was there. And so there are probably some navigators that knew, and probably even in Britain, there were some navigators that knew. You see some of the legends in some of the saint stories, you see this idea that there's land that way on the west. But I think that the idea that it's a wild land is something which was just inevitable in medieval thinking. The idea that the west was where the Amazons were, right, The Amazons and then all these wild lands and what appeared to us as being wild people. I think that this is something which was just a continuation of medieval thinking. You know, it was mostly the idea of, like, the weird idea that they would end up going east, right? That they could flip the world. Like, they could go west to go east. Like, that's interesting in terms of, like, let's say, the material world and scientism and the idea that people would find meaning by digging in the ground, right? That they would find meaning by. By developing this technology and this science, that somehow it would. It would elevate them and give them more meaning. I think that that's interesting for sure. Right. So Anthony Rosa says, related to Samuel's question, where does South America fit in universal history? It seems like it contains lots of Extremes plus Catholics and wild carnivals, etc. Well, West, I mean, north and South America are the, are the end of the world, right? They're the West. They're the west of the West. And so they will end up containing more extremes in them. But what's interesting about the extremes, like I always talk about California a lot because I think California is just such a great symbolic symbolism. Happens place because it does end up manifesting extremes in the way you said. So on the one hand, what you'll find in South America will be the last. The last bastion of Catholicism will be in South America way more than in Europe, that's for sure. But like you said, it also have all the weirdness of excessive carnivals and also weird hybridization of the tradition as well, like the whole Pachamama thing and all that stuff. So that's America. California is like that too, right? California has all the wild stuff and all the crazy stuff and all the Hollywood and the porn and the rock stars, but it also has the monasteries and the trads, the Catholic trads. And all these people are there more than in other places. So. Yeah, that's interesting. All right, let's see. Frederick Gopherschmidt asked what is in speaking in tongues about? The thing about speaking in tongues is that I think we don't totally understand what was going on back then completely. And so because of that we're confused about what it is. So there's a sense in which, in the scripture, my understanding is that there are two aspects of the tongues. One is speaking a language which is understandable to others. And so it's like speaking in a way that strangers can understand you. That seems to be one aspect of speaking in tongues. And then the other seems to be more like being able to speak a higher language, to speak the language of angels. And so those, see, to me seem to be the two parts of speaking in tongues. But now what we have with speaking in tongues is just like. I don't know what it is like the, the kind of Pentecostal speaking tongues just seems like a lot of chaos. Like people just spouting like going into trances by, you know, I, I don't question the experience. I think the experience is, is real. I don't think no one anybody's pretending, but it seems to be people able to kind of fall into a kind of trance where they, they just utter sounds and they make this, this. They just make. Make sounds. Sure. It feels good. I don't know. I've never done it. I'm not interested in Doing that. I don't find it very particularly interesting, but I have heard some examples. I even had a friend of mine who, who in the Pentecostal world said that she at some point was received a kind of weird blessing where she was able to speak Mandarin. And she, she, for several years, it just lasted for a few years where she didn't understand Mandarin but she could know she could speak it. So it was as if like if she wanted to say something, like a voice in her head would tell her what to say and she would just say it and it would be Mandarin. And I mean, I have no reason to doubt her. She's a serious person and not a kook or anything. So a lot of weird things are possible, right? So Christopher Mihaly asks, in your talk with Father Constance, can you explain more by what he said? Everything needs a cross. That phrase has been stuck with me since I first heard it. So I think that what he meant by everything needs a cross, that everything needs a middle, everything needs a place, a heart, a place where the vertical heaven identity meets with the horizontal potential, the horizontal potential of its existence. So it's like you have the identity and you have the potential and then you have the being which finds root in the center of the cross of the heart. And I think that the mystery that Christianity offers is that that center is also to a certain extent across in the more colloquial sense. That is, it's also a self sacrifice, a self sacrifice moving up towards higher identities and a self sacrifice down as a sacrifice for its parts. And so. So I think that that's the best way to understand. Understand that. So the ABC 1, 2, 3, 4, 5, 6, 7 or Etc. Says when will you complete your evangelization of sticks and hex and hammer? 666 so I'm going to talk to. I think I'm. He said he wanted. He was willing to talk to me in next year. So I'll probably write him a message and try to set something up. I'm very happy to talk to him. He's very intelligent and not just intelligent, but very knowledgeable about especially kind of Western esotericism and all that stuff. And so I'm sure it'll be an interesting discussion to talk to him again. I look forward to it. Definitely look forward to it. So I think we're done guys. I think we're done. I really enjoyed this actually. I enjoyed being able to pay attention to guys and feel like I'm a little bit connected with you. And so I would say thanks To Brad and Lisa and Jacob who showed up as moderators. Really appreciate it. I wish everybody a happy new Year despite all the madness, despite all the craziness. Also, we're still in the season of the Nativity. So Christ is born. Glorify him. And looking forward, I get the feeling like 2022 is going for me is going to be about writing. And so because I won't be able to travel, because I will be more and more isolated, I will write. And I also have opportunities to do so writing, finishing up the second part of God's dog and the third part, maybe we could maybe do even two books in one year. That'd be awesome. And writing a book, probably that's what I want to do. And so I just haven't totally decided what book exactly that I should write. But that's probably going to happen in 2022 as well. And so thanks everybody for your attention. Thanks for your support. I really appreciate it. You know, I, I always very grateful that you are a part of why I'm able to do this and why I can continue to do this and why I have, you know, the time and the capacity to, to, to. To be involved. So I'll see you very soon. Bye bye everybody. I hope you enjoyed this episode of the Symbolic World. The Symbolic World is based on a series of videos that you can find on my YouTube channel, Jonathan Pageau's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course, leaving a review on itunes. Everybody knows that's the best way to get the podcast out there to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon, the Pageau videos as well and on subscribestar. All those links you can find on my website or in the show description. So thank you and I will see you soon."}
