{"episode_id":"SW - #049 - 2019-08-14 - The Lord of the Rings - Symbolism of the Ring of Power","start":0.56,"end":43.78,"speaker":"Jonathan Pageau","text":"On this episode of the Symbolic World podcast, I'll be playing for you some thoughts that I had on the Lord of the Rings, especially surrounding the Ring of Power itself, its relationship to power, its relationship to technology, and how that can help us to understand our relationship to the things that surround us. If you want to check out this version of it with some imagery from the Peter Jackson movie the Lord of the Rings, please go ahead and find that on YouTube. The link to my YouTube videos are always in the description for the podcast. Just to remind you that everything that I'm doing here online, this podcast, all these videos are due to your generous support. So please check out the symbolic world.com."}
{"episode_id":"SW - #049 - 2019-08-14 - The Lord of the Rings - Symbolism of the Ring of Power","start":43.78,"end":45.3,"speaker":"Jonathan Pageau","text":"To see how it is you can."}
{"episode_id":"SW - #049 - 2019-08-14 - The Lord of the Rings - Symbolism of the Ring of Power","start":45.3,"end":64.81,"speaker":"Jonathan Pageau","text":"Get involved how it is you can support us. For all the supporters, I always offer some perks advanced view on videos. You can also ask some questions on my monthly Q&As and all sorts of other great goodies. So please check that out and don't forget to share, to subscribe, and also to leave a review wherever it is that you listen to podcasts."}
{"episode_id":"SW - #049 - 2019-08-14 - The Lord of the Rings - Symbolism of the Ring of Power","start":64.81,"end":67.53,"speaker":"Jonathan Pageau","text":"I hear that that's extremely helpful in."}
{"episode_id":"SW - #049 - 2019-08-14 - The Lord of the Rings - Symbolism of the Ring of Power","start":67.53,"end":71.77,"speaker":"Jonathan Pageau","text":"Getting us out there. So hope you enjoy my discussion on the Lord of the Rings."}
{"episode_id":"SW - #049 - 2019-08-14 - The Lord of the Rings - Symbolism of the Ring of Power","start":85.21,"end":88.65,"speaker":"Jonathan Pageau","text":"This is Jonathan Pageau. Welcome to the Symbolic."}
{"episode_id":"SW - #049 - 2019-08-14 - The Lord of the Rings - Symbolism of the Ring of Power","start":99.19,"end":1239.15,"speaker":"Jonathan Pageau","text":"Tolkien's ring in the Lord of the Rings is like an inverted Holy Grail, the object of everyone's desire, though not for the personal challenge it offers and for the spiritual enlightenment it procures, but rather for the raw power which it contains and which it gives to its wearer. In ancient myth and in storytelling, we find other such rings. The Ring of Gyges in Plato's Republic, whose capacity to render invisible entices Gyges to give in to his raw desire for power by using the ring to usurp the king. In Arthurian legend, Sir Gawayne is given a an invisibility ring, and then we also find Sir Percival, who receives a ring that makes him invulnerable. There is also the Ring of the Nibelung in Wagner's opera, which is based on ancient Nordic legend, in which an evil ring becomes the focus of desire and the cause of a downfall. Tolkien, in his version of the magic ring, intuitively binds together all these previous elements, because if in the Hobbit we discover only a ring of invisibility, in the Lord of the Rings, it takes on an almost cosmic function as the focus of all power and desire. The Dark Lord Sauron has forged the ring, as it is said, three rings for the Elven Kings under the sky Seven for the dwarf lords in their halls of stone. Nine for mortal men doomed to die. We see in these three lines the setup of a hierarchy which follows the hierarchy set up in Middle Earth. You know, we see three rings for the near God like being the elves under the sky that are qualified as kings. Four for the dwarves who are described as lords inhabiting their halls. And the most nine for men who are characterized only by their mortality and are last in this hierarchy. They are destined to inherit the earth when the other races leave or dwindle. But the One Ring is for the Dark Lord on his dark throne in the land of Mordor, where the shadows lie. And so the hierarchy of the ring becomes a hierarchy of dark power which places the Dark Lord at its head. And the rings given to the people become subject and bound in their power to the owner of the One Ring. This binding appears in the very shape of the ring as a band, a circle, which marks the and surrounds the wearer with its power. The notion that a ring is a form of binding to oneself is something we can still understand today, as this is the purpose of placing a wedding band around our spouse. It binds them to us just like it bound the owners of the multiple rings to Sauron, who had made and given them the rings. Because we tend to think of magic as something only for the fantasy realm, we often neglect to understand what magic means. And so stories with magic and enchanted objects can appear only as a form of whimsical entertainment. Rather, such stories can contain much wisdom about human activity. We can understand stories about magic in the same manner we can understand stories about technology, about personal or political power, simply about the development of some means to affect the world around us. We also are used to think of technology and magic as being opposites to each other. But rather in understanding how they have the same form function, we might be able to access more profound truths about them. You see, both technology and magic, just like other forms of increasing our power, follow the process that we could call a process of supplement. The supplement is simply adding to ourselves, adding to ourselves what we could call tools in order to to make us more capable of protecting ourselves, but also of affecting the world we live in. Writing itself is part of this civilization. But think of anything. Think of medicine, transportation, a house, a cell phone, a weapon, or else an amulet, a spell, a potion. All examples of things we add like layers to our nakedness to make us more powerful. The primordial technology is clothing for its immediate imagery of covering to protect one from the outside world. This is of course, the first technology which appears in the Bible. But technology in its most developed form is often characterized as, mythologically in the stories, as forging of metal. In the Bible, it is Tubal Cain who forges the first weapons of war. He is a descendant of the murderer Cain, who had founded the first city after being ejected from the presence of God. In Greek and Roman mythology, it was the God Hephaestus, or Vulcan, who forged weapons. He was a deformed God with a lame foot who had been tossed from Mount Olympus, the Mountain of the Gods. We can see that in both those stories, the development of technology is a paradox. Like any tool, it both makes us more powerful while also covering a weakness, and also making us dependent on its power. Think ultimately of the famous story of Icarus, who, having forged artificial wings, is now in danger of falling to his death, which he does after flying too close to the sun, something he could not have done without the very power that those wings gave him. Part of the paradox of technology is how it is an increase in one's capacity, an answer to a problem, and in that sense it is related to light, to glory. Think of how intuitively right is a lightsaber, or how power in so many movies is represented as light emanating from a person. But because technology, and the supplement in general is an adding of layers, and because it is linked to materiality, it can also hide, obfuscate what it is protecting by the very act of protecting. In this way, it is also a form of darkening. And so the mine, the cave and the underground fire participates in this imagery. In the movie version of the Lord of the Rings developed by Peter Jackson, this dark element of technology is portrayed very well as we. These weapons and armors are shown being forged in the caves of Isengard, and how this recalls the God Vulcan forging metal from his own underground world. Medicine is also a form of supplement, like the taking of magic potions or treatments which participate in the paradox that I've mentioned. This paradox of technology, medicine both makes us stronger, facing our own mortality, but also it makes us weaker for being, you know, for becoming dependent on the power which this medicine offers. The ring of power, making one live unnaturally long, can easily be understood analogically by how today we have created all kinds of drugs, machines, respirators and other strange contraptions which can maintain one artificially alive. We can't deny this, of course, can be of great use to people who are in a difficult situation, though we also know that it can go too far and it can keep someone indefinitely alive in a state that is not fully human. And so, when looking at the Ring of Power, through this frame, we can see that it unites many of the elements already mentioned. It is forged, it is metal, it is a type of clothing, a type of medicine, a weapon. But even looking at its shape, how it presents itself to us, it is simply a round band, a layer added to a finger. And by this aspect, it becomes a condensed version of the periphery itself, the limit. The wheel around an axis, the wall around a city, or the magic circle of protection. All these images relate to the Ring of Power. We're told in lore that the Lord Sauron put his own power into the ring, making himself stronger by binding his power into this forged object. But as I've explained, like all supplement, like all tools, this strategy also made him weaker, dependent on the ring. And so, when the Ring was lost, his power to affect the world was drastically diminished. We do not, of course, have to understand this process of supplement only in relation to magic or to technology. I've mentioned before about that the supplement can be seen as anything which we add to our nature, anything which increases our capacity to act in the world. The Ring could be an army which a king adds to himself. The king binds his power into the army in order to conquer and protect. But if the king loses his army, then his power to affect the world is also lost, and he actually becomes even more vulnerable than he was before. This is, of course, why Sauron in the story loses his body, because he loses the ring. For this dependence on the outer world, on materiality, for power, is akin to our depending on our own bodies. For affecting the world in physical terms, the supplement is ultimately an increase of body. In order to fully understand the question of supplement, it might be useful to contrast this type of influence by raw power to how someone will pray, worship, or meditate in order to increase one's inner strength, or else even in affecting the outer world. Contrast the power of the Ring to how a teacher or a wise man affects the world only by words and ideas. Even if that wise person is killed, his or her ideas can continue to live and to be transmitted. They can continue to transform the world for millennia after the tyrant's weapons and army are long gone. The Ring of Power is not only a tool, but not only akin to a covering or to clothing, but ultimately, the ring is an ornament. Now, the symbolism of the ornament participates in some of the most difficult and the most mysterious aspects of reality. But if we do want to Understand why the ring makes one invisible. It seems important to at least touch a little bit on the strange symbolism of of ornamentation. You see, an ornament is the ultimate supplement. An ornament is something which we add to a person or to an object, but plays no practical purpose in what it ornaments. It is an alien form, foreign to the nature of where it is. Surrounding myself by a metal chariot like a car, supplements my capacity to travel directly. But putting a pattern of flowers on a chair has nothing to do with the act of sitting. It is completely alien to the chair. Nature of the chair. Just like an ornament on a sword would be alien to the sword nature of the sword. The ornament is only added to make the chair stand out from other chairs, the sword stand out from other swords. How would I know which chair is the king's throne? And not just any other chair. It is usually through a form of mark, a form of ornamentation. So, like technology, the ornament can be a way of increasing one's influence, increasing one's power, marking how special one is. Think, for example, of a medal on a champion or a war hero. Think of a badge on a military uniform or on a police officer in Rome wearing an ornamental purple band on one's vestment was only permitted to aristocracy. And similar laws can be found in other cultures as well. Of course, the ultimate example of the ornament is. Is the king's crown. But we can talk about that maybe in another video. The mystery in the ornament has to do with the problem of showing and hiding. Imagine you get a tattoo to attract attention, to differentiate yourself. Imagine you put on makeup to enhance your natural beauty. It is there to increase your glow, let's call it to increase your glory. But this is artificial to an extent. Yes, we want to feature, to attract attention to something. But like an insecure man with a very expensive sports car, at some point the question becomes whether you are overcompensating for something that is lacking. So the situation is also a paradox. It can in fact make something special. But if you push the ornament too far. Well, think, for example, of how we carve vines into ornamental patterns on architectural details. A vine can be beautiful, but a vine is also a parasite. And if it takes over, it begins to hide rather than show. At one point does one vanish behind one's tattoos? At what point does makeup cease to be an enhancement of beauty and become a way to hide our own ugliness? When does ornament become a mask? You See, this is the process by which the ornament, pushed to its extreme, can at some point make one disappear. The inverted hierarchy in the Lord of the Rings. Just like an aging woman can let herself become a slave to her makeup, the dependence on the rings forged by Sauron becomes a kind of slavery for those who are willing to take advantage of the power they offer. We see this most strongly, of course, in the Ringwraiths and in Golem. But for us today, in the world of smartphones, this should not seem like such a mystery. By relying too much on our capacity to increase our power by tools, by supplements, technology, weapons, we create that inverted hierarchy, because the tools we create always both make us stronger and weaker at the same time. We are constantly in danger of becoming dependent, becoming the subjects of that which is meant to serve us, whether it is the state, money, power, technology, or whether it is more immediately the gratifications of our bodily desires, like our desire for food or for sex, desires which are there to keep us alive. That is the constant paradox of all human endeavors and the lesson we learn from stories about magic. This paradox shows itself even more clearly in the modern age, where many of us who have often believed and advocated for all the development of science and technology, thought that it would bring a kind of moral, perfect moral world, a moral hierarchy. But as we see our very tools slip from our grasps, as we find ourselves more and more dependent on our system, our computers, our gadgets, we discover ourselves to be on what seems like an unstoppable binding of our power in these tools that we have created. And as we stand on the verge of the artificial intelligence singularity, we notice that we have most probably already given our will and power to this dark lord for having been seduced by the power of the ring. It is possible that many of us have already become Ringwraiths."}
{"episode_id":"SW - #049 - 2019-08-14 - The Lord of the Rings - Symbolism of the Ring of Power","start":1240.43,"end":1275.81,"speaker":"Jonathan Pageau","text":"Thank you for listening to the Symbolic World podcast. As you know, this podcast is, for now based mostly on my YouTube videos, which I am transferring into audio format. Please go ahead and visit my YouTube channel. There are more videos there on different subjects that I'm not going to put into audio. And please share this to your friends. I know a lot of people know about the YouTube content, but not so many people know that this is also a podcast. So share it to your friends, share it on social media, and if you can, feel free to support this financially as well by going to my Patreon page, which is Peugeot Videos, strangely, you."}
{"episode_id":"SW - #049 - 2019-08-14 - The Lord of the Rings - Symbolism of the Ring of Power","start":1275.81,"end":1276.97,"speaker":"Jonathan Pageau","text":"Can go there and you can support."}
{"episode_id":"SW - #049 - 2019-08-14 - The Lord of the Rings - Symbolism of the Ring of Power","start":1276.97,"end":1296.33,"speaker":"Jonathan Pageau","text":"It at any amount that you want. A month for all the patrons. I do a monthly Q and A live Q and A in which people can ask questions in the chat, and I try to have a more personal connection with people. The YouTube comments have become difficult to follow and to answer. I'll see you soon."}
