{"episode_id":"SW - #337 - 2024-04-25 - How to Survive the End of a World - A Parable of Christ","start":0.08,"end":923.53,"speaker":"Jonathan Pageau","text":"That what Christ is describing is the manner in which you change worlds. When a world is ending, the way to move into a new world is to take the strength of the world that is ending and seed it into the next world so that when this world ends, you find a place in the next world. You know, if you look at it morally, it's very difficult, but if you look at it in terms of just it is how a world ends and how another begins, you can understand how that's the type of shrewd behavior that you would want to do. This is Jonathan Pedro. Welcome to the symbolic world. There's one parable of Jesus, the one we call the unjust steward, which for many people and for myself is a source of great pain because it is very difficult to understand. And no matter what interpretation I see, whether it's from the church fathers or from modern theologian, I always end unsatisfied with their interpretation. As you know, I have just finished an entire week with Jordan Peterson and the same crew from Exodus, adding a few people like John Vervaeke, Bishop Barron, and also Constantine Kissen, who joined us, we did a week long, 10 episode interpretation of the Gospels. It was crazy, it was amazing. But again, we hit that parable, which is a very difficult one. But as we were discussing and as we were thinking about it and I was hitting my head against it, even during the recording, I think it hit me. I think I understood it more than I have before now. Maybe it's not enough, but I'm hoping to take you through my insights about this parable so that hopefully you can understand. Before we start, it's important to say, if you love what I'm doing, please go to the symbolicworld.com and there are ways to support what I'm doing. Your support is very helpful in making sure that we can put out these podcasts and that I can continue to do the things that I do, to travel, to write, to do all the things that I need to do. And so thanks everybody for your support. All right, and so the parable of the unjust steward is in the Gospel of Luke, chapter 16. And it goes like this. Jesus told his disciples, there was a rich man whose manager was accused of wasting his possessions. So he called him in and asked him, what is this I hear about you give an account of your management because you cannot be manager any longer. The manager said to himself, what shall I do now? My master is taking away my job. I'm not strong enough to dig and I'm ashamed to beg. I know what I'll do so that when I lose my job here, people will welcome me into their houses. So he called in each one of his master's debtors. He asked the first, how much do you owe my master? 900 gallons of olive oil, he replied. The manager told him, take your bill, sit down quickly and make it 450. Then he asked the second, and how much do you owe? A thousand bushels of wheat, he replied. He told him, take your bill and make it 800. The master commended the dishonest manager because he had acted shrewdly. For the people of this world are more shrewd in dealing with their own kind than are the people of the light. I tell you, use worldly wealth to gain friends for yourselves so that when it is gone, you will be welcomed into eternal dwellings. So what is going on with that parable? You know, on the one hand, you think, okay, it has to do with him, you know, doing good in order to compensate for what he's done. But then he's doing good by giving the master's money. Does it mean that he's giving his share of that money? At least the parable doesn't say so. And also, if that was the case, then why would it say to use worldly wealth to gain friends for yourself? There's also a version where it says, you know, make friends with mammon. You know, make friends with dishonest wealth so that when it's gone, you'll be welcome into eternal dwellings. It's a very strange and suspicious thing. But when I was thinking about it during the seminar, I think it hit me. I think at least I saw the applicability of this parable. And this will bother some people because the only way I can see it as being applicable is something like an amoral frame. It's hard to look at it with morality and understand it. But as I've said before, I think Jesus, that Christ, is not just representing moral principles, although he is. He's especially representing the way the world works. That is, he's representing an image of reality, of how identities function, of how unity and multiplicity come together. And so I think this is what he's dealing with. Now, the way that I came to understand it was because I think there's an example of what Jesus is talking about in the Old Testament. And that example is in the story of the two spies that go to Jericho. Now think about it. The story of the two spies in Jericho. When the two spies go to Jericho, they stay with a prostitute named Rahab. Now, this Prostitute lives in the wall of the city. And it's important to understand these two aspects of her, because on the one hand, she lives in the wall of the city, which means she's on the margin, you know, quite literally on the margin. And she also is a prostitute and therefore has very little stake in the identity of the nation. Right? That is, in. That's what the prostitute is. You know, a prostitute is someone who is, let's say, connected to multiple people and doesn't have one identity, one husband. You know, let's say the origin of her children is not known. And so she is someone who doesn't have a stake in the identity of the city. And so what she does is that as she discovers that the city is about to be destroyed, she basically gives her house, gives her home over to the strangers, and not only the strangers, but the strangers that will destroy the city. And so she takes, you could say, the wealth of the city or the value of the city, and she hands it over to these two spies that are going to come and destroy it. And so when the two spies finally, and the army of Israel comes in and they turn around the city and the city is destroyed, the only person that survives and the only family that survives is Rahab. And her family, you know, and even, you know, we have this image that is the only part of the wall that is not destroyed, is the place where Rahab lived in the wall. And she leaves this red thread which, you know, comes out of her window out into the outside. So I think that this red thread which moves from the inside to the outside is what this parable is talking about, which is that what Christ is describing is the manner in which you change worlds, which is the manner in which, when a world is ending, the way to move into a new world is to take the strength of the world that is ending and seed it into the next world, so that when this world ends, you find a place in the next world. This is exactly what Rahab is doing. She's betraying her country. I've thought about this for a long time in terms of Rahab, because I always try to read the Gospel stories from both sides of with through the lens of all the characters. And when you read it from the point of view of the people of Jericho, Rahab is a traitor. Rahab betrays her nation to the two spies, and when they take over, she's able to survive and find a home. And there even Jewish traditions and kind of secondary traditions that say that Rahab married Joshua, that she was Joshua's wife, which is pretty fascinating. And so, you know, if you look at it morally, it's very difficult. But if you look at it in terms of just. It is how a world ends and how another begins, you can understand how that's the type of shrewd behavior that you would want to do if you were facing a situation like that, which is, I don't know, you know, imagine just someone who's about to lose their job, just similar to the manager, Even if they're not dishonest, someone who's about to lose their job is going to take their time in that work, you know, or if they're noticing that the company is about to be destroyed, they're going to take their time and that work in order to make friends with people from another company, in order to be able to change worlds. Once that happens, now, that is a moral version of it. But you can imagine someone in a much shrewder way, you know, someone who uses the knowledge that they learned at one company in order to find place in another. We see that all the time in tech companies, which is that the things that you've learned in one company, the knowledge that you've acquired and the technology you've developed, that's pretty valuable if you have to switch camps and you have to go into another in another camp. And so that seems to be what it is that Christ is describing. The ultimate version of that, I think. And in some ways, the strangely, the most moral version of that, I think, has to do with the manner in which Christianity moved from Israel and moved from Jerusalem to Rome. And what's wonderful about this version of it is that it actually is not amoral. It's actually quite moral, which is that even if the Christians didn't totally understand the warnings that Jesus was giving about the daughters of Jerusalem, and he has these prophecies that he gives to Jerusalem to say, watch out, because one day you will run out into the hills and you would rather die than go through what's about to happen. He was predicting the destruction of Jerusalem. But the manner in which the Christians acted, which is the fact that they went out and seeded the word of God, seeded the traditions, even of Israel, recapitulated in Christ into this new seed. They seeded that out into the external world, especially in the Roman world. The fact that they also were not revolutionaries, that they helped the poor, that they took in the orphans, that they did all these things in order to kind of make friends in the other world, then once Jerusalem was destroyed, then that place became their Home for all intents and purposes, even though they still were persecuted, but it became the new soil into which they grew. And the old world, which is the world of Israel, is now seeded into Rome. So that seems to be the. The most powerful version of what this, this parable is talking about. And, you know, in a way, in a manner that is not related to an amoral version of it, you know, and so then you can then apply it. Once you see that when it's like, okay, well, that's what it's talking about. It's talking about the idea that if you're going to change worlds, you should seed into the next world in order for once this world to crumble, then you move into the next one. You take the strength of this world, you take the power of this world, you take even the value of this world, and you start to aim it towards the next world. That now we can understand why Jesus is talking about this in terms of the idea of eternal dwellings or the idea of the end of all things and the new world in the sense of the. The kingdom of heaven or the kingdom of God, which is that he's saying, look at how shrewd people are acting with money, even willing to take the money of the Master in order to seed into the next world. Well, you could say that about now, yourself. Now, if you think about your own soul, which is to take your strength, to take your energy, to take your intentions and to see them into the next world, to invest in the kingdom of heaven, you know, even if it means the loss of your energy here. So you can imagine the martyrs. That's exactly what they've done. They've basically taken the strength of their life and be willing to completely lose it in order to seed it into the next world. That seems to be what is going on in terms of the. In terms of the story. And so I think that once you think about it this way, understanding that the story of Rahab is actually an application of this parable into our lives, although it seems shocking at first, and you can find examples that are quite dark and that include betraying your nation, you can also see that the highest version of it, right, the most redemptive version of it does not need to be so dark and represents both the way that Christians spread the seed out into the outer world and were able to gather the fish outside, and we're able to have trees grow in Rome, in Armenia and Ethiopia, and all the places where Christianity sprouted up. But also it's a good understanding of how sacrificing your own strength and your own life and your own intentions today is ultimately seeding into the kingdom of heaven. And so I hope this was useful and I hope that it at least opening your mind to a different way or a little further in the understanding of this very strange parable. So thank you for your time. Thanks again everybody for your support, and we'll talk to you very soon. Sam."}
