{"episode_id":"SW - #098 - 2020-04-25 - Did Asterix Comics Predict the Coronavirus Epidemic in 2017 -","start":0.96,"end":650.12,"speaker":"Jonathan Pageau","text":"As we plunge further and further into this pandemic, some people have noticed that a comic book in 2017 published by Belgian authors called Asterix and the Chariot Race has a strange character in it called Coronavirus. It has left a lot of people perplexed, wondering what this could mean, if it means anything. And so I want to look at Asterix comics in general, and this one in particular, to see how this actually makes total sense. That it's in this comic book that we would have seen a strange prophecy of what is happening today. This is Jonathan Peugeot. Welcome to the symbolic world. Now, Asterix is one of the most famous European comic books. A lot of people are not aware of that in the United States because Americans don't interact much with other cultures. But when I was young, as a French speaking French Canadian, I read Asterix comics all the time. And what's interesting in Asterix comics is that it is really about what is happening today. There is a lot of stuff in there which is dealing with the problem of Europe, for example, the problem of globalism. Because the story of Asterix is about a Gaul 50 years before Christ, in the time when Julius Caesar was expanding the Roman. The beginning of the Roman Empire and he's taken over Gaul. But there is one village in Gaul that is resisting and it is Asterix's village. Most of the stories revolve around how these Gaul village resist the Roman power, how they're fighting the Romans, how the Romans tried to take them over through different strategies, through infiltration, through all, through giving them a lot of money, you know, giving them a lot of financial opportunities, all kinds of strategies and that they will find in order to finally invade this Gaul village. But the village has a secret potion which is made by a druid, which gives them invulnerability and therefore helps them to resist the Roman Empire. Now of course, we can understand that the whole comic book is about identity and the problem of identity and the problem of a system, a government which would try to include everything and not leave room for an exception, not leave room also for other smaller identities to exist within the within in relationship to the bigger one. To at least have all those identities be included in the big empire rather than have it on the outside. And so the Gauls are like a little, are like an annoyance to Julius Caesar. He's always annoyed to think about the fact that he was not able to take over all of Gaul. There is this remainder on the side which continues to bother him. So he always wants to Include all of it. Now you can see how it can be related to questions of identity in general, questions of borders, questions of exceptions, question also of marginal identities within the empire. All of these ideas are floating around. National identities as well are being dealt with in the story of Asterix. But in this particular comic, what we have is because the Roman Empire, the comic, to be honest, is not particularly good. The story is rather mediocre. But the tenets of the story are interesting to think about in terms of what is happening to us today. And so in the Roman Senate, they realize that there is a deficiency in Rome, that the Roman roads are full of, of potholes and that the Roman roads are. Need to be repaired. And the person who's responsible for that is decadent and is, you know, is always going to orgies and is not, and is not doing his job. And in order to kind of mask that or to, to look over, so that people look over his deficiency, he calls upon having a trans Italic race, a race across all of Italy in which all peoples can be involved. And this will prove the superiority of the Roman roads because they're going to have the race on the Roman roads. But not only that, they also want a Roman to win this race so that Rome is glorified as the race is happening. And so the person who is wearing, who is going to run for the Romans is wearing a mask, a golden mask with a smile on it. And his name is Coronavirus. And his assistant on the chariot is Bacillus, which is also a bacteria that, you know, it's a form of bacteria. And so you have this virus and this bacteria as the Roman race. And the person, the character hidden behind the mask, you know, is the Roman soldier. So we don't know who it is. Now the whole thing takes on all kinds of, you know, all kinds of turns and twists and turns that aren't particularly that interesting. But one of the interesting aspects is that in the race you have all these different cultures. You have these two women from the kingdom of Kush who are kind of Ethiopian African looking. And then you have different peoples of Europe, Egyptians and, you know, Phoenicians and the Goths and all these, and the Russians are there as well. You have all these different, these different nationalities who are racing against Coronavirus. And secretly you find out that Coronavirus is actually cheating. The reason why he's winning is because every day they swap the horses and they give them new horses. And so Coronavirus is winning. And so in order to stop them, to stop coronavirus, they have to band together. All these different peoples have to band together in order to fight the coronavirus. So what's interesting the story, like I said, it's not that particularly interesting, but what I want to point attention to is the elements of the story and how all the elements of the story, even though the story plays out one way or another, are the elements of the situation we're dealing with today. When the story ends, we find out that through all kinds of twists and turns, we find out that hiding behind the coronavirus mask is Julius Caesar and that he is the one, in fact, who is trying to finish the race. And he is not able to finish the race because he falls into a pothole and the Gauls win. But in the end, Julius Caesar, for some reason, is happy and he gives the trophy to the Gauls, who then give it to another tribe, and they give to another tribe and they pass the trophy down from tribe to tribe, and in the end, everybody's happy. Diversity and unity, all that stuff that we, that, that people are talking about today. But what's interesting to look at is a few elements. One is the problem of all these different identities who are participating in this race against the coronavirus. The other thing is that hiding behind the coronavirus is the global empire, which is trying to show its glory and which is trying to compensate for. For the potholes which have appeared in its structure and is therefore trying to compensate for that by winning this race. And so, like I said, it's just very fascinating to see how all the elements are there and how even without talking about whose intention, what intention lies behind this epidemic, we can still see the players move and we can still see how the problem of the epidemic of the coronavirus is an opportunity for different things to play out. One of the possibilities of how things are going to play out is going to be in the return to borders and the, the reaffirmation of identities at all levels of reality. From national identities, by closing borders, even closing borders between states in the United States, we're seeing that happen. Closing borders between cities and rural areas. All of these, this closing of borders can end up with a more. A reality which emphasizes identities at different levels. But it is also possible that because of this epidemic, there will be a, a clampdown of power from above and, you know, and a desire to install mechanisms of control the likes of which we have never seen before. And so we need to be attentive to that, as you will see. I will probably be putting out another video about this very soon, about the question of the question of identity and exchange in this. In the problem of the epidemic. And so stay tuned to that. I will be trying to put out videos at least once a week for the next few weeks to deal with some of the issues that are happening. And so thanks everybody for your support and I will see you very soon. I hope you enjoyed this episode of the Symbolic World. The Symbolic World is edited by Justin Ward and it is based on a series of videos that you can find on my YouTube channel, Jonathan Pageau's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course leaving a review on itunes. Everybody knows that's the best way to get the podcast out there to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon Pajot Videos as well and on SubscribeStar, all those links you can find on my website or in the show description. So thank you and I will see you soon."}
