{"episode_id":"SW - #191 - 2021-10-30 - Gauthier Pierozak - The Lost Symbolism Archives","start":0.4,"end":104.07,"speaker":"Jonathan Pageau","text":"So hello everybody. I am here with Gaultier. Pierozac Gaultier is a lover of symbolism, you know, very fascinating person in himself. And he went on a very. A really exciting journey to dive into and discover the works of Louis Charbonneau Lassey. Many people don't of you might not know about him. He was an early 20th century symbolist, very important, influential. But because of the war and because of many things that were happening around him, some of his work got lost and some of it got forgotten. There is an English version of his main work that we know about, which is the Bestiary of Christ, a highly edited version. His French version is quite longer and more is fuller. And Gaultier is now involved in a new publication called the Vulnerary of Christ, in which this is Chaboneau's work on the symbolism of the five wounds of Christ and just how universal they are and how extended that language kind of becomes in Christianity. And so it's a very. It's a very fascinating book to be published right now, a very important one. And so I'm really looking forward to diving into his discovery of Charbonneau and also. And also the work itself. This is Jonathan Pepper. Welcome to the Symbolic world. And so, Gaultier, maybe you can start off very simply and tell us how you became interested in the work of Luchabonau Lassey."}
{"episode_id":"SW - #191 - 2021-10-30 - Gauthier Pierozak - The Lost Symbolism Archives","start":104.63,"end":446.65,"speaker":"Gaultier Pierozac","text":"Yes. Thanks for inviting me to your podcast. I. I've been very interested in symbolism and Christian symbolism in particular since I was very young. I was introduced to this through the fact that I lived in France. I lived in a little tiny village with a church that was over a thousand years old, and there were symbols engraved on the outside of the church. And of course, it started my curiosity and I kept, you know, there's a lot of people who were along the way who advised me to read which book and that book. And over the years I was becoming more interested in the bigger aspect of symbolism. It's not just limited to Christianity, it's just the way I'm looking at is a language based on intuition. You use symbolism when you cannot express with words some concepts that are just divine or. And the best example, and I'm going to bring that back later, is the concept of infinity. Our brain cannot comprehend infinity. We can get close to it, we can use with words we can try to explain, but we cannot define it. I think symbolism allows you to go a step above with communication of this concept. And I'm sure you understand the. There's patterns surrounding us that. That cannot be explained. But we can feel them intuitively. So that was my approach. I also have kind of a specialty. My brain sees in colors. I see letters in colors, I see depth when I listen to music. So I realized after a while, I think it's a known condition that I have already in my brain. A wire that bypasses language. And so that's why I really appreciate symbolism. So in the process I was reading Rene Guinon. He's a perennialist in France and found out that he was involved with a Christian publication in the early mid-1920s called Regnabitt. Regnabitt was periodical monthly where it was dedicated to the Sacred Heart of Jesus. Everything about it from doctrines, symbol, art, philosophy, poetry, anything. And within this periodical was a gentleman named Louis Charbonneau Lasse that started engraving for the periodical. He was doing the wooden engravings and they would print these symbols or these representations. That's how he started participating in 1921, I believe it was after a while he started writing articles about some of his findings. So what's very interesting is that Louis Charbonneau Lassier was born in 1871. So he's a 19th century, kind of old school gentleman. He joined early. I think he was 11 years old when he joined Christian school. He stayed there constantly and wanted to become a priest. And he. He just became a teacher in that school, started trying to become a priest. And in 1903, a law in France just separated church from the state officially. And the congregation he was part of was disappeared, simply disappeared. So he ended up being back into the secular life, if you want. And at that time, and it is so interesting how little details can change some people's lives. One of his teachers at the congregation he was part of was also an archaeologist or maybe early at that time, they were kind of digging around and finding stuff they didn't expect. They would dig under old stones, you know, standing stones, and would find skeletons and a lot of old artifacts. And it became very interested in this. I have some old writing of his where in the early 1900s he was actually exploring underground caves where people during the past wars, religious wars and all that, they were hiding and they would leave artifacts behind. So it's an interesting aspect because he became an archaeologist, which is a scientist, while being truly a Christian, true Christian, and by the way, a Catholic, but very interested in all sorts of symbolism. So he found on his own all these artifacts. He started questioning why he was finding there was really a lot of representation of Christ through animals, through all sorts of symbols. And that's what the Bestiary of Christ is. It's really interesting. So fast forward in the 1920s, he became part of that periodical Regnabit, and he started using his finding archeological findings to write about the symbolism of Christian artifacts. So he would talk about the lion, he would talk about the bull, and he would also explore. And that's the interesting part for the venerary, all the symbolism of the Heart of Jesus. And his biggest mystery for him is how come I'm finding artifacts that are hundreds of years they were showing the Heart of Jesus, even though the doctrine of the Sacred Heart only appeared in the 17th century. So that's where his own quest started there. And it took us. And we'll talk about it if you want. Very deep in this book."}
{"episode_id":"SW - #191 - 2021-10-30 - Gauthier Pierozak - The Lost Symbolism Archives","start":446.81,"end":492.91,"speaker":"Jonathan Pageau","text":"Yeah. And so he was working in collaboration even until, I guess, the end of. I don't know who passed away first, but until the end of their lives, he worked in collaboration with Guinot in this kind of rediscovery of symbolism. And this is what kind of led to the Bessieri. And so he really is a. I would say one of the. He was one of the key figures in the sense that there was a lot of symbolism thinking happening obviously at the end of the 19th and early 20th century, but a lot of it was in the stranger world, the world of the kind of esoteric world, in the world of geosophy and all of these kinds of worlds. But Shaban Alasse really wanted to frame his understanding of symbolism within his Catholicism and Christianity."}
{"episode_id":"SW - #191 - 2021-10-30 - Gauthier Pierozak - The Lost Symbolism Archives","start":492.91,"end":579.21,"speaker":"Gaultier Pierozac","text":"Yeah, yeah, I call that. He was an orthodox Catholic. He was very, very careful not to steer into occultism, esoterism and all that. However, him and Geno became really good friends. So as I mentioned, through different people who knew each other, they were introduced and Charbonneau and Guenau met. Guenau went to his house in Loudun and saw all his artifacts and in fact, what you see through their correspondence until the. From 1924 to 1946, when Charbonneau died, before Guenaud Guinon was helping Charbonneau by providing findings of his about Christian symbolism. He would give him everything. He would even support the publication of the Bestiary of Christ, even though Guenau at that time was a Muslim. He would give everything to Charbonneau because he thought that was an extraordinary project. In fact, he was asking Charbonneau for his opinion on Christian symbolism. And Charbonneau would ask Geno for other traditions interpretation, because one symbol can be interpreted many ways, depending on the context. So it was an interesting collaboration of respect. However, they would keep their ground separate. Yeah, separate."}
{"episode_id":"SW - #191 - 2021-10-30 - Gauthier Pierozak - The Lost Symbolism Archives","start":579.21,"end":603.32,"speaker":"Jonathan Pageau","text":"Because Chabano, even though, you know, talking about Guinot, even though he is clearly Catholic and orthodox, he's also not afraid to point to the places where these similar structures appear in other cultures. He's not also kind of a. He's not close minded and focused only on his thing, but really sees through the Christian lens, even some symbolism coming from ancient pagan cultures or from other cultures as well."}
{"episode_id":"SW - #191 - 2021-10-30 - Gauthier Pierozak - The Lost Symbolism Archives","start":603.4,"end":621.48,"speaker":"Gaultier Pierozac","text":"Yeah. And I think that came from his archeology background, but also from Geno. I have actually, we'll talk about this later, but I have, you know, all these archives that Charbonneau left behind and there is hundreds of notes of when he met with Geno and they talked about this subject or another. It was fascinating."}
{"episode_id":"SW - #191 - 2021-10-30 - Gauthier Pierozak - The Lost Symbolism Archives","start":622.76,"end":630.9,"speaker":"Jonathan Pageau","text":"This is the Indiana Jones now part of the story. So tell us what happened to his work and also your part in rediscovering it."}
{"episode_id":"SW - #191 - 2021-10-30 - Gauthier Pierozak - The Lost Symbolism Archives","start":631.22,"end":693.67,"speaker":"Gaultier Pierozac","text":"Yeah. So you asked me earlier and I never answer how I found out about Charbonneau. So I was reading Guenon and I was talking to some friends of mine who said, hey, you should buy the Bestiary of Christ. So that was mid-90s. And so I did purchase the Bestiary of Christ and found it fascinating. I read it from beginning to end even though it looks like kind of a dictionary. Almost every, every animal is. Is. Is listed with a symbol and based on. But I read it as a whole and I came out of this book with a very strange feeling. And I don't know how the English version is. It's been shortened. Yeah, that's a project. Yeah, there's a project of doing a new version. I'll be involved as well. We're going to translate the whole thing. But after I finished reading the book, I was. I had a kind of a. An experience of suddenly I was looking outside and I love being in the woods and all that and everything. Suddenly I realized everything could symbolize Christ. The grand, not just the man, but."}
{"episode_id":"SW - #191 - 2021-10-30 - Gauthier Pierozak - The Lost Symbolism Archives","start":693.67,"end":697.07,"speaker":"Jonathan Pageau","text":"The God of nature. Yeah, it was me, basically."}
{"episode_id":"SW - #191 - 2021-10-30 - Gauthier Pierozak - The Lost Symbolism Archives","start":697.15,"end":991.68,"speaker":"Gaultier Pierozac","text":"That's right. So he started with the animals and it just blew my mind and I wanted to know more. So that's when I started doing some. My own research. I had some access to Geno's letters that an Italian scholar, Pierluigi Zocatelli, had published. He published a few books. So I contacted this gentleman and we became friends. And that's how I learned through him and that Charbonneau had planned to write other books. The bestier Was one of several. He was going to write another book about the symbolism of the plants and vegetables that represent Christ in any way possible. And then third book about minerals. But that's not it. What I found out through the archives. He was going to write books about other items. They were anything liturgic objects, planets and stars. It was anything that could exist which represent Christ. And that's kind of an interesting approach to. Instead of apophotism, when you cannot express God without talking negatively about him. He took another approach. Was the infinity of God is expressed to the infinity of all. The manifestation of everything on earth and the universe. I thought it was fascinating. I've never seen that before. And that's. That's been my passion. So I was wondering, and that's where it was interesting, what happened to those archives? So I was actually walking at that time, it was early 2010, with the Guenon family. I was gathering all the writing of Geno and all his letters because I was just curious. And in the process they shared with me some letters they had of Chabon Lassier that were kept in Cairo in Egypt, where Guinon finished his life. And they shared those letters with me so I could. I had them in my hand and I was reading the letters and I realized there was that book, the Venerator of Christ that he finished just before his death. He was very old. He was in late 70s. He was complaining to Geno that his eyes didn't work very well. The publishing company had lost a lot of his engravings. He had to redo 60 or 70 of those. It was fascinating. And he was telling the whole table of content of the book. And it was very interesting because what I found out is that that book had been stolen after his death. We don't know the condition. We don't know anything. But somebody came to the people who owned all the archives of Charbonneau and he borrowed the manuscript saying he was going to publish it. And he was never found again. Wow. Yeah. So what I did, I tracked those archives. I contacted the families. So they shared a lot of things with me. But they didn't have those archives. And this brings us to a very mysterious and kind of Indiana Jones story is that. I don't know if you know that, but there is somebody who helped Charbonneau with the symbolism of the Middle Age medieval symbolism of the Sacred Heart and all the symbols in the bestiary. One of Chabonot's mentor, he was a priest nearby named Theophil Barbo. And this gentleman was very old Shabbono was helping him, just like he was very helping him with his day to day, kind of. He couldn't write, so he would write for him. He was very old. And that gentleman Theophil Barbo shared with Shabbono that he was part of an organization of Christians called Etoile Internel. And that was kind of an organization of a few people, I'm not going to say a secret organization because that's really not fair, but kind of an organization of a few people who were carrying archives from the middle age. It was very strange. And they shared that information with Charbonneau so he could write about it. Because the content was in line with what Charbonneau was studying. The symbolism of animals, the symbolism of the Sacred Heart. So they gave him these old men, gave him their archives to study. And they also had carried through the middle age some kind of a knighthood ritual. It was called the Chevalier du Paraclet, the Knights of the Holy Spirit, if you want. Just some kind of a group of people like that would protect that knowledge. And they made Charbonneau. He transmitted to Charbonneau basically the right to make new knights. Yeah."}
{"episode_id":"SW - #191 - 2021-10-30 - Gauthier Pierozak - The Lost Symbolism Archives","start":991.68,"end":994.12,"speaker":"Jonathan Pageau","text":"So he was included. He was brought into this."}
{"episode_id":"SW - #191 - 2021-10-30 - Gauthier Pierozak - The Lost Symbolism Archives","start":994.28,"end":1026.98,"speaker":"Gaultier Pierozac","text":"Yes, yes. So after his death, he left all his archives to the few of those knights that still lived at the time. And they were, by the way, friends of Ronagheno. So he was a small group. Their goal, and I found out in the letter, was to use the archives to finish the work of Charbonneau. They're going to finish the book about the plants, the book about the minerals. But they didn't. The group died, everybody. It didn't survive. It just."}
{"episode_id":"SW - #191 - 2021-10-30 - Gauthier Pierozak - The Lost Symbolism Archives","start":1028.5,"end":1029.3,"speaker":"Jonathan Pageau","text":"Yeah, that's what I heard."}
{"episode_id":"SW - #191 - 2021-10-30 - Gauthier Pierozak - The Lost Symbolism Archives","start":1030.18,"end":1109.87,"speaker":"Gaultier Pierozac","text":"So those archives were still in the position of the last of those knights, I think is a friend of the last of the knights. After he died in 1999, sold those archives to publishers in Italy. It's just strange. Interestingly, the owner of those archives was the one published the Bestiary of Christ in the 80s or 70s. In the French version, there was a facsimile. His name was Laszlo Tot. He was the director of the Arcade editions and he's the one I've met. And first he showed them to me so I could consult. And he wants to. He was supporting me. He wanted me to help reconstitute the books because he was 80 years old when I met him. He passed. He passed away a few weeks ago. Yeah. And he. And in the end I negotiated. Hey, can I, can I own Them. Can I buy them from you? So we agreed on the price, but I could not afford that price. First. My wife didn't want me to spend money on that garbage and I respected that. So what I did is I say, well, what if I did a crowdfunding project?"}
{"episode_id":"SW - #191 - 2021-10-30 - Gauthier Pierozak - The Lost Symbolism Archives","start":1110.19,"end":1110.79,"speaker":"Jonathan Pageau","text":"Okay."}
{"episode_id":"SW - #191 - 2021-10-30 - Gauthier Pierozak - The Lost Symbolism Archives","start":1110.79,"end":1138.52,"speaker":"Gaultier Pierozac","text":"Where I ask all the traditionalists around the world to see if they wanted to help. And we did that. 2016, I started the crowdfunding project and in two weeks I had the money. Two weeks. So bought the archives, it was sent to me and now I have hundreds of folders and I'm going to share that with you. It's really. I'm going to show you a little bit. So for example, this one is about the Byzantium. Letimacy."}
{"episode_id":"SW - #191 - 2021-10-30 - Gauthier Pierozak - The Lost Symbolism Archives","start":1139.08,"end":1139.56,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #191 - 2021-10-30 - Gauthier Pierozak - The Lost Symbolism Archives","start":1140.52,"end":1153.47,"speaker":"Gaultier Pierozac","text":"Intimacy Byzantine. So it has his notes and it's at the back of letters. So you can see. I may have some. Rene Guerant. There's 100 of them. Then he talks about the contents and so it's plenty of notes."}
{"episode_id":"SW - #191 - 2021-10-30 - Gauthier Pierozak - The Lost Symbolism Archives","start":1153.79,"end":1157.19,"speaker":"Jonathan Pageau","text":"So it's all organized by symbol. Like organized by subject."}
{"episode_id":"SW - #191 - 2021-10-30 - Gauthier Pierozak - The Lost Symbolism Archives","start":1157.19,"end":1204.56,"speaker":"Gaultier Pierozac","text":"Wow. Symbol. Yeah. Like he would recycle some of his own writings and there's some beautiful things. So it's for an artist. For an artist, it is extraordinary. Mine of information and inspiration. So what I decided to do, and that's important, you may not know that in exchange for getting the funds, my goal is to share that with everybody. So for the past three years, I have scanned every single of those archives and they are now available. There's about 40,000 notes for everyone. I have a website called. I'll give you the link Ashir. Yeah. And you can have access to everything. So that's. My role is to share. That's really what it is."}
{"episode_id":"SW - #191 - 2021-10-30 - Gauthier Pierozak - The Lost Symbolism Archives","start":1204.88,"end":1205.76,"speaker":"Jonathan Pageau","text":"It's amazing."}
{"episode_id":"SW - #191 - 2021-10-30 - Gauthier Pierozak - The Lost Symbolism Archives","start":1206.16,"end":1207.44,"speaker":"Gaultier Pierozac","text":"So. But there's a lot of."}
{"episode_id":"SW - #191 - 2021-10-30 - Gauthier Pierozak - The Lost Symbolism Archives","start":1208,"end":1213.6,"speaker":"Jonathan Pageau","text":"So you've been able to scan the entire archives and. Yeah, it took all his engravings. All the drawings are his."}
{"episode_id":"SW - #191 - 2021-10-30 - Gauthier Pierozak - The Lost Symbolism Archives","start":1213.6,"end":1219.12,"speaker":"Gaultier Pierozac","text":"Yes, all of them. And I even have some. Like. He did some engravings of the."}
{"episode_id":"SW - #191 - 2021-10-30 - Gauthier Pierozak - The Lost Symbolism Archives","start":1219.2,"end":1221.28,"speaker":"Jonathan Pageau","text":"Wow. The Holy Land. Yeah. Nice."}
{"episode_id":"SW - #191 - 2021-10-30 - Gauthier Pierozak - The Lost Symbolism Archives","start":1221.88,"end":1224.84,"speaker":"Gaultier Pierozac","text":"This is called The Rosa Mystica, 1923."}
{"episode_id":"SW - #191 - 2021-10-30 - Gauthier Pierozak - The Lost Symbolism Archives","start":1225.32,"end":1228.12,"speaker":"Jonathan Pageau","text":"Yeah. Some of these are more stylized. Very beautiful."}
{"episode_id":"SW - #191 - 2021-10-30 - Gauthier Pierozak - The Lost Symbolism Archives","start":1228.12,"end":1268.12,"speaker":"Gaultier Pierozac","text":"Yes, they are. They are. And then he has. It's funny, he was keeping track of all his engravings. He's done thousands in sheets. He would just print them so he would remember what he had. All kind of. It's just incredible. It's just incredible. And there's a museum in France, Charbonneau, Lassey, it's in Loudun. They have inherited all these archives. Went to the Knights of the Paraclete. Everything he found archaeologically wise is at a museum in Luda. So I contacted them and we became really close. They gave me access to. They still have the engravings, the pieces of wood that he engraved with a knife. He was done with a knife. It's fascinating."}
{"episode_id":"SW - #191 - 2021-10-30 - Gauthier Pierozak - The Lost Symbolism Archives","start":1268.36,"end":1274.52,"speaker":"Jonathan Pageau","text":"So now the books of the vulnerary. Were you able to recover the manuscript or did you reconstruct it?"}
{"episode_id":"SW - #191 - 2021-10-30 - Gauthier Pierozak - The Lost Symbolism Archives","start":1274.95,"end":1335,"speaker":"Gaultier Pierozac","text":"Good question. I'm still not. So. So that's going back to the Indiana Jones. So when I. When I saw in the letters he sent to Gennaron the table of content, and I realized I had a lot of. Because even for the bestiary, a lot of the chapters were published separately in the periodical over 10 years. He had modified them a little later, but he done the same with the content of villainy. Okay. And. And so I was. I started collecting everything he published because I found some stuff from the 1910s, some 1936, it was all over. But because I had a table of content, I knew what to look for. So I had to reconstitute some of it and I had to. And I was able to reuse some of what he published. But my original goal was, I'm going to publish a reconstituted vulnerary. It doesn't matter if it's accurate. I want the person who stole it to come out and say, hey, this is not right. I have the manuscript. It never happened."}
{"episode_id":"SW - #191 - 2021-10-30 - Gauthier Pierozak - The Lost Symbolism Archives","start":1335,"end":1335.96,"speaker":"Jonathan Pageau","text":"Never happened?"}
{"episode_id":"SW - #191 - 2021-10-30 - Gauthier Pierozak - The Lost Symbolism Archives","start":1336.04,"end":1337.96,"speaker":"Gaultier Pierozac","text":"No, never happened. I don't know where it is."}
{"episode_id":"SW - #191 - 2021-10-30 - Gauthier Pierozak - The Lost Symbolism Archives","start":1338.12,"end":1348.36,"speaker":"Jonathan Pageau","text":"Huh. Well, it's a strange world, too. It's a. It's a. It's a world of secrets. So sometimes there are people involved in these circles that. That find power and secrecy. And so."}
{"episode_id":"SW - #191 - 2021-10-30 - Gauthier Pierozak - The Lost Symbolism Archives","start":1348.36,"end":1368.86,"speaker":"Gaultier Pierozac","text":"I agree, I agree, I agree. And one of those is. Yeah, it's being part of a group. You. I do not know what happened with that manuscript. Obviously, the person who took it is probably not alive anymore. This was another generation. But I have hints. I mean, I have a name. The goal is to. My quest is not over."}
{"episode_id":"SW - #191 - 2021-10-30 - Gauthier Pierozak - The Lost Symbolism Archives","start":1370.38,"end":1428.23,"speaker":"Jonathan Pageau","text":"That's astounding. That's really amazing. Wow. This is. It's such a. It's such a great story also because, you know, I also had my, you know, my interest in Chabano, of course, early on, when I became interested in symbolism, you know, because he was far more Christian and far more. And I was that. That was the direction that I was taking. And so obviously the bestiary was an important part of my kind of my formation and even just the possibility of thinking about medieval symbolism. And I mean, Western medieval imagery is Often more emblematic. And so it's even more. It's more easily interpreted in the way that Guinot would interpret symbolism, almost in a geometric way. And so I can really see. I could really see how Charbonneau and him would come together quite well in terms of bringing out Christian symbolism. So this. So it's wonderful to see these books coming out. And also there are future projects that you're putting together."}
{"episode_id":"SW - #191 - 2021-10-30 - Gauthier Pierozak - The Lost Symbolism Archives","start":1428.71,"end":1581.98,"speaker":"Gaultier Pierozac","text":"I'm working on reconstituting the lapidary of Christ. Lapidary from stones. And I've started. So it's. It's. I am amazed at what he gathered. I'm putting this together in French now. Of course, he'll be translated in English after that, because French is my original language. It's also the. All these notes are in French. But right now, just studying just the basic rock, for example, the rock symbolizes something that is indestructible. Right. I even go even further. Think about the diamond, the diamond stone. I'm writing an article about this. I'd love to share it with you when it's published. The diamond. I don't know if you knew that, but nobody knew how to cut a diamond until the 15th century, when with technologies, people were able to use diamonds to cut diamonds. But back in the early ages, a diamond was found in the rough, and it was indestructible. They could not break it. The hammer would bounce off it, and you couldn't do anything. And when it comes naturally, it has the form of an octagon, kind of a diamond shape. You know, diamond. That's why. But when you look at the symbolism, and I just finished studying this, Charbonneau identified that because the diamond stone is indestructible, it symbolizes the indivisibility. God cannot be divided. In fact, I would say even further. God is without dimensions. Therefore, you cannot cut it, you cannot divide it, you cannot measure it. But that's what the diamond was symbolizing. And what's interesting is that the diamond can only be cut by itself. And there were some old symbolism where the diamond was associated to Jesus Christ because, you know, when he was on the cross, he let that happen to him. So when you look at the Old Testament, when Moses used a staff to hit a rock and water comes out of it to help the Jews, this is actually a prefiguration of Christ on the cross where he died to redeem the world. Well, what's interesting is you can see that a lot with the symbolism of the rock. In the Old Testament, Moses Goes to the top of a mountain to go see God. In the old legends, the diamond could only be found in an eastern mountain at the very top. And you could."}
{"episode_id":"SW - #191 - 2021-10-30 - Gauthier Pierozak - The Lost Symbolism Archives","start":1582.58,"end":1586.9,"speaker":"Jonathan Pageau","text":"Makes sense. Yeah. In terms of the symbolism. Makes sense. Like it's a heavenly stone almost."}
{"episode_id":"SW - #191 - 2021-10-30 - Gauthier Pierozak - The Lost Symbolism Archives","start":1587.38,"end":1617.52,"speaker":"Gaultier Pierozac","text":"That's right. And the last thing is, you know, there's that story where the builders, they reject that stone that look like nothing. And that becomes the stone that you use the capstone to finish a church or a vault or whatever. So the capstone symbol end up symbolizing Christ because he was rejected by anyone. But it was the most precious stone of all, where everything holds because of him. So we found all manuscript, medieval manuscripts where the shape of a diamond was put at the top of a vault the same way."}
{"episode_id":"SW - #191 - 2021-10-30 - Gauthier Pierozak - The Lost Symbolism Archives","start":1617.76,"end":1664.29,"speaker":"Jonathan Pageau","text":"Amazing. Yeah, that's an amazing. Yeah, it's an amazing joining of all the symbolism together. Because I remember that one of the insights that I got from Guinot, which is that the idea of the rejecting stone becomes the cornerstone. That's how we used to understand it. But Guinot really brought about the idea that, no, it's the capstone or the key, you know, it's the idea of this last stone that you put in which holds it together. And I thought that's it. And since then, like, there's no. I could never interpret it differently. It just makes so much sense. But the idea of having this diamond, you know, this image of the diamond at the top in the vault is wonderful in terms of indivisibility. And this heavenly stone that comes down, that's great stuff. So that's a very exciting project. So you've got several exciting projects to still work on."}
{"episode_id":"SW - #191 - 2021-10-30 - Gauthier Pierozak - The Lost Symbolism Archives","start":1664.61,"end":1680.53,"speaker":"Gaultier Pierozac","text":"It's probably a lifetime, and I probably won't finish it and I'll pass it on to somebody else. And that seems like that's what happened to me. There was a generation who tried. They started. I have a lot of notes and all that from others. Pass it on to me. I was able to publish a veterinary and I'll try to continue and pass it on to others."}
{"episode_id":"SW - #191 - 2021-10-30 - Gauthier Pierozak - The Lost Symbolism Archives","start":1681.25,"end":1689.25,"speaker":"Jonathan Pageau","text":"Yeah, it's wonderful. And you haven't had any. You haven't had much resistance, which is great. Or maybe you have. You didn't. Just didn't tell us."}
{"episode_id":"SW - #191 - 2021-10-30 - Gauthier Pierozak - The Lost Symbolism Archives","start":1690.6,"end":1727.58,"speaker":"Gaultier Pierozac","text":"Well, I'm not very public, you know, I don't want to talk to Christians in general that are friends of mine who don't understand symbolism. They think it's paganism. They think it's all kind of stuff. But, yeah, so I don't talk about this only with people who can understand now in private, I have. I'm working right now with a small group in Argentina who are Christians. They love symbolism and they are translating the venerary right now. So I'm helping them. I'm sharing those archives with them and we're going to publish that one probably at the end of the year. The Spanish version of the venerary."}
{"episode_id":"SW - #191 - 2021-10-30 - Gauthier Pierozak - The Lost Symbolism Archives","start":1727.66,"end":1752.63,"speaker":"Jonathan Pageau","text":"That's wonderful. Yeah, I found that in South America there's some interesting. In Brazil as well, there's an interesting resurgence of symbolic thinking which is definitely worth being invested in. Yeah, that's really amazing. And so you also maybe my last question because you mentioned that you were working with the Guino family as well in terms of collating some of the letters. Is that a project you're still involved with?"}
{"episode_id":"SW - #191 - 2021-10-30 - Gauthier Pierozak - The Lost Symbolism Archives","start":1752.63,"end":1845.86,"speaker":"Gaultier Pierozac","text":"So I did it for them. No, I'm not involved anymore. There was a few years ago they had a kind of a. They called a foundation where they would attempt to. Basically they wanted to publish all the work of Guenant Revised. But this project has stopped. Guinon's work is going to be in the public domain next year, January 2022. And I think at that time it's going to be completely free for all. Basically everybody's going to publish whatever they want, unfortunately. But I had access to all those letters. Of course there's a lot of confidentiality, you know, it's. It's for them. But yeah, I had access to a lot of letters. And by the way, I have a website again where I actually put all the Genon's work in French, including the correspondence, all the letters for all to access. And this website has really. It's 10 years old now. It has thousands of visitors every day. And I believe it helps bring Genon's work to the masses if you want, in some ways. But really my. I mean, I live in the United States. I've been here for 20 years. My goal was to try to bring some of Geno, but mostly Charbonneau Less's work to the Anglo Saxon or the English speaking world. And that's. I was very impressed when Angelico Quest, I don't know if you knew that. When I tried to get my crowdfunding going on, I sent a few emails in the United States, few people I knew. One person who helped me was James Kutzinger. Have you ever heard of James?"}
{"episode_id":"SW - #191 - 2021-10-30 - Gauthier Pierozak - The Lost Symbolism Archives","start":1846.9,"end":1851.38,"speaker":"Jonathan Pageau","text":"I was friends with James Kutzinger. I made some, even some pieces for the end of his life."}
{"episode_id":"SW - #191 - 2021-10-30 - Gauthier Pierozak - The Lost Symbolism Archives","start":1851.7,"end":1905.52,"speaker":"Gaultier Pierozac","text":"Oh, wow. Yeah, so he helped me very early on, early in the 2000s, when I was early I didn't even know about Charbonneau and all that, but I was kind of guided towards the symbolism of the hearts, which is the center, which is everything. He's one of those who helped me. And when I contacted him to say, hey, I'm doing a crowdfunding, crowdfunding, he sent it to a few other people. There's very few in the United States, in North America, you probably know them all. But one of them was Jean Champou. Jean Champou, who could not. Why he offered instead of the crowdfunding, to give me money. He said, what if I translate the venerary in English for you? And that's what he did. It took him years. Amazing. And then he contacted Angelico Press. We worked together, we did another crowdfunding so we could pay for this, but it went really well. So it is definitely a walk of passion. We don't do that for the money. Nobody buys this book, you know, it will never."}
{"episode_id":"SW - #191 - 2021-10-30 - Gauthier Pierozak - The Lost Symbolism Archives","start":1906.32,"end":1945.74,"speaker":"Jonathan Pageau","text":"It won't be bestseller, but it will have an impact. Everybody, you need to get it. I'm still working through it. It's a massive book. It's heavily documented. It has hundreds, I think like at least 100 images of all the different engraving that Charbonneau Lassey has done. So it's really a wonderful book. And it's really, like I said, Charbonneau Lasse is really, in terms of my work, a precursor, someone who laid the foundation for symbolic thinking in the Christian world. And so we're very grateful for him and Gaultier, very grateful for the work you're doing and looking forward to seeing it continue to flower. So thanks."}
{"episode_id":"SW - #191 - 2021-10-30 - Gauthier Pierozak - The Lost Symbolism Archives","start":1945.74,"end":1959.3,"speaker":"Gaultier Pierozac","text":"Yeah, no problem. And I will send you the link to the archives and never hesitate, if you want me to look for something in the archives, I'll send them to you. I was the other day you walked on that St. Christopher with a dog headed man."}
{"episode_id":"SW - #191 - 2021-10-30 - Gauthier Pierozak - The Lost Symbolism Archives","start":1959.3,"end":1959.66,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #191 - 2021-10-30 - Gauthier Pierozak - The Lost Symbolism Archives","start":1959.66,"end":1962.54,"speaker":"Gaultier Pierozac","text":"And I found that in these archives as well. So I thought it was cool."}
{"episode_id":"SW - #191 - 2021-10-30 - Gauthier Pierozak - The Lost Symbolism Archives","start":1962.78,"end":1975.15,"speaker":"Jonathan Pageau","text":"I remember seeing that image in the early bestiary edition. Like the French edition. That was actually probably the first time I ever saw that image was in Charbonneau's early, like the French edition, the facsimile one. That was like just."}
{"episode_id":"SW - #191 - 2021-10-30 - Gauthier Pierozak - The Lost Symbolism Archives","start":1975.15,"end":1975.51,"speaker":"Gaultier Pierozac","text":"It was."}
{"episode_id":"SW - #191 - 2021-10-30 - Gauthier Pierozak - The Lost Symbolism Archives","start":1975.51,"end":1976.83,"speaker":"Jonathan Pageau","text":"It was massive, that book."}
{"episode_id":"SW - #191 - 2021-10-30 - Gauthier Pierozak - The Lost Symbolism Archives","start":1977.23,"end":1979.31,"speaker":"Gaultier Pierozac","text":"Yeah, it was. It was. That's awesome."}
{"episode_id":"SW - #191 - 2021-10-30 - Gauthier Pierozak - The Lost Symbolism Archives","start":1979.47,"end":2000.1,"speaker":"Jonathan Pageau","text":"Yeah, so. So it's great. And yeah, for now, like, I think that, yeah, it's an opening for people to look into medieval symbolism. And like I said, for everybody who's interested in symbolism, you know, he was our. He's our ancestor. In the in a spiritual way. So. So look into the Vulnerary and the Bestiary. Looking forward to the full publication of the book and all the future projects. So thanks a lot."}
{"episode_id":"SW - #191 - 2021-10-30 - Gauthier Pierozak - The Lost Symbolism Archives","start":2000.66,"end":2002.26,"speaker":"Gaultier Pierozac","text":"You're welcome. Thanks for having me."}
{"episode_id":"SW - #191 - 2021-10-30 - Gauthier Pierozak - The Lost Symbolism Archives","start":2002.26,"end":2064.2,"speaker":"Jonathan Pageau","text":"I hope you enjoyed this episode of the Symbolic World. The Symbolic World is based on a series of videos that you can find on my YouTube channel, Jonathan Pageau's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course leaving a review on itunes. Everybody knows that's the best way to get the podcast out there to get it heard. And if you want to get involved, you can also support the podcast financially, going to to www.thesymbolicworld.com support or else on Patreon the Pageau videos as well and on subscribestar. All those links you can find on my website or in the show description. So thank you and I will see you soon."}
