{"episode_id":"SW - #119 - 2020-10-08 - Jesus vs Barrabas","start":0.96,"end":1431.45,"speaker":"Jonathan Pageau","text":"So in the few moments before Pilate, the Roman governor of Judea, hands Jesus over to the Jews to be crucified, there is a strange exchange which happens in which Pilate offers to release a prisoner. And thinking that maybe the crowd will ask for Jesus, instead, the crowd asks for Barabbas. And the entire narrative is set up in a way that seems to create a relationship, opposition between these two characters, which one is Jesus and the other is Barabbas, an insurrectionist and a murderer, criminal. And so the crowd asks for Barabbas. And so I want to look at what is going on in this story, why this opposition is set up, what it can tell us about who Christ is, and also what it can tell us about today. And some of the things we're seeing in the world happen, especially in the United States with the protests and the riots, how this seems to be related to the relationship between Jesus and Barabbas. This is Jonathan Peugeot. Welcome to the symbolic world. So we read in the Gospel of St. Luke, Pilate summoned the chief priests and the rulers and the people and said to them, you brought this man to me as one who incites the people to rebellion. And behold, having examined him before you, I have found no guilt in this man regarding the charges which you make against him. No. Nor has Herod, for he sent him back to us. And behold, nothing deserving of death has been done by him. Therefore I will punish him and release him. Now he was obliged to release to them at the feast one prisoner. But they cried out together, saying, away with this man and release for us Barabbas. He was one who had been thrown into prison for an insurrection made in the city and for murder. Pilate wanted to release Jesus, addressed to them again. But they kept on calling out, saying, crucify him, crucify him. And he said to them the third time, why, what evil has this man done? I have found in him no guilt demanding death, therefore I will punish him and release him. But they were insistent with loud voices, asking that he be crucified. And their voices began to prevail. And Pilate pronounced sentence that their demand be granted. And he released the man they were asking for, who had been thrown into prison for insurrection and murdered. But he delivered Jesus to their will. In another version of the text, it also says that when Pilate saw that he accomplished nothing in trying to get the crowd to want to release Jesus, that he saw that he couldn't accomplish anything and saw that a riot was about to start. And that's when he washed his hands. That Famous gesture and said, I am innocent of this man's blood. See to that yourselves. There are some really interesting aspects about this relationship. First, we need to say a few things about Barabbas and the situation that was happening. As if you don't know a little your Bible history, you need to understand that in the time of Jesus Israel, Judea was ruled over by Rome. Rome had taken over and they were ruling the Jews. The Jews were known in that time to be a rowdy bunch in the sense that they didn't accept the rule of Rome peacefully in part because Rome didn't also understand the Jewish religion and tended to ask the Jews to do things like, you know, you know, offer sacrifice to the emperor. There were stories of the Roman emperor trying to put Roman statues in the temple, kind of pagan statues. They were used to this, this, the Romans were used to this kind of weird, you know, mixed paganism that the Jews refused. And so because of that there were insurrections. There had been insurrections before, of course, the famous insurrection of the Maccabees in which they tried to fight off the, the Hellenistic rulers. And in that time also there were insurrectionists. There were zealots, they call them, people who wanted the, the Jews to fight and against the Roman domination. And so in this situation, what you have is you have a man, Barabbas, who was part of this insurrection and was had murdered people during the desire to raise up and to take power from their Roman overlords. So in the story of the situation where the Roman governor was supposed to release a prisoner, traditionally because it was the feast of Passover, and, and here is this choice which is presented to the people in one text it seems like it's the people calling. In other versions it seems like it's Pilate who's proposing these two opposites for the people to choose from. A fascinating detail to notice is that the name Barabbas means son of the Father. But not only that. In some early versions of the Gospel of Matthew, Origen talks about how in some of the early versions the then Barabbas name is Jesus. And so his name is Jesus Barabbas. And then in some versions of the the Gospels you see that Pilate says Jesus the King of the Jews or Jesus the Messiah. And then there's this other character, Barabbas, who in some versions of the early text were named was named Jesus. Now they took out the name Jesus or maybe it was inserted by other people by heretics, who knows, doesn't matter. But what's interesting to notice is that There is definitely set up, whether it's by the name or just by the situation, a parallel between these two sides between Jesus and this, this character Barabbas. What I think it is referring to is that, I think that in Christianity, the story of the Gospel is also kind of setting up a pattern. And is setting up a pattern which will manifest itself in the church itself, will manifest itself in history, will become a, you know, will set up a pattern for reality. And there is, in the story, in the Gospel, there are some what you could call fail safes in the story, the Gospel story. One of the things that characterize Christianity is the fact that Christ is always moving towards the margin, is always moving towards the poor. And so he, you know, of course there's the Beatitudes where he says, blessed are the, are the poor, blessed are the meek, and tends to want to bring the blessing to the poor. He also talks about things like the lost sheep, about how the shepherd who goes out and moves all the way and finds, leaves the flock and goes all the way out to find that lost sheep and bring the lost sheep back. And so he hangs out with tax collectors, hangs out with prostitutes, hangs out with people of bad life. And the reason why he's doing that is because he is the light which is moving out into death. And so his whole story is about, about that which is above going all the way down to the bottom, filling up the world with light. And so in order to do that, he has to go all the way to the edge. When the Pharisees ask him why he's hanging out with tax collectors and people that have a bad life, he answers, you know, you don't send a doctor to heal healthy people, you send a doctor to heal the sick. And that's the whole notion of the Incarnation, is that the light comes down and fills up the world. But in that story there is of course, a possible danger, right? There is a danger in emphasizing the relationship of God or the high which comes down into the low. There is the danger of, let's say, seeing value in the margin in itself, or seeing a. Seeing the value of the margin almost in a kind of revolutionary manner. And we've seen that in the story of Christianity. As Christianity, let's say, moves away from its own central principles, it can tend to move towards revolutionary thinking. That's why the French Revolution, Marxist Revolution, all of these revolutions happen in the story of Christianity in a post Christian world or in a world where Christianity is losing its grip, even in the things like the peasant revolts already during the time of the radical Reformation and in other moments in the story of Christianity, you can see how there's a temptation to see this, let's say, notion of the God coming to the lowly, that God manifesting himself in a way that brings that which is low kind of lifts it up into himself. I talked about this in, in a recent video that we could see that we could interpret it almost as a revolutionary manner, especially understanding that at the time that Christ came into the world, there was already that zealot thinking in the Jewish culture. And so it seems like in the story of Christ there are some fail safes to prevent the story from being interpreted that way or to stop that type of, that type of pattern from manifesting itself legitimately within the Christian story. And this seems to be one of them. There's a few others. We'll look at them. So what we have is basically we have a setup where Pilate is saying, choose your Messiah. Which is your Messiah? Is it this character? Who is it who leads an insurrection against Rome, who is a criminal, who has murdered, who has done all these things in the desire to achieve his political goal? Or, or is it this character who is teaching about a kingdom, but a different kind of kingdom, right? The kingdom of God which manifests itself in the heart of people, which transforms from the inside and transformed by creating holy people. And that is. And those waves will transform the world, right? Become a tree so that the birds can land in your branches. You know that you need to not judge your brother, but to take the, the, the, the beam out of your own eye. All of these types of, of teachings that Christ is giving is about this transformation from within which then ripples out into the outside. Whereas the, the, the insurrectionist is one who believes that transformation needs to happen in a political sphere, needs to happen in the social sphere and from the outside. And so you basically have a setup where Pilot is asking, which, which Jesus do you want? Which son of the Father do you want? And do you want this son of the Father, the one who transformed from the inside, or this son of the Father, the one who wants to transform from the outside and transform in a political and in a violent manner. And so it's very fascinating to watch. Now, there are other moments in the story of Jesus where he appeals to the same pattern, where he appeals to the pattern of being careful not to see the social aspect of the teaching of Christ. What could be interpreted in terms of a political aspect, what we could call today the social justice aspect, to not see it as the most important to not see it as the highest value, but rather understand that the highest value must be God, that the highest value must be worship. The highest value must be this communion and focusing towards that which is beyond us. And then from there will come the social aspects of the Christian message. But if you flip it upside down and you put the social above the spiritual, if you put the political above the worship, then things go completely off. That is there in the choice between Barabbas and Jesus, but it's also in one of the very rare times where Jesus actually interacts with Judas. Jesus doesn't interact with Judas very much. In Scripture, one of the places where Jesus interacts with Judas is in a story where Christ is in a home and there's a sinful woman who comes in and she wipes Jesus's feet with this very, very precious perfume, and she pours this perfume on his feet and she kind of washes his feet. There's all kinds of symbolism happening in that situation, but we won't go into all the symbolism, but we mostly hope, it's mostly important to understand that she has this gesture of attention to his feet and this gesture of worship towards him, towards himself. And what you see in that situation is Barabbas complains, and Barabbas says, you know, we could have used that perfume, sold it, and given the money to the poor. And Christ's answer is very telling. He says, you know, the poor will always be with you, but you know, the bridegroom is here for a very short time. And so he's saying, get your priorities in order. You need. Worship comes first. Attention to the incarnation, attention to Christ, to the Anointed One, attention, attention to the God. Man comes first and then comes the other part. And he's not, of course not saying you shouldn't help the poor, you shouldn't feed the poor. Christ has often said that we need to do that, but he's saying the poor will always be there. You need to get your attention in line. And what's fascinating about this is also it says in the text that the reason why Judas was saying that wasn't really because he wanted to help the poor, but it was because he was a thief. And he was. He. He carried the. The money purse for the disciples, and he would go and take the money out for himself. And so it's very fascinating to understand, if you understand the pattern, what it leads to. And so when we look at what has been happening in. In the recent events, let's say with the protests and the riots, in the United States, I think it's very important to look at the manner in which this story was framed by some people, the manner in the comparisons that were made between, especially in terms of George Floyd. We need to look at that and see, you know, what is going on here. Why is there this desire to make these comparisons now, in the weeks that followed the death of George Floyd, we. We started to see some images appear and some suggestions. We saw, you know, for example, Father James Martin, Catholic priest, who is extremely, extremely liberal, you know, probably one of the most vocally liberal priests in the United States, comparing Floyd to Jesus. You also saw an article talking about the crucifixion of George Floyd. There are many, many examples, culminating in. In some images where you could see him represented with a halo, with wings. And with the halo kind of got more and more, until finally it came down to an actual icon, where an icon of the mother of God placing, you know, with her dead son in her. In her arms. The face of Jesus was replaced with a portrait of George Floyd full on, with the halo with a cross and in the cross saying, ho on, that is I am God. There it actually, it is the. When you put those letters in a halo, that those letters means the one that is. That. That is God himself. And so this was the epitome, of course, of the situation. But already you could see some images appear of people kneeling in front of images of George Floyd. Of course, it was very ambiguous because it was kind of like the BLM kneeling. But nonetheless, you see people. You see the images turned into shrines with people kneeling. And so there really is this strange almost deification of George Floyd. And what's fascinating about it is, of course, the comparison between, let's say, George Floyd and Christ. Not just the character, not just George Floyd, but George Floyd in the. The context of Black Lives Matter and in the context of the protests and in the context of what became a riots and also the taking over of certain aspects of the cities, because, of course, you know, Mr. Floyd, it. It's very sad that he was. That he had to die that day. It was not. It was very unbearable to watch. And it was a tragedy, of course, but. But George Floyd was obviously not like Christ. George Floyd was a. Was a. Someone who was a convicted criminal at certain times in his life. He was on drugs at the time. And it's the same with several of the characters who have also sparked other riots in the consequence of George Floyd. All those characters seems to have been criminals or accused of criminal actions in very suspicious Situations with, you know, with some very suspicious past. And so it is very fascinating that there is a comparison between someone like George Floyd and Christ. And of course, that comparison would not be that big of a deal in the sense that you could make a very slight comparison in the sense of someone who died unjustly. But it becomes a bigger deal, of course, when you get to an actual icon, but also because you have to understand the comparison in the context of insurrectional acts, in the context of revolutionary acts, in the context of riots and protests, and in the context of riots and protests in the name of the little ones, in the name of the poor, in the broadest sense, in those that are marginalized by society. You know, and like I said, this is where it gets tricky to see the difference between Christianity and a strange, let's say, perversion of the Christian ideal. Christianity, which wants to take care of those who are poor and marginalized and those who are on the edge, who wants to reach in and, you know, help them to participate in, you know, in the kingdom of God. The difference between that and what we're seeing happening with buildings on fire and this revolutionary action. And like I said, we always have to remember that the situation was similar to what was happening in the time of Jesus, which is that Rome was an oppressive power and the Jews were persecuted, were under the boot of the Roman authorities, and there were insurrections and riots and rebellions against the authorities. And. But Jesus never actually spoke up against that. Jesus never gave political, political drive towards what was going to happen. He was going to transform Rome. Christ was going to not only transform, but take over Rome. But he was going to do it in a different manner. He was going to do it from the inside out, rather than from political action and social action, which usually doesn't alleviate the problem, but just ends up replacing what, one power by another. And this is, of course, where the story of Judas comes into mind, is to remember in the story of Judas where his desire to help the poor, because he was presented as higher than the desire to worship, became, was actually a subterfuge for what he really wanted, which was power. And I think that we see that that's what happened in the. The revolutionary movements of the past, whether it be the French Revolution or the Russian Revolution, although it was presented in the guise of helping the little ones, of helping the poor, in the end, what it happened, what happened was a reversal, a new elite which was more violent, more cruel, more controlling than the one before, and was. Was actually, let's say, controlling society with an iron fist in a very perverse way. And it seems like with these requests to defund the police or to disband the police, to disband the current order, the breaking down of statues, the breaking down of order, although it is done in the name of the little one, because it is seen as the highest value, because characters like George Floyd, who, you know, you could say was unjustly killed, was nonetheless not a holy man, was not a. Was not a saint, was not someone who was known for being, for being Christ like. And so in that guise comes the flames, comes the revolution and the insurrection. That is definitely not the message that Christ has given. And so I just wanted to offer a little bit of reflection on this subject. Of course, there would be much more to say, but I thought it was important to talk about that as we see these protests not lit up, as we see the situation, not calm down. We need to be able, as Christians, as people who are looking at the story of Christ, to be able to notice the difference and to tell the difference. Because for a very long time, in certain branches of Christianity, Christ is represented as a kind of revolutionary figure, a figure that is presenting some kind of social justice change. Whereas I don't believe that's what Christ was doing. The change, the justice, the peace, comes from an inner transformation of his saints and a communion of love between people, not a pointing of fingers and a finding the guilty one, canceling them, getting rid of them, and demonizing all the people who aren't part of your group. And so that is what I wanted to bring to you today. As usual, I want to thank everybody for your attention. Thank everybody for your support and I will talk to you very soon. I hope you enjoyed this episode of the Symbolic World. The Symbolic World is edited by Justin Ward and it is based on a series of videos that you can find on my YouTube channel, Jonathan Pageau's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course, leaving a review on itunes. Everybody knows that's the best way to get the podcast out there, to get it heard. And if you want to get involved, you can also support the podcast financially. Going to www.thesymbolicworld.com support or else on Patreon Pajot videos as well, and on subscribestar, all those links you can find on my website or in the show description. So thank you and I will see you soon."}
