{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":0.56,"end":104.63,"speaker":"Jonathan Pageau","text":"Sometimes I imagine myself as a, let's say, a Russian peasant in the 19th century, and how the patterns in which people were living were so naive. They were true. A lot of them were true and were real, but they were very innocent. And so in some ways, they were very much in danger. And so when the materialist, secularist narrative comes in, people get crushed. And I saw that even when I was young, I would see people with a very confident but naive faith, and then they would go to university, and then they would. Would just get crushed, and they would go to their first philosophy class and they would just be completely demolished because they had never heard anything like this. They never heard any of these arguments. They had never thought about any of these things. In Quebec, we had the thing called cejep, and they had philosophy classes in cep. And I think those philosophy classes were even just designed to slash the Catholicism out of all the Quebecers that went through that in the 70s when they were installed. And it worked. It totally worked. People came in, these naive little churchgoers, and then we're completely destroyed. But what's interesting. So now we go through this loop and now we come to this symbolic understanding, people kind of re understanding the role of perception, of attention, and how it shapes our narratives, how it shapes the way that reality manifests itself. And once people have gone through that, that training, what are you going to. How are you going to take that? How are those philosophy professors going to take that away from the. I don't think it's possible anymore. I always say it's like there's nothing you could tell me. I don't. I mean, maybe. I don't know. I don't. I feel like I've heard it all. Like, I feel like, what is it that you're going to tell me that you're going to convince me back into that old world? I don't see it happening."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":104.79,"end":106.23,"speaker":"Fr Christopher","text":"I don't see it happening either."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":118.23,"end":261.57,"speaker":"Jonathan Pageau","text":"This is Jonathan Peugeot. Welcome to the symbolic world. I do agree, like, I think that the change that. That's happening, and I think John Rubeki also has that insight, is that the change of perspective or worldview that's happening right now, it's monumental. And so, you know, it is almost. I think it's going to be like, equivalent to something like the Enlightenment or maybe the Renaissance, in the sense that the shift that happened, and once the shift has totally happened, for most people, it's just going to become the water they live in. They won't be aware of the change. I think there's a few people that are aware of the change. They kind of see it happening. And it's actually painful in some ways because you can almost feel it. It was happening to me, like, I was really feeling it painfully during. In 2016, 2017. It was very. It was painful. I was sensing, like, the whole tectonic plates under my feet shifting, and it was happening in many ways. Some of it was political because of the Trump election and. And all of the craziness online and these. This kind of madness around what Jordan was going through and everything. But while that was happening, I could really feel the world shifting under my feet. And it was. It was like a kind of existential suffering. You know, it was hard to describe to people, but it was almost like you feel like you're being ripped apart. And so I felt that now I don't feel it so much because I feel like at least many people have kind of bridged to the other side of the change. So I don't feel alone too. Which is one of the things that happened for a while is that my brother and I, we just felt alone. Like, we felt. We had this kind of intuition about how the world functioned. And it was like there was no one around us who. Who could talk about it. But now it's as if. Now it's become. Yeah, it's. It's obvious. And there are all these people that. I think it's almost like these things were preparing themselves in secret for a long time, different players, you know, like John was thinking about it, and Jordan and all these other people were thinking about things and trying to bring them together. Then suddenly the moment, you know, that Kairos moment kind of happened, then it just snapped together and then we kind of found each other. And so that's a. That's pretty wild, you know, it is."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":261.65,"end":276.21,"speaker":"Fr Christopher","text":"It's interesting that you say that too, because I had that sense too, that there's almost like this long preparatory period, this sort of gestation, that something was subterranean for a long time. And it was kind of. It was being formed invisibly, I think."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":276.85,"end":347.89,"speaker":"Jonathan Pageau","text":"Yeah, when you look back, you can see it. It's like you look back and you're like, oh, you know, I think Heidegger was talking about. Heidegger was talking about this stuff. Like all the things that were kind of interest. Interest us, you think. Well, actually there. There are some of the modernists that seem to have been intuiting some of it, and sometimes a little crookedly or sometimes a little strangely. And so then. But now it feels like it's landing, let's say, whatever it is, those insights that were that, that they're landing and they're becoming obvious, you know. And so something like, let's say the way that Heidegger described the experience of, of the world was something that was just completely obtuse, just completely obscure for most people. Like, what is he. It's just gibberish. They'd read Heidegger and they're like, they're just gibberish. Or even the postmodern, like Derrida actually does have a phenomenological perspective. All his thinking is based on that phenomenological perspective. So his categories, he emphasizes the margin and the exception and the dissemination, but he does it from that perspective. And so now it's as if it's all kind of landing. And now you can, I can talk to a regular person. And we found language to say it to someone, just a regular guy. And it's like, yeah, okay, all right. No, I, I, it's like they get it, you know? And it's astounding."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":348.13,"end":408.21,"speaker":"Fr Christopher","text":"It is astounding. It is astounding. And I think it requires, I think it's. To your point about the kairos, I think one of the features, as I understand it, of kairos is that it requires a certain kind of, A certain synchronistic alignment of a lot of patterns to become concentric in such a way that there's an opening, there's actually something through which all of this to travel. And I think it has something to do with the fact that I think what happens within an individual person is something like what's happening more broadly, which is that you just, you have to go through this period of suffering such that you exhaust yourself, you exhaust yourself beyond the limits of what was tenable. Right. It's like somehow I'm coming up against the frame of the world that I held, and it's just not. There's no purchase anymore. It's like breath is gone, it's finished, it's dried up. It's like the purgation, right. It's like something's finished. I've reached the end point of myself, beyond which there is just nothing."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":408.45,"end":408.89,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":408.89,"end":446.31,"speaker":"Fr Christopher","text":"And it's almost as though you have to get to that point, maybe whether we're speaking of a person, an individual, or we're speaking of in a more communal sense. Right. I guess they're co. Extensive. Right. That's the whole point of the synchronicity, is that the individual in the communal have a co. Extensive pattern and that it has something to do with reaching the end of a period of suffering that exhausts whatever the worldview was that was doing the gripping and now it can't grip anymore. And some it's like transform or die. It's almost like there are two choices and like that happening. I feel that's the sense I'm getting from you."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":446.95,"end":477.06,"speaker":"Jonathan Pageau","text":"I think so. I think so. It seems like. I think St. Paul talks about that. You know, he talks about this idea of the birth pains. You know, the world is in birth pangs. And I think this is almost like a fractal thing. Like it's something that happens all the time at different levels, like you said individually. And there's this sense, like you said, a purgation or that the suffering and the breakdown has to. Has to happen before the. The new world is born, you know, and sometimes it's. I mean, sometimes it's pretty painful. Like, I think, for example, that."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":477.3,"end":479.3,"speaker":"Fr Christopher","text":"Necessarily painful? Probably. Yeah."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":479.38,"end":499.46,"speaker":"Jonathan Pageau","text":"Well, interestingly enough, I feels like I've always thought that the plague had probably a lot to do with the Copernican revolution. Like it took a while for the effects of the plague to kind of lead to a change of world. But I've always had that intuition that there was a relationship between the two. I mean. Yeah, I don't know. It's speculation on my part, but."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":499.94,"end":577.15,"speaker":"Fr Christopher","text":"Yeah, well, it's a good speculation, though. And I think John has a similar argument actually about the plague too. But it has something to do with it. I mean, it's an archetypal motif for a reason. Right? It's like that somehow there's a certain we have to die to the possibility of being renewed into a new form of life and form of seeing. And that, I think something, something. And I've had my own personal version of that. And it sounds like you've had your personal version of that too. Meanwhile, the sort of. The gathering that happens on an individual level is somehow participating in a gathering that is of a greater order of magnitude. And that when those things become synchronous, something very numinous and uncanny starts to happen, right. That like Aporia begins to yield the possibility of light penetrating it from the outside. But that's like. That's a painful. So we. It's easy to talk about those things in romantic terms, but like, phenomenologically and existentially, the experience is anything but romantic. I think it. The labor pains, to your point, it feels remarkably painful. It feels like you're being squeezed through something very tight and very Dark."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":577.39,"end":577.87,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":578.11,"end":580.35,"speaker":"Fr Christopher","text":"But it's also there as attendant to the experience."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":580.91,"end":661.86,"speaker":"Jonathan Pageau","text":"And it's not. I don't think it's the whole thing. I don't think the game. Let's say the play isn't over. Like the. The process isn't over. I think that it scales. And so in some ways that I think what we're seeing happening is still seeds. It's still seeds. It's still. Because let's say the. The old world is still playing out. Like the. The madness of the old world is still playing out. And a lot of. Even what we're. Let's say what we're doing is feeding on the residues of that old world. Like we're still. We're still feeding off that stuff. It's still. We still need it in order to kind of even to get the message across. Like we're using. Yeah, the techniques we're using are part of. Are part of the. The issue, let's say. So. So, I mean, it's kind of interesting because we talk about, you know, the idea of embodied experience and community and. And the idea of connecting. You know, let's say John has his. His practices and I'm saying people go to church, but we're still doing this online. We're still on YouTube, we're still on social media. And so it really is. I think that's part of the feeling of the being ripped apart to a certain extent, is that it's like we're on a bridge. We're kind of moving from one world to the other. We're not sure how to integrate the old world because in some ways you do have to integrate it. And so we don't. We're not sure how to integrate it into this new thing anyway. So. Yeah, so I think that probably is part of why it feels so stretching."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":662.34,"end":747.05,"speaker":"Fr Christopher","text":"Yeah. Yeah, it does. And Covid had something to do with amplifying and accelerating it, I think, because I got this sense, and I think a lot of people did, consciously or not, that it was, I think for many of us, the first time, of becoming aware that we're being lived out by, to use an autumn quote, by powers that we don't quite understand and that we can't get a perspective on that. We can't exactly get a perspective on what it is that's happening. We're participating in something that has a presence within and as a presence without. And we're being forced to reckon with ourselves in a really fundamental way because the ontology of the world is suddenly shifting from under Us. And that was. I mean, it makes so much sense to me when I think of that event as a properly symbolic event. Right. That whatever the virulence, whatever the. Whatever the biological virulence was, the symbolic virulence was ultimately the far more potent and powerful thing. And what it shows is that these patterns that we take completely for granted have a trajectory that is not entirely known to us, and that they're bearing us out to something that isn't quite clear, but that our response to it and our way of integrating it has something to do with bearing ourselves out through it. It's an incredibly complex thing."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":747.29,"end":766.17,"speaker":"Jonathan Pageau","text":"Yeah, Well, I think that for sure. For sure. Covid exposed things is maybe the. At least that's the way that I see it. It exposed patterns that were already there. And so it kind of exposed the isolation and the loneliness. And it exposed also the."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":766.66,"end":766.82,"speaker":"Fr Christopher","text":"Right."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":766.82,"end":897.02,"speaker":"Jonathan Pageau","text":"It exposed the system in the sense that the system. How strong the system is, like how powerful the political system is and how powerful the technological system is, and that it made it possible for people to be isolated even more. Because I kept. All through Covid, I kept thinking, like, if Covid had happened 200 years ago, we probably wouldn't have talked about it. People would have died, and it would have been sad, and we would have buried people, and there would have been, like, a sense in which there's something difficult happening. But, I mean, it wouldn't have gripped the entire world and forced us into our homes for two years. Because that was only possible because the system was so strong. And like, you know, it revealed the system to us. Like, okay, this is the world we actually live in, you know, so now know what that is. And it also revealed. This is kind of loneliness or capacity for autonomy, you know, that also is the loneliness. Like, those two things go together. Like, we can live without contact with others for a very long time, and we'll be fine physically. Like we will. We will live and we will. We could even thrive economically. Some people thrive quite well during COVID in terms of. In terms of financially. But so it's like, okay, so if we're not deliberate about our communities, if we're not deliberate about how we're together, it's not going to happen on its own because let's say, the needs of the ancient world. The needs of the ancient world forced people to be together. There was no other way. You had to be together because if you did it, you would just die. But now we've. We've set up a world where we don't. But we have. We need to. So how. How do we do it? So it's like. It's something about the. The consciousness of the patterns, even in terms of symbolism, for example, which I think comes with the problem of the. The problem of a world that isn't integrated naturally. And so the fact that the symbolic world isn't integrated naturally like it would in a. You know, in a tribe in. In the middle of the Amazon, where they don't have a choice. They have to live under these trees, they have to make fire. They have to, you know, do these things that are so, you know, let's say, symbolically rich and symbolically integrated that they. They probably don't have to think about it."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":897.02,"end":897.46,"speaker":"Fr Christopher","text":"It just."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":897.46,"end":923.79,"speaker":"Jonathan Pageau","text":"It just happens naturally. But now we live in. In a. In the technical world that's so strong that it's revealing the patterns to us. Because if. Because we. We suffer, but we. Like, okay, we have to understand how this works. You and I think the same with community. It's like, okay, so we have to be deliberate about community because we don't have to have community. So now what do we do if we don't, if we're not deliberate about it, then we. Then we'll die. You know, morally, like, we'll die spiritually, maybe not physically, but."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":924.11,"end":1062.51,"speaker":"Fr Christopher","text":"Right. So if I'm getting you right, it's like our. Whatever is inhibiting our capacity to participate in these patterns, these patterns that are more perennial. The fact that we're. Speak. We've become so atomized and Covid. In some sense exposed and maybe even accelerated that sense of atomization, right. Of being forced back on our moorings independently into solitude and having to reckon with the possible, with the anxiety. And I think it is anxiety of personal responsibility that being so sort of maximally disintegrated draws attention to the need for integration itself. Because it's like. So there's a kind of distension going on. And I want. But that. See that. That's so interesting because it actually makes me wonder whether there's necessity in that as part of the pattern itself. Just as there may be necessity in the particular kind of suffering that a person has to undergo by being so divided against himself, so disintegrated, that having to become many is requisite for having to be. For the movement, the logos, the gathering back into unity again. So I wonder in the same way, maybe on a different scale, whether this sort of. This fracturing is part of the pattern of that movement itself. And that participating in that movement requires us to take Seriously, the responsibility that was foist on us as a consequence of that solitude and the anxiety that comes with it. I know. I mean, I know that happened to me. I know it happened, I mean, virtually to everyone I knew. Like on a very deep and personal level. We were all forced to sort of live with the sum of decisions we made or failed to make. Right. And there's an incredible despair and guilt. At least I felt it, that came with that. But then it was precisely by turning into that guilt, turning into that despair, that the possibility of gathering back up again became actually available. And I don't know exactly what to do with that or how to generalize it, but I have some sense that that existential scale of having to regather in the face of that distension has something to do with the pattern that's happening chaotically, maybe right now, but on a greater scale."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":1062.75,"end":1118.22,"speaker":"Jonathan Pageau","text":"So I think you're really onto something. There are a few tropes, let's say, in Christian theology. If you read some of the church fathers, they'll say something like, when Adam fell, the human nature was splintered into many persons, many individuals. And that in some ways, that was something that was inevitable with the fall, but then ultimately was going to be transformed into a regathering that you mentioned. And so that might sound abstract to some people, but if you think about the way St. Paul talks about sin, for example, is super interesting. You know, when you sin, let's say you give in to some thing like you lie or whatever. You give into some passion or some desire that, you know is kind of bringing you astray or ripping you apart. There's something weird that happens every time is that you actually have an opportunity."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":1118.46,"end":1118.94,"speaker":"Fr Christopher","text":"Yes."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":1119.34,"end":1119.98,"speaker":"Jonathan Pageau","text":"And then you."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":1119.98,"end":1120.38,"speaker":"Fr Christopher","text":"You."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":1120.38,"end":1168.1,"speaker":"Jonathan Pageau","text":"It's like a little moment of being awake, actually sinning is a weird. Is a weird moment of waking up because you do something. It's like, you know, you're talking and all of a sudden you lie. I don't know, you brag about something and you say something is not true. And you're like. If you're at least somewhat, like, still, you know, unless you're completely lost. But if you're. If you're still somewhat. Have a little bit of sense of yourself, you'll have an internal moment where you're like, why did I say that? Like, why did I do that? And that's. That's an opportunity. And so the fall is always an opportunity to. To kind of wake up again. And I think that that's probably something in general, if we make that bigger in terms of, you know, watching certain patterns in society kind of, you know, fragment us and atomize us the way you said. Then that becomes an opportunity to."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":1168.18,"end":1168.58,"speaker":"Fr Christopher","text":"To."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":1168.58,"end":1189.86,"speaker":"Jonathan Pageau","text":"To do something. So it's like. It's also. It's almost like the. The problem of consciousness. In some ways, it's almost like the self consciousness of the fall leads to this breakdown, but then that can be recuperated into a higher state where it's not innocence. Right. Anymore, you're not innocent. You're. You actually have gone through and now you're reintegrating in a higher manner."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":1190.18,"end":1374.1,"speaker":"Fr Christopher","text":"That's beautiful. Yeah, well said. Well said. Well, I think that's. In some ways that's. Kierkegaard talks about that. And I think his entire concept of anxiety, like this sort of this dizziness, the vertigo of freedom, of waking up into the consciousness of sin, not as. Simply as a precondition, but as an infinite possibility that extends out in front of you. And so it's like you're perched on this precipice and you're swaying. And this sort of dizzying sense, the dizzying possibility of being able to sin again is something that can only be resolved by having to shift the orientation of your attention, right. From something egocentric to something that ultimately that grounds you out. And that's an incredibly difficult move to make. Because then here's a question for you because one of the things I find really interesting is that there's sort of. One of the ways in which I think the Socratic Platonic tradition interacts with the Christian tradition in a very interesting way and in some sense needs help from it, is that when we have that Socratic insight of waking up and getting a moment of lucidity where we. We catch ourselves in the act of the sin and we wake up from it. And we may wake up from it and have an insight in such a way that we can reform the relationship we have with whatever is dynamically attracting us and our attention. But I think one of the difficulties is that. That coming into consciousness, that moment of waking up, that Socratic kind of light bulb, there's an attendant guilt that immediately attaches itself to that. Right. So you were saying before, it's like when I come into a new form of life, a new way of seeing, a new kind of relationship with reality. It's such that whatever came before is now unthinkable to me. Right. I can't imagine how such a thing could ever have been tenable. But I think one of the problems is that then There is a second order sin, which is that I'm now despairing over the fact of having sinned. I'm despairing over the fact of having been guilty. I know that somehow the brokenness of the world is a consequence of the way that I framed my relationship to it. And there's something that's irrevocably lost as a consequence of my having failed to be myself by being in right relation with what's most real. And then that second order despair that, that sin, that guilt over the sin itself becomes something tremendously inhibitive. Because then it's almost as though. And a kind of weird sort of perverted Platonic problem. It's like the sin becomes the thing about reality that is most real. And that's like. That's a real problem. And I think that's one of the ways in which the sort of the Socratic tradition kind of comes to a point and it can't go any further."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":1374.5,"end":1374.98,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":1375.06,"end":1431.19,"speaker":"Fr Christopher","text":"As the Socratic tradition can induce the consciousness of sin, can wake you up, it can reorient your attention by forcing an aporia on you, but it doesn't necessarily have an answer to the largesse of guilt that you inherit because of waking up. And I think that's why, like, Kierkegaard talks about, you know, Christ as being both the pattern and also the redeemer, and that somehow you need both, because it's the redeemer that allows for the relief of the guilt, such that you can actually refocus and fashion your attention again. But that attendance, like after Covid, I think that's part of what happened. A bunch of people woke up, but they also found themselves with this debt of guilt of having broken themselves all that time that can't easily be erased. Anyway, I go on and on, but I'm just. I'm curious to know what you make of that problem. And because it strikes me as something that you've probably reckoned with."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":1431.35,"end":1455.52,"speaker":"Jonathan Pageau","text":"Yeah, no, I think you're right. And I think like you said, the image of Christ as both the shepherd, the redeemer, all this image, but also the judge at the same time. And I think that, that you could understand the Logos as having two hands. Right. We. We talk. I talked about, I talked about that when we were also in, in Thunder Bay."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":1455.84,"end":1456.16,"speaker":"Fr Christopher","text":"Right."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":1456.16,"end":1467.91,"speaker":"Jonathan Pageau","text":"The idea of the, of a hand which draws and a hand which pushes away and you know, because the Logos calls you. Right. It's like it's the point of light that's attracting you. It's the, the. It's the reason why you're doing things."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":1467.91,"end":1468.31,"speaker":"Fr Christopher","text":"It's."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":1468.39,"end":1587.75,"speaker":"Jonathan Pageau","text":"And then when you, when you sin, you feel the logos as a, as a judge, because then the distance between you and the logos now is appearing. It's like, it's like this thing is calling me forward. And now I do something which is not in line with, you know, it's, it's, it's a, it's missing the mark of where I'm going. And so now it exposes the distance between me and the, and the logos. But I think that that's why you kind of need both of those, that's in balance at the same time. Because if you, you know, you do need that wake up moment, but then you also need to feel the call. And I think that's also why, that's why, you know, love, it ends up being the main motor for the whole thing. You know that there's love, love coming from the log, from above, right? There's love coming from heaven that is drawing you up. And grace is maybe also the way, the Christian way to explain that. You know, it's like in some ways you are dependent on, on the logos more than. It's not the opposite. It's like it's actually the source of your life. And so it's the very fact that you can see it comes from it. Like, it, it draws you into it. So it, so, so that I think that first move, right, where it's not just, it's not just that I see this, you know, I see God. And now it's like, okay, well now roll my sleeves up and you know, and now suffer because it's like, I'm so, I'm so far. I have to go up the mountain. I have to, you know, the kind of, this kind of Sisyphus idea where it's like, all right, now roll the hill. Roll the ball up the, the hill. But I think that if you, I think when we understand the logos properly, there's actually something up on the top of that hill. Like, it's, there's something calling you. There's something drawing you into it, so it makes the weight light. You know, it's like that, that's what Christ says. It's like my, my yoke is, is light. You know, it because it, because it's, because it's actually moving towards more reality. And so you, you kind of are called by it."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":1587.83,"end":1673.16,"speaker":"Fr Christopher","text":"That's right. And then I think the question becomes, what does it take for the individual to train his ear to condition the receptivity to that Call. And maybe that's where kind of the. That maybe that's the really, properly speaking, the existential role of the suffering, which is that what it does is it. Because it, it exhausts the inward resourcefulness of your ego. It kind of leaves you with no choice, right? It makes you so. You're sort of so rent apart, you're so riven that it sort of sensitizes you, it disposes a kind of vulnerability that opens you to the possibility of being called forth by something outside of you. And I mean, right, because there's this. There's this idea, right, through the tradition of that you have to somehow sensitize yourself to the possibility of God's love. And it sounds so easy, but it really, really isn't. Especially when your own guilt becomes the measure of everything that's real about you. It becomes almost defiant and demoniacal in that sense. Like your ontological priorities actually favor the sin because for like these deep Platonic reasons, it just. Well, this seems to be more real than any possibility of goodness that could exceed it. I can't imagine such a thing."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":1673.16,"end":1733.62,"speaker":"Jonathan Pageau","text":"Yeah, I don't know. In the Platonic systems, if people have also develop the notion of this fractal, a fractal way of dealing with this, which is in the Bible, or at least what Christ's way presents it, or when you see it in our Father, which is forgive us our sins as we forgive those who sinned against us. And so this idea of practicing grace or practicing compassion is also a way to kind of enter into that past. If you can't, you can't see the way in which grace can pull you up, but then you can actually do that to others. And when you do it to others, you enter into the pattern. And I think that it makes it probably possible for kind of grace to act on you. Because it's like I'm seeing, you know, it's like I'm letting something go, right? Someone did something against me, I'm letting it go, I'm exercising grace. And so, you know, all of a sudden it becomes a possibility, it becomes transitive."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":1733.62,"end":1754.14,"speaker":"Fr Christopher","text":"It becomes. That's right. That's beautiful. Right? So that by participating on, on. In one aspect of the pattern, right, you, you actually. Yeah, it's. It's like you, it's like you invoke a belief in the capacity in. In being able to take on the opposite aspect to the one that actually acting out, right."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":1754.14,"end":1772.72,"speaker":"Jonathan Pageau","text":"And people, People have to be careful. They don't. It's not like, it's not Like a. It's not like a transaction, right. It's not like, okay, well I'm going to, I'm going to do this for others from that. It's rather just embodying something. And by embodying it then you part. You are necessarily participating in it."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":1772.72,"end":1774.36,"speaker":"Fr Christopher","text":"It's like being related to it, I think is."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":1774.36,"end":1775.16,"speaker":"Jonathan Pageau","text":"Yeah, there you go."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":1775.16,"end":1822.42,"speaker":"Fr Christopher","text":"It's like you enter whatever side of the relation you happen to be on. Right. If it's analogized as it. Right. Because it's the same ultimately a fractal of the same pattern. You're ultimately relating yourself in the pattern in such a way that you're assuming a role within it. But that also means that the part in the pattern that you play plays host to the whole of the pattern, which is what makes it by definition symbolic. Right. When the part presences the whole. And so it's. It's almost as though because you're embodying somehow the whole of the pattern and the part that you play within it. There's. There kind of inculcates a belief and not a belief in the propositional sense, but like a belief and an enacted a sensitization to that pattern that allows you to turn in. In. In the opposite direction and see it on a different scale."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":1822.66,"end":1904.38,"speaker":"Jonathan Pageau","text":"And I think there's also like a. There's also the reverse to that. And no, but I think it's not, like I said, it's not a system. We have to be careful because we can always find counter examples of this. But I have noticed, for example, that let's say, let's say people who are capable of engaging in, let's say in generosity and a kind of giving of themselves and a capacity to, let's say also try to find the good in others in their first response, ultimately end up often being also surrounded by that. That is that it actually grows. And they do end up attracting people that have that goodness. And so often people end up living in a world that's more full of goodness and the opposite is true as well. People who, who let's say act, let's say dishonestly towards the people around them at some point start to also attract that from the people that interact with them. And so they end up in a world of mistrust, both the way they act, but also what they receive from the world. And so there's actually like a. So people can actually inhabit, like really can have a different world just by the way they act and the. What they see as how would they prioritize and how they act, not just in what they do, but when, what they receive. I don't. I can't explain it scientifically, but it's definitely something. No, but that I've noticed."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":1904.62,"end":1980.47,"speaker":"Fr Christopher","text":"Yeah, I'm with you. I'm with you. I notice it too. I think. I think once you. Once you have eyes on it, like once. I mean, that's like what we were talking about before. Once you begin. Once you begin to pick up these patterns, they're pretty hard to mistake. And I think that's why. I mean, that's why people are so that. I think that's why, in part, people are so responsive to the work that you do is because once they take this kind of. Once they take the idea of these sort of mythic structures and they start to put them like a stencil, to drop them down into their own ways of living. It's amazing the way that they synchronize and. And then what's so fascinating about that is that becoming conscious of the way that they're synchronizing invites a participation in them that is more credulous and more faithful. Because suddenly I don't need convincing of the fruitfulness of doing this. It's just. It's obvious, right? And it's obvious on a level that is embodied, right? It's very visceral and drawn into it by virtue of having noticed it in such a way that I realize I'm already in a relationship to it. For better or for worse, or maybe for both at once."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":1981.35,"end":2107.49,"speaker":"Jonathan Pageau","text":"No, I can see it in the sense that sometimes I imagine myself, you know, like as a. As a peasant, let's say a Russian peasant in the 19th century. And how, let's say, the patterns in which people were living were so naive. They were true. A lot of them were true and were real, but they were very innocent. And so in some ways, they were very much in danger. And so when, you know, when the materialist, kind of secularist narrative comes in, people get crushed. And I saw that even when I was young, I would see people. People with a kind of naive faith, a very confident but naive faith, and then they would go to university, and then they would just get crushed, and they would go to their first philosophy class and they would just be completely demolished because they had never heard anything like this and never heard any of these arguments. They never thought about any of these things, and they would end their university. You know, in Quebec, we. We had the thing called cejep, and they had philosophy classes in cep, and I think those Philosophy classes were even just designed to like, slash the Catholicism out of all the Quebecers that went through that in the 60s, in the. In the 70s, when they were installed. And it worked. Like, it totally worked because people came in, these naive little churchgoers, and then we're completely destroyed. But what's interesting. So now we go through this loop and now we come to, let's say, this, this movement, this kind of. This more this symbolic understanding, people kind of re. Understanding the role of perception, of attention and how it shapes our narratives, how it shapes the way that reality manifests itself. And once people have gone through that, that, that, let's say, that training, what are you going to. How are you going to take that from them? Like, how are those philosophy professors going to take that away from them? I don't think it's possible anymore. Like I always say, it's like. I don't. There's nothing you could tell me. I don't. I mean, maybe. I don't know. I don't. I feel like I've heard it all. Like, I feel like. What is it that you're going to tell me that you're going to convince me back into that old world? I don't see it happening."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":2107.57,"end":2174.29,"speaker":"Fr Christopher","text":"I don't see it happening either. I think it's. I mean, it's a big statement to say it's impossible, but it feels impossible. It feels impossible because what you're reintroduced, what we're talking about is the reintroduction of a kind of contact epistemology. And by definition, like in virtue of its very nature, it can't be unwound by any kind of propositional response. And it's at that level that all of this. These institutions and these sort of. These sort of trenchant mentalities are operating. Right? I mean, that's one of the reasons why they're so viscerally unsatisfying after a period of time. Because it's. I mean, that dissatisfact, Socratic dissatisfaction with the proposition is precisely what's divesting us from those institutions in the first place. And so when we make contact with something that is real in virtue of the contact itself, I don't think there's any amount of debate that can necessarily uproot it. I don't know. I mean, it depends, I guess it just. It's a matter. I mean, I'm talking in."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":2174.61,"end":2189.65,"speaker":"Jonathan Pageau","text":"But you could. I mean, there'll be. There'll be debates about the details. There'll be debates about. About the formulations. There'll be. All these debates will happen, but the fundamental shift that happens, that you can't. You won't. I don't think it'll be very difficult to debate that."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":2189.98,"end":2309.65,"speaker":"Fr Christopher","text":"That's it. That's it. And when you. Because when you take it on, especially when you take it on in the inward mythos of your psyche, when you start to realize that your very way of thinking is actually populated with these patterns and you start to trace them out in the most personal of ways that can't but induce a kind of faithfulness, an attention toward the relationship that is being organized by all of these things. I think that's why, like, you know, Jung had that famous interview at the end of his life when someone said, you know, do you believe in God? And he sort of. He goes, I. I know I don't need to believe. You know what I mean? Like, I. I'm. The way I. My. My contact with reality is such that these kinds of questions, the way that they're framed, are kind of irrelevant now. Not in a. Not in a. Not in a, you know, not in a sanctimonious way, but just somehow. Somehow the way the relationship that I have with the world has exceeded the scope in which these kinds of questions are relevant anymore. And I think there's a kind of anti. I think certain people, when they go to university, I mean, even at the very beginning of their careers, when they're students, there's almost something anticipatory about that. I mean, I found this. I mean, I started taking philosophy as an undergraduate, and I just. I. I went into it thinking that I loved it and that it was going to be so deeply satisfying. And within a couple of sessions, I. I was. I. I had enough, right, Because. Because it was. It had nothing to do with the embodiment of wisdom. It had nothing to do with personal orientation that had no existential import. Right. And I think that because of that. Because of that, I think its capacity to sink its hooks into people, I think is pretty dulled. Pretty dulled, maybe necessarily so."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":2309.81,"end":2317.25,"speaker":"Jonathan Pageau","text":"And so how do you see that on your own path? Let's say, how are you integrating these changes in your own?"}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":2317.49,"end":2511.05,"speaker":"Fr Christopher","text":"Yeah, that's a good question. I think I'm at a point now, I struggled with that. I've struggled with that for a long time because I had this sort of. I had this sort of eros for philosophy that couldn't quite consummate itself within the scholarly context. Which is not to say there's nothing. That context isn't valuable on its own. Terms, it definitely is. I just found that I couldn't somehow. The relationship, you know, it's sort of like when you meet someone and you look at them, you go, I'd really like to, like, we're going to be friends. And then you. And you try and it's just. The friendship just doesn't. It just doesn't happen. It just doesn't bloom. And you want it to. That's. We're going to be friends. But you can't force friendship, right? Or any kind of relationship. So the relationship just didn't catch the fire. Just didn't catch. And so I was. Yeah, I was left pretty. I was left. I was left dizzy and I was left wandering. And I mean, meeting John was, I think, pivotal for me in that I discovered that the thing that I thought philosophy was actually was there was a reality to it now I found a corresponding reference to it, right. Someone who did that, which I thought it always was. And, you know, that before and after effect that we were talking about before of coming into understanding things, the organization of things in a different way happened to me as a consequence of that relationship and still does. But how to translate that love and that point of contact into something more concrete, that's still. That question, I think, is still very difficult, to be honest. That's one of the things that I really. I was going to say this, like, I'm quite inspired by the work that you do for that reason, because I think that you have found a way, a very ancient way of. I mean, I took semiotics, right? That was actually the program. My prime main program of study was in semiotics. And I got bored with that too, because it was pretty much all French structuralism and post structuralism and, you know, enough said. But it's interesting to me that what you're doing is you're sort of. You're. You're actually. You're a kind of a working semiotician in some sense, right? You're. You're taking it upon yourself to kind of transliterate the structures that are implicit in things into their symbolic language and to translate it into a language that makes it intelligible for people. And you found a way to do that without needing to root it in the overtly academic enterprise or the overtly scholarly enterprise. And that, for me, is a. That's a very significant thing. Like, that's a very rare thing. And I find that very elusive. So anyway, this is all to say it's. It's. I think it's an unfolding story I think I'm getting closer. It took a long, it took a long time of. It's been gestating for a while. But I think, I think in consonance with everything that we're talking about, of this sort of, this, this sense of synchronization that's happening, that things are gathering together, I feel that also on a personal scale that makes the possibility thereof seem much more viable now than it has ever seemed before."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":2512.01,"end":2523.85,"speaker":"Jonathan Pageau","text":"So are you are attached to academia? Are you, are you involved? I don't know what you're. No, you're not at all. So you're not. I thought you were involved in University of Toronto with John, like that you were somehow involved. No. Okay."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":2523.85,"end":2643.68,"speaker":"Fr Christopher","text":"No, no, I'm not. I'm not. No. I mean, I was always, it was always. It was sort of a foregone conclusion to me that I would take that route, but I just, I just didn't. I sort of. I finished my first degree and I was, I didn't. I didn't have a concrete sense of how I fit in to that world. Like, I. There were sort of some logistical issues, some administrative issues. Like, I was so eclectic in my studies that I didn't really focus and specialize in such a way that made possible a particular course or a particular path. I did a lot of wandering. I mean, one of the reasons that I took to John and why we took to each other is because he found a home in that eclecticism and as a way of integrating it together, that spoke to me and resonated with me. But when you translate that into, you know, the bodies of universities and how to fit into that body and be part of that body and participate in it, to use your, your use of body, that was much more of a difficult question. So I deferred, I deferred the question. I deferred it. I deferred it and I deferred it and I deferred it and I just kept deferring it. Sort of like a long term extended deferral of the question of what to do about that. Yeah, still an open question, but yeah, I'm starting to gather that together again. I think the next couple of years are going to be, are going to be pivotal. But. Yeah, but I needed a long period, I think, to figure out like there was some, some kind of weird essentialism in my mind about taking that route. That's because it's the only, it's the only proffer into which this kind of work in the world. That, in the way that the world is kind of configured right now. I just sort of had a narrative. A narrative that that's where it would have to be. And it took a while, embarrassingly long time, really, to kind of realize that that narrative was not as essential as I had always believed it to be."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":2644.11,"end":2644.43,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":2644.83,"end":2693.69,"speaker":"Fr Christopher","text":"And I mean, that's one of the reasons I appreciate your work and I appreciate other folks who have decided, no, I'm going to do this work, I'm going to take this enterprise, but I don't need any of that structure in order to make it real. I don't need to be a scholar to be a philosopher. This scaffolding is important and valuable, but it's not necessary in the sense that I think I always believed it was. And it's hard to do away with a belief like that. Right. Because a belief like that is not just a propositional belief. It's a premise of the world. It's a premise of the way the world functions. And so to dig down and uproot a belief like that, the entire vision of the world needs to change first."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":2693.93,"end":2694.41,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":2694.81,"end":2695.13,"speaker":"Fr Christopher","text":"Right."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":2695.13,"end":2754.16,"speaker":"Jonathan Pageau","text":"Yeah. It's funny because I think. I'm not sure what year it was. I think it was 2014. 2014, maybe 2013. 2014. I'm not sure exactly. But I was trying to kind of make it as an icon carver. And I. I was contacted by the head of. Of the Yale Divinity School, I guess, and they wanted people to apply to their. This fellowship they had, which was like an art fellowship or something. And I applied to the fellowship and I wrote my proposition of what it is that I wanted to do, and then I didn't get in, you know, obviously. But it was funny because when I think about that proposition now, it's pretty much what I'm doing now. It's just everything that I'm doing now. And I understand why they didn't accept it, because it was like, I'm supposed to be an icon cover, but then I'm talking about symbolism, and I'm talking about, like, understanding iconography as, like, symbolic pattern for reality. And, like, I like to talk about that and like to interpret stories, and I'd like to continue my carving at the same time."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":2754.16,"end":2754.48,"speaker":"Fr Christopher","text":"And."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":2754.48,"end":2806.12,"speaker":"Jonathan Pageau","text":"And it's just hilarious that, at least in my case, it feels like somehow that formulation was like a weird seed that I was kind of planting somewhere, you know, throwing out into the world. And then. Then it happened without the Academy. And probably better. I think, in my case, it's because I have the freedom to not follow the structures like it's pretty heavy, I find, like that what academia asks of you to be able to say something is quite heavy in terms of what it. What it requires. You know, the whole model of citation and the whole model of. Of also fitting it into these very, very, very precise research projects that are becoming more and more precise, you know, as time goes on. Because it's like you have to kind of find your little niche. And that's why it's astounding that. That someone like John is able to even do what he does like that. That he's able to find. But I think he suffered also."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":2806.36,"end":2807.6,"speaker":"Fr Christopher","text":"He's a rare bird. I mean."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":2807.6,"end":2807.96,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":2808.34,"end":2810.38,"speaker":"Fr Christopher","text":"And. And he has suffered for it, for sure."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":2810.38,"end":2838.84,"speaker":"Jonathan Pageau","text":"Yeah. He hasn't been able to find that. What do they call it? The. The. The Right. The path in the university, too, to. To. To. You know, it took a long time for him to be able to find his place, so. But it's also frightening to do it outside of the academy because you have that problem. Like, I have that problem. I find it funny. I love it, actually. I kind of. I kind of have a perverse pleasure when someone tries to introduce me. It's always. It's always because it's funny."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":2838.84,"end":2864.48,"speaker":"Fr Christopher","text":"I have the same problem. I have the same problem not laboring under a particular occupational identity. You end up. You're in this weird intercategorical space. It's like, what am I? I don't know. I'm me. But what is that? And I know I can. I've noticed that. And I've noticed your sort of ironic smirk every time someone introduces you in a way that's. You somehow became a monk in Thunder Bay."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":2865.01,"end":2887.09,"speaker":"Jonathan Pageau","text":"Oh, yeah. Yeah. Or like the. I mean, I love it. Even Jordan always. I said, he's a Russian. He's a Russian, French Canadian, Russian Orthodox icon carver. And I'm just like, that's hilarious. You know, you need to add a few more things to that to make it even more confusing because obviously that's. It's like, the fact that people even say that I'm an icon carver now is just hilarious because it's obviously not true anymore. I mean, it's very."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":2887.49,"end":2908.04,"speaker":"Fr Christopher","text":"But maybe people are detecting that. Like, I mean, if we think about it in proper symbolic terms, icon carving is in some sense what you are doing in your video, right. You are rendering a moving image of a symbolic pattern such that people can face it face to face and apprehend it. And so in some sense, if we. If we just."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":2908.2,"end":2909.24,"speaker":"Jonathan Pageau","text":"Yeah, that's interesting."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":2909.4,"end":2955.61,"speaker":"Fr Christopher","text":"Right? If we extend the reference. I actually think that the title as presented is pretty apt. It just requires a little bit of imagination. But, you know, being a topos in the way that you are, I think is actually quite helpful because I think it allows you to straddle like, it allows you a certain amount of mobility at a time when that kind of being able to migrate across these worlds and domains is part of the project of transliterating their respective grammars and the way that you're actually doing. So it's like one. That's what I want. That's what I find so interesting about what you're doing, is that somehow the presentation of your title and the nature of the work are somehow. There's a. There's a continuity there of some kind that is, I think, important if I can be so."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":2955.61,"end":2967.85,"speaker":"Jonathan Pageau","text":"No, that's it. I never. It's funny that when you said it, I never thought about that. But. But I'll have to even take more joy in the. In the icon carver designation from now on because."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":2967.93,"end":2969.49,"speaker":"Fr Christopher","text":"Yeah, yeah, yeah."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":2969.49,"end":2971.57,"speaker":"Jonathan Pageau","text":"It's happening in many levels. You know, something like that."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":2971.57,"end":2987.8,"speaker":"Fr Christopher","text":"Yeah, totally. I truly think so. I truly think so. And. And maybe that's one of the things that. I don't know how conscious Jordan Peterson is when he sort of equivocates on your title, but maybe there's some. He has some sense of that, too. I don't."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":2987.8,"end":2989,"speaker":"Jonathan Pageau","text":"Maybe that's funny."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":2989.08,"end":2990.36,"speaker":"Fr Christopher","text":"I don't know. I don't know."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":2990.68,"end":2991.68,"speaker":"Jonathan Pageau","text":"And so what do you."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":2991.68,"end":2992.56,"speaker":"Fr Christopher","text":"What do you. Are."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":2992.56,"end":2996.28,"speaker":"Jonathan Pageau","text":"What are you working on now? Like what. What are the things that are drawing your attention?"}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":2996.68,"end":3008.72,"speaker":"Fr Christopher","text":"Yeah, so, I mean, I'm working on a few different projects with John. I'm. I've come on as another author. His Awakening from the Meaning Crisis lecture series is being turned into a book."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":3008.8,"end":3009.28,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":3009.92,"end":3076.98,"speaker":"Fr Christopher","text":"So I'm on that project that's like taking up a big chunk of my time right now is basically. I've come on as another author to basically just, you know, to work on that and to. Because it's not right. They're very. A lecture series and a book are just. They're very, very different beasts and they require a different, you know, a different set of tools. And so. So that's what I'm working on right now. We're also doing this Dialogos project in Many Dirt. There's going to be a monograph I think we're going to work on. But there's also this course that we're. We've pulled together with Guy Sengstock, and it's it's still. I would say we've done about four iterations of it now, and it's going very well. And it's still very tentative. We're trying to be cautious about, you know, because this is. I mean, it's very old, but it's also very new at the same time. And so we're really just trying to play with different iterations of it, formulating this method in different ways, kind of trying it out. It's a very. I think it's kind of a playful process right now of just seeing, like, what happens, what happens when we do this, what happens when we gather a bunch of people together to undertake this practice."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":3077.3,"end":3080.34,"speaker":"Jonathan Pageau","text":"This is a circling, like would be a class on circling."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":3080.5,"end":3101.68,"speaker":"Fr Christopher","text":"It's circling. The DNA of circling is in it for sure. But it's really is a kind of way of simulating and recreating a Socratic dialogue. I have to be careful when I use these terms, which is because Socratic, like there are so many codified versions of Socratic dialogue now, and they have their trademarks and whatnot."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":3101.68,"end":3102.12,"speaker":"Jonathan Pageau","text":"Okay."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":3102.12,"end":3241.28,"speaker":"Fr Christopher","text":"Really? Yeah, yeah. I mean, when I think of it, I just think of Plato's dialogues. I don't think in a codified sense, but the idea is of taking a virtue, putting it at the center of a dialectical process. And there's a little bit of circling technique in there as well. And basically taking that a dialectical structure and trying to build it on itself so that it actually turns into dialogos. Right. So that the process of kneading and molding and co creating a definition of virtue becomes a way of developing a relationship with that virtue. Right. So the proposition of the virtue. Right. The proposed definition is. Is kind of. It has no propositional value per se. All it really is, is a kind of. Is basically a log on the fire to kind of get. To get it going. And anyway, so we're sort of playing around with this. And so far it's going very well. So far it actually seems to be reliably producing. I'm always very careful about this because there's something about the spontaneous nature of dialogos when it happens. This idea that there's a kind of anamnesis at work, right. That somehow the way that we're relating to each other is triangulating to a way of. Of communing with the patterns that are. And sort of that. That gathering together of different aspects of something, whether it be a person or a virtue, is something that when done between two people with their attention fixed in the middle and fixed on the unfolding of that relationship has something to do with opening to the gathering of that pattern and allowing something to take shape in recollection, such that we seem to discover something and to create it at the same time. And so really, I think what Dialogos is, properly speaking is it's a way of generating a symbolic process of drawing forth logos and tracing it out and following it. And that's. I mean, speaking that way is tricky because it sounds awfully highfalutin, but it's really just a way of using dialogue and the knowing of one another to create a way of knowing between ourselves, a way of conducting something."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":3241.44,"end":3248.88,"speaker":"Jonathan Pageau","text":"Yeah. And of end of, let's say, realizing that the whole is more than the parts. Just having that experience in with someone."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":3249.36,"end":3338.54,"speaker":"Fr Christopher","text":"Exactly. Using the part, whether really the part of a virtue or. Or one aspect of a person to host and presence the movement from the part to the whole. Right. A Bono centric movement. Right. A movement toward the good. And that movement has something to do with being able to take that one aspect or one part and use it as a host, as a relationship with whatever is behind it and beyond it. And so you kind of move from the propositional domain into something far more visceral, far more participatory and far more spontaneous than a kind of formal. The formal structure of the dialectic is really just like I said, it's sort of the logs on the fire, you know, it's a means to an end, really. So anyway, so that project is kind of ongoing and I don't know yet what that will become. In some ways, very much like any given Dialogos, it kind of. It is gathering kind of of its own accord. And each time it seems to get a little tighter each time we refine it a little more and its future is open. I think we want to be cautious about it, but at the same time there seems to be great promise in it. So anyway, so those are the sort of the things I'm doing with John. And I've got some writing projects of my own that are always deferred but that at some point I need to get to. So we'll see. It's an exciting time, though. There's quite a lot happening. It's hard to keep together at once, which is a problem I'm sure you have too."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":3339.37,"end":3340.49,"speaker":"Jonathan Pageau","text":"Yeah, I just. I'm also."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":3340.89,"end":3341.57,"speaker":"Fr Christopher","text":"I have a."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":3341.57,"end":3527.19,"speaker":"Jonathan Pageau","text":"Let's say because I also have this more artistic aspect, I tend to have to dec. I'm trying to decide now what. Because I let's say I have the possibility of maybe writing a book that would be more like a presentation of the symbolic world, you know, just like a non fiction book. But then I also really want to write fairy tales. And so I. It's. So the fairy tales are winning. I'm sorry for anybody, you know, who, who might have wanted me to do the other one. Fairy tales are definitely winning and I'm way more excited about writing fairy tales than I am about the other stuff. So. So that's been taking up. That's actually kind of taking up my horizon right now, which is. I have this intuition. Well, I called it apocalyptic storytelling. It sounds a little weird, but it's about, there's something that happened. It's about, it's a little bit about taking the postmodernism that has just happened and let's say trying to reconsolidate it into something which offers a higher insight. So one of the aspects of postmodern storytelling is something like collage. It's like there's a collage aspect to postmodern storytelling and it finds itself, you know, a simple example of that is like the Marvel universe, right? So you have all these independent characters that, that coexist and then people will paste them together to create more interesting attention and their qualities will be brought. Will kind of smash together to kind of create these, these crossovers people call them, right? So, so that's actually really a kind of a postmodern type of storytelling. And then people started doing it in different ways. They did it with fairy tales quite a bit. So you have things like Shrek into the woods, you had something called Fables, this whole comic book series where they took all these comic. They took all these fairy tale characters and they would throw them together into a story and a story that was usually quite dark and cynical and would kind of expose the underlying supposedly power structure than political patterns that the fairy tales are made of. And it was, it's actually quite a successful form of storytelling because it's, it can be, it can give you those insight moments. Even though they're rather dark insights, they can give you insights about that. So what I want to do is to turn that back, to flip it back where like I'm going to actually take all these characters, fairy tale characters also kind of smash them together, but use one to reveal more insight about what the other is instead of, but insight not in terms of just political power and that kind of raw stuff that's at the bottom, but rather a higher insight about how reality works. And so it's like, you know, can I use. And then can I use. Let's say, can I use Snow White to help you understand what the fall of Adam and Eve is? Without mentioning the fall of Adam and Eve, like, without saying anything about the Bible, but just saying what's. Like, there's that apple, there's that temptation, there's that. Like, what is. What is it? Is there a relationship between the two? So I've been doing that with some. I'm not writing the third one."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":3527.82,"end":3527.98,"speaker":"Fr Christopher","text":"And."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":3527.98,"end":3576.74,"speaker":"Jonathan Pageau","text":"And. And it's been so exciting for me because it's like the stories, for example, like, I'm writing Jack and the Beanstalk now. And. And it's like, I've loved that story since I was a kid, but there's been aspects about that that have been bothering me since I was a kid. Like, why is he. The main character, Jack, is a thief, basically. He's a trickster and a thief. Like, what is he doing? And like, why is he stealing these things from the giants? And, like, what's going on in that story? What the hell is going on? And so I actually feel like I. By writing them, I feel like I've gained massive insights into these stories. And so I'm really excited to kind of bring people along into these fairy tales and kind of surprise them and hope they can have higher insights about what these stories are about. So anyways, that's what exciting me right now. It's like, if I could, that's probably all I would do is just write these fairy tales."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":3577.06,"end":3601.77,"speaker":"Fr Christopher","text":"Oh, what a great project. Well, I love that it seems to be a project that's kind of saturated in a. Kind of. And there's like a winking irony that I'm hearing about it because you're sort of. You're trying. It's like a project of infiltrating. Yeah. Cultural myth that has been fractured by a particular ideological infection and working within the fragmentation to regather it and find the hidden harmony again."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":3602.09,"end":3603.65,"speaker":"Jonathan Pageau","text":"Yeah. But also. Also it's like."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":3603.65,"end":3611.19,"speaker":"Fr Christopher","text":"And not doing it. Something about, like an artistic restoration that I'm hearing that's also has a higher telos to it."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":3611.35,"end":3662.84,"speaker":"Jonathan Pageau","text":"So you. Can you think about it, like, if you think about, like, a lot of the fairy tales, you know, you can see it, like, people will say it's like, oh, those fairy tales, like Sleeping Beauty, you know, it's about puberty and it's about sex and it's about, like, menstruation. It's about all these things. And then all the conservatives like, no, no, no, no. It's just an innocent story that's just about like a girl falling asleep and a prince. And I'm like, you know what? Yeah, it is about that stuff and I'm going to show you what it means. Like, I'm going to. I'm going to. I'm going to dive in and I'm going to tell you a story that an adult will read at an adult level and will see all the insights and a child will still be able to read at the child level and completely. Like, it'll be fine for them. Like, it won't. It won't also scandalize them or, or let's say, ruin their childhood. But it's like I can tell the story in a way that a grown up will read it and go, oh, my goodness. Oh, really?"}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":3663.18,"end":3663.54,"speaker":"Fr Christopher","text":"Okay."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":3663.54,"end":3668.86,"speaker":"Jonathan Pageau","text":"And it's like, because you see that in things like Shrek where there's all these dirty jokes and Shrek, lots of innuendo."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":3668.86,"end":3669.22,"speaker":"Fr Christopher","text":"Yeah."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":3669.22,"end":3685.34,"speaker":"Jonathan Pageau","text":"But it's like, I'm going to say, like, I'm not going to do it just, just to like, make you feel like you're a grown up with your little dirty humor. It's like, I want you to understand more about the deep aspects of, of what these symbols are about. So, yes, I'm super excited. It's like, it's probably the thing that excites me the most."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":3685.58,"end":3720.51,"speaker":"Fr Christopher","text":"Oh, that is exciting. Well, because it also gives you an opportunity that's like. I kind of had this experience when we were doing the zombies in Western culture when I was working with John and Phil on zombies. One of the things I found so interesting is that so many of the attributions, the mythic undertones that people proposed as really the real. And I know you did a video on that topic too a little while back, that so many of the explanations that are presented and proposed as accounting for that myth are true. They're just not comprehensive."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":3720.83,"end":3721.19,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":3721.19,"end":3763.57,"speaker":"Fr Christopher","text":"They're just not sufficient. It's like, well, it's a critique of capitalism. It's like, well, yeah, but keep following the sand. Right? It's like capital, you know, it's like, yes, consumerism is itself a symptom of something else that is the real object of the, of the myth. Right. So it's almost like a lot of these ideological interpretations of the moment. They'll find an aspect or a dimension that is true and real. It's just not sufficiently true and sufficiently real. So being able to. Being able to kind of weave your way through some of Those things that are proposed, but to follow them a little bit deeper that. What a worthwhile project. That's kind of what I'm hearing a little bit. And what."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":3763.57,"end":3794.84,"speaker":"Jonathan Pageau","text":"And doing it in story form, like, I think that's what's exciting. It's. You know, I keep saying it's like there could be, let's say in terms of the zombie story, like, once you realize the zombie story, like there could be ways to now tell a zombie story. That would not be theoretical. There would be no. There would be no explanations in it. But that would just dive back into it with the insight we have and tell a deeper, more profound zombie story and maybe even propose a solution. Because one of the problem with the zombie story is that there's never a solution."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":3795,"end":3796.04,"speaker":"Fr Christopher","text":"No, by definition."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":3796.28,"end":3812.64,"speaker":"Jonathan Pageau","text":"By definition. But maybe there could be an interesting, like, solution that would be taken from within the mythological frame and not, not, not, not something just dropped in, but like within the very logic of the, of the story that there could be an insight that could be."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":3812.64,"end":3819.6,"speaker":"Fr Christopher","text":"Right. Right. Some component that signifies the restoration of the pattern version is actually being played out."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":3820.16,"end":3836.05,"speaker":"Jonathan Pageau","text":"Yeah, I think so. I think that, that at least, at least for me, I think that's what it's like. It's also because I've been talking about this stuff for. For now, I guess, five, six years, and it's like now I also have to do it. Like, I, you know, it's like I, I have to show that it's not just about interpreting stories. We gotta write better stories."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":3836.21,"end":3909.71,"speaker":"Fr Christopher","text":"But here's the thing. Okay, so let me ask you this, though, because this is fascinating, but the kind of, the kind of. The kind of skill it takes to interpret a story and the kind of skill it takes to write a story I think of as very different skills. Because when you're undertaking an analysis, a kind of careful structural analysis of a pattern of a story, as you do so well, you know, you're. It's. There's a. There's a. It's a. It's a very, very conscious, very meticulous, very, very kind of. There's a lot of conscious attention being brought to bear on breaking apart its components in order to put them back together again. There's a real analytical frame of mind that you have to be in in order to do that. But when you're creating something artistically, it seems to me like, at least with. In my own experience, it seems to me that you have to yield. In order to actually produce something of artistic, Artistic merit, you need to yield the process A certain amount of that process to the unconscious. Like if it's not spontaneous, if it's too over determined by a conscious analytical process, I think it will fail. Some of it has to be very. There's has to be an unconscious movement toward the creation of something. So how do you, like, how does that work for you? How does that tension work for you?"}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":3909.71,"end":3922.89,"speaker":"Jonathan Pageau","text":"Yeah, it's. I think, at least for me, it's. It's just two different spaces, right. It's completely misapplied. But I think, still, I think it's the work. So the Christ says that the, you know, that the right. That the left hand should not know what the right hand is doing."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":3922.97,"end":3923.37,"speaker":"Fr Christopher","text":"Right."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":3923.37,"end":3940.33,"speaker":"Jonathan Pageau","text":"Some ways there's a sense in which you. Like I always tell people to it. Like when people are writing stories, I always tell them, it's like, don't think about symbolism when you're writing a story. It'll kill it. Like, you can't think about symbolic structures when you're writing. You should never do that. No, no."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":3940.33,"end":3941.67,"speaker":"Fr Christopher","text":"Because then you'll fail them. Right?"}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":3941.67,"end":3984.75,"speaker":"Jonathan Pageau","text":"You totally fail. Like, you'll fail in every way. Like, you'll just, you'll overthink it. You'll try to fit things in that don't fit in the, in the thrust of the narrative. There's all these things you'll end up doing. I think what the way to do it is you have to ruminate. Like, you'll see, you ruminate on. On the patterns. You just kind of let them sit. Like, almost like. Almost like, you know, they're fermenting and you're in yourself. And then that becomes the. The wine out of which the story can be told. But it's not. Now, it's not a. It's not a system. It's not a structure. It's none of that. It's just. Just this intuition. And then the. What you can do, the way that I do it, at least myself is that like the intuition comes for the story. Then. Then it's like, oh yeah, that story and."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":3984.75,"end":3985.95,"speaker":"Fr Christopher","text":"Or that, that."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":3985.95,"end":4012.8,"speaker":"Jonathan Pageau","text":"Those elements. And then once you put them down, then you can come back with the symbolic mind. And then you. The symbolic mind is like an editor. Then you come back and you're like, oh, you don't. First, you have to be careful with that editor. But you can shift a few things. Like you can change a few words and say, oh, if I tweak this word, then it's actually kind of more in the direction of what I want. But the actual elements of the story Come from a more immediate. More immediate thing."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":4013.12,"end":4090.4,"speaker":"Fr Christopher","text":"Right, right. So it's almost like you. I mean, you have. So you have all of this rumination that has taken place because of all of the deep ways in which you've been contemplating all of this over the course of time. But then in some sense, there's a kind of divine forgetfulness that you have to have. It's like, I think. I think of the way that really good performers, like really good actors or musicians kind of describe their process, which is that they stay. They are as studious as they can possibly be for as long as they can possibly be. And when. Then when the time comes to perform, they do their very best to throw everything out. Yeah. Forget. They, they, they. They. They find it in them to forget everything it is that they know in order for something, a deeper form of recollection to take place. Right. It's a kind of a paradox. Right. You need to have a kind of forgetfulness in order for the anamnesis to actually happen. And that's what I'm kind of hearing from you. It's like you. You've done all of this work, but then in some sense you have to take it as. I'm thinking of your. I'm thinking of your left and right hands again. Right. That the logos of judgment that takes has to yield itself to the eros of generosity that gives. And that there has to be something, a coordinated withdrawal in order for something to actually be brought forth."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":4090.64,"end":4101.96,"speaker":"Jonathan Pageau","text":"Yeah, I think you've got it right. But I do think it is strange, you're right, that usually it's rare that you find. Usually you have critics and you have artists."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":4101.96,"end":4102.16,"speaker":"Fr Christopher","text":"Right."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":4102.16,"end":4120.72,"speaker":"Jonathan Pageau","text":"You don't have both at the same time, you know? And so it's a strange thing. I don't know. Like, I don't totally understand it. And it's possible maybe, that also my art suffers. We'll see. We'll see. When people would judge them, like the story that I write might suffer for my. For my overthinking. But, you know, at least for now, I'm really excited about them. Like, I'm excited about writing them."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":4120.72,"end":4151.58,"speaker":"Fr Christopher","text":"So I think if it's happening, I think if it feels like it's happening with a certain amount of spontaneous energy, then that to me is a sure sign that somehow has the right bearing. Right. Because you kind of know the difference, Right. When you're caught in a flow and something is writing itself through you. Right. When you have the sensation that you're simply the vehicle for something to produce Itself, I think that's a testament to something that's a more genuine artistic process. But when you're trying to have this sort of overweening consciousness that's trying to master."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":4151.58,"end":4201.82,"speaker":"Jonathan Pageau","text":"Yeah. I think a way to explain it, at least, is that, let's say it's like if I'm meditating on writing a story or making an image, the insight will present itself in this. In story form, right? It'll present itself as elements of the story. It won't present itself as a structure that I'm trying to impose on the store. So it's the same with an image. Like I'm trying to figure out an image, then the insight will present itself as an element in the image. And so I think that also helps like just that, like to just remain within the world. I think that helps so to not be in danger of trying to just impose the symbolic structure almost arbitrarily over. Over a story. And you see it like there's Hollywood movies where, you know, they take the hero's journey or whatever, and they apply it so formulaically that it's just. It's actually becomes unbearable to watch."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":4202.22,"end":4210.94,"speaker":"Fr Christopher","text":"So broad. It lacks the very specificity that is able to presence a symbolic pattern, right? Because it's only with absolute specificity that that can actually happen."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":4211.37,"end":4232.81,"speaker":"Jonathan Pageau","text":"There's also a kind of messiness, you know, because let's say the hero's journey, it never exists. Purely. It doesn't exist. It's like you can you look at these very complex and. And stories that have all these twists and turns and. And strangeness to them, and then you're like, oh, you look. You look at 10. You know, you look at 50 of them and he's like, oh, well, they hears this. Sorry. Here's this, like, basic pattern, right?"}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":4232.81,"end":4233.17,"speaker":"Fr Christopher","text":"It's."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":4233.17,"end":4251,"speaker":"Jonathan Pageau","text":"It's real, it's true, it's there. But, you know, that's not the story. Like, the story has a greediness to it and has a. You know, and embodied into it. So you can't. You can't just now say, well, I'm going to apply this pattern back onto the world completely. And it just. That's what that yields, really."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":4251.24,"end":4419.94,"speaker":"Fr Christopher","text":"No, no, it has to. It has to come. It has to come from within the specific conditions, right? It's like it's bottom up, it's not down, right? It has to. It has to emerge as a consequence of your interaction with the fundamental conditions that are present. It's the. The necessity. It's that you need the finite, necessary end of the dichotomy. The infinite end, the, the possible end that'll take care of itself. It's the attention to the necessary details that create the finite enclosure of circumstance that actually allow for that to be accessed. Right. Which is part of the beauty of that paradox. I think I just finished one of my favorite pieces of, of. Of television. I just finished. It's called Better Call Saul. And I think it's a. It's an absolutely. It's like an existential neoplatonic treatise when it's all said and done. It's this like incredible mind boggling piece of symbolic finesse the likes of which I've never seen before. And you would think. And I, and I started to listen to all of these sort of background details about the creative process because I thought, like, who are these people that produce this? Like the amount of meticulousness they must have. And they do from a craftsmanship perspective, but when describing. It's like they seem to somehow follow the logos such that every turn that the characters take is absolutely surprising, but absolutely necessary and could otherwise. It brings me back to this necessary co. Identity between creation and discovery. Inventio, right? Is a word that John likes to use that captures both at once. Right. The poesis is such that it unreveals what already was and in so doing makes it real. And the process, the artistic process, which is a dialogical process because it's in a writer's room, which is fascinating. Right? So it's a dialogical process using a kind of a dialectic to catch a pattern between a group of people. And then in that group of people, it's almost like a weird seance. It's like they catch the pattern of the character from within the conditions that they've contrived. And yet there is this sort of top down pattern that is coming to meet it in the middle. And so I listened to an account of the creator of the show describing the process. And someone's asking them like, my God, did you guys have this all plotted out meticulously? And he laughed. He said, no. It's like we were like in the dark with a lantern and we saw two feet in front of us and every step we took we went, oh God, look at that, right? It was like they weren't contriving anything. Somehow they found it in them to discover what was necessary about the next phase of the story simply by tumbling over the perspective of the character. Right. I thought that was incredibly. That was just a really beautiful, to me, a beautiful testament to exactly this process that you're describing. Yeah."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":4420.18,"end":4430.74,"speaker":"Jonathan Pageau","text":"And there's probably, like, the level to which this comes is probably to. Where this can go is probably very, very high. Because when you think, like, when I, for example, like, when I read the."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":4431.03,"end":4431.15,"speaker":"Fr Christopher","text":"The."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":4431.15,"end":4475.99,"speaker":"Jonathan Pageau","text":"The commedia. When I read the Dante, I have the same. I can have that problem. I'm like, there's no way this guy could plan this whole thing out in advance. This is not possible. Like, did he have massive charts like, that would take up entire walls with, like, connecting all these verses together and. And making this, like, giant spider web that, you know, is. Is. Is mad. It's like, I. I can't imagine that that's what it was. And maybe I. Who knows if he had such a mind, but I think it probably more. Has more to do with that capacity to attend and to. And to just be sensitive to. To reality. And so, like you said, it just kind of came together in almost like a mystical way, you know? So, I mean, I might be wrong. I might be."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":4476.23,"end":4476.55,"speaker":"Fr Christopher","text":"But."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":4476.55,"end":4482.39,"speaker":"Jonathan Pageau","text":"But it's like when you read, though, when you read something like that, you're like, how can. How can anybody write that? It doesn't seem possible."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":4483.17,"end":4573.91,"speaker":"Fr Christopher","text":"I think. Well, and I think the thing. I mean, I agree with you. I think it's as plausible a way of thinking about it as any other. And I'm inclined to agree. I'm inclined to think, no, he probably sat down maybe. I mean, when it came to refining the work, maybe there's probably more of that top down. But I mean, I've had the experience myself, not in comparison to Dante, but I've had that experience myself of sitting down and writing something and finding that it was flowing out. And then after a couple hours go by, it's like I look at it and I reread it, and this structure comes out. I go, I didn't intend that. That just happened, right? Or someone else will pick up on it. And I had no knowledge of it whatsoever. And to me, I mean, it's like, if I can experience that on this very, very modest scale, I have no trouble believing that someone with the artistic genius of Dante could sit down and write in such a way as to seed his own territory, to seed his consciousness to that muse, to the. To the force of poesis that was working its way through him and to let it have, right? Because the. The structure's already like. I mean, it's a priori, right? The unconscious structures are there. I mean, I take that kind of Jungian perspective on it, right? It's like the Structure's already there. It's just about developing the axis with it in order to actually seed territory to it when it's most needful to do so. And I think that's the difficult part, is getting out of your own way, as it were. Right, yeah."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":4573.91,"end":4580.67,"speaker":"Jonathan Pageau","text":"And then you. You can understand why, like, you know, because you mentioned the Muses, you can understand why it was formulated that way."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":4580.75,"end":4581.15,"speaker":"Fr Christopher","text":"Yeah."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":4581.15,"end":4604.19,"speaker":"Jonathan Pageau","text":"Why, in some ways it was, you know, it was almost like an invoking. Right. It's like I'm invoking this because I. It's actually. I know that it doesn't totally come from my will. It's like it can't. It has to somehow, you know, land in me, like, somehow. And then. And then. Then obviously you're part of it, like, you're part of the creation of it. But you need that vertical relationship."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":4604.27,"end":4674.55,"speaker":"Fr Christopher","text":"Oh, yeah. And your participation in it, I think, has much more to do with allowing it to be. To let the. Letting it be, the surrendering. Right. There's a kind of self sacrifice, I think, that is implicit and necessary in that kind of exercise, and then that participates in the greater pattern of self sacrifice that's required in order to refocus. Right. That shift from being much more egocentric to putting yourself in service to a pattern whose unfolding you can participate in but not be singularly responsible for, then becomes the purpose. Right. So that little mint in miniature, that little artistic humiliation of the ego, the giving up yourself so that whatever it needs to come out can. Can, I think, help to maybe inseminate the faith or the idea that on a greater scale, on a more existential level, that that's something that's required of us in other ways. And the artistic project, I think, is a wonderful. A wonderful symbolic container for that yielding up of, you know, what comes before us, but what ultimately comes through us as well. Right, yeah. The midwifery of it all."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":4674.55,"end":4678.51,"speaker":"Jonathan Pageau","text":"Yeah, exactly. Yeah. That's a good. That's a good way to. Midwifery is a good way to think of it."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":4678.95,"end":4679.19,"speaker":"Fr Christopher","text":"Yeah."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":4679.19,"end":4683.51,"speaker":"Jonathan Pageau","text":"Listen, Christopher, I think it's probably a good place to end."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":4683.67,"end":4684.19,"speaker":"Fr Christopher","text":"I agree."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":4684.19,"end":4686.39,"speaker":"Jonathan Pageau","text":"It's been a great conversation. Really appreciate it."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":4686.63,"end":4693.19,"speaker":"Fr Christopher","text":"Oh, thank you, Jonathan. This was a joy. This was a joy. I was looking forward to it and it did not disappoint, and I'd love to do it again."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":4693.35,"end":4698.47,"speaker":"Jonathan Pageau","text":"Yeah, definitely. We'll have to find a way when I'm in Toronto, to meet in person as well again."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":4698.47,"end":4701.03,"speaker":"Fr Christopher","text":"Yeah, absolutely. Or vice versa."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":4701.03,"end":4702.91,"speaker":"Jonathan Pageau","text":"Oh, that's true. You said you come to Montreal. Yeah."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":4702.91,"end":4707.05,"speaker":"Fr Christopher","text":"Tell me when you're wrong. I do. So, yeah. Okay. So we'll keep in touch and we'll make it happen."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":4707.21,"end":4708.65,"speaker":"Jonathan Pageau","text":"All right. Thanks for the conversation."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":4708.81,"end":4710.57,"speaker":"Fr Christopher","text":"Thank you, Jonathan. All right. You take care."}
{"episode_id":"SW - #268 - 2023-01-04 - Christopher Mastropietro - Into A New World","start":4710.73,"end":4745.47,"speaker":"Jonathan Pageau","text":"I hope you enjoyed this episode of the Symbolic World. The Symbolic World is based on a series of videos that you can find on my YouTube channel, Jonathan Pageau's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by, of course, leaving a review on itunes."}
