{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":0.64,"end":57.57,"speaker":"Jonathan Pageau","text":"I'd like to welcome you to the Symbolic World podcast. On this episode, I'll be playing for you a discussion I had with Matthew Miller. Matthew Miller is someone who makes YouTube videos that are movie interpretations. And for several months now, people have been telling me that I should probably get into a discussion with him because there are some interesting similarities between the way he interprets movies and mine. He is a Christian and tries also to see the pattern of Christ, the pattern of Logos, within the. The movies that he's watching, within the stories. So it's very interesting discussion that I had with him. Some of it becomes quite, I would say, esoteric. We talk about the Gospel of John and certain specific verses. So Paul Vanderkly funnily described it as two guys nerding out on the Gospel of John. And so I hope you will enjoy being a fly on the wall in that discussion. As you know, everything I'm doing here, the podcast, the videos, is thanks to your support."}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":58.12,"end":59.12,"speaker":"Jonathan Pageau","text":"If you like what I'm doing."}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":59.12,"end":85.64,"speaker":"Jonathan Pageau","text":"If you appreciate the podcast, please consider going to the symbolicworld.com support. Supporters have early access to videos. There are all kinds of tiers, tiers where you can ask questions in advance on the Q and A. Tiers where you can have private discussions with me or enter into small, private groups that I am leading. And ultimately, though, I am making one video, extra video per month for all the supporters."}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":85.72,"end":85.99,"speaker":"Matthew Miller","text":"And."}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":86.14,"end":90.34,"speaker":"Jonathan Pageau","text":"And it's usually an interpretation of a fairy tale, a legend or a myth."}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":90.34,"end":91.26,"speaker":"Jonathan Pageau","text":"Or some old story."}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":91.9,"end":101.02,"speaker":"Jonathan Pageau","text":"And it's really, you know, I've really been enjoying making those videos because that's probably the thing I like the most. Interpreting stories is the thing that gives."}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":101.02,"end":101.9,"speaker":"Jonathan Pageau","text":"Me the most joy."}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":102.22,"end":120.44,"speaker":"Jonathan Pageau","text":"So please enjoy. This is Jonathan Pett. Welcome to the Symbolic World."}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":131.8,"end":170.48,"speaker":"Jonathan Pageau","text":"So, hello everybody. I am here with Matthew Miller. Matt Miller, I should say Matthew, because I just told him just now that I like formal names. So Matthew Miller. Those of you might not recognize his face, but a lot of you will know him from his YouTube channel, logos made Flesh, where he analyzes movies. He also has other kinds of presentations there. A lot of people have been telling me that I should be discussing with Matthew, and it's very strange because I had also watched some of his movie interpretations that I enjoyed them and I thought, yeah, someday it'd be nice to talk to him. And then at some point I realized that I've already had contact with Matthew. Several years ago, four years ago."}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":172.64,"end":172.88,"speaker":"Matthew Miller","text":"I."}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":172.88,"end":213.12,"speaker":"Jonathan Pageau","text":"Don'T even know how I came onto his blog, but I saw he wrote a blog post about the Samaritan woman. And he described the relationship between Christ and the Samaritan woman as a courting, where Christ was courting the Samaritan woman in the manner in which we see in the Old Testament a man finds his wife. And so I wrote him and we had a few back and forth in terms of talking about symbolism. And I was really impressed by his symbolic intuition. So I'm very happy to get a chance to talk to him. We'll talk about symbolism, talk about movies and. And also I'm really curious about how he kind of developed his own symbolic intuition. So, Matthew, maybe you can introduce yourself a little bit and we'll go from there."}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":213.76,"end":231.54,"speaker":"Matthew Miller","text":"Yeah, well, thanks, Jonathan. I appreciate you having me on. I remember that when you got on that blog post and when you started growing and coming, I was like, I know that guy. Yeah. And then. Same thing. I've had people get on my blog, on my channel, and said, you need to talk to Jonathan Pageau. Is that right? That's right."}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":231.54,"end":232.74,"speaker":"Jonathan Pageau","text":"You got the right pronunciation."}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":232.74,"end":246.02,"speaker":"Matthew Miller","text":"There you go. And so kept saying it to me. And so I finally. I think I contacted you and said, let's do it. Let's get together. So, no, I think it was. Yeah, I reached out to you and you were on board with it."}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":246.02,"end":260.05,"speaker":"Jonathan Pageau","text":"Yeah, I've been. It's. For me, it had just been a question of time. Like, yeah, it's gonna happen. It's gonna happen. Several people have been telling me that I need to do this. And it was just like, okay. As soon as I, you know, it was just a question of opportunity. And then when you wrote me, I'm like, oh, there you go. There's the opportunity. Let's do this."}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":260.29,"end":261.09,"speaker":"Matthew Miller","text":"Yeah, yeah."}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":262.53,"end":272.53,"speaker":"Jonathan Pageau","text":"So tell me a bit about. Yeah, tell me a bit about. You know, because you told me that you're a corrections. I forget how you pronounce. You work in a prison, right?"}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":272.69,"end":288.69,"speaker":"Matthew Miller","text":"I work in a jail. Yeah. Local jail. Our Clark county jail here in Vancouver, Washington. And that's how I make my living. It's definitely an interesting place. And I get a, you know, basically human psychology to see how people operate and in a different environment that most people aren't used to. So."}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":288.93,"end":300.85,"speaker":"Jonathan Pageau","text":"Yeah, that's what I thought. You must have quite an insight into the human mind and the human passions. You know, like the. You get quite a scope of the type of people that you have to interact with, I imagine."}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":300.85,"end":340,"speaker":"Matthew Miller","text":"Yeah, people are people, no matter where they're at. And you see people with basically letting all their, I don't know, the raw side of humanity. The place where people just let it all hang out. So we. A lot of people just hide things. And you find out that a lot of people on the outside, I've known had a good reputation on the outside, and they were all struggling with things on the inside. So it's, it's, it's, you know, you just get used to the fact that, you know, there's kind of two sides to people oftentimes. So I was disconcerting when I first started, but it's. It's become second nature now. I mean, I know it pretty well, so. Yeah."}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":341.13,"end":373.55,"speaker":"Jonathan Pageau","text":"So tell me a little bit about your channel. I mean, I've watched several of your videos. Sometimes I've watched them without even knowing that it was you. You know, at the beginning, I'd watch several ones, and then when I started to notice your channel, then I thought, oh, I've seen this video before. I've watched it before. And so tell me a little bit about how you stumbled onto your way of seeing patterns, because I noticed that you have a good insight into patterns and storytelling and. And you also seem to have a good grasp of typology in terms of the Bible and everything. Tell me a little bit about how you came onto that."}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":373.79,"end":616.2,"speaker":"Matthew Miller","text":"Yeah, I went to, I guess, became a Christian, kind of like yourself, you know. I was an evangelical Christian. Still am an evangelical Christian. I go to a Protestant church. I became a Christian about the age of 13. Pretty radical conversion. Loved God and everything like that, and read my Bible pretty often. And so I ended up going to Bible college when I was. After high school. And it was a local Bible college called Multiple Bible College. And I don't know, I had a class called Inductive Bible Study with a guy named Ray Lubeck. Professor named Ray Lubeck. And we studied Jonah for like a. I don't know, a whole semester. And we tore apart the four chapters of Jonah. And Ray had a pretty interesting take on Jonah. I didn't like the class at the time because I thought it was overkill. I thought, man, the Bible isn't this deep. I just thought it's just take it. It's more or less surface, you know, take it as it is. And he showed me that, in fact, there was something more there. And I think about a year later, after I had that class, maybe a couple years later, I was reading the Gospel of John. I came up across the passage in my personal. Actually, I was teaching the Gospel of John to my youth group, to my kids. We're going chapter by Chapter just bringing out some things, talking about things. But we were doing in Sunday school one chapter a week. And in my personal devotions, I was reading First John at the time. And it just so happened that coinciding in those two moments, I read John3.5 and had a good discussion about John3.5. John3.3, sorry. Jesus said you must be born of water. I'm sorry, John3.5 says he must be born of water and the spirit in order to enter the kingdom of God. But I read that passage at the same moment I was reading First John 5. 6, which says he came not by water, only he came by blood. I'm sorry, I'm very. Just to let everybody know, I'm working on four hours sleep here. But getting those two passages together, I saw that the water was being used in almost the exact same way. And I thought it was odd that in Protestant circles the water is interpreted quite differently from in those two passages. In one instance, water is thought to be. I'm gonna draw a blank on what it is. Water is thought to be something other than the spirit in John 3. 5, and it's thought to be something else in first John 5. 6. And I thought should be the same thing, but because we're talking about the same person here, using the same symbolism, using the same shorthand reference for something. And in a long time I came back to. So I went back and read John all the way through, looking for clues, looking for maybe some kind of key as to what the water could mean. And I saw that water was everywhere for the first time. I mean, I'd read John like three or four times. I knew it pretty well. And all of a sudden, the dividers that I had in my mind between all these different separate incidences, the, you know, Jesus changing water to wine, the him healing the man by the pool of Bethesda, also the flow of blood and water in John 1934, all of a sudden, those made sense together. Not separate incidences, not as if they were. And we often read the Gospels in our Protestant circles as patently historical. That it's simply what happened. That if I'm reading it's simply what Jesus did last Tuesday. And there's no more signific than that other than the person picked it out and wanted you to say it. There's no shaping, there's no editing, there's no artistic element involved in terms of bringing out the spiritual meaning of what Jesus was doing. And that just absolutely opened my mind. So I thought, well, then John 3, John 7, 37, 39 Jesus basically tells us that water, in those passes, water equals the spirit. And yet in other passages, water is clearly contrasted with the spirit. So John 19:34, you're like, is it the spirit, Is it not the spirit? And how does that work out in first John 5, 6? So I had all these questions. I thought I had an answer, and I thought it was pretty awesome. So I just kept on reading and reading and reading and I picked up lots of books."}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":616.52,"end":707.84,"speaker":"Jonathan Pageau","text":"And so what is, I'm sure is because, I mean, I have to me, the differences between water, they're pretty simple, like. But I. But let me tell you how this is how I take especially your question, especially how I take it and see if that's same. The same conclusion that you came to. There's a difference between streaming water or flowing water and stagnant water or bitter waters or waters that are just there at the bottom, like the ocean. All that, all the images of bitter water in the Old Testament, images of salt water, all of that is very different from flowing water. Flowing water comes from above. There's no other way for flowing water to be flowing. It has to come down. And so because of that, it tends to echo the spiritual element coming down to earth. Whereas you have this water on the ground, a salt water, which is dead and not living. It has to be transformed by living water, which comes from above. You know, so you have a lot of these images in the Old Testament of changing bitter waters into fresh water. All these, all these, these changes of fresh and bitter water. And then you have all these images. Like we, you know, we talked about the idea of the Samaritan woman where you have a well and you have flowing water which comes from above. So you have like the water below and the waters above joining together as an image of sexual union, but also an image of. From Genesis, right? This union of the waters above and the waters below coming together, which can be in a flood if it's negative, but it can also be positive if it's happening at one place, you know, like a masculine, feminine joining together. Anyway. So that's how I would interpret it. But what did you come to as your conclusion?"}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":708.08,"end":711.2,"speaker":"Matthew Miller","text":"And how do you see John 19:34? I'm. In terms of Jesus, the."}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":712,"end":714.72,"speaker":"Jonathan Pageau","text":"I'm not a chapters and verse guy. So you have to spell it out."}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":716.63,"end":731.35,"speaker":"Matthew Miller","text":"Jesus is pierced in his side and blood and water flow. So that's the culmination, I think, of the Gospel. It's basically the capstone, the thing that brings the blossom, the bloom, brings it all together. Have you interpreted that?"}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":731.35,"end":805.54,"speaker":"Jonathan Pageau","text":"I interpreted it as the beginning. I would interpret it in a way as in beginning and the end, you would say. And so water, especially if you take the story of water being turned into wine. So water being turned into wine really is the creation process itself, right? From. From water into this created thing, but then also death, you know, wine is also death. It's a. It's a death turned against itself. Right. It's fermentation, which is. Which is captured, let's say. And so. And then there's also water as the something that you drink in terms of refreshing, and then wine as something that is intoxicating. And so it's like the whole gamut of manifestation, you would call it from, you know. And so water and wine could be equivalent to something like bread and wine as well, in the sense of something which is meant for consumption, which is, let's say, pure or whatever. And then blood, which is. Which is the other extreme, the left hand, you would say something like that, which is fermentation, death, intoxicant, all of that. And blood. Is that as well, like blood was supposed to. Yeah, that's how I would see. So it's like the whole thing. It's like the whole world is coming out of Christ, you would say, from the beginning to the end. So it is. It's like a new creation coming from Christ."}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":805.94,"end":837.36,"speaker":"Matthew Miller","text":"Yeah, absolutely. Absolutely. And new creation is the key right there. I think that's. That's the most important idea, I think. So when you look at the first. If you start to read all the passages together, so there's something called the hermeneutic circle. I don't know if you're familiar with it, but this is something I've latched onto, and it's kind of been helpful in terms of how do I read or understand anything. But in interpretation, the hermeneutic circle is pretty important, pretty significant, because it means that we can know the meaning of something apart from the whole of something."}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":837.52,"end":837.92,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":838.08,"end":1030.93,"speaker":"Matthew Miller","text":"We look at the whole of something, and we go back from the. From the vantage point of looking at the entire completed text, whatever context. And we go back and we look at each individual part, and we see how each individual part connects to the whole. So it's whole to part, part to whole. It's. It's pretty significant. So if you read the Gospel of John in its entirety and you look at all of those water passages and you say, well, John's trying to communicate something to us. It's not like he's just, you know, Brought this thing in just because. But he has a meaning to it, and it is symbolic. So what is he. How is he relaying the message of that symbolism? What does he want us to get when he gets to that? 1934, he says, I saw it. The one who swears is true and he knows what he saw. I mean, that's John 19:35, just immediate verse after. I mean, he really swears to it. And the only other time he really gets that personal with us is at the very end of John 20, which. Where he caps off the end of the Gospel when he says, these things have been written that you may believe and that you may have life in his name. So what's interesting is that you go back and you follow the patterns. You start to see that the patterns emerge. And so the first time it happens is in John 1. And if I go too long on this, please go for it, John, if you're boring. So there's the first time we see water. John the Baptist, in John 1 states, Three times he repeats himself. Three times I baptize in water, he says. And the third time he then says, but he will baptize in the Holy Spirit. And we get that from Mark's Gospel. We get it from Luke's Gospel that the fact is that there's this dichotomy between water baptism and the Holy Spirit, that what John is doing is somehow different from what Christ will do. And then in John the second chapter, just immediately after that, Jesus goes to the wedding and Mary comes to him, says, they have no more wine. And then Jesus takes the wine, the water, sorry, and he puts it in six stone water pots set there for the Jewish custom of purification. And they draw it out and they take it to Headwater, and it becomes wine. He says, this stuff is the best stuff. Then a chapter after that, John 3, 5 or 3, 3, when he talks to Nicodemus at night, he says, you must be born again. And Nicodemus says, how can I enter my mother's womb a second time? And he says, born of water and spirit, you can't enter the kingdom of God. Then after that, then you obviously have the story of the Samaritan woman. Then after that, you have the story of Jesus healing the man by the pool of Bethesda. Anyway, all that to say is there's a pattern that emerges from those first five chapters, because it's in every single chapter. And what emerges is there's a comparison and contrast made between water and something else which equals the spirit. On the story of The Samaritan woman. You have the story of Jesus meeting the Samaritan woman, and him, she coming down, and he says, if you knew who I was, you would ask me, and I would have given you living water, sir, give me this water so I don't have to come here all the time to draw water to drink. And the interesting thing about that is that you say you have well water, like you said, and you have living water, which is fresh water, flowing water. You have well water, which is lake water. It's stagnant water. It's water that's, you know, that's stationary from below."}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":1030.93,"end":1031.49,"speaker":"Jonathan Pageau","text":"Just water?"}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":1031.49,"end":1031.77,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":1031.77,"end":1032.37,"speaker":"Jonathan Pageau","text":"Water from below."}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":1032.37,"end":1403.26,"speaker":"Matthew Miller","text":"You could say, yeah, yeah, absolutely. And. But there's two. And here's what the interesting thing is. If you look at the Samaritan woman story, there's actually that pattern, that conversation that Jesus has. John has shaped it in a very interesting way. I mean, maybe he shaped it. I don't know. But this is how it goes. You have the first half of the story, and then when she says, go call your husband and tell him to come here. She says, I have no husband. All of a sudden we have a shift in the content of the subject of the conversation, which is now about her marital status. And then she shifts it again, saying, sir, I perceive that you're a prophet. She says, you worship on this mountain. We worship on this mountain. Which mountain should we worship on? And then Jesus says, it's neither this mountain nor that mountain, but God seeks. The Father seeks for worshipers to worship him in spirit and in truth. That's speaking for is worship. Because God is spirit. We must worship him. Spirit of truth. Now, if you take those two halves. Now look at this real quick. You have that. That first half of the conversation and the second half of the conversation. The first half is well water contrasted with living water. Well water is a well of water. I mean, well water is dead. But she connects it to the traditional site of Father Jacob's well. She says, are you greater than Father Jacob, who gave us this well? That word father is important because it comes up in the second half. And Jesus says, my water will become a spring of life, welling up to eternal life. So, yes, I am greater than Father Jacob and his well. The second half, she says, our fathers get that our fathers worshiped on this mountain. You say, we should worship on this mountain. Which mountain should we worship on? And Jesus says, it's neither this mountain nor that mountain, but we should worship in spirit and truth. Living water is connected with spirit worship. Worship and truth. Whereas the well water is connected to a traditional place, a traditional place which is given by the tradition of Father Jacob. This is old time religion. Whereas the mountain worship is the same thing. Our fathers gave us worship on this mountain. And Jesus is saying it's not by location, but the spirit breaks every border. The spirit goes beyond borders. It is, you know, not to say that there's something negative in those things. That's fine. But Jesus has put, has superseded what has came before. He has come before. And we can see that in John 2, where the story is of water and wine. It's not just wine. The story doesn't say it's just wine. It calls it water. Turn wine. So there's a contrast between water which is given out, water which has, you know, wine. Basically the story goes in the wine they were drinking and it gave out. And when Jesus makes the wine, he goes to the head waiter and the head waiter says, this is how it always works. People put out the best stuff first. And when everyone is drunk, then they bring out the cheap stuff. But you have saved the best for last, best till now. And so you have a contrast between two different waters. You have water which is impotent, powerless. And then you have water which is surpassing and awesome, which is the spirit. That's why we call wine liquor, we call it spirits. It's the idea that something intoxicating has happened. So there's water which is given out. And that water is based upon what Jewish tradition. Because he says he took the six stone water pots set there for the Jewish custom of purification. And he transformed that. He didn't just take the wine jars, the empty wine jars, he specifically took something which was associated with tradition, ritual, ritual cleansing, and transformed it into something which superseded that which is all encompassing, which was way better. And this thing goes with John's baptism. What is John's baptism? In chapter one, John baptizes in water. I baptize in water, he says, but he will baptize in the Holy Spirit. And what John's baptism was. And it's a significance important for Christians and everything like that. But if you think about what John's baptism was, it was a Jewish custom of ritual purification. Because if you go to Israel today and you see all the archaeology is that everybody was doing ritual baths all the time. Even before you entered the temple, you were going into a bath to wash yourself, to purify yourself, before you entered into any holy place. So John took that idea and made it a one time baptism of repentance in The Jordan River. And so in essence, what John was doing was a ritual form of purification. This is an act of purification. But what Jesus does is, is he transforms the ritual and makes it something. He supersedes it or surpasses it, all of those aspects. The story of John 5 too, when Jesus has the healing of the man by the pool of Bethesda, the man says, he comes to the man and he says, do you want to get well? And the man looks to the pool of water and says, hey, I do want to get well. But when the water's stirred up and it doesn't move. Yeah, yeah, it gets stirred up. There is a passage in the King James Bible that tells us that it was an angel that came down, but it's actually not in the original text. But the idea is the water gets stirred up. And he says, I can't get in because somebody gets down before me. And Jesus says, take up your pallet and walk. Pick up your mat and walk. And what's interesting is that story is there's a contrast made. The man looks to a traditional site, ritual site. He sees in this place where all of these lame people are gathered together to get into the water when the water stirred up. That's tradition, that's ritual. And what Jesus says is, hey, turn your attention to me, pick up your pallet and walk. Jesus has superseded or surpassed. And what's interesting is in John 5, that's the first time that you don't have an active contrast made between the water, the lower earthly water below, with the water above. Jesus has taken the place of that water, that container of water. And that's what we're going to see through the rest of the Gospel of John is that Jesus is infused, he has the water inside him. And then we'll see that in John 9 and John 11, Jesus weeping and the fact that he spits on the ground in John 9."}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":1403.42,"end":1404.14,"speaker":"Jonathan Pageau","text":"Yeah, for sure."}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":1405.34,"end":1411.71,"speaker":"Matthew Miller","text":"And then when the spear thrust happens in 1934, I would say, in terms."}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":1411.71,"end":1454.62,"speaker":"Jonathan Pageau","text":"Of, I mean, I think I agree with most of what you said. I think that for sure that the language of the language that I would tend to want to use is a kind of recreation or a filling up, let's say, because when we use the language of supersession, sometimes it can give the impression that we're. How can I say this? That it's completely being left behind. Whereas, whereas Christ fills up, let's say, takes, let's say the ritual of Passover, fills it up to overflowing and makes it into Communion takes the ritual of ritual purification, fills it up into overflowing. And so then we still have a ritual of baptism. We still have communion."}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":1454.62,"end":1455.02,"speaker":"Matthew Miller","text":"But."}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":1456.86,"end":1477.73,"speaker":"Jonathan Pageau","text":"It becomes this full. Full becomes full and overflowing. And also it overflows also into the. You know, into the nations, right? It's not just for the Jews. It becomes this thing that. This Pentecostal thing which kind of flows out. The question I have, though, is, did you ever make the connection in terms of spirit and water to the very first passage in Genesis?"}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":1477.73,"end":1478.45,"speaker":"Matthew Miller","text":"Yeah, absolutely."}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":1480.05,"end":1499.26,"speaker":"Jonathan Pageau","text":"Just this repetition of the same. It just over and over the same pattern of the Spirit above the water, Spirit above the waters. And so Christ connects them, especially at his baptism. That's where you see that actually Christ connects, is the one who connects the waters with the Spirit because he's down in the waters, and yet the Spirit comes and lands upon him. So he becomes the connection between heaven and earth."}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":1499.34,"end":1568.78,"speaker":"Matthew Miller","text":"If you get even more deep into John, and I didn't get into this, but the idea when John says, I baptize in water three times, and the next day it says that he says it again, and then he says, but he will baptize in the Holy Spirit. What John does in the first chapter of John into the second chapter of John is he gives us a series of six to seven days. John says, the next day, the next day, the next day. And if you. If you follow out those days, they end up to be somewhat comparable to the old first chapter of Genesis, which is, you know, Jesus, God, first, second, third, fourth day. And what's interesting is in the first day, what does God do? He separates the light from the darkness, right? He calls the light day, calls the darkness night. And there was evening, the morn, the first day. And what's interesting is then John 1:1:2, we have that separation that in him was life, and that life was the light of men. And the light shines in the darkness, and darkness has not overcome it. And then that's the first day. So there's a comparison made. And then a little bit later, I think around, I can't remember, a little bit later, it says, and the next day. Well, that next day falls on the second day. And the second day in Genesis is what happens, Jesus. I mean, God divides the water."}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":1569.82,"end":1574.3,"speaker":"Jonathan Pageau","text":"You can say all things were made. It's okay."}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":1574.62,"end":1608.8,"speaker":"Matthew Miller","text":"That's right. So it says that he divided the waters. So there was a firmament, there was waters. He divided the waters, the waters above from the waters below. And that ends up falling on the second day. Where John says, I baptize him with water, but he baptizes in the Holy Spirit. And that's why I connect the Holy Spirit with water from above. Yeah, the water that John has with the water from below. That water that is traditional earthly, you know, but, but he surpasses that and is overshadowing that. And we see that in John 8, where Jesus I am from above, you are from below. I am of this world. You are you, you are of this world. I'm not of this world."}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":1609.12,"end":1698.21,"speaker":"Jonathan Pageau","text":"If, you know, if you look at the old, if you look at the old baptismal fonts, you'll see that they usually were cross shaped and they had, they. They often had a fountain in the middle. So they had a cross shape and had a fountain. So the baptismal font would actually be a water below and then it would have a fountain that would kind of drop back into the water. So you would have this, you would come to the place. It's like, it's funny because people always asking because the Catholics, they baptize from above, they put the water from above, and Protestants tend to baptize from below. Even the Orthodox also, we tend to put down from below. But I think that if you look at the images, the early images of baptism, it looks like it's both at time, the same same time. It really looks like you see Christ. If you look at the images of the baptism of Christ, you see that he goes down into the water. Then you see St. John also pouring something above him either has his hand up there and you see the Spirit coming down, or he has a shell or something and he's pouring water down from above. And so I really think that it's this joining together of the both waters. You get a little bit of that in the orthodox tradition. Now sometimes I've seen it where when someone gets baptized, they'll actually, the priest will create this like flow of water, right? They'll actually, with their hand, they'll make this gesture so that the water will kind of, kind of come back on top of the person's head as they're kind of, you know, going down underwater. I don't know like how that started that tradition, but I've seen that done quite a few times by some priests anyway. Interesting."}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":1699.09,"end":1763.22,"speaker":"Matthew Miller","text":"I should add too, when I talk about supersession or whatever in the Gospel of John, I do not believe that John is saying we should have no tradition or that tradition is wrong in some sense. Because in John 1, he says, for instance, he's talking about the law of Moses, he says grace came through Moses, grace came through the law, but grace and truth came through Jesus Christ. So there's this idea, and it also says something about basically that what God has given is he gave us grace in the Old Testament, but he's given us grace upon grace in, in the news. So the fact is that these things were not wrong. They were not. Yeah. I mean, so tradition and ritual are. But they only get you so far. That's the thing is, and I think that's what John's point is, that we have these traditions, we have ritual, everybody does. And Protestants will deny that they do, but they're just as much tradition oriented as anyone else. But the idea is that it is a heart transformation that John is talking about. He's talking about a life transformed by the spirit of God and in spirit and in truth. Yeah."}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":1763.78,"end":1793.46,"speaker":"Jonathan Pageau","text":"So my question is, my big question for you. I guess now we'll go and get into the movie stuff a bit later. But my big question is as you start to approach things that way in terms of interpreting, in terms of seeing the patterns and seeing the typology between the Old Testament and New Testament and how it plays out in the New Testament. So my big question is, how do you, let's say, how has this been received in your circles? Like, how do people perceive what you're doing? Like, how do they interpret, how do they see it? How they interpret it?"}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":1794.74,"end":1875.82,"speaker":"Matthew Miller","text":"Well, I think, I think the. Well, I grew up in a Pentecostal. I mean, that's where I grew up. I grew up in a Pentecostal circles, which is very, very literal. I mean, reads the Scriptures very literally. So that's how I was. I was taught I was. And so I think the people that I know closest have been. Their eyes have been open. They're like, wow, that's really cool. I never saw that before. They're interested. And I've gotten pushback from people. Like, I don't get it. I don't understand. Some people might just think I'm crazy. That's why I look at you and go, man, you got to have people that think you're crazy and that you're not. You're like, where are you getting those ideas from? You know, because it's not so obvious to people how you get from point A to point B or C or D when you, when they don't see steps in between. So, you know, so yes, it's been good. And yes, it's also led to some confusion on people who look at me and scratch their Head and go, I don't get it. So. Because I think that. And I think symbolism. Symbolism to a lot of people. There's a tendency in Protestant circles particularly that the Bible is historical. So they read the Bible with. This is what happened. So, like, the Gospels are essentially a diary of Jesus's activity. And it was written as it occurred. Almost like no editing, nothing. Just that this is what happened. And then we did this and we did this and we did this. So each individual aspect of what Jesus did is significant in its own right. Not."}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":1877.66,"end":1897.1,"speaker":"Jonathan Pageau","text":"So what do you think? This has been the one. The thing that I've been trying to get people to see mostly. And maybe. And maybe I don't know if I'm really pushing you a little further than what you usually tend to think of is that there is no such thing. I keep telling you, there is no such thing as literal. There is no literal in the sense that there are plenty of things that happen to Christ that were not mentioned."}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":1897.67,"end":1897.99,"speaker":"Matthew Miller","text":"Mm."}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":1898.55,"end":1904.15,"speaker":"Jonathan Pageau","text":"Within. Even in the selection process, there's a form of symbolic compression."}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":1904.31,"end":1904.79,"speaker":"Matthew Miller","text":"Yeah."}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":1905.19,"end":1916.07,"speaker":"Jonathan Pageau","text":"Christ, you know, Christ did all kinds of things. You know, he put on his clothes, he cleaned his fingernails. He did all kinds of things that everybody does, but we don't mention those things because they're not meaningful."}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":1916.39,"end":1916.95,"speaker":"Matthew Miller","text":"That's right."}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":1918.71,"end":1922.59,"speaker":"Jonathan Pageau","text":"To me, what I keep telling people, that Logos is a. Logos is a."}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":1922.59,"end":1923.11,"speaker":"Jonathan Pageau","text":"Is a."}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":1924.02,"end":2004.03,"speaker":"Jonathan Pageau","text":"A form of compression of meaning. So you have all these details, and the very fact that you choose certain elements within a narrative, it means that already you're in a form of meaning making or participating in meaning. Not just. And ultimately, what I'm trying to get people to accept or understand is that the pattern that we see in Scripture, that the basic pattern, the one from Genesis that we see all the way into the Gospel, is not just a literary pattern, that it's actually the pattern of reality, actually the pattern by which we engage the world in terms of phenomenology. So the very fact that even. Even in our own lives, we have to create syntheses of meaning to create narratives like we exist in narratives. We live our lives, our stories. We don't. We don't live our lives as an indefinite amount of arbitrary details. We rather compress them into narrative form. And that compression is the structure of reality because there's too many details. There's like an infinite amount of them. If you don't have Logos, the world scatters into dust. Like, it'll just keep scattering until it reaches dust. But the Bible and tradition gives us this pattern by which to Basically see the world with."}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":2004.19,"end":2106.89,"speaker":"Matthew Miller","text":"Yeah, absolutely. Just to take off what you just said. My dad was a storyteller. So my dad was. He was a pastor for a bit, but then he went on to become a teen suicide prevention counselor. So he'd go to high schools all over the world and basically do seminars. So he's a public speaker, gets up and tells stories. That's what he was. He's a gifted storyteller. He'll tell a story anywhere, everywhere he'll. And everyone's engaged by the stories that he tells. But me sitting back and watching him do that, I recognize that a story gets slightly shaped depending on the context in which it's being delivered. So the point of the story isn't simply the story itself. It's the meaning or message which is shaped by the context. And so that's what the gospel writers are doing. They're telling us a story not just because it's the story that's important, but it's the meaning or the. What we call the sitzen leben in biblical circles, the life setting of a situation, of the people to whom it was given. So Mark's gospel is different from Luke's gospel and John's gospel. Not necessarily because, you know, Jesus life differed all that much. But it's the point that they're trying to get their audiences to perceive. And we see that in adaptations of movies. If we just bring in movies, for instance, we see adaptations for different settings. If you see a movie made in the 50s and it's remade, there might be some radical differences between that and it's significant. Of those differences, one illustration I like to use is the Last Supper by Leonardo da Vinci. And everybody's on one side of the table. We all see it. You know, if you've got it in your head, your mind, that there's something unique about the situation in which that painting was made. It was made in a refectory, like reading."}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":2106.89,"end":2107.17,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":2107.17,"end":2119.07,"speaker":"Matthew Miller","text":"It was made in a dining hall. And this is what people don't get. They see it on their wall, they put it on their wall. They see it in a magazine, they see it wherever. But they're not getting the context where that painting was made. And it was made as an extension."}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":2119.31,"end":2119.67,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":2119.67,"end":2121.03,"speaker":"Jonathan Pageau","text":"You're sitting at the table with us."}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":2121.03,"end":2171.79,"speaker":"Matthew Miller","text":"Basically right at the seating arrangement. Exactly. And that. And Leonardo knew that. And we all know that that wasn't literally Jesus having the Last Supper. That's not what it looked like. But the meaning that it was bringing that application into the people who are now dining with Jesus and saying, and the point at which we all know, the point at which the, the painting was made was one of you will betray me. And the question is, every time you eat your supper with Jesus now you're like, is it me, Lord? Will I betray you? That question is now on the minds of everyone eating with Jesus. So the meaning becomes the situation, the context of the painting itself becomes the means by which we interpret the painting. But yet nobody says, well, that wasn't the Last Supper. You can't say that wasn't the last. It is the Last Supper."}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":2171.79,"end":2255.59,"speaker":"Jonathan Pageau","text":"It is the Last Supper. Yeah, and that's the thing about image making too, because my main job is being an image maker really. When you're making images, you are, you realize that you're, that you make choices that you're compressing, you're compressing things into a frame. You have to bring things together. And so you have to do that in a way that is making it meaningful. Because you could have represented it from behind everybody's head and have everybody from behind and you don't see. Or you could have represented from a fly's view, looking at just the tablecloth on the table. So no, when you frame an event or you frame something in an image, you have to make it meaningful. You have to participate in its meaning. Or else it's irrelevant. Or else no one cares. Or you're just being, you know. Well, we have people who do that today, but they're just trying to be innovative for being innovation sake, you know, to surprise you. But even if they do that, you know, it's like you could create, you could create an image of the Last Supper by which you see everybody from the bottom and you just see the bottom of their feet. And then you would see that it's the Last Supper and someone would think that they're being extremely surprising and subversive and innovative. But the only reason why you even care about that image, because you have the referent, the actual normal image in your mind. And now you're seeing this as an exception to that norm. So you know, you can't avoid it."}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":2255.59,"end":2291.63,"speaker":"Matthew Miller","text":"You can't get out. And that's the hermeneutic circle right there is because we all have to have. And this is the problem with the hermetic circle is that it's circular, meaning that we, we have to have information in order to interpret. Right? You can't interpret without that information. So there's things that people miss all the time because they don't have that reference. You're Supposed to have the referent when you see the image or watch the movie or whatever. And that's. That's partly where I get into the movie thing, is that people don't know the Bible. And then you go, well, that's what they're doing. They're referring to the Bible. So. Which brings in the reference that people go, I don't see that. Well, of course you don't see it because you don't know the reference."}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":2291.63,"end":2323.51,"speaker":"Jonathan Pageau","text":"Right, Exactly. And, yeah, you're losing the main reference that all that. All narrative in the west has been alluding to from, you know, from since the last 1500 years or whatever. Yeah, it's definitely lost. That's why someone like Camille Paglia, who's an atheist, you know, transgender lesbian, she says, the best thing we can do right now is teach the Bible to our students because they're losing the referee, losing the mesh, you know, the underlying mesh for Western society. And they basically can't read anymore because they don't. They don't. They have nothing to look at the world through."}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":2323.67,"end":2337.42,"speaker":"Matthew Miller","text":"That's right. And that's the fragmentation of our society, where everybody has their own little enclaves of meaning. There's no grand narrative. I mean, that's fine if you want to say there's no grand narrative, but basically, you're destroying society in the process. You're breaking it down."}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":2337.5,"end":2337.98,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":2338.06,"end":2415.35,"speaker":"Jonathan Pageau","text":"So here. Okay, so now, before we do get into the movie stuff, here's the big question. This is kind of the question that. Because I've met several Protestants who. Who have this kind of symbolic intuition, and I'm always excited to talk to people that have this intuition, but I always have the big. My big question is, why aren't. What about liturgy? Like, what about the rest? Right. What about the architecture? What about the liturgy? What about the liturgical year? What about all those patterns which are. Because there's the pattern of reading, which is an intellectual exercise, let's say. But then there's the lived pattern. You know, there's the moral side, which is there, of course, but there's also the lived communal pattern, which is the making the world look like this pattern, like, let's say, this overflowing of the Spirit into the world, and the world being shaped by the Spirit. And so that's how we see, let's say, traditional Christians. That's how we see the fact that our churches have a certain shape, that our time is now marked by festive feasts, how, you know, the liturgy becomes the ultimate, you know, pattern of participation in the Life of God in terms of patterning itself on revelations and bringing all these patterns together. And so how do you, like. What's your take on. On liturgy and architecture and art and all that?"}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":2415.51,"end":2527.37,"speaker":"Matthew Miller","text":"I think it's. I mean, like I said, I think it's fantastic. I think that is the. I think they. They've reached the. The peak, the pinnacle of what we're supposed to do. I just. My. My take on it, I guess. Why am I. I guess I. I've flirted with becoming both Catholic and Eastern Orthodox. You know, the idea of. I've been to monasteries and things like that and. And read. I guess. Why am I a Protestant? I guess because I am a Protestant. I haven't, like, you know, swam the Tiber or. I don't know, the comparable thing for becoming Easter. It's fantastic. I think that being devoted to the Bible, and I think that. And I'm not saying that Eastern Orthodox or Catholics aren't, but innovative. American culture is innovative. We want to do everything differently, and I think that's what we're all doing. Exactly. What you just said is to take the art and make it take our lives and somehow be cruciformed, put in the shape of the cross for a whole entire life. Everything we do to be shaped by that narrative, by that story. I think Protestants go about it a different way, but they are doing that, and I think that's the goal of what we're doing. So they just have a different liturgy, a different way of going about it. So I'm not gonna deny that we have a liturgy. We do. We just go about it, and it's shaped a little bit different. I don't like. And I preached a message at my church a while back, and I actually went down to the local Catholic church and I got a crucifix, and I brought it up and I hung it on the wall for my Pentecostal. Pentecostal church. And that, to them is like anathema. It's almost like an idol. You're putting an idol on the wall, and I'm like, no, I'm not. This is the moment of Jesus coronation. This is the moment. If you see a picture of a queen being crowned queen or a king being crowned king, there's emblems and symbols that are associated with the globe. You know, the little, you know. I mean, if you see, you know."}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":2527.37,"end":2531.41,"speaker":"Jonathan Pageau","text":"Napoleon talk about the crucifix in your sermon, like, you kind of talked about something."}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":2532.69,"end":2553.85,"speaker":"Matthew Miller","text":"We eradicate the cross as not the moment of Christ's glory. We say it's the moment of his death and it's empty now and therefore it's empty. And the tomb is the most important thing. And the fact that Christ is resurrected and I'm like, that's not the moment of his glory. The moment of his glory is when he was crucified. That's the moment he was crowned king. And that's biblical. That's based upon the Gospel of Mark and the way the gospel writers interpret it."}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":2555.69,"end":2621.19,"speaker":"Jonathan Pageau","text":"Also the thing about understanding, let's say, how Christian imagery works is that it works in a pattern as well. And so we have the cross, but we also have the anastasis. For example, in the orthodox tradition, where we see the heroin of hell, we have Christ in glory sitting on his throne at the last judgment. We have Christ in the manger being born and showing this first moment of the Logos entering into the world. And so all these images, they don't exist in a bubble. So it's not like all we have is Christ dead on the cross. We have Christ dead on the cross, which is speaking to Christ at the ascension on his throne. All these images are in a pattern together, just like in the Bible. We don't only have the moment of Christ's crucifixion, we have it in a pattern of, of storytelling, but we also have a pattern of image making in which all these images are talking to each other the way that they're talking to each other in the Bible as well. So. But I understand, like I remember when I was young too, I remember that argument saying it's like, why would you show Christ on the cross? You know, just Christ dead. And it's like, yeah, that's one image, you know, we have all these other images."}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":2623.35,"end":2695.42,"speaker":"Matthew Miller","text":"Yeah, it's so I don't know what to say about that. I have an LM blog, I have a series that I did, not a series, but a one time shot deal where I talk about the Bible being our grand unifying narrative and that the Bible is incomplete. It tells us the beginning, tells us the middle and tells us the end. But there's a point in that story which isn't finished yet and that we stand in that place improving. It's basically directed improv. We look to the past and we look to the future and we read the Bible in sense of. Because most of the Bible people go to the Bible and they say, I need an answer for my life, I need to answer. So they find a verse or proof text or whatever, but it's not, doesn't work that way. And I think that the Eastern Orthodox get this is the idea that it's a story and we find ourselves in that story and we are becoming part of that story. And in some sense that's all been worked out by the history of the church. And I think that simply Protestants are just recreating it, you know, 1500 years ago they're doing the same thing, but they're going back in time to redo it all. And eventually I think that it'll start looking somewhat the same."}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":2696.46,"end":2762.32,"speaker":"Jonathan Pageau","text":"Well too that'd be great if it did like, it would be great if it starts to. So let's talk about movies. So this is I, you know, one of the reasons why I do making movie interpretations and you said something before is, is that seems to connect to the reason why I'm doing it is that I noticed that people don't, they become blind to the Bible stories. People, they don't see them anymore because it's as if either they, they've been soaking in them and they just see them as things that happen, like you said, where they don't, they don't see them as this patterning or they turned away from them and they don't care. And so they think they're boring and that these stories are just a bunch of superstitious nonsense. And so the thing that I thought is if I can show people the patterns in our other stories, right. The movies is a great, is easy to do because it's a video medium and everything. I can show people patterns in our other stories. Then I can slowly point them to say, oh, you think those patterns are cool? Let me show you some, let me show you some real storytelling. And let me show you some amazing, you know, patterning here."}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":2763.04,"end":2794.34,"speaker":"Matthew Miller","text":"Yeah. So you bring, you build your credibility by saying, we all know that this movie is, you have no expectations about a movie. You don't have any tradition about a movie. A movie comes out and you say it is or it isn't. And people are fairly open minded when it comes to the interpretation of that. And it allows us to have kind of a halfway meeting point about the idea of interpretation, what interpretation is hermeneutics. And then you can take them back to the scripture and say if that's symbolic, perhaps something in the Bible is symbolic as well becomes absolutely what you're saying."}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":2794.66,"end":2828.39,"speaker":"Jonathan Pageau","text":"And I'm curious about how like I imagine people are writing you sometimes. And in terms of, let's say you feel like a lot of the people that are watching your videos are mostly kind of Christians who are Waking up to, let's say, the meaning in scripture or that you're reaching out to the outside. Let's say people that are, that are agnostic or atheists. And then all of a sudden they haven't seen the reference that you're talking about. Like, they don't, they're not seeing that underlying our storytelling is this story of Christ basically, which is. Which kind of keeps popping up no matter what we do, even if sometimes the movie maker doesn't even do it on purpose."}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":2829.59,"end":2890.67,"speaker":"Matthew Miller","text":"Yeah, I think that I'm getting quite a mixture of all sorts of people. I've got atheists that got on there and says, you know, like for instance, my Shawshank Redemption video got on there and says I'm an absolute atheist. And I think that religion is the bane of society. But I think you've absolutely nailed this movie and you did a fantastic job or something to that effect. So you, you can get a wide array of people. I think that there's literalists and there's non literalists. And I think that, that, that, that runs the gamut of people who are religious and non religious. I think that there's religious people who are very literal and there's non religious people who are very literal and there's religious people who are non literal and there's non religious people who are non literal. It seems to be that there's just a. That's an odd thing. I mean, people, the conversations that I've had with people. I see that Christians will often get upset. You know, that can't be the case even just in a movie, because they see things, all things literal. An atheist might say, no, I totally get what you're talking about."}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":2892.12,"end":2910.36,"speaker":"Jonathan Pageau","text":"I had a. There's an interesting story kind of around my circles. I did an interview. I did a movie interpretation of the movie Gravity by Cuaron. And I did it. I did Thomas Winnanz Van Rezan from the Storyteller Storytellers channel. I don't know if you've heard that. Anyway, yeah, they have. Great."}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":2911.16,"end":2916.04,"speaker":"Matthew Miller","text":"It's Jonathan. He's doing on the story because I love the storytellers too. And I was like, man, you hooked up with them."}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":2916.04,"end":2940.29,"speaker":"Jonathan Pageau","text":"Yeah, pretty much. I would say. Thomas by now is one of my partners. Like, we, we've been doing several videos together on my channel and he edits my videos and everything. And so he kind of took. He had some intuitions about Cuaron as well. Then he took the stuff I done in Gravity and he made a video about this pattern in Cuaron's movies, where in every single one of his movies, someone will, like, go down into water and almost die and then come out, right?"}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":2940.37,"end":2940.85,"speaker":"Matthew Miller","text":"Yeah."}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":2941.33,"end":2986.91,"speaker":"Jonathan Pageau","text":"And so. And so Quran had invited both of us to the premiere for his latest movies, Roma, and Thomas got to meet him because I couldn't go to the premiere in New York. I had to go to the premiere in Montreal. And so I didn't meet him. He wasn't at the premiere in Montreal, but Thomas got to meet him, and he started talking to him. And, you know, and Quran knew about his videos and my videos as well, and he asked him about that, about this pattern, about this baptism pattern that is in his movies. And Quran looked at him and said, you know what? I never noticed. It's like he. In his. Every single one of his movies, he has this pattern, but he himself had never noticed that he was doing it. Just shows you how powerful these. These story. These stories are. Like, how underlying they are, you know?"}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":2987.23,"end":2991.11,"speaker":"Matthew Miller","text":"So let me just get this straight. So Sandra Bullock character falls into the water at the very end, right?"}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":2991.11,"end":2991.47,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":2991.47,"end":2993.11,"speaker":"Matthew Miller","text":"And crawls out. Right."}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":2993.11,"end":2994.75,"speaker":"Jonathan Pageau","text":"And stands up, you know?"}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":2994.99,"end":2999.47,"speaker":"Matthew Miller","text":"Yeah. Crawls out and then stands up on the ground. He didn't see any symbolic meaning in that."}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":2999.47,"end":3032.58,"speaker":"Jonathan Pageau","text":"He had never noticed that he would do something similar to that. In every single one of his movies that he had had. He had a kind of a baptism resurrection, or death resurrection image that went into water and came out. In Roma, they have the same story. The lady in Roma goes into the water and to save the child, and then she brings them out, and then they have this, like, moment of reconciliation. Like, everybody kind of comes together, like in this almost communion moment. And you think, my goodness, like, seriously, you never notice. Did you do that? To me, it's a. It really isn't."}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":3032.58,"end":3033.98,"speaker":"Matthew Miller","text":"But he didn't deny that he did that."}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":3033.98,"end":3061.05,"speaker":"Jonathan Pageau","text":"No, no. He was like, yeah, yeah. He thought it was awesome. That's why he liked the videos, the interpretation video so much, because he's like, oh, that's great that I. But I just never knew that I did that. I think it's great that now I've seen this pattern in my movie making. But it just. Like I said, it just shows you just how underlying the stories are. You can use them without even knowing that you're using them. It's like that. It really is like a reference in our existence that just basic tropes, you know?"}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":3061.29,"end":3074.41,"speaker":"Matthew Miller","text":"I remember writing a song with a friend of mine when I was very young, and we ended up spending hours writing this song and we kept singing it and then we go, why, this sounds really familiar. And we pulled up another song and it was the exact same song."}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":3074.41,"end":3075.41,"speaker":"Jonathan Pageau","text":"It was the exact same thing."}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":3075.41,"end":3097.01,"speaker":"Matthew Miller","text":"Oh, we probably ripped it off. It was so much in part of us, we simply just started regurgitating what we had already, what we already know. And that so often happens. I mean, artists are not just regurgitating, but they're creatively working. I don't know if you've seen the Axis of Awesome, the show. The Axis of Awesome, not the show, but the group. And they take the four chords that are in every song."}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":3097.01,"end":3097.81,"speaker":"Jonathan Pageau","text":"Oh yeah, I've seen that."}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":3097.81,"end":3106.45,"speaker":"Matthew Miller","text":"Yeah, I've seen that of different songs. And it's like everybody does it because we only have so many chords to play, right?"}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":3106.45,"end":3151.72,"speaker":"Jonathan Pageau","text":"And there really are just so many patterns that you can actually tell the story with. Because like a story is basically that. It's a. You know, it's that. What is it? This, this idea of the U shaped, this U shaped story, this basic pattern. I remember when we were younger, my brother and I, we would, we would try to take the dumbest, like the dumbest pop songs, like, and then we would, we would show that they had cosmic patterns in them, like Red Hot Chili Pepper song and show that they had like this, this, this, this cosmic image in it. And, and I don't think we were making it up at all. Like it was just. You need a pattern in order to create any coherent unity. And so it's like, okay, here in the story I can show you, like here are the elements. Everything kind of follows this normal pattern."}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":3152.12,"end":3153.56,"speaker":"Matthew Miller","text":"Yeah, absolutely."}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":3153.96,"end":3164.38,"speaker":"Jonathan Pageau","text":"It's hilarious. So what are your plans for your channel? Like what are you, what are you. Because for a while I think you kind of slowed down and I. But I saw you, you seem to be picking up pace again."}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":3165.65,"end":3196.68,"speaker":"Matthew Miller","text":"I've been doing about three a year. I mean, I'd like to do more, I'd like to do it faster, but I really kind of a perfectionist that way. And I feel like I don't want to just. I don't want to say what other people have said. Simply that I like to say things that are new and I like to get to the heart of something. So sometimes I'll be working on something and I'll find something new. I'm like, I got to rework the whole thing again. So right now I'm working on Arrival and I've been working on Arrival. I started with a three part series on Memento, Arrival and Signs. I'm in arrival right Now I just did memento."}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":3197.48,"end":3200.68,"speaker":"Jonathan Pageau","text":"Are you gonna do science too? Yeah, I've been wanting to do science too, because that's a great."}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":3201.08,"end":3227.47,"speaker":"Matthew Miller","text":"So I think the way I was gonna take it is I'm kind of doing about interpretation, meaning and the problem of evil. That's where it's headed. The question is that in science, the reason I thought about doing science, not just signs in itself. I think signs in itself is fairly straightforward. But. Yeah, but how do we answer the problem of evil? And that's the question is how can a loving God, all loving, all powerful God, allow evil and suffering?"}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":3228.59,"end":3230.19,"speaker":"Jonathan Pageau","text":"You're gonna answer that question there?"}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":3230.67,"end":3268.93,"speaker":"Matthew Miller","text":"Yeah, I think science answers the question, but it answers it in a narrative format. And if you go back with memento is the question of interpretation of meaning. Memento fragments meaning by having the person be with short term memory loss. And it works everything backwards. And it comes from that phrase or it works with that idea from Soren Kierkegaard that says that life can only be understood looking backwards, but it must live forwards. And if you take those two ideas together, it means that temporal life can never be understood as. Because we don't have the complete context yet. Let's go back. Going back."}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":3269.33,"end":3277.09,"speaker":"Jonathan Pageau","text":"Yeah, that's what signs. Oh, you're right. That. You're totally right. That's what signs does. It's like nothing makes sense until the final moment and then it all comes together."}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":3277.09,"end":3360.1,"speaker":"Matthew Miller","text":"Yeah, absolutely. And when you get to the idea of signs, it's the idea for most atheists and Christians, you have the idea of, we all know that evil and suffering exists. Right. We look at the world and that's what we know. It's very plain that that shouldn't have happened. That felt bad. There was nothing that child did. There was no moral order, at least apparent moral order in what took place. And that child, apparently, from what we see, will never get anything back or receive anything good from that event. And so people say, that can't be. I think Bry has a thing out there about how dare you? God. If I ever met God, how dare you? You're evil. So Christians and atheists both look at that data, but they come to very different conclusions. So that the atheist looks at that and says, and this is just like signs. If you watched halfway through signs and you got halfway through signs, you would say, oh, God isn't good. I mean, he couldn't be because, you know, all this stuff happens. Yeah, his wife dies, his daughter, you know, has a problem with water. You know, I mean, these aliens are Coming. His brother didn't make anything of his life. You know, his life is a wreck. Living with his brother and working at a gas station when he could be playing baseball. But something bad happened. So you get to the center point, and that's in essence, in our lives. We get to the center point of our lives and we looked at the past and we see these bad things have happened, and we have to make a determination. What does our future hold?"}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":3360.57,"end":3369.53,"speaker":"Jonathan Pageau","text":"I love you. Say the center point. Are you making a Dante reference consciously or not? Happened at the middle of my life. That's when he has his vision. Anyway. Sorry, go ahead."}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":3370.09,"end":3429.07,"speaker":"Matthew Miller","text":"Lost in a wood. Yeah, yeah, the first Canto. So the idea is, so we're making a determination, and it's a faith determination, because neither the atheist nor the Christian knows what's going to happen in the future. But the atheist prejudges the future based upon the knowledge of the past. And their knowledge of the past is bad things have happened. Therefore the future will only be as it. As it was in the past there, because we see that there was no more order in the past. There was no God, there was nothing there. Therefore the future will be exactly like that, too. The Christian comes to it and looks to the past and says, I know that evil exists, but I also know that pain and suffering can lead to a good result. So, for instance, my father disciplined me and I became a better person as a result. You know, I tell the story of my daughter when she was younger, she had the flu and they had to. I had to hold her arm down. This is when she's like less than 1 years old and they had to put an injector with some medication. And she looked at me in terror as they put a needle in her arm."}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":3429.07,"end":3430.31,"speaker":"Jonathan Pageau","text":"What are you doing to me, Daddy?"}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":3430.63,"end":3530.02,"speaker":"Matthew Miller","text":"She has no idea what I'm doing because I'm doing it for her good. She has no idea. But she looks at me like I'm evil. But I had to do it in order to not save her life. But I mean, in terms of making her feel better. But the point is that Christians look to that and they say, well, if that's true of the past, if good and evil and suffering can happen, we can look to the future and say, well, that could be true in the future. Neither the atheist nor the Christian know with certainty what will happen in the future. But the Christian stands in faith, just as the atheist stands in faith and says, I believe in a future that will be like that. And that's part of the Hermeneutic circle, because we don't have the complete story yet. The story isn't finished yet. We haven't seen it all written. What we have is a promise, a hope written in the Bible, but we haven't seen it with certainty yet. And therefore we come, as you said, with symbolizing our lives with that expectation and that hope, writing that story into the things we do in our lives. How we build our buildings, how we go about our actions. And I think that's the answer. The problem, the answer to the problem of evil is, is that it could be. And it's a matter of faith. And the fact is, is that by faith, by living in faith, we actually do in some sense bring about the future that we hope for. That's right. In some sense that, that's an existential idea, is that we, we become who we want to be. We make the future, we want it to be as we want it to be. And so by believing in God, by believing in Jesus, we are in some sense participating with God and bringing about the future that he has promised us it will be."}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":3530.1,"end":3590.94,"speaker":"Jonathan Pageau","text":"Yeah, yeah, I agree. I agree. And I think that there's also, in our very perception of the patterns, like I said before, that we also see a hint of what you're talking about because we can see that for the world to exist, the accidental and the arbitrary actually have to come together into a meaningful pattern or else the world doesn't exist. Or else it's just. It's just, it's just dust. And so because we see that and once we understand, once we perceive that's how logos operates in the world, then we can understand it. We can also see that. Yes. Okay. So it means that the big story will also have to have that element where things are going to have to come together in a bigger story than the one I can even perceive, because I see it at every level of reality. And so even the one that, that I can't, that I'm participating in, let's say that I'm a part of, and looking, trying to see how it's all going to coalesce, that it should follow the same pattern, you know, because that's just how the. That's how the world exists. It's like there's no other way for the world to exist besides that."}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":3591.18,"end":3681.24,"speaker":"Matthew Miller","text":"And that goes back to art. And in terms of how we interpret the meaning of our own lives, we have this idea that I can make meaning for my life, and my life is meaningful because I declare it to be meaningful. Yeah. So, you know, Atheists will say, my life is meaningful without God. God doesn't make anything meaningful. My life can be meaningful, etc. But the problem is with that is that in terms of the hermetic circle is that meaning is bound up in context and that it's bound up by the people who understand the meaning. So a language is meaningful because there are people who speak the language. Right. So I understand what you're saying because we both speak English and so on and so forth. But if you get outside the boundaries of what English is, English is no longer in some sense meaningful. Now we can agree to be meaningful. But as you extrapolate out, meaning is only found in humanity, in humans, we interpret the meaning. And what happens is that as you extrapolate further and further out into the context of the universe, if there is no God, if mind is not the fundamental aspect of the world, yeah, then there is no meaning because ultimately all of this is going to be gone. You know, there will nothing, nothing holds it together. And if that's the atheist perspective, and I think that, you know, so people say, well, I can make meaning for my life. Well, I mean, in some sense you can't, because in terms of the macro, you might think you're creating meaning, meaning for the moment, but there ultimately. There's nothing that is ultimately meaningful. Yeah, it's all meaningless. But I think."}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":3681.24,"end":3743.62,"speaker":"Jonathan Pageau","text":"I think that we're at a good time in terms of a lot of philosophers and a lot of scientists. Not a lot, but at least a good few, even atheists or even agnostics are starting to notice the problem of consciousness and the problem of meaning and qualia and the notion that things have qualities in the world and are realizing that we have a problem. We have a problem because like you said, meaning seems to be an elementary constant constituent of the reality. Without it, we don't have anything. We just have quantum flux. Like, we just have this field of, you know, of nothingness. And so it's a good time. I think it's a good time for people who understand Christianity in an ontological way that we understand that what we're talking about is not just these arbitrary stories. We're talking about how reality actually exists and how we can participate in that existence. I think. I think it's an interesting time. I don't know if, you know, if you ever heard of Saint Maximus the Confessor and some of these fathers, like Saint Gregor of Nyssa and Saint Maximus the Confessor."}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":3743.86,"end":3744.94,"speaker":"Matthew Miller","text":"I've heard of them. I haven't."}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":3744.94,"end":3804.65,"speaker":"Jonathan Pageau","text":"I haven't read you might enjoy Saint Maximus because he really, I think he gives us the key today in terms of how Logos exists in the world and how as human beings we are, you know, the image of God in the world and we actually gather all of phenomena into ourselves and then we, we kind of offer it up to God and we become also the receptacle of that grace by which the world kind of holds together. And so it's like the human being and the incarnation being the summit of that. Like the ultimate version of that is this place where all the meaning kind of comes together. And it seems to be a manner of speaking which people can understand today, which people who are not Christian, don't even believe in God, can kind of say, okay, all right, I know what you're talking about. At least you're not just talking about some bearded guy in the sky who sends lightning bolts. You're actually talking about reality. All right, Matthew, I really enjoyed this conversation. I definitely had a lot of fun. I would suggest there's a lot of people that you should talk to. Do you know, have you heard of Paul Vanderklay?"}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":3805.21,"end":3806.89,"speaker":"Matthew Miller","text":"I've heard of him, but never met him."}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":3807.29,"end":3817.05,"speaker":"Jonathan Pageau","text":"He would love. I think he would like to talk to you. You probably really enjoy talking to him. There's a few other people as well. And we could maybe we could also organize another talk at some point."}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":3817.21,"end":3829.17,"speaker":"Matthew Miller","text":"Absolutely, absolutely. Very much enjoyed it. Yeah, it's great to find someone who is engaged and interested in this stuff. As like I said, my, my world is not. I would look for people who are really engaged in this stuff and they're like, wow, that's kind of interesting."}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":3829.17,"end":3865.78,"speaker":"Jonathan Pageau","text":"But that's what, that's great about the online space. That's the one, One of the positive things about the online space, I always joke with people. I'm not joking. I'm actually serious when I tell people that before I started making these YouTube videos, I never talked about symbolism with anybody. Yeah, I don't talk about that stuff because it's not. It only matters to a certain very small amount of strangely minded people who kind of see these patterns. But for most people, you know, if you're living a good life, you believe in God, you pray, you go to church, you don't need, you don't even need this. Like, you're fine, keep, keep doing your thing. But for some people, they, because they have this intuition, it's, it's helpful for them to, to see through the veils."}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":3865.78,"end":3868.07,"speaker":"Matthew Miller","text":"You could say, absolutely, absolutely."}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":3868.39,"end":3874.15,"speaker":"Jonathan Pageau","text":"And so all the best with your channel and we'll all be looking forward to seeing more content and. Yeah, hopefully we'll talk soon."}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":3874.47,"end":3875.43,"speaker":"Matthew Miller","text":"All right, see you later."}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":3875.43,"end":3900.83,"speaker":"Jonathan Pageau","text":"All right. I hope you enjoyed this episode of the Symbolic World. The Symbolic World is edited by Justin Ward and it is based on a series of videos that you can find on my YouTube channel, Jonathan Pageau's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that."}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":3900.91,"end":3902.67,"speaker":"Jonathan Pageau","text":"In the show description."}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":3902.91,"end":3913.07,"speaker":"Jonathan Pageau","text":"And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by."}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":3913.07,"end":3917.79,"speaker":"Jonathan Pageau","text":"Of course, leaving a review on itunes. Everybody knows that's the best way to."}
{"episode_id":"SW - #064 - 2019-10-12 - Matthew Miller - Logos Made Flesh","start":3917.79,"end":3942.1,"speaker":"Jonathan Pageau","text":"Get the podcast out there to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon Pageau videos as well and on subscribestar. All those links you can find on my website or in the show description. So thank you and I will see you soon."}
