{"episode_id":"SW - #012 - 2018-08-16 - Pentecost For The Zombie Apocalypse","start":0.8,"end":1.32,"speaker":"Jonathan Pageau","text":"Hello, everyone."}
{"episode_id":"SW - #012 - 2018-08-16 - Pentecost For The Zombie Apocalypse","start":1.32,"end":93.79,"speaker":"Announcer","text":"I'd like to welcome you to the 12th episode of the Symbolic World podcast. On this episode, I'm going to play for you a talk that I gave at the 40th Annual Diocesan assembly of the south of the Orthodox Church of America. When I was invited to give this talk, I was very surprised that they chose me. I was a bit. I didn't quite know what to think of it. And so I decided that I was going to give the most provocative title that I could think of, which is. And it immediately came to my mind that it's going to be Pentecost for the Zombie Apocalypse. And I was kind of half expecting them to tell me that I needed to find another title, but to my surprise, they said, yeah, exactly. That's what we want. We want something that will keep people's attention after a long day. And so I went ahead and prepared the talk. And it ended up being one of the talks that I've given that has attracted the most attention. It has been reposted by the American Conservative. Rodrier did a few of his posts on the article. It was also republished by a journal called Another City. And so I hope you enjoyed. Brings together a lot of my thought regarding how the world works and how I believe Christianity and the church can exist in the world. And so enjoy."}
{"episode_id":"SW - #012 - 2018-08-16 - Pentecost For The Zombie Apocalypse","start":106.39,"end":3239.78,"speaker":"Jonathan Pageau","text":"This is Jonathan Peugeot. Welcome to the symbolic world. Your Eminence and Reverend Fathers, I want to thank you for this. This opportunity to speak to you. When I gave the title of my talk, I didn't know I would be speaking during the dinner. And so it's a rather awkward time to talk about zombies. So I decided I was going to spare you the grisly details. So I've chosen images that are cartoons and from children's images. And so actually, although they're meant to be whimsical and funny, they might be more frightening because that's what they're trying to be. So we live in a time of monsters. I announce this to you, but I think all of you already know that we only need to glance at popular culture to realize this. At the narrative level of our culture and our stories, we've become obsessed with monsters, with the strange aliens, with the marginal, with the glorification of the exception of things that don't fit. Most of us here probably grew up with Sesame street, where we were told that monsters are our friends. And it's no longer in fiction. By now. The monsters have left the dark spaces under our beds. They have left our nightmares to come out into the open at A social level. We can feel and see all around us the growing polarization, the acceleration of what we can only call the breakdown, the decomposition of culture, a progressive dissipation of the center which rallies us as a society. And in thinking about this, it's difficult not to reminisce, it's difficult not to meditate on the famous poem by Yeats, the Second Coming. And we tend to go back to that poem because it seems, at least in our more frightening moments, we get the feeling that the horrific cycle of the 20th century is on our horizon again, Turning and turning in the widening gyre. The falcon cannot hear the falconer, Things fall apart, the center cannot hold. Mere anarchy is loosed upon the world, the blood dimmed tide is loosed, and everywhere the ceremony of innocence is drowned. The best, like all conviction, while the worst are full of passionate intensity. This poem of which I've quoted the first part, is probably one of the most known in modern poetry, the most cited, I think. It's actually the most anthologized poem there is. And it rings so true, because we stand here in that widening gyre, at the edge of the world, where the wheel is spinning so fast it feels as if it's going to come off its axis. And it is here, on the edge, that we find the zombies wandering aimlessly in a world that's losing its center. Unlike most of his monstrous zombies, unlike most of his monstrous brothers, let's say the zombie is truly the harbinger of contemporary nihilism. The zombie has no magic. The arrival of the zombie usually has no clear reason, but rather the zombie is couched in a biological accident, a disease, a place, plague. It's simply an animated corpse. The zombie inhabits the indeterminate space of living death, roaming around in packs. The zombie shows us the mindless wandering of the mindless mob, with an insatiable hunger for devouring others, for swallowing life. If the vampire is the monster of aristocracy, the the zombie is the monster of the mass, of the demos, the monster of the accidental, of quantitative leveling. The zombie is the atheist, insistent on the illusion of free will. It's an image of nihilism in idiosyncrasy, taken all the way to decomposition. In every major city in North America, they have these events, they call them zombie walks, and people dress up as zombies and walk in the thousands down the streets, dressed up and made up to look like corpses, shifting around with dead, empty eyes, pretending to be the walking dead. Some of these are huge. If we were generous, we could say that it is a zombie procession, we could call it. You could say that they're liturgical zombies, if there's such a thing. The zombie both typifies the mob, while simultaneously the absolute individualism, the absolute isolation, contemporary life. The zombies in a horde only interacts with what they desire, and they never interact with each other. And the trope of cannibalism is very ancient. It's there in all the ancient stories, all the ancient myths. But the tweak in zombies on that theme of desiring to eat the brain, it's a very powerful one because it's truly the image of the nihilist, because the zombie is a creature without meaning, without intelligence. It misses any form of personhood, and it has this insatiable desire which mirrors what it lacks. It desires what it lacks, identity, meaning. And this desire appears in that materialist reduction of identity and personhood to that clump of cells that we have up in our cranium. The zombie wants to eat your brains because it cannot eat the mind and it cannot inhabit the mind. Strangely enough, this desire to eat the living is the extreme perversion of our desire for communion. And it's also a distilled image of all our passions. Our attempt to fill the unquenchable yearning through our passion always transforms other people into commodities that we think will bring us what we need. So the zombie is both an image of the social breakdown, the person as a meaningless statistic, the disappearance of common values, except the overwhelming desire to consume. But so it is also the breakdown of the person itself into a soulless, desiring death machine. There's a strict analogy between these different levels of the world. The social breakdown and polarization is to the state, with the abandonment to the passions is for the person. The zombie is both of those fragmentations at the same time. So as we pull back a bit, as we look around, as the narrative fabric of our world begins to fill in quantities that are barely possible to believe, with images of the monstrous. As we feel the world being torn apart by fragmentation and conflict, we are simultaneously as individuals, being constantly assaulted by images, images, with the purpose of awakening our own desires. And we've come to the point where we, most of us, so many of us, have been accustomed to the constant exposure to the stranger and stranger fringe of desire, whilst being enticed by the siren song to indulge, to give into the waves and the storm and to sink into the mire. Now, as we here, hopefully, who still hold on to a liturgical world, not the zombie kind, the divine kind, a world which strives out of pattern and purpose. We can both stand in a church where Christ in the dome is the origin of the heavenly hierarchy of beings. And we also know that we can find Hezekiah in our heart, in our center, as a gateway to the divine and as the manager of the passions whirling in the widening gyre. Just like our individual unholy unions with death appear on the edge of our beings, where through an excessive attachment to our senses, we mingle with our passions and produce our own aberrations. The cosmic monster lies on the edge of the world. The edge and the end of the world, those two things, the edge and. And the end, they represent the same structure. They're the same thing in our stories. And so even when he is a zombie, man is a microcosm. The notion that a movement towards the edge and a movement towards the end are of similar nature is one which is right there in the beginning of scripture. When Adam and Eve fall, they are told that they will die. But that's not immediately what happens, is it? In fact, what happens is they move away from the central tree, past the walls of the garment of the garden, and out into the wilderness. And similarly, Adam, as he moves out from the center into history. Adam and Eve are given garments of skin, an outer layer of animality, an outer layer of death, to protect them from death. And if our mind is struggling to get a sense of what that means, it's very difficult to understand what that means. That we were given a protection of death, a layer of death to protect us from death. I always think of a vaccine. It's probably the best image for that. The garment of skin is seen by the Church fathers as all that is added to our nature in the world of the fall. The layers of society, of technology, and those are the flip side. And in a way, they're of the same nature as our weakness and the passions which come from the world of death. Saint Gregory of Nyssa tells us that the hairs on our body are a symbol of death. They're without feeling and dead, and appear as our spatial extremities, the very limits of our garments of skin. Just as death appears as our temporal extremity of this earthly life. The giants in the Bible, those that appeared before the flood, were the sign of confusion and mixture, wrapped in inappropriate sexual desire. In the tradition of Enoch, they are seen as the origin of technology and magic, and they were known to create hybrids. They were full of excess, reveling in conflict, until absolute chaos could no longer be held at bay. And the world was undone in the waters. The ceremony of innocence was drowned in sophisticated, hybrid, non binary, fluid categories. And in a very parallel way, the ancients described the world geographically as a giant island surrounded by a vast ocean whose fringes were inhabited by impossible monsters. These signs of the breakdown and the confusion, the confusion of categories, which is death, basically, the cosmic garments of skin, these images that I'm showing you are based on the descriptions of the faraway races by the first century, Pliny the Elder, who died during the Vesuvius eruption which destroyed Pompeii. So now imagine how Pliny the Elder would have described these faraway specimens. But I need to be careful, because as we stand here, possibly in that widening gyre, possibly nearing the teetering edge of the world, it would be too easy to point and say, there they are, right? There they are, the degenerate ones, There they are, the monsters, and thank God we're safe in the church. Like I mentioned, and like I'll be saying all through this talk, the same chaos which lies on the edge of the world also lies on the edge of each one of us. But I think it's still possible, though, to look around and to read the signs of the time. So how do we make sense of this as we look around us and find the flood waters rising? How do we navigate through the growing chaos? In the back of my mind, there's a saying which plays over and over, maybe in the hopes of convincing myself, and it is the last promise made by Christ before his ascension. Behold, I am with you until the end of the age. And we know as orthodox Christian, that this promise also implies that Christ is with us until the limits of the world, with us until the bottom of the world, the bottom of death, where Christ crushed the head of the serpent as he descended into Hades. The promise Christ made when he was about to ascend to the Father is the promise of Pentecost. It echoes the promise of the Spirit that he made in the Gospel of St. John, chapter 14. Pentecost is the possibility of moving in Christ from the upper room, from the top, from the highest place, or from the center, let's say, no matter how you frame it, but to move in Christ until the end of the world, until the end of the age. It is the church ablaze, a fire that spreads and consumes until the age itself is consumed. But like the fire that Moses saw in the Sinai, the church is not consumed. The icon of Pentecost is a cosmic image. It shows us a type of multiplicity, a type of Multiplicity, which is not fragmentation, a type of multiplicity, which is not the decomposition of our time, but is a multiplication which does not forget its center. In the terms of the philokalia, as we move into multiplicity, Pentecost is the possibility of. Of the remembrance of God, the remembrance of God even unto death. If we look at the image, we see the icons are seated in an arch which is a proxy of the Church itself. The icon of Pentecost is one of those icons which, although it does represent an event in the Bible, it represents it in a manner that goes beyond the event and becomes a permanent image of how the Church is exists in the world. And the hint that this is the case is that although St. Paul was not there at the event in the Bible, he is represented in this icon. And here St. Peter and St. Paul are represented together as the pillars of the Church, as the left hand and right hand of Christ. Above the apostles is the holy fire which descends on them. This fire separates into 12, just as the apostles themselves, each acquired tongues of fire, tongues which speak in a manner that can reveal Christ through multiplicity and be heard by all men. And then down in the bottom of the icon is the door which leads outside the upper room. It is the door which leads out into the outer darkness. And in the door is represented the allegorical figure of the cosmos itself, which holds the scrolls, the fully manifest form of the 12 traditions issued by the one fire, the one church whose unity is preserved in its multiplicity. And of course, the door of Pentecost is the door of the Church itself. The Church considered at all levels of interpretation that we can understand that statement. It's both the door of the Church in the sense of the cosmic body of Christ, but it's also the door on the building of your local church, the door which leads out of the nave, out of the narthex, into the chaotic outside. Now, in earlier traditions of the Pentecost, what was represented in the door was not the synthetic image of cosmos. In the very earliest images that I could find in this form of Pentecost, they all come from right after iconoclasm, and they represent an empty door. But very soon in the door was represented a crowd of foreigners, all with different hats and different clothing and different shades of skin color. This is one of my. This is one of my favorite versions. It's from a. From a Serbian monastery. And here the. The door of Pentecost is actually a window which leads outside of the church. And the foreigners appear, coming towards the church from the edge on the sides there's a tradition from Armenia which portrays a monster in the door of Pentecost. The monster is either a dog headed man, a Cynocephalus, or else it is truly an unnamable monster, a kind of chaotic being with a dog face growing behind its head. This was the image that I chose as a first slide of my presentation. Now, the first time I saw this image, I came across it in a book and I was startled beyond belief. I mean, I guess you can imagine. But as I began to understand the image of Pentecost, I realized to what extent this is a testimony to the totality of, of what Christianity is meant to be, to the true possibility of God being all in all. The monster as an inhabitant of the margin is a token of that which does not fit within what we know cannot be measured in the categories that we are aware of. It appears as a, as a freak, as the ultimate unexpected. So the monster is both the encounter with the surprise of the future as we move forward in time. So to encounter the unexpected, the monster is also the encounter with the surprise of the edge, as the church expands to the dark corners of the world, but also the dark corners of our own lives, as the spirit of God transforms us. For most of us there will always be foreign elements, monsters hiding in our garments of skin. So here in Pentecost, this monster is represented as not yet in the church, but as part of the potential into which the church can grow, as part of that which can hear the gospel in its language. And I want to issue. I just before I keep going, I want to issue a caveat. If there are some cryptozoologists in the room or like conspiracy types who talk about lizard men who live under the earth, like, you don't have to identify yourself, but this next part is for you. We have to be extremely careful when we read ancient accounts. We don't want to interpret them in our rather materialistic categories of genus and species. In the Bible, a bird is an animal with wings. So a bat is a bird and a fish is something in the water. So whales and dolphins are fish. And so we don't have to imagine some kind of cynocephalic people out there that would have some genetic relationship to dogs. And any more than we should think that a hippopotamus or a river horse need have a genetic relationship with horses, just as the ancient call those they could not understand barbarians, that is those who bark like dogs. The notion of dog headed men appears as this encounter with an aspect of Humanity, which we can barely see because they're far, so far removed from our capacity to properly see them. If I hear someone speaking Cantonese, I am not going to understand them. I will hear chaos. And if it's difficult to have that experience now because we've seen everything. But if you just maybe imagine seeing an Australian bushman 500 years ago, it is possible to see chaos. The notion of the cynocephalous has an important history in Christianity. It comes, of course, from the Hellenic past, from the legends of Alexander the Great. But the image of the dog headed man became the central image of the Christian edge of the world, the ultimate hostile foreigner. And personally, I think that it partly became so important to because of its strong analogies. In the Bible, Christ speaks of the Canaanite woman, and he tells her that one should not give to dogs the bread that is meant for the children. And the answer of the Canaanite woman is analogous to what we see in this icon, that even the dogs eat the crumbs that fall from their master's table. So here in the icon of Pentecost, we see this dog not so much at the end of the table, but maybe on the edge of the church, maybe on the edge of the world. This one is not a Canaanite, but a Canaanite. And that might seem like a really bad pun, but I assure you that it will cause modern interpreters to cry foul in reading these ancient accounts and will say that all of this question is just a matter of bad transcription. I don't think so. All these foreigners in the icon of Pentecost culminating into the impossible monster are the surprise we discover on the edge of the church, anticipating, maybe waiting for the crumbs, maybe waiting for the antidoron, which we can imagine flowing out of the church, so that even those we can barely recognize as our brothers can have a foretaste of the kingdom of heaven. Now, the most famous dog headed man, some of you know where I'm going with this, is of course Saint Christopher. Saint Christopher's traditional icon represents him as a dog headed warrior. There are many who have tried to say that this tradition of St Christopher as a dog headed man is late and like I said, is just a misunderstanding of ancient texts. And I don't know, it depends what you mean by late. This is the first image of St Christopher we have. It's from the 6th or the 7th century, so it's before Iconoclasm, which means that we're lucky we even have this image. There are probably many more, but They've just been destroyed by the iconoclasts. It's a ceramic icon depicting him next to St. George, each killing snakes. And this is just one of my favorite images in the world. So here is the monster and the monster killer, two warriors facing the dragons. And it's funny how they keep telling us that the legend of St. Christopher killing the dragon is from the 12th century or something. So yeah, it always seems like scholars are telling Christians that we're deluding ourselves and that a world cannot exist without a textual reference, but here it is. So there was an attempt to eliminate this icon in the Russian synodal period because it did not fit modern sensibilities. And I've had many people, especially priests, tell me that they're really bothered by this icon. And it's funny because although I have tried to explain it in a certain manner, defend it. For example, I wrote an article about St. Christopher in the Orthodox Arts Journal and it is one of our most popular articles. It has been viewed over 20,000 times. When an article about a dog headed saint is one of your most popular articles, I would call that a sign of the times, people. But having said that, I would be a bit disturbed myself if we were not at least bothered by this icon. I mean, my goodness, it is a dog headed man after all. And I think that in a way that that's the point. I think that that's the point. I always like to say that St Christopher, the icon as St Christopher is the last icon. It's on the very edge of iconography. And because it is so, it will always appear as ambiguous and straddle the border of what is acceptable or unacceptable in icons. In the Greek tradition, The icon of St Christopher was actually placed above the exit door of the church so that it would be the last thing you saw going out into the world. And in the West, St. Christopher was placed on bridges where he would represent the uneasy space of the transition, the in between space. I think St Christopher is crucially important to understand right now. Basically, I think that St. Christopher is the patron saint of the end of the world. And although he's not my official patron, I would say that he's become so unofficially, having lived abroad for many years and having traveled much, I've witnessed many miracles and I've seen many signs surrounding his presence in my life. So this is the icon that hangs, one of the icons that hangs in my workshop. And also I think that we'll need St. Christopher when the zombies come. So as we face the rising chaos, as we face the zombies. We recall the world. The words of the psalmist, I am surrounded by my enemies who are like lions hungry for human flesh. These the immediate danger is that we become afraid, like St. Peter walking on the waters. There's a trope in zombie stories according to which, no matter how bad the situation is, no matter how bad the zombies try to get in, the true danger lies within. The true danger lies in how the human group shuts themselves off and completely isolates themselves and become pathological in their isolation. The fear of facing the possibility of the flood is to think that, as in the story of Noah, the door of the church must be closed and sealed shut. Maybe we can get together and isolate ourselves completely. I mean, it's tempting, isn't it? And we've heard some intimations of that tendency recently. But Christ promised us that the gates of hell will not prevail on the doors of the church. And I'm not saying here there isn't a time to seal the door of the church. Obviously, that's what we do, at least symbolically, after the exit of the catechumens. We should and must protect our mysteries. In fact, it rather seems sometimes that we've been sheepish in doing so. I want to show you something. Once I encountered an image of Pentecost from a medieval Coptic church. Can you see the difference? It was the first time I saw an icon of Pentecost where the door was closed. And it disturbed me profoundly to see such an image. And it took time before I understood why such an image would even have come into existence. And I realized, at least, I speculated, that the cops had become so beset on all sides by their opponents, had been so besieged in their dhimmi status, that it was inevitable that they represent the door of Pentecost as closed. And it's food for thought. But to see such an image should make us weep and pray that even as we become besieged, we find a way to keep the door of Pentecost open. For if we close those doors, we abandon the world to its fragmentation. So I want to tell you the story of St Christopher. You've all heard it, but I want to tell it maybe in a different way. The version of the story which we know best actually comes from the Western tradition. In the Western tradition, St. Christopher is not a dog headed man, but a giant. He's not a Canaanite, but a Canaanite. And an important way, he's a Cainite, that is a descendant of Cain, who associated with the Nephilim, the giants of The Genesis flood. So although he's not a dog headed man in the western tradition, and some people have felt safe and represented this version of the icon in their churches because they didn't like the dog headed version. And that's understandable. But even though he's a canine, St. Christopher is still like the Canaanite woman, that dog on the edge of the table who asks Christ for the crumbs. So as hard as you try, you will not get the dog out of St. Christopher. These are a few hybrid icons joining the western tradition with the eastern one. The story of St Christopher has him as a vicious warrior in Canaan who is looking to serve the most powerful man in the world. He founds the most renowned and powerful king until he sees that this king is afraid of the devil. So he goes to serve the devil. And in this we can see St Christopher going all the way to the end, all the way to the edge of what is imaginable, and becoming a servant of the evil one directly. Then St. Christopher notices that the evil one is afraid of the cross, so he decides he will serve Christ. Now, in the story, at least in the version that's in the Golden Legend, St Christopher is also a trickster because he tells those he serves. For example, he informs the king that unless the king tells him who the devil is, that he will no longer serve that king. But in answering St. Christopher, this becomes the very reason why St. Christopher stops serving the king and then looks for the next most powerful person, which is the devil. And then he does the same to the devil. He tricks the devil himself in revealing Christ to him. We need to pay attention to this detail because I think it's an. It's. It's an image of what St Christopher can be for us. The key to the double inversion which transforms the fall and death into resurrection, the trampling of death by death. In his search for Christ, he comes to a hermit in the desert who teaches him the way of Christianity. But when it comes to the practice, St. Christopher cannot follow the rule. He cannot follow the standard. I mean, he is a monster after all. The hermit says to fast, to abstain. And St. Christopher replies that he cannot. The hermit says to pray. St. Christopher says he cannot. So the hermit says that St. Christopher should stand next to the river and cross those who need to cross his shoulders. I want you to notice how profound the story becomes here. We often think of the ark built by Noah as a holy thing. In a certain way it is. We often imagine the nave or even the whole church as A holy thing. And in many ways it is. But in another very, very important way, the ark is a boat full of beasts, and the church is a hospital full of the sick. So St. Christopher stands on the edge of the world. He stands on the bank of the flood. When the Logos, the Christ, Emmanuel, who is the Logos implicit, the seed of God in all things, comes to the edge, well, it is the monster, like an ark, who can carry him across. I want you to think of that hermit. You see, the hermit did not tell St. Christopher that it was fine, that he could not follow fasting and prayer. I mean, he didn't say that since St. Christopher, you know, thought that he was against his nature to fast and pray. The hermit didn't tell him that the church had been wrong all along. No. But the hermit, in wisdom and in economia, he brought St. Christopher to the edge. He brought St. Christopher into the narthex on the edge of the flood, where he could be the ambiguous figure he was in the first place and eventually and mysteriously become vehicle for his Lord. There's a woman who comes to our parish. Her name is Margielyn. Marjolain is homeless, and if sometimes she's able to find a place to stay, it never lasts long. She's never able to find stability. There's something, some thrust in her which makes it impossible to remain stable. Generous people from the parish have tried to help her find a place, to help her find some stability, but it never lasts long. Margeline is a hermaphrodite. Her appearance is confusing as she straddles the limits of what we understand, straddles the limits of the normal categories that constitute the world. Marjolaine is paranoid and possibly more. When you speak with her, she jumps from one thing to the next, one subject to the next. Her conversation is disjointed and fragmented. To speak with her is to feel like she's constantly under attack. Marjolaine comes and sits in the narthex, and she usually stays there for the whole service. And very rarely she gets up and she walks into the nave and she sits down in the nave, but she always stays just for a few minutes and then she returns to the narthex. We've invited her to come in. Our priest has spoken to her, asked her if she wanted to be catechized, if she wanted to join, and join into full communion. But Marjolaine returns to the narthex. She waits until coffee hour. She eats with us and hopes that someone will give her some money before she leaves. Margieline has memorized the services. Sometimes she makes little comments about some detail, some small error or confusion in the service. Maybe the choir was off a little bit, maybe someone forgot some small detail. And she knows what's happening in the parish, the politics and the jostling, which sometimes takes place in human affairs. And we hear strands of that. We hear these hyper lucid comments. They appear as surprises in her usual frenetic conversation. One Sunday, Marjolaine reached into her backpack. She carries this backpack around with her. And she reached into her backpack and she took out these three small McDonald toys, you know, the kind of toy you get if you buy a Happy Meal. And she took these three toys and she gave them to my children. There's a tradition in Indian culture according to which to receive a gift from a beggar is to receive a blessing from God. There are those who whisper in the parish. I don't know who, but there's someone who whispering in the parish that maybe Marjalyn is an angel. Once in speaking to her, she told me that she also attends a mosque, that there is a Muslim couple who will often pick her up on Friday so that she can participate in the prayer. So I would ask all of you in that last sentence that I just added to that story, all of us, to examine what our hearts did when I added that last part. There are some of us here who might be too happy that I mentioned the detail about the mosque. And there are some here who might be too annoyed that I mentioned that detail. But Margalene just sits in the narthex. After all, there's something about the margin which always arises our passions. And so I hope that I brought all of you to a place that you're struggling to deal with the threat of zombies, the abundance of monsters, Saint Christopher, dog headed men, people who don't fit into categories. If you feel uneasy and a bit conflicted and confused that I was able to move from zombies to angel in one fell swoop, I. Sorry, I have to apologize. That was really the point of my talk. That's what fragmenting looks like. That's what a fragmented age looked like. The moment when order is not easy to inhabit because the world is filled with exceptions. There's something deeply out of place that I am here at a church conference talking about zombies. But that's where we are. That's where we are in the world. If we think we can deal with this age by simply shutting the door of the church, we are going to be in serious trouble. And if we think we can Deal with this age by letting in the flood waters, there is going to be serious trouble as well. So now what do we do? Well, how do we live? How do we love properly in an age of division and chaos? First, I think we need to look at the icon of Pentecost with some humility. The chaos of the edge and the end is death. But chaos is also an opportunity for renewal. This was true for the Sabbath, it is true for baptism, and it is true for Holy Saturday. And for goodness sake, it's true when we sleep. Most of us here are here today because the rigid categories which legislate society are breaking down. They've been breaking down for about three generations. If I was to ask everyone here what their ancestry is, how many are immigrants or children of immigrants, I mean, we are standing here in a church which came from Russia, and here we are in the south of the United States. I am a French Canadian Protestant who became an Orthodox icon carver. We are the image of the opportunity of Pentecost. I mean, would this gathering here would have even been possible 50 years ago? No, there's no way we can be here. Because in the breakdown of categories, things that usually would not meet can in fact meet. And I believe it's not for nothing that Christianity increased in the twilight of the Roman Empire, where the stretched multi ethnic multicultural vastness was oscillating between fragmentation, civil war, the iron fist of a Diocletian figure. But here's the kicker. Here is the side effect, the surprising side effect of our fragmentation right now, as we are watching the Western world being propped up as competing identities of race and gender and ethnicity and age, and, you name it, any identity you can imagine. And while simultaneously there's this paradoxical insistence that all identities and distinctions have to be dissolved, there are those who are not even in the church, not in any church, who are getting an inkling that maybe Christianity considered, even at its minimum, as a set of presuppositions. Maybe it was the only glue that ever held the west together, that ever kept the balance since the conversion of Rome, even as precarious and volatile as. As that unity sometimes was. And so I've been surprised to find myself facing all these people, these atheists, these people who don't believe in anything, who are suddenly looking at Christianity and Christian presuppositions. But of course, the same breakdown, they'll make no illusion about the same breakdown of society which makes this meeting possible, which makes some see that Christianity is valuable, is also the breakdown which makes the zombie scratch at our door. And it seems that every exception, every aberration, every proclivity is looking for its moment in the sun. Looking not only to exist in the margin, but to be given the stamp of full official recognition. But in the rising flood in the world filled with monsters, people are looking for meaning. People are so hungry for meaning. For the past year or so I have been on an adventure, on a crazy adventure that took me completely by surprise. I was asked to do some interview with some professor in Toronto on some random subject, and because of that I'm not going to go into the details, but all of a sudden I was being flooded with letters and letters of atheists, atheists who are looking around and are seeing the fragmentation as well. They're looking around and they're seeing the hemorrhaging of our culture and they're trying to ask what can we do to stop the bleeding. I mean, there are it's ways, but there's some peers where I get a letter, I get a long email every day of some recovering atheist who's moving away from their criticism, you know, of the 13 year old's version of Christianity and is discovering the cosmic vision of Christ and he's discovering the cosmic vision of his mother, whose womb is vaster than the heavens. There is so much to say to those people. I mean, we hold in our hearts the tradition of Christ, which connects through a beautiful braid of analogies, the personal, the social justice, the cosmic and the transcendent realms. And I have not tried to convince anybody, I have no desire to convince anybody. The only thing that I ever did was to show people the beautiful patterns that are in our tradition. The beautiful connections between scripture and the icons and the liturgy and the hymns. And people are so hungry for meaning that they just, it's like breathing. It's like, it's like all of a sudden they've been drowning and they can, they can take a breath. I'm not saying that all these people are going to become orthodox. I mean, I don't think so."}
{"episode_id":"SW - #012 - 2018-08-16 - Pentecost For The Zombie Apocalypse","start":3241.62,"end":3241.9,"speaker":"Announcer","text":"But."}
{"episode_id":"SW - #012 - 2018-08-16 - Pentecost For The Zombie Apocalypse","start":3241.9,"end":3576.1,"speaker":"Jonathan Pageau","text":"It'S a crazy thing. I got a letter from a man, a man from three days ago. I got a letter from a man in Pakistan, a man who was a Muslim and who in university, like so many people, became an atheist. Now he writes me and he says, I think I'm a Christian. I don't know. And I don't know what to do because I'm in Pakistan. Of all the Christians, we do not see the stories of the Bible, the stories of salvation is just this arbitrary set of facts. That we must believe and to be saved. Of all Christians, we know the organic process of salvation, the transformation of man into God through participation in the life of God is the very manner by which the world exists. It's the very thing that links this outward phenomena to consciousness, to Nous, to Logos, and unites all things towards the infinite. I mean, how awesome is that? And in the background we've also kept, and we hold not only the keys to Christianity, but we also hold the heritage of the ancients. I mean, we're not Platonists, but we have carried Plato. We are not Aristotelian, but we have carried Aristotle, Alexander, Homer, Virgil. And we could add to that, you know, all the useful stories of all people who enter in communion with Christ. We keep them alive in the narthex of the church so that they can participate in the manner to which it is possible that they participate in the divine life. You'll recognize these are images of the Greek sages from Anarthex in a monastery in Greece. They don't have halos, so it's okay. We hold the golden thread that reaches back into the mists of time, the same golden thread that is under increasing threat of being cut. So I think the chaos we face is a test. Like the waters of baptism, it will wash off all that is superficial, all that which we have not integrated. Encountering outer darkness, being challenged by the outer darkness is an urgent test for Christians to know. To the extent that it is possible to know in our hearts and our minds, what exactly is this thing about? What is the Incarnation? How does it anchor the world? And of course there is mystery, but we can tell people why mystery matters, why some things cannot be described or contained, and why that mystery is the fount of existence. And I think that the answer in how to engage the fragmenting world is in the story of St. Christopher, that as we travel further away from the altar, we never compromise its purity. As we move to the nave and through the narthex, as we move out in a candle lit procession out into the world, our compassion grows. As Christ's compassion grew facing the adulterous woman, as Christ's compassion grew, facing the rich, thieving tax collector, the heretical Samaritan woman, all of this we can do without compromising the purity of the altar, the rigor of the sacramental life. Christ protected the purity of the holy place. He cleared the temple of lies and corruption. And Christ can hold a whip in his left hand and bless with his right hand. We need not confuse the altar with the narthex and in fact, we offer that very structure to the world, the very structure of the church itself as a ladder. And we're willing to plant that first bar, plant it unapologetically into the mud, maybe into the very belly of hell. But we know that it reaches all the way to the heaven of heavens. But as we preserve the hierarchy of salvation, we must remain cautious. We must remain humble enough to notice the holy fool who's hiding in the chaos, the exception who reminds us that hierarchy is for us and not for God, who is beyond all distinction. We need to be humble enough to perceive that sometimes, even if it is rarely the grace of our Lord, the monster on the edge of the world will be the very vehicle for Christ to be carried further out than we ever thought possible. Thank you. It."}
