{"episode_id":"SW - #111 - 2020-08-06 - Kanye West for President","start":0.8,"end":389.23,"speaker":"Jonathan Pageau","text":"Okay, everybody, here we go. Kanye west is running for President of the United States of America. Maybe I could tell you, I told you so. I didn't tell you he was going to run for president, but I did very carefully tell everybody to watch Kanye west back in 2019, that many of the cultural shifts will happen in his wake and in the wake of people like him. So we're going to look at what's going on. We're going to look at some of his pronouncements, the frame that he is proposing for his run in the presidency. And we will also see what the end of Clown World can look like, what happens when the fool starts to say things, which are the wise things that no one dares to say anymore. And this seems to be the case in Kanye's pronouncements. And so we'll look at all of that, and we will see what it can tell us about this moment in culture. This is Jonathan Pageau. Welcome to the symbolic world. So on July 4, 2020, Kanye west announced officially that he was running for the United States presidency. He has said things like this before. He has mentioned that he would like to run for the presidency, but he had been pointing now to 2024. But now this announcement came on the 4th of July, on this strange 4th of July where people weren't allowed to celebrate, but we saw these masses celebrations nonetheless. We saw all these people putting out fireworks from their homes, hundreds and hundreds of people. It was pretty astounding to see it happened. It actually looked like the end of a movie when there is this one clip where you see all these fireworks going off. And then you see, you hear in the background a reporter basically going, but, but, but, but, we told you, you're not allowed. You're not allowed. You can get fined for doing this. And it really looks like the end of a movie where everybody is defying, you know, the evil, tyrannical power, something like that. So it was fun. But. So Kanye announced that he was going to run. And there was quite an amount of frenetic energy, at least in my mind. I became very excited just because last year I put out several videos about Kanye West. One of them, which was actually covered by Newsweek. Looking at this notion of the fool and how in the time of chaos, we need to watch the fools and. And we need to look at their pronouncements because when the world is upside down, the fool continues to turn and will bring things right side up. And so this is what we're seeing right now. And so Kanye west, you Know, a few years ago, had been, you know, had some mental issues. He actually was put into a hospital because of his problems. You know, he has said that he's bipolar, that he has these extremes. And you can see it in his pronouncements. When you listen to interviews with him, he. He goes on these kind of stream of consciousness rants, and he can talk and talk for hours about all these different ideas. He cuts from one subject to the other. But in what he's saying, this is when the fascinating thing, you can see how he's slowly pointing towards things which are actually the foundation of civilization, the foundation of order. And we see the same with his album. The last album he put out, Jesus is King. If you're interested in that, go see the video that I put out about him. There's two videos that I will put links for in the description. So let's look at his bid for presidency. He started with a tweet in which he said, we must now realize the promise of America by trusting God, unifying our vision, and building our future. I'm running for President of the United States. And so the interesting thing to notice in his tweet is just how concise the tweet is and how powerful the tweet is. You can imagine him, I don't know that he put that out, you know, really very intuitively. But in the tweet, you can see exactly the things that people need to understand. The very deep wisdom that I'm talking about that no one dares to say anymore, that he's saying things that no one has the guts to talk about. And so he starts with the notion of trusting God, unifying our vision and building the future. Now, this is really the structure of reality, that is that in order to build something, you need to have a unifying vision. And the difficulty is, where do you put the unifying vision? Now, those who are wise have understood that the higher you put this unifying vision, the better chance you have of actually being able to build something that's going to hold. And of course, the highest thing that you can look to, to unify your vision is God. And that is why you have in the United States, the last, let's say, desire to hold unity within the United States was done under the guise of the God. We see it in the Pledge of Allegiance, one nation under God. We see it also on the currency in God We Trust. That is that we need to submit to the highest, highest principle in order for us to be able to cohere together. And so One God, one nation. We acknowledge the very, very highest, and then we acknowledge the thing which binds us together in terms of the nation. But the nations are arbitrary unless they are. They are prone to conflict, they are prone to inner. Inner turmoil, to civil war, unless they are submitted to something which is above them. And that is why all civilizations have always had a religious ideal to which they hold. And of course, the. The transcendent God of Christianity, the transcendent God of the west is, you know, the highest, highest possible thing that you can unify under."}
{"episode_id":"SW - #111 - 2020-08-06 - Kanye West for President","start":389.23,"end":390.31,"speaker":"Justin Ward","text":"And so he."}
{"episode_id":"SW - #111 - 2020-08-06 - Kanye West for President","start":390.47,"end":1004.58,"speaker":"Jonathan Pageau","text":"He, in his tweet, he is actually pointing to the. The structure of reality. He's showing us how reality works and how if we want for things to hold together, how the order of the way things have to be. So you have God above, you have a unifying vision, and then you can build the future. Then you can acquire the. The potentiality of the future, and you can unite it into your one vision. Okay, it's the same for any project will have to have a unifying vision so that you can build the future. Take the potentiality that comes to you and unite it to that, the unknown that comes to you and unite it into the one vision. So what's interesting again, when I talk about Clown world, when I talk about the problem of the upside down world, is that in this case, him saying that. Him saying tweeting this out publicly looks like the craziest thing anybody can say right now. And you can see the media class and the elite class just laughing at someone who dares to say something as insane as, oh, we need to unify our vision by trusting God. We need. My goodness, this is crazy. But it is actually. He's actually pointing to the very structure of reality. What he's saying is the wisest thing anybody can say, but he's saying it in a way that looks crazy. And this is where the end becomes the beginning. This is where the entertainer, clown, kind of frantic character ends up actually showing us the highest ideal, brings us back into order. This is something I've been talking about forever, the notion of this double inversion of how the fool will bring back order. And here is a clear example of this happening. And Kanye west put out an interview on Forbes magazine. And we're going to go through some of the elements of the interview, because in the interview, he does this over and over. So in the interview with Forbes magazine, first of all, the interviewer gives you a sense of this frantic interview that he's had with Kanye. He says the interview lasted for three hours. And if you've ever watched Kanye speak for a long time, you can see. You can imagine what it was like. You can imagine him kind of talking and talking and going off and bringing in ideas. And there's a kind of. There's a kind of electric energy in the way that Kanye talks about things. And there's something which at first. First view looks like a kind of convoluted or discontinuous way of speaking. But if you take a little bit of time to see what he's saying, he. He's actually saying things which are very coherent. Another person I've mentioned who talks in similar manners is someone like Alex Jones. When you listen, when you see Alex Jones speak, he uses very hyperbolic language, talks about psychic vampires, and he talks about aliens and in demons and all of. He uses all of this kind of language. But when you actually look at what he's saying, you can see that behind it there's an inner coherence. And he's actually pointing to things which are. Which makes sense. Not always, but. But often you can see that he's actually pointing to something which makes sense once you analyze what he's actually saying. And you kind of look through the bluster and the hyperbolic language. And it's just the same thing with Kanye here in this interview. And so when you look at what the. Forbes. In the Forbes interview, what he says, the author gives us a kind of summary at the beginning. So we're going to read the summary, and we're going to see what this is pointing to and how things which look very, very crazy, not crazy, but look very hyperbolic in the way that they're presented are actually pointing to something very high and are actually pointing to a deep pattern. And so he starts, and he says that Kanye west is running for president in 2020 under a new banner, the Birthday Party, with guidance from Elon Musk and an obscure vice presidential candidate he's already chosen. The obscure vice presidential candidate is like some pastor in the US and he said that it's like anything I've ever done in my life, says Wes. I'm doing it to win. And first, the first thing you notice is the birthday party. Now, when you hear that, can you imagine a political party called the Birthday Party? And it looks like something. Looks like someone who's making fun of politics. And in a way, I think that there's an aspect of it which is true, but there's also an aspect which is pointing to something more, which is that the notion of a birthday Party is the idea of celebrating your origin, the idea of celebrating the thing that makes you you. And I think that that's what he's intuitively pointing to. He's pointing to the notion of his unifying vision, but he's also bringing the notion of a kind of celebratory carnival aesthetic with the notion of the origin. He is closing the gap. He's ending the carnival. He's bringing the carnival into celebrating something which is actually the origin of our existence. He wants to bring everything under God. And so he has birthday party. And those two things are. Are the end of Clown world, right? The place where the celebration, where the party where the carnival turns to now re celebrate the origin. So he says that he's never voted in his life, which is hilarious to think that someone who's never voted is running for president. He then says that he's suspicious of the coronavirus vaccine and says that it's the mark of the beast. Now, this is something of again, which hopefully I'll probably make a video about this, which when people start to talk about the coronavirus vaccine, this notion of the mark of the beast and being chipped and everything, it sounds like extremely hyperbolic language and kind of crazy talk. But when you actually look at it and you look at what it's referencing and what are the fears behind it, you'll see that the fears are extremely reasonable. And also the system that people are using by saying mark of the beast or the chip or whatever, that the system of control is nonetheless there in our society and is nonetheless always looming on our periphery. Something which is always in danger of encroaching onto our lives. The idea of being fully identified by the state and fully followed by the state is something which is not at all conspiracy. It's right there. Now, the manner in which this is going to happen is up for debate, but the idea that this is coming to us on the horizon, anybody who doubts that is the one who's. Who's actually naive. So he says that Planned Parenthood has been placed inside. Inside cities by white supremacists to do the devil's work. This, of course, is phrased in a way which also sounds quite wild, but is also not completely false. You know, we know that there in the origins of Planned Parenthood, there are some very shady things about eugenics that are. That are there. And so he says it in a very hyperbolic way about the devil's work and all of this, but nonetheless, he's saying things that nobody is allowed to say publicly, but which are also pointing to some, some underlying truths. And then he says that he envisions a White House based on the secret country of Wakanda in Black Panther. And you know, the, you know that the reporter is putting these things next to each other in order to make all of this sound wild and crazy. But in the, the movie Black Panther, you really do have a interesting culture, a culture which is very cohesive, a culture which is very aristocratic. A culture in which the king is able to unite different tribes together with, by respecting their different identities as tribes and bring them together into one nation. And so there's something about that which is not completely, which is not at all crazy. And so he says a lot of things, which I won't go into everything he says, but I want to point out to a few of the things that are mentioned in this article. I will of course, put the link to the article in the description so that you can find it yourselves. On the coronavirus cure, he says, we pray, we pray for the freedom. It's all about God. We need to stop doing things that make God mad. Now, once again, this is something which, you know, in a secular society, in a world that has, in the world of enlightenment values, if someone says this publicly, says that the reason why we are struggling with this, with this problem is because we made God mad, and that it's all about God, that people will say, oh, Boge, superstition, oh, silly, silly thinking, magical thinking, all of this. But once again, look at the way that everybody is fighting about how to deal with this disease. And the reason why people are fighting about how to deal with this disease has nothing to do with science. It is an image of the fractured society we have, of our incapacity to have unity, our incapacity to have a coherent discussion and a transcendent value. And that is the reason for the conflict. It is actually not about medical. It's a political conflict. And so when we say that it's all about God and that it is by not doing things that make God mad that we could come out of this problem, what he's saying is absolutely true, that if we were able to have something which unites us, which we have something, and of course God is the ultimate thing which unites us, then we would be able to, to find a way to deal with this which would be coherent. And also we would also be able to find the balance between the extremes, which is we can see that people are giving in to these extremes of fear and protection, or now the extremes of denying the very existence of the virus. And so if."}
{"episode_id":"SW - #111 - 2020-08-06 - Kanye West for President","start":1004.58,"end":1004.86,"speaker":"Justin Ward","text":"And."}
{"episode_id":"SW - #111 - 2020-08-06 - Kanye West for President","start":1004.86,"end":1413.28,"speaker":"Jonathan Pageau","text":"And also people are suspicious. A lot of people say things like the virus doesn't exist. This is all a conspiracy. Why are we saying that? Why are people saying that? They're saying that because we have lost the coherence of our society and people are doubting their authorities. People are doubting those who are responsible for telling us what is going on. They think that they're being lied to. And the reason why they think they're being lied to is because we are living through a breakdown, a social breakdown we're living through at the end of a civilization's end. And so when he says that it's all about praying and it's all about God and it's all about doing, not doing the things that make God mad, he's absolutely right. He's absolutely right. In a technical sense, not in a superstitious, just religious sense. He's right. That is because we do not have this. That all the rest is going on and everything else is breaking down. If we could unify and be humble under the divine. The divine guidance, then we would be able to avoid. We would trust our leaders if they. If we knew that they were submitted to God. And we would not be doubting, we would not be saying. We would not be even arguing over whether or not this is real, whether. Whether or not the instructions that are being given to us by our authorities are for. Are for our best intentions, are with best intentions, and for the. Our betterment, you know, all of this would be avoided. And so another statement which is amazing that he makes. They ask him about his foreign policy and the quote is, I haven't developed it yet. But then he says, and. Which sounds like, of course, the unplanned fool who's there saying he's gonna run for president but doesn't have a platform. There's, of course, an extreme honesty about it. He's not pretending. But he also says. Then he says, I'm focused on protecting America first with our great military. Let's focus on ourselves first. This is, of course, this links to his notion of Wakanda and the note and the idea of the Wakandan state, which is, it was. Which was protectionist and which was mostly based on preserving the coherence of its inner elements, the inner tribes, rather than trying to take over or to siphon the. And get their interest from the outside. And so, I mean, could you imagine if someone did this? Like it would be. It didn't mean that America would maybe stop fighting war after War after war. I mean, wouldn't that be nice if that would happen? If the imperial, if the imperial tendrils of the United States were less spread all over the world to their own detriment ultimately. And then of course he says, I'm pro life because I'm following the word of the Bible. You know, once again, it is very difficult in the world right now in terms of media, let's say the consensus, the kind of social consensus to say that you're pro life and to say it as explicitly that, not argue about science this and this and that and ethics and this, and just say I'm following the word of the Bible. And he's right. So the last thing I want to point to in this article which is worth is there are several things. Read the article. It's definitely worth it because you can see him go and, and use extremely hyperbolic language and kind of wild speech. But then he talks about prayer in schools and he says we need to reinstate in God's state, in God's country, the fear and love of God in all schools and organizations. And you chill the fear and love of everything else. And so that's it. He's right. First of all, he says it in a kind of freestyle rapping, which is amazing, with some rhyme in there. But he's right in the sense that it's not just about the idea of prayer in schools or whatever, but he understands how reality works. He understands that if you do not have a transcendent unity in the trans, if you don't have unity in the transcendent, then you will have a problem with the unity and you'll have a problem with the fear of people fearing each other and you'll have less love between other things. So he says, so that was a plan by the devil to have our kids committing suicide at an all time high by removing God to have murders in Chicago at an all time high because the human beings working for the devil remove God and prayer from the schools. That means more drugs, more murder, more suicide. And so of course this is unacceptable. You can't say this. No one is allowed to say this in public discourse. But here he is saying it straight out. And he's right. What he's saying is absolutely true. He is saying what I've been telling you guys about just the way reality works, you know, that why do people commit suicide? They commit suicide because they are falling apart, because they do not have meaning. They do not have something, a purpose which is uniting them. You know, why do people take Drugs? Why do people commit murder? You know, all of this is happening because of the meaning crisis. But the meaning crisis is ultimately a spiritual crisis. It is a spiritual crisis of the west which is leading to all the other problems that the west has and all the, all the fragmentation that is happening. And so read the article, it is definitely worth your time. And also try to understand this, try to understand what is happening that as you read the article, you will see some of the things he says, what are extremely wild and were really said in a manner that is, that is extreme. But at the same time he is saying very basic wisdom. He's saying things that are basically the way reality works in a straight word, straight saying, just saying it straight out without any filter. And that is exactly the image of the end of clown world. It is exactly the image of the end of the. Of the entertainer in an upside down world. Finally pointing to basic wisdom, to basic truth in a way that looks still crazy for most people. And why does it look crazy? It looks crazy because the world is crazy. And so saying things like put prayer back in school and abortion is evil and it's the work of the devil, all of that looks crazy. It sounds crazy because the world is crazy. And so all I can say is maybe vote for Kanye. You know, I'm not American, I'm Canadian, so I don't even have to decide. But think about it and we'll see you very soon."}
{"episode_id":"SW - #111 - 2020-08-06 - Kanye West for President","start":1414.56,"end":1479.46,"speaker":"Justin Ward","text":"I hope you enjoyed this episode of the Symbolic World. The Symbolic World is edited by Justin Ward and it is based on a series of videos that you can find on my YouTube channel, Jonathan Pedro's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course leaving a review on itunes. Everybody knows that's the best way to, to get the podcast out there, to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon Pageau videos as well and on SubscribeStar, all those links you can find on my website or in the show description. So thank you and I will see you soon."}
