{"episode_id":"SW - #104 - 2020-06-15 - The Meaning of Protest","start":0.56,"end":1548.02,"speaker":"Jonathan Pageau","text":"As the United States currently descend into a whirlwind of protest and riots and chaos, I thought it might be important to look at the symbolism of protest, the symbolism of riots, what they can mean, what is their structure. Now, I want to warn you that this video is not going to be political. So for those hoping to see me virtue signal or comment or take some kind of political stand, you're not going to see this here. But if you're interested in understanding the mechanisms, both positive and negative, of protest, then this might be the video for you. This is Jonathan Peugeot. Welcome to the symbolic world. So in order to understand protest, we have to understand, first of all and accept the basic idea that societies lay themselves out as hierarchies. And so within these hierarchies, there are elements which are above and are authorities have a responsibility to care, to protect the people below, also responsibility to protect them from each other, to maintain order as well. And you also have people who would be in that power hierarchy, are lower and are usually there to follow the rules, to obey the rule of law, to obey the way that this order comes down upon them, and to benefit from it. Of course, they also have to benefit from this rule because it is the manner in which society is held together. And we avoid chaos, we avoid people coming into our homes and robbing. All of this is the first prerequisite in understanding what protest is. And so protest always comes from below, protest always comes from the people. It it's the people who are complaining about the manner in which the authority is laid out, the manner in which the authority is manifesting itself. It can be a complaining on a scale which can go from complaining about specific rules which seem unfair, complaining about how the rules do not afford you enough. It can also be a deeper complaining, which is a complaining about the authority itself, a desire to remove, to replace the authority that's there because we think it is inadequate. And it can go all the way to anarchy and to anarchism. In believing that the authority itself as a concept has to be removed. And so we have to understand that when we're looking at a protest or when we're seeing protesting activities, what's going to happen is within the act of protest, you're often going to see every level of that scale playing out at once. You will see, within the act of protesting, those who are protesting more narrowly a certain event, a certain thing which they think is unfair. They will be protesting the authority itself as the particular authority for being unacceptable, all the way down to the desire to dismantle the entire system. And a desire to dismantle all systems basically is the most extreme version of that. So if we look at what's going on today, we can see that all of this is going on. And so, depending on how you want to play the narrative, you can focus on one or the other of these. And that's important to understand if you want to be fair about any situation. You can focus on those who are protesting a specific thing peacefully and doing their thing if you want to say that the protests are legitimate. And then you can also focus on those that are creating the anarchy and looting and destroying if you want to show that the protesting is illegitimate, you know, and both of those narratives are possible because they're all happening at the same time. It just depends on where you. You point your attention. And to simply call the other narrative illegitimate is not going to work in a discussion, because the other narrative is legitimate as well. Those two things are. All these things are happening simultaneously in a protest. And so in order to understand the structure of protest, the best way to understand it is to understand it analogically, to understand it in your body, in your person, to understand it on smaller scales like families. And then it can help us see how this structure is playing itself out. So you have to see that the top of a hierarchy. So whether it be your mind, your thought, your identity, whether it be the family, the parents that are above in the family, whether it be in the society that you have the authorities above and you have the people below, there's an exchange which happens between the two. And so the people from above will give down and the people from below will support, right? They'll act as a. As a kind of support for that, for the authority which is above, a way for the authority to show itself. And for the people below, then what you see is the authority acts as a binding agent which helps us remain together, which helps us to be one, to be a nation, to be a city, to be a family, and to be a person, right? And so this exchange is the normal way to go. And so the protest happens when the bottom part feels like there is a disconnect between the two, when the bottom part feels like that which is above is not acting properly is not acting according to the interest of that which is below. And so you can imagine the easiest way to understand protesting is to understand it really as a child. And you have. So you have a parent and you have a baby, and the baby, when the baby is hungry, the baby will protest, the baby will cry in order for you to feed the baby. And so that is the most immediate aspect of protesting. Another way to understand it is, for example, hunger. You are hungry, your stomach is grumbling, and your stomach is protesting the fact that you haven't given it anything. So you are sitting, you're working, you are wanting, you want to focus on the, on the task that you're doing. But your stomach is saying, pay attention to me, my friend. You can't ignore me. I'm here, I need to be fed. And I'm. And I am what is supporting you. So if you don't feed me, at some point, my protestation is going to disable the very functioning of the body. And it's the same with a child. If you have a child that is asking for something, a child that, that wants to be fed, if you do not feed the child, the child will scream and scream and scream until everything is impossible, until all your family activities cannot function. The family will break down if there isn't this attending from to what is below. And so would you. And you have to understand it also as, as a hierarchy that is that we have at all these different levels, we have the same, the same situation where you as being below is calling upon that which is above to make sure that you're taken care of. But that at that level that's also happening above. You can imagine that in business, for example, where the employees need something, they need some tools or they need some resources in order to do the work. And, or they're not getting paid enough. And so they're stressed and they're, they're struggling to take care of their daily life. And so they ask for, from to their bosses, they ask for more resources to do their work or for their lives. And then the boss has. Those bosses have to answer. But then the same thing will then happen above. And so the level of bosses above, they also maybe want a raise, they maybe want more possibility for their factory or for whatever it is that they're doing. And so then they have to ask above and in order to receive the authority from above. And this, in a business you have this hierarchy where this will happen at every level. And so you can see in Scripture, for example, in the Proverbs, there's a wonderful verse which says, whoever closes his ear to the cry of the poor will call out and not be answered. So you can understand that in Scripture, really it is this idea of the poor. And so the poor have nothing. They have to receive what they have from above. And so they moan, they grumble, they Complain, they ask to be taken care of. And if you do not listen to the cries of that which is below, you will also not be answered from above. So it works in a hierarchy where you have to take care of the needs of that which is below. And if you don't, then you will not receive from that which is above. And you can understand that as just a moral statement. But he can also understand it also in terms of very practical means. Think again about the company where you have, let's say, employees that are asking for something, for tools to do their work, or they, they're not paid enough, or they're struggling and so they're distracted, they're not focused on what they're doing, and then they ask their boss for more possibility, more flexibility or whatever. Now the. If the boss doesn't, doesn't give them what they need to the capacity that he's capable of in order to increase their possibility of producing, then when that boss is going to ask above for more, there's a chance that the people above are going to look around and say, well, you know, why would we give you. What have you proved? You haven't proven to us anything. And so they might look to another department or to someone else in order to give, allocate the resources. So you have to take care of those below you so that those above you will see you and see your grumbling as also legitimate, so that they will also want to. Also want to answer that. Okay? And so you can see in scripture there, the best place where you can see the question of protesting or complaining or grumbling is in the story of the Exodus. So when the Israelites leave Egypt, they go out into the desert. And so they're out into the desert, they have nothing and they complain. And what's important to understand is that at first when they complain, their complaints are legitimate. In scripture, there's a sense in which there's. God and Moses are a little bit annoyed at the complaint. And that's almost like it's inevitable. You know, when your child is crying, it's annoying. You know, you can't help but be a little bit annoyed when the people below you are complaining. But there's also a manner in which God will then answer that complaint. So the complaint has to come first. You can, the poor ask, and you can understand that also in terms of just us, in terms of prayer as well, that's related to this. So we ask, we grumble, we show that we're struggling. We show it to that which is above Us. And so the Israelites, as they're in the desert, they encounter these salty waters. So they're waters that they can't use, bitter waters. They're really the waters of chaos. And so they grumble, they complain, they're like, we need water, right? We need water. And then God gives them water, then they complain that they're hungry, and then God gives them manna. And there's another place again where they complain that they need water, they're thirsty, and then God makes water flow out of the rock. And so you can see that the grumbling comes first and the protest, it's related also to the problem of the question. And I've talked about this before, the idea of how the question comes before the answer, the desire comes before the name, or before the possibility comes before the answer. And so an example that I use all the time, but it fits a little bit in this question, is when the mother of God, when Mary goes to Christ and she tells him that there's no wine left, right? There's a request, there's an asking. And the grumbling is really a type of asking. But of course, because it's the lower parts of you, because it's the lower parts of you, it manifests itself not as a asking in a logical way, but just as a kind of grumbling of discontent. So really, the stomach or the child crying is the best way to understand that, that just expression of need and of lack of something, right? So that's why the analogy between the family, the child is the best analogy to get. But then the thing is with these protests or the idea of protesting is that just like your body, just like your child, you have to find a balance between, say, the compassion and the order. And that balance is extremely difficult to find. I don't pretend to know what the balance is, but there is, to an extent to which the desire, the needs of the poor have to be met, have to be answered by that which is above. And the. The idea that your stomach, you also have to answer the needs of your stomach, you need to answer its grumbling. The same with your child. You need to answer the. You need to answer the needs of your child. But then that balance can also tip in the other way, because the problem with your belly is that it's never satisfied, right? The problem with a child is also that a child is never satisfied. And so if you give in to all the grumbling of your child, and if you give in to all the grumblings of your belly, well, for your belly, you will become fat, you'll become diabetic, you'll become unhealthy, and your child will become a spoiled brat. And we often think that protest only happens to the very, very desperate, but that is actually not true. And your experience of your own body and your experience of your family, you will realize that that's not true. So protests happen at every level. They happen in the most desperate. And in the Bible it is said that you need to answer that protest which comes from poverty, you would say, but there is also a protest which comes from a kind of spoiled attitude, an attitude that I am owed things. And so your belly is. If you don't, if you're not careful, your belly is always hungry. Your belly, your desires will always. The cycling back, you'll always have more. And then you can get the image, you know, the kind of narrative in this situation of the. The workers who demand from their bosses and demand and demand and demand to a point where at some, at some point the boss will take the factory and move it to China or take the factory and move it to South America or whatever, because the demands of the. The body are so big that they don't fit the capacity of the head to provide for it. And to answer those demands, it just. There is no, it's impossible for the system to handle so much demand. And so then the system will break down. You see, the same, of course, with children, with children that will, you know, throw tantrums to get the tiniest thing, their tiniest little difficulty answered, their, Their, you know, whatever little toy they want or game or what, or to just to get whatever they want or to go to bed later or to eat ice cream for dinner or whatever. The child, if you always give in to the grumbling, then the child will become a spoiled brat that will expect more and more. And sadly, the thing is, this is also true in society. And so as society actually gets richer and as, let's say all of our society moves up in terms of absolute poverty, you know, there is no absolute poverty, at least so little absolute poverty in North America. It's almost, it's almost zero compared to just 100 or 200 years ago, as people have more. That doesn't mean that they will stop protesting. It means that at every level there is the possibility of expressing the lack. Because there is a sense also that because things come from above, those that are above you, you know, you can start to think like that has to come down, it has to lower. And so then there has to be this balance between the grumbling and the authority. So you can see in scripture, this is what happens in the story of Exodus. The Israelites ask for water, God gives it to them. The Israelites ask for food, God gives it to them. And then there is the moment in the story where there's an in between, right, Where God gives a mix of rigor and mercy. He gives a. He gives in to the, to the desire, but also says, you gotta stop. This is it. Like this is the limit. You need to stop. So this happens when the Israelites ask for meat. So the Israelites are receiving this manna from heaven, they're receiving the water. And then the Israelites. Well, actually, it's important to notice in the text that it says the mixed multitude. So you have this mixture of Israelites and other peoples that are there in the group. And this mixture is one of the causes of the. Now the grumbling to get bigger. Because when you have mixture, when you don't have a clear, let's say, united group, then the mixed elements don't feel as much the need to submit to the authority. They just don't because it's not their thing. They, they are, they feel marginally connected to the thing. And so it's normal that that's where the grumbling can continue once the basic needs have been answered. Because, you know, they don't feel like this is their project or they don't feel like this is theirs. And you can see it both ways. You can see it on the one hand, it can be the fault of the authority of not being able to include these mixed multitudes into their project, to make them fit within their main project. But it's also, it can also be seen as in some aspect, the fault of the, the, the, the people, the fault or the, the reality of the people who just don't feel like this is their thing. And so they're more prone to continue grumbling as things manifest themselves. So this mixed multitude now says, we want meat. And then God finally gives them meat, but also burns the periphery of the, of the camp, right? And so let's say purges some aspect of this problem, right? Kind of says, clamps down, says, okay, I'm going to give this to you. I'm going to clamp down a little bit. But now this has to, this has to stop. And so we have to be really careful when we look at this, the Bible, because the Bible is always very balanced. It can be a bit scary to see the story at first because you have this idea of the mixed multitude. Then you have the grumbling, and finally you have this fire which comes and purges the outskirts of the camp. And so it can be a bit scary. But if you look at Scripture, it always balances itself out, because the next chapter, right away in the next chapter, you have the flip side of the same story. So in the first story, you have the danger of mixture and how it can lead to excessive grumbling. And then on the other side, you have the opposite, which is that the leaders grumble against Moses, that he is married to a foreign woman. And so they grumble about that. And because of that, there's also another punishment where Miriam, who grumbles about that, is excluded from the camp for a certain amount of time because of this grumbling. And so you can see the balance, which is that we don't want. We don't want mixture to weigh down that which brings us together. But we also don't want an excess of purity which will prevent us from having this kind of normal breathing of in and out that all identities need in order to exist. And so, just like all symbolic patterns, there is this sense in which the notion of the grumbling of the lower parts is an inevitable process. It's an inevitable reality of any structure because the higher aspects have to take care of the lower aspects. And there's also a sense in which that can go too far. And that can also lead to the breakdown of the system. The other breakdown can also, that I hinted at before, is the breakdown, of course, that if the authority doesn't tend to the poor, if the authority doesn't tend to those who are, need and are grumbling, then. Then the system can break down as well. So the system, sadly, can break down. Well, not sadly. The system can break down by all excesses. Either an excess of authority or an excess of the bottom, which is asking for too much or is or is never satisfied. And so we need to find a balance between the two. And that can be very difficult to find, especially as tensions escalate and especially as discourse escalates. Sadly, also, this is gonna be my last, my little political insert. Sadly, in the world of social media, in the world where everybody feels like they have to give their opinion and somehow take a stand on. On one side or another, it forces people to move into excessive territory because it's difficult once you create two opposite sides, it's difficult to see the nuance and even to see the nuance within the protest, where, like I said, there are within a protest. There are protests as much for a specific thing which seems to be unfair as there is for those who want to demolish the very idea of authority or the very idea of a state. And so but once you're asked to take sides, it's very dangerous because you feel like you have to either justify completely one side the side of the protest, or you have to justify completely the side of those who want to clamp down and re estate establish order. And I don't think that that's the best way to go. I think it's important to understand the need for order and also understand the possibility, at least, that sometimes the grumbling can be justified. People feel like they're not part of a system or feel like they don't have access to what the authority is supposed to provide us. And so hopefully that will be helpful for you to understand the pattern and. And we'll be paying attention. My next video will continue my lighter streak just because I feel like we've had so much heavy in 2020. I told you it was gonna get insane and I'm sorry to say that it's not over. It's still going to get crazier. But hopefully I can also give you a little bit of breath of fresh air just to give you guys a little break from the craziness. So thanks for your support in these wild and crazy times and I will see you very soon. I hope you enjoyed this episode of the Symbolic World. The Symbolic World is edited by Justin Ward and it is based on a series of videos that you can find on my YouTube channel, Jonathan Pageau's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course leaving a review on itunes. Everybody knows that's the best way to get the podcast out there to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon Pageau videos as well and on subscribestar. All those links you can find on my website or in the show description. So thank you and I will see you soon."}
