{"episode_id":"SW - #322 - 2024-01-18 - Janus, the Two-Faced God of January","start":0.32,"end":674.01,"speaker":"Jonathan Pageau","text":"So I want to talk about something a little strange at the outset. It will be to some, which is to talk about the symbolism of the month of January and its original namesake, which is the God Janus. This is Jonathan Pedro. Welcome to the symbolic world. And so I don't tend to talk about pagan symbolism so much, but here I think meditating and pondering on the pagan symbolism will help us understand even some of the Christian symbolism which appears at around this time. And so January, of course, is named after the God Janus. The God Janus is the God of thresholds. He. He is the God of doors, the God of transition, the God of in between. Right. And so you can understand why the symbolism of his representation is to show him with two faces, one face going one way, the other face going the other way. And you can understand it in different ways. People will interpret it sometimes and say, you know, it's the past and the future. Sometimes you can see Janus with three faces, with one in the middle too. So it's like the past, the future and the present. That is a good way to understand it. But a better way to understand it is the symbolism of thresholds themselves. The symbolism of the transition between two spaces, the ambiguity of that transition. A lot of superstitions about thresholds can be understood that way. Because the threshold is in some ways a place that is neither inside nor outside. And it has to be indefinite by its very nature. Because the maginal line between inside and outside doesn't actually exist physically. Right. It's an imaginary boundary. And that boundary actually has no space in physically. Like if you tried to actually trace the exact line of where your house ends and begins, you wouldn't be able to find it. Exactly. Because there's always more. You can always crush it more and more until at some point it's actually just a virtual line that separates the inside and the outside. That's why usually there's all these superstitions about thresholds, which is the idea that you shouldn't step on the thresholds. There are many traditions where stepping on the threshold of a door is bad luck. And so you should always step over the threshold in order to not step into the ambiguity. You could, say, get trapped in Zeno's paradox, you know, where you can't actually define where something. Where the middle, you know, where something starts and something ends. There's this kind of indefinite quality about the quality of inside and outside, which is related. And so this idea of Janice as this character that has two sides as being the threshold, as being Both inside and outside at the same time, you could say, or neither, you know, representing both aspects of the transition. And so sometimes Janus is represented this way, which is that, you know, it's usually the same head that is on either side. And then sometimes Janus is represented with difference between the different heads. And so there are different ways to do it. Sometimes it's masculine, feminine. Sometimes it is an older man and a younger man. Sometimes it is. In this case, for example, that you see here, you see that it is a man and some kind of fantastical creature with horns, with pointy ears, like a fawn, and so some kind of wild creature of the forest. So all of these are helping you to kind of understand that what it is, it's about a contrast. So think about this image here as being something like inside and outside. So that is the man and the forest, the man and the monster, the inside and the outside. In the same way, you can see that you could. If you understand it in time, you could understand it as youth and age. It really is about the problem of even, like the. You could say the. The place where past and future meet is an ambiguous space because it's looking in both directions at the same time. So you can understand this. This threshold or this door and as being something which is also always there, which is always something that we kind of have access to in terms of, for example, in terms of time, but in terms of any identity that. That has a marginal line, that has a. A difference between the inside and outside, which is basically everything. But what's mostly important to understand is how this is related to this time of the year, right? And so this time of the year, which is the time of. Around the winter solstice, the time which is the moment when the days get the darkest and now the sunlight is starting to appear. There are all these feasts that are kind of all cramped together that aren't exactly at the same time, all these celebrations that are related to the transition between the old and the new, the transition between the darkness and the light, the transition between the old year and the new year. And so this is also part of the symbolism of Christmas, which is why I bringing it up here, part of the symbolism of Christmas, because the symbolism of Christmas is that moment where the Old Covenant and the New Covenant, there's a transition between the Old Covenant and the New Covenant. And so this transition that happens in Christmas is found reflected in the very solstice itself, which is the solstice is this moment of transition between when the day is getting shorter and when the day is getting longer. Now you could apply that again to the solstice. If you think about how you know when exactly is the moment when the day is getting longer and the day is getting shorter and the day is getting longer. If you try to pinpoint that moment, you're just going to kind of dig into a virtual point or point that actually doesn't have quantifiable existence in time. But is this, let's say, invisible line in between one which is facing towards the old year, which is dark now, and one which is facing to the new year, which is going to become light. So you can understand it as if you look at this image of the old man and the new man as the man of darkness, right? Which is the wild man, and you could say the man of light, which is the new man, the inside man and the outside man. See, all these. These images are all related to each other. So it can help you kind of understand what this symbolism is about and how it's related to Christmas. I've often said that symbolism of Christmas is not straightforward. The symbolism of Christmas has in it both the light and the dark. It has the revelation of the Messiah and the slaughter of the innocents. It has, you know, the coming of the king and the fleeing to Egypt. It has this duality to it, which is part of its symbolism. It is important to understand how it all fits together in terms of this idea. Now, it's also related to another symbolism which, you know, I'm just going to mention very quickly, and it was the theme of my patron only video this year, this month in December, which is that the mysterious symbolism of St. Nicholas and Krampus. And so this is, of course, the same type of symbolism which is related to St. Nicholas and his, let's say, dark, strange, demonic, contrasting accompaniments, where on the one hand you have the light and the dark, you have the angelic, the demonic. You also have the gift, the punishment. You can understand it as life and death. If you think about the inside and the outside. Look at this image here and look how it's already promising something like the contrast between the bishop of light, you know, the bishop, St Nicholas, and his dark and kind of evil counterpart, that he is a wild creature with horns, similar to the way in which the Janus figure is often represented. And so it can help you understand what it is that this duality is, why this duality is related to this time of year, this time of transition. So you can see that all of it, if you want to understand all of the symbolism of this period. And you look at the symbolism, you'll see. So there are two types of symbolism. January 1st, the beginning of January in the Western calendar, especially in the northern Europe, not northern Europe, but like in France and on the continent of Europe was circumcision day, you know, and I think it's circumcision also in, I mean, it's circumcision in the entire church. But Circumcision Day on January 1 for Europeans in the Middle Ages was also the Feast of Fools. It was also a carnival. It was a moment of, let's say, celebration of the flesh and cutting off of the flesh. So you kind of have a carnival where there's this, this weird celebration upside down and all of this stuff. And then there's a removal of the remainder of that old world and moving into the new world. So you can understand it. Again, if you look at the figure of Janus, you can see that symbolism there in the first of January, which is, on the one hand you have the strange, you could say foreskin. And then you also. So you have the celebration of that which is related to carnival, which is related to monsters, which is related to these strange, ambiguous figures that live outside, outside, that live in the forest, that dance and play the flute and are also, you know, lewd. And all of this kind of symbolism related to these, these outside figures. And then you have the new man or the circumcised man, the one that is on the inside and is moving towards light, towards the future, towards rectification, all these types of words that can help you understand what it is that's going on. And so when you look at this symbolism, you'll see where, why it is always the contrast between dark and light in all the feasts. And this relates to the symbolism of the transition that happens at the solstice, but that also happens at Christmas. So hope you enjoy this and that you had a happy new Year and that this will help you understand how the symbolism comes together. So thanks everybody and I'll talk to you very soon. Bye. Bye. If you enjoy these videos and podcasts, please go to the symbolicworld.com website and see how you can support what we're doing. There are multiple subscriber tiers with perks. There are apparel and books to purchase. So go to the symbolicworld.com and thank you for your support."}
