{"episode_id":"SW - #231 - 2022-05-04 - April 2022 Q&A","start":12.08,"end":5626.94,"speaker":"Jonathan Pageau","text":"This is Jonathan Peugeot. Welcome to the symbolic world. Hello, everybody. And so we are live. First thing I want to say as we go live is apologies to everybody who, who is supporting me. I realized that I put the right date, but I didn't put the right day. And so I put Wednesday and then I, I put the. The 28th. And so sorry about that. Hopefully not too many people were here yesterday waiting for it to happen. I imagine you would have seen that the, that the video had the date for today. So anyway, sorry if some people were, some people were in trouble because of that. And that's possible because now I see there's only five people that are in the chat, which is fine. We'll have a lot of fun in the chat if there aren't too many people there. And so. All right, for those who are watching after, as you know, people support me on subscribe, on patreon or on PayPal through my website. They, they, they could be there live. And I'm also taking questions in advance from people who give it a certain amount and then we publish these on the website afterwards. And so let's see who's in the chat. James Flames is there. Guys, check out James Flames. If you don't know him. He's a great artist who makes posters. I think I mentioned before, David Flores there is also a great artist. And so, yeah, we got a bunch of people in, in there. And so let's see, there's a few questions in the, in the chat. Let's start with those and see what happens. So Plays With Bricks says, hi, Jonathan. I'm writing a paper on the science fiction genre as the place where apophatic theology has been displaced. At a quick glance, you have. Do you see any problems with this thesis? I mean, yeah, I'm not sure. I'm not sure what's apophatic about science fiction. It's actually, it's usually pretty. Maybe it's. It's apocalyptic in the sense that tends to try to perceive patterns in the world and tends to want to project them into the future in order to see the finality of their results, let's say. And so it's interesting because you can understand that in a certain manner, that's what apocalypticism is in general. It's the sense that it's like. It's the fullness of the pattern in its. All its fruits. You could say that's what you're seeing in apocalyptic thinking. That's why Apocalypse is revelation. It's not just about the end. It's about Revelation. And so I think that science fiction is definitely apocalyptic in the sense that usually what science fiction does is it takes a pattern that's there now let's say, you know, technology getting out of control and then it, it, it makes it extreme and tries to show all the ramifications of that at a, at a larger level. So in that sense it's apocalyptic. But I know about apophatic. Jared Foy says. Hi, Jonathan. Recently the BBC reported a story about a researcher who posed as a 13 year old girl, then gained access to a virtual strip club in the metaverse. What does this mean symbolically? That a child can easily and legally gain access to that which by law they're prohibited in physical reality. Clearly this technology is blurring the delineation of our experience of reality. Is there any noetic difference between these two types of reality? Is variation in reality a good way to understand the difference in implications of the metaverse? And so, so in terms of what you saw, you know, it's like this is the problem of the online world and this is what I talk about all the time. So on the one hand, the online world permits a kind of chaos and a kind of access to, to things that are forbidden, to things that are taboo. All of these things are accessible online. And there's a way in which like you, like you're saying you can cross borders, you can, you can do things which you wouldn't do in the normal world, but that's also what's calling for the Internet to become more and more controlling and more and more, and being more and more related to identity. And so you can see that something like this happened. The very fact that they're talking about it on BBC is. Why do you think they're talking about it on BBC? They're also talking about it because there's a hope that that won't happen, which means that there won't be, there will be fewer and fewer possibilities for anonymous behavior online because we have to be careful not to repeat this, that these types of things don't happen. And so the online world is going to become more and more extreme between identified, fully identified by your ID by some biometric measure, to the opposite, which is going to be a kind of legitimate illegal space of, you know, the, the dark web or whatever. And so that's where it's going. And so, yeah, so I don't know if there's anything noetic between the two types of reality. One, the metaverse is reality of more extremes. It's a reality that's on the one hand, disembodied, but on the other hand is a place where all the passions play themselves out. And so it's more like. You have to see it more like an extreme, like a separation. A separation of heaven and earth, actually. All right, okay, so let's go into the questions. I'm going to start with question for the website from people who support me on PayPal. So John 22 asks. And so. Oh, yeah. And as you know, for people who ask questions, the questions are selected and edited just so that there aren't too many, because sometimes these would go for way too long and then I'd be so tired at the end that I was barely answering. So we usually whittle it down to about 50 questions. And so make sure your questions are good, they're not repetitive, and that they're. That they're focused on symbolism. So here we go. So John 22 says, hi, Jonathan, in the Book of Numbers, why do you think God orders that the tribe of Levi not be counted? Is there a relationship between this tribe and the periphery? Thanks, John. It's. No, it. Well, not periphery. It has to do with. I've talked about this before. So there's a sense in which there's the world and then there's that which is dedicated above and that which is, let's say, dedicated in the sense of. Marked for outside. And so the Levites, they were marked for God, that is, they were holy. So they weren't in the normal space, which is why the Levites also didn't have a part of the land. They were spread out across the nation. And I think that that's also why they're not accounted for, because they're not part, they're, they're not totally part of, of Israel in the sense of the. In the sense of that which is the business of Israel. They are kind of dedicated up, and so they're, they're given up to God. That's the way to understand it. And so. Yeah, so, but you can, like I've talked about this, where you, you shouldn't account for the. You shouldn't account for that which is on the margin. You have to leave a buffer of chaos on the margin. But you also have to not account for that which is, say it's not, it doesn't participate in the world. But when you sacrifice something, if you take a lamb and then you sacrifice it up to God, then it's. Then it doesn't no longer participate in the regular, you know, trade of the world. It is dedicated and given up. And so that's what the levarts I think are for and why they're not counted. Best way, I think my way of understanding it. So Kelly Madden asked, what meaning do the linden tree and linden wood have for the Christian artists, especially in relation to their pre Christian symbolism? I don't know. I don't even know what the pre Christian symbolism of the linden tree is. I, I know more about symbolism of like hardwoods like oak and things like that, but I don't know about the linden tree. So sorry. So in the woods. Ask Jonathan. I'd love your take on the symbolism of Christ's two stage healing of the blind man in Mark 8:22,25. Most interpretations suggest a metaphorical take. Israel is so spiritually blinded it needs to be healed twice, I. E. To Christ, first and second coming. But I'm struck by what the man sees after the first touch. Men like trees walking. Could it be that Christ didn't fail to heal him fully with that first touch, but given spiritual sight first so that the man correctly perceives humans as trees, the union of heaven and earth, and are insufficiently rooted? Yeah, I think you've got it right. That is the way that I interpret it. It's that you could say that Christ made him have too high a vision and so he saw what was above and then Christ, let's say, helped him see what was below or how it connects. So he basically just saw the patterns, which is a problem, by the way. You know, we tend to think that people who see the patterns are better, but not necessarily because we really do believe that reality is incarnational. If you just see the pattern that you're not able to see how they, they are connected in the world, then you know, it's like a mathematician, it's like these theoretical mathematicians that live in the patterns and they can barely tie their shoes. It's like that's, you know, that's a, that's the problem of living up in the patterns too much. And so that is what I would think is going on there. So David Flores asked, what do you think is happening symbolically with the is it cake stuff? People disguising cake as real objects, food, etc. I mean, I don't know, I don't know what is the symbolism of the Is it cake? I'm trying to see, you know, I have no idea. But it does fit into the whole idea of making food. You know, making cakes that look like things just in general. Right. Having cakes that have themes and stuff. I have to think about it. I don't really know exactly what that is. I mean, for sure. Like, just even without thinking about symbolism, it has something to do with the. The capacity for. For mimetic creation. It has to do with the surprise of. Of creating a representation of something else in a way that can trick you into thinking it's the actual thing. You know, I mean, the same kind of. The same kind of fascination you would get from someone who will make a hyper realist painting or someone who, you know, something like that. And so I think it has maybe something to do with that. And so I'm wondering if there's someone in the, in the chat, by the way, everybody. Christ is risen. I should have started with that. You know, it, it is the. It is the bright week. And so it's weird because it feels like this week was super long. The, The Pasca was. Was amazing at our parish this year. I mean, it was just. It's like there's a miracle happening. I don't know what to say. It seems to be happening kind of all over the Orthodox Church in America, or at least the people that I know of. You know, we. Our church, like my parish for 30 years, if they had 20 people on a Sunday, it was a miracle. Like, it was just, wow, there's 20 people in the church. So it was like this minuscule parish that was always struggling, struggling, struggling, and could never pay the bills and could never do anything. And it's nuts. Now this year we had. We're having eight people being received into the church, you know, all through Pascha. And then there's some. There's the last one who will be received a little bit after Pascha. So it's, it's nuts. And I see pictures online of people having more catechumen than they've ever had in their life. So it's just. It's wonderful. So, yeah, I mean, door to God for all that, you know, and so, yeah. All right, let's keep going. So choose. Agape says in the book of Genesis, are Hagar and Ishmael linked to Eve and Cain Symbolically, Hagar won't look upon the child about to die, while Mary, the new Eve, stands at the foot of the cross. I don't know if, if the best way to understand it would be something like Eve and Cain, but there definitely is a pattern in the patriarchs about this because it's not just Hagar and Ishmael. You know, it's also Leah and, and Esau that, that are with the same Pattern. There's something about. So, yeah, there's something about the first son. There's something about. And I think that I. I think people are going to think it's. Yeah, I'm not. I'm not saying I agree with these traditions, but I think it's these stories that. That brought the idea of Lilith, for example, in terms of the idea that there would have been another, like, wife before Eve. And so, I mean, it's interesting to think that in a way that the idea of even Cain and then Mary as being the second, the second one, and Christ also being the second one, the second Adam. Yeah, but Christ is also the firstborn and everything. So, yeah, there's definitely something there in your intuition, but I'm not sure totally how to. How to capture it. There's something about that. There's something about the idea of the second son in all of the Old Testament or, you know, the youngest son or the second son. And it. It seems to be there in, in fairy tales and stuff as well. It's like a sense in which the first son is kind of supposed to be the dedicated one to God, but it. It's like it never happens. It always ends up being the second one or, you know, the last one or whatever. And so. So, yeah, so there's definitely something about that which is worth thinking about. It's good to see Brad in the chat. Nice to see you. So, James Flames, who I mentioned, he said you've talked about eventually leaving the Internet, and I've been feeling the same, that it seems like it's coming. Do you have any preliminary thoughts on preparing for something like this? I don't know. I don't really want to do it because in a way, like, a lot of the stuff I'm doing is online, but at some point, I don't know. So he says, like prepping for a fast. Yeah, maybe something like that. I think we just have to be attentive to the signs. And then when being online cannot happen without compromise, which is something that could happen, and some people think maybe it already is happening. You know that by being online you are implicit. You have to implicitly or explicitly adhere to something that is. That is against your values. Then. Then that would be the moment. Yeah. Leori Joji says, what is the symbolism of bodybuilding? It's the symbolism of body. It's the symbolism of. Of large bodies, you know, the symbolism of giants, the symbolism of trying to make your body large. And so it has. I mean, it has. It has advantages, which is also. Which is to become more powerful, you know, but. Yeah, but it definitely is. And that's why it's like bodybuilding is often linked to, it's often, it's, it's linked more to appearances than it is also to health, let's say. And so there's something about that which kind of seems to frame the bodybuilder in a certain category or certain types of behaviors or certain looks, you know. Yeah, I mean, I'm all for, I'm all for, for being healthy, but I don't know, I mean, I met a priest who was a bodybuilder and he was a great priest. Like he was actually wonderful. And he, he kind of, he kind of lived his bodybuilding as a way to discipline himself and everything. So I don't think it's impossible, you know, it's not impossible. All right, so Eric says hi, Jonathan, I hope you are well. Yet another question in regards to the edit stories. I hope you bear with me. In the creation story, after the first giant is killed and cut to pieces, they use the skull to make the sky. They raise up it over the earth with four corners under which they put a dwarf, namely southwest, east and north, I guess. What's the symbolism of the dwarves here? They put a dwarf under each corner, Is that what it is? I understand them as patterns from below, but I don't understand their place there. And so you're right, that's what it is. They are, if you will, like the monsters below or the less than human that are below. You know, there's something about the dwarves that are kind of like reduced humans. And so that's why that, that, so they kind of symbolize the lower stuff for. And also that, you know, they're smiths and you know, they, they, they, they're miners and all that kind of imagery that is related to dwarves that are all underground. And so I think that's just what it is. It's just like, it's, it's, it's as if you have, you know, you have the earth, you have the heaven reaching the corner and then in the corner of the earth you'll put, you'll put like a, like a support, you could say, you know, it's like maybe you could think of it almost like the Titans that are holding up the dome, that are holding up heaven. If you think of Atlas, for example, it probably has something to do with that. Like these monsters on the edge that you see, for example, on churches and everything, like gargoyles, like, I think that's probably what it has to do with like something below a monster on the corner. You know, something that isn't quite human or less than human. That's also like a guardian, maybe also of the four corners, something like that. I mean, just visually, like, just in terms of the usual kind of idea of sacred space, it seems to make sense. Which is also why, for example, the idea that Atlas is on the, you know, is in the. Is in the west and like the pillars of Hercules, the. The. Is that what they are? No, I mean, Atlas would be holding up the sky in Spain or whatever, you know, in the. In the. Or down that side. So, yeah, so I think that that's it. That's my best understanding of that. So, Wedge, young man says former Lord willing, drug addict here. After watching your video on the Book of Enoch, I started to ask myself, where are the demons in my story of misplaced love? Are they the ones that talk to me when I'm being pulled down? How can I better recognize them so I can be rid of them for good? And so you have to understand the way the demons, they affect you is usually through a. It's like a passion where it's going to understand it. Like you've got these desires and there's a pattern of behavior that. That is above it. And then when those connect together, that's when you have these repetitive kind of behaviors that enslave you. And so that's really the way to understand it. I mean, if you've seen. If you wanted to do something like, okay, if you've done something that you don't want to do, then. And I think everybody has. I think that you should be able to recognize that as that's it. Like when you. When you know you don't want to do something, but then you find yourself doing it anyways, then you understand that you're in another personality. There's something else ruling over you. Like there's something that is kind of manipulating you through your desire. And so that's the best way to understand it. And usually it's hard to. You have to see them from far away or else. Or else you can't really. It's hard to deal with them when you're in the. When you're in the thralls. Like when you're. When you're under the influence of like this pattern and these desires, then it's like, it's almost. Like it's almost. It's too late. You have to kind of be able to see them from afar so that you stop them further out on the gate, you know, and so, you know, whatever. Like, for example, like if you're, if you're taking drugs, then when you find, you know, when you've got, when you've gotten whatever you're gonna get from your friends or from your dealer, whatever, and you've got it in your hand and on the table, it's like too late. You know, you had to, you had to be able to see it, you know, from the moment when you started to think about it, for the moment you started to have the desire, for the moment when you started to make excuses for yourself that you started to tell yourself, you know, not so bad, you know, I did that. You know, I've had a good week. You know, I've been being a good boy or whatever, so I kind of deserve a little break or whatever it is that's going on in your mind, that's when you have to see it like way before, way before it gets to you, let's say, way before the claws are in your back, let's say, or in your brain. All right. Jay Grubb asked, what is the symbolism of whodunits or murder mystery stories generally? Is there anything about their emergence with characters such as Sherlock Holmes in the latter half of the 1800s that has to do with industrialization, scientism? What is the symbolism of murder at the central crime of the genre rather than another kind of crime? So there's a bunch of stuff there for sure. Sherlock Holmes is, and the murder mystery in that sense is definitely part of scientism and industrialization because it has to do with debunking a mystery. And so usually in not all the Sherlock Holmes, but in some of the Sherlock Holmes stories, you'll, you really have an anti religious strain where it's like these superstitious people, they believe in, in superstitious causes. And we're going to, to show them that with reason and deduction that you can find the true causes. And so you see that of course, Scooby Doo is of course the ultimate caricature of that. But I think that Scooby Doo stuff is already in Sherlock Holmes at the outset. And so I think that it has something to do with that. It's related to the idea that, that there's a method, like a method of science and forensics and all these types of things that will give you the real answers. Like they'll give you the true answers. Why is murder the central crime? I mean, I think because murder is usually the worst crime that you, you know, killing another Human is like, though, is one of the worst things that we think a human can do. And we recognize it as something of a, of a scandal. And so I think it, it, it, that's why it's usually murders, because. Yeah, because it's the worst thing that, that you can do. It's like Cain and Abel level type of things. Yeah, the figure, like the figure of the, the figure of the scientist. You know, even in Batman you have that image, right? It's like the figure of the, of the scientist as the one who solves problems, as the one who finds the, the, the hidden solutions. And it's not about mystery, it's not about religion. It's not about, I mean, of course it's, it's silly because religion has very little to do with that kind of stuff. But it's like, you know, it's a weird, it's like a weird materialist superstition or maybe like just a peasant level superstition of, you know, it must be ghost, it must be, you know, who knows who did it? Like it's a. So anyways, that's my take on that. All right, say a Popper says in a recent conversation with Brett Weinstein, at the 80 minute mark, the conversation turned towards the question of higher patterns. Brett agreed with you that these higher patterns are not housed in genes, but his answer was that higher patterns are housed in culture. Even in Brett's usage, culture fed spiritual immaterial. Could you be able to, one, steel man, Brett's definition of culture, especially the material location of culture in his definition, is not purely spiritual immaterial. And two, provided your own, provide your own definition as to what culture is. And so I don't, maybe I misunderstood Brett, but my feeling was that in Brett's argumentation, there really, it isn't really clear for him like what that is because he tends to really want to bring what usually we call culture to the genes. That is, he tries to interpret as much as culture by the genes, even religion, through the genes. So he sees them as emerging from serving. He sees them as serving the genes. But he has a sense in which accidentally the genes gave us consciousness that this just happened and that in giving us consciousness, they basically gave us a tool in order to escape the limited program of the genes. Now that is what I understand of what Brett's saying. I'm going to talk to him again in June. We already have a date June 1st. I'm going to talk to him. I don't know how long it's going to take before it comes out. But this is definitely a place where I'm going to try to probe him more. Because to be honest, I think there's a few links missing in his interpretation. And maybe it's because I didn't get it. It's possible. And so I'll give him the benefit of the doubt, but that is the way that I understand his idea. And so what he means by culture or morality is something which is a. It's a virtue of consciousness which makes us intelligent and able to escape the, the patterns that the genes impose on us. Now, if you listen to the interview, you'll see that I don't totally understand what that means. Like, I don't mean. I don't understand what he means when he says that culture, it's like where, like the question you're asking is right. Is right. Exactly right. It's like, oh, so then where are these patterns? You know, if you can. And so even if they're tools, they still have a certain form of existence. And where do they exist? Like, how do they exist? And I don't totally think that Brett's theory accounts for that. But like I said, I'm totally. I totally think that I might be wrong and that I'm hoping that we can kind of get to that in the second part. Now, my own definition of culture is, is really irrelevant because I, I don't think that's the right way of looking at it. I don't have a definition of culture. What I have is a fractal relationship between phenomena and patterns. That is, there are patterns and there are possibilities, potential, and those join together to create things we recognize as having being. But all beings are patterned and most people would call culture are just, let's say higher level patterns which are, which affect intelligent beings that are, you know, they are behaviors, rituals, they are things we celebrate, things we. And though none of these are arbitrary, they're all very coherent and they actually kind of. They actually kind of build up towards higher intelligences. I don't know how else to say it. So, so I just don't tend to think. I don't think it's a good idea to have something like culture which is completely separate from everything else. I think it's better to see the pattern fractally because let me give you an example. Like, let's say is a dog. Are two dogs engaging in a submission ritual? Is that culture? And if not, why not? Right? And if so, what's the relationship between that and our own ritual is a ritualized behaviors that we call culture. I'm going to answer a little bit of that because I recorded a video on sacrifice, which I think is going to be a little bit of a doozy. I recorded a video on sacrifice and especially human sacrifice, trying to help people understand how we can get to sacrifice and even sacrifice. Using of course Gerard to a certain extent, but also using other. Like just my theory of. Not my theory, but the theory that I, that I engage with in terms of fractal, in fractal existence. So anyways, look forward for that. I think it's coming out. It's coming, it might come out a few days after this video on online. So. So Matthew Wyden says, why does the stereotypical American drive a big jacked up truck? Is it something like the natural expression of love for industry and individuality? Yeah, that's exactly what it is. And so the thing, cars are a manifestation of individualism. I don't know what to say. You know, they, they make individualism possible and they manifest individualism in the sense that they really are expressions of you. I mean, you know that because why would you buy a sports car? Like, why would you buy a Tesla? Why would you buy, you know, a car that is fashionable? It's because it's, it's a form of clothing, really. It's a form of large clothing that is very powerful. It's like a, you know, people don't understand that. It's like, you know, the fantasy of the Mecca, the fantasy of Iron Man. It's like we are, we already participate in that. That's what a car is. A car is the same. It's just that in the narrative version of it, like in the, in the more condensed version of it, you actually see the personality, the person in the Mecca itself. Like, right. You see the personnel, the person in the Iron man costume. It's like it's a human extension. That's what a car is already. It's just not as mythological as the, let's say the Iron man suit. But that's what it is. It has to do with power, especially in terms of, of America and North America in general. That has to do with individual power. And so it's a, it's an extension of individual power. So I think that that's the best way to, to see that. So Desert Carver says Elon Musk appears to have breathed new life into Twitter. This has also given conservatives a more boost, specifically in the area of free speech. Breathe. What is the symbolic role that Musk is playing here is he's some sort of techno God. Is this a small preview of when he gives life to our AI overlord by breathing into the nostrils of an electric powered robot body? Thanks, Jonathan. For you. Yeah, I went, you know, it's like, you know, I find it funny too. I'm kind of, I'm, I'm having my little guilty pleasure of, of, of enjoying Elon Musk making the jokes and all that. And so I have to admit, but I think I'm very suspicious. I'm not at all, I don't at all think that, you know, Elon Musk is a technocrat. Like, Elon Musk is a, is a technical. Is. It also is like a technical utopian. And so Matthew actually sent me a little note, you know, saying, you know, I don't know if you noticed that Elon Musk said we're going to authenticate all humans. So there's also that, you know, it's like. So I'm not a big fan of the authenticate all humans thing, you know, in terms of how everything is moving towards these digital ideas. Not a big fan of that. You know, especially as it, as it becomes more and more. There's more and more pressure and becomes more and more centralized. But nonetheless, it's. Some of. It's pretty funny. It's funny just because, you know, there are some people, you know, there are some people that are so blind to their blind spot. Like there are these massive blind spot in the mainstream media ecology, you could say, and people just don't see it. And so it's just funny to watch the blind spots become so flagrant, like, just so, so flagrant that it's, it's like, you know, it's hilarious. It's. But I don't know if it's gonna change anything in terms of the big picture because it's, it's only going to accelerate the culture war or whatever. And I'm not saying it's funny. It's like I'm not thinking everybody should just give in, you know, and just kind of bow down to the, to what was there before. But I'm not. It's. It's definitely not going to get any better. It's going to get, it's all going to get worse because, you know, it's. Everybody's in fighting mode and now it's like everybody's celebrating that Musk is coming in and is doing all these things and people slowly are. Now they have new followers and everything. And like, I get it because, you know, social media, YouTube, all these platforms, Twitter have Been very frustrating because they do seem to have been acting one direction politically. And so. But I would say stay cautious, you know. So Duma Esh says, what is the point of marriage in scripture, it is viewed with extreme importance. I'm not exactly sure why. And reducing it to having kids doesn't seem to be even the main aspect of it. And so you can understand that marriage is. Is really an image of a. Marriage is an image of. Of the life of God. Like it's an image of how two beings can become one without losing their independence, you know, and so the relation. And it's also like returning back into unity in that sense. You see that, you know, some of the church fathers, Sangregov Nyssa, for example, says that the separation of. Of man into man to man and woman was not part of the fall, but it was done in foresight of the fall in the sense that there is already like the separation. And marriage is how there's this kind of return to unity through, you know, without destroying multiplicity. But it's also because it's an image of God and the soul. It's an image of how we are, all of us are. Can become, you know, the bride of Christ. And so marriage is a. Is a way in which to fractally experience that and understand, you know, what it means for us also to be joined with that which. With God. So, so that's the point of marriage. And I don't think that kids are the main aspect of marriage. I think the main aspect of marriage is to be that image of God and of the relationship between God and man. But children are also a part of it because that gives fruit, right? It's like the relationship, like if we become the bride of Christ, if we are the bride of Christ and we will not be fruitless, you know, we will be fruitful. And so there's that too. So divide differences says. Hi, Jonathan. Do you plan to do additional movie reviews in the future? I don't fault you if you don't. It's not like you don't have enough on your plate. But I'm curious if you have any movie interpretations on the horizon. I don't know. I might do a few informally, like for a patron only. I'm thinking about doing that maybe. Like for example, I pretty sure that this month's video, which I need to record like tomorrow, I guess this is how last minute I do these. This month's video is probably going to be on the Spider man movie because there's something really interesting about a Kind of Spider man apocalypse that they were doing. And I thought that there are some interesting hints and interesting, let's say, strategies that, that, that people, Other artists could use in terms. In terms of. Yeah, in terms of that. So someone says Dune, maybe. Yeah, maybe I felt like Dune. Like, maybe I'd wait a little bit because it felt like the first Dune, like this first Dune movie was. Was. It didn't. It didn't like the story was there, but there wasn't that much story in it. Like, it really is just the beginning of the story. Kind of like our, our God's dog book too. It's like, it kind of brings the story together, but it feels like, okay, I want to. I'd want to see the next movie before I, I comment on it, probably. All right. So Matthew says, I appreciate your emphasis and practice of generating new Christian stories and your emphasis on the church fathers. I wonder how those fit together, given the power of narrative and that Christ himself used story parable all the time. I find it somewhat surprising that so much early Christian writing was so conceptual, propositional, like the early apologist. And the narrative toolkit seems to have remained underutilized. Why do you, you think this wasn't a major emphasis in the early church? In other words, why wasn't Irenaeus writing Lord of the Rings? And so that's because you're not looking in the right places. The narrative toolkit appears in the early church in the hymns and in the poetry and in. That's where it is. And so, you know, if you, if you go to an Orthodox church, you will see that there's a play inside the narratives, like a typological game that is happening inside the different hymns of the, of the church. I mean, of course, I talk about. I often talk about Saint Ephrem, the Syrians, hymns on paradise and how it is kind of like the, the summit of that. But there are other versions of that. There are also certain more legendary accounts, legendary gospels that kind of joined the story and kind of participated in the story. A kind of, let's say, interpretation through midrash, or interpretation through storytelling. You definitely see that. So you've been to an Orthodox church and you've gone to, like just now we went through all these paschal services and there's some new, beautiful, beautiful text of, you know, the lamentations of the Mother of God and her exchanging with Christ and tell. Asking him to resurrect and. And then this answer of Christ. So these beautiful narrative structures that are there in, that are in the Christian story. And everybody understands that they're not. That they're not, you know, at the same level as scripture or whatever, but that they really are this kind of interpretation through storytelling. So it's there. It's just not the same. It's just not this. Not. It's not the fiction that we think of today. I think, I think the idea of writing fiction, like just, just writing fiction is, is. I would say, although there are traces of that in the past, it definitely is more of a modern phenomena. And so even ancient, let's say ancient storytellers, if you look at Greece, their fiction was often, let's say midrash too. It was like, take the story of the gods and write a new version of the story of the gods that emphasizes certain things. See it from this point of view, write the story of Prometheus, but from the point of view of Prometheus or, or, you know, and so all the plays that were written at the time of the. Of the Greeks, they had something of that in them. So the idea of just writing fiction, to write fiction, I think is quite modern. I, I don't think there's anything wrong with it, but it's definitely. I think the, the. The way actually that let's say the ancients did, it was probably better because it was more participative. So. Yeah, so that's what I think. So Charlie Longoria says, my father in law asked me why it was palms that were scattered in front of Christ as he rode into Jerusalem. I wasn't sure what to tell him. I kind of took it as just part of the story. But there, but is there any symbolic significance to the palm branches? I mean, there is in the sense that the palm branches are like little world. They really are fractal. Like a palm branch is a fractal structure of the, of the tree. Right. So it's a vertical with all these horizontal, like you can imagine, like a bunch of crosses, you know, like all these, all these levels of reality. And, and the fact that it's like from a tree, it's also like from above. And so there's something about that which is. That is what is going under as Christ is walking in. So there's the palm leaves and then there's also the vestments. And so there's something about the structure of reality in terms of the tree and the garments. Like those are what are being like, put under on the road as Christ is walking in. So the two extremes are being placed there so that Christ can conquer all of it. Right? What is it that St. Paul says? Like, you know, something like he is right now, like, ascending and conquering all these. All these principalities, right? As the church is setting itself up, he's realizing that Christ is, you know, spiritually conquering all these patterns, you know, invisibly at the time, and that the fruits of that will appear later. And so I think that that's what the. That's what the palm. The palm leaves have to do with. Hopefully, that makes sense. So Stephane Gulen Brown says, what is symbolism of the saints or their relics being buried beneath the altar of the church? Of course, this refers to revelation because the saints are under the altar and they are praying to God from under the altar. And they're saying, you know, how long. How long before the return, you know, come, Lord Jesus. Right? That's what's. That's what's going on. And so I think it has to do with the place of holiness in Christianity. It has to do with the difference between, you know, that the church is people. You know, you can see this in St. Gregory of Nyssa when he goes into the dark, the holy darkness, into the divine darkness. Christ gives them the pattern of the tabernacle. And one of the things San Gregory Nietzsche says is like, he interprets so he says, like the pillars of the tent, they are the people. Like, they're the people of the church. And this part of the tabernacle, they're the priests. This part of the tabernacle are the different aspects of the story. And so it's like the body is a people. And so there's that which is that the foundation of our church is the. Is the. Is the holiness. The seeds of the martyrs become like seeds. Saints become like seeds that are planted in the world and then they bear fruit. And so they. They repeat the pattern of Christ in the. In a particular place. There's that, but there's also something else. Like, there's also something deeper and, and more difficult to understand, which is. Which is how Christ transforms death into glory. And so, like, a human body is something that in the Old Testament, like, you know, you shouldn't touch. Like, if you're. If you touch a human body, you're impure. It makes you impure. But in Christianity, that flips or flips in the sense that there's an. It's there in the Old Testament too. I've mentioned this a few times where there's a relationship between death and glory. It's there when. When in the, in the Proverbs, it talks about how The. An old person's white hair are their glory. And so it's like that. It's like how death. Death and glory share something in common. That's what you see in the crucifixion, and that's what you see in this. I think it really is a flip where the lowest thing, like this body, this dead body, becomes the locust of a holy place and. And a kind of promise of the resurrection. Like a, you know, a glimpse of something very mysterious. So, yeah, all right. So David Flores says, honey and the lion carcass. That's right. Well, I've often said that, you know, that Samson is like a. Is like a mist. It's like, you know, Samson has a lot of things that point. I remember, I forget it. I think it was in Irenaeus. I think. Think. I'm not sure. I think it was in Irenaeus where he said something like that. Where he says, like, one of the. One of the. One of the prophets that is the closest to Christ. That is the closest to what Christ is, is Samson. And I was like, man, yeah, there's something about that which is true. Like, it's totally off. Like, in the sense that Samson misses the mark dramatically. But there are some aspects in his stories which come really close, especially the relationship, the non. Dual aspect, right? The relationship with the stranger, the capacity of Christ to. To save Cain, the capacity of Christ to save Rome, to save his own killers, right? To save the stranger, the Ethiopian eunuch, all that kind of stuff. This is what. It's related to, this stuff, to all this transformation that Christianity brings. And the idea of that which is, right, that which is breaking apart or that which is dead is that can also the, you know, the thorns become the. The spiky thorns become rays of light. You know, they turn. They transform into rays of light. That's. I'm using a lot of analogies to help you understand, but it's. This stuff is hard to understand and to contain it all in your mind. All right? So Michael o' Connor says, are you sure things will continue to get worse? I have the sense that it might not. So I don't have to tell you, man. I don't want to. You know, they'll be. They'll. Okay, think about it this way. Like, things might get better in a certain manner. In the sense that, you know, glory also comes out of difficulty. You know, it's like difficulty makes some things shine. Darkness makes light shine more. It makes you see it more. And so in that sense, you know, you know, like in the sense of what's going on now. It's like because of COVID because of this, the breakdown of meaning around us, because people can. Can kind of feel the nihilism palpably in terms of their own passions, but also in terms of the systems of control. Then here we are with this wave of Orthodox catechumen into the church. And so I think that Christianity might actually see some surprising fruits as things become more difficult. But. Yep. All right, so Jen Edziki says. Hi, Jonathan, do you have any practical takeaways from symbolic understanding of the Gospel in terms of combating anxiety? Christ says that the Father knows what we need and will supply those needs. But sometimes I get anxious about whether he will supply other things that may not be strict needs, but that are still very important, especially when I look around and see how other people do not even have their basic needs met. And so, I mean, I think you have the answer to your question in your question, which is that. And it's what Christ says, it's like you cannot add a year of your life by through worry. You can't. Anxiety and worry doesn't do anything. Like, it doesn't help you in any way because it also doesn't offer you a solution. Right. And so for sure, I think that trusting God, but also abandoning being ready for being ready, that you might not have everything that you want, or that you might not have all the comforts that. That you maybe think you need or whatever, but then that's okay. Like, it's okay because that's not what's most important. And I say that it's like, I don't want things to get taken away from me. Like, who. Who does? And I'm not saying that you should. You should be a masochist or anything like that, but yeah, I mean, I think that there's no other solution besides to. To kind of trust God and to do the things that are given for you to do, you know, and you do the things that you can do and those that you can't, you. You have to give them up. Like, to not hold on to them because they'll devour you. And sometimes there really is nothing you can do about it. So Alexander says in the Gospel, Christ tells the lawyer to love God and his neighbor in order to receive eternal life. The lawyer says, who's my neighbor? Christ responds with a parable of the Good Samaritan and ask who was his neighbor? The lawyer says, the Samaritan. And Christ responds, go and do likewise. Christ seems to say, your Neighbor is the one who treats people kindly, therefore be kind. Wouldn't this in practice make everyone my neighbor? This is a strange story to me because it doesn't seem to directly answer the Lord's question. Dude, I totally agree with you. I think that you've got the right, I think that you've got the right insight, man. That story, that story. I don't think I understand that story for the same reason that you're saying, because you would, you would say it's like the way that we are, okay, the way that we interpret that parable is that the Lord says, like when Christ is saying is like the Samaritan recognized the Jew as his neighbor, even though he was a stranger to him and he helped him and those that should have helped him, you know, his own countrymen didn't help him from this or that reason. And so you would think, you know, who was, who is my neighbor. Christ says, love your neighbor. It's like your neighbor, you are loving your neighbor when you're acting like a Samaritan. Right? But that's not what he's saying. He says the opposite, which is just difficult. I don't totally understand because he says, at least, at least, unless it's not translated well, but at least in every translation I've seen, he asks like, who was the neighbor of the, of the, the man who got beaten. And the answer is the Samaritan who, who helped him. And so is that who you're supposed to love? Like those that help you? But then Christ in other places says, love your enemy. And so it's very mysterious. I agree. And sometimes I feel like maybe there's something in the, the translations that we're not getting. I'm not sure. Yeah, but there's often in the things that Christ says, there's often like a kind of things are not what they seem. There's always something a little more that when people retell the story, they don't say it the way that it really is. They kind of change it a little because it's a little off putting sometimes. It's not completely. It's not completely what you would think it would be. People do that with the Bible all the time. My favorite one is when people say that God told Jonah that to tell the people of Nineveh to repent and that if they didn't repent, then God would destroy the city. And it's like God never said that. God just told Jonah to tell the people of Nineveh that he was going to destroy the city. He Said I'm going to destroy the city. That's what he was supposed to tell them. But people put that in there because they don't like the idea that God would say to Jonah, tell them, I'm going to destroy the city. And Jonah says, oh, I'm not going to do that. Because you say you're going to do it, but then you're not going to do it. And then God's like, tell him anyways. And then he tells them, and then God doesn't destroy the city. And. And it's like that's a way more. Like. It's a way more of a puzzle and like a, you know, a puzzling situation. It's a lot harder to understand that than to understand the first part. I think this part, this Samaritan story is the same. It's just really difficult, and I find it difficult. Sorry. All right, here we go. Reuven Corf says, hi, Jonathan, could you elaborate on your past comments in which you speak about succubi being involved in the making or consuming of pornography? In what ways does such a connection manifest? And so am I really going to talk about that? I mean, I guess. And so. So the best way to understand it is that when you're. If you see images, like pornographic images on the screen or in a magazine or whatever, that person who was behind that, the person that was filmed doing that, that's not what you. That's not what you're seeing. You're seeing a whole. You're seeing a whole nexus of causalities which is making that image appear in front of you, a whole nexus of wills that is not just to do with the person being filmed or being photographed, but it has to do with the people that are organizing it and the people that are. That are putting it online and the people that are promoting it and the people that have all kinds of reasons for that to be there. We. Whether it's to make money or for whatever other reason. And so by the time that you encounter it, you're not encountering that person. You're encountering a complex network of patterns. And those patterns have a reality. And that reality is some. It is exactly what a succubus is supposed to be like. The succubus is there to make you lose your seed. That's the purpose of a succubus, is to steal your seed away from you. And you can see that in many ways. You can see that in terms of. Not produce children. You can see that in the sense of. Distract you from your real purposes. So like to take your attention and your desire away from the things that you should be attending to and desiring. And so it will take you away from your relationships. It will harm your possibility of entering into a relationship. It will also just in general take up your attention and your time and in your mind space and all of that. It'll fill up your imagination. And so that's what succubi are, you know, I don't know what to say. You know, it's like they are, they are invisible beings that, that are there to take away your, your seed. So that's what pornography does. So I hope that makes sense. I know that a lot of people are not going to understand what I just said and they're again going to think like, are going to start saying things like, you know, John is superstitious or whatever. The things I'm describing are not. They're completely coherent. Like if you can listen, hear them in the right way, you'll see that they, they make, they make sense as much from a completely traditional Christian perspective as much as they make sense from a purely just anthropological, sociological perspective. Like they, they, they shouldn't surprise anybody. Yeah. All right. Brad says this is going to be a meme. Yeah, man. So Alex Couch says Jordan Peterson described the Bible as the sort of collective dream of humanity. Does this idea have any relation to Adam being put to sleep in Genesis 2? In other words, can the rest of the Bible from that point on then be interpreted as something like the dream of Adam? I don't think so. Adam being put to sleep in Genesis 2 has more to do with the Sabbath scenes that it has to do. It's like a. It's like a fractal version of the Sabbath. And it is, in a way, you know, I can understand why people. I can understand why the church fathers see it as something like a prequel to the Fall or something like something which was done in foresight of the Fall. Because it's like a little death. Like Adam goes to sleep and sleep, sleep. In scripture, all through scripture from the Old Testament, the New Testament, there's a relationship between scripture and death. And so, yeah, in terms of the whole idea of the collective dream of humanity, I mean, I would use a word like maybe the vision, the collective vision of humanity. The word dream I think is ambiguous because, I mean, I think that's probably one of the places where Jordan and I disagree. I think that there are really different types of dreams and some of most dreams are not the Bible. Like most dreams are just chaos. Like they're just a bunch of gibberish. And that's why the Father Church Fathers will tell you to not pay attention to dreams too much. But I think that once in a while, or if you practice the. If you have the right spiritual practice and are on the right spiritual path, then once in a while, dreams can. Can become like a mirror for very high patterns. They can become very clear. Just like you can imagine that dreams are like going into the. Going down into the chaotic waters, like all these waves crashing against each other. You have all these things that are contradictory, that are going all these different directions that don't make sense. You change bodies, you change, you know, you. All of it is. Is chaos. But then once in a while, that water is like, still. And maybe through prayer, through all kinds of things, or through just providence, you have this. This still water, and then it becomes a mirror for heaven, basically. And so I think that that's why. That's why, you know, the image of, you know, the angels speaking to you in a dream that you find in Scripture, you know that Joseph is. Has these angels speaking to him in dreams, you know, to go to. To go to. To go to. To. To, let's say, to. To help him understand that the mother of God is a virgin and then to go to Egypt and all of that, like, that's also possible. Anyways, too much on that. All right, keep going. All right. So Dorothea says hi, Jonathan, could you comment on the whole story of Jairus's daughter and the woman who bled for 12 years are intertwined? I guess it has something to do with menstruation, womanhood. But I would like to hear your thoughts. And so, yeah, that is. That is the insight, my friend. That is insight. You know, I thought about this recently. A few months ago, actually. I don't remember why. I think it's because it was the reading in church. And it struck me so much like. It just struck me because it's like the woman bled for 12 years. Jairus's daughter was. I mean, I don't even think it says in the text, but it's like, yeah, 12 years. She was 12 years old. And so it has to do with menstruation. It has to do with the transition between childhood and womanhood, as. As a kind of death and resurrection. I don't see any other. I don't think I've ever heard anybody say that. But when you see it together, it's like. It just makes so much sense that that's what's going on, you know, and it and it fits with all the fairy tales because all the fairy tales often happen. They all happen. Then all those girls that fall asleep, you know, Snow White and Sleeping Beauty and everything, they all die when they enter womanhood. And then they have to be woken up by a prince. That's a version of this. This is what's going on in the story. It's like, it's the story of Snow White. Jesus is the prince who's waking up the princess. But now it's like it's at a different level. Of course, now it's not, it's not just, it's not just a marriage, but it is really, it really has to do with a fractal virgin of death, which finds itself in the symbolism of, of menstruation and the moon becoming dark and then becoming light again, like just that cycle and the death that comes at the end of the cycle and the residue which is cause. And so in order for the, for the cycle to start again, you have to stop the residue, you have to stop the bleeding and you have to recontain the body in a way that restarts the cycle. And, and that seems to be what Christ is, is doing. And man, it's like, once again, I think people are going to listen to this. I'm gonna be like, what the. But I, I don't see any way around it. Like, I really don't see any way around that that's what's going on in that story. So hopefully, hopefully I won't get into trouble for that, but. All right. Okay, here we go. So Ross Bird says, hi, Jonathan. What is the symbolism of singleness? Why does Paul say in 1 Corinthians 7:7,7, it is better to remain unmarried? Is Christian singleness best understood as married to Christ or as the unmarried virgin waiting the bridegroom? Or both? Or is there some other non marital way of understanding what Paul is talking about? I think that's what it is. I think this is definitely what it is. I think it has to do with the idea that this has to do with the idea of sacrifice and has to do with the idea of self sacrifice as well. It has to do with the idea that the highest version of something is the man in which it gives itself up to the higher being. And so the highest, the highest form of sexuality is abstinence, but not just any kind of abstinence, but, you know, like dedicated abstinence, you could say abstinence towards the higher cause. This fits into just the general pattern that I talk about, which is, you Know how elements of something, their highest aspect has to be the way they participate in the higher being. It has to be right, the higher it wants to get. The highest aspects of all the elements of this cup has to be how they give themselves to the participating in the cup. So in a way, the highest element of any being, it's itself negation into a higher being. That's the highest part of it. And so that seems to be why Christian celibacy becomes prominent and why monasticism becomes the path, the highest path towards God. So you can understand that like the martyrs, for example, do that with their lives. That is, they give their lives to Christ and they get killed. And then they become the seeds of the church. They become like the, they become the reason, the image of how everything kind of comes together, how we have to also do that fractally at lower levels. We don't all have to physically die for Christ, but we all have to die for Christ to a certain extent. We all have to give away, we have to, have to like, they push away our idiosyncrasies and give the highest parts of ourselves up to God, whether it's our attention, whether it's our virtues, whether it's our money, like even tithing is part of this. Like, it all has to do with this capacity for the body to exist. And I think that when martyrdom became less of a question in terms of, you know, when Rome became Christian, then, then that other type of giving yourself became primary. The idea that to be single is to take your sexuality and then you offer it up. You, you, you offer it up to God and then you actually become a model for others. So that's why most of our saints are monks, you know, and it's like, it's too bad, it's annoying. People get annoyed because, like, why aren't there more married, married saints and why, you know, it's like it, but it isn't arbitrary. It has to do with this idea of giving yourself and sacrifice. So the martyrs and then the ascetics, because the ascetics have given their attention, their energy, their sexual energy, and they've become brides of Christ. It's like a hierarchy, right? So, and I think the Church really does understand it that way as a hierarchy, because so, like, for example, in the Orthodox Church, we have married priests, but we don't marry priests. That's the kind of joke that Orthodox always make with Catholics. It's like they often say that the Orthodox have married priests and so we should be allowed to marry the priest. In the church now it's like, no, sorry. Even if you did take our position, once you become a priest and you're single, you're not allowed to get married. And so it's a hierarchy of giving yourself. So if you're already married and you've given yourself to your wife, then it's like, we're not going to get rid of that. Then you kind of give yourself up. But if you've given yourself up to that highest, then there's no reason to now engage in those lower versions of it, let's say. So anyways, hopefully that makes sense. So Anton Olanderson says. Hi, Jonathan, I hope you are doing well. I want to ask about the correlation between the Book of Kings and Revelation. The Hor Babylon seems like an inversion of the Queen of Sheba and her precious stones. And Both chapters mention 666 as it is the number of the beast and the weight of Solomon's gold. That's a really interesting connection that you made there that I never thought about. Wow. Could the mark be attempting Luciferian utopia which will provide you with wealth, I. E. Gold crypto, or is there any other symbolic correlation between the two chapters? I'd love to hear your thoughts on this. Thanks. So there's definitely a relationship for sure with Solomon's gold that comes from the stranger and that also is all accounted for. And the remainder of the gold is all accounted for. There's definitely a relationship between all that and the idea of the mark of the beast as being this, this perfect mark that accounts for everything, that if you don't have that, you cannot buy or sell or trade. So there's definitely a relationship between those two. Yeah, so that's what I see now, but that's a good intuition. I definitely have to think about it more, that there is a. There is an image of the strange woman in the story, but in the, in this, in Revelation, it's a. The negative aspect of the strange woman. Whereas in the story of Solomon it's more like the, the asking questions. Right. The Queen of Sheba comes with her riches and then asks enigmas of Solomon and gets answers from, from the king. And so, yeah, interesting. Mika Mueller says, what is the symbolism of the Northern lights? I can, I. I can only imagine because it's not part of most of our own mythologies, like in terms of, like, it really is a northern phenomena. And so I don't know if I. It would have been known by, by let's say, the people writing scriptures and stuff. But it definitely has to do with dancing light. I mean, it like this, like this image of light dancing in the heavens. I mean, I can just imagine in a more enchanted world, you know, what it could have been like. It. I can imagine being almost like a language, maybe, or like hearing. Seeing it as music, as this. This music in the heavens. But I don't know. I never have thought about what it could mean beyond that. So David Flores says, when is the next Revelation video coming? I've been kind of discouraged of doing that. Like I was going to do one of the Mark the Beast. And I've been discouraged for a bunch of reasons that I think I mentioned along the way in terms of Saint Paisios and some of the warnings I got from people who were close to him or close to people that were close to him. And so that kind of threw some cold, cold shower on what I was going to do. I might still make a video on the women in. In. In Revelation, possibly in terms of the. The difference between the. And the mother, you know, and how those two images are kind of are brought together in Revelation. I might do that. I might make a video on the number of the Beast again. But I still. Yeah, it's not. I think most of you know what I think. I mean, I don't think I've been. I've been kind of hinting at it for a while now. So, you know, I'm not sure I even need to make that video, or maybe I should just to have more reads, but I don't know. So Ajafka says, what is the difference between a spirit and an intelligence, or the spirit and the logos? And so I think that that's also. I think it's, it's. It's. How can I say this? I think it's problematic because I think we often use them interchangeably. I don't think we. I don't think there's. People use it systematically, but for sure, in, in, let's say, in the idea of the Spirit, the Holy Spirit and the logos, there's definitely a difference. And one has to do with the space and the other has to do with, let's say, the filling or the, the identities that fill the space. And so there's a need for this distance, you know, in order for the logos to kind of fill that distance. Because why does, why does the logos. Why would there be a logos if there isn't the. Let's say the. The, for a better word, to use a kind of distance for the logos to, to. To exist in? You know, I don't know. I don't know how to say it. So. But in terms of. I think it's often used interchangeably, like, especially when, when in scripture when it says, you know, your body, soul and spirit. Let's say the way we use the word spirit, I think then it just means spirit in the sense of noose, like in the sense of the highest part of intelligence. So. So, yeah, so I don't think. I don't think. I don't think there's a system there. It's better to just understand, to see it in the structure and understand what it is. So. Marcus David, why is Buddha so similar to Jesus? Was Jesus the prefiguration of Christ in the East? In what way was Buddha divine? Why is Buddhist so similar to Jesus? I don't know. Is he similar to Jesus? I mean, is Buddha more similar to Jesus than other figures that existed before? Like, is he more similar to Jesus than to the Old Testament figures or to other figures like that? I don't know. I mean, I think that definitely there, there's definitely some, some truth in, in many of the things that Buddha did and many of the things that Buddha says, many of those sayings are obviously have some truth to them. And in what way was Buddha divine? I don't think, I don't think. I mean, at least in Buddhism, like, probably because there's so many strains of Buddhism, but I mean, I don't, I don't think that that Buddha, that people considered Buddha to be divine, especially not, you know, the Buddha in the story, like the, the prince, that, that I think they, they considered him to be fully liberated. And I think like in, in Buddhist cosmology, my understanding, especially in Mahayana Buddhism, my understanding is that that there are gods, like, there are principalities, but that the, the. And there are bodhisattvas, but that those Bodhisattvas are moving towards complete liberation. So, yeah, I don't know if it's my. I don't know if it's my job to like, see how this maps on or that it maps on to the way that Christians understand this, this divine hierarchy. Let's say there's probably some relation, or at least intuitively there's a relationship. People noticed that there were these, these principalities and that there were these beings that attained certain levels of, of, of transformation. So I'm sure it's not, it's not just. I don't think they're pretending like, I think they're talking about things that, that are part of their experience. So, so Manuel Montiel says, hi, Jonathan. Was the significance of the number 70 in Scripture? There's 70 elders in Israel, 70 nations divided under unto the gods. The 70 disciples that Jesus sent out. Etc. Is this. This supposed to symbolize the gradual refilling of God in the world? Yeah, I think there are different. I think there are different numbers of completeness or like a complete something in scripture. And I think that 7 and 70 are part of that. Are part of that. Are that symbolism. That's the way that I see it. And so the idea that there are seven days and there are 70 nations, you know, and then there's 70 disciples, I think that those have to do with a kind of complete body, you could say that way. A completed cycle or a completed body. That's the best I can do with that. I sometimes struggle a little with numerical symbolism. And that's why I usually don't go into it too much because I really like to show, if you notice, I really like to show the actual coherence of symbolism and how it's not arbitrary. How there is. You can trace, you can actually, sometimes you can show the causes that create the meaning. And so in number symbolism, I think that you can often do it with 1, 2, 3, 4, maybe up to 8, maybe. Maybe up to 10, maybe. But then after that, you know. Yeah, then maybe like, you know, 10 times, like you can kind of see it. But there's some numbers that I think just become more difficult, at least for me, to really understand how I can explain the symbolism in terms of causality. So I can see it sometimes, you know, through analogies, but it remains a little. Sometimes remains a bit arbitrary for me. But maybe it's also because I'm not a mathematician, I don't have that mathematical thinking. All right. So Anders Ralstad asks. Hi, Jonathan, what is the symbolism of the skin of Christ being whipped and full of scars? Maybe he is in some way removing his garments of skin before ascending the mountain. As Christianity is currently dying globally, can we interpret church scandals as the same scars? Yeah, that's an interesting idea. I don't think I've ever thought about it that way. The idea that, that. That there is a manner in which the whipping of Christ is a. Is a kind of removal of the garments of skin. I'd have to think about it. It's a. It's an interesting insight. Something to definitely that I need to think about it. So I don't know about the scars. Like, I don't know. It doesn't. Scripture at least doesn't say that he has scars from those, from those whips. It's definitely talks about the scars, you know, the holes in his hands and the holes in his side that remain, you know, in the resurrected body. But I don't think I've heard or seen anything about the idea that he has scars. So. But for sure, the laceration like, or the fact, you know, the fact of being, of being whipped is something to think about it. So what is the symbolism? Andrew asked what is the symbolism of hatred in the Bible? Such as when Christ says, if anyone comes to me and does not hate father and mother, wife and children, brother and scissor, yes, even their own life, such a person cannot be my disciple. It seems hate means separation as opposed to the union that love symbolizes. And so the one thing you always have to do with Christ is you always have to understand that Christ is often saying things. He's trying to point to something which is beyond duality. And so often what he does is he has extreme statements, right? So he has extreme statements that push something so far that it comes to a breaking point, right? But then he'll go the other way and he'll have another statement which goes far, almost as far, but in the other direction. And so Christ says this. So he says, if you don't, you have to hate everyone, like hate even yourself. And then he says something else, which is you have to love your neighbor, love your enemy, give your life for your friend. You have to love your neighbor as yourself, which includes also loving yourself and loving your neighbor. And so what's going on here? And so the best way to understand it is it really has to do with the notion of hierarchy itself, which is that you have to love things in their proper place. And so you have to love Christ more than anything. And so you can express it in an extreme. You could say you have to love the Christ to the exclusion of all things. You have to hate everything and attach yourself only to Christ. And there's a sense in which if you say that, it can be true, but it only true if you say the other side as well, which is you have to love everybody, love the entire world. You have to love all of God's creatures, you have to love your enemy, you have to love those that despise you, those that persecute you, right? And so you have to be able to hold those two statements, those two types of statements together to get to the man in which Christ is both the very top of the hierarchy, but because he is that, he also fills the entire world with himself. And so there's no other way to see that. So I don't see how you could interpret that properly without the other side as well. Or else, yeah, Russia just becomes, you know, because if we really did that, then just that and not the other one too, then we'd be in. We'd be in trouble, wouldn't we? So. Yeah, but I can understand in the moment, like when he says something like that, I can just imagine the disciples there and he tells them things like that. Like, there's some things that Jesus says that are so, so extreme. You know, he's constantly saying extreme things. That, that whole section in the Gospel of John when he's talking to the public, he's not even talking to his disciples, he's talking to everybody. And he says, you know, if you do not eat my blood and, and drink my blood and eat my flesh, then you cannot enter into the kingdom or whatever. It's like he's saying that to people in the street, man. That's nuts. So, yeah, yeah, man, yeah. Christ, you can. I always say you can really understand why the disciples didn't totally get what Christ was doing until it finished and until the Holy Spirit came down and, and illuminated for them all these disparate points and gathered them together so they could see the whole pattern. They could see how Christ was connected to the Old Testament. They could see these extreme statements that Christ was making and how they connected together mysteriously in this higher version. It's like, I can. I get it. Because if you're really honest when you read scripture, like if you step, if you separate the things from each other, man, there's some crazy stuff in there. All right, sorry. All right, so why Lawrence says, if Christ fills the hierarchy, can this also be understood as establishing or cementing the hierarchy? Does the Antichrist invert, empty or flatten the hierarchy? So the way that I try to say it is that the Antichrist figure wants to flatten, or at least says he wants to flatten the hierarchy. He says that he wants to make equality. He wants to make all things equal. So. But the way that he does it is by opposing the hierarchy itself. But things aren't equal. They just aren't. Nothing is equal. Like all things are. Things are always unequal. Like even the grass grows unequal. Like there's no equality, you know? And so in order to bring about equality, what the Antichrist figure ends up having to do is to actually create an upside down hierarchy. Right? And so you can see it. It's like you can't, you can't just say that men that, you can't just say that women are as strong as men. You ultimately have to say something completely insane like, women are stronger. You can't say that women are as strong as men. You end up having to say something like, women are stronger than men. And so you can't, it's like you can't even, you can't even say, end up saying something like, just saying something like trans women are women. You can't say just that. You have to make the trans woman the woman of the year. You see what I'm saying? And it's just like, it's just a process because in order to equalize, when things aren't equal and things are actually different and at all different levels, you have to overemphasize your point to a degree that you end up creating an upside down hierarchy. So that's the way you do it. Now what's interesting is that Christ also, to a certain extent, flattened the hierarchy, but in the opposite way, which is that in being at the very top of the hierarchy, he calls you his friend from the top. He has compassion for those in the hierarchy below him. He has so much compassion that he calls them into himself and calls them into his body and calls, calls them his friends and his brothers. And, and so it's a, it's like it really is the opposite. Whereas the, the, the Antichrist does it like this, does it like, you know, we're going to take this down, we're going to equalize everything, and then what ends up happening is they create a tyranny of the proletariat. You can't just have equality. Even Marx knew that you have to create a tyranny of the proletariat in order to get your thing to happen, you know, of course, in the Discourse, Marx will say something like, you know, oh, and then that tyranny of the proletariat will dissolve. You know, it's like, yeah, that's, it's like he's not gonna, it's not gonna dissolve. Once you set up an upside down hierarchy, it's not gonna want to go. It's gonna end up going on its own. But it's, it's gonna, then it's gonna reinstate a normal, natural, you know, like, hierarchy of things. So, yeah, all right, all right. Cur. And Curasser says St. Brigid seems to be a good example of being innocent as a dove and wise as a serpent. St. Christopher has a special relationship to crossing water. But she seems to have a special relationship to holding fire. What can the Western edge learn from her about her eschatological relationship to Babylon and the embodiment of the bride? And so I had to be honest with you, and it's funny that I don't know who's curiouser and curiouser. I'm actually suspicious right now. But I actually have a commission for St. Brigid right now. And so it's right, like. I think it's like this second or third next icon that I have to work on. And so I haven't yet mastered Saint Brigid. She's someone I don't know much about. But I'm definitely going to be studying her, you know, next week, and I'm going to make a drawing of her. And so I'll be kind of diving into her life, and hopefully I'll have a better answer for you. Because until now, I don't know much about her, but I have. But. But the person that commissioned it sent me, you know, a bunch of links and things that can help me to kind of study her life, and I definitely will be doing that before I make an icon of her. All right, so Brandon Burns in the chat says we have to love the entire world. Have you met the world? I agree, but I mean, Jesus did, so I don't know what to tell you. It doesn't mean you have to accept everything. Loving something does someone doesn't mean you have to. You have to agree with everything that they're doing. It's. That's a different stance, you know, so. Right. So Ron Wood asks. It's awesome to see some Japanese symbolism manifest on the channel in relation to the Grail and storytelling as garments of skin. I'm curious about the Grimm stories. They were published most post 18th century. Then 100 years later, Japanese stories of old were compiled in the legend of Tono much in the same way. What is the symbolism of the Grimm Brothers compilation of stories being published as they were? Is it in relation to the Grail? Could this help understand the legend of Tono in a similar way? It's definitely. It's not a good sign. When you write down fairy tales. All I can tell you, I mean, in the sense that it has to do with solidification, it has to do with a moving. You know, writing them down gives them. Removes some of their magic, you could say, but also. But also helps to preserve them in a moment. In a moment where they are in danger of disappearing. So that's kind of the writing down these types of stories is A is a gamble. It's a gamble. It's not a gamble. It's like a, it's a double edged sword, you know, Know. So I think that that's what's going on. I think that in the age of rationalism, the world of fairy tales was kind of ending. Let's say the, the world where fairy tales ruled was ending. And as it was ending, there was a need to write it down. It's the same with Dante, by the way. You know, Dante appears at the, at the transition between it, between two ages, you know, between the Middle Ages and what's going to be the modern world ultimately. And so that's why his commedia is inscribed at the time that it is, because it was going away also. So, yeah, we, you know, we're grateful that they are, but it's, it's. I've said this before, it's like the fact that I'm explaining symbolism to you guys is not a good sign. It's not, it's a bad sign. It's a sign that, I mean, maybe it'll, I don't know, like, it's a sign that we are so far from symbolism that we have to have it explained, explained to us or else, or else we don't. It's like it's, it feels out of reach, but it's also a way to preserve it. And it's a way to also spark something of that which is, which is left of that. Like to re. Spark something. And I think it's the same with the fairy tales. Writing them down is a way to preserve them, to get, to gain, to game, to keep some spark in these, in the kind of dying embers, you could say. So it's, it's, it's the type of thing that is inevitable. All right, so Luca Iramaza says, with the symbolism of flowers, why do we decorate churches so much with it? I think flowers definitely have something to do with glory. They have something to do with like the glory of plants because they're not fruit yet at least like you can use most flowers you can't eat. They don't yet participate in the productive part of the, of the world. Like they're not an apple, they're a flower which is something which kind of precedes the fruit and is beautiful and glorious and attractive. And so I think it has something to do with that, you know, and. Yeah, but I, it would definitely be worth thinking a little more about why we, why we offer flowers for the dead and why we decorate churches with flowers. For certain feasts. Definitely something to think about. And I have to admit to you that I haven't thought about it enough to be able to say something coherent about that. So Daniel Townhead asked thoughts on Bob Dylan's work, both Christian and non Christian. I don't know. I've not never been a huge fan of Bob Dylan. Yeah, I just never been a big fan of Bob Dylan. I don't know why. So I don't have much to say. I don't really know much of his songs. All right, Christian Clyde says Christ is risen. Truly is risen. Any thoughts on the Johnny Depp core case with his ex wife? Guys, who is celebrity gossiping here? Oh, man. Okay, so there's something going on. Okay, so maybe we can say that there's definitely something going on. And, and the. Okay, so there's something going on. Like there's something about Elon Musk buying Twitter and Johnny K and, and Johnny Depp and the, the, the court case and Will Smith and the Slab. All of these seem to be related. There's something about that. There's something about the cultural moment which is. Which is being tested or changing or. Because you could say. But I don't know totally what it is. Like, is it the end of me too? Is it like the. I don't know. I don't know. I'm still watching. I'm definitely watching and thinking and, and you know, but it has something to do. There's a lot of stuff boiling. Like there's a lot of stuff boiling. And with, with the war in Ukraine. There's, there's. There's a lot of stuff that's boiling. And I don't totally understand it, which is why I haven't been super vocal about some of these things because it's like I see dimly. I don't see clearly. So sorry. So Silas Allen says, do you have any insight on the symbolism of child abuse? I think the best way to understand the symbolism of child abuse is in some ways to understand it as one of the worst things that can happen. That is in the sense that as adults and as parents, especially in relationship to children, we are in a position that is an analogical to the position of God with us, with his children, that we are. And so there's a sense that if we betray that analogy and an adult abuses a child, especially like a parent abuses their, their child or something like that, that I think it's one of the worst. And it's related to the symbolism of Christ saying, you know, you know, if you make one of the least of these. Like, if you. What you do to the least of these, that if you, if you, if you make, if you, if one of the. These small, these smaller sheep, if you make them go straight, like, if you make them as someone who is higher up or an authority, like, if you, if you participate in that, man, there's not a lot. You're in trouble. Like, you're in serious trouble. So, yeah, that's what I think of that. So Andre B. Says it's a bit counterintuitive for me that Jesus, who is the Logos, didn't use words, truthful speech to defend himself at the trial. Can you help me clarify this? Maybe I can help you understand it this way. And so the best way to understand it is to understand that we are justified from above, that self justification is the wrong causality. Now, I'm not saying that you should never, you know, you should never justify yourself or whatever, but if you understand it, like narratively, in terms of thinking of Adam and Eve in the garden, when Adam and Eve get caught in the garden, what do they do? They immediately blame the other and justify themselves, and they are wrong to do so. And the blaming others and justifying yourself is related to the fall itself. It's related to pride and wanting to take that for yourself, wanting to self, exist, self, name, self, justify. And what Christ is demonstrating is that even in the darkest moment, like, even in the moment where he's completely right, where every. He's completely right, that, you know, there's no. He has not done nothing wrong, he nonetheless understands that he will not justify himself, you know, that he will be justified by the Father, that he will receive his authority from the Father, that he will be. He'll be. He will be made right by the Father. And so I think that that's the best way to understand that. And it is. You really have to see it as healing or. Or flipping. The self justification, which leads to death in the fall, which is now a refusal to self justify and to wait for the Father to justify you, even though you're innocent, which ultimately also leads him, surprisingly, also like. Leads him also to death, but then ultimately to resurrection. Because as if he. He crashes the whole. I'm telling you, Jesus always crashes the system. He just crashes the whole thing, takes it all, smashes, smashes it together. And so he's kind of doing two opposites at the same time. He's doing something kind of upside down, but right side up and upside down, but right side up. And you're not even sure. Like how much it's all kind of coming together into this one place. And so that's what I see there. All right. Chandler Turner says hello. Jonathan, what advice you have for newlyweds? My fiance and I are getting married in May. We have been together for a long time, and I partially credit the influence of you and Jordan for my decision to finally set up and propose. So thank you. And so that's wonderful. Glory to God. I'm happy to hear that you're getting married. I mean, do I. What advice do I have for newlyweds? I mean, take it, like, take it seriously. Spend. Spend time together, you know. Spend time together, you know, I don't know what else to say. And love God, Love each other. It's tough. Like, it depends on marriages. Like some marriages, it just depends on what happens in your marriage, too. Like some marriages, marriage does something. I don't to tell you, marriage does something. Even if even for people who've been living together or whatever, that. Or they've been going out with each other for a very long time, promising, making an actual. A moment where you crystallize a promise, it does something. So get ready for that. Like, sometimes it's great something, it's wonderful. And then it's like, you know, you carried into to heaven for a certain amount of time, sometimes years. It depends on people. Sometimes it does the opposite. Sometimes it brings you into a very. It makes things all of a sudden becomes very, very difficult, you know, and you see that with all kinds of ritual transitions. You know, there's a. There's a reality about. Even when it's like, it's the first time I say this, but people who've gone through it will know, like, there's a reality about being received, let's say being baptized in the. In the Orthodox Church or being received in the Orthodox Church is that you're going to have something like that happen to you. For some people, they'll like, fly to the moon and they'll be like on the moon for months or who knows how long. And then for other people, it's like as soon as they get baptized, they become like they are attacked. Like, they just. They are just like the. Everything seems to want to destroy them, you know, after they. They get baptized and. Sorry, I don't want to scare you, but I know that in, in marriage that both of those can happen. So, you know, but ultimately it's for the best. Like, you know, I'll be honest with you guys. Like our marriage, my wife and I was really difficult at the outset, for some reason, like, it's just. Everything was just like. And it lasted for a few years, you know, where it was just really tough. And, you know, I think if we hadn't been Christian, we probably would have divorced. But, you know, we kind of stuck. We stuck together and we kind of put in the effort and we put in the. Got through the dry spells and the difficult times. And, you know, we've been married 23 years now, and it's better than it's ever been, you know, so you always have to understand that, like, whatever suffering you're going through now isn't. That's not it. Like, your life isn't over. You know, things change. So. So anyways, all the best. I wish you the best in your. In your. In your marriage. All right, so let's see. Last questions. Nate Barker asks. Hey, Jonathan. What was magic to ancient people? And what is it in. What is its symbolic meaning? Was it always demonic? Or were there types that were acceptable to Israelites, ancient Christians? So I think the best way to understand magic is really just about action, action in the world. That it's like, affecting the world, things you do to affect the world. And so that's just. That's usually the way that I understand it. So there's some magic. Like technology, in a way, is magic. I think I even wrote that on online once. I wrote technology is just misunderstood magic. It's like the opposite of the way people tend to think of it. That is, magic is the higher causes or the, let's say the, the. The. The deeper pattern of that's affecting reality. And it contains all the spiritual elements of it. Right. Let's say I, I use the image of the car before, which is that, you know, the car is magical. Like, the car is magic. And it, and the spell happens like it ran itself through culture and it. Beyond the technical reality of the car. It transformed the very nature of society. Like a spell. Like, you know, like a spell. It's not. It didn't just technically change things. It transformed the very nature of our relationships to each other. It transformed the way we live together. All of this was transformed by something like the car. And so there is a magical aspect to the car. And so, So I think that's the way that I kind of understand it now. The idea of demonic magic has to do with. If you watch my video on the Book of Enoch, you can kind of see it has to do with the manner in which you can, let's say, invoke. You can invoke certain things in order to gain the power that it offers you. And so that's not. That's the. That's definitely the bad kind of magic, you know, so anyway. But you have to understand that when I say use the word magic, I really mean in terms of just affecting. Doing things to affect the world. And so, you know, you could say like, for example, like if. You could say that if you learn to hypnotize people, that's a form of magic. Like if. If you learn to seduce people, that's a form of magic. Like if you learn to. So it's all. It's all about learning behaviors and ritualized ways of being that will have power on the world. But. But technology is also part of that as well. So. But I mean, usually like the kind of magic that we think of, magic, like, you know, drawing a circle on the ground and. And, you know, like, you know, doing that kind of stuff. It, like that usually is stuff you should stay away from because it. It usually does involve some kind of weird invocation or, or. Or some kind of transaction, you know, and all that stuff is probably best to just really stay away from that stuff. So. Yeah. All right, so I think we're done, man. Usually lasts longer than this. Maybe it's because there's not that many people in the chat. So I don't know if there are other questions in the chat. I could answer a few if you guys want. Let's see. Well, if not, then we'll go and that'll be fine for me because I'm tired, so. All right, everybody. It was good to see everybody. Thanks for Brad for showing up and moderating as usual. Thanks for everybody and we'll see you. We'll see you next month. So bye. Bye. I hope you enjoyed this episode of the Symbolic World. The Symbolic World is based on a series of videos that you can find on my YouTube channel, Jonathan Pedro's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course, leaving a review on itunes."}
