{"episode_id":"SW - #018 - 2018-10-03 - Mixing Linen And Wool - The Deep Symbolic Meaning Of Purity Laws In The Bible","start":0.48,"end":68.44,"speaker":"Jonathan Pageau","text":"I would like to welcome you to episode 18 of the Symbolic World podcast. In this episode, I will be playing for you a thought that I had about a year ago, trying to explain some of the more difficult aspects of the Bible. I noticed that when I heard some atheists criticize the Bible, they would often go to certain key examples. And one of the examples they used to criticize how silly it was was certain laws in the Old Testament, specifically the law which forbids the mixing of wool and linen. And so I thought that it would be an interesting way to deal with this, would be to explain this law and explain how coherent it is and how symbolically coherent and how it can lead to a certain shape of the world. And so enjoy. This is Jonathan Peugeot. Welcome to the Symbolic World."}
{"episode_id":"SW - #018 - 2018-10-03 - Mixing Linen And Wool - The Deep Symbolic Meaning Of Purity Laws In The Bible","start":78.68,"end":1496.86,"speaker":"Jonathan Pageau","text":"One of the things that gets people riled up when discussing the Bible is purity laws. It seems you can't listen to someone criticizing religion for two minutes before they start saying how stupid it is that you can't weave linen and wool together. Then they'll go on to say that the laws in the Bible, which are about washing and about latrines and not having latrines in camp, are just misunderstood and primitive hygiene. But honestly, myself, I find those laws to be some of the most interesting and the most important in terms of understanding how the world works and how we interact with what is around us. And so I'm going to explain them as much as possible. When we look at the creation story in the Bible, we notice that the world is mostly made by two processes calling forth into being, let there be, and then separating beings into clear opposites. Heaven and earth, light and dark, water and dry land. And then the plants, they're separated into space species which are meant to reproduce themselves according to their seed. And then animals are separated into categories. Fish, birds, land animals, etc. Etc. So it's both separation, demarcating the difference between things, and it's also a form of unifying, giving clear identity. So each separated thing has a heart, it has a seed, a principle, something which unifies it as a phenomena. Now, you'll notice that this process of creation is a cosmic version of how we engage with the world. Just as God in Genesis, by speaking, separated the chaos and potential of the primordial world into demarcated categories, so too we engage the indefinite potential of phenomena, and we both separate. Separate and unify. So, so? So, so this pen, let's say this pen stands out, is separated from the field of phenomena, surrounded. Surrounded it. But it's also held together as A pen, you know, it, which is not a self evident thing because the. The pen itself contains an indefinite amount of complexity. It has a series of constituents, and each of these characteristics contain a near infinite number of micro variations within it. And so it goes. But our mind, our experience, holds the category of the pen together as a discrete unity. At the same time, it separates it from the rest of the world, separating and bringing together. So we could call this the right hand and the left hand of Christ. It's the Logos as the good shepherd who both hold the flock together, but also chases away the wolves. Okay, so that's what the Logos does all the time. And I've talked about this before, so I'm also going to link to some of those talks in the description. So what did this have to do with purity laws? First off, it's important to notice that, that we play a part as mediators of meaning in holding the realm of being together. Let's say we must constantly preserve the consistency of things if we want the world to remain coherent. And often that's for our own sake. So for our own sake, that's why we don't eat feces. And yes, that is a question of hygiene. But this process of keeping things integral and separate, it is also why we don't want to drop our telephone in the bathtub, or why we don't want to drop some ketchup on a nice white shirt. And those are not about hygiene. We reproduce this action of Logos when we shut our doors, lock our doors at night, when we build dikes, when we wash our hands. And that's why we have men and women's bathrooms, at least for now. And the bathroom question is important because the bathroom is related to purity itself. It's a place where you don't want confusion between what is eliminated and what is retained. And so the bathroom is inherently the experiential anchor, let's say the ground level, of the importance of keeping things clearly distinct. But there are a million examples of how we deliberately keep things separate in order to avoid them becoming confused. So instead of seeing purity laws as a form of hygiene, it's best to see it the other way around. Hygiene is a limited form of a greater process of keeping things separate, preserving the integrity of categories. Unduly mixture can contaminate things to a point that all you have is a gray sludge, a kind of mud that's useless for anything. So, for example, if you mix iron with a bit of carbon, you get steel, which is stronger than iron. But if you mix it with too much carbon, then you get something called pig iron, and then it is useless. We also do this conceptually. We have conceptual categories like mine and yours, like inside and outside emotional ones, like joy and anger. And all of those categories have to preserve a certain level of purity in order for me to operate. So if the distinction between mine and yours, for example, gets confused, then war will come of it. And of course, there is never absolute purity. And that's really important because the desire for absolute purity is called pride. And in the Bible and in the Christian worldview, it is the root of all sin. And we'll see that in the biblical laws as well, how that plays out. But we'll get to that later. To begin, it's sufficient to say that there is a need for a certain level of purity, or else at some point comes the flood of chaos. So I'm going to look at a few purity laws, not the obvious ones like washing rules, but let's look at the weirder ones. So there are three, actually four laws in Deuteronomy 22, verse 9 to 12, which I like quite a bit. Thou shall not sow thy vineyard with two kinds of seed, Lest the fullness of the seed which thou hast sown be forfeited together with the increase of the vineyard. Thou shalt not plow with an ox and an ass together. Thou shalt not wear a mingled stuff, wool and linen together. Thou shalt make thee twisted cords upon the four corners of thy covering, wherewith thou coverest thyself. So these four verses are actually beautiful pattern. So the first verse, the first law, is about not mixing two kinds of plants. The second is about not mixing two kinds of animals together. And the third one joins the two first ones together and is about not mixing plants and animals together for clothing. So now the pattern moves also in a repetition of the order of the creation of life. Genesis, in the first chapter of Genesis, with first the creation of plants, then of animals, and then the question of how all of that relates to human beings. And the final verse, the one about twisted cords, has to do with the Sabbath, the seventh day of creation, the day when God rested at the end of creation. So just like the last day was a day of rest, a day when one should not work, the final fringe of the garment has to be not worked, that is, not woven or tied and left alone, simply twisted together to act like a buffer of chaos at the end of a garment. And this is. This is echoed by the fact that the preceding laws that insist on the separation of things are also about work. So planting seeds, laboring the field, and weaving clothing. Whereas the fringe is an ornament, right? It's a decoration. It's not a form of productive. It's not a productive object. And as for the meaning of the fringe, there are similar traditions in all kinds of cultures about leaving the fringe of, let's say, rugs alone and other similar things. And it has to do with this idea of rest, with death, and with the idea of how to deal with things, the final things that don't fit. I spoke a lot about this in my video on Shrek, so you can check it out if you want to know more about that. Now, although it does not say this explicitly in the text, in Jewish tradition, this fringe is called tzitzit, I might not be pronouncing that right. And it has something, and sometimes in the past, it has been made exactly out of a mix of linen and wool, the very mix of linen and wool that is forbidden a few verses earlier. So what does that mean? The fringe is the margin, right? Those of you who have listened to my talks will have heard me discuss this quite a bit. It's the edge. It's. It's equivalent to the flood. So the fringe of the vestment represents the buffer of chaos in between categories and the chaos which surrounds the field of being. Some might find this odd and maybe a stretch of interpretation, but when one is aware of the basic structure of laws in the Bible, one knows this to be the case because it is a pattern which repeats itself. So, for example, we find many places where the edge of a space or the end of a cycle is marked with a form of rest. We saw it the week. There's also the jubilee. There's also leaving the seventh year of laboring of fields for the field to be left alone. This idea that at the end of something you have to leave things unfinished, but it's also in that place is also a place of mixture. So, for example, if we compare the fringes on the four corners of the vestments, the Israelites were supposed to leave the corners of their fields unharvested and so unfinished. And this leaving unfinished was specifically so that the marginal people and the foreigners or the strangers among you could gather the grain for their own use. So for more on this, you can read the story of Ruth in the Bible, where these images, the images of the remainders of the foreigner feet, all of these images of periphery are brought together. So coming back to the purity laws mentioned, one would ask why they do that? I mean, why would they not mix wool and linen and then have wool and linen in their fringe? And the reason most of you will have guessed by now is that these purity laws are not just a bunch of stuff you need to do, but they are a pattern of being. They're trying to show you the need for keeping things separate in general, and do it by reproducing their order in a kind of cosmic image, a microcosm. They do that by using the same pattern as in the creation story. So to attend to these laws is a way of stamping in us as an image of the world and ensure that the world does not fall apart. You have to keep things relatively separate, identities, boundaries, categories, clearly demarked. And then you must also leave a margin where mixture and chaos is left alone. One of the Jewish interpretations of why you should not mix linen and wool together has to do with Cain and Abel, who both brought their sacrifice to God. One brought an animal sacrifice and the other brought a vegetable sacrifice. And the result is that the mixture or confusion ended up with the murder of Abel. You can take that further and see how the life of agriculturalists and that of a nomad or a shepherd, those are two exclusive forms of societies which should be preserved in their particular identity. So already, as I'm stretching this out, one can see that these laws are meant to keep the world ordered. And you might think that I'm pushing it. But think about how we deal with rules, let's say how we deal with rules with children. We don't just tell kids that they have to be orderly. That doesn't accomplish anything. What we do, for example, is we tell a child to make their bed in the morning, make their bed every morning, you know, or we tell a child to wash their hands. And when we do that, we're not just demanding a result in the present, but we're expecting that the habit of making one's bed every morning will create a mode of being which will follow the child into life and ensure that this child keeps his life in order when they become an adult. And so living such a patterned existence, the one described in these laws, might lead to a world where people would not be tempted to grow human organs in sheep, or to grow ears on rats, or to create glow in the dark animals. A world where we would avoid creating sterile hybrid fruit and vegetable, or avoid something like crispr, which proposes an endless possibility of monsters, right? It wouldn't give people the desire to bring back the woolly mammoth, for example. It would be a world where mixing Intelligence and consciousness with machines would immediately seem suspect. You might say that I'm pushing it. I'm exaggerating the extent of what these laws can have that the ancients did not think in such terms. But I don't think so. For example, in the ancient flood traditions surrounding Noah's Ark, we have this notion that the giants which appeared at the end of that world were a mixture of the sons of God and the daughters of men. These giants were said to have taught humans all kind of technology and magic. And one of the traditions is that these giants made many chimera, that is, monsters, which were mixtures of different animals. And this is one of the reasons for the flood. You see, the flood is that very falling apart of the dikes which hold things sufficiently separate from each other so that the world can continue to exist. I mean, one vision of the flood could be found in no longer holding things clearly distinct from each other. Man from animal, male from female, child from adult. And the ancients knew this very well. So why don't we follow these rules anymore? The rules about linen and wool, especially Christians don't follow those rules. Christians still have purity rules, at least traditional Christians. Baptism, of course, being the prime one, but also the liturgy. In the liturgy, the priest will wash his hands ritually. We have the washing of feet once a year. But we don't have rules about mixing. I mean, nor do we have rules about, you know, kosher foods and other rules like that. So how to make sense of that? So I wanted to come back to the notion of wool and linen, because it's one of the most complete examples of all this. And it will help us to understand why Christians don't follow these rules. Besides the fringe, there's another place in the Bible where joining linen and wool is not only permitted, but is actually mandated. The priests in the tabernacle. The tabernacle is the place where the priest would offer sacrifice and where the ark of the covenant was. So the priest wore a linen undergarment with a wool tunic. The way the priest wears his vestment possibly reproduces what is forbidden in the laws, but it also reproduces the tabernacle itself. In the tabernacle, a linen veil was used to separate the different places in the tabernacle. So the holy of holies from the holy place, and then the holy place from the outer court. But then the tent itself, the outer covering of the tent was made out of. Out of animal skins, different types of animal skins. There was first a wool skin, then there was. There was first a Wool covering and then a skin of ram's hair which was dyed red. And so you can see that it gets coarser and coarser as you get out. And then finally there was the skin of an animal which we don't know what it is. And until now, you know, scholars, Jewish scholars, Christian scholars, discuss to try to find out what this unknown animal is. So it fits perfectly with this idea of the fringe as being this question mark, as being this thing that doesn't fit, that isn't sure, that is indeterminate, let's say. So in the temple we see the law in action. So not only are the plant and the animal separated, but they are used as separators. They are used to mark different spaces and to contain different spaces. Christianity, in one of its important facets is a constant discussion on how things can be both united and separate at the same time. For example, it is very important to that Christ and the incarnation of God is not a mix between God and man. I mean, there were a century more than we could say, at least a whole century of argument about how to formulate this, to formulate the fact that Christ is not a hybrid, not a mix between God and man. But the church fathers really insist that Christ is both fully God, fully man, united without mixture. In the same way, God is a trinity, both unity and multiplicity, fully found in God without confusion, without the confusion of persons. I mean, these might seem like contradictory, meaningless statements at first reading, but they're extremely important in the vision of Christianity of how unity and multiplicity need, how they can coexist, and therefore how the highest non duality of being can be expressed and the multiple and dual can be expressed as well within the grand vision of the infinite. And it's really important in how Christianity can be universal and can join itself to all cultures, all the while preserving the possibility of this multiplicity in unity, not dissolving all, all peoples and identities into this uniform sludge. And so the symbolism of Christ will show how it is, since Lelogos is the origin of the world, how it is that he transcends the problem of keeping things only separate from each other. Some of the symbolism of this is around Christ's tunic, which in the Bible is described as being a tunic without seams. That means that that isn't different pieces of material sewn together, but is rather one woven piece completely. So that's really important, this idea of this unity. And they say that this tunic without seams was never torn apart. And some of the earlier Christian symbolism, we see this is used, for example, the the cloth. There's a cloth that is used to cover the host during communion, to cover the chalice in the Eucharistic ritual. And in some early traditions of Christianity, this was meant to represent both the pall of Christ and, so, you know, the cloth which surrounded him as a body, the cloth that surrounds a dead body, but it was also at the same time his tunic without seams, that that cloth was made specifically out of wool and linen together. Another way to show this transcendence is in the very old tradition of showing an ox and an ass in the place where Christ was born. And this is interpreted in the Church Fathers as being a joining of the Jew and the Gentiles, the joining of the the inner people with the foreigners. And this obviously refers to those laws in the Bible we mentioned earlier which forbids yoking an ox and an ass together. So for those who want to know more about this, I've linked to some articles that I've written on the subject in the description. But in the meantime it goes to show that many aspects of of religion which can seem so strange and superstitious at the outset, are actually a desire of formulating, and not just formulating in an abstract way, but participating fully in how the world exists and also reflecting our capacity to affect how the world exists. So I hope this was useful. I'll see you soon. If you enjoyed this content and our exploration of symbolism, get involved. I love to read your comments in the comments section below. Please go ahead and share this on social media to all your friends, and also please consider supporting us financially on Patreon. You'll find the link to the Patreon page in the description below."}
