{"episode_id":"SW - #289 - 2023-06-02 - My Most Anti-Symbolic Talk - The Quest For A Spiritual Home Conference","start":0.32,"end":2116.21,"speaker":"Jonathan Pageau","text":"Because people will disappoint you. Your church will disappoint you, your spouse will disappoint you, your kids will disappoint you, everybody will disappoint you. And then you'll find out that you'll disappoint yourself. So what are you going to do? Right? So you could just live in that despair or you can die. You can choose to die. And if you choose to die, then there's a surprise, right? There's actually a surprise which is you could call it the resurrection. A little one little resurrection is that all of a sudden some of those things start to shine and they actually start to be fuller than what you thought when you were trying to hold on to them. This Jonathan Pedro, welcome to the symbolic world. I love not talking first because every time I get all these ideas that are different from what I was going to say in the first place because the fall was just bringing us all these powerful images. So first of all, it's great to be back with some of you and to meet some of you, all these faces. A lot of people that I've been, you know, even met them on YouTube or been met them on zoom calls and all of that. So it's just wonderful to see people in real life. And thanks for, thanks for coming. So I'm going to give the most anti symbolic talk that I've ever given. I think it's what I'm going to do today. You know, when the title, when the title came, the Quest for a Spiritual Home, the image that right away came up for me was that it's impossible, right? There's an impossibility in the finding of a spiritual home. And I don't know why that's the first image that came to me, but I came to formulate it this way. Maybe it's going to actually be a bit of a technical question that is that in order for the world to exist, we cannot own a home. That's maybe one of the best ways to formulate that. And there seems to be something in the way that we formulate our stories, the way that the big story is formulated, the one that Paul brought us on, you know, from the fall to the eschaton that is captured in the Christian story that seems to be hinting at this all the way through. So what is, why do I say it's going to be an anti symbolic talk? It's that most of the time what I tend to do is to point people to the beauty, right? To the fullness, to the fact that the world is full of light, that the world is full of the grace of God, that the world is full of these patterns that point us to their meaning and shine. And I think that that's absolutely true. But there's also another aspect to the way the world exists, which is that we always have to be disappointed in the things that we find along the way. And that's actually. That's actually a necessity. It actually has to be that way. There's no way around it. And it has to be that way for the. You know, when I talk about this hierarchy of reality, right, these layers of how the world exists as this fractal structure of things embedded into each other. Well, it seems like one of the corollaries to that, or one of the things that makes that possible, is that everything, while being full, is also always insufficient all the time. It always has to be. And that seems to be a big part of the story that you find in scripture, like the whole big narrative. And the crucifixion is the surprising part of that. It's one of the most surprising ways that the story tries to deal with that problem. So we see it right away in the beginning in the story of the garden, which is that God places Adam and Eve in this beautiful space. And Paul is absolutely right that it is definitely related to the temple. Or we could say, I like to see it the other way around, honestly. I like to see it that the temple, all the imagery of the temple that we find in scripture, the tabernacle, you know, even Ezekiel's kind of prophetic temple, is a memory. Call it a memory of the garden. That we are made in a way that we have a nostalgia in us. We're built with this nostalgia. We have a sense in which we should find something like that. We want it, we desire it, we're looking for it in everything. And when we hear the story of the garden, you know, it's a mythological description, we recognize in that story something which is true not only in a kind of historical, like, let's say, historical way, where we have this idea that they were people that lived in a garden before, but that it is in some ways the structure of our everyday experience. We know that when we engage in something, when we see it shine and we move towards it, is because we see it as a breadcrumb leading towards paradise. Because if we try to find rest in any of those breadcrumbs, right away we realize that it's not enough. That breadcrumb is not enough. And the story of Ulysses that Paul had Brought up this morning. I hadn't thought about that as an example, but it's a very powerful example where, you know, Ulysses has this massive adventure trying to find. To go back to his image of paradise, to his garden, to his wife. You know, even the imagery in the text is very similar, by the way, to Genesis, because his bed is made out of a. You know, it's like. It's like. It's like embedded into the. A tree that was planted there. And it's like. It's like embedded into. To his own bed is, like, built out of a tree that is there. And so it really is this powerful image of this central tree, right, this tree that we see in the Garden of Eden and his wife as the. His home, as the space in which he finds rest. And it's powerful. It's the perfect imagery. It's a perfect imagery. You know, when Paul brought up the image of the heavenly Jerusalem, that is how home is described. That is how the heavenly Jerusalem is described, as a bridal chamber, as the place where, you know, the man and the woman meet, where they find rest in each other, you know, where they find, we could call it productive rest, where life is born. All of that. It's. It's exactly what that is, but it is. It's something like an eschatological memory. We can put it in the past, we can put it back in the mythical times, we can put it back before the flood in history, or we can project it into the future as the ultimate goal, as the ultimate destination. But that's how it appears necessarily, because in some ways, it sustains. It sustains the world. When that image lands, when it happens, there's an aspect of it which is bright, and there's an aspect of it which is death. That's how we encounter it. We encounter it as a coming into something real and then ultimately having to give that up. And if we don't, then it becomes a. Becomes an idol. Right? That's. The whole story of idolatry in Scripture has something to do with that. All these things that are good, we try to grasp them, then they immediately they die, you know, so we have to give them up on purpose. We have to, let's say, let them die willfully so that we're not caught with this frozen dead thing in our hand. And. Right, that's right there in the. In the story of Genesis, that's what happens. You know, there are many traditions which say that the fruit that God had forbidden Adam and Eve was going to be given to them. It's there in Jewish tradition. We find it in the church fathers. You know, you've heard me, if you listen to any of my videos, you've heard me talk about Saint Ephrem the Syrian. Ephraim the Syrian says that explicitly. But in order for it to be real, they couldn't grab it for themselves. It was the grabbing for themselves that transformed it into death. That God was to give it to them. They had to receive it as a. As a gift from heaven, is the best way to describe that. So I want to give a. You know, I always give the same examples, but you can kind of understand it in anything that you experience. And when I say that this is true for the world to exist, I really mean it technically. I mean it in any. Anything that you can imagine, anything that you can participate in. It always has to give itself towards a higher participation. Always, right? Walking. When you're walking, you're walking for a purpose, and that whatever that purpose is, it's somehow embedded in another one and another one and another one. And there's a sense in which, if you're properly aligned, then all of that gets filled with light. You know, if you. If you work and you make money, that's great. If you try to grasp it and you do just that for its own sake, then all of a sudden it becomes. Becomes idle. And that's true about anything. It's true about anything that is even religious. And that's why it's so difficult, because people think that, you know, and I'm Orthodox, I really believe that. Like, I believe that icons are holy. I believe that, you know, I believe in the sacraments. I believe in all of that to be absolutely real. But there is a way in which we always, always have to be careful and understand that this always has to be a breadcrumb towards more. Because if we think that we're going to find our spiritual home in this world, we're going to be disappointed. If you think you're going to find like a kind of rest where you can just kind of stop, yeah, you're gonna be very disappointed. And that's. And I say that it's important because, you know, in some ways I'm telling people, go to church, right? I say it all the time, you know, you should go to church. You should go to church. I'm just, you know, you should participate. You should participate. But it's important to understand that you will be disappointed. Yeah, you're gonna run up right up against the wall. You're gonna go Orthodox people, Catholic People, you're. One day you're gonna go to confession and. And you're going to say, you're going to talk to the priest, and the priest is going to say something absolutely crazy to you, like completely insane. You're going to go to church and you're going to find out that, you know, oh, this guy's cheating on his wife and this, and that all of that is going to happen to you. There's no way around it. You will be severely disappointed in the world. But like I said, there's a manner in which that has to be true, right? I'm not making excuses for anybody. Christ has a great saying. One of my favorite sayings of Christ, which is that scandal must happen, but woe to those by who it happens. Horrible things are. Disappointment, breakdown. People not living up to what they should is absolutely necessary. It doesn't excuse their behavior, it doesn't excuse what they're doing, but it's absolutely necessary so that you are able to not hold on to it, that you're able to let go of it as an idol or as something that you think is going to bring you ultimate satisfaction. And so we live in that tension, always that strange tension. And once you understand that tension, it can help you actually understand many of the images and of the way that the Bible talks about all these questions. Because in the story of the Bible and also in the story of Christ, you will see that tension always played out. And it happens, like I said right away in the story of Genesis, Adam and Eve grab the tree, and because of that, they lose their home. They try to grab it, they lose it. And then Cain, after he kills his brother, tries to build a home. And it's like a. It's like a weird scandal, right? He's like, he's trying to make a home for himself. And, you know, is that good? Is that bad? Should we do that? Should we build, try to build homes? Should we try to construct them? Is that our job? Is that our role? And the answer is yes and no. It's both. It's both at the same time. And so we see an image of Cain building that civilizational thing. Building that city leads to the Flood. We see an image of that in Babel as well. And in Babel, you really see what the. What the image is. In some ways, Babel is the opposite of the heavenly Jerusalem. If you want to have a good image of how that functions, you see that in the story in Babel, humans try to make a name for themselves. You can understand that. Exactly as this taking the apple for oneself, they try to name. It's great because we actually, in a time in the world where everybody is trying to name themselves, they're trying to self name, they're trying to grab onto, even hold on to themselves as their identity as being full. And because of that, they necessarily lose it. There's no way around that. And like I said, it's a technical thing. Anytime anything you're doing that has multiple parts of it, anything. If you're driving a car and all of a sudden you just get really hypnotized by the turn signal and you just get, I don't know, you're obsessed with the turn signal, you're going to crash your car. Anything that you do that you try to grab on to, the parts of will collapse the whole thing. That's how it is. And so the Tower of Babel shows you that it's a powerful image because it tries to take one human name, one human identity, and raise it up into heaven and make it the home for all, right? Make it the universal home for everyone. We're going to solve everyone's problems. We're going to create a system that's perfect, we're going to settle this, and that doesn't work. And the heavenly Jerusalem is exactly the opposite of that. It's a beautiful image of this fractality and it actually helps you see how it is possible to have homes. How can we live it? How can we find consolation in the things that we participate in without making them into little tyrannies? And the image of the heavenly Jerusalem is first of all at the center of the city is the garden, but also the lamb. We'll get to that. Why? The lamb is at the middle there. But it says that the kings and the nations give up their glory, bring their glory into the city. And that's like. That's exactly. That's an image. That's one of the most powerful images of reality I think, that has been described, is that in order for us to be able to find joy and some consolation in the world, we have to always be giving it up towards a higher participation. And as soon as we try to grab it, as soon as we try to rest in it, then it becomes. Then it breaks down. There's no way around it. And that is the best image of civilization. That's it. That's the best image of civilization you've got, is the idea that we all have our identities, we all have our families, we all have our nations, our languages, you know, the things that we care about. And the only way for those to hold together is for them to always be kind of given up and offered up. And that's why in some ways, it's always a dying. There's always an aspect of reality which is something like willful dying, you know, dying on purpose so that you're not surprised by death giving up some of that control, so that you're not surprised when the ground falls from under your feet. So in scripture, you'll see that the homes and the rituals and the kings and all the structures are often represented as concessions. God is conceding this stuff to humans. It's as if God is saying, I'm your home, you know, But God is in heaven. Like, you can't live in heaven, right? And so. But he's like, this is where you, you know, I'm trying to bring you up the mountain, right? I'm trying to make you come, like, all the way to the top where you will come into contact with the infinite. Well, you will find, you know, joy in the highest good. But, you know, God knows that that's not going to happen. And so God is always kind of giving concessions, and that's why it's represented that way. And sometimes it can be a little alarming because, you know, even if you read the book of Exodus, you'll see it's. It's kind of always. God is always kind of conceding. You know, God tries to give the law himself, you know, writes it on the tablet with his own finger. Eh, it doesn't land. It's too high. So God's like, okay, Moses, you. You write. You write the law, right? You do it. And so now Moses writes the law, and then that sits lower and it kind of lands. But then, you know, okay, so Moses is. Moses says, I need help. I need help. So, you know, God adds Aaron and then adds all this. All these other, other things. And you add this weird sense, like it's a concession. And you see the same in the story of the king. You know, everybody loves to point out that the king is a concession. In scripture, you know, people ask for a king, and then God tells the. You know, Samuel tells the people that if you have a king, the king is going to take things. He's going to act like a raptor, right? You're going to have something above you like a. Almost like. Like a raptor bird that's going to come and take things from you. And he's totally right. But then, weirdly, there's another image in the Bible in the Book of Judges, especially, where everything's really chaotic, and it says the reason why it's chaotic is because there was no king in Israel. So you think, how do we have those two things together? How can we have, on the one hand, all of civilization, everything that makes us human, be a kind of concession and something that in some ways isn't good enough, but at the same time, it becomes an actual image of the way that God reveals himself into the world. And I think that, like I told you, in some ways that tension between those two sides, that's actually the key to understanding how the world works. And in some ways, that's the key to living your life. You kind of always have to navigate between those two things. You know, it's like you fall in love with someone and it's amazing, and that person is your home, and you're like, this is it. I found it. And then you get married, and then you realize that was not the case. Like, this person is not going to fulfill all your desires, not going to fulfill all your aspirations. Just not. It's just not going to happen. And I'm sorry, if there's anybody who's in a new relationship and thinks that that's going to happen, it's just not going to happen. I don't know what to tell you, so get ready for that. But the thing is that once you realize that that's actually how the world works, then maybe it's not that big a deal. And actually, not only it's not that big a deal, but in some ways, maybe that's actually the path towards your own betterment. It's actually the path towards your own salvation, is that finding the places where reality disappoints you is an opportunity to make that next jump. You know, I heard through a friend of mine who was a nun, she was saying that her abbess, she would always say that the heartbreaks make the best nuns, like those women that were heartbroken make the best nuns. Because in that disappointment, right, in trying to find satisfaction in a man, to find their home in a man in that break, it became an opportunity for them to move further, to move up from that. And so I'm saying that obviously, it's hard. It's impossible, right? It's really impossible to do that. But in some ways, it's the only way to do it. There's no other way. Because life will disappoint you, because people will disappoint you. The church will disappoint you, your spouse will disappoint you, your kids will disappoint you, everybody will disappoint you, and then you'll find out that you'll disappoint yourself. So what are you going to do? Right? So you could just live in that despair, or you can die, right? You can choose to die. And if you choose to die, then there's a surprise, right? There's actually a surprise which is, you could call it the resurrection. A little one little resurrection is that all of a sudden some of those things start to shine and they actually start to be fuller than what you thought when you were trying to hold on to them. It was Chesterton that said that before he was a Christian, he would chase after liquor and cigars and women. And then when he became a Christian, he realized that he could finally enjoy cigars, alcohol and a woman. But it's because he wasn't running after it anymore. That wasn't his purpose. He had turned his eyes towards something higher. And then all of a sudden, the simple, the joys of the world became consolations when they were there. But they weren't that which we expected of reality. We didn't expect it. We don't think that it was owed to us. Like, I'm owed this. I'm owed this home. If I can't find it, I'm going to live in, like, bitter disappointment for the rest of my life. And this is. It's important for us to see that, especially today, because, you know, we have a consumer culture, obviously, and we're promised that all these things are going to bring us satisfaction. And some of us, we think that we're not materialists and we're not affected by that. But the same problem happens in the church, in the churches, or in our spiritual communities is that, you know, there's a reason why the modern world has so much hopping from church to church or from this to that is because in some ways we're looking for the perfect home. I'm not saying you should just settle for anything. Obviously, I made that move. I moved from one camp to the other, and I joined the orthodox tradition. And then I was severely disappointed. Right? And then I was disappointed. Luckily, there's like, you know, it's funny, the reality is made in a beautiful way, like God has made it in a beautiful way. And that's also why we fall in love, I think, is it's good that at first we're kind of drawn and we don't see the death part of it. We just see the light. And it's great because it is like that crumb that brings you closer. So it's good that at first, usually when people join a church or they convert or they get baptized, for the first six months, depending on people, it's like, right. It's like they're in heaven for a few months. It depends on people, you know, and then it just like then all of a sudden you see that, no, this is not your home, you know, this is not your home. And that helps us understand the image of Christ more fully. Why did Jesus appear the way that he does? And there's a way in which the idea that the Lamb is at the center of the holy city, it's very powerful. This idea that the Lamb of God, which was sacrificed before the foundation of the world, that's a very powerful image because we tend to have an idea that death and sacrifice, that's the concession, you could say. Or that's like the exception that Christ came to die because of our sins, and that's why the cross appears. But there's a very deep, deep mystery in the notion that that's actually how the world is made. And that at the highest point and at the top of the hill is a sacrifice. And that in order to have the world exist, it has to be given up. You have to give it up. And that's actually how everything else falls into place. Once you give it up, then you get it back. You know, in the story of the sacrifice of Isaac, that's exactly what that is. That's exactly what that is. God says, you know, God doesn't say it that way, but ultimately it seems that God is saying, for you to have your son, you have to give him up. And if you don't, you can't. You won't have him. And that's actually the only way. And you can think about that in all your relationships, you know, everything, all your relationships, if you think about it that way, that, you know, if you love your wife, you have to be willing to give her up. If you love your children, you have to be willing to give them up. And that once that happens, then you stop grasping so you don't grasp so much. And then you find these surprises, right? These beautiful, joyful surprises that come. That come with that gesture. And so that's when we come to the image of the crucifixion. There's a. In the Orthodox tradition, we have. It's one of my favorite, maybe is my favorite service in the church here. It's a service of lamentation that comes on Holy Friday. And it's A kind of a meditation and a lamentation of Christ who is on the cross. And the imagery that is used there is the craziest imagery. Like, it's some of the most powerful imagery. And what happens in that poetry is a collapse of home and death together, right? Where the tomb of Christ is the bridal chamber, you know, where the man who is dead on the cross is the bridegroom, that Christ entering into the tomb, that is the highest Sabbath, that is the highest rest. And like that clash in your mind, it's hard to hold it together. But, you know, I hope the way that I've tried to kind of set up that tension for you to understand that in some ways that's actually how reality works. And when we say, you know, when I say that, it's hard to explain it, but when I talk about Christ and I tell people, like Christ is revealing the way reality works, it's not just a story you have to believe in to be saved. It's actually showing us the way that the world is made. And I think that in the image of the crucifixion, obviously, with resurrection coming, without the resurrection, then, yeah, then you're right. Then it's just some guy dying. It's just some. Just death. But the idea that. Think about the sacrifice of Isaac in the image of the crucifixion, that's what's going on, the same thing. But now it's a self. Like, now it's self sacrifice. It's a Christ who gives himself up, Christ who gives himself completely, who's willing to die, who's willing to let go, to let go of everything. The surprise behind that is that that's what makes you exist and that's what makes the fullness of your life possible, is in that spot and you give up. And so then you can understand all the. Right. All this idea that in some ways the imagery of us being strangers in a strange land, the imagery of us not having a home, the imagery of the ascetics, for example, think of all the monks that go out into the desert and, you know, that want to give everything up. It's not a. It's not just a kind of masochism, right? It's not just a kind of. It is looking for fullness, but knowing that fullness comes through sacrifice. Now, we're all. We're not all called to do that. Obviously, I'm not a monk. But those images, and especially, I mean, especially the image of the crucifixion, they become a marker of how reality works. And that the reality in which we can exist could say that. And so I'm not called to sacrifice myself fully. I'm not necessarily called to go live in the desert. But you know, maybe I'll sacrifice, you know, I won't work 15 hours a day and I'll spend some time with my kids. Maybe I won't, you know, I won't buy that new car, whatever. And you know, I'll give that money to the church or to charity or I'll, you know, I will understand that it's actually giving up things that those very things find their, find their real, their reality. There's like a little secret joke behind all of that, right? There's a funny secret joke behind all of that, which is that, let me put it this way. Who enjoys food more? A billionaire at a banquet, right? Or a monk eating a piece of bread that hasn't eaten in three days. Who do you think has more pleasure? It's kind of weird, huh? And then you realize that it's not. And the thing is that I'm almost like, I feel. I probably shouldn't even tell you that. Like I shouldn't say that because the idea is not to fast so that you have more pleasure, you know, like some of the, like some of the Epicureans. But that is going to happen actually. It's like. And we see that in the way that the orthodox tradition presents the spiritual life. That's actually how the whole spiritual life is presented. I often bewilder people when I tell them that if you read the writings of the monks and the ascetics, they tell you to not care for any spiritual experience. Like don't. Visions, don't pay attention to that. Constellations, forget it. Don't think about any of that. It's like you see an angel, you see Christ appear to you, ignore it. It's like what especially like in this modern like kind of psychedelic type people world where they all want to look, looking for spiritual experiences. And you think, no, that's actually how it works. That's actually how it works. And so the monk that ignores the spiritual constellations in a strange contradictory, in a strange paradox will have more spiritual consolation than anybody who like is going to go out to look for their little spiritual experience. And that's actually, like I said, how the world works. And so ultimately I think that, you know, hopefully you'll see that it is anti symbolic in the sense that it's the aspect of reality that I don't talk about as much, but it's very important it's very important, and it's true for all the things that I say, that the secret part of it, the hidden part of it is that all of the things that I talk about, all of the beautiful imagery, all of the powerful manifestations of these patterns, they all only exist in a sacrifice. They only exist in the manner in which they're capable of emptying themselves into higher participations. And so we have to not. We have to enjoy the meaning that is provided to us by kind of seeing the world that way. But we always have to be careful not to grasp it. So that was my message for you this morning. It."}
