{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":0.24,"end":85.56,"speaker":"Jonathan Pageau","text":"What you're about to see is a discussion I had with John Hears from the why Are We Talking about Rabbits? Podcast. John Huers runs a foundation called First Things foundation, which does international work, international aid. But he's also very sensitive and very open to learning from the cultures that he encounters in terms of noticing the difference between what he calls Old world and new world thinking. And I found that his podcast is actually a great introduction. If you guys, symbolic thinkers are looking for. For a way to introduce your family, your friends to the difficulty of the modern world and to the possibility of symbolic thinking, this podcast is definitely a good place to start because you really take people by the hand and shows them the difference in thinking. And so with the Lord of Spirits podcast and this podcast, you've really got a nice little ecosystem of old world thinking that is coming together. And I really enjoyed this discussion. We talked about everything from, you know, the encounter with different cultures to also figuring out whether or not I'm really an old world person or if I'm just posing as an Old world person. So please enjoy this discussion. This is Jonathan Peugeot. Welcome to the symbolic world."}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":94.87,"end":96.31,"speaker":"John Heers","text":"Jonathan, welcome. How are you?"}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":96.87,"end":104.95,"speaker":"Jonathan Pageau","text":"It's great. It's great to. We met a little bit before and some email changes, so it's wonderful to see you healthy and back on track."}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":105.67,"end":123.16,"speaker":"John Heers","text":"Jonathan and I were scheduled to do this show right when I got Covid, which I think I've mentioned on a previous pod. And basically what happened was, is I tried, but, Jonathan, I was hooking up the apparatus and I felt sick and dizzy, and I was like."}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":123.16,"end":125.28,"speaker":"Jonathan Pageau","text":"I could see it in your eyes that you just weren't."}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":126.16,"end":166.9,"speaker":"John Heers","text":"No, that was right in the throes of it. So we rescheduled. You're here. I think a lot of folks who come and listen to our podcast will know you. I think some won't. So I went to go do a bio. Then I realized, man, this brother's got. I want you to do your bio. I see you fundamentally as a teacher, and here's what I mean. I think what happened is your artistry has just broken out of you, and it's like a sweat in my mind. And what's happening is your theory on art is, in fact, what you're teaching us. And the theory on art is tied into. I think what we talk about on the show is old world, new world. So am I crazy? Is there something like that going on?"}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":167.95,"end":220.33,"speaker":"Jonathan Pageau","text":"I get. It's a good. It's hard to really. I've never felt like I needed to pin down What I was doing or who I was. I think that I have a love for. I've developed a love for pattern, you know, and seeing kind of the patterns unfurl in front of me and kind of enjoying and rejoicing in seeing the order of the world. And so that happens in the way that I produce icon carvings, but it also, like you say, kind of bubbles out and becomes this participation or this rejoicing in the patterns in Scripture and in the patterns I see in the world and how the story of Christ kind of has permeated all of culture and how it's easy to. I find joy in kind of pointing out to people, you know, that this story is just everywhere, and you can't avoid it, you know, so."}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":220.48,"end":269.19,"speaker":"John Heers","text":"So we have this. Our construct on the show comes from our experiences. So I like to call it in line with reality. We're not ideologuing or whatever, Gnosticizing. I'm making up words. But our experience as a nonprofit working overseas in this Peace Corps model, what happens is we experience something like an old world, and then we experience the new world that we carry over in our souls or minds or bodies, and it's a real divide. I wonder if that's a real divide in your mind and your soul. Do you see something that shifted and that now we're in something new as opposed to the old? Is that even a thing?"}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":270.63,"end":404.86,"speaker":"Jonathan Pageau","text":"I think so. I think it's a proper way to understand it. There has been. The way to understand that there's an old world and there's a new world is to the extent to which people look at the old world or look at medieval art or medieval stories or medieval world and can't make heads or tails of it, have no idea what they're looking at. They think they're just looking at a bunch of crazy people that must have been insane, because how could they produce such images, such stories, such legends? And so because of that, you know, you get the arrogance of the Enlightenment and the arrogance of the new atheist types who look at everything before them as this kind of. This kind of stupid superstition. The entire world before me were just a bunch of idiots, because I look at what they're saying and I look at what they're doing, and I can't understand it. And so I think that that is a testimony to the fact that there definitely is something that happened, a break, a shift. Whereas when you go overseas or you go to more traditional societies and you encounter people, you realize that they have something in common. There's Something in common about the capacity to view the spiritual world as being embodied in reality and seeing how these things. And they have their different ways of talking about it or describing it, but for them, it's a completely natural moment. I had a funny moment one time when I was in Haiti. Actually, I was in Haiti, and I was talking to a bunch of carvers, and I was helping them out because I work with artisans overseas. And they were kind of talking and talking, and then all of a sudden I said that I was Orthodox, and they looked at each other, and then they started talking, and they were saying things amongst themselves. And then I kind of hinted at the fact that I could understand what they were saying. They looked at each other and they said, oh, the Orthodox, they have a bit of the mystical vision. And you can realize that what they were saying to each other was usually when I'm with a white person, we don't talk about this stuff because they don't understand it. They have no sense of what we're discussing. But all of a sudden, they had this weird hint that maybe this guy has a little bit of a glimpse into the notion that there's this connection between the spiritual world and the embodied world."}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":405.26,"end":436.26,"speaker":"John Heers","text":"I took my family with three daughters at the time. We were Orthodox Christian missionaries in Haiti. Oh, wow. And I know it's super reality, what you're saying, and you know, where. Was manifest in their understanding of icons. So the Protestant missionaries there had struggled with our icons in our house. So, you know, we're foreigners, and they come walking into our house and they're very taken aback by the fact that we had icons. And they kept saying, why did you adopt the pagan traditions?"}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":437.46,"end":438.1,"speaker":"Jonathan Pageau","text":"Hilarious."}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":438.74,"end":483.5,"speaker":"John Heers","text":"Whoa. Because we had done the Serbian tradition of, I think more. But for sure, the Serbs do this where they take a candle and burn across just over the. Over the door, over the entrance, all the entrance ways, just as, you know, a blessing. And they saw that and boo. Like, oh, we had it. But you're right, we could meet on a different level. It can be a scary world, though, because. So talk to us about what the new world in your mind or in your work. What did it do to the mind, the way we think, or perhaps even better to art? What happened as you see it, in terms of the mind and then culture?"}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":484.06,"end":578.74,"speaker":"Jonathan Pageau","text":"Well, the way that I understand, let's say this new world or the development of this new world or the development of the modern world is I see it as a form of deincarnation, as a form of. It's kind of Like a breakdown of Christianity. And I think it's part of the story. I think it has to happen. It's part of the scandal that Christ talked about. And so I don't, you know, I'm annoyed with it because I'm in it and I have to deal with the consequences of it. But I also think that it's part of the story. And the way that I see it is that it's as if the two. If in Christ the invisible and the visible were joined, and if in Christ that became explicit, like the notion of the invisible and the visible joined together in one person, perfectly with all the ways that we tried to describe it in the councils, then it also seemed to have opened up a possibility that now that we know about these, now that we have clear formulations about two natures and about all this stuff, then at some point in the late Middle Ages, in the early modern period, it started to split apart. And then what you ended up seeing is you ended up seeing descriptions of God which became more and more removed from reality, leading up to Deism, where this idea is that God is basically so outside the world that he's actually arbitrary. It's completely arbitrary. There's no connection between God and the way that the world lays itself out. Or a more kind of a stranger version, which is the idea that God is basically just like a super being with a lot of powers, you know?"}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":578.74,"end":579.02,"speaker":"John Heers","text":"Right."}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":579.02,"end":684.06,"speaker":"Jonathan Pageau","text":"And so it's like he's basically like always like the Marvel Comics version of God, right? He's like this super being with a lot of really, really powerful. And that's usually the God that the new atheist types like to attack, because some people do really believe in a God like that. It's like, how can God listen to all the prayers of all the world? Because, you know, how would. What kind of brain would he have to process all the prayers of the entire cosmos, right? It's like, that's not possible. It's not scientific possible, that kind of nonsense. And so those are the two extremes. One of them gave form to idealisms and kind of abstraction, and the other gave form to brute materialism. And so it afforded us some power, like it afforded us real power, which is the development of extremely subtle theories of mathematics, extremely subtle theories of the notion of algorithms, all these patterns that people are, that the scientists are able to perceive, and also a force in the world to create technologies, to create medicine, to create all of this. So it afforded us a power. But because of the deincarnation, then it also leads us astray and leads to fragmentation. It leads to the breakdown, the social breakdowns that we see. And then the clampdowns which are the reaction. So you have a breakdown, things start to break down. People notice that there's nothing there. Things aren't holding us together. And now what we want to do is we want to overcompensate by creating systems of control. So you have totalitarian states coming together at the same time as you have this kind of crazy excesses of passions and excessive. So you have the Roaring Twenties and then you have the Nazi Germans. It's like you have these excesses which start to manifest themselves."}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":684.46,"end":706.55,"speaker":"John Heers","text":"Is that what you see when you see. You're in Canada, but you see in our country that there's people marching into the ca. I don't see blue and red there or right and left. I see people trying to put together, put back together a world that they know is coming apart in their bellies. They know it in their gut. Do you see it is that I see, I hear."}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":706.55,"end":824.08,"speaker":"Jonathan Pageau","text":"I think that's the right. Exactly the right way to understand it is that is as we've moved away from the thing that unites us as we, you know, as we've. And you can see, like, the idea that it's like one nation under God is actually a very late statement, you know, in the story of America. But you notice that the reason why it was put there was almost like to say, we're noticing that we're not a nation under God anymore. So we have to say it like, we have to say it so that it stays true for a while at least. And then that leads to the other opposite, which is. It's like, no, we can't put religion into the state. And so all of this, it's always like a move between breakdown and an overcompensation. And so that's what we're seeing right now is that you have two sides. One side which wants to affirm nation identity and this closed borders, all of this type of talk. Then you have another side which is basically saying identity is evil. Any form of identity is evil. It's all about multiplicity. It's all about the outside is better than the inside, the stranger is better than the national. So it's like these two. It really is these two extremes. And so they can't. There's no way for them to come together. And then both of them can't see the other. They can't see. They can only see the sins of the other person. They can't see. Let's say, the value in the discourse of the other. And so when the left is violent, it doesn't see it. And when the right is violent, so they only see the violence of the right. And the right tends to see the violence of the left. And so it's like, so you can have an autonomous zone in Seattle for months, but when the right attacks a federal building, it's like, oh, my God, it's the end of the world. This has been happening since March. This whole. This has been going on for months and months. But it's like, so there's this weird incapability of seeing and seeing the other side. That's a dangerous place."}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":824.56,"end":861.86,"speaker":"John Heers","text":"Sarah from Rose talks. I mean, he's not addressing politics as much as his spiritual life, but he talks about a bridge that once you cross over, it burns behind you in the sense that there's no framework to see the other. It's not that I can't. There's no framework for me to understand what they're talking about because basically everything has become Nietzschean, personal politics. Everything's just become, how does that serve me? And I find it really fascinating that in the end, I don't know how it stopped. Like, I don't know how it fixes itself. And I have a feeling you don't think it does."}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":862.02,"end":931.3,"speaker":"Jonathan Pageau","text":"I don't think it's going to fix itself. I think that one of. I think, at least for people who struggle to see it, the best way is to try to see it in yourself, because we have that same problem in ourselves, which is that it's like, think of the times where you've sinned or the times that you've binged a cake or you've done some. You've given in to a passion somehow. And then it's like, as soon as that's finished, and then you look at yourself and you don't recognize the person. You're like, who is that person who did that? Or you lie and you lie, and then you catch yourself lying, and five minutes later you're like, what? What did I do? Like, who is that person who lied? And you have no way to see that person. And that person that's lying also doesn't have a way to see the person that wakes up and wants to confess the sin. Right? Like, those two people in you are kind of fragmented and broken. And so ultimately, the work of the spiritual life and the work of Christ and the work of the church is to be able to reconcile these fragmented pieces of us into one person in the image of Christ."}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":931.94,"end":982.53,"speaker":"John Heers","text":"So talk about reconciliation. It's a little bit of a twist in your work on your podcast. You're talking to a lot of non orthodox Christian people. I mean, you have a sizable audience. We deal with this too. How can you reconcile what do you do with the vocab? How do you manage the vocab? Because what I find in modern people is there's a place you go with certain words. You shut everything down. What led me to your show was you did this thing that I feel like I've always been trying to do in my classrooms and now with the foundation, and I loved it. You're both. And is there a reconciliation process you had to go through? Did you have to decide what you're doing in terms of that space and your faith?"}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":982.85,"end":1086.8,"speaker":"Jonathan Pageau","text":"Well, I think it's weird because I didn't really decide to do this, like this whole thing, this whole YouTube thing. I was kind of thrust into it in a strange way. But I feel like when it happened, in a way, I had been mentally. I realized that I was often mentally playing a mental game with myself where I would always ask. I was trying to explain something to someone who doesn't believe in God at all. It's like, how can I say this in a way that someone who has no idea about Christianity could even know what I'm talking about? And so I think that I had kind of done these weird mental gymnastics to try to find ways to talk about it. And it seems like it has some connection. And it's also, I think the reconciliation in you is important in the sense that one of the problems we have when we are inside the church is that at some point we have this vocabulary, this kind of self referential vocabulary. And sometimes it can actually make you feel like you know what you're talking about, but you don't. It's just because all these words fit together in a nice, in a nice way. And you can just quote this father and use phrases that you've heard the priest say and everything, so you actually don't know what you're referring to. And so one of the things that I was always trying to do is to say, what is this talking about? Like, what is deification? What are we talking about? What is, you know, what are the passions, what are the. What is, what is all, what is noetic? Like all these words that we use that are. That are very technical, trying to try to find a way. It's like, if I can't explain it to an atheist, then it doesn't mean anything. To me, like, if I can't. Because it's supposed to be about our experience, right? It's supposed to be about the real experience of the world, not some theoretical, just theological thing."}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":1087.36,"end":1178.47,"speaker":"John Heers","text":"This is the teaching part of you that I just am thankful for. And I'll tell you so in the classroom, really, that's what's taking place all the time. And then. So my experience figuring this out, my very first experience was in Peace Corps, living in Mali. And I'm. What you just talked about, reconciliation was, is how do I actually meet folks that are using a different cultural apparatus, language? What do I do? Because we're actually experiencing the same thing. In Mali, we really were on the same wavelength, but there were all these barriers. And I feel like in our country, we. We Christians, orthodox folks, we have to remember this. There's something empathetic and beautiful about remembering it, but not trying to curate it so much that we're not being real. And that space is really difficult to get right in there. And I find this about relationship. So I bring a guy in our show who's the bluest cat you've ever met. I mean, he's just a Nietzschean liberal. Love him. He's an atheist. In variation, he's called Uncle Seth. And he comes on and he just rips. He just lets it go. But he's literally an uncle to my kids. They love him. I love him and everything. And then when it's all over, you know, what stands in the rubble is the two of us. Somehow we need that. Can you feel it in Canada, too? Can you feel it ripping apart in Canada, or is this an American gig going on?"}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":1178.47,"end":1258.53,"speaker":"Jonathan Pageau","text":"The thing about Canada is. The thing about Canada is that the cultural war is over. And so it's not that. It's not just so. It feels more peaceful because basically, Christians have conceded every point, every single point. Like, they've just conceded everything. And so because they've conceded everything, then there's no struggle. And so it can feel almost like there's no problem. But it's not that there's no problem. It's that we've, you know, we've had weird moves that have gone almost unnoticed of removing the. Removing male, like father and mother from the law. So we've had these weird moves in Ontario where people actually did that, and it barely went noticed in the media because there's no discussion in the culture. It's just basically the plan is moving along, and so we're going towards something, and there's no resistance. So it's not necessarily better. It can be better in the immediate term because you can't see the conflict. But it's like you can't see you don't have a conflict if you let yourself go to your passions either. Like if you give in to your passions all the time, you're not going to have an inner conflict. You're just going to keep sinking down into this thing. And so it's not necessarily better. There's less conflict at least. Overt conflict at least."}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":1258.77,"end":1269.64,"speaker":"John Heers","text":"So tell our audience real quick. You and Jordan Peterson had a collective moment. You saw yourself saying some of the same things. And you know him, right? Personally? Yeah."}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":1269.64,"end":1291.04,"speaker":"Jonathan Pageau","text":"So well, we met a little bit like about a year before he became famous. And so he kind of thrust, he kind of put me out there. It was very strange moment, but it didn't last that long. A lot of people still want to really connect me with Jordan Peterson, but it lasted basically like a year and a half. And then he became so famous that I, you know, that I couldn't."}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":1291.44,"end":1295.44,"speaker":"John Heers","text":"Did it get dismissed in Canada, that conversation that he was trying to have?"}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":1296.31,"end":1348.5,"speaker":"Jonathan Pageau","text":"Well, he didn't. I mean, the law got passed. Like in terms of the whole problem of enforced speech and all that. He definitely didn't succeed. Everything just kind of happened. I think that he definitely has a. He definitely has people who listen to him in English speaking Canada. He did part of his book tour was here in Canada and he was quite successful. So he has the same crowd there here as in the US it's just that let's say in Canada we have state run media mostly and so we don't have. It's like for all the problem of having something like CNN and Fox News, at least there's some space for distinction. Whereas here we just have CBC basically and there's a little bit like there's a few publications that aren't completely on board, but it's not as. There isn't as strong. So."}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":1348.5,"end":1377.5,"speaker":"John Heers","text":"Okay, so go back with me for a second to symbolism and you know, the artistry in Africa where I spent a lot of time. It's not that hard to explain this, but in America it's difficult. Why do you think symbolic thinking is so difficult for us? Because it could be seen as weird. You're talking about goats and horns. And why is it difficult?"}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":1378.14,"end":1494.25,"speaker":"Jonathan Pageau","text":"Well, I think one of the things that makes it difficult for sure is that we're very far into the garments of skin, you could say, which is that we're kind of far away from the more primordial Perceptions. And so we live in a padded technological world where you could not notice that the sun is going up and going down barely. You don't live outside. You don't have. You don't experience the cycle of the seasons as much as a person in a. More. In an older culture would. And so a lot of the symbolism is connected to these more primordial perceptions. Up, down. This idea of light, dark, and the cycle of light and dark with the procession of the equinoxes, and all of this is something that you perceive when you kind of live in the natural world. So because we're so padded, it's more difficult for us to. To perceive that these patterns are everywhere and that they're kind of part of. But it's also just because of a very long process of demythologization that has happened in the modern world and even within Christianity as Christians embrace scientism without maybe even realizing, thinking that they're helping their cause by trying to defend the Scripture in terms of scientific theories and trying to find science in Genesis 1 and all that stuff. It's like they thought they were defending Scripture when in fact they were basically raising up this weird scientistic thinking because of that. They don't. A lot of people even find it threatening that there are patterns in stories. If you try to show them that the story. Let's say that the story of Moses crossing the Red Sea is the same story as Noah crossing the Flood, and. And that it has the same pattern, it's like, no, no, no, no, no, it can't, because it happened. Right."}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":1494.49,"end":1495.13,"speaker":"John Heers","text":"There you go."}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":1495.69,"end":1519.19,"speaker":"Jonathan Pageau","text":"Events don't have patterns. Events are arbitrary. And then patterns come on top as this thing that's added. But the symbolic thinking obviously says that no, the world lays itself out in patterns. And it's normal that you will find patterns in stories. And it's normal you'll find those same patterns in reality, in your everyday life. The same patterns will be there. You know, maybe not as concise as in the stories, but they'll still be there."}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":1519.51,"end":1575.98,"speaker":"John Heers","text":"But one doesn't cancel out the other. See, this is the notion of truth in paradox. I think we lost. Look, I don't want to pick on my. This is one of the great questions. I really want to hear what you say. This is not on my list either. This one is really brutal because so many good people, I don't know what political persuasion they're in, want something like a return. And so many good people in the Orthodox tradition in America. I'm talking about American Orthodox now they. I want something like a return to what we were. And I always just want to go, but weren't we always. Now here's the language. I don't want to offend anybody. Weren't we always a heretical country? Weren't we always Protestants? And so for the Americans, that's a really, really confusing question because I really don't want to recapture and regain the thing that in some ways is what you just described as the destroyer of the mystical nature of Christianity. So what do we do?"}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":1576.45,"end":1576.69,"speaker":"Jonathan Pageau","text":"Do?"}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":1576.77,"end":1580.53,"speaker":"John Heers","text":"And first of all, was I too hard on the Protestant tradition?"}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":1581.01,"end":1678.99,"speaker":"Jonathan Pageau","text":"No, but I think that it's. These are. These are the hard questions. These are definitely the hard questions. That is that I think that as kind of traditional Christians, it's very hard to say that we want to be constitutionalist or that kind of stuff like you hear people talk about. Because America was founded on a revolt against the king. It was founded on a fundamental. Founded on enlightenment ideals, which are this idea that we declare these truths to be self evident. It's like none of these truths are self evident without God. A lot of these things you're saying are not that obvious and as self evident as you think if you don't have this hierarchy of being as part of the way you understand the world. And so I agree that in a way, the United States is kind of like the last kingdom, or this kingdom of the edge or the kingdom of the end or something awake, something like that kind of democracy before the fall. But at the same time, it has something which I think in American culture will also appear, the seed of the new world. I think that that's going to. There's something inevitable about that. I like to use California as a kind of microcosm where it's like, California has all the worst things in the United States, like all the most degenerate, worst, decadent things are all in California. But if you go up in those mountains, you'll find some of the most powerful monasteries and you'll probably find weird ascetics living in caves that praying all day. And so it's like it has everything. So it has the end, but it also has seeds for a new beginning, maybe or a new revival or a renewal."}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":1679.07,"end":1704.17,"speaker":"John Heers","text":"In that sense, do you fear more or welcome more postmodernism or the new way of thinking that allows. I mean, I just did a podcast on priestesses. Apparently that was a big conversation in 2018 on the Internet. Oh no. Priestesses are everywhere. So I call that some type of postmodern eruption. Right. And so is that what do I think of postmodernism?"}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":1704.17,"end":1737.39,"speaker":"Jonathan Pageau","text":"I think postmodernism is useful to the extent that it's useful and it's horrible and dangerous to the extent that it is, in the sense that postmodernism has strength because it breaks down the certainty of atheistic kind of enlightenment, let's say the end of enlightenment kind of atheistic certainty. And it breaks that. And it really does. It also, it creates a space where suddenly I can talk about symbolism and people can even know what I'm talking about."}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":1737.39,"end":1738.55,"speaker":"John Heers","text":"That's right. Yeah, that's right. Yeah."}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":1738.78,"end":1753.66,"speaker":"Jonathan Pageau","text":"I think 60 years ago, 70 years ago, the things I say, I said would not even. People would not even had hooks in their mind, to put it. Like, they wouldn't have a place in their experience to place the things I'm talking about. Whereas postmodernism has afforded that."}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":1753.74,"end":1865,"speaker":"John Heers","text":"Yeah, first things foundation. It does aid. We aid people. I hate this concept, okay? But I want to hear from a symbolic thinker and someone. An orthodox brother, but just a person who's made some sense out of all this. Our concept is, is that aid is for you. So when Jonathan Pageau goes down to the food bank, it's for you. And then. And here's why. Is because when you go down, if it's a sacrifice of some sort, in other words, if you're going into the ground in some ways as a seed, what's happening is, is you're being reborn through the process of aid. And so we can't lose track. And so our whole model is that you're not really going to aid somebody else unless you're in some sort of modus of. I don't like suffering is the word for an orthodox Christian, for I think a modern person. Like, I don't really get it, you whip yourself or something. But what you have to do. So we go and live right alongside everybody who supposedly is suffering, and then we live just like they're doing, and then we spend two years. Nobody wants to do this, Jonathan. Nobody wants to go do this. But what happens is when you come out the other side, what you did is probably a project or five or 10. But what you really did is you. You did this thing like Kant talks about glasses. You really stripped off a pair of glasses that you thought you had on, and you become somebody new. And then that is also an outcome of aid, and it should be. And where a project doesn't have that happening. And again, I pick on some people, but I love people who want to help. But if you're taking a bunch of kids for a weekend to a foreign country and they're putting up a wall and then they're flying back home. There's no. There's no down in that. So they can't come up. So am I crazy? Can you speak to this?"}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":1865.08,"end":1985.59,"speaker":"Jonathan Pageau","text":"No, I agree. When I spent seven years in Africa and I worked with Mennonites, actually, so I worked with Mennonite Central Committee. And the reason why I work with Mennonites was because exactly of that perception that they had, they had a very similar perception to what you're talking about. That is we lived so. We had no salary, we had a stipend, and we lived in local neighborhoods. We were the only white people in our neighborhood for years. And also they basically tell us for first six months, you actually don't do anything. You just learn the language. You learn the language, you figure out where you are, build a community, build relationships. And then after several months, it's obviously flexible, but after several months, then you actually put your foot out and start to see if there are some things you can connect together. And that has been really like for us, it was amazing because all that time, like you said, the first few months, you have the time to break down your prejudice, break the prejudice you didn't even know you had, break down your comfort zone, break down all of that so that when you finally have friends and community and a little bit of connection, and you've also been able to discern the people who are just sharks who just want to get something from you, you start to kind of find your way to see pearls and people of value and people who are sincere. And then like the project we built in Congo, until Covid, I don't know if it's still going to continue, but until Covid, it was still going. And this was like. And this is 15 years after we're gone. And it was just run by local people doing their own thing. It's just because we had just. And it's not a tribute to us. It was a tribute to the time that we spent to just figure out like, hey, this is a really good person. And like, I'm going to invest in this person. And then, like you said, you put the seed in the right earth, and then it just grows on its own, you know?"}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":1985.91,"end":1995.1,"speaker":"John Heers","text":"So you saw that. That's fantastic. I didn't even know we were doing the Mennonite thing. We were talking about Cyril and Methodius when we got very first started with this. That's fascinating. I didn't even Know."}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":1995.1,"end":2028.98,"speaker":"Jonathan Pageau","text":"Well, Cyril Limitodius are a great example of exactly that, because they basically listened and paid attention and then offered to offer to the Slavs something which was both theirs, like both the Slav, but also added value to what the Slavs already had. It's like, we're going to give you a written language in your own language. And it's like you can now use this, not just for liturgy, this has a whole lot of other applications, like this very powerful thing that they offered. And so I think that that's. I think that's a great example. Yeah. Using serial."}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":2030.42,"end":2079.47,"speaker":"John Heers","text":"We thought about that and, you know, we also thought about. And I'm sure I've heard you talk about this on your show, actually, you know, one reason America is great, or has been, whatever that is, is that there's all this new blood, right. There's all these immigrants that come in. They come from the outside inside. And I always think how it'd be very odd for the immigrants who've just landed to start to tell people how to do stuff. Isn't that odd? Can you imagine, you know, the Latin American immigrant just coming in and started pointing to everybody how to do. It's. It's insanity. But I do think it's part of why we're. We were healthy, at least economically, as we allowed the outside in, and. But we don't do it so well going the other way. In United States history. We tend to not settle, but tell. We tend to not listen, but speak."}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":2079.87,"end":2183.71,"speaker":"Jonathan Pageau","text":"Yeah. And in a way, communion is probably a better way to understand it in the sense that when you. Like, if I go to Africa, it's like, if I go to Congo, for example, that's where we went most of the time. We were in Kenya as well. But, like, especially in Congo, it's obvious that there's a massive difference. And there's definitely something that I have that can be added value to the people who are there. And there's something that they have that is definitely going to be an added value to me. And so in that relationship, there's like this mutual learning and this mutual exchange, which I think. And it's also because the reality is that I'm coming from a place where that has more resources in terms of money, like just in terms of the rich being a rich and giving to the poor. And so that's a reality which we don't want to. We can't ignore. And so coming in as a rich person and then being in communion with people who have more poverty and trying to find Ways to be able to plant seeds so that they grow. Not just dropping money on people or also thinking that the fact that I have money means that I can tell everybody what to do, but rather trying to find points of communion where my resources and your potential are going to create something awesome. Right? If you only. It's like you meet someone and you know, you meet someone and you're like, if this guy or this woman had resources, they would knock it out of the park. And you just see it and you see the other person who's like, oh, this guy just wants. He just thinks that he just wants money or just wants. He thinks that that's all that counts. But you see someone who's already doing something who's like, you know, hustling and really trying to make things work. It's like a pillar in their community. And you think, wow, that person had resources. They would just."}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":2184.03,"end":2190.71,"speaker":"John Heers","text":"We have a name for those cats. We call them impresarios. And really what our job is to hunt them and find them."}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":2190.71,"end":2197.55,"speaker":"Jonathan Pageau","text":"Yeah, that's, that's awesome. That's exactly. I totally agree with that. Like, all you do is try to find good people and then the rest is gonna, is gonna happen."}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":2198.19,"end":2251.42,"speaker":"John Heers","text":"So we just started doing this in Appalachia. I don't wanna talk about it. I wanna ask you one more question, but I gotta tell you, in Appalachia, you know, in America, Appalachia has tended to be one of the poverty zones throughout history. So we started to do this in the States in the last year. And the angles, exactly, you can't really say this in Appalachian. Hey, this is just like Africa. Nobody really wants to hear that because of all the other historical undertones involved racism and other things. But my point is not really to say that they're the similar cultures, obviously, but the angles, they're all the same angles. They're out in angles like you talk about. There's inside community, outside community. There's distrust and trust issue. Fascinating. It's the same. A little bit harder because you're so clearly an outsider in Africa, you know, but same angles, same angles."}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":2251.42,"end":2288.11,"speaker":"Jonathan Pageau","text":"So interesting. I think it's awesome you're doing it in the US too, I think, because there is, there's a weird perception sometimes. It's like, I'm going to go help those people in foreign countries that need help. But it's like there are people in the U.S. like you said, that have some of the, some of the same difficulties that you can find, you know, in war torn countries or, you know, paralyzed by years of dictatorship or whatever it is. Even though that's not the case in the US There are certain dysfunctions in certain communities that are. That have been kind of generational. And so that. That can be. That you can help find the right. Like you said, the sparks that are there and just kind of feed. Feed those sparks."}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":2288.59,"end":2372.07,"speaker":"John Heers","text":"Yeah, yeah. That's where we are. We're trying, you know, we're trying to grow. But above all, all of these experiences have led me. And, you know, I was basically converted to Christian Orthodoxy by Muslims. It's a long story, but it's patterns again. Their pattern of life matched their words. Now, don't get me wrong, this doesn't mean they're all pious and, you know, close to Allah, but they did what they said they would do on Friday, and then they lived like that on Saturday. And then Sunday they did their five prayers. There was this. I was just a young guy guy, and I was like, what is this? And what I realized is my Christianity on any given week was really strong. On Sunday at the, you know, listening to the lecture, to the homily, and then I kind of forgot about it and made sure I would, you know, had a good full bank account and was going to college, and then I would go church again. There was no connection. It wasn't an integrated pattern. And when I came back from. From Africa, I said, do Christians integrate? Where are those Christians? I went to a Franciscan monastery and I spent a week. And it's like, okay, this is cool. And then a. Let's put it this way, I met a woman, an Ethiopian woman, who said, meet me at church. It happened to be a Russian church. I walked in, got yelled at by a Yaya and loved it because she was like, stand up. I didn't know Jonathan. I was sitting down as the Eucharist came out."}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":2372.15,"end":2372.95,"speaker":"Jonathan Pageau","text":"Oh, yeah."}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":2373.11,"end":2423.28,"speaker":"John Heers","text":"She was like, what are you doing in Russian yelling at me? And I was like, this lady yelled at me. I talked to the priest. The priest said, yeah, we stand up before God. I was like, yeah, we should do this for me in two seconds. When you're pressed to try to give answers to folks outside of the Orthodox community and you're pressed to try to understand who am I to them. How do you prepare the conversation in a way that maybe it invites people in to the symbolism? Do you consciously think about this, or is it, in the end, something that really. It's coming out of you now through your reading. And here's one more. And who do you love to read? And who brought you into this type of thinking in terms of books or teachers or."}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":2423.84,"end":2526.37,"speaker":"Jonathan Pageau","text":"Yeah, well, I think that I definitely do think about it. Like, I definitely think about it because I'm constantly faced with this world. And I also went through the frustration in college of not knowing what to say. And so I remember I have a very distinct memory once where I had just finished college, and I was living with a friend in an apartment, and he had a friend who was like, this postmodern activist. Really, really just like a cliche of this type of person. It's really kind of angry. But she was a great person. I really liked talking to her. And she, of all people, came to me one day and she said, I'm teaching this class, and there's this young guy who grew up Catholic who now is discovering science, and he wants to completely reject everything he was taught. And he's saying how stupid Jesus and Mary is, and all this is all stupid. And he said, it's science, it's science, it's science. And she asked me, she said, what should I tell this guy? What should I answer? She knew I was a Christian. And I had no answer. I had no answer for her. And I just looked at her blankly, and I think I pointed her to some creationist thing or whatever. And this was like, when I was 19 or something. And that memory. And I remember that feeling of being there, and her, like, sincerely saying, I don't want this person. You know, even despite her own desire to kind of this kind of activist desire, she could see that this person, she didn't want him to throw everything away. She's like, he needs a way to reconcile himself with what he grew up with. And she was. She was there sincerely asking me this, and all I could say was, I don't know."}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":2526.37,"end":2526.81,"speaker":"John Heers","text":"I don't know."}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":2526.81,"end":2584.37,"speaker":"Jonathan Pageau","text":"And so it's like, since that's one of those moments where after that, I was like, that can never happen again. Can never happen again. But it was really like. What got me to thinking this way was actually partly the postmodern theorists. I was reading Roland Barthes, who's kind of like a late Marxist thinker. He wrote a book called Mythologies, where he talks about patterns in social behavior and how social manifestations use mythological patterns. But he was doing it to criticize it from, like, a Marxist perspective. But I was reading, and I was like, wow, this is awesome. These patterns that he's describing are really wonderful. And I saw the same with Jacques Derrida. Like, Jacques Derrida was using kind of pattern thinking. And so it was Weird. It kind of broke my materialism. And then I went more towards more traditional authors. Like, I read a traditionalist. His name is Rene Guinot. People might know about him."}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":2584.37,"end":2585.13,"speaker":"John Heers","text":"I know him, sure."}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":2585.13,"end":2621.85,"speaker":"Jonathan Pageau","text":"Yeah. In the twenties. In my twenties. And that was really helpful for me to break my modern. The hold of the modern world. Like, it just. It shattered it. And there was no turning back after reading the Crisis of the Modern World. And then I started to look more towards the church Fathers and St. Gregory of Nyssa, St. Ephrem the Syrian Saint Aximos the Confessor. Those are my key theologians for symbolic thinking. When you read the hymns of paradise or you read St. Ephrem's hymns in general, you find analogical and typological discussion there. Like thinking that is so powerful, you."}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":2621.85,"end":2624.53,"speaker":"John Heers","text":"Know, and applicable today."}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":2624.61,"end":2626.01,"speaker":"Jonathan Pageau","text":"If you tease it."}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":2626.01,"end":2626.29,"speaker":"John Heers","text":"Right?"}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":2626.37,"end":2657.72,"speaker":"Jonathan Pageau","text":"Yeah, you need to tease it out. And I've noticed that too, that sometimes I talk about St. Ephrem or St. Gregory and the people tell me, I read the book, but I can't, like, I can't get what you're saying out of it. And so I realized there is some work to do. And so. So I have put out a few lectures where I try to say, okay, here's the hymns of paradise. And I'm going to try to help you understand what this means for today and what it means for the questions that are being asked. Did you have. So those are the thinkers. My brother, by the way, that's really important. I need to mention a lot of this was done in collaboration with my brother."}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":2657.72,"end":2658.56,"speaker":"John Heers","text":"Oh, yeah, he's something."}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":2658.64,"end":2671.19,"speaker":"Jonathan Pageau","text":"Didn't become orthodox, but who is symbolic thinker. Just an amazing symbolic thinker. And he wrote a book recently on symbolism that is just. That's hard to beat in terms of kind of symbolic."}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":2672.07,"end":2679.35,"speaker":"John Heers","text":"That book inspired one of our guys who was working in the field, Daniel Paternos, to write an article for you guys."}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":2680.07,"end":2681.51,"speaker":"Jonathan Pageau","text":"He's a great, wonderful article."}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":2681.75,"end":2686.87,"speaker":"John Heers","text":"And your brother did that, though. It lit him on fire, man. He has not stopped talking about your brother's book."}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":2688.23,"end":2691.67,"speaker":"Jonathan Pageau","text":"Oh, the Language of Creation. For people who are watching, it's definitely worth a read."}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":2691.75,"end":2738.06,"speaker":"John Heers","text":"Yeah, thank you for that. So I real quick. And then I'm going to finish up, but Philip Sherrard did much of that bridge work for me. Rape of man in Nature or the Eclipse of Man in Nature. They changed it in some of the editions. Sarah from Rose. But Philip Sherrard actually inspired not only the first thing stuff, but even this podcast, because that book, what he does, what he explains in terms of History. And really the. This was it for me. And you just described is how theology is real. Yeah, it's real. Like it actually matters what's being said. And he shows how it's united in history in terms of manifest like physical form and that. Whoa, that flipped me."}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":2738.46,"end":2738.94,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":2739.42,"end":2739.98,"speaker":"John Heers","text":"But the thing."}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":2740.54,"end":2788.68,"speaker":"Jonathan Pageau","text":"We're in a great moment right now. It's actually a really exciting moment because a lot of people are perceiving that. And a lot of the questions that are being asked in the different fields, even the scientific field, the philosophical field, are all related to the problem of how intelligence, or how they use the word consciousness, whatever, how consciousness is, how consciousness participates in the way reality lays itself out. And it's like they've hit a wall with scientism and now they realize that intelligence is actually part of how reality exists, but they don't know how to place it yet. They have all these different theories, they have different theories of emergence. They have different theories. Like there's a mathematician named Don Hoffman who's trying to reformulate reality through mathematical formula based on levels of consciousness, let's say."}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":2788.84,"end":2789.48,"speaker":"John Heers","text":"Oh really?"}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":2789.72,"end":2854.58,"speaker":"Jonathan Pageau","text":"And so there's a lot of. And this. He's getting massive funding from like scientific institutes. This isn't like a woo woo new age thing. These are real university types that are talking about this and asking, asking all these questions. And so if it's a great moment because you realize. No, that's what the fathers. That's what St. Maximus is talking about. Yeah, these are the things that. That's what logos is referring to. It's like referring to the manner in which intelligence participates in the way the world lays itself out and how the human person as the, the being with logos is a laboratory for things to join within him, you know, and so it's like we. And so there is no world without man, or at least it's it. You can't conceive of it. It's just potentiality or it's just like a quantum field or whatever you want to call it. And so all of this is like it's happening now. All these people are asking these types of questions and I'm seeing papers come out recently, more and more of even people talking about St. Maximus or St. Dionysus, the areopagite, and saying this is actually very relevant right now because of the questions asked in science."}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":2854.66,"end":2874.31,"speaker":"John Heers","text":"Weirdly scientific, right? Yeah, yeah. It's intertwined with the rational theories. The theorists are finding that it's already been said. Exactly. And that's super interesting. Hey, end the show. With me. But I gotta ask you to take our light O meter test on the way out. Will you do this with me?"}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":2874.31,"end":2875.03,"speaker":"Jonathan Pageau","text":"Sure, sure."}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":2875.67,"end":2911.6,"speaker":"John Heers","text":"So this happened. This is the fifth episode. If you guys want to go back and check it out, you'll know what we're doing. But I got a lot of feedback early on, like, I don't know what you're talking about when you say new world, because people are in it. It's very hard to define what it is when you're in it. And I said, well, it's sort of a type of being and thinking, yada, yada, yada. And I said, okay, I'm going to create a test, an exam that gives you a score that tells you where you are on the new world, Old world. And I, you know, I got it from mit. We collaborated. That's not true. This is a series of dumb questions that is supposed to be fun. Let me ask you, is that cool?"}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":2911.92,"end":2912.8,"speaker":"Jonathan Pageau","text":"All right, go for it."}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":2912.8,"end":2925.92,"speaker":"John Heers","text":"So you're going to answer three, two, one. Three, three is yes, fully 100%, you know, gut feeling. Yes, I agree. Two is something like maybe sounds good, but. And one is."}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":2926.46,"end":2926.78,"speaker":"Jonathan Pageau","text":"That's."}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":2926.78,"end":2943.66,"speaker":"John Heers","text":"I'm pretty much sure that's not true. Zero is a total rejection. Three. Top end. Zero, total rejection. Two, probably true. One, not probably true. We cool? All right. Two, one, zero. Then we're going to add it up and then it's going to be science, Jonathan."}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":2943.66,"end":2944.22,"speaker":"Jonathan Pageau","text":"That's right."}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":2944.22,"end":2962.16,"speaker":"John Heers","text":"Let's see. It's going to happen. So here we go. When you die, question one. When you die, you really probably won't die all the way. You'll be something like asleep. Three. Oh, yeah. Two, probably One, probably not say."}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":2962.24,"end":2963.44,"speaker":"Jonathan Pageau","text":"I would say one."}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":2964.56,"end":2981.44,"speaker":"John Heers","text":"One. Okay. One. I'm gonna record your scores because otherwise we'll forget. Okay, so 1. Jonathan Pageau is answering a 1. The best way to get to know me. Question 2 is to ask someone else about me."}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":2983.53,"end":2984.81,"speaker":"Jonathan Pageau","text":"I would say one again."}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":2985.85,"end":3010.85,"speaker":"John Heers","text":"1. Best way to know Jonathan is to ask someone. 1. When I carry a picture of my friend or my parent or some image of a person close to me and maybe in my wallet or I put it on my wall, the person is actually closer to me. They're close to me in a way that they're not when there's not a picture of them in the room. Three."}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":3011.57,"end":3012.53,"speaker":"Jonathan Pageau","text":"I would say two."}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":3013.17,"end":3028.45,"speaker":"John Heers","text":"Two. Okay. Excellent respect, Jonathan. It's very scientific. Don't forget this. Respect isn't earned. It's owed to you by others. Sorry. It's owed to you."}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":3028.85,"end":3029.21,"speaker":"Jonathan Pageau","text":"Sorry."}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":3029.21,"end":3034.93,"speaker":"John Heers","text":"It's owed by you to others. Respect isn't earned. It's owed by you to others."}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":3035.64,"end":3037.36,"speaker":"Jonathan Pageau","text":"Great. It's owed by me to others."}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":3037.36,"end":3041.64,"speaker":"John Heers","text":"To others. You don't earn. Someone doesn't walk in and earn it. You owe it to others."}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":3041.88,"end":3048.3,"speaker":"Jonathan Pageau","text":"To others, respect. I would say 2."}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":3048.48,"end":3067.31,"speaker":"John Heers","text":"2, 2. So just real quick, we're 1 1, 2, 2. Here's your last question. So what's your number right now? 112246. Here's your last question. You have kids and are your parents still with us?"}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":3068.59,"end":3069.07,"speaker":"Jonathan Pageau","text":"Yes."}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":3069.15,"end":3088.35,"speaker":"John Heers","text":"Okay. So I hope you, Jonathan, hope to and expect to take care of your parents and have them live on the premises with you as they get deeply into old age. You are hoping and this is a good thing to have them in your house say as they get older. 3, 2, 1, 0."}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":3088.35,"end":3089.44,"speaker":"Jonathan Pageau","text":"Yeah, I would say 3."}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":3089.56,"end":3098.89,"speaker":"John Heers","text":"3. Okay, 3. So that goes 1, 2, 3, 4, 5, 6, 9. Would you like to know what you are on our."}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":3099.93,"end":3100.33,"speaker":"Jonathan Pageau","text":"Sure."}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":3100.97,"end":3124.85,"speaker":"John Heers","text":"Okay. You are not the Charlemagne. That means you're full retro. You think old world style, big time. You drink from a goblet. There's a chance you own pre Columbian handmade weapons of some sort. You are not the Charlemagne. That would be 15. You're not the villager. That's a really good chance. You hate malls. You are welcome to places like Algeria. You're not a villager."}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":3125.01,"end":3125.61,"speaker":"Jonathan Pageau","text":"Okay."}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":3125.61,"end":3127.09,"speaker":"John Heers","text":"But you are a suburban."}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":3127.49,"end":3128.01,"speaker":"Jonathan Pageau","text":"Suburban."}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":3128.01,"end":3131.01,"speaker":"John Heers","text":"Very scientific. Yes. What was your number again? Nine."}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":3131.49,"end":3133.37,"speaker":"Jonathan Pageau","text":"I guess that's what it was. I wasn't counting."}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":3133.37,"end":3139.73,"speaker":"John Heers","text":"Yeah, eight to 11. You feel romantic about the old world, Jonathan, but hierarchy is a word that you'd rather read about in a book."}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":3141.5,"end":3142.3,"speaker":"Jonathan Pageau","text":"That's hilarious."}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":3142.54,"end":3146.38,"speaker":"John Heers","text":"It feels like you should want to obey your elders a lot more than you actually do."}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":3146.54,"end":3148.22,"speaker":"Jonathan Pageau","text":"That's probably true, actually."}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":3149.18,"end":3155.74,"speaker":"John Heers","text":"And the individual is not more important than the group. Except, well, sometimes you feel more important than lots of dumb groups."}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":3156.06,"end":3192.52,"speaker":"Jonathan Pageau","text":"That's right. Oh man, that's pretty head on. It's actually pretty good because it's good because I know, it's like I know one of the reasons why I talk about some of this stuff is also because I'm trying to convince myself because I'm a very modern person and I have all the bad habits of a modern person. And it's like I struggle to be in communities, but I know that it's like the times that I've successfully been in communities have been very vivifying to me. But I do tend to. I do have that individualist pull. So that's actually probably pretty good. It's kind of damning, but it's pretty good."}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":3192.84,"end":3194.84,"speaker":"John Heers","text":"I scored a nine just like you."}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":3194.84,"end":3195.96,"speaker":"Jonathan Pageau","text":"Oh, wow, that's awesome."}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":3196.12,"end":3229.12,"speaker":"John Heers","text":"I thought I was gonna be. My sister came in at like 15. She's the highest scoring of all times. And my brother was on this show and did it too. And he was. He was the villager. He was pretty old school, but that was cool you took that with us. So now we have Jonathan Peugeot. Score. So, brother, follow us, would you, and share this with your. Your peeps and we'll do the same on this end and keep going, man. I do think you'd. I find you to be doing. Like I said, you're teaching us and you're a type of missionary, so."}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":3230.07,"end":3249.99,"speaker":"Jonathan Pageau","text":"Thanks. And I've heard, like, I have so many people that have been just saying wonderful things about the podcast and, you know, and the foundation. I think the type of work you're doing is the best kind of work in terms of international aid and helping others. Just, it's the best way to do it. So I really appreciate to find orthodox people working that way."}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":3250.47,"end":3269.15,"speaker":"John Heers","text":"Yeah, man. Just people listening. I did not know, Jonathan, that you live that way, and I knew you went to Africa and that was going to be one of our subjects. But I don't know if you go read our website if you get a chance. You literally were speaking the missions name. It was kind of weird, actually. I don't think you were reading it, but."}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":3269.23,"end":3270.75,"speaker":"Jonathan Pageau","text":"No, I don't think I read it."}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":3271.07,"end":3273.15,"speaker":"John Heers","text":"Yeah, it was beautiful, man."}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":3273.47,"end":3274.11,"speaker":"Jonathan Pageau","text":"That's great."}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":3274.75,"end":3278.35,"speaker":"John Heers","text":"Maybe that's where we're coming. We were having this connection."}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":3278.67,"end":3279.39,"speaker":"Jonathan Pageau","text":"This connection."}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":3279.55,"end":3290.21,"speaker":"John Heers","text":"Yeah. All right, brother. So thank you. We'll talk to you again soon. And have a really good day, man, and a good week. Welcome back into your house."}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":3290.61,"end":3293.17,"speaker":"Jonathan Pageau","text":"Yeah, thanks. I appreciate it. All right. All the best."}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":3293.33,"end":3294.85,"speaker":"John Heers","text":"Okay, peace out. Bye."}
{"episode_id":"SW - #149 - 2021-03-22 - John Heers - Old World vs New World","start":3295.81,"end":3360.79,"speaker":"Jonathan Pageau","text":"I hope you enjoyed this episode of the Symbolic World. The Symbolic World is edited by Justin Ward and it is based on a series of videos that you can find on my YouTube channel, Jonathan Pageau's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by, of course, leaving a review on itunes. Everybody knows that's the best way to get the podcast out there, to get it heard and if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon Pageau videos as well and on SubscribeStar, all those links you can find on my website or in the show description. So thank you and I will see you soon."}
