{"episode_id":"SW - #023 - 2018-11-26 - The Symbolism of the Tree","start":0.48,"end":31.37,"speaker":"Jonathan Pageau","text":"I would like to welcome you to episode 23 of the Symbolic World podcast. On this episode, I will be playing for you a discussion I proposed last year on the symbolism of the tree. I follow that symbolism from the beginning of Genesis all the way to the end of Revelations and looking at also at different popular traditions which came about on this particular structure. Hopefully, through this discussion, people can see how coherent a lot of these stories are and how they fit together like a giant puzzle. And so enjoy."}
{"episode_id":"SW - #023 - 2018-11-26 - The Symbolism of the Tree","start":45.05,"end":46.65,"speaker":"Jonathan Pageau","text":"This is Jonathan Pageau."}
{"episode_id":"SW - #023 - 2018-11-26 - The Symbolism of the Tree","start":46.97,"end":48.41,"speaker":"Jonathan Pageau","text":"Welcome to the Symbolic."}
{"episode_id":"SW - #023 - 2018-11-26 - The Symbolism of the Tree","start":59.06,"end":1398.19,"speaker":"Jonathan Pageau","text":"Now, to understand the symbolism of the tree, you really need to understand more encompassing symbolism. And so, as I discuss the tree, I'm going to join other symbols together so that you can really get a sense of a cosmic vision, of how the tree fits into a cosmic image. Okay? Now, as usual, if you really want to understand biblical symbolism, you have to start in Genesis. And ideally, you have to start in the creation story. Now, a tree is an image of order. It's an image of hierarchy, okay? It's an image of how things come together towards one. So you can imagine the trunk of a tree as a kind of axis. And then you can imagine the branches of the tree as the repeating pattern of the tree. So a tree is the branch of a tree has the same structure of a tree. And as the branch separates into smaller. Into smaller branches, the same structure appears on the tree as the basic tree in itself, okay? And so it is an image of this cosmic connection of everything together, okay? So it is an image of order. Now, the idea of the tree can be order as it comes towards one, but it can also be order as it separates into the many. Okay? Now, to understand the basic idea of the tree, we look at the story in Genesis. Now, we're used to thinking that in the Garden of Eden there was a tree, but in fact, there were two trees in the Garden of Eden, okay? There was the Tree of Life and the Tree of the Knowledge of Good and Evil, but that's actually wrong. In the Creation, in the story of Adam, in the Garden of Eden, there isn't two trees. There are three trees, okay? And the third tree is the fig tree, okay? Because when Adam and Eve fall, they make clothing out of the fig leaves, okay? So now what you have to imagine if you want to understand it, this is presented in this book. I told you about this book. So people have been asking for reading list on symbolism. This definitely everybody needs to read, okay? This is the Hymns of Paradise by Saint Ephrem the Syrian. And you have to read the introduction by Sebastian Braque, which is very excellent because he crosses through the hymns and discusses other texts by St. Ephrem and the interpretation of the Bible of the Syrian Fathers. So the way it's presented is that you have imagine paradise as a mountain, okay? And so some people aren't used to imagining paradise as a mountain, but it makes absolute sense. Even in the Bible, it is suggested that. That paradise is a mountain, though it's not said explicitly in tradition, it is said explicitly that paradise is a mountain. And the way it's suggested in the Bible is that it says that four rivers flow out of the garden and go out into different directions. And so just naturally, in terms of phenomenology, you have to imagine the four rivers being from starting at a higher point and then moving out towards the world. So a way to imagine it is that the Garden of Eden is actually the highest place in the world. It is the highest mountain. And from the top of the highest mountain comes these four streams that then come down and water the entire world. So you have to imagine at the middle of. At the top of the mountain, there is a tree, and it's the Tree of Life. It's the axis of the world. It's the place where all life comes together. And, and this notion that if you eat the Tree of Life, then you have eternal life. Now imagine that. Now the garden in St. Ephraim's vision is separated in two sections. So you have the tree at the summit, and then at a lower level on the mountain, there's another tree, which is the Tree of the Knowledge of Good and Evil, okay? And so the Tree of the Knowledge of Good and Evil, you could see it as the place. Place where order begins to separate into opposites, right? So a way to imagine it would be that you have the. The Tree of Life up there and then the Tree of. Of. Of Knowledge of Good and Evil. And according to St. Ephraim, the way it works is that Adam and Eve were placed in the garden. They were told not to eat of the fruit of the Tree of Knowledge and Good and Evil. But the Tree of the Knowledge of Good and Evil actually acted as a kind of barrier, like in the temple, a barrier towards the most holy place, the highest place, the place where everything totally comes together, which is the Tree of Life. And so what St. Ephrem says, and this is not just in St. Ephrem, but it's actually repeated in St. Irenaeus, for example, and in some of the Cappadocian fathers and in Jewish tradition, that in fact If Adam and Eve had obeyed the commandment of God to not eat the tree, God would have eventually given them the fruit so that they could then ascend towards the Tree of Life. And so you can imagine this tree of Good and Evil as a test for whether or not Adam and Eve will do it by disobeying out of their own volition, or. Or by submitting to the higher authority, by submitting to the transcendent rule, would then have access to the higher mystery. Okay, so imagine now the Tree of Life in the center as this one axis. Then the Tree of Good and Evil as the place where things start to separate. And I imagine the mountain is getting wider. And. And then at the bottom of the mountain, you have the wall of the garden, which acts as the limit of the garden. And there you have the fig tree. And so there the Adam and Eve take the leaves of the fig tree and cover themselves with them. So you can see how as they move down the mountain from the Tree of Knowledge of Good and Evil, they also coming near the wall which covers the garden, then they have to cover themselves to hide their, let's say, their nakedness, hide the higher part, the hide their mystery, let's say, okay, and be covered in mystery. Just as they move away from the higher tree, they can see less and less the higher tree, just as you can imagine, for example, in the temple, you have these series of veils. And as you move out from the Holy of Holies, each veil becomes more and more opaque as you move towards the covering that is outside the veil, okay, Outside the temple. So these three trees now, so you can imagine them almost like one tree as the entrance, a second tree as the second, let's say, place where everything is. Is divided. And then the top tree, which is the place where everything comes together. But then there actually isn't three trees in the story of Adam and Eve in the garden. There are actually four trees in the story of Adam and Eve. And the fourth tree is a thorn tree or a thorn bush. It's the idea that trees will produce thorns, okay? And so you can imagine now on the outside of the wall of the garden, outside of the inner holy place, you have these thorns which are to protect the tree from attack. So you have a world of hostility which is outside the garden. And so the thorns need to be protected. Okay? So that's, let's say, the way that it's presented in Saint Ephrem the Syrian. And so once you see how that structure comes together, you can remember some parts in the Bible which are surprising to some. Like, for example, when Christ in the New Testament, at some point he curses a fig tree and you think, why is Christ cursing a fig tree? Well, St. Ephrem connects Christ's cursing of the fig tree to, say, taking away the power of the covering, taking away the power of this covering by which we are removed from the more holy places. Just like the death of Christ split the veil in the temple, so too when Christ curses the fig tree, he removes the coverings as he brings men closer and closer to, to the mysterious unity which is at the summit of the mountain. Okay, so you can see it as these four trees, but you could also see it as one tree. You could see this notion that there is one tree. The axis of the tree is the tree of life. You could see the branches of the tree as the. The tree of the knowledge of good and evil, the leaves of the tree as the fig tree, and then the thorns on the tree, the last protection of the tree, as being the thorn bush. And you could also see the tree as the mountain itself, as paradise itself. As you move from the oneness of the summit on the mountain and you come down to find multiplicity. And as you come down towards the wilderness that is down at the bottom, and you, you come finally to the. The world of hostility, of war, of conflict. And then even further than that, you would have the flood, you would have the waters, the ocean which surround the mountain of paradise, surround the mountain of the world. That is the, the image of the cosmos, really. And so you'll see if you read St. Ephrem, you'll also find that this mountain as it's described by Saint Ephrem, he seems to on purpose gives descriptions of it which place it outside of normal time and space. And so he'll say things like, the base of the mountain of paradise goes beyond the physical ocean, beyond Oceanus, which, which surrounds the known world. And so you have this idea that actually the entire world as we know it is contained within this hierarchical structure of the Garden of Eden, you know, from the Gate to the Tree of Knowledge to the Tree of Life. Okay, now this notion of this hierarchy, the tree as this hierarchy as bringing order to the potentiality which is further down, let's say, the waters of the, of the, of the ocean. And now imagine at the top of the tree, you have, you can, you can kind of see it, let's say, this source which is coming from under the tree. If you imagine the tree really at the top of the mountain, and these four sources, like the four directions which move out from the central tree and then go out into the world and. And then go all the way into meeting with the ocean. And so, just in terms of understanding normal cosmology, you can understand that fresh water comes from above. Fresh water always moves down, okay? And so even if there's a source in the ground, you know that that source is higher than the ocean, okay? And so the fresh water, just like rain, falls on the mountain, fresh water moves away from this hierarchical mountain, then moves out towards the. Towards the outer waters, the waters of chaos, the salt waters. Now. And so in that way, there's a relationship between the tree, the hierarchy, and this bringing of fresh water towards, or this transforming of, let's say, salt water into fresh water. And so I'm saying this because in the Bible, you'll see several places where this relationship takes form. So, for example, Moses will hit a stone, hit this. You can imagine the stone as a miniature version of the mountain. And then out of the stone comes water which. Which comes down, and the Israelites can drink it. So you can imagine with the tree, the tree hitting the mountain, this hierarchy making water come down and flowing down the rock to give water to the Israelites. Imagine another story. They find a puddle of bitter water. So now when you read bitter waters, you can imagine it as salt waters, for example. So the Israelites, they find this bitter water. They can't drink that. They're in the middle of the desert. And so Moses takes a tree, takes a rod, a wooden rod, and puts it down into the water and transforms the salt water into the bitter waters, into sweet waters, into fresh waters, okay? So the same symbolism repeating itself again. And so you can see it in other ways. For example, the same image, a little different, but it's the same idea. You can imagine the tree as separating the waters, too. You know, separating the waters. Just like in the beginning, you can imagine God separating the water. So you have to always think in terms of phenomenology. You have the clouds up above, you have the water down below. And the things that go up into the. Into the heavens, which connects heaven and Earth are trees, okay? In the natural world and mountains. And so you can imagine Moses hitting the waters of the Red Sea and separating the waters, like God separated the waters at the beginning. But also this idea of the tree is acting as a measurement of order between the two extremes of chaos, okay? Now, so there are many, many other examples. For example, you can see the same thing when they create. When they create the bronze serpent, this pole acting like this tree, those snakes at the bottom are like the chaotic waters. And then you separate the waters. You take one snake that's made. He makes a snake out of bronze and puts it at the top of the pillar, the top of the tree, the top of the. Of the stick, so that now the waters are separated. And in between, there's a place for order. And you're not just completely submerged in chaos. Okay, there are. Okay, so there are plenty, plenty examples. But what's interesting, I could just keep going on forever with this. But what's really important to see is when you have to come to Christ, you have to come to Christ. And so in the tradition, there are many hints that. Hints that help us to link this idea of the trees in the Garden of Eden with the cross of Christ. Now, it's already there in the story for those who can see it. But there are many little traditions that can help us to make sense of it and help us put the puzzle together. For example, there are traditions which say that the cross of. That the tree of life or the tree of good and evil, there are different traditions on that. The wood of that tree will have been taken to make the staff of Moses will have been taken to make the pillar for the bronze serpent. And then that piece of wood would continue down on the line to finally become the cross itself. And there are traditions which say that, for example, the axis of the cross was made out of the tree of Life, and the horizontal of the cross was made with the tree of the knowledge of Good and evil. And you can see in the story of the crucifixion, you have the three. Three crosses which emphasize this. This. This centrality and duality with the good thief on one side of Christ and the bad thief on the other side of Christ, representing this notion of good and evil as the two branches of. Of the cross, let's say, or three crosses. It doesn't really matter how you see it. It has this. The same idea of this central thing and then two things on the side. And also in the story of the crucifixion, Christ has the thorns. That thorn bush which was outside of the garden, that thorn bush is then put on Christ's head. When you start to think about the crucifixion, your mindset starts to play tricks on you because that story is very difficult to understand. It's very difficult to encompass all the mystery that is contained in the story of the crucifixion. But Christ takes the lowest thing, the lowest thing on. On the story of the mountain, these thorns that are outside to protect them. And he changes them into a crown. And so the lowest becomes the highest. And then he is nailed fixed onto this hierarchy, onto both the Tree of Life and the Tree of Good and Evil with the crown of thorns. And then as he is on the cross, the Roman soldier pierces his side, and out of his side comes blood, but also comes water. And this water comes down and the blood comes down. And so you have this crazy image which repeats actually this story from the beginning of the Bible, that Christ on the cross is. Is not just the Tree of life, not just the tree of good and evil, not just the thorn bush, not just the mountain. He's all those things all together at the same time. And he's also the water which flows down and reaches out into the world. And in early Christian images, they explicitly showed the cross with the four sources of paradise at the feet of the cross cross. And so that's enough said about that. But I just wanted to show you how that image of the tree in the Crucifixion takes up its highest form. And the Christ's relationship to that tree creates an image which is. It blows your mind. You can't really understand because he also dies on the tree. He also dies on the tree in the way that God told Adam that he would die if he eats of that fruit. So Christ eats the fruit of the knowledge of good and evil, and has access then to the Tree of Life. And you can see that that's the case they showed in the text, because when he dies, the veil of the temple, the veil, the holy of Holies, is ripped into two. And so it's this idea that Christ enters into the highest place. Place. It's the fruit of good and evil, like Schnephren says, as a way to enter into the Holy of Holies, which is the Tree of Life itself. And so, finally, just to bring everything together, you have to come toward to the end of the Bible where in the final revelation of the entire cosmos, you have a cube, a cube which is the final form, the static form of everything that can be revealed. And in the middle of this cube is the Tree of Life. And you can also imagine this Tree of Life and the rivers flowing out and filling up this new Jerusalem, which is perfect and made of perfect material. And so there's this notion of a final manifestation of everything from the beginning until the end, into one, you know, into one impossible, but, you know, eschatological manifestation. And so, yeah, I went a lot further with you guys than I ever have in this stuff, so I hope it wasn't too obscure. If it was, give me some comments, tell me what you think and I'll see if I can maybe try to answer some questions in the in the question section. So I hope you enjoyed it and I'll talk to you soon."}
{"episode_id":"SW - #023 - 2018-11-26 - The Symbolism of the Tree","start":1399.15,"end":1454.01,"speaker":"Jonathan Pageau","text":"Thank you for listening to the Symbolic World Podcast. As you know, this podcast is for now based mostly on my YouTube videos which I am transferring into audio format. Please go ahead and visit my YouTube channel. There are more videos there on different subjects that I'm not going to put into audio. And please share this to your friends. I know a lot of people know about the YouTube content, but not so many people know that this is also a podcast. So share it to your friends. Share it on social media. And if you can, feel free to support this financially as well by going to my Patreon page, which is Peugeot Videos. Strangely, you can go there and you can support it at any amount that you want. A month for all the patrons. I do a monthly Q and A live Q and A in which people can ask questions in the chat and I try to have a more personal connection with people. The YouTube comments have become difficult to follow and to answer."}
{"episode_id":"SW - #023 - 2018-11-26 - The Symbolism of the Tree","start":1454.17,"end":1455.05,"speaker":"Jonathan Pageau","text":"I'll see you soon."}
