{"episode_id":"SW - #328 - 2024-02-21 - Stephen Blackwood - The Book that the West Needs","start":0.56,"end":49.26,"speaker":"Stephen Blackwood","text":"It is one of the most copied works of literature for effectively a thousand years. So it's a book that essentially, let's put it this way, that anyone who could read for the better part of a thousand years in the west was reading Boethius. It's unbelievably influential and that with his other translations, make their way into the Middle Ages. And so the metaphor I like to use, it's like the flowers have died. We heard Hirsi Ali recently say the west is a cut flower. It's like the flowers have died. But these books are seeds. These books are seeds of the ideas. And it's as if he cast them forward into the future so that hundreds of years after his death, those seeds would grow again into, you might say, the beautiful garden of Western, you know, medieval culture."}
{"episode_id":"SW - #328 - 2024-02-21 - Stephen Blackwood - The Book that the West Needs","start":61.04,"end":133.71,"speaker":"Jonathan Pageau","text":"This is Jonathan Pedro. Welcome to the symbolic world. So, everyone, it is a pleasure to finally have Stephen Blackwood on my channel. As you know, Stephen is the president and founder of Ralston College. He was also one of my. He was my neighbor at the Exodus Seminar, you know, sitting next to me, bringing us back to this story, you know, expressing his wisdom with, with so much tact. You know, he's become a friend and someone that I respect very much. And so I'm happy to have him on. And we're going to talk about Boethius. We're going to enter into Boethius constellation of philosophy. Stephen wrote a wonderful book called the Constellation of Boethius as Poetic Liturgy. And I mean, I read this, I was amazed at some of the things he was bringing up. You know, I'm not someone who's that good at poetry, but that I could just see when I was reading his text that he was so close to the way I see the world and to the things that I care about. And so I'm excited for him to be able to expound that for us today. So, Stephen, thanks for coming on."}
{"episode_id":"SW - #328 - 2024-02-21 - Stephen Blackwood - The Book that the West Needs","start":134.19,"end":135.63,"speaker":"Stephen Blackwood","text":"Thanks for having me, Jonathan."}
{"episode_id":"SW - #328 - 2024-02-21 - Stephen Blackwood - The Book that the West Needs","start":135.71,"end":153.58,"speaker":"Jonathan Pageau","text":"Yeah. So tell me, start off, like, what it is that attracted you, first of all, to. To Boethius's text. Maybe how people, most people will know Boethius, but maybe, you know, give a brief introduction of, of who he is, what it is that was going on around him and why he wrote his consolation."}
{"episode_id":"SW - #328 - 2024-02-21 - Stephen Blackwood - The Book that the West Needs","start":154.86,"end":681.61,"speaker":"Stephen Blackwood","text":"Well, I think that, well, boys has been a big inspiration for me for, for. For many years. And, you know, just in a really quick sketch, the, you know, we're talking about the. He's born in the late 5th century A.D. so sort of right around the fall of Rome in 475 or or so. And, and he, he lives for about 50 years and he's born into a, to a wealthy, should I actually adopted into a wealthy sort of very patrician family. And he's, he gets the, the best education you can get probably in, in, in Athens or Alexandria. He learns Greek, does all of the studies, all of the forms of knowledge that were important, you know, music and mathematics, astronomy, you know, rhetoric, logic, all of those things, philosophy. And he rises to the very sort of, very highest heights of the Roman Empire. This is after the fall of Rome now, right? So rather than an emperor, there's a kind of foreign king, Theodoric. But it's, it's kind of as if you had, you know, at one of our modern states, everything was functioning except a foreign king had come in over the top. And so it's actually much more coherent than people might, might think. So he rises to the very, you know, the Senate is still there and so on. He becomes the master of offices, the megistro ficiorum. He becomes a consul. And he says the happiest day of his life is that is the day his two sons both become consuls. And the reason I share this is because he's at the very sort of tip top of education, of political influence, of wealth, of sophistication. He's a poet, he's a mathematician, he's an inventor. He's really just at the very top of his game. And what Obwthus sees is that Rome, which had for so long relied upon, you might say, Greek intellectual infrastructure. Uh, and this is, this is not a, a wild claim. I mean the, the, the, all of the Romans, the educated Romans were themselves speaking Greek for hundreds of years and being educated in Greece and actually forging their, their, their literature according to Greek models and their architecture and all of that, they under, they understood this themselves very, very self consciously. Um, but Greek is being lost. And, and, and so Boethius sets himself the task, all of these kind of seminal texts of Greek into Latin, Latinized, this, this superstructure of, of, of, of, of wisdom. And he, he translates works in mathematics and, and logic and, and, and music and so on. And these are effectively kind of Latinizationizations, you know, making available, you know, pretty much someone else's work into a form. It's a trans. I'm making available in a new form, but largely it's a translation. And then absolute disaster strikes. He is accused of treason and thrown in prison. And a year later he is, according to the contemporary accounts we have, he's halted a prison and brutally tortured and executed. And that's the end of Boethius. That's the end of this man who had hoped, let's say, to had the dream in some sense, I think you can say the dream of restoring the intellectual foundations of his, of his beloved sort of, you know, city and of all of Rome ends in the worst sort of, in a sense, death you can imagine. Except of course that's not the end of Boethius. While he is in prison he writes a book that is not contradictory with everything he's written but at the same time totally different. These texts on, you know, the translation of Nicomachus and so on, they're very dry. I mean, you know, you should read them if you're interested, but they're very hard to get through. They're very dry, they're very logic chopping, they're all about ratios in the music and so on. That was an important text for almost 2,000 years. And, but you know, they're, they're a slog, let's put it that way. And, and in prison, while he's in prison he writes one of the most astonishing works of literature that I think has ever, ever, ever been written. And, and, and this, it's like he puts, in a certain sense, he puts all of his fine tuned learning down and he goes right to the heart of the question. But of course he's not putting it down. He, he's putting it into a new form, these years of study. And in this, and in this book he, this is a work of consolation. This is a book in which, very raw, in which a woman who's a personification of philosophy comes to comfort a man, a prisoner, a man who's been bereft of, taken away everything that he had, his wealth, his family, his position, his reputation, everything. He's got nothing left. And there he is in his prison. So it's, you know, Boethius played by himself you might say in this, in this amazing literary drama. And, and this, this, this woman named philosophy comes to comfort him and to restore him to his inner self possession, to his, his, his, his knowledge and possession of himself. And that's the, you know, we may, you know, perhaps we'll have a talk a bit, a bit about the, the, the book. But, but, but in terms of the biography, what's amazing, you know, this book that is in a way so different from his other works, just the literary power, the, the gripping character of this, I, I, I say that this is, this is one of those books that you can give to someone who's in an enormously difficult situation, whether it's, you know, cancer or, or terminal disease or, or loss or, Or. Or. Or, you know, some kind of former pain or indecipherable, you know, thing in their lives. And it. And it speaks directly to that because that's where it starts. That's the. That's the problem this book is written about. And we don't. We actually don't know really how this book got out into circulation and somehow got out of the prison. There's. There's, so far as I know, there's little to no record of it for like, 200 years. And so imagine you'll hear this. This, you know, this long arc. It's so important to remember these things. You know, the long arc of. Of. Of time, of culture, of civilization, of the soul. Here. This man who I think had hoped in his own lifetime that these works that he was translating would help to restore Rome. He did not know Rome was really effectively over, you know, a few decades after his death. It's, you know, it's a kind of backwater. Goes from a million inhabitants or so at its. At its height to essentially, you know, 30,000. It's like a swampy backwater during the. The. The. The Carolingian into the Middle Ages. But what I want to leave this. This moment of his biography with is this book somehow gets out, and after a couple of hundred years, it. It really gets out, and it's the first. It's translated in English by King Alfred. We were talking about that earlier, and. But in Latin. It is. It is one of the most copied works of literature for effectively a thousand years. So it's a. It's a book that essentially, let's put it this way, that anyone who could read for the better part of a thousand years in the west was reading Boethius. It's unbelievably influential, and that with his other translations, make their way into the Middle Ages. And so the metaphor I like to use, it's like the flowers have died. We heard Hirsi Ali recently say the west is a cut flower. It's like the flowers have died. But these books are seeds. These books are seeds of the ideas. And it's as if he cast them forward into the future so that hundreds of years after his death, those seeds would grow again into, you might say, the beautiful garden of Western, you know, medieval culture. And so there's a sense in which Boethius, though, he. He thought, I think that. Well, he had no doubt hopes, as we all do, that his work would bear some fruit in his lifetime. You know, he had a terrible death, and yet in the long span of time, and perhaps you could say providence, that which he had given his life to bears enormous fruit hundreds of years after his death. And so I've often thought about this that, you know, from Boethius, we see it's not up to us what becomes of our work. It's only up to us to do. To undertake it as faithfully as we can. Yeah."}
{"episode_id":"SW - #328 - 2024-02-21 - Stephen Blackwood - The Book that the West Needs","start":682.25,"end":791.16,"speaker":"Jonathan Pageau","text":"And I think you're. Some of. Some of the ideas that you brought about are important to emphasize, which is that the. Boethius's work, you know, became a model for literature in the Middle Ages, became a model for poetry, became a model, you know, and did ultimately more to synthesize the ancient Greek thinking and carry it forward than, like you said, his other kind of copying of ancient texts. And so there's a strange innovation in the text itself, but it is also a kind of gathering together in crisis. So his personal crisis, his suffering and the, you know, the things that he had to go through become like a microcosm of what is happening to the west at that moment. And with all the barbarians coming in and, And. And this kind of moment of uncertainty and chaos. And in this. In that strained way, like you said, the book itself becomes a little arc that carries all this thinking in a very compressed form, with all its different meters and its different approach to poetry into the flowering of the. Of the high Middle Ages, you could say, and becomes a model for that. It's hard for people to think that, because so many people think that the Middle Ages are just a dark period. You know, they don't understand to what extent poetry and. And music and, you know, meter was important, especially in what we call the High Middle Ages in the west, into the weird. Weirdly, too, into the world that. Into the barbarian world that had taken over his Rome. Right. So the influence of his work will. Made itself. Will make itself known in France and England, in all of these barbarian lands that are now kind of reviving the Roman. The Roman world. So it really is an astounding story of how. Of what. Of what he was able to do in his suffering."}
{"episode_id":"SW - #328 - 2024-02-21 - Stephen Blackwood - The Book that the West Needs","start":792.12,"end":933.82,"speaker":"Stephen Blackwood","text":"Yeah, yeah. And it's a very important point you make about the way he's gathering up the wisdom of the past. And, you know, today we sort of, you know, have this idea that, you know, you should try and say something original and, And, And. And new. And, you know, for Boethius, you know, he was, I think, you know, he thought the highest thing that, you know, in a way the highest and best would be to. To. To. To share the greatest, you might say, the wisdom of the past in a way that could be heard and, and heard anew. And so he, he is writing as if you might say, it's. His work is synthesizing and bringing together without saying he's doing that. I'm not saying he thinks, oh, here I am. I've got all the answers right here. No, he's, he's, he's. But what he's actually doing is. Is take looking back to Plato and to Aristotle and to the Stoics and, And the Neoplatonists and all the poetic tradition to Homer and indeed, I would argue, to his experience of Christianity and bringing all of this up in a form that he thinks is fundamental so it can speak to his time. Interestingly, I mentioned Christianity. We know the Christian. He wrote texts on the Trinity and so on. There's no mention of Christianity or of Christ or anything like that. In the consolation, it's a really interesting kind of question or challenge or even history for many scholars. And I'll simply say that my sense of that is that what he's doing is sharing the wisdom as he understands it in a universal form. And we could talk about what the Logos is and what he might have understood about the relationship between the. Let's call it the pagan and Christian traditions or the old pagan philosophical tradition and the Christian religion is a very, very interesting question. But fundamentally, he's putting things in a language of universality. And that's one of the reasons, I think he's such an important voice today, because amidst our fragments are alienated, sort of dysfunctional disagreements, often, you know, very shallow. He's, he's. He. He offers, I think, a voice that goes right to the heart of very fundamental human questions."}
{"episode_id":"SW - #328 - 2024-02-21 - Stephen Blackwood - The Book that the West Needs","start":933.9,"end":1042.25,"speaker":"Jonathan Pageau","text":"Yeah. And I, I think the way that I also understand his work is something like the maintaining of a secular space in. Within Christianity that is, you know, and you can see it again, play in terms of microcosms, which is that he's expressing the. Of the pagan world, the Neoplatonic world, the. The Greek world into this burgeoning Christian world. He's expressing that as a possible, you know, image of what. Of what is good and what is. What is in the future. And then you could say that, not surprisingly, that his aesthetic or his vision gets taken up by the secular world in, in the. The burgeoning Christian reality, which is why the kings, you Know, supposedly Queen Elizabeth also like, loved her Boethius and King Alfred. And these secular figures would look to Boethius because they were playing in some ways a secular role within the Christian vision. They were, they were not directly related. You know, although they did go to church. They were Christians. They were somewhat of a remove for that, somewhat like a narthex of the church. And I think that that's one of the powerful things about Christianity that people forget in our kind of post puritan age, which is that is the way that Christianity laid itself out as being both, you know, having the highest mystery in these theological texts and these mystical hymns, but then also being able to entertain, you know, the works of soccer, the works of Aristotle, the works of Plato, the works of the Greeks and a vision of poetry, even preserving the dramatic text, preserving the, the, the works of literature that were produced in the, in the ancient world as a kind of, you could say, narthex to Christianity. A place where we can explore these ideas without explicitly saying always having a religious."}
{"episode_id":"SW - #328 - 2024-02-21 - Stephen Blackwood - The Book that the West Needs","start":1042.89,"end":1260.84,"speaker":"Stephen Blackwood","text":"Well, well. And there's just two quick points to add to that. And the first is that, you know, people today forget that the, the Greeks thought there were entirely rational, you know, might say philosophical arguments. You know, they talk about the highest good or God, or about the practices that enable you to approach or understand or come as close as you can to understanding those things. Those are, those are completely rational philosophically derived principles. So it's not as if, you know, you've got this, I don't know, some sort of cold philosophy on the one hand and then in the, the other hand with these kind of simply irrational or mystical practices. I mean, it's the most, for the Greeks, it's the most rational thing in the world. You might say to, to, to try to understand that which you do not understand, that which is beyond you, and to be adequate somehow to that understanding. We could talk about intellectual humility. We could talk about, you know, so this, this, what I'm suggesting is that is that in, in, in, in the consolation, for example, there comes a moment in the right, in the middle of the book, in the middle of the argument where philosophy system, you know, you know, the problem with, with our thinking, our kind of rational thinking is it divides things up and you know, it divides up that which is, which we most seek, which is one and whole and unified to the highest good. It divides it up in such a way that, that, that, that it can't, it can't satisfy precisely because it's dividing it up. And we could talk about, you know, the implication of that argument. But what, what she says is, is that so what do we need to do? Like what's the answer to that problem? That's a big problem and it's a problem we all face day by day, right? Which is that, you know, the way in which all of your efforts can somehow divide up or be inadequate to the, to the thing that you seek, which is kind of a unified self possession. And so, and she says well, what do you think we should do? And he says well, we should seek the Father of all things. And so what you really see in this fulcrum of the argument is that they're turning upward, you might say, to that which is the source of rational understanding, but in a unified form. And they're seeking, they're seeking that source for help to bridge that divide. And so all I wanted to say is that, you know, we talk about the, the, the, you know, the religious element here, but I, what I want to say is there is a, Phil, there's a, there's such a thing as a philosophical religion in which you are, you are, you are adopting habits and practices that you know are necessary. It doesn't take some add ons, a big leap or anything like that. It's, this is like, this is a fundamental, something you can do on a fundamentally rational basis. And the other point I would make just very quickly is that, is that it's not, it's also that the, the, the, the, the inheritance of these Christian, these, these, the Platonic and Aristotelian, you know, the Neoplatanous and so on. The Greek, the Greeks, broadly speaking. It's not just that they were kind of sort of useful in the background. They're absolutely vital to the whole history of, of Christian theology to understand itself. I mean, you know, the Bible is written in, you know, the New Testament is written in Greek, the creeds are written in Greek and there's a reason for that. And so you might say they're, they're, they're interpreting an. Understand. I'm not saying that it's, there's, that, that Christianity can be reduced to the ancient Greeks, but what I am saying is that we, we don't as a, as a fact get our understanding of what Christianity is about in the west outside of the, the mediation of, of the intellectual structures that enabled that to be understood. And in a sense it's not just that this goes so far and then this picks up it. It's, there's a sense in which those intellectual structures themselves are transformed by their engagement with the Christian revelation. So it works both ways."}
{"episode_id":"SW - #328 - 2024-02-21 - Stephen Blackwood - The Book that the West Needs","start":1260.84,"end":1358.06,"speaker":"Jonathan Pageau","text":"Yeah, I think that's a, that's a great point. I was, you know, because obviously, you know, you send me this book, your, your book, and I was reading it and so I thought, well, I have to reread the consolation. I hadn't read it in maybe 15 years or something. And I was so struck by that part of the book itself. I felt like I was falling right into the problem of emergence, the, the question of complexity that we're dealing with today. And, and I realized to what extent, you know, how deeply Boethius had perceived it and what, you know, and you can see that this type of thinking, you know, the relationship between the many and the one and the, the kind of jump into intuition or this jump into something who, which transcends multiplicity, you know, was, was so deeply understood and now it's become a mystery to us because we, we've had a few centuries of, of kind of rationalistic scientism that is running out now. And, and people are realizing that again. But definitely revisiting those chapters in the Constellation is, is worth it for people who are thinking about the problem of complexity, you know, even in, in technical terms right now. So maybe we can just quickly, well, not quickly, but, you know. Yeah. Go into the argument of the, of the book itself before we fall into the rhythms. That's the thing that I, that I really want to get into. But maybe we can help people understand a little bit with the argument of the book. You know, Boethius is, is basically lost all the things that he thinks or that most people think has, are valuable to life that are what make you would make life valuable. And then consolation is trying to help him see through that. And so maybe you can take people through the kind of basic argument of the book and, and what he's trying to help, what philosophy is trying to help Boethius understand."}
{"episode_id":"SW - #328 - 2024-02-21 - Stephen Blackwood - The Book that the West Needs","start":1359.34,"end":1363.58,"speaker":"Stephen Blackwood","text":"I, I, I'd love, I'd love to and tell me if I'm going too slow. I try and do this as quickly as I can."}
{"episode_id":"SW - #328 - 2024-02-21 - Stephen Blackwood - The Book that the West Needs","start":1363.58,"end":1371.98,"speaker":"Jonathan Pageau","text":"Yeah, it's like, Sorry, it's like reduce the one of these fulgrims of Western civilization to a few sentences, please. At least, you know, no more than so many words."}
{"episode_id":"SW - #328 - 2024-02-21 - Stephen Blackwood - The Book that the West Needs","start":1372.38,"end":2024.17,"speaker":"Stephen Blackwood","text":"Well, well, let me, let me just first take, take the, take the chance if I, if I can, some of your, your listeners might be interested in, I suspect, and if they haven't already read read the Constellation of Philosophy and, and if they're looking for, to read it in In English, The. The one that I. I most like is this one, this little, little red book. It's called A Low from the Loeb Library. L O, E B. It's published by Harvard. Just a little. It's about as big as your hand and it's got the Latin and the English both together. And so you can look back and forth, but it's a nice little volume. And have on the shelf. There's something liturgical. There's something just very beautiful about the materiality of a book. I can't read books on a Kindle or something myself very successfully. And so I like to recommend this just because I think it's a beautiful experience to have this book in your hand. But the basic argument is this, is that it starts very, very powerfully with. With a poem. And it's a woe is me poem. Oh, you know, this. All this has happened. And, you know, I'm. I'm. I wish I could die, you know, but I can't, you know, but, you know, I call for death and he doesn't come. And it's just. It's very Woe is me poem. It's not. And, and, and then the. The book says, as I was writing, as these verses were being dictated to me by the muses, and the. The poetic muses are there. They're telling him what to write. This, this blazing figure comes in this philosophy. She's described as like having absolutely blazing eyes, or she's, she's. She's able to pierce right through him. And she's got this. This sort of ambiguous stature. So sometimes she looked like she was as big as a. As a human being, and other times she was up to the. To the heavens. Very rich symbolism. And then other times her head went through the heavens. And she says, basically, who let these. Shani Casimira, Triculous, who let these theatrical tarts or poetic horrors or whatever you want to say in here to this man? They have no cure for his pain. They only make it worse. And, and, and so she's basically saying, you know, she's. He's. He's caught in this. And I think this is a really interesting moment because we've all been there, right? You know, this moment where you can't see out of your own depression. You're. You're. You're in a bad thought pattern or whatever you want to call it. You can't get out. You can't get. Get out. And feeling sorry for yourself and that makes thing. And then you feel passive and you're the Victim. And it's also terrible. And so she comes in, and so it's very interesting. Her first move is this kind of condemnation of these poets who are just making things worse. It's a kind of feeling sorry for myself, like Netflix show or something. And. And she. And she. She kicks them out. But it's worse than that because it's in a pattern and it's like a loop. It's a loop. And so she. She kicks them out. But very interestingly, she then says, this woman who has just banished the poets or the muses, she says, leave him to my muses to heal and make whole. So what she's suggesting is that there's a different kind of. Of poetry that isn't just sort of fill sorry for myself. Woe is me. But. But. But that. But could be salutary and transformative. And so. But then she. She has. She. He can't even recognize her. This. We have to skip through the symbolism. It's terrible to think to do in a Jonathan Pedro podcast. Maybe we can revisit it at some point. But why the her. She is such a richly symbolic figure. He can't this. The first few pages. You could spend hours on them. But he can't recognize her, even though he studied with her. So his. His vision is blurred with tears, but that's also metaphorical. He can't access. He can't recognize his surroundings. He doesn't know himself. He can't recognize her. And there's this beautiful moment. She's wearing this dress that she says she's woven herself. What does that mean? It's like wisdoms represent what we can see wisdom by. Is the work of wisdom itself. Something like that. Yeah. And. But it's torn. It's torn. It's, you know, marauding. You know, it's like bandits. He says it's eventually, eventually, like all the. The many competing philosophical schools have each taken a garment, taken part of it. They've ripped the Stoics or the Skeptics or the Epicureans or whatever. But, you know, clearly what Boethius is after is that unitary, you know, what brings all these together. So what he. What she says is this beautiful moment. She makes a fold in her dress, this kind of a sacramental moment, and she wipes the tears away from his eyes so that he can see her and recognize her as the teacher of his youth. And so there's a very beautiful moment in which, you know, like, it's a moment of. It's an act of grace, fundamentally. It's an act of the good towards us that gets us out of, frees us, liberates us from our, our, our, our inescapable self kind of regard and self pity. But then what happens is it is just tough freaking love. She's like, you know, tell me what's wrong with you? Basically? And he goes on this long diatribe about oh, I lost this, I lost that, I was mistreated, I've been accused falsely of treason, and now I'm here in the prison. And of course he's writing all this, but he's portraying himself as just an absolute. I have been. And you know, let's take his word for it. Let's assume he's justly, his account of his situation is fair and he is a victim of these terrible injustices. And she, and she said, and he says, I've been, I've been, I've been banished. And she says to him, and this is such a pivot in the book, she says banished, you say a man's true homeland. If you are banished from your true homeland, well then I say you have banished yourself because only you can remove yourself from, you know, true self possession in the place that you belong to. And so his retort is, well, hold on, I've lost all these things, how could I be happy? And so the first part of the book, I'm going to move much more quickly here now. First part of the book is, it's a kind of negative action. She has to separate him out from his attachments in the world, his attachment to money, his attachment to his position of power and his fame and all of that. And she, so she shows him by. You can certainly read your way through these beautiful arguments and they're so powerful in which she, she says, okay, you know, let's take money for example. You know, is it ever really yours? What are the stock market crashes? You know, what if, what if someone steals it away? It's like in, in the argument of all these things. Same with frame fame, where you could have your reputation trashed. And then what, you know, her argument is anything that can be taken away from you is not really yours. So that's, that's the first part of the book. And he, he has to think, okay, then, well, you know, what is mine? And so she'll say, well, well, what are you really seeking in, in those things? That's the next thing. So let's say in wealth, maybe you're seeking security. So she shows that there's a spiritual good that's really being sought in this thing that, that you think is the thing but can be taken away from you. So it can't be what you're really after because you wouldn't want a. It wouldn't be a real happiness of someone if it were externally dependent. It could just be taken away. So then she goes to show that what the, the, you might say the actual object is, it's being sought, whether it's security or, or, or, or power in the sense of ability to realize myself, my power to realize what I'm really seeking in the world that say it's not external or, or, or, or, or, or beauty or whatever the case may be. And so she shows through this argument that there's a kind of unitary. All these things are connected. They're not separate. They're actually, you know, the thing that would really be, be desirable is to, to make you secure is also beautiful, is also self sufficient and so on. And so she shows how each of these spiritual goods that are behind the material might say things are actually all participating in, in, in. In. In. In a, In a single unified good. And so then we come to this problem that we were talking about a minute ago, which is that. Okay, well, yeah, that's it, that's the thing. But then the problem is my seeking of that in time. And you know, sometimes I'm doing this and sometimes I'm doing that. They're all dividing this up. And so the very thing that I, my, the very thing I want, my approach to that thing is preventing me from having that thing. And that's a very, that's a very, It's a very, it's a very deep moment. And I think it's important to take a step back and reckon a bit with, you know, this as the kind of problem of finitude itself. Right. You know, how can any of our efforts ever amount to anything? Let's say you want to love your, your partner, your wife, your husband, your child. You want to love them like perfectly. You want to. This is even that. It's like, you know, nothing but failure. You know, it's like the efforts to be adequate even to this one thing. And so there's this moment of prayer that follows that in which they're turning towards the highest good to help them overcome that problem. And the remainder of the, of the, of the book, it gets, in a sense, the problem becomes even more real, even, even, Even sharper. So let's say you're starting out in this world of, you know, you know, injustice and being robbed of everything you had you know, in. In a moment of suffering. And, you know, his complaint at the beginning, I should have said is, is that there's no order in the world, because these things would not be possible if there was order in the world. I would not be in this. This. This position of disenfranchised injustice if there were. And so what she shows in this first half is that there is order because your actions. This is an argument that. That comes from Plato. Your actions are their own reward. So, you know, remember we were saying how if it's external, like, you know, riches, well, that can be taken away from you. But if. If you. What she shows is that within our actions, the good or evil they bring about is internal to them. So if you do something good in virtue, you know, an act of love that can't be taken away from you. It's. It's what you are. Whereas even if you're not caught, if you do something that degrades your soul, that degradation is internal. You lie, you betray someone, whatever. That's. So. So what she says is that is. That. Is that actions have their own reward or punishment present in them."}
{"episode_id":"SW - #328 - 2024-02-21 - Stephen Blackwood - The Book that the West Needs","start":2024.41,"end":2037.45,"speaker":"Jonathan Pageau","text":"Yeah, the good that you do, that's the reward. And it's a. It's a. It's the. It's a reward in the. Also in the sense that you cannot. It cannot be taken away from. You can't. You can't be stripped of that good because. Yeah."}
{"episode_id":"SW - #328 - 2024-02-21 - Stephen Blackwood - The Book that the West Needs","start":2037.53,"end":2264.7,"speaker":"Stephen Blackwood","text":"And so too, in the negative side. And so. So what she shows is that in fact, intrinsic inaction is already this justice of you're getting the reward of the punishment you deserve. Because his claim at the beginning is, you know, good people are, you know, get punished and, you know, bad people get rewarded. And she's saying, well, that may look that. Like what it is externally, but actually internally that's not the case. And it's a very deep and powerful. Because there is ultimately there can be no happiness, he argues, other than one that is internally possessed. Then the question is, how do you. How do you possess that? But the second part of the book is very interesting because you can see, in a sense, and I think we all face this, okay, we're living in what seems like a disordered world. And then the answer can be well, over yonder, there's a unity that we seek and that you can maybe in a moment of kind of mysticism or something, approach. But then, very interesting, in the second half of the book, the. The prisoner Boethius rearticulates the initial problem at a higher, you know, you might Say, even more fundamental level, what he wants, ultimately, we might say, what all human beings, in some sense, I would argue, want is not simply an answer that is over there because we're living in the world of, of the finite and the broken and the particular. He wants an answer that makes sense here in the midst of this. And so the later part of the book deals with this question of the relation between, let's say, time and eternity, of the finite and the infinite, and in a difficult sort of theological section at the end, ultimately, with the relation between free will and providence, or the, you might say, the absolute unity and of, Of. Of the first principle itself. And, and I think what's so beautiful about the, the, the ending of this, this book, which I'm not going to spoil for your, for your, your listeners, but so beautiful about the ending of the book is that it's a bit like the question of, Of a ladder. Like if you get to the top and you kick away the ladder, or you get to the top and you learn that the top destroys the ladder because it's all predetermined or something. It was like, wait a second, what, what was my journey after all? Like, what was. Was that not real? And so what I, What I think is going on in this beautiful book and the way in which its wisdom is put in the form of, of poetry, of images, of. Of. Of beautiful rhetorical turns. Is this really a work of, you might say, pedagogy? It's a work in which the wisdom is being put in a way that is adequate to the. Both the soul of the reader in confusion and alienation on the one hand, and to the integral wisdom that it is conveying. So the fundamental, you might say, argument is one that moves from alienation and this sense that the whole world is disordered, but that demands to be able to see an order within that to one that leads him on a journey such that he can see a deeper, you might say, spiritual logic as governing the world, but just as importantly, to come to see himself, the mechanisms and principles of his own knowing of his own activities, as you might say, in the image of, or a manifestation of that underlying wisdom. Yeah."}
{"episode_id":"SW - #328 - 2024-02-21 - Stephen Blackwood - The Book that the West Needs","start":2264.7,"end":2363.89,"speaker":"Jonathan Pageau","text":"And so in that way, it's a deeply incarnational approach. It's not a. It's not a gnostic idea, like you proposed at the outset, like the idea that, you know, all of this is all illusion, all this is all nothing. And once you get to the mystical unity with the One, then, you know, all that other stuff doesn't matter. But rather this formulation at all the levels of how it's adapted to the particular. And I think this brings us to, you know, the reason why I wanted to talk to you mostly in the first place, which is that in your book, one of the arguments you make is that the very structure of the poems, the very use of meter, the very way in which Boethius, you know, structures the meter of the lines in the text, is an incarnation of his journey, moving from a kind of broken disunity and, you know, a kind of confusion towards this deeper unity. And that in some ways, that one of the reason why it has such an impact on Western civilization is that it is paraliturgical or it is liturgical in the sense that if someone goes on the journey with Boethius, even reads aloud the poems, that, that participation in the rhythm as, as much as the idea that he's, he's, he's formulating rationally is reordering the soul of the participant towards the good that is aimed at in the book. So maybe you can break down that argument, because I was really fascinated by, you know, the, the proposition. You can talk a bit about how you came to that and, and, and what that looks like."}
{"episode_id":"SW - #328 - 2024-02-21 - Stephen Blackwood - The Book that the West Needs","start":2364.29,"end":2767.83,"speaker":"Stephen Blackwood","text":"I say a few things. What I, what I discovered, and I, I hasten to add, like, the, the acoustic superstructure of this book is astonishing, and I sort of uncovered this, but it's a bit like, I don't know, falling into a ditch and finding a gold treasure or something. It's like I didn't, I didn't make the treasure. I just, I just sort of realized it was there. And effectively, what I, what I, I, I argue is that the, these poems, these meters are organized into a, a beautiful sort of symmetrical and interwoven structure. So there's a, you might say an ordering of the acoustic character of the book that I suggest mediates time and eternity. And. Now, this maybe sounds like a difficult thought, but what I would want to maybe start with is that this, the need for repetition is absolutely fundamental to our need or to our ability to know anything. So let's just to give a good, simple example, you know, you can't so much as recognize and memory, let me say memory and repetition are absolutely fundamentally connected. So, so you couldn't so much as. You can't recognize. You couldn't so much as recognize yourself in the mirror or, or your, your front door or your, your mom or whatever, without, without memory. Right. Because it's memory that allows you to, to recognize in the present this as something that you already, you already know. And so, so, so memory is necessary to see a repetition, but repetition is necessary because without it, there's no. There's nothing stable at all. So imagine, imagine, Imagine, you know, just like being in a fire hose. You know, life is a fire hose. It's just coming at you. There's no interpretation of anything. It's just, you know, you don't even know it's water, right? Because it's just that's, you know, that's the kind of overwhelming flux of movement and change. Your total nothing but change, let's put it that. That way. And, you know, life feels that way sometimes, right? I mean that. So you can look at this. Let's just start in the most stable way. I mean, in the most. In the, in the, in the. In the simplest way. Let's say, you know, we've all been around babies, you know, most of us anyway, when they're, you know, early on when they're born and, you know, they, they look up at their. At their hand and. And they don't even know that's their hand. Yeah, right. They have no idea. It's just. They're not yet conscious of, of that fact. And so the question is, how do you move from that moment as a, As a child, as an infant that can't even recognize its mother or its own, like, limbs to one that knows, oh, this is me. And, oh, that's. That's my mother. And what I, what, what I'm arguing is that it's the. It's repetition, it's seeing this again and again and again that. That stabilizes. Imagine yourself as an infant. It's just everything moving around. And to us, like, the world is stable. It's like, no, there's the door to the front house, and that's mom, and, you know, there's the fireplace, and, you know, there's the, there's the, the. The. The painting on the wall or whatever, and here are the people. I see them all. But the question on. What I'm trying to draw out here is how do you get there to the point where that you can interpret that world versus where the baby starts? But I now want to put ourselves in the baby's position in a sense of. To where we actually are. Right? Because the question is you can only interpret the movement of, of the world around you by stabilizing it by. By having a frame that locates it such that you can see this particularity within a pattern, whether it's a person, this. I'm giving examples of physical things, but as you go deeper, you realize there are deeper patterns that govern those things. And so my argument fundamentally is that we need recurrence of rep. We need to expose ourselves to, to, to recurrence or repetition in order to be shaped in such a way, such that our memories are able to interpret and understand the world around us. And so we see this, you know, we see this, you know, all the time with, you know, the, the cycle of day and night. You know, imagine we were just living in one endless day and there was no sun coming up and down. Imagine there was no cycle of, of, of seasons. Of course, if you live at the equator, that is in fact what you, what you have. But for most of us, we're living in a, in a movement through time in which there are these cycles. And so, and we, we do this at home. We have rituals in the morning and we have rituals in the evening, and we have rituals at, you know, Christmas time or religious holidays and so on. We have civic liturgies. In Canada, Remembrance Day is, is, is historically an important moment in America. In the United States, Thanksgiving is an important such day. And what those are, are rhythms of a certain kind of practice through which we gather our. Ourselves and our experience in order to understand it. So you pause on Thanksgiving and you, you, you might say you gather up all of the last that has happened since you've last done that in a moment that allows you to, to, to understand yourself in relation to, say, gratitude. But I would say at a, At a, at a more fundamental level or at a very fundamental level, this is the case with all of us all the time. But I'll add just one, one, one more thing, and that is that there's a sense in which you think about the infant. You can't recognize something that isn't part of a repetition that you recognize. Yeah. And so we are in a certain sense, nothing but the memories that we hold that allow us to interpret the world. And that's why the shaping of our memories is so important, because it's what enables us to, to see, to see the world around us. And so in some sense, that's why people, you might say the study of history or the forming of ourselves in relation to fundamental patterns, otherwise you end up being like the infant who doesn't even know that's your mother. You can't, you can't see what's in front of you. The world is, is, Is an unstable flux until you internalize its patterns such that you can see them outside of you."}
{"episode_id":"SW - #328 - 2024-02-21 - Stephen Blackwood - The Book that the West Needs","start":2768.15,"end":2857.48,"speaker":"Jonathan Pageau","text":"Yeah. And I, I think that before we get deeper into the Boethius idea. You know, it's important for people to understand that in. That's why Plato, you know, almost joins together the idea of memory and knowledge. That is to know something is to remember it. And you know, we can find different ways of formulating, formulating that metaphysically. You know, obviously Plato had this kind of reincarnation model where the sense that you're remembering, you know, ancient lives and that is what making is, making you participate in it. And you know, as humans now we can, we don't need a reincarnation model to understand that even biologically. We understand that we are the descendants of, of patterns that have re embodied themselves over and over and over and we part and it's when we, when we know something means we're tapping into that at the low level. We could also formulate it vertically and understand that when we know something, we are connecting to a cosmic memory. We're connecting to a cosmic pattern of repetition and of truth that instantiates itself to the world. And we kind of remember that way. So even whether you look at it as biological or whether you look at it vertically towards this idea that there are these kind of transcendent cosmic patterns, we can understand how knowledge is memory. And it's represented that way in the Bible, by the way, constantly. You know, we could call it attention and memory."}
{"episode_id":"SW - #328 - 2024-02-21 - Stephen Blackwood - The Book that the West Needs","start":2857.48,"end":2857.72,"speaker":"Stephen Blackwood","text":"Right?"}
{"episode_id":"SW - #328 - 2024-02-21 - Stephen Blackwood - The Book that the West Needs","start":2857.72,"end":2922.5,"speaker":"Jonathan Pageau","text":"Attention and memory as, as kind of two faces of the same thing. The idea that God remembers man, that man remembers God. We see that in the story of Noah, we see that in the story of Jonah. We see it constantly in the, you know, and when we, you know, even when we talk about the way in which we participate in the people that came before us, we formulate that as memory. Why do we, we have memorials. We talk when someone dies. In the orthodox tradition, we say memory eternal and that their memory be eternal. But it, it, it's not just a, a vague sentimentality. It's a mode of participation. Right. It's a mode of I'm connecting to those ancient lives and I'm, I'm a continuation, a re. Embodiment of the good that they, these people did in our lives today. And so I think it. For people just to understand that, that, that this isn't just a kind of artistic, artistic fancy to talk about these questions of pattern and memory, but they really are really the way that, in which we engage with, with the way in which we recognize the world to exist, you know, just full stop."}
{"episode_id":"SW - #328 - 2024-02-21 - Stephen Blackwood - The Book that the West Needs","start":2923.78,"end":3164.45,"speaker":"Stephen Blackwood","text":"Yeah. And there's a way in which the like if you imagine, you know, life in the fire hose and in some sense, you know, we're in this time in history, we're all way too much in the fire hose, in a sense, right? And, but if you, if you imagine, you know, by metaphor, the infant who can't recognize anything as a kind of metaphor for how many of us, certainly myself, you know, are living far too much of the time. The question is, well, what is the alternative to that? And what is it that allows anything to become stable so that you're, you're, you're, you're not simply like if you imagine, you know, every day, living every day different, with completely different patterns, completely different people, completely different places, you know, you would know nothing at all, right? You're just, you're just in this, in this constant sea of change. And what I think is, is, is so interesting is that you know, what is going on in a moment in which, you know, you step outside of that and you sort of understand, oh, that moment and this moment and this moment, those are all, those are all in me and connected and understood. And you know, I think it's often interesting to talk about, for example, people often in experience of nature have this sense which, you know, they, they, they move beyond the particular into something that gathers the particular, often in music or art. And you're listening to, I don't know, Bach is often very famously brought up in these connections because of the way that his music has such an astonishing integration of patterns moving through time that you can, you can track with. And so what I'm wanting to say most fundamentally is that there is no self consciousness itself, like any knowledge of anything is a stabilization that is taking us outside of the immediate into something that is trans. Historical. Right? So the moment that you, you know, let's say you, you know, you re, you understand yourself to be the same person that you were that the same person as you were when you were a kid. You know that you haven't changed and grown up and so on, but you see a continuity, you're like, oh no, you remember that and now. And so in that moment in our, in ourselves, what we have in our, in our memories is a way of making the past present now. And so memory is by definition. And of course the present doesn't really exist, right? Because as soon as you're aware of it, it's already happened. It's like, you know that it's like perception, you know, the thing, by the time you see it, it's already in the past. You know, even just A microsecond or whatever, but it's already happened. And so what I'm trying to suggest is that, is that, I mean, it sounds very highfalutin and difficult when you talk about the relation between time and eternity, but this is really the, the, the nature of, of, of life, right, is that, that you, you can be, you can be lost in flux and movement or you can. The answer to that is to find some, some longer continuity that you by definition has already taken you outside of time. But then the question is, well, what does that have to do with my movement through the world in time? And so in some sense that's precisely what patterns give us, is they give us ways of stabilizing ourselves in our movement through time such that we're able to see in the moment the eternal or, or open the moment becomes something that reveals a deeper stability. Yeah."}
{"episode_id":"SW - #328 - 2024-02-21 - Stephen Blackwood - The Book that the West Needs","start":3164.69,"end":3282.46,"speaker":"Jonathan Pageau","text":"And so it's interesting, like one of the arguments that you make very simply in the book that I found really powerful is that you talk about how the patterning of the words and the patterning of the, you know, the creation of these, the, these frames, they are mnemonic in the sense that they help you remember. Right. And people talk about that sometimes too when they say that one of the reasons why monks would chant the psalms or that rabbis would chant the psalms is so. Because by doing this kind of pattern language, it's easier to remember the text. But there's also a deeper sense in which it's mnemonic, right? Is in the sense that it's connecting you to the pattern of reality itself. It's making you remember that it is through this pattern existence that anything, that everything that we participate in comes to find any cohesion whatsoever. Right. The fact that you exist is mnemonic, right? The fact that, that because you're able to connect all these different element elements together towards knowing that like you said, the five year old version of Stephen and you, in, in a, in a very mysterious way is the same being that is continuing on with the same, the same pattern. Yeah. And I just thought that was really interesting because maybe you can go a bit a, A little bit into that, into, you know, because the, this is to me the deeper understanding of musicality and also the deeper understanding of, you know, when we, we. I remember when I was in school, but people talked about the idea of the music of the spheres and how it's kind of like this kind of ridiculous mythology, right? The idea that the spheres make music and that we, we don't hear it anymore. But that is the deepest part of that, which is that the music of the spheres or even the ancient study of music wasn't just the ancient study of how to make entertainment music for, for a party, but really how to live in the patterns like really what liturgy is. And this is what this is there in Boethius himself as well in his text."}
{"episode_id":"SW - #328 - 2024-02-21 - Stephen Blackwood - The Book that the West Needs","start":3283.1,"end":3614.71,"speaker":"Stephen Blackwood","text":"Yeah. So, I mean, let's, let's just, let's put it this way, that, that two things. First, this whole kind of the art of memory, the, the, the we were talking about the mnemonic is, you know, it's pretty amazing. First of all, what you, what, what a human mind can remember. And you know, as you know, Plato in the Phaedrus is worried about our losing our memories when we start writing things down. And you know, that's of course, exactly what happens. And we see that with the Internet. It's not what, you know, it's where to find it and all this kind of nonsense, but it's also true that it, that's what happens is, you know, when you don't need to, you know, you, you lose that. And so it's actually a very scary thing to think about how much less we have in us to understand the world. Right. Because we think we can just find it all, but you don't even know what to look for. Right. And so what I, what I want to say is first of all that the, the human mind is an amazing thing from the point of view of, of memory. And if you look into the medievals and even today there are memory competitions, people who think they have bad memories are then capable of astonishing feats. Right? But the, the, the, the deeper point is. And is, is what that is doing in terms of formation. And so it's interesting that when we have, in English, for example, we have in the first place, we would say in the second place, and this is a, this is a holdover from, from, from the art, you might say the art of memory in the Middle Ages when you would, if you were trying to remember something, you would say, okay, well, let's say that maybe the houses on my street or the, the, the rooms in my house. And you, you say, okay, I'm gonna put this thing that I wanna remember in the first room and you, you picture it there and I'm put this thing in the second room and, and so on, and that this is sort of a short version of how the art of memory works. But I wanna make a much deeper point, which is that in some sense you can only understand that which you have the places to put things. You can only put things in places. You have to put them is what I'm trying to say. And so what does that mean? Well, Aristotle has this, this wonderful account of, of, of habit. And you know, today we like to think, well, you know, I did all these bad things, but I'm not really, that doesn't really define me. That's not really what I am. And well, Aristotle would say, no, you are, you are what you've. What you, what you, what you've done. And, and habits are very powerful, right? Because, you know, they're, they're, they're, they're, they're like an unconscious memory. You repeat it and you did it again and again and again and then it's just what you are like. You know, I give the example sometimes that in the home that, that my family lived in for many years, at one point they moved the cutlery drawer for the silverware from one part of the kitchen to the other. And it was after I'd gone to college and every time I come back, I would always be going there, right? Because it, but, but you can, you can put that, you can take that example and realize that, that, that we form ourselves by the things we do. And if you're formed in, I don't know, listening to a lot of negativity and anger and frustration and rancor on the Internet, like that's what you become in a profound sense, right? That's where. That's the truth of Plato's line, right? Is that you, you. The kind of vision we bring is to the world. The form of perceiving limits what we're able to see in it. And so the whole question of habit is so important that, for example, if you were a parent, you know, you think about why you could, you know, teach your child to you, I don't know, to have no self control and, and, and, and you know, be completely dominated by his or her emotions by rewarding certain behavior and, and so on and then. Well, what. The world that that child is able to see is completely constrained by the habits they have taken on the person they can become is limited by the fact that they're, they, they had habits that prevent a deeper form of seeing in the world. Whereas if you, you know, as the wonderful line in the scripture says, you know, if you set your mind on things above such that you have habits of recollection, such that you're able to see and perceive deeper pattern, deeper patterns, and you might say become more and more adequate to those patterns, whether it's of, you know, love or patience or humility or, or whatever, then that's what you're able to find in the world. But it's not as if you can access in the world that which you don't already have the way of being able to see. And that's why I give the language of the, the image of the infant who, who is, who is lost to even seeing his or her own hands in the world. Now, because we have the categories of consciousness, like it's not as if we're a blank slate. The infant is innately able to recognize these patterns because the human mind is made in such a way as to be able to perceive them. And if it weren't, then it wouldn't be able to. Able to see them. But the, the point fundamentally is that everything is at stake in the habits we develop and the patterns we expose ourselves to, because it is what we will be able to see in the world."}
{"episode_id":"SW - #328 - 2024-02-21 - Stephen Blackwood - The Book that the West Needs","start":3614.95,"end":3766.37,"speaker":"Jonathan Pageau","text":"Yeah, and I think that such a. Everybody can find examples in themselves or in other people where they've noticed that, you know, let's say someone who, who is not trustworthy or someone who tries to trick people or tries to get things will. Their world will get built that way. And then at some point they'll find themselves in a situation where they're also surrounded by people that you can't trust, that you're surrounded by people that they shouldn't trust. But it's. And, and the opposite is true is that, you know, this is something that you can see in Christ's word. The idea of, of saying that if you judge not right lest you be judged. That is, that if you, if you practice the good, then all of a sudden you will start to see goodness in the world. And that because the world has multiplicity and variance and that, and, and there's even a powerful way in which if you learn to live in the good and see the good, you can actually call the good out of others. Right? You can actually. And you, you know that because sometimes you, you realize that when you're with certain people, you're the best version of yourself. And then when you were with other people, you kind of become the worst version of yourself in all, in all kinds of ways. And that this is with what. What you're trying to bring about is that the patterning of existence has a deep effect on, on who you are and who you remember yourself to be. Because we do have the potential of being. Of change, like, of changing that. That's. That's what humans are. We can be, you know, all kinds of different things, and that can happen at. At any time in our life. But if we have these deep patterns of virtue, but also deep patterns of habit in the simple sense, you know, like eating three meals a day, sleeping certain amount of hours, you know. And I see it in my life because I. I have a. You know, I have this weird. I have a kind of creative bend to myself. And I can see myself sometimes fall into, like, not, you know, not sleeping, not eating well, not. And then things start to shake around me, like, in every way, like, not just in terms of my habit, but also in terms of the way I treat others, the way I see the world, the way I interpret the way other people treat me. And it starts to shake. But, you know, maybe you can bring us through a little bit how it is that Boethius does it in his text. Like, what is it that he brings you to. Through really, even without going into the details about the different meters of the poems, but the basic image of how he takes the reader, the participant in his text through a kind of poetic transformation towards. Towards the highest good."}
{"episode_id":"SW - #328 - 2024-02-21 - Stephen Blackwood - The Book that the West Needs","start":3768.53,"end":3999.25,"speaker":"Stephen Blackwood","text":"I'd be happy to. To. To. To try and say a few things about that. I've just been sort of meditating on. I think what you're saying is very, very deep. I mean, the way that. I mean, what is the. See, we tend to think that the way we feel about the world is how the world is, right? But it. It's actually, no, no, no, no. That's. That's exactly. That's where Plato starts. Is saying, no, you can. The way you. You might say, feel about the world is determining what you're able to see in it. That's what's going on. It's nothing, you might say, to do with the world, in a sense. And so the question is, well, how do you do have a vision that's more and more adequate to seeing what's really there? And that's. That's, you might say, the whole question of the spiritual, intellectual life. That's a whole question of parenting or teaching or whatever. How do you. How do you shape yourself or others into a way that you can see what's really there? And you think about the difference between someone who's, you know, you know, always complaining or woe is me or whatever, or. Or always busy and running onto the next thing, as sometimes I am, often I am, or someone who is. I don't know what is. What is it like to be with someone that sees you know, when you, when you're in their presence, you think, gosh, I just feel better. I feel like I'm, I'm, I'm seeing, I'm, I'm, I'm closer to what I'm meant to be. What is going on with someone who I knew, I've known a few people like this, whose very presence was able to mediate a deeper sense of the world, a truer, more beautiful sense of the world. Um, now, now, in terms of Boethius, I'll just give a couple of examples. The poetry works in different ways. One way it works is, you know, those of you who've, you know, read poetry, you know that, you know, the way the rhythm works is part of the way the message is conveyed. The, the message is, is encoded in that sense partly in the, in the, in the, in the, in the way in which that it sounds. You know, you get these wonderful rhythms. I give example, you know, towards the night before Christmas and all through the house, not a creature was stirring, not even a mouse. And that, that, and that kind of rhythm, you have this sort of way of, you know, it's lulling you in. It's a beautiful repeated pattern again and again. But you can also have, you can also have rhythms that are, that are jarring, that, that are, they're surprising or unexpected. Of course, that's what jazz often, often, often does. And so, so one level at which the poetry works is it's, it's, it's simply manifesting, you might say, the, the, the truth or the idea that is present in the poem. So, for example, there's a, there's a lovely lyrical meat meter. Dum da da dum da dum da dum Dum da da dum da dum da dum. That, that in this, this. It's called a glyconic. But what's beautiful in that is that he uses it in the, in early on to describe the, the stability of the seasons and, and, and the, the, the consistency of the, of these changes in nature. And so he's using this wonderful lyric. She's using it, I should say, lady philosophy. Philosophy is using it as a way of con. She's trying to settle him down and speak a kind of stability to him in his instability. And she does this so, I mean, so wonderful the way she does this. Both by giving him images that his mind can say, oh yeah, I know those patterns in nature. I, I, I've seen, I've seen, I've seen, seen that. But also putting it in a Way so that it's sonically, acoustically stabilizing and lyrical. It's like, you know, we all know, with a. With an infant, you know, what do you do with an infant? That's, That's. That's, you know, upset and crying and so on, you know, tap, tap, tap, tap, tap, tap, tap, tap, tap, tap."}
{"episode_id":"SW - #328 - 2024-02-21 - Stephen Blackwood - The Book that the West Needs","start":3999.25,"end":3999.77,"speaker":"Jonathan Pageau","text":"Yeah, that's right."}
{"episode_id":"SW - #328 - 2024-02-21 - Stephen Blackwood - The Book that the West Needs","start":3999.77,"end":4390.46,"speaker":"Stephen Blackwood","text":"You, you, you, you. And then, you know, you can. Music can do the same thing, but you're at the very most basic level. The rocking is a pattern that stabilizes the child. So that's one sense. And then there's. There are other poems where. Where she's talking about the instability of fortune, for example. And it'll be like, dump, dump, dump da dum. You know, it will be. It will be. She'll. He'll. She'll use an unstable meter to convey the instability. So that's one level. But then what's amazing is that. Is that. Is that some of these meters, they occur later on. And then the question is, well, what's going on there? Is it the same? Is it just. Well, okay, well, we figured it out last time, and it was insta. It was lyrical and stable or it was unstable. But actually, what I think is going on is the way in which the later uses of the meters are doing something redemptive relative to, you might say, the problems or issues or matters that were raised in the first time. Time. Time around. So, you know, there's. There's one in. In which the instability of a meter that was used to describe the, you know, the, you know, contingency or fortuna, you know, the instability of. Of the world, you know, all its unknowns, she actually uses to show how that instability is comprehended by a deeper pattern. So the way I. I think this is so beautiful, Jonathan, because. Because there's a. There's a deep sense in which healing has to take place at the site of the wound, right? Like, if. If you've had this kind of experience or that and you've been shaped or damaged or. Or broken, that's where the healing has to be. And so I think one thing that's going on in. In the. In the poem is she's. She's. She's redeeming these broken moments by. Through this, you might say, acoustic recollection of an earlier moment to give, you might say, the answer to the problem or the pain that was in the first instance. And so it's. It's a way of, you might say, redeeming by show, by recollecting. And of course, psychologists use this, this, this all the time. But then there's a third level, and that is. That is. I think that as you look at the poem as an acoustic structure, the poems of the book as an acoustic structure, and in readers who are interested can see I patterned this out in color at the back of the book. You've got to get the paperback, though, because the hardcover was printed in black and white and it's much harder to see. But in the paperback, you can see these unbelievably intricate patterns of the poems. And so what I'm, I'm arguing is that, is that the whole acoustic structure of the poetry has an interwoven pattern that means that any point of it is part of. It's like what you say about fractalization, right? Any point of it is integrated within a larger pattern. And so, in fact, maybe, maybe share two things quickly. And one is that, you know, I think we. This is how memory works, right? Like, I give the example in the book that where I grew up, I love wild roses. And I've all these, you know, these. The first instance you, you see the rose. Wow, that's. That smells good. And it's kind of a memory on its own. But then the longer you go through life, they doubt, well, oh, that reminds me of that place that I used to go in the summer and with that person. And then it's, it's a reminder of childhood, and then it's remind. And so you start seeing that you smell the rose again, and you're like, whoa. That has all these deep forms of pattern that it brings up to you. Maybe it's a, it's, it's reminding you of loss or of happiness or. And so all of these things become collected precisely because the patterns are moving through different moments in time. And, and, you know, I, I, you know, I. My grandmother died a few years ago, and I know, you know, if someone was wearing her perfume, it was very distinctive to her. That would bring back all of my memories of my, My grandma. So there's a. There's this sense in which one thing we want to do is to scaffold into life the patterns that enable us to gather up our past as present in a way that it could be comprehended. And then, and then the other thing I say is that, as you say, if you look in the appendix of my book, you see all these really complicated patterns. And I had a moment when I was writing this that I thought, I mean, really, like, is, Is it really there? Like, this seems Pretty complicated. And, and I was. My brother was living in rural Vermont. My wife was away and my brother had come to visit in the. The sort of hills of Vermont and a mountain ridge and I had taken him to the bus station and I was driving back and so this woman hitchhiking at the side of the road and of course that's where you hitchhike side of the road. But anyway, she's standing on the side of the road and she's, she's, she's clearly upset. She got a garbage bag with all her possessions and I, I stopped and you know, before I could hardly start it hard even stop, she was, she was already kind of threw her things in the back and got in and she was very upset. She was, you know, woman in very challenging circumstances. And as I got to know her, where she was going, it was about 4, 45 minutes away and I was not too, too far from where I was, I was going. And we got into a conversation about her and she had a very sad sort of life story and multi generational dysfunction and drug abuse and children in prison and it was, it was very, very, very sad. And she had been crying and I don't know what had happened since she'd had sort of immediate crisis where she couldn't stay where she was and had to go somewhere else. And so, and her things in the garbage bag. And her name was Constance. I think she may have been, I don't know if she, maybe she was an angel."}
{"episode_id":"SW - #328 - 2024-02-21 - Stephen Blackwood - The Book that the West Needs","start":4390.46,"end":4391.26,"speaker":"Jonathan Pageau","text":"Maybe she was."}
{"episode_id":"SW - #328 - 2024-02-21 - Stephen Blackwood - The Book that the West Needs","start":4391.42,"end":4530.15,"speaker":"Stephen Blackwood","text":"As I, as I tell this story, it just seems to be unbelievable. Her name was Constance, right? Yeah. But anyway, so she was very upset and I, I asked her, I was trying to, you know, as we try to do for people, it's like what philosophy does for Boethius. I was trying to calm her. I was trying to help her find, you know, rediscover herself. And so I asked her, you know, what do you, what do you like to do? And she said, oh, I said I love to knit. And I said really? Well, tell me, tell me, tell me about it. And she said, well, you know, when I'm, when I'm knitting, is it. Why do you like knitting? She said, well, when I'm knitting, she said, I, I lose myself in a pattern and. And I said, you know, here I was working on these patterns and things about the recollection, self possession and I mean, she met. Lose herself in the sense of finding herself. Yeah, it was connecting with something, did something, something, something more permanent. And. And I said, well, you know, are you knitting anything now? And. And she said, yeah, I am. I'm knitting this. This. This blanket for my daughter. And. And I said, tell me about it. And she said, well, it's. It's pretty complicated. And I said, well, I'd love to hear about it. And she said, okay, well, there's. There's 12 sections, and each of the sections has six colors. And the patterns. The. The colors move, change in these patterns in each section, and then they relate. And I was like, holy smokes. Like, this is unbelievable. She. This woman is telling me an account, and she got all this in her head, and she's in the back. It's in this bag in the back. Do you want me to show it to you? And so here I had this beautiful kind of revelation of this, you know, woman in. In very difficult circumstances who was showing me, like, in her profound way, the truth of what was happening, what I had sort of discovered in some sense in Boethius, that. That, you know, you think it's complicated. You know, it is. Life is complicated. Bach is complicated. Yeah, but it's complicated. It's very complication. It's interwovenness is what enables it to stabilize and gather things into a pattern. And so I came, of course, to think that these patterns really were not only really worth."}
{"episode_id":"SW - #328 - 2024-02-21 - Stephen Blackwood - The Book that the West Needs","start":4530.23,"end":4534.23,"speaker":"Jonathan Pageau","text":"They can be there knitting. They could probably be there in Boethius."}
{"episode_id":"SW - #328 - 2024-02-21 - Stephen Blackwood - The Book that the West Needs","start":4534.55,"end":4558.76,"speaker":"Stephen Blackwood","text":"Exactly. So it's thanks to Constance that you might say, in a sense, I came to see how. How much we need to. How much we need to expose ourselves to patterns through which we can uncover and discover ourselves."}
{"episode_id":"SW - #328 - 2024-02-21 - Stephen Blackwood - The Book that the West Needs","start":4559.08,"end":4617.6,"speaker":"Jonathan Pageau","text":"Yeah, I mean, it's such a great insight that you have, because if you can imagine the woman knitting, you know. And know, I imagine at first she's counting, right? She's actually counting. She's like, 1, 2, 3. Da, da, da, da, da, da, da, da, da, da, da. And at some point, she probably also stops counting. Where it becomes like when you're dancing and you're not thinking about it, and you're just. You're just doing a waltz and you're not thinking about where you're putting your feet, and you kind of enter into that rhythm. And to what extent, like you said, transports us into something that is beyond us, you know, that is when we can kind of understand the power of. Of poetry, its relationship to something like liturgy in the strict Christian sense, but also liturgy in the broader sense, which is these patterns, whether it is family meals, whether it is, you know, even the simple patterns of how you organize your day and how you kind of set things up, that these are, that all of this is connected to how humans find meaning. You know, it's very powerful."}
{"episode_id":"SW - #328 - 2024-02-21 - Stephen Blackwood - The Book that the West Needs","start":4617.76,"end":4619.44,"speaker":"Stephen Blackwood","text":"Definitely. Wow."}
{"episode_id":"SW - #328 - 2024-02-21 - Stephen Blackwood - The Book that the West Needs","start":4620.17,"end":4683.02,"speaker":"Jonathan Pageau","text":"And so thanks, Stephen. I would say everybody, if, if, if there's someone here now that hasn't read the Constellation of Philosophy and you, you're not going to read it. Like I, you're a hopeless person at this point. Like, it is an astounding text, one of the foundational texts of, of, of Western civilization. And also check out Stephen's book. It's called the Consolation of Boethius as Poetic Liturgy. It's very, it's a, it's a technical book, but the argument is very powerful and it's worth looking into, especially if you're interested in the question of patterns and how patterns affect us today. And so, Stephen, thanks for everything you do. You know, everybody who, who doesn't know about Ralston College, it is worth looking into Raulston College. It is a seed of hope. In this time, I was able to, to participate in a trip with, with Steven and some of the people around Roston College was astounded at what it is that is possible to do today. And it does give us hope in a moment where we feel like everything's breaking down. Thanks for what you're doing, Stephen. It's truly appreciated."}
{"episode_id":"SW - #328 - 2024-02-21 - Stephen Blackwood - The Book that the West Needs","start":4683.5,"end":4753.39,"speaker":"Stephen Blackwood","text":"Well, thank you, Jonathan. It's a great privilege to have this conversation, to be on your podcast. Your, your friendship has been a great gift to me. I'll. I'll only say in conclusion that to those who haven't read Boethius, just remember that if you're ever in a really a difficult circumstance, that that book is. Is, is, is there. Is there for you? I, I once a friend of mine, I was once met a friend of mine at a, at a meeting. It was a board meeting in Boston and she had had cancer and I thought it had gone away, but it had come back and it was very sad. Anyway, I didn't know what to do and I went into the bookstore and there was a bookstore there and I bought her book. I just, I think I just have to give this woman a copy of Boethius. And she wrote to me a few weeks later saying that, you know, words had never been so meaningful to her. And so I, I, I say that because it might be that this is a book that can, in a time that you really need it, you can turn to it. Yeah."}
{"episode_id":"SW - #328 - 2024-02-21 - Stephen Blackwood - The Book that the West Needs","start":4754.03,"end":4769.08,"speaker":"Jonathan Pageau","text":"All right, thanks, Stephen. And we'll talk soon as well. We'll see each other possibly for second part of our team of Bible interpreters. We're hoping to see that happen. For those who are hoping that that will, it seems like it might. So that would be wonderful."}
{"episode_id":"SW - #328 - 2024-02-21 - Stephen Blackwood - The Book that the West Needs","start":4769.16,"end":4771.4,"speaker":"Stephen Blackwood","text":"Thank you, Jonathan. It's a real pleasure. Bye for now."}
{"episode_id":"SW - #328 - 2024-02-21 - Stephen Blackwood - The Book that the West Needs","start":4771.48,"end":4827.7,"speaker":"Jonathan Pageau","text":"Thanks. I want to invite you all to the very first Symbolic World Summit. Over three days, we will finally meet in real time, in real space. And everyone from this little corner of the Internet will be there to explore the theme of reclaiming the cosmic image. Of course, I will be speaking, but there will also be Martin Shaw, who is an amazing mythographer, Father Stephen DeYoung of Lord of Spirit fame. There will be Richard Rowland from the Universal History series, Vesper Stamper, Nicholas Kotar, and Neil Degrade that you've all seen on my channel Here and there. For entertainment, we have everyone's favorite apocalyptic band, the one and only Dirt Porav Province. This event will be the chance of a lifetime to capture and embrace our current moment. So join us from February 29 to March 2, 2024, in Tarpon Springs, Florida. Visit the SymbolicWorld.com summit for more information. I will see you there."}
