{"episode_id":"SW - #348 - 2024-07-11 - Seraphim Hamilton - The Symbolism of the Book","start":0.08,"end":5.92,"speaker":"Seraphim Hamilton","text":"And I think perhaps this is one of the reasons that the Scriptures emphasize the actual consumption of the book."}
{"episode_id":"SW - #348 - 2024-07-11 - Seraphim Hamilton - The Symbolism of the Book","start":6.4,"end":34.84,"speaker":"Jonathan Pageau","text":"Yeah, that's right. That's the point that he takes the book and he eats it. So he makes it the inner. It's not just an external reminder, but it ends up being something which then is integrated and then brought into the heart. I mean, that makes so much sense because that also explains in some ways what Christ is doing with the entirety of the law, which is to say, you know, it's like, it's not that I'm getting rid of the law, folks, or is that I want you to eat the law, I want you to put it inside you."}
{"episode_id":"SW - #348 - 2024-07-11 - Seraphim Hamilton - The Symbolism of the Book","start":34.84,"end":35.2,"speaker":"Seraphim Hamilton","text":"Yeah."}
{"episode_id":"SW - #348 - 2024-07-11 - Seraphim Hamilton - The Symbolism of the Book","start":35.2,"end":42.48,"speaker":"Jonathan Pageau","text":"Once it's inside you, then it's generative, but if it just remains outside you, then it could be dead letter and a bunch of rules that don't make any sense."}
{"episode_id":"SW - #348 - 2024-07-11 - Seraphim Hamilton - The Symbolism of the Book","start":42.56,"end":43.44,"speaker":"Seraphim Hamilton","text":"Yeah, yeah."}
{"episode_id":"SW - #348 - 2024-07-11 - Seraphim Hamilton - The Symbolism of the Book","start":54.8,"end":113.7,"speaker":"Jonathan Pageau","text":"This is Jonathan Pedro. Welcome to the symbolic world. So, hello, everyone. I am here with Seraphim Hamilton. Those who know my channel have seen him, but also in the circles around symbolism and Bible interpretation. Seraphim is orthodox, and we're finding more and more that our ways of thinking are kind of coming parallel to each other and joining in different ways. So we thought we would today explore the role of the Bible, but not just the Bible, but the idea of the book itself as an object that we see sometimes in icons with Christ holding a book, or the way that we have the book in liturgy, we process it, we kiss it, we do all these things with the actual physical book. And what's the relationship between that, the physical object, its meaning, its participation in our liturgies and in our culture?"}
{"episode_id":"SW - #348 - 2024-07-11 - Seraphim Hamilton - The Symbolism of the Book","start":113.78,"end":114.2,"speaker":"Seraphim Hamilton","text":"And so."}
{"episode_id":"SW - #348 - 2024-07-11 - Seraphim Hamilton - The Symbolism of the Book","start":114.27,"end":116.11,"speaker":"Jonathan Pageau","text":"So, Seraphim, thanks for joining me."}
{"episode_id":"SW - #348 - 2024-07-11 - Seraphim Hamilton - The Symbolism of the Book","start":116.43,"end":118.03,"speaker":"Seraphim Hamilton","text":"Well, thanks for having me, Jonathan."}
{"episode_id":"SW - #348 - 2024-07-11 - Seraphim Hamilton - The Symbolism of the Book","start":118.43,"end":124.99,"speaker":"Jonathan Pageau","text":"So what's your. First of all, let's start. What's your take on the role of the book in our liturgical practice?"}
{"episode_id":"SW - #348 - 2024-07-11 - Seraphim Hamilton - The Symbolism of the Book","start":125.47,"end":343.65,"speaker":"Seraphim Hamilton","text":"So the interesting thing about the Scriptures, I think, is that they're not just a medium for communicating information in sequence. I think because we're so saturated by text, since the invention of the printing press, and especially since the rise of newspapers and the Internet, just mass print culture in general, we have started to lose focus on the book as an object with its own kind of sacramental significance. So even in relatively recent history, this wasn't totally lost. If you just think of the phenomenon of a family Bible, the family Bible functions as a kind of relic which passes from generation to generation and expresses the character of the family. It's something which binds each generation to its. The history which has preceded it. But today I feel like we come to the Bible and we treat it more as a text which is meant to simply communicate information. So you can, you know, write it on printout paper and that's whatever. But in the liturgical Christian world, clearly the Scriptures and books more broadly play a more central and different role in that. You mentioned that Christ is holding a book in most of the icons that we depict of him. If you think of what the orthodox liturgical world looks like, when you go to the altar, you have the sacramental table where you have the Eucharist, the Body and Blood of Christ next to the Gospel book. And the Gospel book isn't just something which is printed out on computer paper. It is richly adorned with iconography and things like that. So it itself as a physical object plays a key role in revealing to us, us, the nature and the glory of Christ. And there's so many different things that follow out from this. And I think when you go back to early Christianity, one of the most interesting things that you see is that early Christianity was quite distinct from the classical live in a intelligible constellation of ways. And one of those ways is the unique bookishness of the early Church. This is something that Larry Hurtado has done some really interesting work on. He points out that early Christians arguably seem to have been literate at a higher rate than their non Christian counterparts were. And this is a really significant fact when you take into account that the early church seems to have been a reasonable cross section of the Greco Roman society within which it lived. So, so if you have, let's just say 10% of the society is merchants, you can expect 10% of the early church to be constituted by merchants. If you have, let's say 30% of the society is dirt poor, well then 30% of the early church is dirt poor. So one of the things that distinguished the early church as a society within a society is its higher rate of literacy. And so what I want to suggest is that this has a profound symbolic significance which can be explained in terms of the map of biblical theology, the symbolism of text that we find in the Bible. And it has an explanatory role in telling us why tradition looks the way that it does, why we have such a thing as a tradition of the church fathers and so on and so forth. The textuality of the early church and of the Church more broadly is something we take for granted. But I think it's a hugely significant fact."}
{"episode_id":"SW - #348 - 2024-07-11 - Seraphim Hamilton - The Symbolism of the Book","start":344.21,"end":395.27,"speaker":"Jonathan Pageau","text":"Well, one of the things we see is for sure the, in the, the burgeoning Jewish identity. After the destruction of Jerusalem, the Torah seems to become the focus of the liturgy itself. You know, as they lose the Temple and as they lose the sacrificial system. Like if you go to a synagogue today, the, the closest thing to the locus of sakra, of sacredness, let's say, in a synagogue, is the. I forget how they go. They call the tabernacle with the, with the, the Torah inside that's, you know, handwritten and has a, you know, is sometimes even covered with a kind of cloth to, to veil it. And so there seems to be a, at least a parallel between the manner in which the physical book itself functioned in the, in Christianity and how it ended up functioning in Judaism."}
{"episode_id":"SW - #348 - 2024-07-11 - Seraphim Hamilton - The Symbolism of the Book","start":395.27,"end":685.2,"speaker":"Seraphim Hamilton","text":"I don't know if you thought about that. Well, I think that scholars will often talk about the difference between the Judaism prior to the destruction of the Temple and the Judaism which follows the destruction of the Temple in terms of an increased significance of Torah study relative to the Temple. So the Temple is the place where heaven and earth are linked together. It is the center of the world, since the entire creation is derivative from God's life in heaven, because heaven actually dwells in the Temple, that's where all creation flows out from. But with the destruction of the Temple and the exile of the divine presence, it is suggested that Jews had to turn to, to an alternative kind of spiritual or symbolic center. I don't think that's entirely false, but I think there is a specific reason why the Torah is ready made to take the place of the Temple. One of the things that we find when we study the Torah is that it itself appears to be a kind of textual tabernacle. It is a place where the divine name is woven into every letter of, of the text. So let's just think about what the Tabernacle and the Temple fundamentally are. What the Tabernacle and the Temple are, is they're a place where God's life, God's character, God's quality dwells with us. And because God's life, character and quality is the principle for the existence of everything in creation, the indwelling of his presence with us in the Temple constitutes a kind of exegesis of the nature of the world it gives us by giving us the divine name, the names or meanings of all created things. And that from the very beginning of the Scriptures, is never separated from the medium of the physical text itself. So if we think of what is actually put in the holy of holies, which is then the inner sanctuary of the Temple of Solomon, what is Put in the holy of Holies or texts, you have manna from heaven, you have the rod of Aaron, and you also have the Ten Commandments or the ten words. And then also you. There are various instances in the biblical narrative where we read about a prophet or a king depositing a sacred text within the boundaries of the Temple or the Ark of the Covenant. So obviously the paradigmatic example of this is the ten Words or the Ten Commandments, which is physically engraved by the finger of God and thus manifests and communicates his presence. But also we read about Josiah when he's renovating the Temple, removing an entire copy of the Torah from the boundaries of the Temple. And this is something which carries significance in the patristic tradition. So in the patristic tradition, the strictly canonical books of the Bible, of the Old Testament are those books which were found in the walls of the Temple. And that is because the Temple is an exegesis of all creation, because God's name dwells therein, and that the Torah, the physical text itself, is the verbal exegesis of the meaning of God and of creation. So if you look at traditional Jewish exegesis of the Torah, and I think that this is a right way to look at things, I think that what they're seeing in the text in many cases is really there. One of the most significant practices that they pursue is looking at the numerical values of certain words. So the divine name, The Tetragrammaton, the four letter name of God, Yad Hey Vav hey, has a numerical value of 26. And if you look at texts where the divine name as an idea has a special significance, it is consistently presented in a number of words, which is either 26 itself or a multiple of 26. So that sounds to a lot of people really, really kooky. And it's fine to be skeptical of it, just if you're hearing it for the first time. But I would encourage folks to pursue this in detail and look at the writings of guys like C.J. labusching, who has looked at the actual values, the number of words and letters in passages of the Torah, and you find that 26 really is woven through the whole thing. And then when you consider that Deuteronomy 12 and other texts speak of God's presence dwelling in the Temple in terms of God's name dwelling in in the Temple, then the idea that the value of that name is woven through the text itself has the significance of revealing the Torah and the Bible more broadly as that within which God's presence in some Sense flows and there's a whole myriad of implications that then can be cashed out from that, both in terms of biblical exegesis, but also in terms of Christian theology of the word name and so on."}
{"episode_id":"SW - #348 - 2024-07-11 - Seraphim Hamilton - The Symbolism of the Book","start":686.74,"end":735.23,"speaker":"Jonathan Pageau","text":"And so one of the things that happened is in the Christian. I mean, I'm curious because I'm not. I have an idea about this, but I'm not sure. One of the things that happened in the Christian century is the development of the book per se. You know, the moving away from the scroll and the development of the book as a, as an object, you know, and the move towards vellum as well, you know, to have you sheepskins to create these books. And so I don't know if you. Because the way we represent Christ, especially the Pantocrator as the judge of all things, we show him holding a book in, you know, not a scroll, although sometimes we show Christ showing a scroll, you know, in his hand. In some of the icons, do you see there's some kind of meaning to the actual shape? Like do you feel that you see some movement in that direction?"}
{"episode_id":"SW - #348 - 2024-07-11 - Seraphim Hamilton - The Symbolism of the Book","start":735.63,"end":1106.1,"speaker":"Seraphim Hamilton","text":"This is one of the things that Larry Hurtado really focuses on, which is that the codex, which is a bound book which resembles basically the shape of our modern book, while it exists in pre Christian times, it really was almost never used for actual texts. So essentially the codex was a medium for scratch paper. If you were taking notes in a class, you would use a codex. If you, if you're writing a diary or something or just writing your shopping list or the equivalent in the ancient world, you would use a codex. But it's Christians who pioneer the use of the codex or bound book for the actual embedding of their sacred texts. And this is a really exciting and interesting point. Now just to, just to emphasize how sharp the difference is, if you look at the second century, most of the codices that are found in the second century are of Christian origin. Now, in the second century, the early church was still a tiny, tiny sect. It was only in the third century that it began to be a force to be reckoned with, which the emperors really took notice of. But in the second century it was quite a tiny sect. And the vast, vast majority of texts that we have from the second century are pagan texts. But more than half of the codices that we find are Christian texts. This is also true across the Christian world. So even though the early church was very small, it was very widely distributed across the Greco Roman world. And the use of the codex as a medium for communicating sacred literature is found across the whole breadth of the Christian world. There are also other aspects to the physicality of the text which distinguish Christian literature from its pagan and sometimes Jewish counterparts. One of the features that we find in the codices, especially of the New Testament, is the use of this device called the nomina sakra. The nomina sakra, obviously, is Latin for sacred name. And what it describes is this phenomenon. When you take a Christian manuscript of the New Testament, it's almost always of the New Testament scriptural. You find that the scribe would abbreviate divine names with, like, you know, say, icxc. So where the New Testament says Jesus Christ, Jesus Christos, the scribe would simply replace that with icxc. We also find that the Christian scribes did the same thing for God and for often the Holy Spirit as well, which tells you something about their theology of God, but it tells you something about the way that they conceived their scribal project. So the physical text itself visibly expressed the distinctness of the early church both from the Old covenant and from its broader Greco Roman context. So I think you can look legitimately at the course of covenant history in terms of the transformation of history from a covenant that is centered on the scroll to a covenant that is centered on the codex. There's a few things that the codex does which distinguishes it in terms of its practical use from the scroll. The most important thing that the codex does is the codex allows you to store more text on this single medium than you would on the scroll. So we have books like in the Old Testament, the book of Samuel, which really is one book with a single literary structure. But we have first and Second Samuel because it had to be divided into two scrolls. By contrast, we have codices from the early Christian period, which are compilations of books. The whole set of the letters of Paul or the whole set of the four gospels and things like that. And what the codex allowed the early Christian scribes to do was take the books of the New Testament and arrange them in a particular order and present them on a wide scale for mass consumption. So true, mass consumption of literature really begins with the printing press. But I would suggest that we see a foretaste of this from the beginning of the Christian era because we read things like St. John Chrysostom in the fourth and fifth centuries, is encouraging. His audience, which is composed of normal Christians. They're probably mostly not super poor, but also not super wealthy. He says things like, you know, don't just believe what I say. Consult your scriptures. And that's just a striking statement. That someone in his age would make, because we would assume that really nobody has copies of them. There are things that get said which suggest actually they were being widely studied and consumed in, even in the home. And that relates to the origin of the codex, I think basically as scratch paper. The codex originates as scratch paper for relatively normal people. It doesn't originate as a medium for sacred literature. But the fact that the codex seems to take on in the early Church, a uniquely sacred character indicates something about the way in which the divine word has been communicated to us in the New Covenant. So in the Old Covenant, the only people who were really scribes were the. The king and his courts, the aristocracy, and then, of course, the priesthood. Who was responsible for teaching the word of God in the New Testament? Jesus says that yet once called you slaves, but now you're called children and friends because I have told you everything. The incarnation of the Word of God coincides with the revelation of everything that can be revealed concerning God. And I think symbolically that is related to the elevation of this scratch paper to sacred literature, which then expands the range of people who have access to the Word of God. So God becomes incarnate as a Jewish man from this obscure little town, from Nazareth, and in the process, he elevates the lowest form of physical writing to the unique medium for the scriptural text, text itself."}
{"episode_id":"SW - #348 - 2024-07-11 - Seraphim Hamilton - The Symbolism of the Book","start":1106.98,"end":1112.42,"speaker":"Jonathan Pageau","text":"Yeah, that's an interesting. That's definitely an interesting idea. And so."}
{"episode_id":"SW - #348 - 2024-07-11 - Seraphim Hamilton - The Symbolism of the Book","start":1114.34,"end":1114.78,"speaker":"Seraphim Hamilton","text":"Do you."}
{"episode_id":"SW - #348 - 2024-07-11 - Seraphim Hamilton - The Symbolism of the Book","start":1114.78,"end":1142.36,"speaker":"Jonathan Pageau","text":"What do you see, for example, in. In the. The Orthodox tradition, we do have a liturgical use for text. Like, there is a sense in which the text is to be treated with respect, venerated. You know, there's a procession in order to. To bring the gospel out during the. The little entry. And so how do you see that? Because it seems like in that case, the text is standing in for Jesus himself."}
{"episode_id":"SW - #348 - 2024-07-11 - Seraphim Hamilton - The Symbolism of the Book","start":1142.36,"end":1142.8,"speaker":"Seraphim Hamilton","text":"Like that."}
{"episode_id":"SW - #348 - 2024-07-11 - Seraphim Hamilton - The Symbolism of the Book","start":1142.8,"end":1147.28,"speaker":"Jonathan Pageau","text":"Yeah, that we. That we get that. It's. That the text is standing in for Christ."}
{"episode_id":"SW - #348 - 2024-07-11 - Seraphim Hamilton - The Symbolism of the Book","start":1147.68,"end":1154.32,"speaker":"Seraphim Hamilton","text":"Yeah. So if we look at the little entrance and we compare it to the great."}
{"episode_id":"SW - #348 - 2024-07-11 - Seraphim Hamilton - The Symbolism of the Book","start":1154.48,"end":1157.44,"speaker":"Jonathan Pageau","text":"You can tell people what the little entrance is, because they. They probably don't."}
{"episode_id":"SW - #348 - 2024-07-11 - Seraphim Hamilton - The Symbolism of the Book","start":1157.44,"end":1158.16,"speaker":"Seraphim Hamilton","text":"They don't know."}
{"episode_id":"SW - #348 - 2024-07-11 - Seraphim Hamilton - The Symbolism of the Book","start":1158.24,"end":1162.45,"speaker":"Jonathan Pageau","text":"People might not know. And so do you want to explain it? Like the two entrances?"}
{"episode_id":"SW - #348 - 2024-07-11 - Seraphim Hamilton - The Symbolism of the Book","start":1162.61,"end":1646.89,"speaker":"Seraphim Hamilton","text":"Yeah, yeah. So the Orthodox liturgy is divided, I would suggest, into basically three parts. In the early part of the liturgy, you have what's called the little entrance, and that is where the priest who has been standing at the altar, he's been facing God. So all the people face in the same direction. The priest takes the gospel book and he comes out from behind the iconostas, out to the people. And then he goes back up to the altar and he holds up the Gospel book and he says, wisdom, let us attend. We say, come, let us worship, and fall down before Christ. And then he goes up and he approaches the altar. Now, in the earliest period, the little entrance was actually the first time that the priest would approach the altar. During weekday services, he would stand at some distance from the altar, but during the Sunday liturgy, it was this moment in the service that he would actually approach that physical altar. Now, the great entrance happens in after the little entrance, and between the two, the priest or the deacon, usually, if there is a deacon, will read the Gospel. So he'll read the word of God out to the people. There will be an exposition of the word of God. And then very soon after that, after the exposition or sermon concludes, the priest will come out with, attended by the deacons and the readers and the altar servers, basically attended by everybody who's serving with him and is going to carry a the sacred elements of the Eucharist. So this is the bread and the wine which is going to be transfigured into the body and blood of Christ. And as he approaches up towards the altar, he prays or commemorates a whole variety of people. So the President of the United States, all civil authorities. And then at the end of that, he prays for people whose names are written down on this special piece of paper where people can write their names down to be interceded for. So these are two approaches up to the altar, which is then set with the Gospel book on the one hand, and the eucharistic elements, the bread and wine on the other hand. And these two approaches are different, but they're also closely analogous. This is the time in the liturgy where the priest makes this same kind of motion. And it's highly significant that on the one hand he's processing up with the Gospel book, which contains the spoken words of Christ, and on the other hand, he's processing upwards with the elements which actually physically are transfigured into the body and blood of Christ. So as you said, that suggests an analogy between the written text of the Gospel, which is the words of Christ turned into pen strokes and paper, and the eucharistic element. So the Eucharist is the body and blood of Christ. In another sense, the Gospel is the body of Christ. So you mentioned something which I think is very, very interesting. And it's something that I think we often just elide over when we think about what texts are again, because we're so used to computer paper, but even computer paper is made out of trees. It's just not as visible. Talk about sheepskin, right? What are we receiving when we receive the Eucharist? Well, what Orthodox and Catholics believe that we're receiving is we are receiving the body and blood of the Lamb of God. So we are actually taking that into ourselves. I think it's quite significant just in the providential course of history, that sheepskin is one of the materials on which these physical texts are engraved. And you can use. You can talk about this in terms of other media for texts as well. Right. Even computer paper comes from trees. We are writing on trees. What we're receiving when we receive the Eucharist is we are receiving the fruit of the tree of life. This correspondence between things that we eat and things on which we write is a significant correspondence. And actually this analogy is drawn upon and developed in a variety of different contexts in the Scriptures themselves. So in Ezekiel, chapter three, the prophet Ezekiel has just been called by God as a prophet. And what that means in the Old Testament context is he's been brought into God's courtroom, which is the temple, it's the palace in which God sits as king and dwells with his people as their king. He's been brought into that courtroom, and he's been made one of his court attendants and emissaries. So now Ezekiel has been invested with the particular authority and role of speaking out God's word to people. When he speaks in these contexts, it is God speaking. Well, one of the first things that happens after Ezekiel is given that role is God gives him a scroll and tells him to eat the scroll. He is supposed to actually eat the book and take it into himself. And it's because Ezekiel eats the book and takes it into himself that then through the rest of the story, he is able to speak it out to other people. Now, that's a dynamic which is not only present here, it is present in other contexts which are quite explicitly eucharistic. In Revelation, chapter 10. And Revelation has many, many connections with the book of Ezekiel. In Revelation chapter 10, St. John stands before the angel of the Lord. I would suggest that the figure in Revelation 10 who is called another angel is actually Christ himself. That's a bit of a different issue. But regardless of whether you agree with me on that, the point is clear that the angel gives John this book and he tells him to eat it with the specific phrase take and eat. And we're told in John, in Revelation, as we hear in Ezekiel, that the book was sweet as honey. A variety of things are going on in this context using these particular words. Take and eat is the Eucharistic word of institution. This is how Jesus brings the Eucharist before us, us in the first place. And in the Yohanin literature, John doesn't give us an explicit narration of the institution of the Eucharist. He knows Matthew, Mark, and Luke have already done that. But what he does gives give us is a myriad of images which express the mystery of the Eucharist to us. So this is one of them in Revelation, chapter 10, take and eat. And what's John eating? Well, he's eating the word of God. Well, especially in John's theology. What is the body of Christ? Well, the body of Christ is the incarnate place of the Word of God. Christ is the Logos through whom the world was made. He is the Logos who is expressed to us in the medium of writing Scripture. And he is the Logos who is presented to us in physical incarnate form in the Eucharist itself. And then when we read that the words which John eats were sweet as honey, well, that refers back to the taste of the manna in the. In. In the Hebrew Bible, while Israel was wandering in the wilderness, God gave them special bread from heaven which they called manna. And we're told in one text what this tasted like. It tasted kind of like wafers and honey in their mouth. So it's bread, but it also has this sweetness to it. And so when John and Ezekiel, when they eat the book, it is being said to be like manna from heaven. And this is significant in terms of the character of this reference in Revelation, because Jesus in John's Gospel speaks of bread from heaven being his own body and blood. So we have an example here of the way in which Scripture is just interconnected with everything. Every passage, in some sense, is interconnected with every other passage, but there's a logic to it. It's not just schizophrenic madness. See the way the images connect together, you start to get, I think, a sense of the coherence of the Bible in a way that really elucidates and nests together with our orthodox liturgical."}
{"episode_id":"SW - #348 - 2024-07-11 - Seraphim Hamilton - The Symbolism of the Book","start":1647.05,"end":1658.24,"speaker":"Jonathan Pageau","text":"I'd love to get your take on why, because I kind of have my thoughts about that, but I'd like to get your take why the book is sweet in the mouth, but bitter in the. In the stomach."}
{"episode_id":"SW - #348 - 2024-07-11 - Seraphim Hamilton - The Symbolism of the Book","start":1658.4,"end":1796.41,"speaker":"Seraphim Hamilton","text":"Yeah, yeah. So what happens after Revelation 10 there? And there's multiple dimensions in which this question can be answered, but what happens after Revelation 10 is John is going to prophesy concerning nations and tongues and kindreds of people. So it's a similar thing to Ezekiel, right? So Ezekiel eats the Word and then he prophesies. Well, John does the same thing, eats the Word, and he prophesied. There's an immediate sweetness to tasting of the Word of God. But at the same time, we are also told in the Scriptures that we are only glorified by suffering. And this is precisely what John sees in the visions which follow. The visions which follow his consumption of the Word of God pertain to the destruction of Babylon and the persecution of the Church. And I think we have another Eucharistic connection here which can more precisely give an answer to your question. Because in Revelation chapter, I think it's chapter 15, we have the great Harvest. We see the Son of Man sitting on his. On his throne, and the Son of Man orders the people of God to be harvested out. And this is another Eucharistic image we see in Revelation. If you look at the structure of the temple which is disclosed in the early chapters of Revelation, it seems to be evident that actually there's an implication that table of showbread is missing its showbread. It's an argument James Jordan and Peter Lightheart have made in their work on Revelation. And the kind of resolution of that discord comes in these later chapters of Revelation, where the Eucharistic harvest of the people of God is what sets God's table. And again, this is something which underscores the significance of what the Eucharist is. The Eucharist is about the body of Christ becoming our body as well. That's why we have relics of saints under the altar on which we set the Eucharist. It's Christ's body, it's our body because we partake of Christ's body. And so what John is seeing here is he's receiving the Eucharist, he's receiving the Word of God, but the Word which he receives is one about the suffering and persecution of the Church and their glorification through immense pain. So I think that's at least part of the answer. I don't, especially with something like Revelation, give a complete answer."}
{"episode_id":"SW - #348 - 2024-07-11 - Seraphim Hamilton - The Symbolism of the Book","start":1796.65,"end":1831.2,"speaker":"Jonathan Pageau","text":"What do you. Because one of my intuition was that it's related to the. Let's say, to the. The vinegar or the, you know, the bitter wine or the. That Jesus drinks before dying. And so it does connect to what you're saying, but it also makes this strange, this interesting connection between the. The book that tastes like bread and then the The. Let's say that ends up tasting, like, being like wine or like the vinegar that, that Christ drinks before dying and so related obviously to suffering. And this image of the bitter wine or the bitter waters that you see in the Old Testament."}
{"episode_id":"SW - #348 - 2024-07-11 - Seraphim Hamilton - The Symbolism of the Book","start":1832,"end":1854.7,"speaker":"Seraphim Hamilton","text":"Yeah, I hadn't thought of that connection, but I think that's probably a major part of what's going on here, because in John's Gospel, I would suggest to viewers that you can actually map out seven specific images of baptism in John's Gospel and seven specific images of the Eucharist. And I think one of those images is found in John 19, where Jesus drinks of the vinegar on the ground, the bitter cup."}
{"episode_id":"SW - #348 - 2024-07-11 - Seraphim Hamilton - The Symbolism of the Book","start":1854.7,"end":1903.25,"speaker":"Jonathan Pageau","text":"Yeah, definitely. All right, that's. That's super interesting. And so the, the image that you see in the way that when Christ is there with the. With the book, a lot of people always think that. That this is the. The gospel. But I. I think the better understanding of that book is that it's the book of life that describes revelation because Christ is coming back to judge the world. You know, that's the. That's the image that we see. And so what do you see as that? Me as that meaning? What do you think that that book of life is? You know, the idea of having your name written in the book of life and its relationship to the icon of Christ, especially that Christ is holding that book. You know, he's blessing with his right hand. He's holding this book of life in his left hand, you know. Have you thought a bit about the meaning of that, of that relationship?"}
{"episode_id":"SW - #348 - 2024-07-11 - Seraphim Hamilton - The Symbolism of the Book","start":1904.12,"end":2048.48,"speaker":"Seraphim Hamilton","text":"Yeah. So I think that having your name written in the book of life pertains to the things that Jesus has already said in revelation about. To the one who overcomes, one who conquers. I will give the name of my God, name of the spirit of my God, and my own new name. And so we are named with the name of Christ himself. And that theme of the name which indwells Christ has a biblical context going back to Genesis chapter one. The idea of naming always relates to the notion of the logos. So in the Old Testament, when Christ shows up, he shows up as the angel of the Lord. And the most explicit description that we have of the character of the angel of the Lord is found in Exodus 23, where God says, my name is in him. A name is what expresses a person's inner life. It's what expresses their character and who they are. If you even think of something like the meaning of names, they usually cash out some kind of quality. We call someone faith because we're describing them with this adjective of being faithful. Well, Christ's names are like that, too. And the New Testament uses this phrase. We're baptized into the name of Jesus Christ. So his name is engraved on our hearts. And I think what's going on in Revelation, we hear about our name being written in the book of life is in the same word that God the Father says to Jesus by the Spirit, I love you. Because we are named in him, because we share in that. We share in that very same word which God speaks in relation to His Son. And that's what a book really is. Right? A book is a word that is given so that it might be read. And what we see in Scripture is there's this promise of the new covenant where God is going to write my law on your heart. I think we need to take that as meaning something more than by nature. We will be inclined toward the good. I think part of what's going on when we read about his law being written on our heart is it's written on our heart in such a way that other people can read it so that they come to share in that name as well. So that's what I think is going on in the symbolism of the book and being named with the name of. Of Christ. I think the book of life, in a sense, has only one name in it, Jesus Christ. And we have that name engraved on our heart when we share in his life and call upon the name of his Father."}
{"episode_id":"SW - #348 - 2024-07-11 - Seraphim Hamilton - The Symbolism of the Book","start":2050.08,"end":2093.45,"speaker":"Jonathan Pageau","text":"That's interesting. I tend to see it. One of the things that I see in the icon of Christ related to the book is there seems to be a relationship between, let's say, direct influence and indirect influence. So when you seek. Because we don't have the Gospel of Christ, we have the four Gospels, right? There's a sense in which there's a, you know, that hidden behind the book is Christ himself. You know, the book is a kind of embodiment, but is multiple, right? It's not just like the one body. And so that is one of the ways that I tend to see the book is that something like a Christ is blessing. So that's a direct influence, right?"}
{"episode_id":"SW - #348 - 2024-07-11 - Seraphim Hamilton - The Symbolism of the Book","start":2093.45,"end":2093.93,"speaker":"Seraphim Hamilton","text":"He's like."}
{"episode_id":"SW - #348 - 2024-07-11 - Seraphim Hamilton - The Symbolism of the Book","start":2093.93,"end":2178.53,"speaker":"Jonathan Pageau","text":"He's speaking, he's saying, he's. He's blessing, he's cursing. And then in his left hand he holds the result of that as the. And you see that one of the. One of the things that gave me that insight was actually the icon of Pentecost, which is that in the icon of Pentecost, you have the Holy Spirit. From above, descending onto the apostles. And then you have the apostles filled with the Spirit. And then at the bottom of the icon you have this strange figure of cosmos that's holding scrolls, these 12 scrolls that are like, I don't know, the 12 written teachings or the 12 contained, like final body for the teachings of this. The spiritual. So I see a form of embodiment, you could say, see it that way. A form of kind of making concrete. And so that's also one of the ways that I, that I kind of thought of the idea of the names in the book too is the idea of, you know, this final gathering of the. The final counting, the final counting of the things that are part of the, of the body. So you gather all these, all the wheat, the chaff gets, gets taken, taken care of and the weed is gathered in the, in the, the barn. And I had this, this idea of also this gathering of the names in the book that are kind of like the final virgin, like an image of the heavenly Jerusalem also, as well like this kind of final square, you know, revelation of the. Of the Divine presence."}
{"episode_id":"SW - #348 - 2024-07-11 - Seraphim Hamilton - The Symbolism of the Book","start":2178.61,"end":2179.17,"speaker":"Seraphim Hamilton","text":"Yeah."}
{"episode_id":"SW - #348 - 2024-07-11 - Seraphim Hamilton - The Symbolism of the Book","start":2179.49,"end":2197.49,"speaker":"Jonathan Pageau","text":"And so that I've always thought that the, the shape of the book has to do with that, that it's not an accident that the book is a square, kind of like the Ark of the Covenant or the Church itself or, you know, the heavenly Jerusalem as this, you know, as the final resting place, let's say, of revelation, something like that."}
{"episode_id":"SW - #348 - 2024-07-11 - Seraphim Hamilton - The Symbolism of the Book","start":2197.89,"end":2451.84,"speaker":"Seraphim Hamilton","text":"Yeah, yeah, I think that's. That's true. And I think that connects with a lot of other things that books are linked with in the Bible. So when you think about what it means for something to be perfectly holy, perfectly consecrated to God, we take the raw material and it doesn't seem to have much order or structure. It's just a rock. Its angles aren't really related to any. To each other in any kind of visible or obvious way. Well, then you start working at the rock. You start turning it into a specific shape which corresponds to an idea or a form or you can even say a name. And when a thing is prepared, when it shows shaped and made beautiful and correspond with the lo. With the Logos that you have in mind for it, then that thing is prepared to be offered or consecrated to God in his sanctuary. It is prepared to come into its own as the final form for which it was intended in the beginning. And I think what we see in textuality in Scripture is textuality comes into being when a thing has come into its own. So when a thing has become what it's meant to be. Then it is written down or engraved. It is ready to be remembered by God, because God now keeps that thing in mind according to what it truly is. So one of the examples of this dynamic in Scripture, you know, would be the story of the ark and the flood. So Noah takes the raw material of the world in the Garden of Eden, you just have a bunch of trees. But the next time you see wood being mentioned is in the story of the flood. And the word for wood and the word for tree is the same. Noah takes these trees and he shapes them and he molds them into a very precise form which corresponds to the intention which God had in mind for it. And then that is the seed from which the whole world is reborn. So the only reason the world survives is because Noah, with God has made a miniature representation of a perfect world. And it's out of that perfect world that the Word is reborn. The world is reborn. And it is in Genesis 8:1 that you find the turning point of the story, which is that God remembered Noah and those who are with him. So God knew Noah to the core and then made a new world out of him. Well, that idea of memory is an idea which is connected to, you know, sacramentality in the Church, obviously. Do this as my memorial. Do this in memory of me, or memory eternal God. Remember this person in your kingdom, because if you keep them in mind, then they'll continue to exist as you know them. Well, books in Scripture and just kind of intuitively are linked intimately with this notion of memorial. So in Exodus, chapter 17, you see this. Israel defeats the Amalekites, and a curse is placed on the Amalekites which is going to last forever. And in order to perpetuate that, God commands that these events be written down in a book. And then that book is called a memorial. So the same terms are used for sacraments pertaining to bread and Passover and texts as well. And that's why I would suggest that you have these relics deposited in the Holy of Holies. The Holy of Holies is where God's eyes are always fixed. That's one of the phrases that gets used about the temple. It's the place where God is always looking. He's always paying attention to it. And in the Holy of Holies, you have these memories, memorials of the events of the Exodus which made Israel a people in covenant with God. That includes the texts, that includes the manna, so on and so forth. And so you put in the sanctuary those texts which represent the way that you want God to think of us, right? So we want God to think of us in Christ. And so in the sanctuary you have the revelation of God, the Logos in Christ. And I think that's the same kind of thing that we're seeing when we, when we have a book of life with our name in it. You can just see. The only other thing is. Is that occurs to me now is the, the specific kind of imagery that appears in early Christian texts like the Nomina Sakura doesn't really save you much space, but what it does is it gives the physical book a specific look to it. And that look is part of the point. It's part of what makes text. Not just kind of like an icon, but I would suggest in certain sense an icon itself."}
{"episode_id":"SW - #348 - 2024-07-11 - Seraphim Hamilton - The Symbolism of the Book","start":2452.32,"end":2509.99,"speaker":"Jonathan Pageau","text":"Well, one of the. So this is interesting, what you're saying is interesting because there's also. They always makes. When we go too far in one direction, always makes my mind go in the other direction, trying to find counter examples in my mind. But yeah, there's, there's an interesting idea, I think, about the manner in which the possibility of the, of the text being forgotten or not being. Or not being connected. Right. The idea of what St. Paul, when he talks about the dead letter and the, the problem of embodiment and the problem that happens when the embodiment is no longer connected to the memory. So, you know, the, the. The image to me of that is really the Ark of the Covenant. When it goes among the. What is it the Amalekites? Or is it the Amalekites? I forget. When the ark. Or is it the Philistines? Yeah, yeah, when the ark of the company goes. Goes out into the Philistines and it's no longer connected to the holy place."}
{"episode_id":"SW - #348 - 2024-07-11 - Seraphim Hamilton - The Symbolism of the Book","start":2510.15,"end":2510.55,"speaker":"Seraphim Hamilton","text":"Yeah."}
{"episode_id":"SW - #348 - 2024-07-11 - Seraphim Hamilton - The Symbolism of the Book","start":2510.55,"end":2617.2,"speaker":"Jonathan Pageau","text":"And then in going out of the holy place, then it becomes actually a. Becomes a space for death and curses and, and. And extra growth. You know, you could say it that way of parasites and extra growth. This kind of meaningless growth is a good way of thinking about it. And so there's always this way in which the. The outer shell, right, this, the written text and the way in which it can become a kind of fetish if it's not properly connected to the. To. I know you see that, right? You have the, the. What is it? Hocus pocus, you know, this idea of using the, the holy, the holy words in order to create magic or all these, these types of. Of using the text also as talismans. You know, you have all these practices of, you know, writing the word on a piece of paper and then holding it in talisman as a kind of magical protection. It seems like all of that is also possible with the question of the book or the question of. Of text. Yeah, especially, you know, if I. Because one of the things that has been fascinating me is the Phaedrus in Plato's Phaedrus has this whole image about writing, about how writing is a supplement to meaning and how it's a memorial, but it's also a forgetting. Or it makes it. It makes it so that the leg. The. The law isn't written in your heart. Right. So if the law has to be written in a book, it means that it's. It's not written in your heart. So it's. There's a kind of supplementarity to writing, which can also be dangerous once if the text or this outer thing is disconnected from its. Me. Its meaning and its purpose."}
{"episode_id":"SW - #348 - 2024-07-11 - Seraphim Hamilton - The Symbolism of the Book","start":2617.28,"end":2660.33,"speaker":"Seraphim Hamilton","text":"Yeah, yeah, I think that's a really good point. I think, you know, this is something that we see in all kind of theophanies in scripture. You know, a theophany can both fill you with words by which you praise God, and it can also just. Just knock you out so that, you know, you're just babbling. And, you know, this is something you see in the story of King Saul. Right? King Saul, he is overcome by the spirit and he speaks out, praise to God. That's when he's. That's 1st Samuel 10. He's given another heart. And then after King Saul falls, the spirit comes upon him again and he falls on his face and he's rolling around. You know, he's literally. And I think there's actually. I'm not just being funny here. He's a holy roller, like the spirit. The Spirit of God comes on Saul and he starts rolling around on the ground. I mean, there's something. Yeah."}
{"episode_id":"SW - #348 - 2024-07-11 - Seraphim Hamilton - The Symbolism of the Book","start":2660.33,"end":2673.69,"speaker":"Jonathan Pageau","text":"The tradition of. Of how the tower of Babel fell is that the spirit of God descended on it. That's what made it fall and made people babble. It's not like, you know, so. So that's an interesting. That. That duality is interesting to think about. Definitely."}
{"episode_id":"SW - #348 - 2024-07-11 - Seraphim Hamilton - The Symbolism of the Book","start":2673.85,"end":2696.42,"speaker":"Seraphim Hamilton","text":"Yeah. Yeah. It's a wind, you know, and you find that in a lot of traditions, you know, the languages are dispersed when a great wind comes and knocks the. Knocks over the tower or the tree and the languages fall out. And it's interesting. Pentecost, of course, it's the spirit. And we hear about a great rushing wind, fire and so on and so forth there. And I think perhaps this is one of the reasons that the scriptures Emphasize the actual consumption of the book."}
{"episode_id":"SW - #348 - 2024-07-11 - Seraphim Hamilton - The Symbolism of the Book","start":2696.82,"end":2726.7,"speaker":"Jonathan Pageau","text":"Yeah, that's right. That he takes the book and he eats it. So he makes it the inner. It's not just an external reminder, but it ends up being something which then is. Is integrated and then brought into the heart. I mean, that makes so much sense because that also explains in some ways what Christ is doing with the entirety of the law, which is to say, you know, it's like, it's not that I'm getting rid of the law, folks, or is that I want you to eat the law. Like, that's. We could see that. I want you to put it inside you."}
{"episode_id":"SW - #348 - 2024-07-11 - Seraphim Hamilton - The Symbolism of the Book","start":2726.7,"end":2727.06,"speaker":"Seraphim Hamilton","text":"Yeah."}
{"episode_id":"SW - #348 - 2024-07-11 - Seraphim Hamilton - The Symbolism of the Book","start":2727.06,"end":2733.8,"speaker":"Jonathan Pageau","text":"Once it's inside you, then it's generative. But if it just remains outside you, then it could be dead letter and a bunch of rules that don't make any difference."}
{"episode_id":"SW - #348 - 2024-07-11 - Seraphim Hamilton - The Symbolism of the Book","start":2734.03,"end":2786.99,"speaker":"Seraphim Hamilton","text":"Set. Yeah, yeah. And. And this is actually. I would suggest to folks that this is a big part, if not the part of what the ritual law about only eating animals, which chew the cut is about. The Torah uses this language about the word of God is in your mouth and in your heart. And so you can only eat animals. They're always moving their mouths. They're always chewing it up. They're swallowing it down and then bringing it back up, which is what you see in Ezekiel and John and so on and so forth. And to be honest, I think that there's a lesson here in some of the ways that I think Catholic and Orthodox apologists can illegitimately invoke the Bible as kind of a talisman, like, we gave you the Bible. But, you know, you got to actually read it. You know, you actually have to study it. You know, it. We gave you. The Bible is not a good apologetic to Protestants if you've never, you know."}
{"episode_id":"SW - #348 - 2024-07-11 - Seraphim Hamilton - The Symbolism of the Book","start":2786.99,"end":2788.11,"speaker":"Jonathan Pageau","text":"Actually don't know it."}
{"episode_id":"SW - #348 - 2024-07-11 - Seraphim Hamilton - The Symbolism of the Book","start":2788.11,"end":2788.79,"speaker":"Seraphim Hamilton","text":"Go into it."}
{"episode_id":"SW - #348 - 2024-07-11 - Seraphim Hamilton - The Symbolism of the Book","start":2788.79,"end":2807.43,"speaker":"Jonathan Pageau","text":"Yeah. More than you do. It's like, you have to. My brother uses the exact same image. He says we have to ruminate. Like, that's the. That's our job. You know, you. You can't just. It's not just the text. You have to let it sit and let it turn. This kind of inner turning where that's when it yields fruit. Definitely."}
{"episode_id":"SW - #348 - 2024-07-11 - Seraphim Hamilton - The Symbolism of the Book","start":2807.43,"end":2809.91,"speaker":"Seraphim Hamilton","text":"Definitely. Yeah. Yeah. Wow."}
{"episode_id":"SW - #348 - 2024-07-11 - Seraphim Hamilton - The Symbolism of the Book","start":2809.91,"end":2824.22,"speaker":"Jonathan Pageau","text":"This is really. This is. This is very. This is very good, Sarah. I think it's a good place to stop, you know, like, bringing the. Bringing the law into your heart is a good place to go. And so where can people find your work?"}
{"episode_id":"SW - #348 - 2024-07-11 - Seraphim Hamilton - The Symbolism of the Book","start":2824.62,"end":2872.32,"speaker":"Seraphim Hamilton","text":"Yeah. So I am@YouTube.com Kabain K A B A N E But you can also just Find me by searching Sarah from Hamilton, which is my channel name. I try to produce videos relatively regularly. There's stuff that's being worked on right now that's going to be released soon. Also, I post five times a week at sarah from hamilton.substack.com Half of those are just available for everyone. Half of those are available to those who sign up at $5 a month. And you can five times a week. So lately, I mean, full disclosure, the past month I just had my firstborn so I haven't lived up to the five times a week standard. But there's a lot of back backlog stuff. There's. And now what is it?"}
{"episode_id":"SW - #348 - 2024-07-11 - Seraphim Hamilton - The Symbolism of the Book","start":2872.32,"end":2876.52,"speaker":"Jonathan Pageau","text":"Is it Bible commentary? What are your five posts a week?"}
{"episode_id":"SW - #348 - 2024-07-11 - Seraphim Hamilton - The Symbolism of the Book","start":2876.84,"end":2936.77,"speaker":"Seraphim Hamilton","text":"So most of it is Bible commentary. A lot of it represents my kind of step by step work through Genesis 1. So right now I'm writing a book on Genesis chapter one and the interconnections that it has with the whole rest of the Bible. Because the Bible is cumulative. The symbols that you see in Revelation have been developed in a systematic way from Genesis. So when God speaks a word and the earth responds by producing fruit trees and grain plants. That is why the prophets represent the union of God's word with creation in terms of an agricultural harvest that starts there. The gathering of Israel. Well, that language of gathering first appears in terms of the gathering of the dispersed waters. That was my last poetry. So this is an exploratory journey for me. I'm super excited to find all of this stuff in the text. So I post a lot on Genesis 1, but also a lot of other biblical subjects."}
{"episode_id":"SW - #348 - 2024-07-11 - Seraphim Hamilton - The Symbolism of the Book","start":2937.49,"end":2953.09,"speaker":"Jonathan Pageau","text":"So yeah, everybody check it out and stay tuned. We'll probably see more of Seraphim on on Symbolic World YouTube channel as we as we kind of develop this discussion and collaboration. So Seraphim, thanks for your work and people make sure to check his work out."}
{"episode_id":"SW - #348 - 2024-07-11 - Seraphim Hamilton - The Symbolism of the Book","start":2953.65,"end":2954.53,"speaker":"Seraphim Hamilton","text":"Thank you so much."}
