{"episode_id":"SW - #252 - 2022-09-14 - August 2022 Q&A","start":12.08,"end":6342.43,"speaker":"Jonathan Pageau","text":"This is Jonathan Peugeot. Welcome to the symbolic world. Hello everybody. As you can see, the quality of my camera is not as great and I'm not at my house. The reason for that is a little complicated. I'm actually at my parents house so hopefully this will work out okay. I'm a little worried because. We'll see. I had a little bit of technical problems trying to kind of get this set up here, but. But hopefully we will be fine. All right. And so the first thing I need to talk about is I definitely need to apologize for all of you who are subscribed to the website. We had some major login problems. You know, we're working with a company that is hosting the website but they don't seem to have found exactly what the issue is. They thought it was a small issue and it turns out it's actually. It seems like a big issue and so apologies for that. Hopefully some of you will have had time to send your questions to Lisa. I know she posted something on the website with her email in the hopes that people would, would post, but I'm seeing that there are only six questions from the website and so. Yeah, so that is not a good sign. It means that probably, probably a lot of you weren't able to just send in a question. So apologies for that. And so on top of that, there's a bunch of stuff going on. Do not forget that starting this September on the. It starts on the 14th or 15th September, I'm going to be in Thunder Bay with Paul Vanderklae and John Vervaeke and a few other people. Yeah, we're going to have a few days, a conference and some time together. So don't forget about that. Hopefully those who want to come, you've already signed up. What else is there? There's a bunch of stuff. Don't forget also that what we recorded with Jordan Peterson on Exodus is going to be coming out in November this year. So it's gonna take a little while before it comes out. I might prepare some Exodus material of my own at the same time to kind of supplement that. Supplement that, that, that workshop. So. Alright, so let's see. So Ivan Engel in the chat asks. I promise this long question is challenging and worthwhile. Okay. How do we save the margin without fetishizing it? I mean, you usually just leave it alone or you laugh, you know, regarding the margin. That's probably a good way to deal with it, you know, and not make it your main emphasis. Alright, so as people know, if you. For people who support me at $10 or more. You get to ask questions in advance in the Q and A and then I will also answer questions in the chat. So we're going to start with the website. Cromack Jones asks hi Jonathan, how in your view does the interplay between the one and the many itself interplay with the kinesis between being and non being? That may require a book length response, but hey, at least it's a brief question. Thank you ahead of time for subjecting yourself to a Cheers. And so you could say that there's a. If you understand it relatively, it's probably a good way to understand it. That is let's say there's relative non being. Of course we don't really have access to non being per se, you know, let's say kind of the primordial chaos. But we do have access to something relative non being. That is that something that isn't the identity, right? You could say it that way. Is that which is not the identity of what it is we're talking about. And so you know, the way that something relates to non being, there's two ways. One is that the one is the non being manifests itself as potentiality and it manifests itself as a question, you could say, and so non being will answer. It manifests itself also as a kind of specific. So you can understand that. Let's say to increase your body yourself, you have to take something which is non being to you, that is not you, and then you have to bring it inside your body. And that is how you continually produce body. That's the probably one of the best ways to understand the relationship between being and non being is that non being presents itself as a question to being. And then being explicit. Explicit, explicitates itself. Is that even a word In French we would say sexplicit makes itself explicit into the question. So that is probably the best way to understand it. Then you can also understand it even though you imagine a country. So you have a country with people. And so then there are people on the outside. And those people on the outside ask something like what about us, right? And then the people on the inside can either integrate them, but they also have to hold them off, hold them at bay to a certain extent. Because non being or the outside always is more than the inside. And so it can take over. And you could say that that's how something dies, is when the outside, let's say, comes in and then levels everything to a kind of, again a kind of potential or a kind of flat particles that have no Commonality, you could say. All right, so I hope that's a good example. A good, good explanation. In your recent so David Flores asked, in your recent interview with Jordan Peterson and Greg Hurwitz, the conversation revolved around his role. To what degree do you think someone needs to be self aware of their role to embody? It feels like too much self awareness would lead to inauthentic embodiment. Yeah, that's a good point. Especially if it's something like an informal role that Jordan has played, let's say. So like a policeman has to be aware of his role, or a judge or whatever. Anybody who has an official role definitely has to be aware of their role in order to embody it properly. But in the case of Jordan, I understand what you mean, which is that we wouldn't want him to start imitating himself and become like a caricature of himself. And so in a way, I think that what we were doing, and hopefully what we were doing, is pointing to something like what we see as the highest version of himself, the version of himself which has the best effect or has the most positive effect on the world. And so maybe that's the best way to think of that. But I see what you're saying. You can see that, which is with like, especially in the entertainment world, you can see musicians like that where they kind of become caricatures of themselves and they think that they're playing some kind of cultural role. See that with actors too. So Bernarda PM asked hello, I'm a new subscriber, but I've been listening to the podcast and YouTube videos for a while. Your content is wonderful and a blessing to all. Please continue your great work. As for the question, I'm listening to your various videos on the resurrection of Christ. However, in the Christian Mass credo towards the End, it says that we believe in the resurrection of the body. It does not appear to refer to Jesus resurrection, as that is mentioned earlier in the credo, what body is referring to. So I don't even know. Like in the Creed we say that. We say the resurrection of the body, we say the resurrection of the dead. At least that's what we say. The life of the age to come. We say that Christ rose again according to the scriptures, and then we say that we believe in the resurrection of the dead. But I don't have a problem with the resurrection of the body either. Clearly the resurrection that the Bible is talking about is a resurrection of the body. Now what exact type a glorified body is maybe the way to see what it is. And so it's not easy to fully understand what that means. But it seems to be something like a body which does not have the kind of resistance that the gross material body, the way we experience, like, let's say the fallen body has. And so something like bodies of. You know, in the Church, Father, they talk about the garments of light. So something like bodies of light, not light in the physical sense, totally. These are just images to help us understand what that can mean. For sure, St. Paul, when he talks about the different kinds of bodies, he's clear that there are various. There are different kinds of bodies and that there are subtle, more subtle bodies. You could say, you know, that's how a lot of the Church fathers understand angels, is that they have subtle bodies. And so you can understand. Let's say you can understand how angels have subtle bodies. Actually, probably an easier way to understand how angels have subtle bodies is a demon, actually, just because we always understand it more easily, sometimes in the way it goes wrong for some reason, because of our nature, I guess, or fallen state, we kind of understand it more easily when it goes wrong. And so you can understand that. Let's say a demon that is the principality of a. Of a passion, of some parasitic process in people. So let's say the demon that is responsible for, let's say, for sexual desire, let's say whatever. Then you can understand that their body is subtle because their body is an influence on other bodies. And so they don't have the physical bodies, but they do have a body because they have a discernible manifestation in the world. You can kind of see it being manifested. It's not just a completely invisible pattern. And so that seems to be what is referred to as subtle bodies. Now, whether. I don't think that the way that the resurrection is described, it's not clear exactly what exactly the body of the resurrection is. So I don't know, because it's not clear. But it does seem to be something like a transmutation. It doesn't seem to just be a gross body, because it's like, if you can imagine a body that doesn't decompose, not in a vampire way, but in the sense of something which does not have residue and does not. I think that that's probably the best way to understand it. I sometimes think of something like a subtle body as something like a story. A story as a subtle body. St. Paul talks about spiritual bodies. So I don't know. I don't know exactly. But for sure it's clear that there is a resurrection of the body. That's clear in scripture. But exactly what the nature of that body is, I don't have the right insight on that because it's also something which I think is also meant to be somewhat mysterious. The way that I tend to understand it for myself is to understand that there is a manner in which we exist in fullness. You could say there is a manner that if you would take all of everything together, like all of you, and then all of your effects, and then all of your effects, effects on multiple generations, you know, even your descendants, in terms of how they kind of come out of your womb, let's say, come out of your bosom. The way that it talks about in Scripture, that's the idea of the bosom of Abraham. And so it seems that there's a manner in which we can kind of conceive the way in which you exist in totality, that everything about you and every corollary and every effect that you have and that, that. That existence can be conceived of as something like outside of sequential time or something like at the end of sequential time. And then that is probably the best way to kind of understand the resurrection, that is in the end, when everything ends. There's a manner in which you exist in your totality. That totality is manifested. It's judged, you could say. And that includes the body. The body is part of that. The body is not absent. You're not just an idea, right? You're not just a thought. You're not just your thoughts. You do have embodiment. But I do think that embodiment probably includes something like what you've said, your works, your, you know, the things you've done in the world, the love you've had of others, your children, or the love you've had for your children. That's probably also what it means by your body. That seems to be at least the way that I understand it. But yeah, so, all right, so hopefully I just didn't make everything completely more obscure to you because you're definitely asking what the resurrection is, is not a something that is. I don't know, it's probably something I probably shouldn't talk about at all just because we can have glimmers of it and insights about it. But I don't understand it. Caleb, what do you know about games like magic, the Gathering? And how should conscientious Christians approach game that fantasize pagan religious practices? Is simulating something that would be wrong in real life, always wrong in itself. And so I don't really know much about the magic and the Gathering stuff. I don't know. Like, it's interesting because, like, the Dungeons and Dragons stuff, let's say. I know when I was a kid, there was a big deal about Dungeons and Dragons and how bad it is. It was just interesting because Dungeons and Dragons obviously is like a grand, great grandchild of Tolkien, and so it's fascinating that it. It has been so demonized. So, yeah, sorry, I don't have an answer to you. I don't know. I'd never. I've actually never played that game. All right, so a pauper asks, what is the meaning of feeling depressed? What place does it have in the Christian life? Thank you, a popper. So what is the meaning of feeling depressed? I mean, the meaning of feeling depressed means that you don't have energy or you don't have will or you don't have direction. And so, you know, some of it, sometimes it can just be. I mean, it can be a kind of family. The best way to understand it would be something like a family curse in the sense that it's something which is in your family and is either physically inscribed in, you know, in your genetics or whatever, or inscribed in your story. I mean, I think that it's something that everybody kind of goes through. It's somewhat inevitable. I think that it's probably actually in those dark moments that our faith can sometimes be that which carries us through because we don't have the will in ourselves. We could say to continue or to keep going up that hill. So, yeah, and I want to be careful about what I say, because I don't want to. I mean, I would say if you're depressed, like, if you're seriously depressed, you need to go get help, you know, talk to your priests, you know, or find someone who can help you. All right, so Ramau asks. Hi, Jonathan. Could you elaborate on the symbolism of peacocks and its relationship to pride, the Far east, immortality, and the Fountain of Youth, Tree of Life? So the. The symbolism of peacocks has to do with glory. You know, that's what a peacock represents really, is glory. And so because of that, it, you know, because the peacock, let's say, shows its tail, and its tail is decorated and is. And is flamboyant and glorious. So that is really, in a way, it's kind of an image of glory, especially because it's the tail as well, because it is this kind of external, like this external part of the bird, the last part, that residue or that remainder we've talked about. And My brother talks about this in his book as well, that there is a relationship between, let's say the crown and the tail, between that which is the extreme. And so I think that that's what it represents. And so of course, because it represents glory, then it can also represent pride. And that is also its connection to immortality. Because there is a relationship between the idea of the garment of light. We talked about this idea that your glory, your crown, is that which will follow you or let's say, will bring you into immortality. And so the idea would be that if you, when you see these images, like Persian images of peacocks drinking from the fountain of Life, for example, or being around the tree of Life, I think that it probably has to do with that, the positive aspect of glory, something like being in the garden and having glorious bodies. That's probably what it is. All right, so we're already on Patreon, so, you know, so we've got a lot more on Patreon. Maybe people send theirs to others, I don't know. So sorry again for the people on the website. All right, so Patreon Manuel Montiel asked, are there any plans to do universal history on Mesoamerica? I understand this may be difficult as the New world was entirely cut off from the Old world. And so I think there might be an interesting thing to do about Mesoamerica. But I think we would probably do it really from the point of view of the, of the Europeans in the sense that that's also the way in which we understand universal history. And so. But it would be interesting because. So for example, when Christopher Columbus arrived in, in the Americas, the first day he said he saw a dog headed man. And then the second day he said he didn't talk about that anymore. So that's interesting, right? In terms of understanding this relationship with the, the fully other, like the fully strange, let's say. So I would be interested in maybe talking a little about that. We've mentioned a few times how the relationship between the American empires, especially, you know, in South America, Central America, that it was really like in the manner in which Apocalypto shows it, like it was the end of a world. It really was the end of their world. They were like encountering that which would bring about the end of their world in terms of the wars, but also just in terms of disease. So this encounter with the absolutely strange in their case ended their world really is the only way to see it. And so it would be interesting to talk about that. But in terms of how mesoamerica fits in universal history. I think we'd have a very difficult time because, like you said, because it was not known or wasn't talked about, though there are interesting images of saints, stories of saints that go west in English lore, English legends, a saint to go west and find an island there. So Brandon Burns in the comment says it's the glorified body in the New Jerusalem. And so, yeah, you're right, that's what it is. But, you know, it's easy to say that and not understand or not have any sense of what that entails. Like, what are we talking about? It's not easy to understand, for sure, the New Jerusalem. The description of the New Jerusalem as being made of precious metals, of having, you know, pearls for doors and all this stuff seems definitely to be hinting at the idea of a glorified city or a city that is. That is more than just like. More than just like the kind of gross, opaque stones that we say, that's shining, it's full of light, it's shining. And, you know, so. So it seems like there's probably something about the idea of a glorified body that has to do with that in terms of imagery, let's say. All right, so Kenan Wang asks, in the Temptations, Christ refuses to tempt God by exposing himself to unnecessary danger for the purposes of performing a miracle that provides his divinity. But later, he seems to deliberately delay his aid to Lazarus specifically for the purpose of proving his divinity. Do you have any thoughts on tempting God in the context of these two stories? Perhaps it has something to do with the intention in which one purposely enters death. Yeah, that's an interesting idea. Well, for sure. Like, the one is for himself and the one is for an other. That is a big difference. And the one would be just to save himself, and the other would be. Was done, you could say something like, for the glory of God. Right, to manifest the glory of God. And so that might be the difference. But there's something. Yeah, there's something about, you know, the idea of tempting God that I find interesting for today, which is like, even myself, like, I find myself asking God for all kinds of things, as if God is more like, you know, like your waiter or your servant rather than the supreme cause of all things, and, you know, the one who holds the universe in himself. So there is something about that which is making my relationship with God about me, you know, so there's something about that, and I think we all kind of fall into that, of course. Like, what does it give Me, what does it do for me? Hugh Rose asks. I've been spending some time on the beach and I've been thinking about its symbolism. Obviously it is a peripheral space and has features that you would expect. Sandcastles, temporary structures formed by inverting a bucket sand itself. Stone reduced the multiplicity. Yeah. The breakdown of the rules about wet clothing. It is accessible to wear. Indeed. Having features. The carnival. You're totally right. And you play in the water, you know, and you also like get carried by the waves and stuff. You're right. Yeah, that's good. Good call. I need help understanding the symbols of getting a suntan to become more desirable or becoming sunburnt. It is interesting that sunglasses are also associated with cool. Is the suntan related to ornamentation? Why are protections, reactions to sunlight associated with desirability? I've never thought about that. It's a really. It really is something to think about. In terms of the idea of, let's say the clothing, you're totally right. And in terms of the idea that on the beach is like an exception. So you can be nearly naked on the beach and then you can go back home and you know, there. There isn't a direct. There's like a taboo which protects those spaces. So if you wore what you wear on the beach in a store. Right. It would be totally scandalous at a church or whatever. But on the beach it has its place and it has a kind of function as a little moment of breakdown on the side of the water. Like the idea of the sand is really good insight and it's a great insight for sure. The sunburn stuff is interesting in the sense of extremes, you know, with the idea that it's like the nakedness of shame. Right. I've talked about this. Well, it's not shame, but it's like it's related to the nakedness of shame. Although it's. It's not. It's fine to go to the beach, but it's not. It's not the nakedness of glory. It's a nakedness of the edge, something like that. And so. And it's also. So it ends up being something like the extremes where you're more exposed to the sun because you take your clothes off. And so it has to do with how the extremes kind of play off with each other. That if you. That if you push too hard on freedom then you run the chance of being. It's a. Having a more top down tyranny at some point. So def. I think it definitely has to do with Extremes and how extremes need each other and manifest each other. The idea of sunglasses representing cool probably has to do just with the idea of you being able to see others and others not being able to see you. That it is. It's a kind of power. Wearing sunglasses is a kind of power where nobody can see where you're looking, but you can see everything. Why is it association with desirability? And there's probably a really simple answer to this, but I can't see it right now. Good stuff. Definitely be thinking about that. So Aaron Gazoo asked. Hi, Jonathan, My left eye is weaker than my right, and when I'm tired it wanders off to the side. What is the symbolism of a wandering left eye? And what would that. What would be that of the right eye? Thanks. And so I think the best way to understand it is to understand that the symbolism of the wandering eye is actually the left eye. Like, no matter which eye it would be, it would have something to do with the left eye, the left in general, the idea of awkwardness, or some of the old words, like in French, for example, when we use the word gauche, we can say that someone is gauche, meaning left, related to the idea of being awkward. And so it's like. It's like crooked, right? So the idea is that the left is crooked, it's off center. You could say the right is related to towards the center, the left is related to off the center. So for sure, a wandering eye has to do with. With exactly that. It has to do with. So what happens with, with the wandering eye, which is interesting, is that the eye wanders and so the relationship between the two gets confused. Right? So you actually aren't seeing the same things from both eyes. And so that confusion actually leads to, let's say, an overcompensation from the eye that's straight to ignore the other eye. And so then what ends up happening is that the wandering eye kind of vanishes because it's not straight. So it's interesting to think about that in terms of symbolism, of how, you know, the left wanders. But let's say if it, if it wanders too far, then the right will overcompensate, will try to bring things back to normal. All right, so I'm here to now ask, what is the symbolic difference in portraying the crucifixion with nails through the wrists versus the hands? I've seen it portrayed both ways. Why do it one way or the other? Well, the only reason I can imagine for portraying Christ as being crucified through the wrists would be something like, you're a modernist, you're a materialist, you're a historicist. This idea of Christ being crucified through the wrist is like some 18th or 19th century, probably German. I don't know who it was. Some scholar religions who really wanted to show the historicity, you know, like how everything was really historical and how historically would have happened. And so came to the conclusion that you couldn't nail someone through the hand because the nail would just rip through the hand. And so therefore it means that Jesus was crucified through the wrist, which is, you know, whatever the symbolism, being crucified through the hands is very powerful. The idea of being crucified through the wrists is just a little bit irrelevant. So I'm not a big fan of that stuff. And also because when I see it, it's just all it just. For me, it just manifests all of what I dislike about kind of 19th century demythologizing or like this kind of historicizing version of the Bible that I find most of the time misses the point. Kind of like Jehovah's Witnesses, you know, who says. Who say stupid things like, Jesus wasn't crucified on a cross. He was crucified on a post. And so it's like, okay, whatever, man. It's like being crucified on a post, I guess. I mean, a cross has definite meaning that has been carried through two millennia of a vertical and a horizontal of, you know, of the stretching out of the hands. There's all this symbolism related to the cross. And so when someone tells you, well, you know, historically it would have been too expensive to build a full cross. So there's really. When it says across, it's just a post, and it's like kind of nonsense. So I really. I really dislike that. All right, so Gogo asks. In a recent interview with Lex Friedman, Jordan Peterson said something along the lines of, we will need to descend into hell first in order to reach paradise. But didn't just go down to death and defeat death so that we would. We would be liberated and not need to go down to hell ourselves. Would this not mean that we're already liberated and paradise awaits us when we are ready to let go of our sins? What is your take on this? And so for sure, I would say, like, I understand, like, Jordan is not. Jordan has really good intuitions. Like, he has great intuitions, but he's not necessarily, let's say he wouldn't understand the difference between death and hell, or like death and Gehenna you know, which is confused all through. All through history, which is fine. But there definitely is a difference between the idea of death or hell in that sense and then the idea of the river of fire. We could say that we find in. In scripture there's a difference. They're related. They're definitely related, but there's a difference. But I think that the idea that we descend into hell before we reach paradise is something that all Christians do. It's called baptism. You know, it's part of descending into death is something that is part of. You know, when it says that those in the Orthodox church, one of the major troparia is, you know, to those who have been baptized into Christ, who put on Christ. We have been like St. Paul says, like, if you have been baptized with Christ, you have died with Christ, you have risen with Christ. And so there's a sense in which we participate in that death and resurrection. But it also doesn't mean that there isn't a particular aspect of what Christ did universally. And so the idea that sometimes you have to go through to hell in order to come back up, you know, is something that happens all the time, right? It happens all the time. And I think that for sure, in terms of if we're talking about what's going on now in the world, it seems like we're moving towards the death of something. Is it the death of the West? Is it the death of just America? Probably no, because Europe is really in trouble. So it's like we're kind of moving towards the end of something. And so it seems, at least in the Christian story, that that's something that in some ways is bound to happen. And so we have to. We kind of have to be ready for that. So. All right. So Marcus Shara asks Jonathan, have you ever watched the David lynch show Twin Peaks? Many minutes of it are classic murder mystery drama, but there's also many mysterious spiritual elements playing in the background. You have thoughts on the symbolic themes of the show, I. E. The black. No, I. I've never watched Twin Peaks that just. And not. Never really not interested in that stuff. I don't know why exactly. It was kind of like Lost. I remember watching lost the first one or two seasons 10 years ago, I guess, or 12 years ago, and maybe more than that 15 years ago. Anyways, it doesn't matter. And then realizing really quickly that this was a lot of. It was kind of like not total nonsense, but really was. Was not really was trying to be deep and mysterious, but seem to just kind of Be made up as you go along. And I felt that from Twin Peaks, although people might criticize me, but I felt that from Twin Peaks and people that talk to me about Twin Peaks and the stuff in there. I'm like, really? Okay. It just seems like a bunch of weird idiosyncrasies pasted together. So Josh asks. Hello, Jonathan, hope you're well. I've been seeing a rise in the production of ar. Yeah, in the last month. It's been nuts. Been crazy to watch people, like in the last one month or month and a half, like to watch how the AI art has been just exploding everywhere. Curious as to what it was I looked into and it seemed through the creation of AI generated artworks utilizing keywords you type into the engine to set the parameters of the image. What particularly stood out to me was the fact that you write the image. I get the impression that it is almost an inverted form of icon writing and that it is rooted in a kind of self deification. I would love to hear your thoughts on this. Thank you for your time and any thoughts we're able to share on this. There's definitely something about those AI generated images which is uncanny. Valley, for sure. Like, some of it is extremely impressive. Like, you look at it and you're like, wow, this is crazy in terms of detail, in terms of. Of the mood, in terms of the lighting. But there's always something about it, which is weird. Like, there's something uncanny valley about it all the time, which is that, like, the faces are like, they're always a little off or sometimes a lot off, especially in the less powerful ones. Like, if you use Dall? E Mini, you can see, like, the faces are kind of off, but some of them are. I forget what the names are, but some of them are getting pretty. Are pretty incredible in terms of the detail and even what they get. But there's something uncanny about the images that they're producing. There's something which is always, like, you could say in fluidity and ambiguity. And so let me give you an example. Like, people have posted things like posted images like, you know, the Kingdom of Heaven or ascension into Heaven. And it's like when you look at it, the first glance you get, it's like, wow, it's impressive. It's light above. It's like a mountain. It's like this spire that goes up and there's something that looks like a cross at the top with light and everything. And it's kind of impressive, but if you just pause a little and you look at it you realize, well, that's not really a cross. And it's like those wings on the angels. They're not really wings. They kind of look like wings. They're not really wings. They're impressive. It really is ambiguity, the power of ambiguity. I don't know what to say, but probably because the AI doesn't know what it's doing, right? It just. What it does is that it's just aggregating images and keywords from databases and so has like, a sense, like, almost like a blind sense of what these words and images are related to. So. But it is something to definitely keep watching. It's going to get more and more. It's gonna get better in terms of detail, and it's gonna get weirder. It's gonna get scarier because you know what's coming next. It's gonna be like, AI produced videos. So, yeah, it's scary, I think, but it's still. It's still fascinating. It's definitely fascinating. So Maximus Magyar asks, what is the symbolism of prohibiting priests from dancing? Hmm. I don't know. I don't know. Someone says, I skip Charlie's question on accident. Some questions aren't there. Like, we have people that go through the questions and edit them down. So they're. So there's about 50 or 60 top, so that I don't go over, like, two hours. So if sometimes your question doesn't get through, it means that either it's a question that's been asked many times before or it's. Sometimes it's too ambiguous, you know, so sorry if that happens to you. So what is the symbolism of prohibiting priests from dancing? It's like, I don't even know where that. Is that from Scripture? Like, I don't think I've seen that. But, I mean, I can kind of understand that. It's like, it's just in line with St. Paul saying things like, you should. You shouldn't joke, right? St. Paul says that, which is like, okay, wow. Like, you shouldn't. You shouldn't make light. You shouldn't joke. You know, it's kind of like saying, Christ never laughed. I get it. You know, it's never gonna happen in the sense that I can understand the prohibition of it, but there's also kind of overflowing, you know, so. But a priest dance like a priest, at least in theory, they dance like Orthodox priests. Because we have this one dance. There's one dance during the. During a wedding which is, I think, called the Dance of Isaiah. Is that right? Somebody can correct Me if I'm wrong. There is a dance in the Orthodox wedding. Of course, it's not much of a dance anymore. People just kind of hold hands and kind of walk from left to right. But nonetheless, even though it's very tame, it is still supposed to be a dance. So. And I can understand why people were uneasy with it and ended up taming it. Taming it over millennia. But I'm sure, sure a thousand years ago people actually really danced. All right, Matthew F asks, I am curious about the symbolism of particular places in scripture. A lot of locations example Seshem, Bethel. Repeat through the key stories. Some places have more obvious roles Egypt. But others seem more subtle. Have you ever seen, seen the treatment of the symbolic world of geography and scripture? I'd love to hear your thoughts about this topic and any suggested resources that could help illuminate these questions. Yeah, definitely. This is definitely important. Often you can discern the symbolism of a place by its name, you know, and so was it Bethel means the house of God. And then Bethlehem, I think it's the house of bread. And so you will find Jerusalem is the city of peace. And so you will find in the names of the places, sometimes you'll find a relationship. There's also more to that. Like it would be a good idea. In Matthieu's book he talks about, for example, the difference between Mount Sinai and Mount Gerizim and how those two mountains are kind of like two poles, let's say evil hierarchy and divine hierarchy. And so the image of the Holy land, Egypt, as you said, plays a clear role in terms of the stranger and in terms of the place of riches, but also of enslavement, you know. Yeah. So I think it probably really depends. But for sure Matthir's book talks about it. I'm sure even if you looked online you could find just look up the names of the places and you can get a sense of what the different places mean. So Ajafka asked, could you please elaborate on the pattern that culminates with the Eucharist being the real blood and body of our Lord. I understand many aspects of it, but fail to see the cohesive H whole and how it relates to my day to day experience. So probably not supposed to talk about the Eucharist. I think I probably talked about it way too much in the past. How does it relate to your everyday life? Well, first of all, there's the idea that your daily life functions through memory and so everything you do is connected. So let's say you are doing homework when you're doing homework. You are connected by memory to your purpose, because you're not in your purpose. You're connected to your purpose. So memory doesn't just function backwards, it actually also functions forwards. Because you can forget your purpose if you're. I don't know, you're running towards the store and all of a sudden something happens to you and you forget why you were going there, right? So you have to remember things. So memory is something like the building block, one of the building blocks of experience. And memories scaffold like they scale up. And so. So let's say, you know, I'm remembering why I'm doing this Q and A. But then let's say I'm remembering why I'm doing this Q and A. Because I. Because I want to be in contact with my. My patrons, with the people watching me. I want to give them a little more access to. To my thought and be open to questions, blah, blah, blah. It's like that the memory into that is also linked to another memory, which is something more like, let's say, the vision I have for what I'm doing, the mission that I have or whatever. And that mission should remember and should be connected to an even higher version, which would be something like participating in the Kingdom of Heaven, something like that. And so it's important to understand that in some ways, your life functions through the memory of these different levels as you do things. And so the Eucharist is presented to you as something like perfect memory. So it's the idea that the memory is so perfect that it is both identity, fully identity, and also non identity at the same time. And so you could say the Eucharist is actually eating the blood and body of Christ. There's no doubt about that. But it is also being in church and eating bread and wine, and those two realities exist completely. And so we say something like. So you can say it this way, he gets to something like, the bread and wine is the body and blood of Christ. So if you say it that way, you're both asserting identity and difference at the same time. Complete identity and complete difference at the same time. You could say that that would be the culmination of how memory works, and it would be the source of. So Christians believe that it's the source of reality, that it's actually the secret source of things is found in communion. So a lot of. I know now secularists are gonna just be like, jonathan is just talking about magic again. But the memory, that's how memory works. And the idea is that there's also the relationship between identity and sacrifice, which I've talked a lot about. The idea that identity functions through sacrifice, functions by giving itself. So a way to understand your relationship to your purpose is memory. Another way to understand your relationship of what you're doing towards your purpose is something like sacrifice, which is that you're taking your best and you're giving it up towards something above you. And at the same time, you're also, let's say, casting out the scapegoat at the same time. So say you're writing a book, you're gathering all these gestures in, and you're giving it towards the higher purpose of writing the book. But you're also not eating celery. You're not trying not to be distracted and write something else besides your book. You're trying not to do other things. And so you actually have to cut off things and you have to send out something on the outside in order for you to exist. And so the idea of memory, sacrifice, ritual, all of this is gathered together in the Eucharist. And there's so much more. Like, I could just talk about this all night, but hopefully that gives you a little idea of ways in which the Eucharist binds your experience. So, yeah, but it's never going to. I'm never going to be able to exhaust it for you, because that's why it's not an explanation. That's why the Eucharist is a participative act. And this is also something which is sometimes frustrating when you're dealing with talking about these difficult subjects, is that these subjects are participations and intuitions. And so when we try to explain them, we never really capture what it is we're trying to explain. That's obvious. It's inevitable, but that is just how it is. And so the way that I try to do it is I try to jump around and, like, you'll say run around the thing and then point towards it in the middle. But I can never really just show you the thing unless you do it yourself, unless you participate. So Ben K. Asks, can you describe what the experience was like the first time you walked into an Orthodox church? Did you walk in on Sunday? Sounds intimidating. How would you recommend someone looking to join go about doing it? The first time I went to an Orthodox church, I'd been actually reading for like a year and a half. Like, I've been reading Orthodox theologians, I've been reading about icons, studying icons, studying all this. And then I felt like I couldn't just walk into a church. I felt like I needed an inn somehow. And it was really difficult at that time. So I asked around people I knew. And I had a friend who was teaching Greek at McGill University in the theological, in the theology department. And he said, well, I know an Orthodox guy, you know. And so I said, really? And he told me, yeah, he goes to an English speaking church. So I asked him if he could introduce me. So he introduced me to this person who is now this person who brought me to the church for the first time, who is actually now a professional theologian who has acquired a certain amount of fame for himself. And so they invited me. This person invited me to church. We met a few times, went for coffee, discussed, discussed, and then finally I went to church. And it was actually during Lent, and it was during what's called a pre sanctified liturgy. And the pre sanctified liturgy is an evening service where the host is pre sanctified. So there's no consecration during the liturgy. But we do take communion. Obviously I didn't because I wasn't Orthodox, but there's. The presanctified communion is a pre sanctified liturgy, is penitential in its tone. So there's a lot of bowing on the ground and we do these prayers of repentance. And so I walked into the church and it was dark and it was all candles and had this really serious aspect to it. And then people started bowing to the ground. And I just found it really beautiful and engaging and very profound. So. Well, the first time I walked into a church, that was it for me. I pretty much knew I was going to become Orthodox, but I'd also been reading for a year and a half. So I would say the best way to go about going to an Orthodox church, it depends on your personality. You could contact the priest first, try to find a church that's in your language. Considering that there are churches in all kinds of languages, if you can find a church in your language, maybe try to contact the priest, tell them you're going to come so that they can maybe greet you. But if you just want to show up, you can also just show up. I mean, no one's going to. People will figure out pretty fast that you're not. You're not Orthodox. And so because of that, they will probably extend courtesy and understanding if you don't know what to do and you're just kind of, you're a bit lost. But it's best probably to contact the priest first if you want to do that. So Leon says, I recently watched your video on heaven. As a response to Sam Harris, when you spoke about how some figures become principals, etc. And I was left wondering if you could explain, expand your view on eternal life. You would just join to the principle or principality body of Christ, I assume, or how do you think about this? So there is a difference between going to heaven and the resurrection of the body. Let's say these things are not the same going into heaven. I really do think it is this ascension. It's this ascension into. Into a participation into the council of God. It's the capacity that humans have been given to become like angels and to be a part of the great chain of being that links God to the world. Now, in that sense, we do have to become part of the body of Christ. We are a member of the body of the Messiah, We're a member of the body of the anointed one, member of the body of the one who unites heaven and earth, right? And we are anchored to the place, to the cross. We're anchored to the place where heaven and earth were joined together. And so all those things are some ways to kind of understand we must be part of the kingdom of heaven. We have to be under the rule of heaven and participate in its. And ascend into heaven by becoming, let's say, lower rungs in the King. Not lower rungs, but like levels of principalities in the kingdom of heaven. So that's what I think that is. Now, the notion of eternal life, at least when Christ talks about eternal life, he seems to talk about something like the fullness of life, like a life which springs completely, like a life which is full and is not limited, is not limited by time, is not limited by space. A life which is. Which is complete, you could say. And so I think that that's probably the best way that I would understand eternal life. And the idea is that you don't get eternal life after you die, right? You get eternal life. You have access to eternal life now. You have access to the kingdom of heaven now. And that's things that. These are things that Jesus says himself. Like, it's not. I'm not making this up, but there's a manner in which, in the fullness of things, you know, when all is revealed and all is gathered together in the end, then we will also experience the fullness of that. But that's as close as I get to like, giving you an explanation. If you want me to give you like, a mechanical, physical explanation of what that will be or what that is in terms of what happens to you after you die. You know, I think the, the images that the church uses in terms of understanding the idea of a judgment after you die is a really great way to understand it. I do believe there seems to. I think there seems, at least in my understanding. This is speculation on my part, but I think there is like almost like an identity between personal judgment and cosmic judgment, that your end is the end. Right. It's like when you die, it corresponds to the end of all things. And so there isn't this sense because people always ask, okay, so if the saints are dead and Christ has not returned and we haven't reached the fullness of things, the pleroma or whatever, then how is it that we can pray to them? Like, are they already in the kingdom? What is going on? And I think that if we understand that all ends coincide, that the end of each thing culminates into the end of all things, then it's not as bothersome. Right. You could say that they are answering your prayers from the kingdom, they're answering your prayers from the eschaton. Because in a way, the eschaton is the end of things, is always there, hidden, you could say, in the world. It's not just something that's happening in the future. Yeah, so sorry, man. Why you guys are asking really difficult questions that I think is going to just confuse everybody. Let me look into the chat a little bit. Yvonne Engle asked, what is the relationship between the divine darkness and the divine feminine? Does it allow partitioning of identity by obfuscating the rest? I don't know. The word divine feminine is just a weird expression. I know Jordan Peterson uses that. Yeah, I don't see that expression anywhere in the Fathers or in the tradition. Divine feminine. I mean, there is this idea of Sophia a little bit that people talk about, but it's always kind of iffy and a little off key, like. Yeah. So the man founded Sarah goes to ask. Hello, Jonathan, thank you for your work. What is the symbolic importance of those who give body to an ideology party? Ultimately, being consumed binds once it is ascendant or fully formed. Thinking of Marxists and gulags are getting purged. Is betrayal a special punishment or is it just how egregores work? Maybe both. It seems egregores need your attention until they are embodied enough to eat you, then they just eat you. So I think that the best. Like when we talked about with, with John Revecky, we clarified a little bit some of the terms because people are using these terms a little. I mean, we're Using them pretty loosely, because we're trying to understand, you know, what it is that transpersonal intelligence looks like, or what it is that these transpersonal agencies look like. So the idea would be to understand this type of thing where an ideological as akin to, as an obsession or a passion, as akin to a parasitic process in yourself. But then at a social level, which is that the parasitic process seems to devour everything until it exhausts, like a parasite devours the prey until it consumes it, and then itself will die or itself will have to find another host. And so that seems to be the opposite of, let's say, the body of Christ, or the way in which bodies stack up in terms of the individual, in the family, in the community, in the nation, in the church, in Christ, how those actually build up each other, and that the one is the building blocks of the other, so that, you know, healthy individuals are the building block of healthy families, and healthy families are the building blocks of healthy communities, et cetera, et cetera, et cetera. That the ideological bodies, the ones that go like the way that Marxism went, is that they devolve and they self, they eat themselves because they're not, they're not giving up to another good. And so they tend to actually devour their own participants. And it has to do with revolution. A lot of it has to do with revolution. That if you understand how Marxism and a lot of these ideologies are revolutionary, which means that what they do is that they try to take power for themselves, like they're related to pride and revolution. So you have, I don't know, the bourgeoisie. And then the bourgeoisie says, you know, these aristocrats, they should be our leaders. We should just get rid of them and take their power. And so you, you have something below that removes that which is above and then takes the place. And so in the normal hierarchy of beings, the ones that I talked about in terms of individual family, etc. You could say something like legitimacy flows from above, you know, so you get your name as a person from your father, you know, and then the family is legitimized by higher participations in higher order beings. But in terms of this, what happens? Because you have self legitimacy, where someone takes power for themselves, then they don't have legitimacy from above. So the only thing they can do is to then consume those below them or be consumed by those below. So it's like, think about it, right? So this is actually Marx's vision. So you could say something like, the aristocrats kill the king, the bourgeois killed the aristocrats, then the proletariat kill the bourgeois. And so it's this revolution. But if you want to stop it, the only way to stop it is you have to purge everybody below you. So this is seen in the story in Hesiod's Theogony, for example. So Cronus castrates his father. He becomes the head God, and then what does he do? He eats his children because he knows that now that he has, his legitimacy is gone. Then he's the next. He's next in line. They're coming to castrate him too, or to kill him. And so he has to devour his children. That is how parasitic processes work, is that they don't build towards higher participation. And so they. They move into chaos and tyranny. They tend to move towards chaos and tyranny. All right, Matthew Mull, Brandon says. Hi, Jonathan. Do you think secular architecture or urban form, how cities are laid out, has real importance to the RE Enchantment project? If so, what are one or two things you could change in modern cities? So, yes, I definitely agree. And, you know, I think that what's interesting is that there are people that are thinking about that now. I'm actually. I collaborate a lot with someone whose name is Andrew Gould. You've probably seen him on my channel, if you've been paying attention for a little while. Andrew Gould is a building designer who lives in Charleston, and he works with other contractors and designers to create what's called the New Urbanism, which is a movement towards a rehumanization of the city by making buildings that are only a certain height, by making walkways, by having centers like parks and places of meeting. You know, there are a lot of ways in which these New Urbanism people are working. There's a book that was written by. I think it's published by Princeton. It's called Charleston Fancy. And it looks at this project, this project of kind of New Urbanism, of creating new neighborhoods. So, for example, the first church that Andrew Gould built is in a little neighborhood called Ion near Charleston. It's not in Charleston, but it's just a little outside of Charleston. And in this neighborhood they created, the developer wanted to have a church, for example, wanted to have something like at least one church and have something like centers. He also made the streets extremely narrow so that cars would have to let each other pass in the street. And you think that's really annoying, but what it forces you to do is to constantly be in contact with others because you can't have people parked. And two Cars crossing. If people are parked on the side, then you have to let others go and you have to kind of move across. And so all these little things were done to. And you see that in the South. I saw quite a bit of that in Greenville, for example, they redid all of the downtown area. They removed the overpasses, they opened up the downtown to walking. They made a massive park near the river. And it works, right? It creates a kind of. So I think that these are small steps, but I think that for sure, if we're moving towards re enchantment, there will have to be a rethinking of space at a human level. Yeah, except for the dark re enchantment. That one's gonna happen on the metaverse. They'll create something like that in the metaverse. You know, human scale, architecture and community when you're wearing your glasses. But then when you take them off, you'll be living in a pod. Right. And you'll be eating the bugs or whatever. Alright, so Blake Strait says I'm officially part of the body. I took orthodox communion this past Sunday. Congratulations, Blake. It's good to hear that. Glory to God. Quite an experience that you were partly responsible for. Thank you. Well, all I can say is glory to God for that. What is the relationship between the blood of Christ and the Holy Spirit? It seems that if the blood is what gives the body life, that one could say that the Holy Spirit is the blood running through the body church giving it life. I know they are different, but I do not understand where the difference lies. Thank you, brother. And so you're right, there is definitely a relationship. You know, in the scripture it says that the blood is the spirit of the body, that blood is is the life of the body. And so there is definitely a relationship between the spirit and the blood. But I wouldn't never heard of a technical relationship. But I definitely see that there's an analogical relationship for sure. So Nicolas says, why is the Bible written as text only? It's fine for the storytelling part of it, but when we get to the list of rules about the sacrifices, list of lineages and instructions on how to build an artifact, then some spreadsheets, graphs, architectural drawings or illustrations could really help. Why do we start using images only after Christ's resurrection? I mean, I would say that in a way it's not completely. So yes, the Bible, but it's like the Hebrew tradition was not just the Bible, it was also the actual temple itself and the tabernacle and the practices. And so the practices are described in the text. But they were alive in the people and in the traditions. And so you could say, like in the scripture. The description of a cherub, for example, in scripture is difficult. But I'm sure people knew what a cherub looked like back then. They knew when it said. Sometimes it says some kind of ornament or some kind of thing, and people just knew what it was because they lived in that world and they had that understanding. And so I think that that's what it is. I think also because text is. How can I say this text is more easy to transmit and to remember, because you can transmit it more closely to. You don't have to ask yourself so much, like, what is the detail and what is tradition? Whereas images are more flexible. Like, there's a lot more flexibility. So there seems to be a lot about that. But for sure, also the fact that we use images after Christ's resurrection has to do with the incarnation itself, because they are. For sure, there are prohibitions against images in the Old Testament. Of course, they were images, but there definitely is a suspicion and some prohibition against some kind of images in the Old Testament. So that's one of the reasons why Christianity is far more imagistic than the Bible. So Brandon Burns says. Any thoughts on why people are choosing more traditional forms of worship? Example, extraordinary form of the Roman rite and Catholicism, Orthodox liturgy. So, I mean, it's interesting, I guess some of you saw that video. I didn't watch the. I watched his clips of it. That video of. It's the name of that actor. Sorry, guys. That actor that converted to Catholicism. Yeah, it shows you how much I really care about these things. But anyway, so these major actor that converted to Catholicism and he talked about right away went straight to like, you know, Latin mass and everything. So I think that it's because, you know, one of the problems that's happened in the past century is that the churches have tried to accommodate the world. They've tried to say, well, let's get closer to the world so that we can gather more people, have more influence. But what happened is they actually watered everything down. And then people started to see less of a difference between their boring life, going to the club or hanging out with their friends and going to church. And so the idea that church was a space, the reverence that God is supposed to cause in us, like the sense that God is above us, that we are participating in something so much greater than us and so much more. So much more lofty than us, is lost in the guitar. Church services in the Rock concert, church services. So I think that people, it's like, if I'm gonna go to a concert, why would I go to church? I mean, they're not as good as the rock concerts. I might as well just go see, you know, see a rock band instead of going to church. So now I think that people are realizing that, wait a minute, like, if I'm going to be a Christian, like, why would I, Why would I want to. Why would, why wouldn't I want the most. The most of it? Like, why wouldn't I want the one that has the deepest meaning and has the most interrelationship and has the most. As closest to its own worldview? That is the closest in expressing Christianity as a worldview, not just as a bunch of moral tenets or as a bunch of sentimental relationships, but as a way of being in the world and of participating in how the world lays itself out. I think that's the intuition people have, and that's why they're going towards traditional Christianity. And I think that most people, at least that I know that convert to Catholicism will go there. And I think that that's possibly one of the reasons also why people convert to orthodoxy. So. Right. So Middlehamed Ali asks, hi, Jonathan Boswell, what are your thoughts on dating apps in our current environment? Do you advise Christians to use it as a means to meet a significant other? And so I would say no, I do not advise Christians to use it to meet a significant other. But if it happens, then that's fine. You should be happy. Like, I mean, if that's, if you meet people online, that's fine. Like, I think, I think it's. The whole online thing is difficult, but especially the apps, because the apps are. There's a consumer aspect about these apps which is just so disgusting. And so it's like if a Christian wants to meet their wife, but they're like consuming pictures of girls and picking them, it's like, my goodness, there's something about that which is a difficulty. But also I understand people suffering because there's less and less of an opportunity to meet people. People are becoming more isolated. So I would say soft. No, but sometimes you do with what you can. Right? You do with what you've got. So. So Ross Alexander says, could you please further define marginal infringe as it relates to the upside down world that you've talked about many times on your podcast? What does it look like? And how do we know if I'm, if I'm acting marginal or fringe? Kind of like the frog in the proverbial pan of cold water that gets heated up, I get complacent in what I see and things that are not normal become normal. And so now the first thing to understand is that when I talk about the fringe and I talk about the exception and I talk about the marginal, it's not a strictly moral thing. It's not as if it's just center good, fringe bad. It's not as simple as that. You know, the center has its danger, which is pride, and the fringe has its danger, which is dissipation. And the center has its strength, which is origin, which is meaning, which is. And the fringe has its advantage too, which is something like the question, the multiplication, you know, the particular. And so the question is rather how to act in this different circumstances, like you said, how not to be possessed in a bad way by the situation. So, so, like I've said, like, in some ways there's a time for the carnival. It's just that you have to be careful not to confuse the carnival with like, there's time to eat dessert, but you have to be careful not to confuse dessert with the meal. If you confuse dessert with the meal, then you're going to get sick and you're going to throw up, right? It's like that. If you want a nice little image of the fringe, throwing up is an image of that as well. So the marginal looks like the strange. It looks like confusion of identity, mixture of identity. It looks like humor, upside down behavior. It can look like bodily stuff, body stuff, all the way to scatological humor and all that kind of stuff. So all that is part of the fringe of the margin. Yeah, the clown. And so the idea is, I think that for sure, right now, because the fringe is so prominent and is like, is so overwhelming, it is really dangerous to be dissipated into it. So we, we definitely should arm ourselves against the dangers of the fringe right now and we should be able to find purpose, right? That's why Jordan Peterson is so successful, because he says, meaning, you know, purpose. That's how you get out of it. Responsibility. These are all nice little images of the center. Responsibility, meaning, purpose, direction. These are the things that will heal you from, you know, the excessive turning that we're part of. But at the same time, you also have to be careful not to become prideful and overly, overly harsh. And so that's something that I see, I think, in the kind of rad trads right, the radical traditionalists that you see also, both in Catholicism and in orthodoxy, is that in a normal and understandable reaction to the clown world. They move towards something which is, let's say, totalizing and is dangerous in terms of pride. So hopefully that helps to understand. So Brandon Bailey says. Hi, Jonathan. Hope as well. Is there a meaning behind the Holy Spirit being said across the horizontal plane when crossing yourself? I mean, you could. I mean, I think that this is. I really hate doing the trinitarian theology, but you do see some theologians who talk about how God the Father, the Son and the Holy Spirit is, you know, the. Something like the bond of love between the Father and the Son. You kind of see that in different theologians. Something like that. Maybe that. That can help. So it's like the Father above, the Son below, and then the Holy Spirit connecting them together. But this is totally speculation on my part. I've never thought about it enough to really give you a good answer. Sorry, guys, I'm getting like, exhausted more quickly than usual. It might also be because it's like really hot. So Abe asks. Hi, Jonathan, I'm wondering if you have any thoughts on the topic of animal suffering. Not suffering inflicted on animals by humans, but rather the physical pain and mental anguish that animals experience in the wild due to violence, starvation, illness, loss, fear, etc. How do we understand this if animals were created or evolved before humans and the chance to bring death into the world with sin? I understand that it's a question that many have struggled with, including C.S. lewis and the problem of pain. Any thoughts you have are much appreciated. So what I'm going to say is actually, like, is really like pure spirit speculation on my part and something I've been thinking about quite a bit. And it's related to. So Saint Ephrem the Syrian describes paradise in a way, where you have the mountain of paradise and then you have the wall of the garden, and then below the garden are the animals, and they're outside of the garden. And if you read St. Gregory of Nyssa, what you'll see is that there's a direct relationship between the fall and the garments of skin and animality. And that animality, at least in St. Gregory of Nyssa, seems to be a symbol of death, the hairy garment of death itself, of dying, of being a slave to the lower things, a slave to the passions, a slave to all of this. And so there seemed to possibly be in this story an intimation of death already there, or a possibility at least, because if God says to Adam and Eve, if you eat of this fruit, you will die. I mean, he's saying, if you eat this fruit, you will die. So death had to have been understanded somehow by them. And so, yeah, so these are the things that are mulling around in my mind. Sorry, I'm not coming to a direct conclusion, but there seems to be at least some possibility in my vision that there's a relationship between death and outside the garden, at least already. And you see it in the Church Fathers. So sorry if that's not clear enough, but I don't have a full solution to that. I'm just kind of thinking out loud right now. So Wyatt Lawrence says, what is the symbolism of the separation of church and state? I mean, it's interesting to think about it, and it's interesting to think also of the differences between the way that the Western society did it and the East. And the east did it. So in the seventh Ecumenical Council, for those who don't know, the seventh Ecumenical Council, people think that it's mostly about icons, that it's mostly about the restoration of icons. And in some ways it is, at least in the more. More external way we celebrate it. But the seventh Ecumenical Council is also about the liberation of the Church from the state, because until then, an iconoclasm was driven by Byzantine emperors. So Byzantine emperors were the ones who imposed iconoclasm on the church. And this comes as a kind of culmination, we could say, of emperors meddling directly in church affairs. And so when the seventh Ecumenical Council arrives, one of the things that is declared in the council has a lot. Some of the things that have a lot to do with how the church is independent from the emperor or the state, that the church has its own capacity to make decisions. Now, at least in the Byzantine Empire, that separation did not mean full and complete separation, as in not talking to each other. Right. As in like divorce. Right. So it's like the separation of church and state didn't mean divorce. It meant, like a husband and a wife, like two separate people with their own. With their own needs, desires and goals that could work as a symphony together towards what they had in common. And so that is the way it was conceived of in the Byzantine Empire and then in the Russian tradition as well. So that's a difference. So it's different than what we see in the west, where at some point it becomes not only a divorce, but like a bad divorce, Right. Where the. The emperors and the. The German emperors and the popes are fighting. And, you know, we have three popes at some point because the. The king of France wants his own pope and it's like, woof. Yeah. So So X Perez says. Hi, Jonathan. I was wondering if you saw any correlation between Old Testament category of nephilim and our modern status of celebrity. Both seem to direct attention to themselves as objects to be worshipped. It is merely a difference of scale or is there more to it that I'm missing? P.S. i just got God's Dog in the mail and I just wanted to say excellent start to the series. Pray that God makes straight the way before you and the rest of you, the team and I look forward to hearing news about the next issue as soon as you are able to. So thank you. X or Z Xavier or X Perez? So, just before I answer your question, so a lot of things have changed in the God's Dog situation. My goodness. I probably will have to make an announcement to the supporters that supported the first book. Most of the books are delivered now unless you are in Europe. If you are in Europe, you sadly still have to wait because we're struggling with some tax issues and it's super complicated because it seems like we shouldn't have to deal with them, but we are dealing with them. So because of that, we're looking for solutions and the shipping company is looking for solutions to be able to send our books there. So that's one. The second is that Cord Nielsen, who is the artist in the first book, finally decided that it was too risky for him to quit his job and to do this. You know, he has health issues in his family and it's just, you know, it's really hard in the United States, you don't have health insurance. So it's something that kind of made him hesitate and also made it that his needs were probably too high for what was possible in terms of working full time on the book. So we were caught a little bit wandering and not knowing what to do. And so we asked around and we tried to figure it out. And so finally we did find a new artist for God's Dog, too. His name is Matt Sheehan. You can look him up online. He has worked for Dark Horse. He has a more kind of he's an American, but he has a more European drawing style. He's also orthodox and he goes to the same parish as Jacob Russell. Those of you who've been in Symbolic World for a long time know who Jacob is. And so. So it's cool. It's going to be very different. His style is very different. Took it took a while for me to kind of like, all right, to work with him and to see how we can make it happen. But it's Going to look more like a kind of old school adventure comic. It's going to be more realistic. It's going to be more realistic, less cartoony. So, yeah, I'm really looking forward to seeing what he puts together. But his style is very detailed and like I said, it's more realistic. So it's going to take a while. So sadly, we're looking at probably a year before we get it done. But it's definitely part of this is something that I'm not giving up, guys. Like, I'm gonna keep hounding at this, you know, we're gonna keep doing it, we're gonna get it, we're gonna get it done. So, and, and all of you who got the book, do not forget to scan the QR code and get your God's dogecoin. You know, oh, man. Jamie, who programmed this, did an amazing job. Like, the experience of getting your God's dogecoin is beautiful. It's like super slick. There's an amazing little video that looks at the symbolism of God's dogecoin made by symbolic memes. There is, you know, it's like, there's. It's hilarious. It is hilarious. And you have that nice little God's dogecoin in your wallet with 7,777 coins. So it's a lot of fun. And, you know, and within the next year, we're going to start to think of things we can play around with to create something that we can pull our coins towards. You know, maybe, you know, a story that's broken up so people have kind of pull the pages or something. I'm still thinking about it, but. But we're gonna have some fun with those coins, so. So don't forget to do that. All right? And so I need to answer your question now. So what is the relationship between Old Testament, the Nephilim and modern status of celebrity? There's definitely a relationship in the sense of the gods, right? In the sense of the. That's why we say they're stars, right? That's why we say they're idols. We actually use those terms to talk about them. And so they've become like guiding lights and people align themselves on them. And so in some ways, they really are like the kind of degenerate or really low version of the old God. So if you look at. Watch like a Beatles concert, right? And it's like when you look at what happens, what has happened during a Beatles concert and like women losing their senses and like becoming ecstatic and. And like, you know, ending up, you know, shaking on the ground, crying. I mean, it looks like something from a Greek tragedy, right? It looks like the women in the forest, you know, in the Baki. Like the women cavorting in the forest, like, that's what it looks like. And so there's definitely something related to that. But it is a very lame and pale version of a religion. These celebrities, it's. It's pathetic. But yeah, I mean, people need gods, right? It's like if you get rid of them, they're gonna turn into Johnny Depp or Mick Jagger. It's like David Bowie or whatever. It's pretty pathetic. But, you know, that's where we are. So Sean Rigaldo asked, I was reading a conversation you had with JP Morceau about the danger of symbolism and being overwhelmed by meaning. Can you protect yourself from becoming overwhelmed by symbolism? How can you protect yourself by becoming overwhelmed by symbolism? I think that relationships is really helpful. Having friends, being in a community, being in a church, and then also always putting your symbolic intuitions, testing them against the tradition of the church, testing them against your friends, testing them against your priest, your confessor, whatever. And that hopefully that if you do that, then you'll get enough signals if you're going off key. Like, you get enough signals if your interpretations start to get like, you know, just drunkenness or something like that, which happens all the time. Like, I, you know, I've met people that, you know, they lost the plot in terms of loose associations, and it's kind of losing themselves in these associations. So I think that that's probably one of the best ways to do it. And I would say also, like, come back to the things you're interpreting, let's say. So it's like you're interpreting a Bible story, you know, make sure that what you're saying accounts for all the aspects of the Bible story that doesn't just focus on one thing, because that's what happens with people. A lot of people get lost in symbolism, is that they find this weird little thread and then they hyper focus on it instead of backing away and moving in and kind of doing this dance where you're noticing the bigger pattern, you're noticing the smaller one. You're seeing how they're embedded with each other. They hyper focus on one thing and then they start to see things which are not there or are marginally there. So hopefully that's enough. So Nick Egginsberger says, hey, Jonathan, I was wondering if you could recommend any books or other media to someone without access to a church wanting to convert to orthodoxy. So, man, I should have it on. Father Andrew Damick put up a website, put something online, like a kind of introduction to orthodoxy. Maybe we could put it in the description once we're done with this, because I don't know if I could be able to find it right away. It's really good. It's like a very simple, nice little website that kind of takes you to just a basic understanding and can help you to connect you to actual priests and to an actual community. He sent me this to me a while ago. So we'll put it in there, we'll find it and we'll put it in the description. So check back tomorrow or in the next few days and we'll have a description of that. All right, so Alex Cilento says, hey, Jonathan, can you talk about Andrew Tate? I know this question sounds like a joke, but in all seriousness, the amount of influence that he holds is increasing every day. Why are people attracted to his ideals? And so I don't know. I don't know anything about Andrew Tate. Sorry, guys. I mean, like, he's a. I guess he's a. He's like a hyper masculine guy and kind of a masculinity guy. I don't, Sadly, I don't know about him. I don't know what to tell you. I don't think I've ever seen any video of him. I mean, just in general, like, you could say that this kind of hyper masculinity or this, this, these hyper masculine movements that we're seeing right now are just inevitable. Like, they're, they're inevitable because the push on the other side is so strong that why wouldn't that happen? Why wouldn't that, that kind of idea happen in terms of success and women and making money and being rich and all that stuff? It's not, that's not what masculinity is. At least, it's not what the ideal of masculinity is in any normal culture. But I get it. I know why people are going there. Because they. Men have these drives and these arrows, right? These desires towards success and towards, you know, towards women, towards. And the whole world is telling them, right, just watch porn and jerk off. And it's like they, they want more. Like they want something. And so I understand why these kind of characters will pop up and will have the type of influence that they're having. But, you know, I don't. Like I said, and I also don't know enough about him. I just know what people are saying about him. So hopefully I'm not misstepping and even in what I've already said. So Silas Allen says, what is the symbolism of food being perishable? Oh, it has to do with that chaos. Like the relationship between potential and chaos. Like, the line between potential and chaos is pretty thin. So potential becomes chaos. That's all it is. You know, and it's like, there's chaos, and then in chaos there's potentiality, which is available to you. But that. That is not. How can I say this? Like I said, the relationship did move back down into absolute chaos is possible. All right, so John says, what is the shape of time? Is it a straight line, a circle, a cone? Yeah, I like the cone. I think a cone is an interesting idea for sure. Time, the idea that time is the straight line, it's just weird nonsense. And you see it like these. I don't even know where it's from, these Christian theologians. And you'll hear them say, it's like, whoa, you know, the conception of time in the Bible is linear. Now, the pagans had circular time, and the Bible has linear times. Like, what? That's just a lie. It's not true. It's just not true. You hear, like, this perspective of history. You hear people say that all the time. Like, what. What are you talking about? It's not what it is. Clearly there's circular time in Scripture, but it's not. It's not like a repeating circle. It's. It is something like a cone, you could say, or something like a. A circle, which is always different. So it. So it doesn't actually say that the circle doesn't actually join up to the beginning of the other one. It's above it or below it, or it's. You know, it keeps going. And so there's both circularity and direction at the same time. So there is a sentinel, which towards. We're moving towards the eschaton. But the idea that that isn't also a kind of circularity and a moving up. So that's why in the eschatological image of the final image of the heavenly Jerusalem, that it's clearly related to Eden, it's clearly related to the garden. And so it is, in a way, a return but a fulfillment at the same time. So, yeah, so I like the cone image is probably. Probably the one I would feel closest to. So. Hello, Jonathan. I'm currently reading the Language of Creation. I was thinking of buying this book for my father and brother. I'm a little hesitant because our family has always read through The Bible through a lens of Baptist, Protestant theology. I know they will say, this is interesting, but where is it coming from, essentially? What is the authority for the interpretation? To be honest, I'm still trying to answer this question for myself. Please let me know your thoughts. And so, I mean, I don't know what to say. Like, Mathieu really decided to write his book that way for a reason, you know, because he wanted to present something which was simple and pure and distilled, you know, and so the very. Even the layout of the text is extremely distilled. And so that's what he wanted to do. Now, I mean, does it give you insight into the text? Like, is it giving you insight that you feel like it's giving you insight that contradicts something that you read in the. In the Church Fathers or in. I don't think so. And so, you know, where does it come from? It definitely comes from Matthews reading a lot of biblical commentaries in the past 20 years or, you know, 25 years or whatever, and also him just meditating on Scripture for a very long time. But he wrote it for that reason. So I understand a lot of people. I'd say that's the main criticism about his book. That's what it is. But I think it also means that his book will have a longer lifespan than a lot of these modern, like, exegetical works that are filled with footnotes and comments on the Greek and caveats about different strains of text. Like, I think all those biblical commentaries will just vanish into the. Into the chaos. And. And I think that Matthieu's book will. Will probably have a far greater in the end and longer influence. So. So then maybe the answer is just wait until the early adopters have fully digested it and it starts to actually seep into his church without him knowing it. And then by the time it's kind of seeped in, then. Then he'll read it and he'll think it's just obvious. That's the thing about symbolism is that in some ways it underlies or it precedes even some of the theological interpretations we have. It's like it's such a basic language of structural language. So that's one of the solutions. All right. Steven Young says hello. Jonathan, I was looking into the Abraham and Isaac story, and something I noticed was the leaving of the donkey and the two young men at the bottom of the mountain before Abraham and Isaac ascending. My question is, is this supposed to be a symbolic dichotomy of the inside and outside, representing an ontology at the bottom of the pyramidal structure. Meaning. Yes, definitely. That's definitely what it is. And I really don't see what else it is because the donkey is impure animal. And then, you know, the sacrifice, the ram that they find at the top of the hill is a pure animal. So you would never sacrifice a donkey. So it's also the donkey, the servants, the donkey. These are marginal in terms of your identity. And so definitely, I think that's definitely for the same reason that you have the golden calf at the bottom of the hill, and for the same reason you have this, like, shedding of people as Moses goes up the hill in the story of Exodus. I think it's related to that. So Stephen Bishop says. Hi, Jonathan, can you comment on the meaning of the death of Judas in Acts 1:18? Now, this man bought a field with the reward of his wickedness, and falling headlong, he burst open in the middle and all his bowels gushed out. Is this an image of Judas having too much body and improperly hosting heaven? That is Christ. Also, how does it relate to the Gospel's description of him having hanged himself? I would love to see video on the symbolism of Judas more broadly. So I think that the two stories of Judas death emphasize two different aspects of the symbolism of Judas. One is that he is an antichrist. And so in being an antichrist, he hangs on a tree. There's a direct relationship between hanging on a tree and the crucifixion, because in the Old Testament it talks about just hanging on a tree. It says, a just man does not. A just man will never hang on a tree. And so there's a whole trickery there. There's actually an early image, one of the first images of the crucifixion we have, 5th century, is an image where you see Christ on the cross on one side of the image and Judas hanging from the tree on the other side. Like in opposites, kind of facing each other. And so it is this interesting idea of the Christ and Antichrist and how in some ways, Judas is the unjust man who hangs on the tree. And you could say Christ is the one who becomes unjust to hang on the tree. You know, who becomes sin to hang on the tree. It's very. It's very, very mysterious, but it's a very powerful relationship. Now, as for this image, this is, if you want. I mean, this is the stuff that we talk about all the time, right? So what happens to Judas? He falls upside down, he hits his head on the ground. So he flips he flips upside down, he hits his head on the ground and then his middle bursts open and then the dirt, his filth is exposed for. For the world to see. It's like, yeah, it's the end of the world, folks. You know, it's like, if you want to understand, it's the end of the world. So it's like it's two. You could say it's like two images of Antichrist. Like two ways to talk about Antichrist. Yeah. All right. So Brandon Burns says, can Israel, Jerusalem be viewed as a symbol of both the church and an individual, individual believer? And the answer is yes, for sure. That's why Israel is both an individual and a country. Like, it's both. Israel is both an individual and a people. And so there is no, it's not speculation that you can see it as both an individual and a community. So, yes. All right. So Connor Mitchell says, have you ever thought about the symbolism surrounding bull riding as a genuine pre modern folk tradition? I feel as if it holds some notable patterns to it, such as the fact that the writer must remain for eight seconds or the nature of the clown at the periphery distracts the bull after the writer falls off. Specifically speaking, I'm interested in how well you believe it maps onto mythological patterns and stories what the bull and writer represent in the ritual. Yeah. And with disciplined masculinity as expressed by the writer triumphing over wild and untamed masculinity represents by the bull for an infinite 8 seconds be an appropriate understanding. So I don't know about the eight seconds. Like I've never. Maybe. But for sure, it definitely has to do with mastering potentiality. Like that's definitely what I have to do. It's like it has to do with, in some ways, a little world where the writer and the. The mount. Right. So the idea and the body, you know, the head and the body come together in a way that it's very difficult for the. For the writer to master the mount. Right. It's like walking on water or something like that. And so they have to do it for a cycle. So 8 is. Maybe the 8 is related to the 7 plus 1. That is possible. But for sure, whatever it is, it has a certain cycle in order to kind of show that you've mastered this. Right. And so definitely. And the clown for sure. Like the clown that then drags the. Let's say that distracts the body or that pulls the danger away from the writer. It's like, that's such a great imagery. Yeah, yeah. It's a nice little microcosm. I really wonder how old those traditions are. You know, they're probably really old, but maybe it's hard to find traces of them. All right, so Steven Young says what was wrong with my Patreon question? Too common? I don't know, Stephen. There are a few things. There are a few possibilities. Sometimes people also put them in too late. You know, that's also a possibility. And sometimes it's just because there's too many and we have to prune some. So it's not that your question is bad, it's just that you have to get to a certain amount so that we don't go over to. If I go over two hours, I just become a puddle. You've probably seen these older Q&As where at the end I'm just basically like just passing out as I'm reading these things. All right, all right. So Lisa is in the chat. She's appeared. Yes, Lisa, I am at my parents house, which is why I am here. And my father appeared in the camera. I'm actually with my brother Dan. Some of you never probably heard of, but Dan, my brother was a professional skateboarder and really good one too. He's one of the top in the world for a while. Dan Peugeot look him up. And then he became a pastor and now he's a Protestant pastor. So. All right, so Drew McMahon says hi Jonathan, have you ever seen Pan's Labyrinth? So if I'm curious about your thoughts seem packed with symbolism. If you have not seen it. Here's my backup question. Can you talk about the symbolism of wristwatches? Thank you. So I have seen it, but I saw it a very long time ago probably when it just came out. And it didn't have that strong of an impact on me. I think like it to me it felt too linked to something like the Nazis and like World War II or whatever. It was like the. It was too linked to some specific historical moment that I found it difficult. And so what is the symbolism of ridge watches? Well, for sure, the idea of a watch that's also. Or the idea of a time teller that's also an ornament is definitely related. Right. If you read Matthieu's book, you'll see how the idea that you would have an ornament that spins and tells you time, it's pretty good symbolism in terms of what, what ornamentation is and what, you know, this, what time represents in terms of circular causality and lack of point, you know, pointless turning. So Sean Desmond, in Catholicism we have a concept called the Seven Gifts of the Holy Spirit. Based on Isaiah 11, three of these gifts are knowledge, understanding and wisdom. Can you comment on what distinguishes these three orders of intellect? Yeah. So the way, at least that I understand it, this is the way that I understand it and it's a little tricky. So understanding seems to be something like. Something like a bunch of facts, like an accumulation of knowledge. So you accumulate a bunch of knowledge. And wisdom seems to be something like the spirit. Something like the spirit in which these facts can be, can be accumulated. Something like that. The applicability itself. It's the applicability of those facts, the reason why I wouldn't even care for them. Then knowledge seems to be the union of the two. So knowledge would be heaven and earth, meaning something like that. It's a sexual union between understanding and wisdom. That's my understanding of it. And I think like a lot of it came from discussions I had with my brother Matur. So you might get more insights about that in his book as well. Alright, so Alejandro Jurado asks. Hi, Jonathan. In Divine Comedy there's this idea that in the highest place in heaven is the Trinity, where the multiplicity of persons merge as one identity. This being the very pattern of how things exist symbolically. You talked about this idea in one of your talks. Is the idea of Satan eating the three main traitors of history. The opposite image. What? Oh, okay. In Dante, where the multiplicity becomes a place of disintegration and ultimately an image of death. Never thought about that. Maybe, maybe they're once part of one body, but gave a higher place to their idiosyncrasies than to the higher goal, head of the body, part of love, causing death or disintegration. Well, I don't know about the Trinity, but for sure there's. There's definitely supposed to be a connection between the difference between, let's say Dante being sublimated into. Into the divine being, carried up into the love that binds all things together. That's how it ends. And that it's something like beyond, beyond words, beyond expression, being carried up into the love that binds all things together. And this kind of being chewed by the devil, like being being mixed and broken down into your constitutive elements. Like, I think for sure that that is definitely the way that Dante wanted to structure his story. So yeah, good catch there. David Overby asked, you said not too long ago that one of your biggest fears is goddess worship creeping into Christianity. My question is, why do you think that is? Such a deep human impulse. And what should the proper response be? So I think that the reason why it's such a deep human impulse is that we know that all things that exist or that all things that present themselves hide some aspect of God. So all things reveal to us the glory of God. And so there seems to be a mystery in the fact that God is presented as being in heaven, that God is presented as being the Father. And there is an inevitable like mystical drive towards transcending that duality, we could say, and also perceiving God in the other term. And so. And I think that that is inevitable and there's something about that which is not wrong. But I think the problem is that the very nature of the feminine is to veil itself. Right. The very nature of the feminine is to hide. And I feel like Christianity has in some ways captured the right attitude towards it, which is a reverence moving towards a kind of eschatological union. So the idea is that in the end we will be as the body of Christ, we will be deified as the body of Christ, we will become God to the extent that that is possible. And so the idea is that the mystery of the feminine is eschatological and so should not be stated, it should be hoped for, hinted at, you know, sighed in the direction of. I don't know what else to say. And so I feel like the desire to uncover the Virgin. Right. It's like, I feel like that is a transgression that is, that is very dangerous. Yeah, I don't know how else to say what I'm saying here. All right, so Anders Vroustad says. Hi, Jonathan. In your recent conversation with Jordan and John, you discussed the primacy of narrative. Can you still man John's viewing point to where your views depart? Haha. Also, when will the Exodus seminar drop? Yeah, November. That's when it's dropping. So yeah, I think John really expressed his position very powerfully. And, and I, and I think that I've been thinking about it ever since, you know, and I'm hoping to have more discussions with him about that. I think that what he, what he's describing is that there is a, a nomological order of beings. That is, there is. So let's say like the relationship of beings to each other in categories is not narrative. Right. It has its own existence. And that existence is the categorization of scientific categories. It's something like laws, it's something like genealogies or whatever. These structures exist and they themselves are not narrative and they have a Value. So I think that he's right, and I think it's probably important not to confuse the narrative with the nomological. So to me, that is the best case of what he's making. And I think that he's right that there's no doubt about that now. But here's the. But I think that one of the things that wasn't addressed in that discussion is that I believe that the nomological order has to be teleological, that even the nomological order has to be ordered in reasons why those categories exist, that it's not just about a neutral categorization, but that the categories are embedded in a hierarchy of reasons. And so I think. I haven't asked John directly, but I think he would probably agree with that. And that if he agrees with that, Jordan actually. Man, Jordan actually said something very powerful in that discussion which just went by. And it's like. I don't think I even noticed it on that evening. And then I rewatched it, and I was like, Jordan caught onto something, and he said, science is if then. And so he says, the if is narrative and the then is nomological. And I was like. And I was rewatching it, and I was like, oh, man, that is so powerful. So the nomological order is teleological. But I still do think that teleology is anchored in purposes. And because those purposes cannot help but be human purposes, we could say ultimately that. I think that it still makes the case for St. Maximus's position. And also it makes the case for the if has to be bound in a kind of story. That is, why do I care about this in the first place? Like, if I want to do this, then this is the categorization. Because beings have indefinite angles, indefinite possibilities of how to. To. To. To. To come to them, right? There's. So it's like the restraining of the facts that you need. The restraining of the external parameters that you need in order to attain the nomological order does. Nonetheless, I don't see how it can't be bound in the human story. Now, it doesn't mean that the other. That the nomological order is completely vanishes in front of the other one. Like, it means that it has its own real kind of existence. But I think you see it. So you can see it in the. In the story of Exodus, right? So it's like the law is presented in a story. So you can see it in the story of Genesis. So in Genesis, there is anomalogical order which is presented right at the outset of the Bible. So God sets up like you could create the hierarchy of beings with the, you know, with the. The stars and the sun and the moon and the, you know, and the birds and it. So there's this order of being and it goes all the way down to chaos and all the way up towards heaven. But it is bound in a story of conscious seeing and evaluating the good. And it ultimately is created, at least in the Christian understanding. Ultimately, all this ends up being created for man in the middle, for man to be the one who mediates between all of this and his story. So that's the best I could do for now. But yeah, it was. It's actually really helped me to be a little baby, hopefully be more subtle and more careful in the way that I talk about things. So, yeah, John's good for that, for sure. He's. He's really brilliant. So. All right, guys, it is past 10 and so I'm reaching my. The end of my. My rope. So, guys, I'm going to. I'm going to sign off and sorry for the bad camera. The bad camera, let's say the bad camera image in this one. But. But we'll see you guys next month. Again, thanks for everybody who continues continuing to support me despite the absolute craziness that is around us beside watching inflation and energy prices go up. Besides everybody talking about starvation, you know, like, it drives me crazy. Like, it just makes me so angry. Especially like we all said it at the outset when they started all the COVID nonsense. Like, we all said it. We said this is going to lead towards mass starvation. And here we are, like, the UN put out a paper just last week saying they've upped their numbers. The people, they're going to starve. It's not going to be 100 million. It's going to be 350 million. And you know, and now they can blame. You can blame the war in Russia, which I'm sure is part of it. But yeah, so, yeah, so let us carry on, folks, and thanks for your attention, everybody. Thanks for everything and I will see you next month. Bye. Bye. I hope you enjoyed this episode of the Symbolic World. The Symbolic World is based on a series of videos that you can find on my YouTube. YouTube channel, Jonathan Pageau's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course, leaving a review on itunes. Everybody knows that's the best way to to get the podcast out there to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon the Pageau videos as well, and on subscribestar, all those links you can find on my website or in the show description. So thank you and I will see you soon."}
