{"episode_id":"SW - #346 - 2024-06-27 - Hidden Symbolism in Christian Architecture","start":11.52,"end":2401.53,"speaker":"Jonathan Pageau","text":"This is Jonathan Peugeot. Welcome to the symbolic world. Hello, everyone. I thought we could look at a little bit of architecture. I've mentioned several times in my videos that the church architecture, the Christian church architecture, is based in some ways both on Old Testament temple imagery, but then ultimately also this imagery that we find in the book of Revelation. There's also a third strain which is related to the manner in which the church architecture was developed, and that is the visions of the prophets, vision of Ezekiel. So we're going to kind of get into all of that, look into several of these strains, but ultimately what I want to do is begin with the words of Christ himself. And so before we begin, you know, don't forget, if you love what the symbolic world is doing, please go to the symbolicworld.com and become a member of the symbolic world. There are different ways to do that. There is, of course, free membership, but there are also ways to support the symbolic world with access to Q&As to the free monthly member on the video and also discounts on our different courses and our different projects. We are doing the Dante course right now and it is wild. It's quite a ride. I'm really excited about it. The first time, the first Dante class was just great. So I'm looking forward to continuing that with Richard Roland. And so the way we want to start here is with, of course, this very particular verse which talks about the relationship between Christ and architecture. So Christ says, the stone which the builders rejected has become the chief cornerstone. This was the Lord's doing and it is marvelous in our eyes. And so when I was young, people would talk about this verse, I remember, and they would often reference what we call, often call the cornerstone today, which is the idea of putting a very square stone at the corner of a building so that then you can align the rest of the building to make sure that all the stones that are aligned to it are straight. And, you know, this is a fine interpretation, it's very interesting, but I do think there is a better interpretation for this, for what it is that Christ is describing. What does it mean to be the chief cornerstone, you know, the head of the head cornerstone or something like that. And, and this argument, actually I take from Rene Guinon, which I don't know where he got it from, but I think it's a very powerful image, which is that, in fact, what this seems to be referencing is what we called a keystone. And so for those who know the way that you build an arch, which is the basic structure of all Roman architecture, is that the arches, the stone and the arch are all the same. So all the stones inside the arch are all the same, can be all the same stone. But in order for the arch to hold together at the very end, you put in what we call a cornerstone, a keystone. And the keystone, what it does is that because it's angled like this, and because it's one stone that has that angle, it holds the entire art together. And so this, of course, makes sense of the words of Christ, which is that he says that the stone the builders rejected. And why did they reject it? They rejected it because it didn't look like all the other stones. It was a different quality of stone. So because of that, until they get to the end, they don't know what its use is, because you have all these stones that stack up, and then at the end, you have this one stone that doesn't fit, and this stone that doesn't fit ultimately ends up being the keystone of the arts, the mystery, the secret that hides the reason for the rest of the entire structure. And so, you know, this is, of course, a reference by Christ in many ways in different manners, which is that he talks about the pearl, that you buy the entire field in order to get the pearl. And the pearl is a different quality from the rest of the field, but it is the reason why you want the field in the first place. It's the reason for the field. And so this is, of course, the good way to understand it is that the keystone, it holds the entire structure together and it also comes down from heaven. All of this imagery makes sense, and it is the basis of Roman architecture. Now, of course, Christ would have been aware of Roman architecture. He would have. And it's also. It's not just Roman architecture. There are other types of architecture that have used arches and things akin to arches in order to create the structure. Now, what you can do with an arch is that you can multiply arches and you can join them together, and then you can create what we called a vault. And a vault in architecture also often has what we called a capstone. So the capstone is similar to the keystone. It is a stone that holds all the ribs of the vault together. And so imagine all the ribs of the vault are like arches. And then in the center, you put this stone, particular stone that, that connects all the arches together and holds them in the middle. And so often in this structure, what they would do in the capstone is they would often put the monogram of Christ or different images, sometimes the lamb, but sometimes in the west they would literally put an image of Christ, you know, that is the capstone, the three dimensional version of a keystone that holds the ribs of the vault together. And so again, this stone is not, is different from all the other stones. It is a connector stone. And, and all the other stones of the rib are all the same because they just kind of go all the way up. And then you have this last stone, which is strange and looks ill shaped at the outset, but ultimately is the reason and manifests the wholeness of the entire structure. And so this is, of course, you can see how all of this is related to the symbolism of Christ. But in the orthodox tradition, we don't necessarily have ribbed vaults this way, but what we do have is of course, the dome. And so a dome is a three dimensional arch. So the image of the arch itself now projected into space so that it creates this round structure. And so it can help you understand architecturally why it is that we put the image of Christ up there at the very top of the dome. For it is in some ways an image of the keystone or the capstone or the top of the arch, or the chief cornerstone, which is, which is at the very top of the structure, gives the reason for the structure and also shows everything that it's pointed to and what holds it all together. And so to go further into this understanding, we have to basically understand the image of the arch itself. That is that an arch is an image of, of the union of heaven and earth in its very structure. Why? Because it has a dome at the top, it has a circle at the top, and it has a square bottom, it has a flat bottom. So it's square at the bottom and it's round at the top. For those who don't know, the heaven is round and the earth is square. I know this is difficult for people to totally understand. If you're interested in that. I wrote several articles on the Orthodox Art journal about the cosmic vision and how, you know, the basic experience of heaven and earth is that earth is that the heaven is round and earth is square. Of course, if you lie down in a field and you look up into the heavens, what will you see? What will you experience? You will experience this dome. The heaven will present itself as a dome that then comes down and connects with the earth. And the earth is a square because of your experience of the earth, because the earth has four corners and the earth is experienced as stable. And our experience of something that's stable is something that has four. And so think of a beast with four feet Think of a table with four legs. If you want to make something stable in the world, what you do is you make it square. That is the best way for it to be stable. But it also is a reflection of our experience in the world, which is that we do experience our place in the world as four. That is, we have in front of us, we have behind us, then we have the left and the right. And we experience that as the four directions, as north, south, you know, east, west, or depending on the orientation. The ancient orientation was actually eastward. So it would have east in front of you. You would have north on your left hand, you'd have south on your right hand, and you would have the west behind you. That's. That's also the structure of a church which faces east. And therefore you have the front of the church where, you know, represents. Ultimately, it's an image of the heaven, but it also represents the east, the front. And then you have the west in the back that when you were baptized, you turn around and you spit at the devil who's in the west because he's in the place where darkness starts. And then the left hand is the strange, is the dark hand because the sun never goes north, and the right hand is the south hand, which is the place where the sun is. So sun goes up from the east, moves south, and then sets in the west. Okay. But it's just to understand that our experience of the world is that it is a square. So once you kind of understand that. That the. A good way to represent the relationship between heaven and earth is this way, then you can understand how this image, this arch, becomes the structure by which Christian churches are understood and start to manifest themselves in both the east and the west in different ways, but nonetheless. So some of the very first churches we have in Rome will have this structure. And so the first structures that appear as soon as Christianity becomes legal is what we call the basilica structure. So the basilica structure has this image of the arch as being horizontal. And so you kind of take the arch, you lay it on the ground, and now the east becomes the image of the heavens, and the west becomes the image of the earth, because the sun comes up in the. Comes up in the east and goes down in the west. And so it creates that structure this way. And the apse, which is the very top of the church, which is this round part that you see at the very top of the church, then becomes an image of heaven itself, which is why in the churches, you know, Christ is represented in the apse. In the early Churches in the. The churches in the west also very, for a very long time. You see, Christ is sitting on the world. He is surrounded by angels and he is in that apse. The apse is a half dome. It is an image. It's like it's a dome that's cut in half. And so it represents this heaven which is there. But it also has the strength of representing the arch again now this way. So now you have a horizontal arch which goes. Move towards s. Towards the east. But because of the structure of the apse, you also have a vertical arch which goes up and is represented here. And then you can multiply that. You can see in this image of the Church of St Prasad in Ravenna, where you have these multiple arches that are both the apse, then the entire basilica which is projected into the east. And then of course, moving into the apse, you also have different arches that move into it. And then that arch is then repeated in the shape of the windows. Everything then repeats it as a fractal structure where you have arches within arches, arches projected this way, arches projected this way. And then you have arches that are inside the arches. And this can be taken to levels that are very extreme. If you think of. Here's a transversal of Hagia Sophia where, where you can see now all the arches kind of coming together, where you have the main dome in the center, then you have the second arches that create the pendentives inside. And then you have multiple arches. Everything about it is just arches within arches all the way down to the level of the window and to the shape of the church itself. So you have. Understand that this image of the union of heaven and earth is a fractal image. The, this is what I'm telling you non stop, which is there's a union of heaven and earth in your heart. You know you have heaven and earth in your heart. This is attested to by the, by the Syrian fathers, where there's a little heaven and a little earth inside you and a ladder which connects the two. And then your body has that shape as well. If you've noticed, your head is round and your feet are square. So a human being is made like an arch, not only an arch, but also a square. Because if you put your hands out like that, then you have, you have the shape of a, of a western church with the, with the extension of the four. And at the very top you have the east, which is the top, the, the roundness of the skull. And this is, I mean, this is attested to in all these Theologic. All these, like, weird mythological stories. You'll find, like, for example, in the northern Scandinavian stories, the idea that there's a giant, primordial giant, and they. They use the inside of his skull to make the heaven. And so this is alluding to the fact that the human being is a microcosm of the cosmos. Our experience of the world and its shape is reflected in the way that we are made. And so then this fractal structure gets repeated, repeated in the church at every level. And in the early churches, there was even what we called a ciborium, which was a kind of canopy that was set up above the altar and would now represent this structure once again inside the altar. So you would have a structure with four feet and then a dome at the top. You know, sometimes the dome wouldn't necessarily have to be a dome. It could also be. It could also just be like a triangle at the top. But even that, like, you know, the image of the capstone as the stone that holds the whole structure together in an arch makes sense, but it also makes sense in the sense of a triangle or the sense of a pyramid. As you probably know, the capstone of pyramids, of the Egyptian pyramids, would have been a fractal pyramid that would be gold at the very top of the. Of the. Of the pyramid, and then the rest of the pyramid at the bottom. So you can see, for example, like in the famous. The famous unfinished pyramid that you find on the dollar bill, that the capstone is not there. There's no capstone on the pyramid. And above the pyramid is the eye, which is the image of the capstone, which is the image of the logos, you could say, descending on the pyramid, manifesting the act of being, the act of consciousness, the act of evaluating all the things that Matthieu talks about in his book as being ultimately being an image of the capstone itself, the thing that is above the pyramid and comes down upon it. Okay, so this is also all there in this image of this fractal relationship. And it is also there in the ciborium that we find inside the church. Now, there are different ways you can end up doing it, and there's an indefinite variety of church structures which play with this imagery and will represent it in different ways. And so in the west, what ends up mostly happening is that this basic structure of the arch gets represented in the shape of the church itself as a fractal, as a macrocosm of the human shape with a Latin cross. So you can imagine with Christ with his hands out and the body down. So you can see that on the right side here, which this is. I think it's a point of view of Shacht or one of the Gothic churches. And then on the left, then you can see an Orthodox structure which emphasizes the squareness of the shape itself below here. And the cross is inside, usually some kind of Greek cross, a square cross, which nonetheless represents these four directions, the fourness of the human body. And then ultimately, like I said, the cross, of course, of Christ itself, which is the ultimate meaning of it. And so then you. But the way that they did it. And this is really interesting because, you know, one of the things you see happening in the Christian tradition is that there seems to be an effort to. To get to this. To get to the. To get to the dome, you know, to get to the idea of putting a dome on a square. And there were some attempts to do this in, you know, even before. In the Russian time, in the Russian. In the Roman times, you know, you can see the. The. The Pantheon, for example, in Rome. It's a dome on a. If you look at it sideways, like, if you look at it from. From outside, it looks like an arch because it's a dome on the ground with a vertical side. So it looks like an arch, but when you're inside, it's not a square at the bottom, it's a circle. And so, like, how can we get to a full representation of this imagery? And the solution is to stack the arches on each other. It is really to use the fractal structure of heaven and earth in order to make this work. This is how the Christians and Justinian, excelling in this, with Hagia Sophia, develop the structure of the pendentives. And so the pendentives, what they are, as you can see in this image, the pendentives are what the little A's that you have there. And the way you do that is that you create two arches, a wider arch at the bottom and then a narrow arch at the top. And what it does is it distributes the weight so that the narrower arch, dome can then hold on the wider dome at the bottom. And it distributes the weight in a way that makes the dome possible, that makes it possible for you to create the dome. But what it also does is it emphasizes very powerfully the relationship between the circle and the square. Because what you can do with the arches, as you see here, is that then the second arch, you can pull it down into again, a square. And then when you look up, you actually see four corners that come out as you create this with fractal arches that go all around the structure, and these four, you know, these four pendentives, what the church ends up doing is putting in them an image of the four evangelists. And it is, of course, a manner to represent how the one becomes the many. How. Because one manifests itself in four. How one is stabilized into four, just like the oneness of the dome gets stabilized into four pillars into the church. But this is also a reflection on the vision of Ezekiel, which is why sometimes in the four glories, what you see is the evangelist, but sometimes in the four glories, what you also see are the faces of the cherub. And so this is, of course, a famous image of Christ in Glory by Rublev, where you can see that it looks like what it would look like if you stood in the church underneath, right? You stood in a church under here, and you looked up into the dome, what you would see is this, right? You would see the four corners coming down from the glory. And on those four corners would be the four evangelists, but also representing the four beasts. So in Rublev's image, it is the four beasts of the cherub, that is the man, the eagle, the bull, and the lion. And you can see that it's really referencing the vision of Ezekiel, because under his feet, you can see that there are these wheels. And now the square of the earth is represented both. So if you look at how powerful this image is, it has the relationship between the circle and the square in multiple ways. So you can see that the square is his footstool, right? The round is, of course, his head, which I can't show, but. And then the round is this glory around him. And then the square is also the four points that are on the corner. It's a very powerful image of this fractal relationship between the circle and the square. And, you know, interestingly enough, if you look at the bottom of his feet, what you see are these wheels. Look now at the church. This is a very powerful church in terms of the fractal relationship between all these arches. And I think this is a church in Serbia. I think it's one of the cathedrals. I'm not sure. And so you can see that here the dome of Christ represents the Ascension, and there's a fractal relationship all through, which is that in the dome of Christ, you have Christ up at the top, then you have the mother of God that is represented, you know, here Christ is up here at the top, you have the mother of God, which is Represented at the lower part, which becomes like an image of earth. And inside of. Of the dome of heaven. And then that gets reproduced down here, where you have two apses. You have one apse which is at the top and has Christ in it that is in glory. And then you have a smaller apse which is below and more recessed. And in that smaller apps, you have the mother of God sitting there with Christ in her lap. And look at how powerful the use of these repeating arches is in this architecture. You have arches within arches within arches. It's really quite astounding. But look also at that. What is below the feet, you know, below the dome of heaven that comes down are these chandeliers, the kouros chandeliers. Now, the Kouros chandelier, this round chandelier. Often there are two chandeliers in many churches where you have, on the one hand, this round chandelier which hangs from the dome and then the outside of the dome. And then you'll also often have a chandelier that hangs from the center of the dome that comes down and is one kind of more the way we usually understand a chandelier, like with all the lights in it. And so you have one around and one in the middle. And what happens in many churches, in the monasteries, for sure, but then also in many churches that at Pascha and at certain feasts, what they'll do is they'll spin the kouros, and then inside the spinning kouros will also spin the chandelier. And it's this powerful image of these rotating wheels. And so, you know, let's look now at the vision of Ezekiel, and you'll see how all this comes together in a very powerful way. And so I looked, and I saw a windstorm coming out of the north, an immense cloud with flashing lightning, and surrounded by brilliant light. The center of the fire looked like glowing metal. And in the fire was what looked like four living creatures. Each of the four had the face of a human being. And on the right side, each had the face of a lion, and on the left, the face of an ox. Each also had the face of an eagle. Such were their faces. As I looked at the living creatures, I saw a wheel on the ground. Besides, each creature was with its four faces. This was the appearance and structure of the wheels. They sparkled like topaz. And all four, four looked alike. Each appeared to be made like a wheel intersecting a wheel. Spread out above the heads of the living creatures was what looked something like a vault, sparkling like crystal and awesome. Then There came a voice from above the vault over their heads, as they stood with lowered wings, above the vault, over their heads was what looked like a throne of lapis lazuli. And high above on the throne was a figure like that of a man. All right, now look at that again. When Ezekiel says that above the earth was a vault, he's talking about your experience of heaven. He's talking about a dome. He says, above your head. Above his head was a dome, and above the dome was a throne of lapis lazuli. And then on the throne was the Son of Man. On the throne was who in Christian understanding came to be Christ, came to be the incarnate One. And so he described this powerful image of a dome with Christ above it, the capstone, the chief cornerstone, you know, all of his symbolism crashing together in powerful ways. And then he describes these four beasts. But what he does is he uses a fractal structure. It's very, very powerful. You know, it's like there are four beasts, like these four corners. And the four beasts each have wheels that have wheels within wheels. Think of it. And it really is a chariot. That's the way to understand it. It's a what the Hebrew mystics call the merkabah. It's this mystical chariot that is a fractal structure that manifests God in the world. So you have these four beasts, and each of the four beasts have four faces, and then the four. And then they each have wheels that are wheels within wheels. And so you have this powerful fractal structure. Now, in the way we represent it in the church, the fractal is. Is. How can I say this? Is there in a different way. So we don't represent each glory. You know, we don't represent each glory as having four faces, but we just represent the four faces as emanating from the central Son of Man. And we don't necessarily represent wheels within wheels within wheels. We have simply represent the wheels. And you can see, but. But you can see when you look now at the church that it is this fractal system. It is this fractal relationship of heaven and earth, of how the dome and the square and the pentives and the arches upon arches within arches. And also even the chandelier and the circle of the dome and the chandelier that hangs down from it is these wheels within wheels within wheels. But you can see that it uses the same symbolism and represents it in a way that is understandable. Now, this fractal system is really very true. And it. If you're interested. Matthir. My brother Matthir wrote an article about it in the Secrets of God's Dog, which is here. Very amazing article. Very grateful that he gave it to us. And he shows that in Ezekiel, there are two descriptions of the cherub. One in which the cherub, like I said, has the face of a man, the face of an eagle, of a lion, and an auk. But there's another description where it says there's a face of a man, a. A face of an eagle, a face of a lion, and the face of a cherub. And so Ezekiel installs inside the cherub the very fractal reflection where one of the faces is the hole itself. And so it's like a mirror reflecting within a mirror, where the whole has a fourfold structure, but one of those is the fourfold structure itself. And you can imagine that going indefinitely, you know, fractally down into. Because that cherub also has four faces, and then the face of a cherub and etc. Etc. As you kind of move into this beautiful, powerful fractal structure. So it's pretty amazing to see how the Christians, you know, took this image of Ezekiel. Of course, there are many other symbolisms in the church. Maybe one day we can go through other aspects of the symbolism, but this is definitely one that. That's very important. It seems like the Christians had this desire to make real the vision that Ezekiel had of the chariot. And it's important to understand the church as this chariot, because what the chariot does in terms of the structure of the merkabah, it shows how God reveals himself in multiplicity with the four faces of the cherub, but also of the chariot that can move around and can manifest Himself in different ways. This is very different from the revelation of the temple or the revelation of the tabernacle, which is in one place, right? The temple, it was in one place. It wasn't all over. All over the world. It could only be in one place. And there's a difference, of course, in the Christian liturgy, which is that the temple structure, which becomes Ezekiel's structure at the same time, is now everywhere. And so every city, city, every town, every place can have its own fractal participation, which is a full participation, right? It's like each church is the church because it is this mirror, this reflected mirror of the fullness in its particular state, just like Christ was in his particular state, a reflection of the fullness of God. The church becomes a small version of that that is now can move in the sense that it can be multiplied all over the world without any limit. And so you can see how this image of the Merkaba now instantiates itself in the church now. So this is very important. All this is very important to understand. But there's also another aspect which is very important to understand, and that is part of Christian symbolism. And we have to acknowledge, because we have to be careful a little bit about limiting it to this kind of glorious fractal aspect. And so, on the one hand, God manifests itself in this beautiful fractal thing, but there's also a manner in which God is always warning us to be careful not to mistake the fractal mirror with himself. And so in the very verse where Christ says that he is the. That he is the stone of the. That he is the head of the arch, he says, the stone which the builders rejected has become the chief cornerstone. This was the Lord's doing, and it is marvelous in our eyes. But then it goes on and says, therefore I tell you that the kingdom of God will be taken away from you and given to a people who will produce its fruit. Anyone who falls on this stone will be broken to pieces. Anyone on whom it falls will be crushed. So you can see that these two verses are taken from the Old Testament, and they're smashed together in a powerful way where you see the two aspects of Christ. The aspect of Christ which manifests itself in the world, but then also the aspect of God which is hiding itself or is. You know, it's like Christ setting up Peter as his representative, but then Peter being able to betray him, and Peter being called Satan if he is not connected to that high aspect. And so the idea is that you can imagine now that the chief cornerstone, this keystone, falling on you and crushing you. And also, because it's so irregular, being on the ground and being a stumbling stone. And so Christ is also this stumbling stone, if for those who don't recognize the stone, it becomes a stumbling stone. But also, Christ is always as he is setting up his kingdom. He's always saying, be careful not to mistake the kingdom for the king and to not mistake the fractal representation for the one who's instantiating it. And so this is why in the story of Christ, there are many stories where he is negating or, you know, showing that in fact, this fractal. This fractal representation is not sufficient. And that there's a sense in which you have to always be able to attend to the highest and not mistake the one for the other. So, for example, in the transfiguration, interestingly enough, St. Peter, who is the one that Christ chose to be his representative. Tez Helds. Christ, you know. You know, Lord, it's good to be here. Why don't we build a tabernacle? Why don't we build a house for you and for Moses and for Elijah so that we can stay here forever, right? So we can just be here. Because it's great to be here. And Christ refuses him. Christ does not accept that you build a house for him, you know, and then there are stories where it says, God is Spirit. And those who worship him with worship in spirit, Spirit and truth. And not in Jerusalem, not at the temple, not in these particular spaces. There is also the image, of course, of the veil of the temple, which is being ripped, and Christ saying that now the body is the temple. Our body, physical body, is a temple of the Holy Spirit. And so there's this movement in order to negate, in some ways, the fractal representation, while Christ is the instantiator of that fractal representation at the same time. And this is important to understand. It seems like a contradiction, but once you understand it, you can see that it is, in fact, in some ways. You said Christ created your eyes, but he says, if the eye is an obstacle to you being in communion with God, then rip it out, you know, throw it away. You know, anything in creation that becomes an obstacle to you being communion with God should be removed, even though he is the origin of those very things. And he manifests himself in. In those realities. And the eye is particularly strong about that because he's basically. It's the closest thing to what is described in Genesis 1 as God creating the world and seeing that it is good. It's like there is this, you know, it's like Christ saying, you know, the commandment saying, love your father and your mother. And Christ criticizing the Pharisees. He tells the Pharisees that the Pharisees are horrible because they attribute to God what they should attribute to the parents. Because the Pharisees, what they would do is they would say, oh, I didn't receive what I received in the world from my parents. I received it directly from God, you know, holier than thou. And then refusing the fractal system that God has created to make the goods we get from God come from others. Christ criticizes them for doing that. But then Christ also says, he who does not hate their father and mother, he who does not hate their brother for the sake, for my sake, you know, will not enter into the kingdom. And so this strong duality has to be understood properly. And that is what accounts, of course, for the asceticism of the Church. And so you have powerful images in our tradition of, you know, for example, saying these are two icons from Father Silouan Giustiniano, who as you know, I think is one of the. One of the best iconographers in the world right now. And so you can see this icon of Saint Onuphrius the Great, where Saint Onuphrius lived in the wilderness. He had access to no church, he had access to no liturgy, but he received communion directly from Christ, directly from the angel who came to commune with him. And similarly with, you know, Saint Mary of Egypt, who lived in the desert, an extreme ascetical life for all, all of her life of repentance and then ultimately receiving communion once before she died. And so there's room in Christianity and not only room, but there's a necessity to keep the tension between those two. And you often see by the way, in the church, this competition between the monastic aspect of the church and the liturgical aspect of the church. And you find it in the writings of some of the evening, even some of the great theologians of the 20th century, where there's a anti monastic stance because they want to see, you know, Christ manifested fractally in all aspects of reality. And then in the same way, you can sometimes have the monastic tendency to see with suspicion, you know, this instantiation all these stories of monks who say, who don't like when there's melodies even know on the. In the desert fathers, basically they would sing without melody because melody is a. Is a dangerous seductor, like it can seduce you into its pleasures, you know. And so you can see like that tension is part of Christianity and it's there in the story of Christ himself. And it is important to keep, to maintain the tension. But ultimately when you come also to the final image of creation, it is an image of this fractal structure. And so, you know, and here is a powerful representation of it by Jake Jacobello Alberregno, a western image from the 14th century, where now you can really see it. And so of course now the arch is not round, it is a pointed arch, but nonetheless you can see Christ in the arch coming down from above, being the corner chief, cornerstone, and now being the one at the top of the dome in the image of Ezekiel. And coming down upon the square, which is the earth, which is the heavenly Jerusalem, which is the church. It is an image of the groom coming to his bride. It is all of this imagery of the union of heaven and earth which we see in the book of Revelation in the presentation of the heavenly Jerusalem. But then it is also, you know, the basic cosmic image. It's the image of everything you know, and it is, it is can be let's say resumed in the simple structure of an arch. And so hopefully this is helpful to you and it can give you some insight into why church architecture looks the way it does. There are of course other aspects of the symbolism. Like I said, I want to be careful that you don't think that this is the only thread that you can follow to understand the architecture but this is definitely a very powerful one that can help us appreciate and understand, you know, how strong the Christian symbolism is, you know, and how it's embedded in the very, the very structure of our architecture. So thank you for your attention everyone and I'll talk to you very soon. Bye bye."}
