{"episode_id":"SW - #082 - 2019-12-21 - There is No Literal Meaning","start":0.64,"end":1377.41,"speaker":"Jonathan Pageau","text":"One of the problems I run into when talking to people about symbolism is the whole problem of the literal versus metaphor idea. And I've talked about this a little bit before, but I think I want to dive into that problem and show you guys that, in fact, you know, it isn't very much of a problem once you realize that there is no such thing as literal. This is Jonathan Peugeot. Welcome to the symbolic world. Now, of course, I already hear a bunch of people screaming. No, he's saying that. That the Bible didn't happen, that these. That everything is just a metaphor. No, exactly. I'm trying to break that duality. I'm really trying to. To destroy it, because it is really not useful in understanding how meaning occurs and how things manifest themselves. Now, when I say that there's no such thing as literal, what I mean by literal is this strange, pervasive idea that is still there in the West. It seems that there is such a thing as a direct description of something, that there is such a thing as a description of something which is not bound up in meaning and which is not bound up in narrative or an image, that it is somehow a meaningless description, that there is. No, it doesn't. It's not. It's not already imbibed in meaning. And you. You get that all the time. And when you talk to people, they ask you, you know, especially in terms of a story, in terms of the Bible especially, people will argue over whether or not the description in the Bible are literal. Now, I. To be honest with you, at this point in my life, at this point in my understanding, I don't see what that even means. I can understand in the way that people talk about it, what it is. They seem to inferring that it is somehow a neutral description of reality that is not in. That doesn't already have value or meaning inlaid in it. But. But I don't understand how that is possible. Because when you describe something, no matter what it is you describe, you have to describe it. You have to have a purpose to describe it. You need a frame in order to talk about something. Because I, like I've told you a million times in, like I keep repeating, it's that reality is too big, there are too many details. If I describe a series of events, I will use, I will do it with a purpose to make you understand something, to. To. I have to focus my attention on something, because around the event that I'm describing, there are a million other events going on that I'm not describing. And the question is, why am I describing these events and not describing these other events. Now, already that harms the problem of this notion of literal. Because if I am not talking about, you know, the fact that this person. If I'm telling a story about something and I'm not talking about, you know, the folds in their shirt, or I'm not talking about, you know, the fact that they cut themselves shaving in the morning, you know, I'm not talking about those things because they're not relevant to what it is that I'm trying to get to. They're not part of the purpose, the purpose for which I'm describing something. Now, depending on the purpose for which I'm describing something, I will use different types of language to describe it. And the idea that somehow accuracy in the, you know, this kind of scientific sense, that somehow accuracy is always desirable, is of course, completely wrong. It is completely absurd because accuracy also can fall into an indefinite amount of detail. You know, let's say that I am describing a fight, and I want you to understand what happened. Now, I could use a language that is extremely accurate. I could say something like, you know, the guy put his left foot in front of his front foot, and then the other person's right hand came at this speed towards his face, and he slightly flinched when the fist hit his face. He displaced so many hairs and displaced so many pores. And then, you know, so many tissues in his. In his cheek were. Were. Were disturbed. And then the, you know, his head moved 3 centimeters to the left, and then it moved forward 4 centimeters backwards. And I can go on and on and on, and I could describe extremely accurately the event. But as I'm describing it accurately, I'm not getting to the purpose that I'm describing the event for that I'm describing this event to you. For now, I could say something like, the guy got smashed. He got totally. His ass got whooped. I could use all this hyperbolic language in order to help you understand what happened in the fight. And in the end, my hyperbolic language, the fact that I'll use exaggerations, that I'll use figures of speech, that I'll use all these different ways of talking about reality, will end up being truer to the purpose that I'm using to describe the event than if I was accurate in describing it. That. Now that's extremely important to understand. Especially if we're looking at stories in the Bible. There are ways. Each story in the Bible, each book in the Bible has different ways of describing things which are based on the purpose that they are describing them for. And so there are different styles, different ways, there are different analogies which can be used in order to help you understand the reason for which I am describing the text. And so this very idea that somehow you can get to this literal description of reality is extremely problematic, and it's not useful. It's better to rather understand the purpose that a story is being, for which a story is being told. Even a scientific, even a scientific theory is never literal in the sense of a neutral description of reality. When you do a scientific experiment, you have to frame that scientific experiment extremely narrowly because, like I said, there are too many details. And so if my purpose in a scientific experiment is to prove something about water, I will not give you descriptions of trees or descriptions of rocks. No, I will talk about the thing that I'm trying to describe. And so that frame will, will be extremely narrow. And, and I will use a certain type of language, quantifiable language, in order to describe the phenomena that I'm explaining to you. And the purpose is so that you can understand the, the mechanistic causes that bring it about and so that maybe you can reproduce it mechanistically. But when we're telling, when we're describing an event, we're don't. That's not always the reason why we're describing it. Like I said to using figures, figures of speech can somehow sometimes be more effective and more powerful than, than using just, you know, this kind of quantifiable language. Now, if I use figures of speech or if I use analogies to describe something, does it mean that I'm not describing an event? Of course not. Of course I'm. I can still be describing an event despite the fact that I'm using different types of ways of explaining it. Now, it's really important. The stretch that I'm asking you guys to make is very important. And as Christians, you know, the Christian way of describing reality is that the world is made by logos, the world is made by meaning and purpose, and all of this. And so the very cosmology in which Christianity exists excludes the idea that there could be some kind of neutral reality that exists at the bottom somehow, and that is not informed by meaning, by logos. You know, the Bible itself describes the creation process as a process which is full of meaning and purpose. And so I don't understand how, despite that, people can somehow still have this weird idea of this neutral reality which exists underneath the world of Christianity is a meeting of heaven and earth. And so it's a meeting of patterns, Logos Meaning, purpose, and this potentiality which is there at the bottom. You know, maybe people don't like the word potentiality. You can use another word. Saint Maximos talks about logos and tropos. That is, this notion of purpose and meaning. And then the particularities of something, those two have to join together. And that. That is a little mini. You could call it a mini incarnation. It's not an incarnation in the same way that Christ is incarnated, but it is analogous to the incarnation in the sense that it's an invisible meaning and purpose which joins a kind of indefinite particularity and that meeting together. That's where reality exists. That's where the world, where life, where all of these things are. And once that starts. Starts to break in our thinking, a lot of things become less problematic. A lot of things become less difficult to deal with. Because one of the problems that we have is that people seem to want, you know, let's say they're reading the story in Genesis. They're reading the description of creation. They want to get to this event. They somehow think that they can access this neutral event which is behind the story. You don't have access to that. You know, you can't get to it because it doesn't exist. It doesn't exist on its own. The events that happen as they are described are this framing, this coming together of meaning and particulars. And so what we have is the story, especially when we're talking about something like the creation story or the. Or the, you know, these ancient stories that have been around for thousands of years. What we have is the story. To try to somehow get to what is behind the story in this neutral manner is not the right way to go. People do think that somehow they tried through these archeological methods or through these historical methods to get to what is behind the story in Genesis. But it's a futile trip. And it's especially futile if you think that once you get there that what you're going to get from using archaeological methods or using these different new scientific ways of breaking down the text into all these different sources or whatever people come up with in the modern world, you're not going to get to something which is truer than what the story is offering you. And once you get. Once you understand that, then, like I said, a lot of things are going to free up in your mind and a lot of problems are going to go away. And one of the examples that I like to use is the example of the prophecy that Elijah is going to come before the Messiah. So there's this prophecy, which in the Old Testament, which said that Elijah is going to come back, he's going to show himself before the Messiah. So when Christ is there, the disciples ask him about this prophecy, kind of ask him about what is going on. And Christ tells them that St. John the Baptist is the Elijah that was to come before the Messiah. And he says, if you're able to receive this, that is what happened. Now, the question that is asked, if a question is posed, did Elijah come before the Messiah? The answer is yes, Elijah did come before the Messiah. That Elijah was John the Baptist. Now, you see what I'm doing there. I'm not trying to get to this weird, literal, neutral reality behind it. I'm trying to show you how Christ can quite easily take this prophecy and show that it's actually a pattern of reality which is manifesting itself. And here is the manner in which it manifests itself. And Elijah as this, this pattern, St. John the Baptist, those two come together. And so the answer to did, Did Elijah manifest himself before the Messiah? The answer is yes. Now that is. That is the answer you give to that I will give to everything. You know, did Adam and Eve fall in the garden? Yes. Did Adam and Eve eat the apple in the garden? Yes. All of these things, I have no problem saying that they are true and that they are the best description of that event and the best description of that reality. I'm not trying to get behind, in some weird scientific sense behind the story to find out what it is that really happened. I don't know what you're talking about. I have no idea what it is that you think you're going to get to. That story is the story that was given to us as the description of this extremely important event. And the question of how to describe that story. That's it. That's the story. That's the story we have. And that's the best way to describe that event. And so, like I said, a lot of problems. A lot of the difficulties modern Christians have is that without even knowing it, they have completely taken upon themselves the kind of modern scientific view of the world as being the highest reality. You know, I remember hearing when I was younger, a Protestant, tell me that science is just the mind of God. Well, that's a serious problem, to engage the world that way, because then you always end up trying to, like I said, to get behind the story and to find some scientific description which you could find behind the story. Well, it's not there because science is not the first degree of reality. Science is great it's fine. You know, like I've always told you guys to fly airplanes to make medicine. It's wonderful and it works and it does what it's supposed to do. But that is. It is not, first of all, the only way to describe reality. And it is not the best way to describe reality. If your purpose is to show people how to live. If your purpose is to help people understand events that happened so long ago that all your reference points aren't even. Aren't. Aren't. You won't even be able to connect to the reference points in a scientific way. So we use story tropes, manners of describing that are the best way to describe that event. And so, like I said, so because. So, because of that, it is extremely problematic to say that, uh, that. That you can. That there's this weird opposition between literal and metaphorical. Now there are other people who somehow think that the metaphor is going to save them as well. That by somehow saying that something is a metaphor is going to get them out of trouble. Now, this is particularly true of communion. And I've seen this now, I've seen it happen so many Times Now In YouTube comments, people bringing this up. When I talk about communion and I talk about the reality of communion and the fact that this is truly the body and blood of Christ. Now obviously someone will show up and say, no, no, no, it's not. That's so disturbing to say that because it's this weird cannibalistic thing. It's just a symbol. It's just a metaphor. Christ is saying, this is a metaphor for my body and blood. And so, you know, so because of that, somehow they think they're getting out of the problem. Well, you're not getting out of the problem because first of all, I will not accord to you that it is just a metaphor. That is, that is such a. Anyways, we won't get into that. But let's say that I did. Let's say that I gave that to you. Let's say that I gave the fact that it's just a metaphor to you. How are you getting out of the problem? So you're saying that. Oh, no, it's so disturbing, this idea that we would eat the real body and blood of Christ, but it's not disturbing that you would eat the metaphorical body and blood of Christ? Like, why is that not as weird and as disturbing as saying that it's real? It's like, I'm gonna be a bit disturbing right now, but let's say that some weird, weird Cult came up with a ritual where they eat the feces of someone. Or they eat, they have a kind of inverse satanic, you know, communion where they eat, they eat the feces of their master or whatever, you know, and then, you know, someone says, oh, no, no, no, we're not really eating the feces of our master. It's a metaphorical eating of the feces. We just make this bread in the form of feces and then we eat it. You know, it's just a metaphorical eating of feces. It's like, why is that less weird? Why is that less disturbing? Why is that less of a problem? And it'd be best for you to deal with the mystery or you can't totally deal with it, but face the mystery of communion rather than try to skirt around it and avoid it by thinking that, saying that somehow because you think that something is just a metaphor, that it's meaningless. It's not. I keep joking around and, you know, my brother and I, we always say that it's like there is no such thing as literal and, and there is no metaphor. That's not how, that's not how things work. It's not as simple that you can't just throw something away and say that, oh, that's just a metaphor. Well, there's a reason why you're using that metaphor, even if it's just a metaphor. There's a reason why you're, you're, you're, you're using those words and that purpose, even if it's just literal, These, these terms are not useful but to help us understand how meaning occurs and how things unfold. Now in terms of communion, you know, to understand this problem of the body, let's say, and blood, not to understand it, but to deal with it and to deal with the idea that it's not, it's neither literal in the scientific sense, nor is it a metaphor in this. Also, I mean, modern way of understanding metaphor, that it is something that is symbolic in the way that I'm trying to explain it is. It is something which is. By the joining together, the bringing together of elements and is joining with a spiritual essence. That, that is how reality functions. Now, you could, you could get to the same idea of understanding. For example, when we say that the, that the church is the body of Christ, is that literal or is that a metaphor? Well, it's neither of those. It's not literal and it's not a metaphor. It's a symbolic truth. It's actually, It's a symbolic truth which can help you understand what a body is, what, you know, how a body comes together and manifests something which is above it manifests something spiritual. You know, anything that is a body is always an accumulation of parts. Now, just because you visually see those parts close together in your perception doesn't mean that they aren't parts which are also separate from each other. You know, it's like your body, there's a lot of space between your molecules. And if you think that that relative amount of space between your molecules is not bothersome, but the bigger amount of space between the members of the church is somehow, that's a problem. So now that can't be a body. It's like, yes, it can be a body. An accumulation of people can also be a body, just like the accumulation of your molecules can also be a body. And the way that that happens is neither literal nor is it a metaphor. It is symbolic. It is the unity of multiplicity which appears to us and shows us something, which shows us the thing that holds them. Those things together shows us the spiritual essence, the logos, the purpose, which makes us engage with something as one, as a unity. So I hope that that's helpful a little bit in understanding why if you guys engage with me and engage with me with those types of languages of literal and metaphorical, all of that, it is not. It's not useful to help you understand the world. So I hope this has been. Hope this has helped and I will talk to you guys again very soon. I hope you enjoyed this episode of the Symbolic World. The Symbolic World is edited by Justin Ward and it is based on a series of videos that you can find on my YouTube channel, Jonathan Pedro's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course, leaving a review on itunes. Everybody knows that's the best way to get the podcast out there to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon Pageau videos as well and on SubscribeStar, all those links you can find on my website or in the show description. So thank you and I will see you soon."}
