{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":12.56,"end":27.85,"speaker":"Jonathan Pageau","text":"This is Jonathan Peugeot. Welcome to the symbolic world. So you live in. You're in California?"}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":28.09,"end":29.21,"speaker":"John Vervaeke","text":"Yeah, I'm in."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":29.45,"end":30.01,"speaker":"Jonathan Pageau","text":"I live."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":30.01,"end":90.8,"speaker":"John Vervaeke","text":"Actually, I live. Officially I live in Alameda, but it's basically the Bay Area. It's just like Oakland, like a little. Like, where. It's a little island right off of Oakland, basically, like an old port town or something like that. Nice. Yeah, it's really nice. In fact, I'm appreciating because I have a suit. I am super. I'm super sensitive to kind of the lack of this, like, lack of soul. Like. Like track houses and shopping malls and all that kind of stuff, man. It just. I. It just. All that stuff just makes me sick and nauseous, like, physically. So I. We found a place that's like, right in a really old neighborhood. Like, historical houses. And, you know, they have lawns because they're houses that. You know. I think most new housing developments are so strange. It's like they build the houses to, like, look like houses."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":91.6,"end":98.56,"speaker":"Jonathan Pageau","text":"Yeah, that's such a good way to say it. Look like they're like simulations. House simulations. Simulacra."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":98.96,"end":106.16,"speaker":"John Vervaeke","text":"Yeah, totally. Totally. So welcome. I'm glad that you could come on. As I've been looking forward."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":106.16,"end":132.01,"speaker":"Jonathan Pageau","text":"Yeah. Sorry it took so long to get it all together. You know, I've been. I've had some. My life has been crazy for the past year and a half. And so it's only just in the past few months that I feel like I said, okay, I know that there's a bunch of people that said they wanted to talk to me. I need to kind of get back to them. And so I just remembered. I said. I remember a guy saying stock had written a few messages that kind of flew by. Flew over my head. So, yeah, I'm happy it worked out."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":132.17,"end":141.42,"speaker":"John Vervaeke","text":"Yeah, me too. Me too. Yeah. I've been noticing you've been having more conversations lately with people. Intentional or."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":142.06,"end":219.13,"speaker":"Jonathan Pageau","text":"It is intentional. It's hard to totally understand why. It's kind of an intuitive thing that I'm doing. I don't completely understand it. I think it has something to do with Jordan Peterson kind of reappearing on the horizon, but at the same time not appearing on the horizon, kind of being there, but not being there. And I don't know if that's. It seems like that's maybe what's motivating this in my. But I'm not. I don't know. It's hard to explain. It. It's just this intuitive thing that I all of a sudden had a Sense that, okay, I need to also, I think. I think. I think what it is is that I think that in the past maybe year and a half, I've been consolidating the people that have been following what I'm doing, trying to be more in contact with the people that understand that are wanting to develop it and not. Not trying to reach out and have communications that will challenge me. And so I think that that's it. I think that seeing Jordan kind of reappear on the horizon has made me think, okay, I need to not just focus on my thing. I need to really push myself so that I don't stagnate in this space. So who's the person, the hardest person that I could talk to? Like, the person that would be the most challenging. And so I found these kind of more hardline atheists to talk to just because I feel like it's the most challenging thing."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":219.13,"end":244.49,"speaker":"John Vervaeke","text":"So, yeah, totally. God, I really appreciate that sense. Like, there's something about that that I really relate to, and it actually brings to something I wanted to ask you about, which is, like, your role, Right. In all of this. Because for me, this has been. I totally relate to what you're saying. You basically said, I'm like, oh, you've been talking to more people. Is that intentional? And you're like, yes, but it's hard to say why."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":247.3,"end":257.78,"speaker":"Jonathan Pageau","text":"Yeah, well, we work so much with intuition. So much of what we do is intuitive. And so I try not to stop the intuition too much when it's happening."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":258.18,"end":284.93,"speaker":"John Vervaeke","text":"Yeah. Well, specifically, what's so interesting about this? Because it's so conversational, obviously. And I think this has been the case for me. I mean, anything that's been good in my life has been some sense in which I have been intuitively responding to something. Something speaks to me. Right. And so I just kind of find myself following it because I'm really. Personally, I'm really bad at paying attention to anything that's not interesting to me. Like, I just."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":286.69,"end":325.04,"speaker":"Jonathan Pageau","text":"Oh, man, I'm so much the same. Oh, yeah, I've been. I've been. You know, I. Luckily, I'm married to a woman. Like, a wonderful woman in that case. But I've always, like, I've never done anything which was going to make myself, me secure in the world. I've always. Both of us, we've always just done what we knew, what the right thing was or the thing that really was telling was kind of shining in front of us that we had to. We take a grasp of, no matter where it led Us. And so, you know, it's a great. It's better to live that way. It's riskier, but it's more fulfilling."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":325.12,"end":392.68,"speaker":"John Vervaeke","text":"Oh, totally. Well, and then as you follow it, then the thing that you've been interested in kind of comes out. And then, I mean, that's what circle A was for me. And circle A was the same thing. I'm just like, whoa. There's a moment like me and my friend noticed it and we're like, what is that? And then 10 years later there's a movement and a language trail and a methodology and people. It's funny. Cause people kind of ask me questions about it. And I guess I can talk about it as if in retrospect, as if I knew what I was looking at, but actually I didn't know what I was looking at. But. But it didn't surprise me as it, as it started to come into. Into fluorition. It's like there was. But there's a connection between guy. You know, that moment of where something like shined out to me and then the response to it. And then as it's in retrospect, I can pin it all together on some level, but the connection between the guy that's after it's revealed and the guy before it's revealed, like, how the hell does it know? Like, what are we actually responding to? That's always been the mystery to me."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":393.16,"end":393.72,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":393.8,"end":394.68,"speaker":"John Vervaeke","text":"Of how do we know?"}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":395.08,"end":449.11,"speaker":"Jonathan Pageau","text":"I think you're right. I agree. Yeah. I think that that's the one thing. You know, four years ago when I just started making these YouTube videos, it was the same. You know, all of a sudden I was kind of put into a situation and kind of thrust into a space that I had not planned for, that I had not thought that I would ever be in. But that was it. Like, that was the path in front of me. And I thought, okay, let's do this, you know, and not knowing exactly what the plan was. But then as you said, as you start to move, then things start to clarify and then you can start to understand, okay, so this is where I'm going. This is what I'm doing. And then you can fine tune what you're doing. But I feel like now is a moment again where I feel like there's. There has now there's something else. There's something else kind of, kind of calling and so we'll see. I don't know. I don't know where it's going to lead me, but it's okay. You know, it's all good."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":450.23,"end":451.35,"speaker":"John Vervaeke","text":"I just love the way."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":451.59,"end":452.83,"speaker":"Jonathan Pageau","text":"I just love the way the matter."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":452.83,"end":460.63,"speaker":"John Vervaeke","text":"Of fact said the thing that you said. Like, the way that you said that. I'm like, have you been doing it intentionally? Yeah. I don't know exactly why."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":462.95,"end":512.04,"speaker":"Jonathan Pageau","text":"But it's hard to explain this to people, like, people who don't live that way. Because, for example, like, I started icon carving, I would have thought you could be a professional icon carver, because that doesn't exist. Like, it's a job that doesn't exist. No one does it. And so then I started doing it professionally. And I remember someone asked me about what I was doing and said, oh, I can't wait to see your work in five years. And I looked at him and I said, five years? Like, I'm not sure I'll still be doing this in five years. And they didn't understand how I could think that way. But it's like, I don't know what I'll be doing in five years. And it's totally fine with me. I don't have a. I have no problem in imagining that I'll be somewhere completely somewhere else. If I'm in the same place and it still kind of is bringing life to the around me, and it's bringing life in my own experience, then I'll stay here. That's fine."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":512.2,"end":522.68,"speaker":"John Vervaeke","text":"Right? Right. You know, there was a guy that you interviewed that wrote a book called Is It Redemption? He's a historian. What's that?"}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":523.16,"end":524.2,"speaker":"Jonathan Pageau","text":"A dominion?"}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":525.65,"end":532.77,"speaker":"John Vervaeke","text":"Yeah. I went. I watched the interview, which I really liked, and I got the book. And I've been listening to the book, actually, which is really good."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":533.41,"end":534.41,"speaker":"Jonathan Pageau","text":"He's a great writer."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":534.41,"end":629.62,"speaker":"John Vervaeke","text":"He's such a great man. I always kind of. I've been getting to know to what degree how we. I've always got. I've always had a sense that, you know, we're so deeply Christian. Right. In ways that whether or not we go to church or even believe in God or anything, you almost can't be Western without being Christian. Right. At such a deep level. But he exemplifies it really clearly in a way that I can. Like, whoa. It's like. It's so deep in the difference. And it's interesting because I've actually been thinking about what it must have been like to be Christ. Right. Where, like, the. Like, what's. So what's taken for granted at this point, Right. Of all of our conscience, the way our conscience speaks to us. The fact that, like, I feel bad if I treat somebody, like, on a lower status, meanly Or I see somebody else do it and like it's this obvious that we shouldn't do that and like we feel bad about like all the different pre reflective responses to the world. That seems so self evident or something that, that a lot of that stuff was not there. And so I'm just imagining like, what the hell was it like to be Christ? To hear yourself saying these things where there was no basis upon which for it to be even remotely intelligible. Like imagine yourself like saying, yeah, like if they hit you, turn the other cheek. Like how the hell is he even supposed to know what that means? Right?"}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":630.28,"end":694.85,"speaker":"Jonathan Pageau","text":"Yeah, I think I see it the way that I would phrase it is more like to meet him. Like I struggle to imagine. I think that when you read the scripture, you get a sense that Christ knew exactly what he was doing compared to most people. But I think that the way that I would experience the dilemma is more to say if I had met Christ 2,000 years ago, I think most of us would not have recognized what was happening. I think we would have been as dumbfounded as most people around. And we might have been some of the people that thought that he should die because what he was doing was just like, you know, what is going on? You know, what is happening. It looks like you're gonna take over, like you're gonna take over politically. But then you keep talking about, you know, loving your enemy and all these weird things that it's just very odd. And so I really do think I have weird because I have sympathy, like I have a lot of sympathy for the Pharisees when I read scripture. Because everybody thinks they would have been one of the disciples, let's say, and they wouldn't have been like the Pharisees."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":694.85,"end":696.89,"speaker":"John Vervaeke","text":"But statistically you wouldn't have been."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":696.89,"end":742.62,"speaker":"Jonathan Pageau","text":"Oh man, you probably definitely would have been like the Pharisee. Not only that, but even the disciples sometimes didn't know what Christ was doing. They're kind of like, okay, so he said that now, like, what is that? I thought he said this before. So what's going on? And they look confused. All through Christ's life until, until the, until Pentecost. And then at Pentecost, it seems like everything kind of like they see, they finally see, okay, we've been doing this kind of, we've been doing this thing for several years and now, okay, this is what it's about. Like, this is what it's supposed to be. And then there's, and then there's this scene where Peter stands up finally and like speaks to the thousands of people and has this, like, you know, this convincing. And it's because he finally got it after, you know, more than three years. Like, what exactly was going on? That's pretty crazy to think about."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":743.1,"end":795.94,"speaker":"John Vervaeke","text":"Totally. Like, so just to put yourself in Christ position where, like, I'm wondering if it's something similar than what we're talking about. It's like, well, like, what are you doing? Are you doing. Are you saying that intentionally? Are you doing these interviews intentionally? Like, well, yeah. Like, it is intentional. Like, I'm not sure why. Right. This kind of. Whatever that position is, it's something similar where it's like, it's not predicated. Something that's completely revealed and clear in some mental way, but there's an intuitive sense and a response to something that's very, very deep, that you trust. And I'm wondering if that's a little bit. I don't know, just putting myself in the story. As I've been thinking about this, I don't really know that much about Christ's life, but, like."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":795.94,"end":842.7,"speaker":"Jonathan Pageau","text":"Well, the thing about Christ is that. Especially the way Christians understand it is that he did have that knowledge. He wasn't like us, kind of fumbling around because you can see that he. There are certain scenes in Scripture that are there to show you that he knew exactly what he was doing. Like, he would take. He would. He would quote certain verses from Scripture. Like, he would open up the Torah and then he would read certain verses to help people understand what was going on. And he was trying to. And then when others didn't understand, he would tell them. It's like. Like, you fools, like, you don't know. You don't even see what's happening. Like, you have it in front of you and you don't see it. And so sometimes Christ is actually pretty harsh on the disciples because they're more like us. They're more like fumbling along, trying to kind of get a sense. Whereas he. He seemed to have had a kind of clarity that is difficult to."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":843.42,"end":843.82,"speaker":"John Vervaeke","text":"Right."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":844.3,"end":846.74,"speaker":"Jonathan Pageau","text":"That's difficult to frame."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":846.74,"end":856.1,"speaker":"John Vervaeke","text":"Let's say, did he have a basis? Did he ever reference or give any sense of the basis upon which he was. His clarity was about."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":856.18,"end":858.9,"speaker":"Jonathan Pageau","text":"Yeah, well, that he was God. Besides that."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":859.38,"end":859.86,"speaker":"John Vervaeke","text":"Yeah."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":860.02,"end":873.14,"speaker":"Jonathan Pageau","text":"He decided that he was. He was. That he was the Son of Man, that he was. All these images of the manifestation of God in the world. Like, you know, that's probably the best places where he kind of shows the clarity."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":873.14,"end":874.74,"speaker":"John Vervaeke","text":"But, yeah, okay."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":874.82,"end":918.53,"speaker":"Jonathan Pageau","text":"The fact that he encompasses, like, for example, like, there's one. There's one place where people ask him, like, what? You know, what's the law? Like, what's the. And he says, love. Love God and love your. Your neighbor as yourself. And I mean, that's to show you what. How much he understood. Because there's three. There's hundreds of laws in Scripture, and that law is not even in the, like, ten Commandments. But he says, he takes this little law in the. I didn't have it in Leviticus or takes this little law. And he says, this is the fullness of the law. And so you can see that he's actually changing. He's taking all the prescriptions and transforming them into modes of being, into the highest mode of being. And so it's like he knew exactly."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":918.53,"end":919.01,"speaker":"John Vervaeke","text":"What he was doing."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":919.01,"end":920.65,"speaker":"Jonathan Pageau","text":"Like he knew exactly what he was saying."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":921.53,"end":939.18,"speaker":"John Vervaeke","text":"I'm just trying to transfer in that position, imagining, like. So at what point did he start to. Unless it was instant. Unless he knew it, like, in the womb. Like, when did he know that he was who he was? Do you know? Does he."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":940.62,"end":1008.99,"speaker":"Jonathan Pageau","text":"It doesn't say in Scripture, but there are many stories, like legends of Christ that he. You know, the idea that he was performing miracles even as a child. There's the verse. There's the place in Scripture where he's in the temple at 12 years old and he's teaching all the elders. And so Mary forgets Christ in the temple. They go to visit the temple, and then they think that he's with another family, so they leave. And then they just leave Jesus there for like a whole day until the next day. And then when they come back, they find Jesus sitting there in the temple and teaching all the elders of Israel. And then she says, what do you like, I can't believe it. We forgot you. Why didn't you come with us? And she's a little bit annoyed with him, and he answers. He says, no, I'm doing the work of my father. And so I think that text is there to show us that even at a very young age, he knew what he was and he knew what his role was. But there are stories in all kinds of."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":1009.15,"end":1018.11,"speaker":"John Vervaeke","text":"Just a knowingness, hearing that. What do you mean? I'd be like, oh, yeah, it's from your father. Right. It sounds like there's just a deep knowingness."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":1018.91,"end":1073.05,"speaker":"Jonathan Pageau","text":"Yeah, but there, it's. There's a lot of. There are a lot of stories like that in other cultures as well. Stories of, you know, the child that speaks when they're born. You know, the child that's Born full grown. You get that in the dao, for example, the idea that Lao Tzu was born full grown. And you get it. There's a lot of. There's a lot of different traditions about children that are born full grown. And I think that all those traditions are there to talk about the capacity that there are beings that are manifesting something so fully that they do it from birth. And I think that for sure, that's how Christians understand Christ as being the full incarnation of the Father, and that this was not something that developed in him, but. But was really, you know, was there at the outset."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":1073.69,"end":1110.62,"speaker":"John Vervaeke","text":"Right. I just, it just. I don't know if I've ever quite thought about it. I mean, I was. I have been thinking about this, but like now in this conversation, I find myself putting myself imagining from within Christ at some point, starting to know. Or maybe just the moment I'm aware is the moment I'm. How would I. 1. How would I know that? And what would it be like to know that? Like God. That just sounds so intense. Just imagine that you're like going along and then you just find yourself knowing that you're God."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":1113.02,"end":1178.16,"speaker":"Jonathan Pageau","text":"I think that I tried not to think of that that way because the thing about. Thing about knowing is that you. The things you know, you know, it's not, it's not like you find yourself knowing in the sense that it's not an accidental thing. You know, once you know something, it's like it's a form of clarity. It's not, it's not a. Once it happens, like to you, let's say, you. So you, you could take the moments. You take the moments that you've had, moments of clarity, let's say, where all of a sudden everything kind of lines up into place and all of a sudden you know exactly like you know exactly. It's as if you're kind of one with your out, with your outside and one with your inside, and you know exactly what you're doing and you know why you're doing it. Like, everything's lined up. And I think most people have these little moments like that, like say these little moments. And I think that if you want to imagine Christ is to imagine that that's all he is, that his whole existence is that clarity, which it can't really imagine it, but you can expand it out of your. You can expand it out of your little moments of clarity, let's say."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":1179.68,"end":1212.12,"speaker":"John Vervaeke","text":"Right. I know that for me, in those moments of like, in that clarity, it's usually. Yeah, I usually don't represent those moments until someone kind of asks me about it. Right. And then when I go to try to describe what I may be clear about, I'll have this experience of like having a difficult time putting into words. But you're right, there's something that I know that I can't account for. So I would imagine it's like. But then imagining living your whole life from that place, that's amazing."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":1212.76,"end":1343.5,"speaker":"Jonathan Pageau","text":"Yeah. And it seems like if you read the, if you follow the tradition, it seems like it's possible. Like if you look at saints who live their whole life in prayer and live an ascetic, take up an ascetic life and really kind of sacrifice everything to live in that clarity and that prayer, in that self denial of the passions and also embrace of love towards their neighbor. Then you meet characters in the tradition that have that. Like there are these images, these stories of St. Seraphim of Sarov, who's a recent saint, who's a modern saint, and he lived in the forest with a bear. And you know, like he just, all of it was just this almost mythological figure. But one day one of his disciples was talking to him, like someone who was trying to get some teaching from him. And he kind of asked, I forget what he asked when he asked him something like, I'd like to have a glimpse of what it can be, like what life can be, what we can reach. And then St. Seraphim looked at him and then before his very eyes, St. Seraphim became like a flame, like a living flame. And he saw like who St. Seraphim really was. He saw this being that was completely burning in God. And then it was just for a split second and then it was gone. Like, it was just like I saw through the veil, let's say, for a moment. And so it seems like those characters exist even today, like on Mount Athos. There are all these stories of contemporary elders who, you know, who do things that we can't, that people don't believe are possible. Like, you know, they have all these powers or whatever and they commune in spirit together. So these monks who lives in caves who don't talk to each other will nonetheless speak to each other in spirit. And they can tell someone, oh, remind so and so about this thing that he told me yesterday. And they're like, wait, you didn't see him yesterday, but he did in this kind of this higher sphere, let's say. It's funny, I never talk about this kind of stuff. You got me on a weird space."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":1347.02,"end":1349.18,"speaker":"John Vervaeke","text":"Is this the kind of Stuff you talk about with your brother."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":1350.17,"end":1381.97,"speaker":"Jonathan Pageau","text":"I mean, it's the kind of. No, it's the kind of stuff that I don't talk about. Especially that. What I just said now. Because it's the kind of thing which I think is secondary to what is most important, but because it looks kind of magical, that it attracts attention. And so it can. I think it can sometimes take people astray because they like the idea of people having powers and people having more. And so it's almost like a science fiction version. So. And I think it's totally possible. I don't deny these things, but I don't think that they're that important."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":1382.45,"end":1436.26,"speaker":"John Vervaeke","text":"Yeah, totally. Well, they're kind of neat. Well, I think what I'm getting from this conversation is, like, as you're talking about it, I mean, there's just these. It's neato to get inside of it a bit, right. And, like, get the mystery of it. Like, of just the sense that on some level, I'm sure Christ had a subjectivity. Right. He had a experience he was having. Right. But he had a knowing in which. What's really interesting to think about is how does he even represent that to himself when he pictures what he is? If it's. If I'm God. When he thinks of himself as God, I mean, by definition he probably doesn't have a picture right in his mind, right. Like, these are, like. These are ways of kind of maybe getting at the mystery of it. Right. Getting close to it. That's what I'm experiencing as we're talking."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":1436.98,"end":1501.53,"speaker":"Jonathan Pageau","text":"Yeah. I mean, I don't know. I think that there's usually not the avenues that I go on in terms of trying to understand this stuff just because the best. Because it's hard to imagine what a higher form of consciousness is unless you experience it. And so it can become a bit arbitrary to try to try to. The only way for me to try to understand it is to compare, let's say, the moments of focus and of clarity and of love that I have in my life compared to the moments where I'm just a zombie sleepwalking through my existence. And so it's like, if I can compare those two types of modes of experience, then that's when I can say, oh, okay, so maybe there's something like that, but higher up, like, there's even more. And that's the only way that I can kind of imagine the moreness of it. But I don't. But I don't see it as."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":1502.49,"end":1503.93,"speaker":"John Vervaeke","text":"Yeah, yeah."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":1504.33,"end":1507.85,"speaker":"Jonathan Pageau","text":"I think that's the Only way that I can really kind of peek into that mystery."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":1508.41,"end":1548.16,"speaker":"John Vervaeke","text":"Well, you mentioned something. I usually don't like to come at it like this, or it's rare because it has a tendency to have people think some, you know, like something fantastical, like, and it's not the best way of going. Going about it, which is an awareness of. That there is a listening, I would imagine, that seems to presuppose a listening that you're. That you speak into or an awareness of people, which I think starts to get into. Some of just the questions I had about your, you know, your role so far in terms of being on YouTube and talking about symbolism. I'm just curious about what is your."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":1548.56,"end":1549.84,"speaker":"Jonathan Pageau","text":"What is my role?"}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":1550.4,"end":1555.2,"speaker":"John Vervaeke","text":"Right. Who are you talking to? What have you found out so far?"}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":1555.36,"end":1665.45,"speaker":"Jonathan Pageau","text":"Yeah, well, look, I think that if I have a role, I think that I kind of fell into it, which is fine. Which is totally fine. I think that I couldn't have planned for it. But it seems like what I'm doing is I'm offering a ladder to people who have been living in a kind of materialist, reductionist world and need the few lower steps to reach up and then kind of have a fuller, more, let's say, enchanted vision of reality. And so it seems like that's what I've been doing. And I have ways of talking to people that will awaken that intuition. And so I try to constantly look for. So if I have, like, my main strategy, which is it is a strategy is I always try to surprise people with meaning. And so which is why I'll. When I talk about a subject, I'll try to find an extremely high subject which is, let's say, like some Bible story or some medieval architecture or something that is very high. And then I'll find an example which is as low as possible. Like how you experience your coffee cup or how you, you know, or some Marvel movie or some kind of low thing in order to jolt people's. To jolt people into an experience. You know, it's like a mini. I always say, I try to create mini Zen Cohen, like little mini one where people go, oh, okay, wait a minute, I had thought about that. And then all of a sudden it connects two wires in their experience, and then they have a little spark. So I would say, like, if I do that, then I'm happy. Like, that's pretty much what I would like to be doing."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":1666.01,"end":1678.35,"speaker":"John Vervaeke","text":"Right? So to have people take those couple of steps where they can get an intuitive glimpse of another world that their current. The current step that they're on, like, won't allow them to see."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":1678.43,"end":1679.87,"speaker":"Jonathan Pageau","text":"Right, exactly."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":1680.03,"end":1680.43,"speaker":"John Vervaeke","text":"Right."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":1680.67,"end":1724.01,"speaker":"Jonathan Pageau","text":"Yeah, that's a good way to understand it. Yeah, that's a good way to understand it. So I think that that's been. That's really been. If I can kind of reduce what I'm doing to one thing, I would say that that's it. And I also, I also. I think one of the other things I'm trying to do is to reinvigorate Christians who are blase, who are. Or think that this is just rote. Like, they don't see how much power is in the story, how much power is in the ritual, how much power is in. And so to kind of get people excited a little bit again about the story of Christ, about the stories of Scripture. And so I would say to me, that's the second thing I'm trying to do."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":1724.33,"end":1744.92,"speaker":"John Vervaeke","text":"Yeah. Okay. So the other thing is that there's a whole world of people who go to church, but there's a little bit of that. They're not awake necessarily to the livingness of the story. And you want to like, in some sense do something similar with them where they can. They can become awake to the tradition that they're actually inside of."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":1746.2,"end":1835.4,"speaker":"Jonathan Pageau","text":"Yeah. And it also seems to be the most of the people watching my videos seem to be young people, you know, like late 20s. Some people that are like either mid-20s to early 30s, people who are either in college or just finished college and have had to kind of deal with all that intellectual pressure that you go through when you go to university, you know, especially if you go in a liberal arts world. And it's like they're looking also for ways to explain or to give strength to something that they might feel intuitively. And so they have an intuition about something, but then they don't necessarily have the tools to fully expound it. And so I think people are grateful to have those tools. I think that's one of the things Jordan Peterson did too, is that he was giving ways of. And John Vervecki, man, John Vervecki has been amazing for that, where he gives you words and tools that you can say you could talk about combinatorial explosion, because all of a sudden you have a term and then you can explain the term, but once you've explained it to someone, they understand what it is. And so then you can of move on. And then you can talk about relevance, realization. It's like, that's an awesome term to help people kind of step into something that maybe they don't have access To. So I think I'm doing something similar, but with images and analogies, helping people see the patterns that they haven't seen yet."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":1835.96,"end":2040.79,"speaker":"John Vervaeke","text":"Totally. Well, you know, I think I had. I had an experience. I'm not sure if I got your role. I said to my wife in this moment, right, That I was like, oh, I think I'm really getting Jonathan's role here. But I think. I think it is symbolism, too. I'm not sure, but, like, maybe both are the same. That's kind of a cool position to be in, right? Where they get symbolism is getting your role. That's kind of a cool place I would imagine being in. But there was a moment, actually where, you know, a lot of the. A lot of the apocalypse started happening and. But I wasn't quite. I wasn't quite getting it totally. It all just started. It still looked like the same thing to me. And then I was watching one night. I think it may have been a day, or I was just finding out about the whole. The whole. The guy that. The cop that killed the person on TV, right? Yeah. Somewhere around there. And then there are three hurricanes and then like 20 riots or something like that. And the end. The plague, right. All happening at once. I was watching the news and something about. For some reason, the news just reached out and it went. It hit. It hit me. I was like, well, wait a minute. No, we're actually. This is a different. It felt like time itself had changed, right? Like, this is a different. We're in a different temporality. Like, that's how I would. I would put it. But I didn't. I wasn't left. The inside didn't leave me with any sense of orientation, right? I was like, everything that I could grab onto to try to understand it didn't quite hold. And then a few days later, I was listening. I was watching your videos. And I think it was the first video or two after that where you actually came out and talked about the actual. You talked about that. You took your time with it, right? Because it took something to really understand it. But when you. When you explained. When you. Especially when you explained the phenomena of all of us watching, right, this man get killed, right? And the. And that you explained the phenomena of how we were identified with the cop. We were identified with the person being killed and the. And all the symbolism that you put around it. And you explicitly said, like, hey, sorry, guys. And this is. You also. And you also talked about the fall of the west in the burning of the statues, and you gave that great explanation. I Love this explanation. Like, you move into a house and there's still the past. Family still has their pictures up. You're like, you're going to want to take them down. It was like, it's like, that's so. That's so true. And you said, hey, guys, listen, I'm sorry, I don't have any solutions. All I can do is kind of articulate what I think is maybe happening. But there was this way where I felt like after that, I found myself in a place inside of it, and I was like. I felt myself being able to grip onto something that was a bit ecstatic and very, very orienting. And I remember I was like, oh, shit. Like, this is. I looked at my wife, Brianna. I was like, I think this is his role, whatever it is he's doing. I think he just did it."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":2041.35,"end":2135.14,"speaker":"Jonathan Pageau","text":"Oh, well, good. Thank you. Well, I'm happy that I kind of helped you get some clarity in that. In the strange moment it's been this year, the thing about what's happening is that time is really accelerating. And so the shifts in. Let's say the shifts that you felt is kind of temporal shift, or this shift of worlds, like, as if the ground is moving underneath you, is usually something that would happen, like, every few hundred years, but now it's happening every few years. And so, you know, I felt it happen at the last, in 2016, I felt it happen. And now. And now I'm feeling it happen. And so it's like four years is a short time for the world to change so much in terms of the whole ground kind of shifting underneath you. For people who are intuitive, it's very, very existentially difficult because you feel it like you've really. It's like it stops you from sleeping. And you feel it, that you feel like the world is changing, and it's almost like it's, you know, you're like. You're tied to a giant gear and it's like stretching you. You know, and so I understand what you're saying, and so I feel it. Very much so. And so I also tried to. So hopefully, if we can at least help people feel the despair which goes with that, or, you know, at least if people understand what's going on, then even though you can't stop it, you don't feel just falling, like. You don't feel like you're just falling. At least there seems to be some frame around what's happening for you to understand it."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":2135.14,"end":2197.89,"speaker":"John Vervaeke","text":"Yeah, absolutely. Yeah. There's a certain. There's. That's an also very interesting thing in itself of like. Like, if I don't have a frame around what's happening. If there's no. If there's no place for me to kind of get a handle on something. Like, what I get a handle on may just. Actually, what I got a handle on is that there is no handle. Right? Maybe that's the thing that I got my handle on. But there is this element of. And I don't know where I stand in a lot of. In this whole issue, because I see. Because I really feel the same thing that you're talking about, of where I'm like, whoa. Like, there's weird. There's like, existential changes that are happening at such a level, right. That used to take thousands of years to happen, and they're just boom, boom, boom, happening closer and closer. Like. And I. For me, there's really this element of like, well, I'm on a ride here. I don't know exactly what I'm writing, right? But, like, I'm on a ride and when I hear people respond, like, right. What?"}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":2197.89,"end":2200.57,"speaker":"Jonathan Pageau","text":"Like, what did he just."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":2201.69,"end":2202.17,"speaker":"John Vervaeke","text":"Yeah."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":2202.17,"end":2263.52,"speaker":"Jonathan Pageau","text":"Oh, man. No, but I. The thing is. The thing is that this ride has been going for a while. Like, the ride has been lasting a few centuries now. The thing we don't realize is that the ride slowed down after, you know, the tens and tens and tens of millions of people that were slaughtered in World War II. So because World War II ended in such a mass carnage and two nuclear explosions, then it's as if the rides slowed down for 12 generations. But that's it. It's starting up again. It's the same ride that brought the world into the revolutions after the Enlightenment. And so. And so it's only. We just had. We just were fortunate to be in a pause, you know, after mass slaughter. But so it's not pretty. What's happened on the horizon is not. I'm smiling as I say it. I always laugh in the worst moments, but it's not. It's not pretty. It's the."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":2263.84,"end":2313.07,"speaker":"John Vervaeke","text":"Yeah, well, I think. Well, the laughter actually is. I mean, there's something in the laughter that I think is revealing about what we're facing. I'm not exactly sure why. This is what I was just trying to get at. I haven't been able to quite put my finger on it because when I see people talk about the world and the time in a way that's like. Has a sense of urgency and it's good natured of trying to. It's like almost like Trying to take existence and turn it into a problem to solve. Right. There's a. I mean, I appreciate the impulse, but I just get this sense. I'm like. I'm like, this is. No, we're inside of something. Like, it seems like a huge category mistake. You know what I'm saying?"}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":2313.07,"end":2349.42,"speaker":"Jonathan Pageau","text":"Like, the history. Exactly. That's such a great way to put it. It seems like there's a category area going on here. Pretty big one. Like, you think you're gonna solve existence. Okay, that's a little bit of a problem. No, I totally agree with you. And you can see the arrogance of the. Like, you can see the arrogance of the systems of mass control and of mass information. Like, they really do believe that they're gonna get there. Like, they're gonna. They believe that they're moving in that direction. And so it's a Tower of Babel moment. It really is. And that story also doesn't. Doesn't end well, you know?"}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":2349.66,"end":2392.6,"speaker":"John Vervaeke","text":"Right. And there's something for me about those handles that like. Well, I think I would put it like this. I think it's Maybe. Maybe. I mean, we could use Heidegger's help here because there's the quality of truth. There's a truthness of, like, that sense where he talks about. It's not correct, Right? Well, it's not correct. It's also correct. But there's an element of that. That which was concealed is revealed. Right. There's truthness or the happeningness of truth, which has a kind of transcendence to it. Like, even if you. Even if what gets revealed is that you're in hell and you're going to be in hell for the next 20, you know, whatever."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":2392.76,"end":2393.16,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":2393.4,"end":2406.84,"speaker":"John Vervaeke","text":"There is something that laughs and there's a basis there which I think has to do with. I don't know. Does it have to do with just having a semblance of being in truth? Yeah. Well."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":2408.68,"end":2467.32,"speaker":"Jonathan Pageau","text":"There is, like. There is this, like. I think you're right in the sense that the disclosure itself, like this capacity to kind of get a sense. To see the pattern, to get a sense of what's happening, even if what is happening is horrible, it does offer you a kind of a small little ecstasy or a small, little mystical. Mystical experience. Experience and a sense of freedom within it, too. You know, it's because you all of a sudden, you pull back and you see it come together, right. You have this revelation and, you know, Christ talks about how. He talks about how all must be revealed. And it seems like Christ inaugurated this process where Things would just be revealed one after the other, and the revelation is not positive. I think that it's always like a mix of both. So there's. There are aspects of the."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":2467.4,"end":2467.8,"speaker":"John Vervaeke","text":"This."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":2467.96,"end":2506.95,"speaker":"Jonathan Pageau","text":"This disclosure of the world which is positive, and there's disclosure, an aspect of it which is a scandal. And so as. As, let's say Christianity revealed the highest mystery of theosis, of the purpose of creation, of as being becoming one with God. It's like also what is going to be revealed is all our perversity, all our. All our passions in their, you know, in their worst forms of desire to control, of a desire to live only for pleasure. All of this stuff that is now rampant in our society. It's kind of like those two had to happen. It's like it had to happen. It has to. It has to show itself."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":2508.15,"end":2555.47,"speaker":"John Vervaeke","text":"Yeah, yeah, sit. The showing. Right. Well, it's those little ecstasies. They kind of give a sense of freedom. I think also when I got. I think this starts to get in some of my questions about symbolism. Right. So when I first started watching. Watching you, I was. There was. There was a sense in which I was. I was. I was familiar with the language that you spoke. I was familiar with what you were talking about because I had obsessively read Jung when I was in high school. And so I was very familiar with the way he talked about, like, symbolism. Right. In the. In. In the Jungian way that he did. But what I think when I really. But there was something different about the way you were talking about it, right. Than he was."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":2555.87,"end":2563.07,"speaker":"Jonathan Pageau","text":"Because I don't. I, on the other hand, don't read Jung. People don't seem to believe me, but it's just true. I don't know what to say."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":2563.07,"end":2652.37,"speaker":"John Vervaeke","text":"I don't think you'd like him. No. Like, I don't really know. I think he'd find it really. I think you would. If you read Jung, I'm imagining, like, if you read Jung, it's like, it'd be interesting, but I don't think he would really be compelling because he has some implicit horizons that I think are. Well, what makes your work. Your work to me and not Jung's is actually when it came to this. I think this starts to speak to also these moments of ecstasy, these moments of releasement. And I want to talk about what's good about that. When you said no, it's like. I think it's. When you talked about the symbol, you know, I think you were looking. It was some video where you were talking about the Symbol of something. And you said, look, the symbol is actually. The symbol is one of the ways. Or that picture is one of the ways that the pattern substantiates itself. Right. The picture isn't the symbol. Right. The picture just happened. I got this sense. You didn't say this, but I got the sense. It's like. It's a condensed. It brought all the pieces enough in like a small enough space time. Right. Picture, such that you could see the whole pattern in front of you, but it itself is just an abstantiation in the pattern that happens in reality over longer time frames. That if you could understand it, you could see those patterns."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":2653.81,"end":2664.77,"speaker":"Jonathan Pageau","text":"Yeah, that's a good way to understand it. That is that the symbols that appear to us more most clearly are those that are the most condensed. You could say, like you said, that they."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":2664.77,"end":2665.25,"speaker":"John Vervaeke","text":"That they."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":2665.41,"end":2728.78,"speaker":"Jonathan Pageau","text":"The word symbol actually means two things that are thrown together. And so there's this idea that symbolism itself is a bringing together of elements, and so that you see them as one. You see the pattern or the ordering of it. And so the symbols, the more proper symbols, you know, let's say like an icon or, you know, a church building or something, which is which we tend to think as symbolic rather than, you know, your everyday life, which is also symbolic. But let's say the liturgical space or the sacred spaces, they condense it in a manner which is more accessible or makes it accessible to us so we can kind of get it. Once you see the pattern, then it. It actually. Then if you're sensitive, then it'll start to, let's say, bleed out into other aspects of your reality. And then you realize that, hey, my body is also made that way, and my relationship with others also has similar patterns. And our societies and our stories, all of it is actually manifesting these sacred patterns to a certain extent."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":2729.1,"end":2737.98,"speaker":"John Vervaeke","text":"Yeah. And so the symbol is one instant of the pattern, like a little incarnation."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":2739.66,"end":2740.7,"speaker":"Jonathan Pageau","text":"Of an essence or."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":2741.02,"end":2748.54,"speaker":"John Vervaeke","text":"Yeah. And so then that's when I think that's when I really got. It's like, oh, you're talking about. You're actually talking about reality."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":2749.26,"end":2751.54,"speaker":"Jonathan Pageau","text":"Oh, yeah, that might be the difference."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":2751.54,"end":2753.26,"speaker":"John Vervaeke","text":"Between me and you. Yeah."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":2753.26,"end":2828.79,"speaker":"Jonathan Pageau","text":"It's not just psychological. And so it really is. The psychological is part of it, for sure. Your psyche also has that shape. And it's really important because. Because we are human beings are logos, let's say, we have reason and we have consciousness. Therefore we are kind of. We are the place where symbolism actually kind of happens. But it nonetheless is also happening in the world because we Are the. We're like the funnel through which the world, you know, has meaning. And this is something which I'm not making up. Like, this is something that I take from the Church Fathers, especially Saint Maximus the Confessor, this idea that the man is the ultimate, ultimate microcosm and that the entire cosmos condenses into the human person and we can understand it in a. You can use cog sci to now to understand it or can use theory of meaning and the problem of emanation and complexity to now see that, yes, conscious beings are like the funnel through which this potentiality that's out there, this kind of indefinite potentiality comes in and then, you know, becomes meaning, becomes a world."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":2829.27,"end":2837.11,"speaker":"John Vervaeke","text":"Right, okay, so I want to slow down there a little bit. So the. You said a bunch right there. So."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":2837.43,"end":2838.23,"speaker":"Jonathan Pageau","text":"Yeah, sorry."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":2839.35,"end":2856.08,"speaker":"John Vervaeke","text":"The infinite potential, the endless potential comes in. And what you're saying is that the psyche, you could say, is the place that it. That the psyche is the place where that potential gathers into a world."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":2857.44,"end":2933.7,"speaker":"Jonathan Pageau","text":"I mean, it's not just the psyche, it's the person. It's more embodied than just the psyche, but it is the person, like the human person, both in terms of mind, but also in terms of acting out in the world. That's why it's a perspective, you know. And Jordan talks about this all the time, where the categories of being are actually categories of action. They're not static categories. Even the way that Plato tend to think of forms, there's something off about that. Saint Maximus the Confessor talks about how the idea of things, or the form, the essence, the way that the Platonists talked about are actually also the end of things, those two things together. So he kind of takes. He takes a lot of Aristotelian categories in Platonic. Jams them into this thing, which is logos, which is. It's also the reason, the purpose. And that makes it. That brings it into the human, back into the human person, because those purposes come into. Come out, come out of us or join in us, you know, and so the reason why we have a category called rock is a human reason, but it's also totally objective. It's not a subjective reason. It's objective, but it's a human reason."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":2934.26,"end":2934.66,"speaker":"John Vervaeke","text":"Right."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":2934.66,"end":2938.22,"speaker":"Jonathan Pageau","text":"It joins into us. I don't know if that makes sense."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":2938.22,"end":2982.67,"speaker":"John Vervaeke","text":"That makes sense. It makes a lot of sense. Like, it makes a whole lot of sense to me. It's really cool. It's. It's just really. It's, it's. It's. It's. It's. It's it almost. It's so cool. It's so. So it's so. Yeah, it's so. There's something about it so constituting. Like. I get this sense of. As we're talking about it, like, the sense of it is. It's like. Oh. It's like we're talking about what constitutes. And everything's constituted in some level. Right. The constituents of something that is. Feels like. And this is one of the things I've always really. I mean, this is what philosophy is really. You know, I think specifically, like Heidegger and."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":2982.75,"end":2983.23,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":2983.53,"end":3000.49,"speaker":"John Vervaeke","text":"Mercil Ponte and, you know, I didn't quite exactly understand why the hell I started reading those guys. Right. Like, you know, my early 20s, because I didn't understand anything that I was reading. But I. But there was something that. That was being shown, especially Heidegger."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":3000.89,"end":3052.94,"speaker":"Jonathan Pageau","text":"There are some passages in Heidegger which I'm sure he doesn't even understand. Like, I'm pretty sure. Yeah. But there are some passages in Heidegger that are pure gold. Like, he definitely had an intuition about. About this. The way the world shows itself to us. And I think that he opens a door towards. Even though, in a way he was not a. He was almost like he was very much a modernist and he was very much trying to deal with some of the problems of materialism and all of this. But I think that he opens a door which can then bring us. Take us out of it. And so I really. That's why I use Heidegger. I use him implicitly. I don't. I do quote him sometimes explicitly, but there is a Heidegger program running in my mind as well. I have a few programs running. And that's one of them for sure, is Heidegger."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":3053.26,"end":3092.44,"speaker":"John Vervaeke","text":"Yeah, totally. Well, it's like, it's. And it is a very. Like. When you talk about symbolism, right? In the patterns, the way it lays itself out, right in the logos, right. The gathering, laying. Right. The thing that kind of. This sense of the. I mean, that's really. That's one thing for me too, is just kind of really getting that. No, it's like anything. 1. Any. Any perception that you have is a perception to the degree that it's intelligible to you, right into the degree it's intelligent. It means that it's gathered in its intelligibility. And what you experience actually is its. Its intelligibility and its being are the same. The same thing. Right."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":3093.32,"end":3188.11,"speaker":"Jonathan Pageau","text":"That's right. And that's really the key. And the fact that you get that is so important, so few people get there. And you know, I was talking to some atheists recently and you know, like they mentioned Don Hoffman for example. And you can see it's. Everybody has that problem, which is that even though they start to perceive the necessity of something like consciousness or the necessity of intelligences, they always still want to posit like some world out there, that another world, like some other world that's out there, that's not the one that we're. That we're having the experience of. And it's like, how do you, how can you posit that? And. Because you're still there. Like you're, you're still. It's like a weird thing where you have to self deny. And so it's almost like there's a falseness to that. And so I think it's much better. I think that the phenomenological perspective is much better because it says this is it. Like this is the. There is no other world besides the world that we encounter. And we can make abstractions and we can create abstract constructions out of it. Things like, Things like science, things like, you know, the solar system or atoms and all of this stuff. But it still happens within the frame of our immediate. Of this, this design. Right. Of this, this care that you. That you perceive, that you. That you. Things lay themselves out and manifest appear to you because you care about them. And you can't avoid it. And it is relevance, realization. It's like you can't avoid that."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":3188.27,"end":3232.61,"speaker":"John Vervaeke","text":"Yeah, yeah. And that's the thing. It is really all the way down. I like how Heidegger like gets at that. Like being in the world is. Is you're not a being that then cares. The fact that you're a being is already you are a care. Right. That's how the. It's that care that gathers the facts to show up in the particular. And as you do science and all that kind of stuff is all downstream from. Right. This primordial kind of sense of care. Yeah, yeah. That thing, that kind of. That. That sense of really getting symbolism. When did that happen for you?"}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":3235.01,"end":3241.57,"speaker":"Jonathan Pageau","text":"Yeah, it's a. It's a strange thing. It's a. Because it's not just me, it's my brother and I both at the same time."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":3242.21,"end":3244.45,"speaker":"John Vervaeke","text":"We wondering about that."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":3245.09,"end":3261.19,"speaker":"Jonathan Pageau","text":"Yeah, we. I would say that in our 20s we were both kind of on different paths and he was studying math, computer science and I was studying art. We're close, like a year and a half away from each other. So we're kind of. We've always been very close."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":3261.19,"end":3264.99,"speaker":"John Vervaeke","text":"Are you younger and. Sorry, are you younger or older?"}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":3264.99,"end":3286.68,"speaker":"Jonathan Pageau","text":"I'm older. Yeah. I'm a year and a half older than he is. And so we started. I started reading Postmodern Philosophers. I was reading Jacques Derrida, and I was reading Baudrillard. I was reading, you know, just the whole crew. I was. Roland Barthes wrote a little book called Mythologies, which really had a big impact on me."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":3286.68,"end":3291.6,"speaker":"John Vervaeke","text":"Just really quick. So what had you actually read those? Was it part of art school or, like, what had you."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":3291.6,"end":3302.28,"speaker":"Jonathan Pageau","text":"It was art school that kind of pushed me in that direction because I took a few philosophies of art classes. And so they were having us read these authors. It's like, what's."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":3302.44,"end":3306.6,"speaker":"John Vervaeke","text":"Dude? So I'm familiar with art school. I moved to San Francisco to go to art school."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":3307.16,"end":3378.47,"speaker":"Jonathan Pageau","text":"Yeah. That's when I learned about Heidegger and I learned about Jacques Derda. And then that took me on a road of my own. And that's when I started reading Baudrillard and Roland Barthes. And I remember Roland Barthes had a little book called Mythologies, where he was trying to show the mythological patterns in different social manifestations. And he was doing it as a way to mock them. Like, not as a way to mock them, but as a way to try to deconstruct them. But I remember reading those books and thinking, this is awesome. I didn't see it as something like a Marxist desire to destroy these patterns. I thought, this is awesome. And I remember reading Portrait of an Artist and being really hit by Joyce's use of pattern. And so I was like, I was in the modern. Like, in the modern world. And. And so then I became interested in trying to create symbolic languages. And when I was in art school, I became pretty much obsessed with Anselm Kiefer, who's a German artist, who. Who does these kind of. These."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":3378.47,"end":3378.87,"speaker":"John Vervaeke","text":"He."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":3379.11,"end":3502.82,"speaker":"Jonathan Pageau","text":"He uses imagery, and he creates kind of symbolic references within his. He uses kind of this intertextual language within his paintings and stuff, referencing mythological characters and all of that. And so I was kind of trying to do it on my own, and it just wasn't working out. And at the same time, my brother was reading, discovering rabbinic literature. So he had. When he was 16, he decided to learn Hebrew on his own and then started reading, you know, rabbinic literature and mystical Judaism. And so we kind of had discussions and discussions and discussions because, you know, we would just talk every day for hours and hours and hours, and we kind of created even this like weird hermetic language that if you would listen to a conversation of ours, you just wouldn't understand what we were talking about. And then both of us, he discovered this author first. An author. His name is Rene Guinon. He's a French traditionalist. And when he read Guenau, he said. My brother said, you have to read this. Like this. This is what we've been looking for for years. Like, we've been looking for this forever. And so when I read Guinot, it really reshaped my thinking. You know, he was. There's a lot of problems with that author, like, serious problems. That's why I don't quote him too much, because he has a lot. A lot of remainder of occultism in his work. And there's a lot of weird associations he's had. But nonetheless, his insight into symbolism was just beyond anything I'd ever seen. So he wrote a book called what is It? It's because I have it in French. The Symbols of Sacred Science. He wrote a book called the Great Triad. He had several books where he worked out these symbolic patterns. And then. So I kind of was trained that way. And then I started to read the Church Fathers and saw that, no, it's all there in Christianity. It's all there in the Fathers in San Gregorio, Nyssa. And I found the Fathers that really, I felt had had that intuition and. Yeah. And all that led me to become Orthodox."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":3502.9,"end":3505.66,"speaker":"John Vervaeke","text":"Right. It's gonna be Maximus and father of."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":3505.66,"end":3510.66,"speaker":"Jonathan Pageau","text":"St. Gregory of Nyssa, Senate from the Syrian. Those are really my guys."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":3511.06,"end":3523.47,"speaker":"John Vervaeke","text":"Yeah. All the Neoplatonic, Platonic. I just started reading Saint Maximus the Cosmic Cosmic Mystery. Yeah. Yeah, just started. Yeah."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":3523.47,"end":3535.95,"speaker":"Jonathan Pageau","text":"It's a nice little book because they've chosen the text and so they. They kind of chose the right. They really chose the right text. Some of those. Some of those are just. Just blow you away. Some of these because they're so short. And he just kind of says things and it just."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":3536.27,"end":3563.08,"speaker":"John Vervaeke","text":"Yeah. Get to. He does something. It seems like St. Maximus is. He's at least when I think, like when I. At least the way it occurs to me, like when I look at just all the stuff, like Saint Maximus, like, stands out with something. I don't know exactly what it is, but there's something he gets or a way he says it or a place he's standing that just seems to be fundamental. Is that your experience with him or what's."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":3563.16,"end":3634.98,"speaker":"Jonathan Pageau","text":"Oh, yeah. I think that he offers up gold and you have to be careful because he does it in very succinct. Way. And so you have to be careful because you can go. You can miss it. And so you have to read, like, his little text, like his little ambiguous or his little. You have to just kind of take your time and then read every sentence of that text and just kind of slow down because he's kind of. He's not. He's not gonna start blabbing. He's really gonna give it to you in these. These very powerful images. And so he's definitely. Yeah, he's. I mean, if you. Once you've read St. Maximus and you've kind of understood what he talks about, then, then a lot of. I think it's easier to know that the things I'm talking about, I'm not taking it out of my own imagination. It's like, I will take St. Maximus and I will definitely apply some of the patterns to things that he didn't apply. Like, I'll interpret things that he didn't interpret. But the main thrust of his vision of this union of heaven and earth and all of this. And then St. Ephraim, especially, like, the mountain. All of these things I take from. From these fathers."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":3634.98,"end":3659.94,"speaker":"John Vervaeke","text":"So interesting. So you were so. So basically, like, you were in art school, right? And then you started getting assigned these books and you started cracking them open, and you're like, this is. This is. You're reading their symbology and their distinctions right now. Before that was. Was your. Like, did you have much of an intellectual life before that? Like, what was your relationship to all this stuff before? Before?"}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":3660.42,"end":3730.4,"speaker":"Jonathan Pageau","text":"Well, I mean, my father. My father was a very intelligent, thoughtful person. And so in our house, you know, curiosity and discussion was encouraged. And we definitely always saw. Both my brother and I always saw my father as a very intelligent and thoughtful person. And I have several memories of my father piercing through the appearances, like where he sees things happening and then, you know, and then he says something to us. And I can see that he kind of sees through the veils, you know. And so I think that he. There's definitely a legacy coming from him in terms of. In terms of a desire to kind of. To go further and to see through the appearances, you could say. But it's definitely in university, like most people, it's university that really kind of forces you to deal with this stuff because they kind of. It's a really high, you know, really intense moment of thought and end of discussion and of, you know, exploration. You have time to read. You don't have a lot of worries in life. And so it really is a Good time for that."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":3730.8,"end":3734.92,"speaker":"John Vervaeke","text":"Must have been just an amazing time, like, with your."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":3734.92,"end":3758.01,"speaker":"Jonathan Pageau","text":"It was existentially difficult, though, because it was. Because it was this crisis, because I grew up in an evangelical world, and so it was a crisis for me because I couldn't reconcile what I was discovering and the powerful imagery and the powerful patterns I was discovering. I was struggling to reconcile it with my surrounding."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":3758.57,"end":3761.85,"speaker":"John Vervaeke","text":"And so you mean at art school, or."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":3761.93,"end":3854.08,"speaker":"Jonathan Pageau","text":"I mean, just through art school, and then later discovering these symbolic thinkers. Even in art school. Like, while I was in art school, I was writing and directing these plays in the kind of evangelical world. And so these huge, like, massive productions with, like, 30 people, and there was music. And so I was directing these plays. The last play I wrote, man, it is like. I don't think I'm surprised you even put it on, because it was really. I was taking all of this stuff that I was dealing with. It was about the bronze serpent and the idea of, like, casting down idols, but building idols. And it was about an architect whose buildings fall down. And so you had this massive sandbox on the stage, and then you would have this person build up these things, and they would always fall. And so it was like, this whole, like, trying to deal with the problem of postmodernism. It's like, I can't believe they even put it on. But nonetheless, they did. And so you could feel like, in that play that I was struggling. That I was, like, just struggling to kind of. To fit it all together, you know, because I was being ripped apart, in a way. And it's really the discovery of Orthodoxy and just the traditional church fathers, which were finally a reconciliation for me. Because I think that without that, I probably, at some point, might have stopped being a Christian. Because, you know, it's like, I was. I always loved Christ. I knew that I belonged to Christ. But then I looked around me, and I felt like what I was seeing was extremely superficial."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":3854.56,"end":3874,"speaker":"John Vervaeke","text":"Right. And what were the things that you're kind of seeing? Was it. Was it like, the event? Like, how is evangelistic Christianity different than orthodox? Or things. Or things that involved it, like the older church fathers. Is that kind of what started to rip apart or part of what."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":3874.08,"end":3948.24,"speaker":"Jonathan Pageau","text":"Yeah, for sure, because there's a. There's like a. There's something arbitrary about the way that Scripture is presented. And it has to do with. At least in the. It's not all these churches. They're just the ones I grew up in. And it didn't help that, like, I'll blame my father. It didn't Help that my father was really smart and was actually questioning and always trying to pierce through. And so at the same time, being in a situation where people would talk about the Bible as if it's. It's like this. And it's also because they were so scientific and materialist minded. And so then they would talk about Scripture as if it's like, as if they're describing a car. And it's like, here are the parts and this is how it works, right? It's like, okay, so Adam and Eve sinned in the garden, they did something bad. And so in order to solve that problem, then God sent Jesus to die in their place. And it's like, it's like, it's, it's like a. It's like a two plus two equals four. And then, then because of that, now if you believe in that, then you go to heaven when you die. And it's like, that really is not enough. It's just not enough. It's just not. I'm sorry. Just not."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":3948.56,"end":3949.12,"speaker":"John Vervaeke","text":"Yeah."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":3949.28,"end":4016.71,"speaker":"Jonathan Pageau","text":"And so when I started to see, like when I let's. Like when I started to see that the pattern of Genesis is the same as the pattern of Moses crossing the Red Sea, and it's like. But then no one around me wanted to acknowledge that because they felt like if they acknowledged that they were somehow damaging the authenticity, the material authenticity of the story. It's as if I can show that there's a pattern in the story, then I am somehow saying that it's just a story, that it's not actually something that happened because things that happen in the world don't have patterns, which is obviously not true. But it's weird because I think that we're in a different space now even than when I converted to orthodoxy. So, for example, like, there's an amazing group of guys called the Bible Project, and they're doing these videos on the Bible and it's like, it's full. All of a sudden. They have these perceptions of all these patterns and the way that the text is constructed, everything. And I'm thinking, I think we might be in a different space now than what I was, let's say, 20 years ago when I."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":4018.42,"end":4067.47,"speaker":"John Vervaeke","text":"Right, right. I appreciate, really appreciate what you said about, like, it was, it was actually the, like the postmodernism that really opened all this up. Right. In a big way. Right. And also I also, I also appreciated what you said about your dad. I mean, actually my dad's kind of. My dad has something in him like that. But like some of the Best moments with my dad are actually moments where he. He said something that was just piercing and revealing of something. Right. Like, those are. Those are. Actually. Now that you said. I really thought about it that precisely before, but now I think about some of the best moments. My dad were always ones where he'd say something that. Like. Where he would reduce the entire universe of my experience down to a. Like a bumper sticker that kind of opened it up again or something. Right?"}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":4067.63,"end":4070.35,"speaker":"Jonathan Pageau","text":"Yeah. Like an aphorism that would contain it. Something like that."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":4070.35,"end":4119.52,"speaker":"John Vervaeke","text":"Yeah. Remote. Yeah. And there's a certain sense in which. Yeah. I think actually it's funny, I never really thought about with my dad, but, like, that's. That there's something about those moments that I think taught me to listen. In some way, it. Like. Yeah, in some way, I just. I mean, I can feel that it kind of in my body as I'm talking about this. Kind of just open like that. You can do that with your. You can go from. You can take your own experience. Right. And, like, you can somehow see all of reality in your whole experience in a way that has. You relate differently to your experience. You can. That way. Like, I think my dad had these. Yeah. So I think I sympathetically appreciate what you said about your dad. Right."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":4120.8,"end":4171.27,"speaker":"Jonathan Pageau","text":"I mean, we're very fortunate, I think, you know, and, like, in my family. My family really fostered also just the capacity to do the thing that you're gonna do, you know? And that was something that was really important in my family. So my. My youngest brother was actually a professional skateboarder for several years. You know, he lived in California. Yeah, he lived in. He lived in Long Beach. Did that whole thing for several years. And then Mathieu, who was more kind of a mathematician type, and developed his symbolic thinking, you know, almost like a pure science. And then I am more the artist, you know, my vision, my approach. Assembler is more lyrical and kind of messier than my brother because Matthew is like. Matthir shoots like, arrows. You know, his chapter, like, three pages, and they're like. Sorry."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":4171.67,"end":4173.67,"speaker":"John Vervaeke","text":"He's the one that wrote the book, right? About."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":4173.67,"end":4176.63,"speaker":"Jonathan Pageau","text":"Like he wrote. Yes. The language of creation."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":4176.63,"end":4179.27,"speaker":"John Vervaeke","text":"Yeah, that one is. Goes right to it."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":4180.47,"end":4196.69,"speaker":"Jonathan Pageau","text":"I could never write a book, book like that, you know, because he just shoots. Like I tell people, go slow. Because it's kind of like reading Sam Axis where, like, he does. There's no mincing of words in there, you know, there's nothing extra. Even the footnotes. Like, I tell people the best stuff's in the footnotes. They're there for a reason. Don't miss them."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":4199.41,"end":4221.27,"speaker":"John Vervaeke","text":"So when you were going through. So there was the part where it was incredible when you were in college, Right. So it's like the logos is opening up in this completely different way, but then it was opening up to a degree where you couldn't make sense of, like, your current experience and your past experience without it feeling threatened. Right. In some way."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":4223.11,"end":4255.41,"speaker":"Jonathan Pageau","text":"It was hard to join all of it together. And also because I was an artist and I was, you know, I grew up in a Baptist church, which, although not openly hostile to visual art, is at least implicitly hostile to visual art. And so it just wasn't working. It just wasn't fitting together. And so. And I feel like, yeah, I'm happy of how things happened and how things kind of brought me to where I am."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":4257.01,"end":4267.34,"speaker":"John Vervaeke","text":"And then the crisis part of it, like, was that when you did it start to resolve when you found it in the Church Fathers, as you were talking about?"}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":4267.34,"end":4276.98,"speaker":"Jonathan Pageau","text":"Yeah, definitely. Oh, yeah. When I read, you know, like, when I read Sandy Hernaeus, for example, it's like, Sandy Hernaeus is really back there. I mean, he's one of their early fathers."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":4276.98,"end":4277.26,"speaker":"John Vervaeke","text":"And."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":4277.5,"end":4281.5,"speaker":"Jonathan Pageau","text":"And he has San Diennes, has a very powerful symbolic understanding."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":4281.5,"end":4281.82,"speaker":"John Vervaeke","text":"He."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":4281.98,"end":4299.06,"speaker":"Jonathan Pageau","text":"The thing is that it's not. It's hard because his writing, he just drops these things in his writings. You can't. It's not like people ask me, like, where in San Diennes. I'm like, I don't remember, because it's not like he's written about it. It just kind of, all of a sudden you're reading adverse heresies. And then, like, this thing drops, like this."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":4299.06,"end":4299.38,"speaker":"John Vervaeke","text":"This."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":4299.38,"end":4330.9,"speaker":"Jonathan Pageau","text":"This massive knowledge drops. And so when I read early Fathers, like St. Irenaeus and, you know, even St. Clement of Rome, for example, I thought, okay, man, there's something missing. This is there, you know, this is. It was all there. And then it kind of went away. And I got very, very excited. Like, I was really excited to read. To read the Church Fathers. I was devouring. You know, like, when I read Life of Moses, I was just like, where has this been all my life? You know, this is so amazing."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":4332.1,"end":4353.49,"speaker":"John Vervaeke","text":"So I just. I want to get. I want to just kind of get that because I think I just kind of got a little bit. So it's like, there's the way where the patterns actually had everything, like, erupt. It's, like, ecstatic on one level, but then kind of also questions everything. And then you. And it was an after art school that you found."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":4354.05,"end":4355.01,"speaker":"Jonathan Pageau","text":"Yeah, it was after."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":4355.49,"end":4355.85,"speaker":"John Vervaeke","text":"Right."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":4355.85,"end":4444.46,"speaker":"Jonathan Pageau","text":"Yeah. And the thing. The thing. Also the thing, the positive thing about growing up in a Protestant church, like a really positive thing, is that the fact that they really focus on the Bible means that you know the stuff. So it's like I had the stories. The stories were stored in my memory. Like, I knew the Bible stories. Like, I knew the scripture. I knew what Christ said. I knew what St. Paul said. And so. But it was there in almost like a latent form. And then all of a sudden, when I started to see the patterns, then it was like. It was as if someone. Like, someone opened up the curtain to my past experience and then just connected it all together, right? Because it's as if. It's almost like you're watching a movie. You're watching a movie that has a. That has a surprise ending. You're watching the movie, and you're kind of like, okay, this is okay. You know, I get it, I get it, I get it. And then all of a sudden, they show you something that reveals the whole thing from the beginning. And so that was my experience. It was like. Because I had it all there. It's not like I was learning new things. It was just connecting things that I already knew. And so to me, that was probably the most intense. Like, let's say the most intense moments of kind of ecstasy were these moments where all of a sudden something I'd known Since I was 8 years old all of a sudden just kind of smashed together. And then it shines. Like, it becomes bright, you know? I don't know what else to say."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":4444.62,"end":4478.64,"speaker":"John Vervaeke","text":"Yeah, I totally get it. It's funny, like when he said about the latent. Right. It's like back there, they're stories that, like, you know, in the back of your hand, they're just part of the background. And then you're looking and everything's, like, ripping apart and. But it's luminous. But yet it's threatening. And then. And then all of a sudden, you look back, and then your own history. It's. God, that's so interesting. Like, your own floor reveals itself to you, but it's like. It's not new. Yeah."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":4478.64,"end":4480.28,"speaker":"Jonathan Pageau","text":"Yeah, you're right. It's not new information."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":4480.6,"end":4487.1,"speaker":"John Vervaeke","text":"Amazing. That's really amazing to hear, to imagine."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":4487.58,"end":4498.7,"speaker":"Jonathan Pageau","text":"Yeah. It's funny. You gotta be, like, talking about myself so much. I'm not used to doing that. I feel like I'm giving my testimony here. It's becoming a little embarrassing. Yeah."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":4498.86,"end":4502.94,"speaker":"John Vervaeke","text":"Yeah. It's just where my curiosities go. Because I could always feel."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":4503.34,"end":4504.7,"speaker":"Jonathan Pageau","text":"I can always feel your videos."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":4504.7,"end":4603.49,"speaker":"John Vervaeke","text":"It's like, look, the only reason that you're talking about all this stuff is because it's part of your experience, right? Like, I just have always had these questions about, like, in what ways are part of your experience. You've mentioned a few of these things, right? So just these things I've been curious about, right? Because I know that for me, it's like these kinds of. My life is defined by these. My own version of these kinds of things where it's like, right? Like moments where I'm in hell and it all looks like it's going to go over and then something happens and then it connects to everything else. And then like your whole history makes sense and like it's, it's through. You know, it's funny. And actually it part of it for me. And I've always had a heart, been having. I don't know if I've been able to communicate this. I haven't been satisfied with the way I've been able to communicate this. How? How when you read something, right? When you read Heidegger. Right? Right. So you read a text that's like, you sense that something's there. You sense it, like, but it's just beyond what you know. And then there's the act of reading it, right? Which is. And I think this has something to do with my learning disability and I'm dyslexic and stuff like that, but that there's a way of getting into this information, if you want to call it information or knowledge. Right. And that if you practice reading it, that you look up from the book and then you start to see. See it somehow. Like, it's what I felt like with Heidegger without knowing it. Heidegger was teaching me how to see. Yeah, that's what it was."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":4603.49,"end":4641.13,"speaker":"Jonathan Pageau","text":"Especially Heidegger. Like, of all people, it's as if you. To understand Heidegger, you have to. You have to enact it. It's not just. You can't just be like a mental understanding, right. You know, And I think that also Matier's book, that's how he wanted to write it, you know, so he wanted to write it in a way that this is going to make sense when you apply it, not when you're not just when you're reading it. It has to find body. And I agree. I think that that's, that's, that's that especially someone like Heidegger, it's like you really have to. You lift your eyes up and all of a sudden, it's changed you, and you don't totally understand why, you know, or how."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":4641.61,"end":4781.1,"speaker":"John Vervaeke","text":"Yeah, for me, it was. I mean, I really didn't have any idea because we. What was happening is right at the time that light circling started to happen, right? Was the same time when I started reading. A friend of mine had a book on Heidegger and started talking about being. And I'm like. And I just. It just glowed. And so I just followed it. And at the time, we lived in San Francisco. I lived in San Francisco. I was right down. Down the hill from the Art Institute, and they had Barnes and Nobles across the street. And I was a poor student, so I'd go in there. No one bought the Heidegger books, right? So I'd go there and I would just, like, have the whole library to myself. And I'd go in there, drink coffee and read, Being in Time and have no idea what I had just read. I remember. I think I was reading Being in Time for two months before I knew what Dasein actually meant. All right? But the. But I didn't really know what the connection was between that and circling until two and a half years later, right? When. Because I would read and then I go circle on the beach and in our courses and all these different ways that we do that, right? And I go back and forth, back and forth. And then at some point, I overheard the style of the language that came out of all of that as it started to become, like, a thing, which I have mixed feelings about its thingliness. But, like, when he started talking about, oh, getting your world. Oh, a world and background and foreground. And I started to notice that it started to make its way in the. Into the lingo of the practice. And then I heard it, other people talk about it, and I was like, oh, wait a minute. This is the same. This is Heideggerian speaking. I'm like, oh, very funny. Right. This kind of. So there's something about a little bit of what you're talking about that's familiar to me, right? Like, it gets you at a. It gets you at a level that's. That you don't necessarily understand at the time that you're learning what you're learning, right? Until it becomes manifest in your perception somehow or in the way that your experience lays itself out to you and shows itself to you."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":4781.98,"end":4783.32,"speaker":"Jonathan Pageau","text":"Yeah, yeah. No, that makes sense."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":4783.32,"end":4793,"speaker":"John Vervaeke","text":"Sounds like that really happened in a big way and that. That was actually the way that you stepped into your. The orthodox path, right?"}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":4793.88,"end":4876.64,"speaker":"Jonathan Pageau","text":"No, definitely. I think I think it happened a little bit. It happened a bit before that I even found Orthodoxy, because at first I was sad because I was like, oh, here it is, and the fathers, here it is. But then it's gone. Like, it's nowhere. The same with the art. Like when I discovered medieval art and how patterned it was and just how it was this amazing intertextual, you know, algebra of language. And I thought, wow, this is amazing when it's gone. Like, it's all gone now. And reading and discovering the Orthodox Church and realizing that it was all still alive in the Orthodox Church is one of the things that made me say, okay, well, this is it. Like, I. Because, you know, to be an iconography, to kind of dive into the language of iconography, you could do it in an archaeological way. But then that's not the point, right? If we're talking about these ways of embodying and these ways of existing in the world, and if I'm going to study an ancient language, like an archaeologist, and I'm alienating myself constantly, but I wanted to be in the language, and so I had to kind of find a path where I could do that. And that's what it is. Like, the icons I make are made for people, for churches. They're not idiosyncratic objects. They're objects that actually exist in people's lives to foster their spiritual practice or to celebrate something."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":4876.8,"end":4895.7,"speaker":"John Vervaeke","text":"So, yeah, that's great. Wow, that must have been something to kind of realize. And was that synonymous when, like, when you. Were you already carving iconography, when you joined. When you joined into. No, this is after you went."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":4895.94,"end":4967.1,"speaker":"Jonathan Pageau","text":"Yeah, it kind of came together. Where I started attending an Orthodox church when I was looking to paint icons. The carving icons is almost accidental because I wanted to paint icons because everybody who becomes Orthodox wants to paint icons because that's what is the main tradition. But I couldn't find a teacher, and I was very eager. Like, I was really eager to do it. And so I ended up. My parents cut down a tree in their yard, and they had this wood. It was like a linden tree. So they said, oh, this. This linden wood we hear is good for carving. Would you like some pieces to kind of fiddle around with it? And so then I was like, yeah. And I said, I need. I want to carve a cross. Like, I want to carve a blessing cross. So I kind of carved this thing with, like, X acto knives. I didn't have any tools. I took forever to, like. And it's horrible. I still have. Was really bad But I really enjoyed it. And so it was almost like. It was almost. It was obviously not accidental, but it was. It was not what I would have imagined, that I would carve icons. It just kind of presented itself to me, and then I did it and I continued. And there you go. And here we are."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":4967.74,"end":4973.34,"speaker":"John Vervaeke","text":"Wow. Wow, that's great. It's great to get to know you. Thanks for. Thanks for coming on."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":4973.53,"end":4978.17,"speaker":"Jonathan Pageau","text":"I've been really appreciated. It's my pleasure. I feel like you got to know me, but I didn't get to know you very much, so."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":4978.17,"end":4980.09,"speaker":"John Vervaeke","text":"Yeah, we could do now. I mean, we could do another one."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":4980.25,"end":4988.73,"speaker":"Jonathan Pageau","text":"Yeah, that'd be nice. I'd like to. Because I don't totally understand what the circling thing is. Because I hear circling, but I don't know what it is, and I don't totally understand it."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":4989.37,"end":4991.93,"speaker":"John Vervaeke","text":"Well, I can just give you this short version of it."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":4992.09,"end":4992.89,"speaker":"Jonathan Pageau","text":"Yeah, go for it."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":4993.37,"end":5057.65,"speaker":"John Vervaeke","text":"What I still find. I'm still finding out what it is for me. That's my experience of it. Right. But it's circling is. And I think it's helpful to understand that. I feel I'm starting. And I didn't understand this until, God, probably about eight, ten years into it, I started to get like, oh, okay. What is this responding to? I think it's directly in response to that. It's only been. I think it first started with the answering machine, but what really got big, you know, with texting. Right. And all these different. All these different social media things where we were able to separate. It became like you were able to consistently separate, like the basic exchange of interaction they used to always have to do in person or on the phone. Right, right. And, you know, those interactions are basically how you learn how that's how you become a self is through those social interactions. Right?"}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":5057.73,"end":5058.21,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":5058.21,"end":5190.99,"speaker":"John Vervaeke","text":"It's only been, oh, 15 years or so since you've introduced a division where you don't have to do most of them. Right. And because they're filled with so much ambiguity and so much discomfort, that just was also the same thing. I think the same thing happened with our bodies. Right. With Industrial Revolution brought machines, brought everything to a small circle in front of us. So to function, you don't have to move anymore. And then we got fat. Right. And then you had this whole different transformation of what even a body was. And now you have gyms and these ways of trying to somewhat deal with that. Right. Which has been transformative. I think the same thing's happening with relationship. And I'm. And I'm realizing Like part of. Part of why circling has gotten so big is because it just happens to be a. It's basically a yoga that just basically takes whatever it is, whatever it is. At the most basic level, if you were to take the asanas of all the. All of the impactful, personal conversations that have been like life changing or deep or intimate, that have been nourishing. Right. If you're just to basically take the elements of that and make them kind of postures, if you will, Circling is just basically getting together in groups and taking those postures of listening, of speaking, of communicating, that invite those moments. And it took me a while to realize that. I think a lot of why it's gotten so big and people have responded to it because basically it's. It's very much like a gym. A gym with our bodies is a response. Right. To that. We don't move anymore, so we have to go into an environment in order to move. I think something similar is happening with circling. So it's basically, it's a practice. And of course, the practice when people start doing it, they start having really, really, really deep spiritual kinds of experiences, really moments where they wake up and stuff. But it's essentially, it's a yoga for relationship and intimacy, I would say."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":5191.23,"end":5202.23,"speaker":"Jonathan Pageau","text":"Okay, I'll have to definitely look into it then. Yeah, yeah. I don't think I've heard it. I've seen you talk about it and I've heard John Vervake mention it and stuff, but I haven't had the time to kind of look into it."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":5202.23,"end":5216.82,"speaker":"John Vervaeke","text":"Yeah. And then John's frame with it is like, you know, it's like it's essential. He sees it as kind of an essential, in his terminology, the ecology of practices that he talked about. Yeah, yeah, yeah, yeah, yeah, yeah."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":5217.14,"end":5225.38,"speaker":"Jonathan Pageau","text":"I didn't realize we talked for like an hour and a half. I never do that. You got me really in a weird. In like in a good space. I guess so. I appreciate it. Thanks a lot."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":5225.46,"end":5228.5,"speaker":"John Vervaeke","text":"Yeah, I really appreciate it too. Let's do it again sometime."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":5228.66,"end":5230.82,"speaker":"Jonathan Pageau","text":"Yeah, let's stay in touch. All right. It's good to talk to you."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":5230.82,"end":5232.02,"speaker":"John Vervaeke","text":"Bye. Bye. Bye."}
{"episode_id":"SW - #138 - 2021-01-26 - Guy Sengstock - Being, Intelligibility and God","start":5233.3,"end":5298.28,"speaker":"Jonathan Pageau","text":"I hope you enjoyed this episode of the Symbolic World. The Symbolic World is edited by Justin Ward and it is based on a series of videos that you can find on my YouTube channel, Jonathan Pedro's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course, leaving a review on itunes. Everybody knows that's the best way to get the podcast out there to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon Pajo videos as well, and on subscribestar, all those links you can find on my website or in the show description. So thank you and I will see you soon."}
