{"episode_id":"SW - #410 - 2025-09-22 - Fractals - The World Is Full of Meaning (Midwestuary talk)","start":0.16,"end":62.89,"speaker":"Laura Diaz","text":"Tucson, the weight is over Mediweight loss. They're officially open on North Oracle road. That's right. No more counting down the days. You can walk in right now and start your journey to a healthier you. Hey, it's Laura Diaz from iHeartRadio. And you can trust me. This isn't just another weight loss clinic. I know that because it's where I lost weight safely with real medical support. GLP1 medications. You can see them everywhere online right now. But the truth is your health shouldn't be a DIY project ordering these meds without the professional guidance. It can lead to dangerous mistakes, wrong doses, no oversight, and serious risks at mediweight loss. I got the same medication, but with a customized plan, weekly check ins, and a licensed physician guiding me every step of the way. And the cost? The same as those risky online options. Tucson, your moment is here. If you're ready to take control, feel better, and lose weight the right way, mediweight loss is ready for you. Walk in, get started and see real results. Call or visit mediweightloss.com to learn more and book your free consultation today. That's mediweightloss.com the whole world is a."}
{"episode_id":"SW - #410 - 2025-09-22 - Fractals - The World Is Full of Meaning (Midwestuary talk)","start":62.89,"end":104.56,"speaker":"Jonathan Pageau","text":"Miracle, and we struggle to see it because we're so used to it. We're kind of bored by it because we just live in the world and we're used to it. But once you start to realize to what extent all things are held in spirit, in God, you realize that the miracles are just really very bright versions of something that happens all the time that is constantly underlying the world. So we're going to try to look at that. This is Jonathan Peugeot. Welcome to the symbolic world."}
{"episode_id":"SW - #410 - 2025-09-22 - Fractals - The World Is Full of Meaning (Midwestuary talk)","start":118.62,"end":162.02,"speaker":"Conference Introducer","text":"I know people say things like, you know, such and such does not need an introduction, but I think that's probably true of all of our speakers today. But I think many of us have the experience of clicking on a video and watching Jonathan Pageau do his thing. And one of my favorite things that he does is this saying where he says, I just don't know what to tell you, but he does. So. Jonathan, Please, everybody welcome Jonathan up for his song is this good? You?"}
{"episode_id":"SW - #410 - 2025-09-22 - Fractals - The World Is Full of Meaning (Midwestuary talk)","start":162.02,"end":991.29,"speaker":"Jonathan Pageau","text":"Yeah, no, I'm fine. I'm fine. Hey, everyone. Everybody organizing this conference is really good at making it feel like we're just all a big family hanging out. And so. Yeah. All right, all right. So fractals, everybody. So this is something called the Sibirsky. How do you pronounce it? Sierpinski triangle. I mean, it existed before the mathematician, but I guess it took his name. And so I thought if we're going to talk about fellowship of the spirit, I thought because I'm with a bunch of experts here, the people who have been kind of following these conversations for a long time, I thought we would try to push a little harder on our understanding of what that means, of why these words that we use are not arbitrary. You know, we. We've spent several, maybe the last 100 years, people trying to convince us that a lot of these words are kind of just arbitrary words. Spirit, angel, heaven, all these things, but they actually have meanings, and they actually are talking about reality. And so we're going to look a little bit more about how it is that spirit embodies itself in the world, and hopefully it will move us a little further. And I'm pushing myself harder because when I'm. When I'm with you guys, I feel like I can do that too. I can kind of on the edge of what I understand. And so if I'm. If you see me skating a little, hopefully you can be more forgiving than people in other. In other circumstances. And so one of the things that sometimes makes it harder for us. How do I know how much time I have? Is there a way to do that? Oh, I see. It's right there. All right. Sorry. I just want to make sure I don't go over. So one of the things that makes it difficult for us to understand what it is we're talking about when we talk about spirit or fellowship of the Spirit or the way in which spirit embodies itself in the world is really, is our difficulty thinking in terms of fractals. It's the difficulty in understanding how this is constantly happening all the time in everything that we encounter. Right. And that all things and all. All parts of things are always God sustaining the world through his Spirit. The whole world is a miracle. And we struggle to see it because we're so used to it. We're kind of bored by it because we. We're just. We just live in the world and we're used to it. But once you start to realize to what extent all things are held in spirit, in God, you realize that the miracles are just really very bright versions of something that happens all the time that is constantly underlying the world. So we're going to try to look at that a little bit. So maybe go to the next slide. And so in the Bible. The Bible starts with these. These basic categories. Heaven, earth. At first, we don't really know what it is because these categories are kind of Empty. And then as the Bible progresses, you could think that the whole Bible is there to help us understand what these are talking about. Now what the first thing that's important to understand is that neither of these categories are in the world, in the world as we experience it. They're not things. Heaven is not a thing. Earth is not a thing the way it's described in the Bible. Earth is chaotic, potential, right? It's tohu bohu. It's this emptiness and void, right? And heaven is the place out of which God's voice comes and forms reality. And so it's not, it's not in the world. That's really important to understand because when we start to think that they're in the world, then we get massively confused when we look at, when we look at things, because we just can't see at what proper level we can look at. So it's really important to understand there are different words that we use, right? So when we talk about spirit and matter, matter, if we think about it that way, matter also doesn't exist. It doesn't have an existence unless it is qualified by heaven. Everything that has a name, everything that you can recognize, is a joining of heaven and earth together, right? And so a way of thinking about it, I'm giving you a basic idea, is you have order coming from above, coming from heaven, and you have potential or chaos that comes from below. And you need those two categories, you need those two things in order for anything to exist. And this joining of order and potential is happening in every being that you recognize as existing. So you could think of every single being has heaven, earth inside. And there are these images that the church fathers use that are beautiful. They talk about how in your heart there's heaven and earth in your heart, right? And there's a ladder in your heart that connects heaven and earth together. But that if you, if you continue to push into that idea, you realize that everything has heaven and earth inside, everything has heaven and earth. Relating is like a little temple, right? Everything is a little temple, a little, a little revelation from God. And like I said, it's only because we're kind of blase and bored that we don't see it. So to bring language that is a little more, let's say, practical, you could say that heaven offers identity and earth offers variation. So let's go to the next slide. So when God creates the world, he says a bunch of weird things. He does it a few times. He says, let the land produce vegetation, seed bearing plants and trees on the Land that bear fruit with seed in it according to their various kinds. It's such a weird way of phrasing it. So God doesn't. We always think that God creates things? Actually, God in this case doesn't create everything, at least in this. He basically gives a basic category. And he says to earth, produce variation on this category, right? So produce plants, and the earth produces plants. But he says what's important is that the plant contains seed. It contains seed because seed is heaven, right? Seed is an image of heaven inside. Why is seed an image of heaven? Because seed is a pattern of a plant, right? The seed isn't the plant. It's like a little dot. And in that little dot there's the whole pattern of the plant. And now it has to be put into the earth and it has to embody itself using the potential of the earth that offers itself to the pattern. And that is what creates a particular plan. That image is true of everything. It's true of everything has a pattern, and the pattern embodies itself and then manifests itself in variability, okay? And so that's why it's very important to note when you talk about fractals, right? Already in this text, you can see that God is setting everything up in a fractal. He's providing the seed, right? He's providing the pattern. He says, let the land produce vegetation and let every version of that vegetation reproduce what I'm saying. So let the earth produce vegetation and let every plant then have in it a pattern that will reproduce itself and will have variation in it. Like we'll take the earth and create different verges. Because let's say you have a maple tree. It's very practical. I know it's hard to think this way, but it's very, very practical, right? So you have trees, right? And then you have variations on trees, and then you have a maple, and then you have variations on maples. Then you have the one maple tree that is planted in your backyard, and that is a specific maple tree that is the joining of all these patterns, the pattern of tree, the pattern of maple, of this particular kind of maple that is now a very, very particular hard tree that is totally unique and is different from all the other trees, right? So it's both completely different from all the other trees, but it's all. It's a manifestation of all these patterns that it's participating in, right? And so when God says, let the earth produce vegetation, and then he's saying, now the things that it's going to produce are going to Repeat what I've just said, which is, every plant. Every plant is going to have an identity and is going to have a variation, and that is indefinite. There's an indefinite version of this, right? There's no limit. And that's why it's very difficult if you don't think fractally. It becomes very difficult to see some of these patterns because they're always manifesting themselves. Like they're, like. I call them cascading hierarchies. So there are all these hierarchies that are manifesting themselves simultaneously, and they're all valid. It's not like anything goes or anything's possible like these. They're valid, they're true, but they're multiple. Like, they're all multiple at the same time. So every single being that you recognize as being one has to be this joining of potential. So, I mean, let's do the. The bottle, right? And so, like, you recognize. You recognize the purpose of this, right? You recognize the name of it. You recognize the reason for it. You recognize that it's there for you to drink water. And you know that there are many types of things that you could use to drink water with, right? But you have the capacity to both know that this is the same as, like a. A ceramic cup, but it's also different. And it has its own particularities to it, but it participates in that pattern. And then you do it completely unconsciously. You can recognize all of the patterns and you know what it's for. And you also know that it's not. It's my water bottle. It's not his. Like, you could have two on the table, and you could know that they're different, and you could also know that they're the same. And you're completely fine doing that, right? It's completely normal for you to do that. But once you start to think with fractals, you can start to see how this plays out, and especially how it plays out in terms of groups of people, because that's the theme of the conference. The theme of the conference is fellowship in the spirit. So what are we talking about when we talk about a group that has fellowship? How is it that heaven acts on us? How. What is. What type of causality does heaven provide on groups? Now, you've seen in terms of objects that heaven provides identity, right? It provides purpose. All these things are invisible, right? You can't see the purpose of the bottle in the bottle. It's not there, right? It's in the purpose. And that's why this bottle could be Used to this thing here could be used to do other things besides being a bottle. Right. It could become a weapon very fast. If someone's running at me, I could throw. All of a sudden, it becomes a weapon. That's because the patterns are real and they instantiate themselves this way in variation. And what's real is mostly the patterns, right? The patterns are the things that are the most real about things. And that's the first thing we have to flip in our mind when we're materialist, is to realize that the world is anchored in logos. The world is not anchored from below first. It's first anchored from above. It's anchored in purposes, it's anchored in names. It's anchored in reasons why things exist. And then those reasons find their instantiations. They find their multiple instantiations in the world. And those are the ones that are actually quite unstable. The things down here below, they're actually quite variable. Things shift and change. Right. The solidity is not down here. Hopefully that'll make sense once we look at groups. All right, so I'm gonna. Let's go to groups, because I don't want to. Let's. Next slide, please. All right."}
{"episode_id":"SW - #410 - 2025-09-22 - Fractals - The World Is Full of Meaning (Midwestuary talk)","start":995.21,"end":995.77,"speaker":"Laura Diaz","text":"All right."}
{"episode_id":"SW - #410 - 2025-09-22 - Fractals - The World Is Full of Meaning (Midwestuary talk)","start":996.25,"end":2815.83,"speaker":"Jonathan Pageau","text":"And so this is how in Scripture, in the world, this is how heaven embodies itself, kind of comes down on us. And if you know your Bible, you'll see that this is the different levels of instantiation. And that's the best way to think about it, is to think about it as levels of embodiment. And there are indefinite amounts of them, right? There are definite, indefinite shades of embodiment by which heaven or purposes or identities find themselves in their variability, find themselves in the world. In the Bible, the way it works is you have a revelation from God. And that's the first part. Whatever exists isn't in it. It comes from above. It. It comes from above. Even this bottle is a revelation because for me to recognize, already has to be. It comes from a purpose that isn't in the bottle. It comes from above the bottle. And it's the same with everything. And. And that's why the relationship that humans have with God in Scripture is revelation, right? It comes to them and it comes from above. And it is, in some ways. Can I say this? It is mysterious. It is mysterious because it doesn't have all the forms yet. So that's why the glory of God, right? The glory of God in the Bible is represented often with images like light, like breath, like wind, sometimes even like darkness, Right? Because it's not something yet. It's that which brings you beyond yourself. So that's how the revelation starts. And then it comes down from that. And then you have something like names. So God speaks, and then he gives names to things in the world. God chooses. God picks, right? These, all these things are invisible. When I select something, when God selects Abraham, no one can see that in Abraham. It's an invisible thing. God said this person, and nobody can tell yet what that's going to give. It's just one guy. And God is just pointing and saying this, kind of putting his finger and revealing something hidden, something secret about Abraham that we know now because we're thousands of years after, and we now know what happened and everything that came through. But when the revelation appears, right, it's secret, it's hidden. If you think of the shape of the tabernacle, the shape of the temple, right? That's what how it works. There's this secret place, this hidden place that is behind the veils, and that's where the revelation of God manifests itself. And from that, the world unfurls in its multiplicity. And every level is a veil, right? And an embodiment at the same time. So in the Bible, one of the things that happens is that in some ways there's even. There's a little bit of a resistance to embodiment. Even God doesn't want to completely embody himself in things right away. Because the problem with every embodiment is that it's a veil that both reveals what's above and then separates you from what's above at the same time. So what St. Paul says, like the law, it's like even Christ, you know that the law is given to you because of the weakness of your heart. Like, that's why the law is given to you. If you had love, you wouldn't need the law, right? And if you had love, you wouldn't need the law, and you wouldn't need the tabernacle, and you wouldn't need. You would. All of these things would be contained and held up above. But then God condescends and then gives us these multiple iterations. And so you can understand that the law is. Why is the Law a manifestation of heaven? Right? The law is a manifestation of heaven because it manages purposes, right? It frames purposes. It says, okay, right? So you can't just live in love of God and love of your neighbor. So what I'm going to do is I'm going to tell you at a lower level how to embody that, and then I'm going To say, don't steal from your neighbor, don't take his wife, don't do these things that go against the purpose. And if the law is not sufficient, then the embodiment is going to go down even more. And then it's going to be, if you do this, then I'm going to punish you because I want you to move towards the purpose. So if you do this, I'm going to bring you back towards the real purpose. And if that doesn't work, then not only that, but I'm going to create a police force that is going to enforce the law on you. Yeah, I wish you didn't need it. Like, you wish you were in, like a nice community and everybody loves each other and we don't need a police force. But the instantiation happens at a more and more embodied level. Right. So the, the, the revelation of heaven slowly, you could say, embodies itself in the world and becomes more and more, comes harder, comes harsher, and comes more multiple. Let's go to the next one. All right. And so the best way of understanding this is that Heaven provides influence. Influence is a kind of causality which we're not used to thinking about, but which is the one that, especially as conscious humans, we're constantly engaging in. And so it provides an invisible motivation. So if I am a. Let's say, if I am in a basketball game, there's an invisible reason why we're there. That reason doesn't enforce itself with policemen. You don't have to. You don't need to physically force people to play. There's an invisible influence that is bringing people together towards a purpose, and that is what provides the order. And it's the same with any group, any, any group that you're involved with. That is the highest form of, you could say of causality, is a causality of influence. Then as that influence comes down, right, it provides order. But the lower it gets, you could say on the, on this hierarchy, the more it gets connected with Earth, the harder it's going to get, the more explicit it's going to get. And then you're going to get more and more multiplicity, multiple laws, multiple examples of how that influence functions. And that's when you get the comp. That's when it gets complicated. Because then you have to deal with exceptions. You have to deal with all of these differences, and you have to ultimately sometimes enforce the influence. Right. In the Middle Ages, they had this ordered society, which was that there are three tiers in the world. There are those that pray there are those that fight. And there are those that work. That was the order of society. The idea is that those that pray, they're at the top, right? Why are they at the top? They're at the top because they provide a type of influence which is invisible. They don't have weapons. They're providing examples. They're providing guidance. They're providing you with direction, with motivation. But all of these are the influence of heaven. They're all invisible. And as you move down, then you have things embodying themselves in the world. So those that fight now, they take that influence, they take those purposes. And now they embody them in laws, they embody them in regulations, in actual people like magistrates, all the people that run our societies. And then ultimately, like I said, at the bottom, or at the limit of that is something like the military, the police force that are enforcing the borders. But you need that full connection with what is above. Let's go to the next one. All right. So the best way to think about it is to think about it in terms of a nation. I can't even read that slide. Can you read it? All right, So a nation has an angel. It has a spirit. That is. It has an invisible reason why people exist together. It can then be exemplified. But it actually is very mysterious, you know, and Paul was talking about that this morning. He was saying, why are we here? I don't totally. Can't completely put it into words. But that's also true of all the things actually that we do, is that there's a mystery behind all things that have identity. There's something spiritual in the sense that it is invisible. It doesn't yet have anybody. It doesn't yet have any explication. It doesn't have multiplicity. It's this invisible influence. We tend, as humans, we tend to want to embody that in a point in one person. That's why most groups, if they're big enough, will end up having a president, a leader, a chairman, however you want to phrase it. We have this tendency to want to see the spirit kind of come down and manifest itself in a person. And the reason is because that person can then exercise a more explicit authority, right? They can exercise this. They can manifest the spirit of the group for us, right? They can become exemplars. They become examples. Examples is a good way of understanding how heaven. Heaven acts, right? Because I. Let's say I am trying to teach you something. I do it once as an example, and then you're going to do it a thousand times. But I'm There to provide the example, I'm there. But then that happens at all these different levels. So we tend to want to embody. And there's a danger in that, right? By the way, if you. Again, if you know your Bible, when the Israelites wanted a king, what did the prophet say? The prophet said, you sure you want to embody that in a one person, right? Because then you have all these problems that can happen, which is that person can start to exercise too much influence, too much authority, you know, etc. Think of all the cults, think of all the gurus, think of all of these problems. When you embody the purpose of something into one person, there's a danger, but it offers a lot. Actually, it also offers a lot. So there's always this weird thing in the Bible. It's weird because on the one hand, God says you shouldn't want a king. But then when they do have a king, then it's like, the king is great, the king is the son of God, the king is all these things. It's like, what's going on? And it's these two. It's this tension of this resistance to embodiment, but then also the advantage of what happens when you are able to embody. And then that becomes true, right? At every level of that. So any group that you have, usually, if you start some group, and it's probably true of this little corner, it styles art. It starts out with an intuition of something that binds us together. We don't totally. It's like it's invisible. We can see it's motivating us, but we don't yet have a. We haven't captured it, it hasn't landed, it hasn't embodied itself yet. So what do we want to do to embody it? We need something, we need a name. Start with that, right? So you need a name. Let's find a name. Once you have a name, that name will in some ways limit already, even in the name. Like, it'll tend to limit what that how that spirit is embodying himself. You might find when you find a name for something that you actually already are excluding some people. Some people be like, well, no, no, that's not. That's not what I thought it was. You're already constraining this spiritual influence into the world, right? And so then you want all the kinds of things that provide influence. What do you want? You want a motto, something like that? What's a motto? Motto is more than a name. It's like a little phrase. You want to make it really succinct. You want to make it precise enough but open enough so that it tends. It looks like it's embodying the intuition that we had of what the group is about. And so nations will do that. You can have a flag, you can have all kinds of things that will kind of manifest the fact that this thing exists. But then as the group becomes bigger, becomes more settled, et cetera, then it's going to start to embody itself in all these different ways. You're going to need to have rules, protocols for your meetings and let's say, for the estuary, right? Is the protocol, is that a good thing or is it a bad thing for a conversation to have a protocol? Yes, that's right. That's the right answer. The answer is it does something. Having a protocol for discussion, right? It formalizes the relationship. And so what it does is it offers certain. It crystallizes certain possibilities and it excludes others. So sometimes it can be good, sometimes it can be bad. If I'm having coffee with a friend that I haven't seen for 10 years and he says, well, we're going to have a protocol for our discussion. No, thank you. Right, no, thank you. But if I go to a board meeting and everybody is hanging out and sitting and talking about everything, and like, you're there for three hours, you're like, please give me a protocol for this meeting, because it is driving me absolutely crazy, right? And so these levels of embodiment, they're not about good or bad, they're about what they do, right? What they offer. And so one of the things that's going to happen as the group persist is that you're going to have people that are going to exemplify exceptions to what the group is. So you can have people that are going to kind of be pushing at what. And you're going to say, well, I'm not sure that that's what this group is about. I'm not sure that this is what the purpose is. And then you have to have to decide what you do with those people. Do you punish them? Do you eject them? Right? And so in a nation, obviously, that becomes quite strict. It becomes ultimately laws, police forces, prisons, executioners, right? It becomes pretty intense. And the question is, again, is that good or bad? It just is, right? It's just how things progress. Do you wish most of the time, like, do you wish that you didn't need police and that we could all just live together in harmony and love each other? Of course, obviously, you. That's what we kind of all want to be closer to heaven. It's kind of normal. We all kind of want that. We naturally desire to be closer to the intuition of the reason of why we're together. Like, we naturally want it to be completely natural and intuitive to participate in the groups that we participate in. But we also realize, especially if the groups get bigger and if they become more formalized, that at some point the gadflies can prevent the group from existing. And so you need to have these different levels of enforcement, okay? And so this is like. And all of these things are happening fractally, right? So every aspect of what I said also has this pattern. So think of a police force is a good example. So the police force plays a certain role in this base, huge pattern, right? Is in some ways very embodied, really there to like, physically. Physically hold people down or physically eject people so that they don't harm the purpose of the group. Now that's like, very material, right? But it's always based on influence. It's always based on laws. The police people aren't the one making the laws. They shouldn't be. That's why we have these separations of power. They're there to enforce the laws. The people who make the laws shouldn't be. The people that enforce them. There should be. There should be different levels, or else it doesn't work. But even the police force itself has the same pattern, right? So the captain of the police force, however you want to call it, the captain of the police force, isn't out there putting handcuffs on people, right? He's not. He's not doing the things. He is providing authority. He's providing influence, right? He's providing reward and punishment for his own people that are in the. In the hierarchy. And then they are at different levels. They'll be enforcing it in different ways, right? So you have a detective that is doing the more intellectual work, that is kind of trying to figure out what's going on, trying to find the criminal doing this. But the detective might not be the guy who actually puts the handcuffs on the criminal. Like, he's not going to be the actual physical brute that goes out, stops the people. So everything has that pattern. Like the. The pattern. That's why it's fractal, right? It. It reproduces itself in. In all the different. The different levels of. Of the groups that we participate in. All right? And so you can. So I've. I've in some ways represented it a little negatively, this embodiment. And you can understand why there are a lot of traditions that represent this embodiment in some ways as being negative. That is in some ways the gnostic type of approach where this idea that the more you move towards embodiment, the more you move towards evil, fragmentation, multiplicity, the more you move towards illusion, right? Why would it be that the lower you go on this, you move towards illusion? Because all the examples, they're like veils. So if you just look at one maple in your yard and you analyze the one maple, it can prevent you from understanding the category of maple. You have to kind of pull back and see all the examples that are multiple versions of the same pattern. If you're too close to multiplicity, if you're too close to like the bottom of the pyramid, then you, then you don't know what's going on, right? In a society, if you're too close to the bottom of the pyramid, it's not usually not very good for you, right? Because you end up being the person that is constantly breaking the rules. You don't understand what's happening to you. You're constantly being acted upon, right, by those that are above you. You're in some ways a victim. You become a victim of the system. You become, you know, a marginal person in the system. And so there's a reason, right? So if, let's say as Christians, we look at the Hindu caste system and we think that's abhorrent, right? But there's a, there's, you have to understand why people come to that conclusion. Why people come to the conclusion that the lower you are on this massive hierarchy with the, the, the, the priestly castes at the top and then the warrior caste and then the worker caste and then people that are just being acted upon at the bottom, you can kind of understand why they tend to think up good, down bad. Pretty simple. The lower you are, the more it means that you are living the consequences of some sin or some error that you've, that you've done or that your past life or whatever. So now you're just being acted upon like you're close to chaos and everything. So it's kind of understandable. But haha, luckily for us, I hope you think that lucky for us we have this crazy guy, not crazy guy, this crazy moment where someone revealed to us how this can be transformed into something more. How in fact it is possible that all of the whole pyramid of being, all of the way that God reveals himself in the world, that those veils, you could say they're luminous, right? They're veils. Of their light. That's not, they're not veils actually. You could think about it like they're actually just light that's moving down and manifesting itself in all the different parts. And one of the mysteries that Christ revealed to us, you know, and there was inklings of that before Christ obviously, but I think Christ did reveal it to us in, in the best way is to understand this relationship of heaven and earth as a loving relationship, right? As a, as the relationship between a lover, between two lovers. And this, this in some ways understanding that heaven needs earth to manifest itself in, because heaven is nothing without earth. Like it's just in the air. It's just. Actually it's interesting that you know that the word for Abel in the Bible, Abel that was killed by Cain, is like breath, but it's like the wispy breath that just fades, that doesn't find body, that just is an idea that floats off and doesn't find its roots. But that in fact what Christ reveals to us is that these two opposites, right, they can exist in a loving relationship. And that loving relationship is a sacrificial relationship. And so you realize that in fact the way that it works is that when the spirit of the group manifests itself at all the different levels, it is also the spirit of the group giving itself to the group, offering itself, and in some ways yielding to multiplicity on purpose, right? There is a kind of flexibility that happens in groups where the purpose of the groups also gets adapted to each personal reason why you're here. And that, that is actually not. It can be a relationship of love. It doesn't have to be a relationship of just this top down authority, that, that just comes down, that doesn't completely go away. But there's also another vision of that which is the highest vision, which is the one of understanding the world as a sacrifice. We know you've heard Jordan Peterson talk about it or I've talked about it, of understanding the world as this self sacrificial act and that as God emptying himself into the world in order to sustain it, in order to hold it together. And once you encounter groups like that, you realize, and you realize it in practice, right? And I'm sure all of you have had that experience. When you realize when you find a group where the leader of the group is giving himself to those that are part of his group, you realize immediately that those are the strongest, most real groups that exist. And that those groups that only act top down, right, in this kind of authoritarian way, that they tend to be fragile because the parts that are below, right? So a good example is in a prison. If the prisoners could escape, they would, right? They're not there on their own will. Like, they're not there because they want to be there. They're there because they're forced to be there. But that also means that it's a very, very fragile system. But if you have a loving family, the people that are there at the table, eating together, if you have a loving church, the people that are there are there because they want to be there. They're there because the unity that the group provides is more than their individual self. It is bringing them closer to heaven, right? It is giving them a glimpse of heaven. Because I can see the fellowship as an image of the heavenly influence that comes from above. And of course, the church is meant to be that. Like the way that St. Paul describes the church is exactly that. But there are ways in which we can experience that in every single one of the relationships that we engage in. It doesn't have to just be the church. You can do that in a business. But if you do, if you do this in a business, you will have. You won't have to be afraid that your employees are stealing from you, right? Because if you can create that loving relationship, that exchange of love, then you will have a strong body and a strong commitment from the members into. Into the body. And so, I mean, obviously, you guys, I mean, none of you, nobody forced you to come here. You're all paying to come here. You're all. You've all come under will. And so. But you also all have that intuition that there is this something, there's a reason. Obviously you wouldn't be here if there wasn't some glimmering, mysterious reason that was binding you together, even if you can't completely put a finger on it. And even if this is actually interesting, too, because everybody probably has their own reason for coming here, right? And none of those reasons are the ultimate reason why the group exists. But they're. They kind of. How can I say that? They're downstream from that reason. They have to be, or else you wouldn't be here. So you can trust that even if you don't totally get it. Like, he, you know, Paul is like, what is this? Like, what are we doing? You don't totally get it. The body is real. You know it's real. You're here, you've all come here, and you all have your own reasons. But when you talk and you experience the fellowship with others, you realize that those reasons are complementary and that those reasons are like members of a body that are working together, right as St. Paul says, that are well fit together and working together towards the unity in love. So I hope I didn't stretch you guys to your complete limit. I hope this was. This was helpful. I think we're gonna. Can we take a few questions? I think we were supposed to, right? Kale? Are we taking some. We're not. Sorry. No questions. You can ask all the questions you want. I'm gonna. Now that I've given my talk, I'm gonna be way more relaxed so you can all come talk to me. I'll be happy to talk to you. All right, thank you everyone. If you enjoy these videos and podcasts, please go to the symbolicworld.com website and see how you can support what we're doing. There are multiple subscriber tiers with perks. There are apparel and books to purchase. So go to thesymbolicworld.com and thank you for your support."}
{"episode_id":"SW - #410 - 2025-09-22 - Fractals - The World Is Full of Meaning (Midwestuary talk)","start":2816.39,"end":2880.44,"speaker":"Laura Diaz","text":"Tucson the Weight is Over Mediweight Loss they're officially open on North Oracle Road. That's right, no more counting down the days. You can walk in right now and start your journey to a healthier you. Hey, it's Laura Diaz from iheartradio and you can trust me. This isn't just another weight loss clinic. I know that because it's where I lost weight safely with real medical support. GLP1 medications. You can see them everywhere online right now. But the truth is, your health shouldn't be a DIY project ordering these meds without the professional guidance. It can lead to dangerous mistakes, wrong doses, no oversight, and serious risks. At mediweightloss, I got the same medication, but with a customized plan, weekly check ins, and a licensed physician guiding me every step of the way. And the cost the same as those risky online options. Tucson, your moment is here. If you're ready to take control, feel better, and lose weight the right way, mediweightloss is ready for you. Walk in, get started and see real results. Call or visit mediweightloss.com to learn more and book your free consultation today. That's mediweightloss.com pack up though, because Chevy."}
{"episode_id":"SW - #410 - 2025-09-22 - Fractals - The World Is Full of Meaning (Midwestuary talk)","start":2880.44,"end":2907.41,"speaker":"Announcer","text":"SUVs have the capability to take you to some incredible places like an adventure in the middle of the in the Equinox Active, an SUV that will help you get away with confidence. Or head off for a night in the in Chevy Traverse with all the tech you need to stay connected. While the undeniable value of Chevy Trax will keep you moving from here to over here to way over here. Get to all the places you want to be with Chevy SUVs. See Watson or O'Reilly Chevrolet."}
