{"episode_id":"SW - #321 - 2024-01-05 - Why Angels Appeared to Shepherds on Christmas","start":0.32,"end":920.33,"speaker":"Jonathan Pageau","text":"Hello, everyone. And so we are coming close to Christmas, and I've done many Christmas videos in the past. And so I thought we'd try to take a little bit of a different tack and look at one sentence in the Christmas story, a sentence that since my childhood, I was always confused and wondering about. And even when I was in university, I remember a professor that I had of biblical studies saying, you know, this is the kind of statement in scripture that doesn't really mean anything, that nobody knows what it really refers to and what it's talking about. And that is the statement of the angels, the song of the angels, which is glory to God in the highest, or glory to God in the highest heaven and on earth, peace to those on whom his favor rests, or peace to those on which he has goodwill. And sometimes it's also peace on men of goodwill. And so what exactly does this sentence mean? This is Jonathan Pedro. Welcome to the symbolic world. So the context is pretty clear. We have, first of all, extremes in the very story, which is that we have these shepherds that are, you know, tending to their sheep. We always have to remember that shepherds in the ancient world were something like the lowest class of people, you know, peasants and then. And they're also tending their sheep at night. And so you have two images of two extremes, which is the lowest type of person, but then at the same time, the darkness at night and in the heavens appears an angel, and ultimately a choir of angels or a group of angels that announce to them that the Messiah is born in Bethlehem, that the prophecy has been revealed. And then they start to sing this or say this, you know, glory to God in the highest, and on earth, peace to those on whom his favor rests. So you have this contrast in the situation, which is that the glory of God shines. And so in this case, you have to really understand the glory of God as light. So you have to think of this contrast in terms of the situation, which is that it's dark, it's night, and then all of a sudden in the heavens appears a light. So there's a contrast between heaven and night. There's a contrast between the highest and the lowest in the sense of the figures in the story, which is that the angels above, the shepherds below, now the shepherd. It's important to understand also that the shepherds in some ways are related to being a nomad, related to not necessarily having a fixed place and moving around with the sheep, you know, tending the sheep, moving, following the sheep around. And so there's a kind of, you could say organic or chaotic or, you know, a lack of stability down here. But then above, then you have the angels. Now, what's important to understand in terms of the angels is to understand the relationship between the angels and the stars. This is something that we've talked about on this channel several times, which is that for the ancients, there was really no difference between the principalities, the angels that are. That were assigned by God to manifest the patterns of reality, and the stars in the heavens as these points of light that are up above us and that are kind of a clock that manifests the patterns of reality. And so it's important to see that, because if we don't see that, then it'll be difficult to understand that there is a relationship between this story of the angels appearing to the shepherds and the story of the wise men from afar, the wise men from the strange wise men also seeing the star in the heavens and following the star to the Messiah, or following the voice or the song of the angels and to find the Messiah. These two are completely analogous. And one can help you understand the other, which is that what the shepherds are encountering is something that the ancients could call the music of the spheres, right? The music of the cosmos, the deep meaning, the deep patterns of the cosmos. This is also important to understand that when the ancients talk about music, what they really mean is the pattern like quality of reality. And when they would study music in the ancient world, it wasn't just the way that we think of music as some of the kind of entertaining sounds that we listen to, but rather the notion that reality has a musicality, that there is a repetition and a pattern, and that this is something that we have to enter into. And what they're encountering is, of course, the movement of the stars in the heavens. They're encountering the pattern of reality. And they're, you know, both the shepherds and the wise men. The wise men are a little different, but they're not that different. So instead of being the lowest in terms of the shepherd, they're the strangers. They're the ones that don't necessarily belong in Israel. And so there's something like the light above, the star above is calling to the. Like, you could say the stars that are far away, or the glowing embers, the glowing sparks that are not from Israel, that are there out in the world, the places where the glory of God is hidden. You know, the wise men who are able to discern the signs from very far away, come in to find the Israel and So it's similar to the shepherds that are far away in the sense that there are these nomadic people that are wandering the land. They don't have a fixed place. They're the lowest of society. And so they notice the. They hear the angels. So understanding this structure is important in understanding what exactly that this sentence means, which is, what is the relationship between saying that glory goes to the God in the highest heaven and then on earth that we find peace on whom God's favor rests, for whom God has goodwill. And so this is really just an image of. This is an image of reality. This is a cosmic image, like almost all of the cosmic images that I've shown you before, which is that it's a little image of how reality actually works in its extreme. But the way in which it happens in the extreme is also the way it works at smaller levels in our existence. So let's separate the statement into the two parts. One is, of course, giving glory or attending, giving up the proper attention, the proper praise to that which is the highest, celebrating the highest in the best, in the proper way, which recognizes what it is. Okay, that's the first part. And then that brings, you could say, causes peace on earth. So why does that cause peace on earth? So the way to understand it is that is to apply it to smaller things so that you can understand how it works. And so let's use a. Let's use a basketball team again, I like using sport analogies. They're the easiest and they're the easiest to understand, which you could say it's something like proper attention to the highest aspect of the team brings about peace among the players. And let's say, not only peace among the players, but peace among those on which this highest aspect of the team finds favor, has goodwill towards. So the idea is that if we understand what it is that we're doing, and we aim towards that highest aspect of what we're doing, we give the proper attention, the proper celebration to what it is that binds us together in the first place. Let's say in terms of a basketball team, that is, we're playing basketball to win. In this way, we have a team name, a team identity. We have a way to recognize that we are together, that we're not part of the other team, that we're part of this team. We have all these things that kind of bind us. And if we all are able to celebrate and participate and raise up the unity of our team together, then what that will do is it will bring peace among the players, right? The Players will stop thinking of their idiosyncratic desires. They'll stop thinking about the other things that could. That could. They could contend with that. They. Because they're all. Their focus is on the purpose and the reason and the highest part, then they will work together towards that purpose. They will have peace among themselves. They won't be fighting, because fighting is basically different people with different person, different purposes that are in conflict with each other. It will bring them to have peace together. But then it would. It's. It's. The peace is applied only to that on which the identity of the team has good favor, that is, only the things that fit within that identity, only the things that have. You know that. That receive the grace of that identity, you know, because if you are part of the team and you're not in favor with what the team's purpose is, like maybe, let's say you're doing something else, maybe while you're on the team, all you're thinking about is some other interest, your girlfriend or whatever, then there won't be peace among for that person because it won't be in the favor of the identity of the team. There's actually another reading of this verse in different versions of the text, which is. You could also read it in certain versions as peace on those who have goodwill. That is, peace on the men of goodwill. And that also works. It's similar to the other one, which is that for those that have the right intentions, that those that you know are acting properly within their attention to the highest goal, then it will bring peace to them in their endeavor. So you can apply this now at any single thing that finds unity, that finds unity in multiplicity. It can even be in yourself, which is that if you yourself are distracted by different things and you don't focus your attention on the highest purpose that you have at the moment, then what will happen is you won't have peace within you. You'll have conflict within you, you'll have discord within you. And you know it won't work. But if you're able to align your different aspects of your being into one common attention which is raised up above all the others, then you will have goodwill among those things that are working towards that attention. You'll have peace among. I mean, you have peace amongst those things that are working towards that attention. And so now what's going on here in this story is something like a cosmic version of that. It's like the extreme version, the most encompassing version of that, which is if we praise, if we celebrate, if we attribute glory. If we raise up the name, the source of all things, if we raise up God in the highest heaven, that's the God we raise up, then there will be peace on earth. And so it's like it's showing you the structure in the sense that this is what's going on, for example, in anything that you do. It's showing you the structure, first of all, of what Genesis 1 is about, which is also about that, which is also about, let's say God is up in the heaven. God attributes unities, attributes ways in which things bind together. And those things, if they are well aligned and they remain in communion with God is a good way to say it, then they will be at peace and they will not be in discord. So it's hinting all the way back to Genesis 1 and talking about what is the relationship, what is the proper relationship between heaven and earth. And you can imagine that what happens in Genesis is that man, you know, takes things for himself. Instead of rendering up to God, he tries to take the fruit for himself. He tries to attribute the qualities of God to himself. And therefore, what happens is discord. What happens is things break down and they lose the favor of God because they're not glorifying him to the highest, they're glorifying themselves to the highest. You know, that can help you understand how this is really. This little verse is really a cosmic image. It's the same thing that happens when Moses goes up the mountain at Sinai and gathers the people's attention up towards a covenant with the highest. And then when they do that, what they do, what happens is they receive the law and they receive the cohesion of the tribes. They actually become in some ways a nation. When they all accept a covenant which is highest in that case also with the God of their ancestors, which is that they make an analogy between that which binds them together in terms of their lineage and that which binds them together more metaphysically, that is the God of heaven. And so this was just a little video to help you kind of see how deep some of these verses are and how something which we just sing every Christmas when we sing, you know, Gloria In Excelsis Deo. And, you know, this verse that, like I told you, my professor in university said that they. It was just kind of a. Kind of like a theological statement with not much sustenance. Like it was just something that people say, glory to God, you know, and peace on earth. But it actually is a powerful cosmic image and helps us understand how complexity works, how attention works. And how it all comes together into the cosmos and into little microcosms that we participate in. So I hope this was useful. I want to wish everybody a Merry Christmas. Christ is born. I'm probably saying that a little bit in advance for you, but since I won't see you on Christmas Day, I giving myself the right to say it, and I'll see all of you in the New Year. My next video will probably be about that, about symbolism of the New Year. So thanks everybody for your support for your attention, and I'll talk to you very soon. Bye Bye. If you enjoy these videos and podcasts, please go to the symbolicworld.com website and see how you can support what we're doing. There are multiple subscriber tiers with perks. There are apparel and books to purchase, so go to thesymbolicworld.com and thank you for your support."}
