{"episode_id":"SW - #143 - 2021-02-23 - The Blindness of - Following the Science -","start":0.8,"end":713.52,"speaker":"Jonathan Pageau","text":"One of the mantras we have heard ad nauseam since the beginning of the COVID situation has been that we need to follow the science. This phrase is repeated over and over by politicians, by experts and by celebrities. Let's end the politics and follow the science. This phrase must be expressed with a certain level of condescension, implying strongly that your ideological or political enemy is not following the science. And if they did follow the science, then they would naturally agree with your political position. Will people listen to scientists? We've heard certain political parties smugly even call themselves the party of science. Now we could argue all day long over who is actually following the science. And people do, pointing fingers at each other and going down the dreadful line of clickbait headlines citing some new study which suggests how their position is the one following the science. But to do that is already to miss the forest for the trees, because it is actually simply, and dare I say, technically impossible to simply follow the science. This is Jonathan Peugeot. Welcome to the symbolic world. The question is far more important than just surrounding the current Covid situation. It's rather the sign of the general blind materialism which rules the common discourse. We're wowed by the scientific priestly cast. We only need to look at the type of reverence the media placed around Dr. Fauci in the United States. But like I said, despite our officials constantly repeating this mantra, it is impossible to just follow science, at least not at the outset, when science is doing what it's supposed to. It's an accurate and quantifiable description of phenomena at a certain level of reality. And so, because phenomena happen in a predictable pattern, then once you've described a phenomena accurately enough, it can be possible to produce the same phenomena with similar conditions. So think of the scientific process as producing something like a recipe book. Once you've identified something relevant, let's say making a pound cake, then the recipe book will tell you what the stuff, what stuff the cake is made of. So if you follow a set process using similar quantities, you know, with certain raw materials, eggs, flour, etc. And a certain amount of time, then you should be able to reliably produce the phenomena which will be recognized, which will have the recognized qualities of a pound cake. So notice I said, if you follow a set and a set process, which of course seems to suggest that you can and in fact follow science. But this is exactly where lies the problem and the blind spot, which has become so common, you can only follow the science once you have identified what it is you care about, what it is you want to do. And especially, what is your hierarchy of priorities? Within a certain context, science cannot tell you what is important. So let's say you decide you want to kill as many people as efficiently as possible. Well, then you can follow the science to find the best procedure and tools to do so. If you want to reproduce a nuclear explosion, make people addicted to your product, create an army of robots, then science can possibly help provide a map to accomplish these measurable goals. But science has no tools whatsoever for telling you what you should do, what goals you should be aiming for. And science also cannot tell you what, what is the reasonable amount of resources you should spend on a certain goal, or what else you need to sacrifice to accomplish your goal. So let's say you want to make your pound cake, but you can only get eggs by driving two hours from your house. Well, science has no way of telling you if that is a reasonable thing to do, or if you want that pound cake enough to sacrifice that time and energy to still make it, maybe you do. And this blindness has been the source of one of the biggest political clashes since the end of World War II. Following the science has provided the means of material excess, of comfort and a throwaway culture. Now other branches of science, environmental science, is telling us to follow the science to save the environment from the results of this other branch of science who developed their industrial thrust by following the science. And so science is a tool. And neither of these opposing narratives, neither the reason for the development of industrial civilization or the reason for the green reduction of energy consumptions, are scientific in themselves. Both paths, both mentalities, both follow the science, but they do so to their desired goal. So this whole question has reached almost absurd levels with the COVID situation. We're constantly told to follow the signs that this or that political decision or mandate is not in fact political, but is mandated by science. At best, this is the naive proposition of people who are unaware of their own frame, unaware of what motivates their action. But at worst, it is a new form of moralizing which wants to pretend that its moral stances are as self evident and as provable as two plus two equals four. The goal is sometimes stated. At first we had a goal. We were told that we needed to prevent the medical system from being overwhelmed. But then the goalposts moved invisibly to we need to stop all people from dying at all costs. And finally the goalpost became we need to stop this disease from being spread to anybody at all. So despite moving the goalpost, authorities continued to use the Same follow the science while pretending that the goal is continually obvious. It's just taken for granted and just plainly there in the science itself. Of course, if you had followed my channel, you have bumped into this problem over and over. It's the problem that I had in my discussion with Bret Weinstein where science was posited as the top of the hierarchy of meaning. It's the blind spot in my discussion with rationality rules where moral arguments were made as if their ultimate purpose were evident, while simultaneously being incapable of framing, of naming or even seeing that purpose before invoking this or that example or this or that consequence. All of these conversations are in a different way than we usually mean it. They are blinded by science, honestly thinking they're objective, though blind to their presuppositions, thinking they are objective and scientific. They take their unseen presuppositions as self evident truths which people, which all good people, people who have good intentions, should be able to see. And so those of us who question this or that moral position can find ourselves in dangerous situations. Because if one takes their point of view as self evident, this inevitably means that those who do not share this perspective are doing so out of ill will or with purposeful and utilitarian denial of science. That's why we always hear a note of contempt every time a political figure or public figure says follow the science, or when they suggest that their political opponents refuse to follow the science. Accusing someone of not following science is akin to accusing them of breaking a divine command. Science is of course objective, non ideological. And so to not to follow science is to go against reality itself. It's a sin, properly speaking, for those who think like this. Of course, all the while the inquisitor is hiding or maybe even unaware of the true purpose of his actions. That is why I say there is imminent danger right now. As for the reality of safety versus danger of saving lives versus providing opportunity, normal societies have always had to find ways to balance these extremes. It's not easy, of course, but this is an inevitable discussion that we should be able to have without those who want to have the discussion being accused as being science deniers or being insensitive and evil. If the goal of human society was only to save lives, we would not go rafting or, or mountain climbing or even get on the highway. We know that intuitively, but despite that, we're suddenly paralyzed by this strange illusion that safety in protecting our bodies is the only value that matters. Of course it would be absurd to say that it does not matter. Of course it matters. We should care for the physical wellness of those around us. But it cannot be our only guiding value. Safety cannot be accomplished at the expense of every other value which constitute the human experience. Value like community, exchange, adventure, risk taking, and especially worship. Every time you get into a car, you risk your life. At every moment you are in a car, you could die in a few seconds, and this is in no way under your control. You are also at the mercy of other drivers. In the United States, for example, the rate of death per car is about 12.4 per 10,000. But there are also 4 million people who are seriously injured by car crashes. Road crashes are in fact the leading cause of death in people between 1 and 54 years old. Now, we could reduce the death and injury rate of car crashes very easily. We could simply stop all private cars from going on the road. Done. Or we could reduce the speed on the highway at 20 miles per hour. I mean, I bet that would bring down the car, the car death toll and an injury to nearly zero. It would work, but we're not going to do it. So why aren't we going to do it? I mean, why wouldn't we do it? Am I saying that getting to my hair appointment or to some, you know, to go to the mall is more important than people dying? So we intuitively understand that in order to live our lives, we incur risks of dying. Of course, car crashes and infectious diseases are not the same, and we certainly need to care for the weak and the elderly. But my point is rather to feature our willingness to accept the constant risk of dying at any second every day and intuitively knowing that safety cannot become the only value which drives our society. And we must be very wary of those who refuse to even have the discussion, insisting that the very discussion is immoral because it doesn't follow the science. We have to be more aware of what a human being is and not let that go to the side. In a society that is built only on one single value, a value of safety or security. A human person is more complex, has other values, other purposes, and some are actually more important than our safety."}
{"episode_id":"SW - #143 - 2021-02-23 - The Blindness of - Following the Science -","start":714.8,"end":779.7,"speaker":"Jonathan Pageau","text":"I hope you enjoyed this episode of the Symbolic World. The Symbolic World is edited by Justin Ward and it is based on a series of videos that you can find on my YouTube channel, Jonathan Pageau's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course leaving a review on itunes. Everybody knows that's the best way to get the podcast out there to get it heard. And if you want to get involved, you can also support the podcast financially and going to www.thesymbolicworld.com support or else on Patreon Pageau videos as well and on SubscribeStar, all those links you can find on my website or in the show description. So thank you and I will see you soon."}
