{"episode_id":"SW - #133 - 2021-01-02 - Rod Dreher - Preparing for a Soft Totalitarian Future","start":0.4,"end":130.87,"speaker":"Jonathan Pageau","text":"Hello, everybody. I am very excited to be here with Rod Dreher. Rod Dreher is a best selling author. He just published a book called Live not by Lies and he is also the author, the best selling author, the Benedict Option, which many of you might have heard of. He's also written several other books. Rod and I have had some conversations before and I was really excited to read his new book because I feel like it just puts its finger right out on the right place in terms of the cultural discussion, the cultural war, and also a vision of what is coming towards the future. This is Jonathan Peugeot. Welcome to the symbolic world. And so, Rod, I have to say I was really happy to read the book. We had some conversations a little bit before about your plan for this book and I was really happy to see how it came out. You know, people don't know this about me, but my wife is from Slovakia and she immigrated when she was 11. Her parents left the communist regime there and her own grandfather, who was actually from Prague, was tortured to death in the. In communist prisons. He was just a shop owner that fell, you know, fell into the wrong grasp and was brought into a. Was tortured in prison and left. Was. Was released just before he died so that they wouldn't have his body to deal with. And, and so to see people tell this story and to help us understand how close it is in history, but how close it is even on the horizon of our, of our possibilities, that something like this could happen to us again for me was. I was really grateful to see it. And I was grateful to see you weave in just all, you know, to weave in Dostoevsky and Kundera as well. I was really happy to see you weave some of the threads that he puts out. And so tell us a little bit about what was the impetus, what it is that really kind of drove you to write this at this moment."}
{"episode_id":"SW - #133 - 2021-01-02 - Rod Dreher - Preparing for a Soft Totalitarian Future","start":131.19,"end":279.78,"speaker":"Rod Dreher","text":"Yeah, it's astonishing to hear that your wife is from Slovakia. This, by the way, is a country that I never thought about at all until I happened to go to Bratislava to an ideas festival. And my host introduced me to people who had been part of the underground church. And as you know, I ended up being dedicating the book to a priest, Father Tomoslav Kolakovich, who had prepared the Slovak Church, underground church for this persecution. And I really think that we are in a Kolakovich moment in this country. Maybe we can talk about it later. Anyway, the impetus with the book, Jonathan, was a phone call I got back in 2015 from a physician at the Mayo Clinic here in the US his mother was living with an elderly mother. She was an immigrant from Czechoslovakia. She had spent, I think, four years at a Communist prison for practicing her Catholic faith and was eventually released, came to America and married his father. And the old woman was saying, son, the things I'm seeing happen in this country now remind me of what it was like under communism when it first came to my country. And it scared the physician. And he reached out to me because one of his patients was a friend of mine and he wanted to tell a journalist. So I thought that was really kind of out there. America is like communism. Come on. But the more I started talking to people in this country who had come from communism, whether it was Russia or one of the other Eastern European countries, the more I began to realize that they were onto something. And if you talk to them at length, they would get really angry that Americans just don't take them seriously. Solzhenitsyn said in the Gulag Archipelago that one of the biggest mistakes we can make is to think that what happened in Russia can't happen here. He said it could happen at any country in the world, given the right set of circumstances. So what I did with this book is I took their alarm seriously. I started to. The first part of the book is about explaining what it is they're seeing precisely that reminds them of communism. It's not Stalinism 2.0, but it is the total politicization of society, and that is the essence of totalitarianism. Part two of the book is practical advice from people in those countries, Christians mostly, who had been dissidents. I asked them, what do we need to know now here in North America to prepare. And that's the book."}
{"episode_id":"SW - #133 - 2021-01-02 - Rod Dreher - Preparing for a Soft Totalitarian Future","start":280.74,"end":336.78,"speaker":"Jonathan Pageau","text":"Yeah. And it was interesting that you, right away, at the beginning, let's say, differentiate a dictatorship from a totalitarian state. And it's important because it helps us understand how the totalitarian. The totalitarian state can actually creep in on us without there being a dictatorship yet, because it ends up taking. Ends up infecting our minds and ends up creating, let's say, totalizing spaces of what is acceptable and what is it acceptable to think or to talk about. And then methods of finding, weeding out people who think differently and actually excluding them from society in really radical ways. And you mentioned some of the people that have lost their bank accounts, and it's still just a handful of people, and it's people that we would still maybe think are despicable. People who lost their bank accounts are not allowed to use PayPal, are not allowed to engage in society. But the fact that the mechanisms exist is already a frightening prospect for the future."}
{"episode_id":"SW - #133 - 2021-01-02 - Rod Dreher - Preparing for a Soft Totalitarian Future","start":337.26,"end":416,"speaker":"Rod Dreher","text":"Yeah, it really is. And I think, Jonathan, that the fact that our idea of totalitarianism, when we think of that, we think maybe of Nazism or we think of Stalinism, we think of gulags, secret police, that sort of thing, official censorship from the state, we don't have that in this country or in North America in your country. And so we think that it must not be totalitarianism. Augusto Del Noce is one of the great political theorists of the 20th century. In Italian, and he pointed out that the essence of totalitarianism is the politicization of all aspects of society, and therefore it can exist in a capitalist liberal democracy. That's what we're seeing happen here. And it's coming so fast. I mean, the letters I get from people every day, not only people from within academia, but also within corporations who are talking about how suddenly this ideology is arising out of nowhere. And they're terrified to say what's on their mind. They don't know when they're going to step on a landmine. And the fact that people just so many of us North Americans just are walking through life thinking that, oh, this is not a problem or this is something on the right, that problem we have on the right. They think that if we just elect the right politician, that's going to solve the problem. It's not."}
{"episode_id":"SW - #133 - 2021-01-02 - Rod Dreher - Preparing for a Soft Totalitarian Future","start":416.61,"end":492.98,"speaker":"Jonathan Pageau","text":"No, it really is a creeping up of a totalizing way of thinking. And so there have been some. Even to me, there have been some alarming signs in the past few years. Of course, four years ago, there was the kind of Jordan Peterson moment who he warned us about this coming because you could see it in universities. And now we're seeing it. It's only four years later. And of course, the election cycle is accelerating this because it seems as if. Because it's a crisis and people are afraid of what's going to happen in the future. The process is accelerating. But during this election cycle, the fact that we saw journalists like Glenn Greenwald and Matthew Klasius quit their own publications to go freelance because they were feeling censorship within their organization. These are not like right wing people. These are just kind of regular liberal types. And it's accelerating and we just see it. People don't. They see the individuals. It happens to individuals and it happens to individuals. And this is, of course, the problem is that as it creeps in and it kind of becomes a pattern, there are even things right now that people, everybody knows that if you say certain things at work, you could lose your job. If you say certain political ideas at work, you could lose your job. And we've almost accepted that as normal. We've almost accepted it as if this is a normal thing. But it's not a normal thing."}
{"episode_id":"SW - #133 - 2021-01-02 - Rod Dreher - Preparing for a Soft Totalitarian Future","start":493.14,"end":599.37,"speaker":"Rod Dreher","text":"No. No, it's not. And this is the proverbial frog in the pot of boiling water. That is exactly what's happening. What's interesting too is when you talk to young people like millennials and Gen Z, they have been raised in an atmosphere in which this is normal. And I just about, I guess it was last month I went down here in Louisiana, where I live, it's a pretty conservative part of the US I went down to give a talk at a state university down on Bayou Lafourche. Now, this is deep Cajun country. It's really conservative. And I was just giving a talk about my book, Live not by Lives. A few days before I arrived, there was a huge controversy on campus. Some members of the College Republicans had chalked on the sidewalk there, Trump 2020 MAGA, right? Completely ordinary stuff. This caused such an uproar, the social justice warriors on campus had a three hour student government meeting. It ended up where the head of the College Republicans and his girlfriend had to be escorted by campus police to class because of death threats. Now, here's what's so interesting about that. This was not in Oberlin and this was not at Berkeley. This was at Nicholls State University in South Louisiana. And I went to college here in South Louisiana back in the 1980s. And I was more or less on the left in college. The idea that we would have appealed to authority to silence our opponents or much less make death threats against them would have been completely unthinkable. But now it's happening. And it's happening, as I said, not just in super liberal parts of the country, but here in really conservative parts."}
{"episode_id":"SW - #133 - 2021-01-02 - Rod Dreher - Preparing for a Soft Totalitarian Future","start":599.85,"end":673.39,"speaker":"Jonathan Pageau","text":"And what will also accelerate, and it seems inevitable that it will accelerate this pattern or the fear and the frenetic energy to bring about this system, is that those people that wanted, that made death threats against someone who wrote Trump 2020 on the sidewalk now have to deal with the fact that 50% of the voting population, near 50% of the voting population, voted for this person, that you are afraid to even see his name written on the sidewalk. So in their perception, this is an evil they have to defeat. This is an absolute evil that they have to defeat. And things line up politically for them. Even though Trump is not a conservative, he's actually Quite liberal in terms of his own values, but. But it just lines up in terms of a narrative. And so everybody. And I've talked to even someone very close to me who said. Who talked about how the Trump supporters and Trump is anti lgbt. And I was like, trump is not anti lgbt. Like, where did he even get that? Like, there are pictures of him holding a pride flag. It's like. But it's just because they line it up, right? They just line it up on the line and it all falls in place. And that's scary because it's. It's a narrative thing that's going on."}
{"episode_id":"SW - #133 - 2021-01-02 - Rod Dreher - Preparing for a Soft Totalitarian Future","start":673.71,"end":797.38,"speaker":"Rod Dreher","text":"Well, you're right. And this is one of the things that I think is key to understanding what's happening now. A lot of people think of the social justice movement as a political movement. Deep down, it's a religious movement. When I studied the Bolsheviks and how they came to power and what they were about, that became so clear to me. Jonathan. They couldn't get any traction in Russia in the 19th century until the 1890s. There was a terrible famine in Russia, and the czarist regime did a very poor job handling it. That event was a triggering event that caused a lot of the middle class to think, maybe these Marxists are right. And the Marxists had been. The Bolsheviks had been preparing for that moment when the czar exiled them all to Siberia. It was actually kind of admirable what they did. They weren't living in jail. They were living in exile colonies. They came together to study their holy scripture, Marx, Engels, and to talk about what they were going to do. They were willing to suffer for what they believed. And because they were willing to suffer, they had a certain cachet and a certain authority. When they came back into mainstream society in the early part of the 20th century and they started evangelizing the factories. In the factories of Russia, you had so many, because Russia was starting to industrialize in a big way. You had so many peasants, men mostly, who had come out of the villages, and they were disconnected from their families, they were disconnected from their churches and everything that gave them a sense of structure in the world. And because of that, they were desperate for something to give their life a sense of meaning. And there were the Bolsheviks preaching Marxism. I think we're in a very similar situation now. And so many of these young people who have been alienated from the church, alienated from institutions in our society, they are susceptible to this totalitarian movement that gives them a sense of purpose, a sense of meaning, and a sense of solidarity with Others their age."}
{"episode_id":"SW - #133 - 2021-01-02 - Rod Dreher - Preparing for a Soft Totalitarian Future","start":797.7,"end":879.86,"speaker":"Jonathan Pageau","text":"And we see in the manifestation of these groups, the religious elements. And you don't have to look very far to notice that a lot of the protests which happened, you know, during COVID after the death of George Floyd were religious in nature. You know, they were using sacred iconography. They would even represent him with halos, with wings. And the people were kneeling, they were even self flagellating. I saw people actually whipping themselves. And so they're there and washing feet. And so there was, and there was, it was like this catharsis of. Of course it was exacerbated by the fact that we had been kept apart. It was almost like we were fasting during the first part of COVID And then all of a sudden this event happened, this like death of someone happened. It was almost like a mock Easter. And everybody joined, came into the street to process and to cry and to celebrate. You know, this thing which united them, which is totally understandable. It's like I understand it, but there's something in it which is obviously it's off key and it's a, it's. This is what I keep trying to help people understand, that the kind of normal liberal is freaked out to see how religious these manifestations are. And they're saying, no, I thought we're supposed to get rid of this religion thing. But you can't, you just cannot. It just will keep coming back. You have to be deliberate about it, not accidental about it."}
{"episode_id":"SW - #133 - 2021-01-02 - Rod Dreher - Preparing for a Soft Totalitarian Future","start":880.18,"end":1044.29,"speaker":"Rod Dreher","text":"Well, you know, one of the key moments in our recent history that revealed it was an apocalyptic moment that revealed what's really going on here came in 2015, in the fall of 2015 at Yale University, you might recall that there was this big controversy over Halloween costumes. Erica Christakis, she and her husband Nicholas, both Yale professors and masters, they don't call them that anymore. The masters like house parents. At Silliman College, she sent out a note to the students saying, Yale is telling us that you better be careful what kind of costumes you wear at Halloween because you don't want to offend anybody. But Erika Christakis said, you're grown ups. Come on, this is ridiculous. The students jumped on her and her husband for being racist and not caring about them and hurting them because they rejected this authoritarianism from the college. There's this great moment captured on the Internet where Nicholas Christakis, her husband, these are baby boomer liberals. He goes out onto the yard at Silliman College and tries to engage this woke mob in reason discourse about the issue. They don't want to Talk about it. You can see them shrieking at him and cursing and wailing like, this man is a heretic. Reason is completely impossible with him. And of course, the Yale administration collapsed and gave in to the mob. Erika Christakis ended up leaving the university. This is an important thing for people to understand that this is not about reason. We're dealing with religious fanatics. Yuri Slezkine, who is a Russian American historian, he wrote this great book in 2017 called the House of Government, about the Bolshevik Revolution. And he describes the Bolsheviks as an apocalyptic, millenarian political cult. And he goes and talks about their religious aspect. And it's so interesting to see the parallels between them, the Bolsheviks, and our social justice warriors in particular. The Bolsheviks saw good and evil as the lie between good and evil, going right down the middle between social classes, peasants, workers, good bourgeois bourgeoisie, the wealthy, aristocrats, evil. And it was the sheep and the goats and there was an apocalyptic bloodletting there. That is what I'm seeing happen now when you see and every day somebody sends me more data about this, where you see the line between good and evil being laid down between races and identity groups. And I cannot imagine anything good is going to come out of this."}
{"episode_id":"SW - #133 - 2021-01-02 - Rod Dreher - Preparing for a Soft Totalitarian Future","start":1044.69,"end":1136.65,"speaker":"Jonathan Pageau","text":"Yeah, because it's dealing with identities that you can't change. Like in terms of, let's say, a Christian ideal where you move into the church and you enter into salvation. There is at least a door for you to kind of advance where here there isn't. What's interesting about the Halloween example is just how perfect it is to manifest the totalizing aspect. One of the things I've been telling people about is helping them understand these inversion festivals and how there are festivals in all cultures that manifest a breakdown of order and an upside down aspect to them. And Halloween is one of them that we have, where you dress up as monsters, you dress up as ghouls. There's this whole kind of becoming a monster, becoming an exception and manifesting the exception. And so it's in those like the King's fool or all of these. They had feasts of the fools in the Middle Ages. All of these festivals are there to point to where the system breaks down. And it's important to keep that. You need to have places that point to you where the system is in total. And so the fact that they would attack that place is perfect in terms of showing how they want to totalize. And it's also the attack on humor as well. Right. You can't tell certain jokes, you can't all the places that are there to poke at the system are being attacked by a totalizing system. So it's interesting to notice and to see that it's happening there first, and then it's going to start to grow and take over. Because there's always this saying that the totalitarian can't handle a joke, can't handle humor, because there's no room for it."}
{"episode_id":"SW - #133 - 2021-01-02 - Rod Dreher - Preparing for a Soft Totalitarian Future","start":1137.05,"end":1180.33,"speaker":"Rod Dreher","text":"Right. Because irony is not possible in a totalitarian society. And we were told, when Trump won in 2016, we were told, and I think it's true, that a lot of people voted for him because he was against political correctness. And it seemed almost trite at the time when I remember hearing that. But the more we went on, the more I came to believe that's true. Trump was the only way that a lot of people could flip the middle finger to the ruling class. And whether it was wise or not to choose him as the avatar of rejection of them is another question. But there's no doubt that he was it. Yeah. Yeah."}
{"episode_id":"SW - #133 - 2021-01-02 - Rod Dreher - Preparing for a Soft Totalitarian Future","start":1180.73,"end":1223.25,"speaker":"Jonathan Pageau","text":"So I want to shift gears a little bit, because one of the things I don't want to talk about the problem the whole time is what's wonderful about your book is that you also propose some solutions to the question. One of my favorite chapters in the book is the one where you talk about memory and the need to participate in communities at different levels of reality. And so you do point to the church as being the highest version of this, but you also point to all different levels of places where we can come together and join to manifest a group, a kind of a common purpose, a common goal, and something which is extremely connected to our daily lives. So maybe you can tell us a little bit about that."}
{"episode_id":"SW - #133 - 2021-01-02 - Rod Dreher - Preparing for a Soft Totalitarian Future","start":1223.73,"end":1449.69,"speaker":"Rod Dreher","text":"Sure. One of the people, one of the families I feature in Live not by Lies is the Benda family of Prague. They're Catholics. The late Vaclav Benda spent four years in prison for his human rights work. And they were the only Catholics, only Christians, in the inner circle of Vaclav Havel and the Charter 77 dissidents back under communism. And I interviewed them about their modes of resistance. They're in their apartment in Prague. They have this great apartment, tall ceilings. I mean, this is the Eastern European intellectual apartment. Books everywhere. It's messy. It's just wonderful. Camilla Bendova, the widow of Vaclav, she still lives there. She welcomed me into her house with some of her adult children. And just because I wanted to find out what is it like for an ordinary family to deal with this? All we read about usually is the demonstrations on the street, that sort of thing. But how do you raise a family of resisters, people who not only know how to resist the political oppression, but who know how in their lives to be faithful to their religion in a very atheist country? Well, one thing they did there, and Roger Scruton was part of this, when he would go over there under communism, got arrested for it, in fact, they would hold seminars where they thought it was so important to bring people together to talk about literature, to talk about art, to talk about history, because all the stuff being taught in the schools was bunk. It was ideological garbage. And people went to those seminars and apartments like the Bendas and there were others so they could remember who they were, what it meant to be a Czech, what it meant to be a Christian, what it meant to be part of the West. The communist regime depended on erasing that memory from the minds of the people so they could be molded. That was a big part of the resistance. Vaclav Benda also talked about something he called a parallel polis. He said that the communists depended on complete atomization of the population and making people afraid of each other for control. So what Benta tried to do was just bring people together for non political things like picnics, anything to get people to come out of their houses and realize that they are part of a community. And so that was something as simple as having a picnic or having a lecture about art, was a political act there to try to rebuild a sense of community. Another thing that the Bendas did was to show films. They showed a High Noon, for example, that was a big one in their family because they wanted to demonstrate to their children and to others this is how a brave man behaves, like Gary Cooper in that film. And in this way, art and telling stories, reading literature to the kids. It was important that you not only point outside the house and say, this is where the evil is, but you also give their children and people who are lost and build up their inner, their moral imagination. Camilla told me that she would read to her kids two hours every night. Even though she was working right and her husband was in prison, she still read to them. Said, what did you read? She said, I read myths. I read the classics. I read a lot of Tolkien. Why Tolkien? I said. She looked at me straight in the eye and said, because we knew that Mordor was real. And to this day, 30 years after the fall of communism in one of the most atheist countries in Europe, all the adult bended children are still practicing Catholics and so are their Children."}
{"episode_id":"SW - #133 - 2021-01-02 - Rod Dreher - Preparing for a Soft Totalitarian Future","start":1450.25,"end":1537.09,"speaker":"Jonathan Pageau","text":"Yeah, it's pretty amazing. I was really. I mean, I think that one of the great things about the book, and I really recommend everybody reading it, is both inspiring and humbling, you know, to be inspired by these characters and humbled by the fact that, you know, how much they were willing to put into this and how much energy and will and also how it paid off, like you said, that despite their suffering, despite people dying, people being imprisoned, you can see this kind of spark of life and continuing on in their generations. And one of the problems that you point out in the book, which is real for us, is that we seem. The system that is coming towards us seems to be a strange. It seemed impossible, but a strange mixture between 1994 and a brave New World. At the same time. It's as if we have these systems of total surveillance which are appearing on the line, and also mechanisms of exclusion and of total marginalization. But at the same time, we have this decadent society of pleasure and of fanciful. Whatever fanciful thing you can imagine has more weight than a normal family, normal society. So it's hard to deal with because it's not the same thing. So how do we answer this? Because it makes us lazy, right? We don't have an easy target to kind of say, we're gonna resist against that. We have Netflix and porn and things kind of dropping in on us that just make us lazy. And."}
{"episode_id":"SW - #133 - 2021-01-02 - Rod Dreher - Preparing for a Soft Totalitarian Future","start":1537.89,"end":1684.31,"speaker":"Rod Dreher","text":"Oh, my gosh, just this week, I had coffee with a man, an Evangelical Protestant, who does a lot of ministry with youth. And he was saying to me, we were sitting there having coffee, and he had just discovered my book, Live not by Lies, and was amazed by it and wanted to talk about it. And he said. He held up his phone, he goes, this. This is the problem. And he talked about, the kids are so obsessed with their phones and their Xboxes and their social media, blah, blah, blah. And yet he gives his kids access to it all. And I just couldn't. The cognitive dissonance there, I couldn't figure out because from what I understood from talking to him, and this is a man who cares about kids, who is engaged with the youth, is that it seems so overwhelming to him that it's best just to let it happen and just hope your kids do well with it. Camilla Bendova, the woman I was just talking about, I remember sitting in her apartment in Prague and noticed that she had a dumb phone on her coffee table. I asked her about that. I said, why don't you have a smartphone? And she said that if you've lived through what we have lived through in this country. You, you know that there is no way that information can be collected about you innocently. And of course she knows, as we all know, or should know, that companies are constantly collecting information, data about us and building profiles to sell us things. Well, Camilla said, sooner or later this is going to be weaponized against us. That's why I talk about in the book how I think what's coming here is something as an American version of the social credit system that China uses. It is perfectly compatible with a capitalist society. Right. But the ability to control people and manipulate people is greater than even Mao Zedong and Stalin had. It is actually possible in China to cut people off from the economy completely because they're moving to a cashless society. You do all your buying and selling with your phone. I talked to a guy in Nashville the other day, an American who said, yeah, it was amazing to me to get toilet paper in a public toilet, you have to use your phone to pay for it. If the government decides to cut you off, you're done. It really is a matter of you can't buy or sell unless you have the mark of approval from the government. Now this is coming here too, but we don't see it because this technology makes our lives convenient."}
{"episode_id":"SW - #133 - 2021-01-02 - Rod Dreher - Preparing for a Soft Totalitarian Future","start":1684.71,"end":1711.14,"speaker":"Jonathan Pageau","text":"Yeah. And also because there is this strange. It's a strange place where. Because it's happening mostly through corporations rather than through government for now, it disarms the right leaning people. It disarms the conservatives because they're all libertarians. And so because of that, they have no weapon to tell Google or to tell Twitter. Their only answer is to say, well, don't use their platform."}
{"episode_id":"SW - #133 - 2021-01-02 - Rod Dreher - Preparing for a Soft Totalitarian Future","start":1711.14,"end":1711.5,"speaker":"Rod Dreher","text":"Right."}
{"episode_id":"SW - #133 - 2021-01-02 - Rod Dreher - Preparing for a Soft Totalitarian Future","start":1711.5,"end":1758.74,"speaker":"Jonathan Pageau","text":"That's the capitalist answer. And it's like, okay, well, I don't see how this is going to get better. But it's tough. I suffer with that Baptist pastor because our kids had no phones and almost no access to the Internet until Covid. And then for months they were alone and they couldn't go anywhere and we couldn't go anywhere and we were in total lockdown and they couldn't see their friends and they couldn't. And then the school said, well, they need to have a phone or else they can't go to school. So we did school online. And so since then we've had the exact problem. The phone has taken over. Now we're like, how do we deal with this? Because without a phone the kids don't have friends. And it's like, it's a scary, scary place."}
{"episode_id":"SW - #133 - 2021-01-02 - Rod Dreher - Preparing for a Soft Totalitarian Future","start":1758.98,"end":1877.82,"speaker":"Rod Dreher","text":"We did the same Thing with Xbox with my teenage son, we didn't have any of that in the house. But because of COVID I mean, it was really, really hard for them and for him especially. And so, yeah, you have to make some compromises. And I'm not sitting on my high horse criticizing this pastor so much. You know, our kids, we're a little tougher on them with the phones. But look, I mean, I've got a phone, I'm on the Internet all the time. But ultimately this is undermining our liberties. And I'll tell you something else too. In the book, I talk about this conversation I had with a young Hungarian, maybe she's 29, 30 years old. She was my translator in Budapest. We were on the tram going to one of these interviews and she was talking to me about how difficult she finds it as a young married person and a young mom to have conversations with her friends. She said, as soon as I tell them that my husband and I are having some problems or, boy, it's just exhausting raising my kid. She goes, they cut me off. And they say, oh, just put your kid in daycare, leave your husband, go back to the workplace. You be you. You do what you need to do for yourself. She said, I want to tell them, no, no, no, I'm happy being married, I'm happy being a mom, a stay at home mom. But. But it's difficult. But they don't under. She said, they don't understand the importance of suffering. They don't understand even mild suffering, the kind of suffering that all of us do as we're getting used to being married, getting used to being a parent. She said they have been so acculturated to the idea that anything that gives you anxiety or is hard should be pushed away and run away from and rearrange your whole life to avoid any kind of suffering or anxiety. And I looked at her and said, it sounds like you're fighting for the right to be unhappy. She said, that's it. That's it. Where did you get that? Well, I pulled out my phone and went to chapter 17 of Brave New World, where the guy. The Savage."}
{"episode_id":"SW - #133 - 2021-01-02 - Rod Dreher - Preparing for a Soft Totalitarian Future","start":1877.98,"end":1879.02,"speaker":"Jonathan Pageau","text":"Yeah, John the Savage."}
{"episode_id":"SW - #133 - 2021-01-02 - Rod Dreher - Preparing for a Soft Totalitarian Future","start":1879.02,"end":1932.77,"speaker":"Rod Dreher","text":"John the Savage, Yeah. He is. Unlike in 1984 when Winston Smith meets O' Brien the torturer, O' Brien is like really torturing him to make him conform. Mustafa Maan, the world controller in Brave New World, he said to John the Savage, why do you want to stay on the outside of our society? You can have so much pleasure. You have Christianity without tears. That's what he says, and John the Savage chooses suffering because it's real. It's real life. Well, this is why this revolution that we've gone through in the last 50 years and that is accelerating is so hard to resist, because we have to choose to be unhappy, or in other words, to choose the conditions under which unhappiness is possible. Suffering is possible because it's real. Those who would want to control us are offering us no suffering at all."}
{"episode_id":"SW - #133 - 2021-01-02 - Rod Dreher - Preparing for a Soft Totalitarian Future","start":1932.93,"end":1969.52,"speaker":"Jonathan Pageau","text":"Yeah, but it's a trick, because we see, and we just have to look around us, that people are miserable and that people who try to avoid suffering end up taking pills to fight depression. They just end up wandering meaninglessly and. And accumulating stuff and being miserable. Whereas people, and you know, them, people who have kind of taken up a hard life to take care of someone who's sick, who have lost a child and have kind of dealt with it in a healthy way, you can see that they come out of it shining, that they have a brightness about them that we don't see very often anymore."}
{"episode_id":"SW - #133 - 2021-01-02 - Rod Dreher - Preparing for a Soft Totalitarian Future","start":1969.68,"end":2098.68,"speaker":"Rod Dreher","text":"And you know, I have to tell you that under Covid, you know, it was really tough for us at first. Your listeners may not know that I'm an Orthodox Christian. And we here in Louis, we couldn't go to liturgy for a while. And I got really fed up with that. And a lot of Christians were too, like, why are we not doing this? But then I had to stop and think about the people I just spent time talking to who couldn't go to church because if they went to church they would be thrown in prison. Or Christians who were thrown in prison, they still had to hold onto the faith even though they were suffering vastly worse than any of us were, simply by being told we couldn't go to church. And. And I had to fall back on the things they said about learning how not to feel sorry for yourself, because if you felt sorry for yourself, then you were done. And not to hate their torturers. I mean, this is incredible. The testimony from Orthodox Christians, from Catholics, from Protestants who went through that it was possible to be broken by that experience. But if you were willing to offer your sufferings to Christ and suffer as a Christian, and then it would refine you. I tell the story in Live, not by lies about this Slovak photographer Timo Kryshka, who was raised. He's the first generation after communism in Slovakia, and he had freedom and success and material wealth that his parents generation could only have dreamed of. But he still wasn't happy. He decided to go do a project, a Photographic project of interviewing elderly people who had been political prisoners for their Catholic faith under communism. And he said that just being with these people, some of whom are still quite poor today, and to talk to them about what they went through and how even in prison, those are some of the most joyful times of their life because they learned to be close to God in ways they wouldn't have understood before. It changed Timo's life entirely. And he realized that. That wealth and liberty can be a prison, too. Yeah."}
{"episode_id":"SW - #133 - 2021-01-02 - Rod Dreher - Preparing for a Soft Totalitarian Future","start":2098.84,"end":2170.65,"speaker":"Jonathan Pageau","text":"And it's interesting because I've had my moments during the cause. We are still in a kind of semi lockdown. There are some churches that have small liturgies you have to reserve in advance. You have to wear a mask. And there are other churches that just don't have it at all. And so, to be honest, I haven't been to church since the beginning of COVID because then they opened lockdown, opened up for two weeks and locked down again. And it's just been very frustrating. And so I've had these moments where I kind of feel that frustration. But then I think that reading your book also helped me to ask myself, okay, well, then if I'm so frustrated this. And I'm frustrated at the state because they want to prevent me from doing this. Like, am I getting up in the morning? Am I doing litanies? Am I reading the Psalms? Am I like, no, I'm not. I'm lazy. You know, it's like I do my barely my morning prayers, and then it's like I go on with my life. But if I really did care about this, and I was really suffering that I'm not in communion in church, then I would be compensating for it in my daily prayer life. But I'm not. And so it is more this kind of just laziness and easily blaming this. But I still think that all of this at some point is going to have to end. But I think that it has to start with my own discipline rather than wanting the state to change their rules right now."}
{"episode_id":"SW - #133 - 2021-01-02 - Rod Dreher - Preparing for a Soft Totalitarian Future","start":2170.81,"end":2243.06,"speaker":"Rod Dreher","text":"Exactly. And this is why I really do believe that Covid, that God has allowed this to happen. It's sort of a severe mercy for us, to prepare us for what's coming in the future. You know, if we as Christians, whether you're Orthodox or whatever, if you can't handle this sort of deprivation without falling apart or losing your discipline or just being filled with anger, then you're not going to make it through what's coming. That's one thing that I have really A lesson I've tried to take to heart through all this, that don't look at, don't get angry from COVID I mean, we're all sick of it. Maybe we're angry at the government, angry at our bishops, whatever. And that might be justified, but that anger is going to destroy us if we hold on to it. And we don't. Instead, use this time and this trial to deepen our repentance and deepen our conversion. I'm just like you. I have not been not added more prayer disciplines. And it's so stupid, because I know where this is going, but it really is a matter of the will, less about the mind than about the heart."}
{"episode_id":"SW - #133 - 2021-01-02 - Rod Dreher - Preparing for a Soft Totalitarian Future","start":2244.26,"end":2287.68,"speaker":"Jonathan Pageau","text":"And so I'm curious, though, because the book came out, I imagine that you were finishing up editing it as Covid was kind of coming in. And so you do mention it a little bit in the book, but it's not like a pervasive thing. And in the narrative. And so have you seen. Because one of the things that people are perceiving, and I have to admit that it's hard for me not to perceive it a little bit, especially now with certain language being used, this idea of the Great Reset, and certain phrases that are used by all world leaders at the same time. And so there is a sense that somehow Covid is at the least an opportunity to accelerate this system of control and that it's going to happen faster because of this pandemic. I don't know if that's something that you've meditated on."}
{"episode_id":"SW - #133 - 2021-01-02 - Rod Dreher - Preparing for a Soft Totalitarian Future","start":2288,"end":2386.12,"speaker":"Rod Dreher","text":"Yeah, I think it's true. And the difficult thing here is realizing that the pandemic is real. It's not like they've invented this just so they could figure out how to control us. But I think they are using the fact of the pandemic as an opportunity. It's like their Reichstag fire. I think that one thing I've noticed here, where I live in Baton Rouge, is that most places I go now, they prefer that you use the card, the debit card, to pay for little things, things that you would before hand over cash. Well, it's safer, it really is, to use the card, but we get accustomed to that. And whenever you make a purchase with a card, that data of what you bought is saved. And so a profile is created of you by these companies, by these banks. What's going to happen when the woksters who are running these banks decide that, as they've done in England. You mentioned earlier that your politics are so appalling that they're not going to allow you to have an account with them. Well, go find another bank. Well, what happens when they all decide that? And what happens when no stores will take cash anymore? I mean, this is a trial run for this sort of thing. And also contact tracing. It makes perfect sense to do contact tracing. This is how you fight a pandemic. But at the same time, what happens when they start seeing the fact that you're a Christian or you're a conservative or you in some way are part of the deplorable community and they want to contact trace where you've been?"}
{"episode_id":"SW - #133 - 2021-01-02 - Rod Dreher - Preparing for a Soft Totalitarian Future","start":2386.84,"end":2390.36,"speaker":"Jonathan Pageau","text":"No, it seems like at least the mechanisms are there."}
{"episode_id":"SW - #133 - 2021-01-02 - Rod Dreher - Preparing for a Soft Totalitarian Future","start":2390.76,"end":2391.46,"speaker":"Rod Dreher","text":"And it's."}
{"episode_id":"SW - #133 - 2021-01-02 - Rod Dreher - Preparing for a Soft Totalitarian Future","start":2392.25,"end":2420.9,"speaker":"Jonathan Pageau","text":"Even though it's not happening now, it's just a question of time before someone starts to use these same mechanisms to trace people for political reasons. And we know it's true because we are watching the companies that are using the data becoming politicized at this very moment. They are politicized and they're acting more and more in terms of politics and taking political stances, taking value and ideological stances. And so as this accelerates, it's going to become more and more of a reality."}
{"episode_id":"SW - #133 - 2021-01-02 - Rod Dreher - Preparing for a Soft Totalitarian Future","start":2421.54,"end":2530.01,"speaker":"Rod Dreher","text":"Here's what's so interesting in China, the social credit system there, you would think the Chinese people would be appalled by it, by the fact that the government, government computers are using this data to give everybody a social credit rating. And if you do things that offend the government, you get a lower rating and your privileges are reduced. You'd think they would all hate that. It's not true. A lot of them love it because communism, the experience of communism, destroyed social trust there. And a lot of Chinese people just don't know who they can trust. Their society has been in so much turmoil as capitalism has taken over that they feel like they're going to be taken advantage of at every turn. So if you look at a social credit rating, you know that person with a high rating is trustworthy. It gives them a sense of security to have the social credit system. Similarly, in this country, I think especially with the millennials and Gen Z, who are becoming more politicized culturally, they're going to look at this as a tool that helps them stay pure and not do business with the bad people. And I think they're going to welcome it. James Polos, the cultural critic, he says that we are headed to what he calls a pink police state. What he means by that is that we will be a people who will sacrifice important political liberties like freedom of religion, freedom of speech, in exchange for Safety and health, which is to say a society in which the state guarantees that we're never going to be troubled by people who believe destructive things and things that make us feel unsafe. And they will continue to give us our porn, give us our pot, make this stuff available to us. The only price is going to be the surrender of political liberty. And Polos says that this is coming and that people are going to welcome it. Yeah."}
{"episode_id":"SW - #133 - 2021-01-02 - Rod Dreher - Preparing for a Soft Totalitarian Future","start":2530.09,"end":2609.12,"speaker":"Jonathan Pageau","text":"And to me, it's a strange fascination because I remember when I was young, I was kind of in. I grew up in an evangelical culture and apocalyptic culture. There was a lot of that stuff going on. And I remember as a young person reading, being told about the Mark of the Beast and thinking, why would anybody accept that? I was trying to figure out, okay, so there's this thing, this mark, and then people are identified and then they, if they don't have it, they can't participate. And I kept thinking, okay, but why would anybody accept that? Like, how could it happen in a society? And it's just been very strange to watch it happen and to kind of watch the idea that this notion of being identified and being, let's say, not managed, but being identified as pure, being identified as part of the system, is something which we are actually welcoming quite, quite easily. And it's a weird upside down thing too, because the thing that will make you excluded in the end is you not being open. So it's actually, it's actually you have to, you have to accept completely those that are supposedly excluded in order to be part of the system. And if you have some kind of hierarchy, then like any kind of hierarchy, then you're going to be excluded. That's what it seems to be."}
{"episode_id":"SW - #133 - 2021-01-02 - Rod Dreher - Preparing for a Soft Totalitarian Future","start":2609.12,"end":2682.88,"speaker":"Rod Dreher","text":"Yeah. You know Hannah Arendt, the great 20th century political theorist? She wrote a book called the Origins of Totalitarianism and she was a refugee, a Jewish refugee from Nazi Germany. But she set out after the end of the Second World War to understand why it was that Germany and Russia had both surrendered to totalitarianism, though very different systems. And one of the things she found was that in both countries the elites were willing to surrender and allow the pillars of civilization to be destroyed for the sake of allowing those who had been excluded in the past to come in. We see that happening right now, especially in our universities. The idea of diversity and inclusion, these are just words used as a cover for destroying the things that make a university, destroying the ability to have freedom of thought and freedom of expression within the university to debate ideas. Now if you bring up, if you contradict Anything with this new ideology, then you are being accused of being against diversity and against inclusion, and you are therefore a heretic."}
{"episode_id":"SW - #133 - 2021-01-02 - Rod Dreher - Preparing for a Soft Totalitarian Future","start":2682.96,"end":2797.41,"speaker":"Jonathan Pageau","text":"Yeah. And so one of the things that has been one of my motivating factors in the past few years has been to help people understand marginality and to understand it in both positive and negative sense. Because the two aspects of the totalizing systems, let's say the fascist system and the communist system, it's a caricature. But the two sides of the totalizing system is that one of them wants to cut off the margin completely, to remove it, burn it, and the other one wants to include it completely in a way that it is normalized. And both of those are just the wrong. They're just the danger of not letting the margin be the margin, not letting the fringe flop in the wind, not letting the edge of the carpet have tassels. And the idea that if you read in Scripture, it talks about leaving the corner of the fields that aren't. You don't reap the corner of the fields or that you leave the fringe on the vestment. You need a fringe on your vestment or the narthex, the gargoyles on the outside. There's all these images of the fringe in a traditional society, and carnivals are part of it and all this. And I'm trying to help people understand that. Someone mentioned this on Twitter and tagged me on it, said that we often think that it's dangerous to bring the dragon into the city because of the city, that it'll destroy the city. But we don't think how dangerous it is to bring it into the city for the dragon, because for a dragon to remain a dragon, it has to stay outside the city. And some aspects of society have power in their marginality. Like they have an effect on the world because they are questioning the system. So the fool, you need the fool to stay the fool. But if you start saying, stop saying that the fool is a fool and stop saying that he's a fool, he's just like you. And he's like, well, yeah, but the fool is part of this. You need the fool to act like a fool and to be the fool and to have the advantages and disadvantages that come with it."}
{"episode_id":"SW - #133 - 2021-01-02 - Rod Dreher - Preparing for a Soft Totalitarian Future","start":2797.89,"end":2815.63,"speaker":"Rod Dreher","text":"Right? Yeah. In the Orthodox tradition, as you know, we have the holy fool that comes out of Russian Orthodoxy, where people learn to pay attention to the fool. They don't try to domesticate him. They don't try to bring him in and make him respectable. They listen to his voice because he's a prophet."}
{"episode_id":"SW - #133 - 2021-01-02 - Rod Dreher - Preparing for a Soft Totalitarian Future","start":2815.95,"end":2829.15,"speaker":"Jonathan Pageau","text":"Yeah. And that's exactly the right way, is to say that the fool has to remain raw. If you try to domesticate the fool, you're damaging the system and you're going to damage the fool on both sides."}
{"episode_id":"SW - #133 - 2021-01-02 - Rod Dreher - Preparing for a Soft Totalitarian Future","start":2829.64,"end":2909.38,"speaker":"Rod Dreher","text":"You know, just before we came onto this interview, I saw on Twitter that the Muir woods out north of San Francisco, which is an incredible place, it's a redwood forest. I've been there. It is like you go there and you understand where the druids came from. Right. But you could see why you would want to worship trees. But they now have a thing they put up there, the Park Service talking about mirror woods, queerwoods. They talk about queer ecology and the forest. And it's the craziest thing. It is the most blatant example of trying to force this ideology into places where it doesn't belong. It reminded me, Jonathan, of what happened. I talk about this in live, not by lies too about after the Soviet Revolution, the Bolshevik Revolution, the Soviet chess society was trying really hard to keep politics out of chess, to make it a pure place where we just came there for the game and they put out a statement saying, we want to keep chess for chess's sake. Well, a commissar wrote to them and said, no, no, no, comrades, after the revolution, everything must be brought under the umbrella of the revolution. We can't have chess for chess's sake. That is a mentality that is so destructive of everything and we're doing it here now. The idea that the freaking Muir woods now has to be queered."}
{"episode_id":"SW - #133 - 2021-01-02 - Rod Dreher - Preparing for a Soft Totalitarian Future","start":2909.46,"end":2922.94,"speaker":"Jonathan Pageau","text":"Oh man, I wish they would have gone to the end of their making chess communist and then made all the parts move the same. Yeah, they should have told. Let's see how far that goes in terms of maintaining your chess club."}
{"episode_id":"SW - #133 - 2021-01-02 - Rod Dreher - Preparing for a Soft Totalitarian Future","start":2924.54,"end":2955.63,"speaker":"Rod Dreher","text":"Nothing against LGBT folks, but the idea that you have to bring this woke consciousness, whether it's race or sexuality, to just walking in the woods. You can't walk in the woods and clear your mind and get away from the revolution. The revolution is always with you now. I would feel the same way if this were 50, 60 years ago and they were putting patriotic propaganda there and trying to make the woods a testimony to the greatness of America. It's have to be the woods."}
{"episode_id":"SW - #133 - 2021-01-02 - Rod Dreher - Preparing for a Soft Totalitarian Future","start":2955.63,"end":2988.52,"speaker":"Jonathan Pageau","text":"Yeah. Especially the wild spaces. Especially those untouched spaces that are. They actually represent the idea of non civilization or none idea to say they're analogical to non ideological. Because they're not there, they're left wild like the corners of the field or like. So just leave them wild. You don't have to you don't have to constantly. Yeah, you don't have to colonize. It's interesting because it's actually a way of. It's a kind of reverse colonization of nature, like a form of colonization, but done from a certain ideological perspective."}
{"episode_id":"SW - #133 - 2021-01-02 - Rod Dreher - Preparing for a Soft Totalitarian Future","start":2988.76,"end":3042.23,"speaker":"Rod Dreher","text":"And, you know, when I was in Poland last year in Warsaw doing reporting for this book, I talked to Poles, two or three Poles who work for the Polish branch of Western, that is American and European multinationals. And they were talking about the cultural imperialism that is coming into the Polish workspace from big business. Specifically, they were being compelled to participate in LGBT Pride celebrations even though they were Catholics and this violated their conscience. But they said that it's so hard to get jobs this good here, where our families are struggling, where what should we do? And it made me really angry as an American that these people, they had to suffer colonization by the Soviet Union, and now they're suffering colonization by woke. Colonization by woke capitalism. I mean, it's just. Sorry."}
{"episode_id":"SW - #133 - 2021-01-02 - Rod Dreher - Preparing for a Soft Totalitarian Future","start":3044.15,"end":3131.46,"speaker":"Jonathan Pageau","text":"I think it's good to understand the moment, and it's also, for me, it's good to see the upside down moment because. Because it's as if that which is marginal is trying to become king and trying to then impose its weird kind of marginal identity on everything. And so that's why in your book, what's wonderful about the book and what's wonderful about the possibility at this moment is to actually take the dissident position. And so one of the kind of fascinating double ironies of your book is that you use the kind of early Russian style on the COVID of the book where you're actually using. Because I have the audiobook, so I don't have a physical copy of it. And so you're using this kind of early modernist style, which was revolutionary, to now talk about resistance and dissidents to this new system. And it's a. I like pointing to the Robin Hood story, like this weird Robin Hood moment where everything becomes upside down and the illegitimate becomes legitimate. And so then the normal person ends up looking like a rebel and ends up looking like a. Like a dissident. And the Babylon Bee does a lot of that on that, where they talk about the rebellious family that decides to stay married and have kids and how they're totally flaunting the rules of society, you know, and so there's a position to take which is actually. Which is a consistent position which also has some motivational power and knowing you're kind of a strange upside down rebel just by being normal."}
{"episode_id":"SW - #133 - 2021-01-02 - Rod Dreher - Preparing for a Soft Totalitarian Future","start":3132.02,"end":3212.82,"speaker":"Rod Dreher","text":"Yeah, the COVID is. It is Soviet constructivism I deliberately chose that design to flip things because, as you say, that was the artistic style associated with the revolution. Well, I wanted to make Christian dissidents out to be like revolutionaries. And there are some older people I've heard in Orthodox parishes in the US who are really bothered by that because it is associated with communism. But I can understand that. But I'm trying to flip things, as you say, in an ironic way. I think that. And for me, as an Orthodox Christian, it has been helpful because if you are an Orthodox Christian in North America, you are on the fringe by definition, you know, and it has been really good for me to accustom me to being an outsider and to be okay with that living in that outside space. Because it's going to be more and more the case that not just for Orthodox Christians, but for any Christian or any traditionalist, you are going to be already on the outside, but increasingly persecuted for being on the outside. But we have so much in recent church life and life of the church in the 20th century of that persecution and showing that it's possible, knowing from lived experience that it is possible to survive it."}
{"episode_id":"SW - #133 - 2021-01-02 - Rod Dreher - Preparing for a Soft Totalitarian Future","start":3213.86,"end":3240.25,"speaker":"Jonathan Pageau","text":"Well, listen, first of all, I really appreciate this conversation and I want to encourage everybody to get live not by lies. You know, you can get. I listened to it on audiobook twice while I was carving. And so there are different ways you can get the book. It is definitely worth it. It is both humbling and encouraging and it gives us some solutions, little solutions to put in place as we kind of move into this strange, soft, totalitarian space. So thanks, Rod, for talking to me."}
{"episode_id":"SW - #133 - 2021-01-02 - Rod Dreher - Preparing for a Soft Totalitarian Future","start":3240.25,"end":3283.47,"speaker":"Rod Dreher","text":"Oh, it's my pleasure. And I want to end Jonathan by simply saying that this is not an optimistic book, but it's a hopeful book. What's the difference? Optimists believe that everything's always going to be great. Don't worry about it. Well, that's not really true. That's not realistic. Things may work out well, but they may not. We may have to go to the Gulag, but people who are hopeful believe that in the end, good will triumph, God will triumph, and we may not live to see it. But as long as we unite our sufferings and stay faithful, and even if it cost us, then we will be part of the redemption of the world that God works. So hope, Christian hope is the thing we need, not false optimism."}
{"episode_id":"SW - #133 - 2021-01-02 - Rod Dreher - Preparing for a Soft Totalitarian Future","start":3284.43,"end":3351.99,"speaker":"Jonathan Pageau","text":"All right, thanks, Rod. It was great to talk to you. I hope you enjoyed this episode of the Symbolic World. The Symbolic World is edited by Justin Ward, and it is based on a series of videos that you can find on my YouTube channel, Jonathan Pageau's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by, of course, leaving a review on itunes. Everybody knows that's the best way to get the podcast out there to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon Peugeot videos as well, and on subscribestar. All those links you can find on my website or in the show description. So thank you and I will see you soon."}
