{"episode_id":"SW - #280 - 2023-03-31 - Richard Rohlin - Universal History - Beowulf","start":0.32,"end":36.41,"speaker":"Richard Rohlin","text":"So here's what happens. People read Beowulf, they come across things that don't seem like they belong to modern Christianity or even like, let's say, late medieval Roman Catholicism. And so they say, well, this must be a pagan leftover. Yeah. So my question is, well, is it a pagan leftover? Which would be fine. I wouldn't really be bothered by that. But is it a leftover? Or is it the Beowulf poet using his Christianity, Anglo Saxon Christianity. Right. Which was his framework to try to make sense of the world that he had had inherited from both his Christian and his pagan forebearer."}
{"episode_id":"SW - #280 - 2023-03-31 - Richard Rohlin - Universal History - Beowulf","start":52.74,"end":86.51,"speaker":"Jonathan Pageau","text":"This is Jonathan Pescheot. Welcome to the symbolic world. It's good to see everybody. I'm really happy that we're kind of back into the schedule with Richard. It's hard because now he's becoming so busy and sadly I'm busy too. But I'm really excited we're going to talk about Beowulf. I've been looking really forward to this episode. And so, Richard, thanks for coming. And you have a few things you also want to announce because as if you. There are too many things you're doing. But that's cool, go for it."}
{"episode_id":"SW - #280 - 2023-03-31 - Richard Rohlin - Universal History - Beowulf","start":86.51,"end":249.49,"speaker":"Richard Rohlin","text":"That's right. I just want to announce a couple of pretty cool things. One is, some people know that I am publishing a tabletop role playing game that's actually set in a fantasy world that I've been working on for about 20 years now. And so the role playing game is called Role Playing in the World Under Starlight. It's coming up from Strange Owl Games in the spring. There will be a Kickstarter in April and you can go and you can back it, you can get hard copies, PDFs, all this stuff. There are going to be some levels where if you back it, we'll play a game together and I'll run a game, all this kind of stuff. So the Kickstarter hasn't launched yet, but if you want to keep up with the project and also get in on the play test packets as they come out, there's a Patreon. It's not my Patreon, it's Strange Owl, the publishing company's Patreon. I do get some of that, but it's their Patreon, so we'll put a link to that down in the doobly doo, as they say. And so if people want to follow along with the project, find out more about, like, what even is this world? Is this a project that I'm interested in at the higher levels? Like, I Said you get playtest packets, character sheets, adventures, setting materials, things like that as we develop it. We just got a bunch of stuff back from our layout artist, and it looks really cool and cool, so people will want to check that out. The other big thing that I do want to announce is, is that sometime, hopefully around when this video drops or maybe. Maybe a little bit later, we'll see. We're going to be launching a small crowdfunding campaign for Finding the Golden Key. This collection of essays, I know we've been talking about it for a while. It's Finding the Golden Key, Essays Towards a Recovery of the Sacramental Imagination. Or I'll probably just call it Recovering the Sacramental Imagination, because that's a little easier to say. And the crowdfunding campaign is going to cover a couple of things. I'm not making any money off of this book. I'm just doing it because this is a really important thing to me. Obviously, Jonathan, you've got an essay in this book, and a lot of other people in the symbolic world community do as well. We're going to be starting a crowdfunding campaign basically to cover the cost of COVID art, which is going to be done by Hugh Rose. And he's got some insanely cool ideas for how we're going to do this. So he's going to be doing the COVID art. So we want to make sure that we can pay him what he's worth and then also raise money to handle things like copy editing and typesetting. So it'll be like a small crowdfunding campaign, and hopefully this symbolic world community can kind of rally around. We can get that knocked out. So that's the other thing that I wanted to announce today. I'm sure I'm doing other things that are also fun, but those are the two that I'll mention. So we'll have links to both of those. Hopefully we'll get that crowdfunding campaign. I got to figure out a whole bunch of questions, a whole bunch of things that I don't know about crowdfunding that I need to figure out."}
{"episode_id":"SW - #280 - 2023-03-31 - Richard Rohlin - Universal History - Beowulf","start":249.57,"end":251.49,"speaker":"Jonathan Pageau","text":"All right. Yeah, we can help you."}
{"episode_id":"SW - #280 - 2023-03-31 - Richard Rohlin - Universal History - Beowulf","start":251.49,"end":251.69,"speaker":"Richard Rohlin","text":"Like."}
{"episode_id":"SW - #280 - 2023-03-31 - Richard Rohlin - Universal History - Beowulf","start":251.69,"end":254.93,"speaker":"Jonathan Pageau","text":"Well, it's like, I can give some advice. Nicholas Kotar is also good on."}
{"episode_id":"SW - #280 - 2023-03-31 - Richard Rohlin - Universal History - Beowulf","start":255.01,"end":262.29,"speaker":"Richard Rohlin","text":"Yes, yes, yes. Yeah. Fortunately, we have people in the community who know these things now, so. And my. My project's going to be way simpler than what Nicholas just did."}
{"episode_id":"SW - #280 - 2023-03-31 - Richard Rohlin - Universal History - Beowulf","start":263.22,"end":266.34,"speaker":"Jonathan Pageau","text":"All right, so let's go Beowulf, because I'm excited."}
{"episode_id":"SW - #280 - 2023-03-31 - Richard Rohlin - Universal History - Beowulf","start":266.42,"end":269.38,"speaker":"Richard Rohlin","text":"Oh, should we announce the other thing that we talked about just a minute ago?"}
{"episode_id":"SW - #280 - 2023-03-31 - Richard Rohlin - Universal History - Beowulf","start":269.78,"end":273.66,"speaker":"Jonathan Pageau","text":"Which thing we talk about so many things."}
{"episode_id":"SW - #280 - 2023-03-31 - Richard Rohlin - Universal History - Beowulf","start":273.66,"end":276.3,"speaker":"Richard Rohlin","text":"Which one are you going to announce the class? Do we want to go ahead and announce."}
{"episode_id":"SW - #280 - 2023-03-31 - Richard Rohlin - Universal History - Beowulf","start":276.3,"end":278.14,"speaker":"Jonathan Pageau","text":"Oh, yeah, sure, go for it. Yeah, definitely."}
{"episode_id":"SW - #280 - 2023-03-31 - Richard Rohlin - Universal History - Beowulf","start":278.14,"end":336.64,"speaker":"Richard Rohlin","text":"Okay, so sometime this spring, depending on, you know, when we get the new website up and all that stuff, we're going to be offering a Beowulf course through the Symbolic World. I'll be teaching it. Jonathan will be involved as much as I can rope him in, probably. But the plan will be that we'll actually read through Beowulf together as a group. It'll probably take about six weeks to do this. I have a. Actually a class and a curriculum that I've already developed and taught several times, but I'm going to be adding in a bunch more of the kind of material that you're going to be hearing today. So if you're interested in the idea of a sort of a book club where we read through Beowulf together and then discuss it, and this will include discussions of the original language. I can't teach you Anglo Saxon in six weeks, but, but I will do some reading from the original language so you can get a taste and kind of like a sense for how it sounded and, and the rhythm of the poetry and these things. And we're going to do it and there will be like a live class and then at the end of that, the lectures will be, I assume, available for purchase."}
{"episode_id":"SW - #280 - 2023-03-31 - Richard Rohlin - Universal History - Beowulf","start":336.64,"end":343.4,"speaker":"Jonathan Pageau","text":"So, yeah, I'm going to record them and then we'll. And then we will sell it as a. As a course that will be on Symbolic World permanently."}
{"episode_id":"SW - #280 - 2023-03-31 - Richard Rohlin - Universal History - Beowulf","start":343.4,"end":568.66,"speaker":"Richard Rohlin","text":"So, yeah, so this will be on the new Symbolic World site and I'm very excited about it. So just stay tuned for more information about that. Okay, cool. So last time we kind of teased this relationship between Anglo Saxon culture. Right. As we're making our way through the universal history in the symbolic world, we tease this relationship between Anglo Saxon culture and literature and Christian apocryphal, Jewish and Christian apocryphal literature. So I wanted to talk a little bit more about that today and give some specific examples because it's very clear. It's very clear that the author of Beowulf, first of all, is a Christian. Beowulf is, in some senses, it's like the most overstudied poem in history because it's got so many people who have written about it and studied it and things like this. And the thing is, once you get into it, you start to realize why it's so attractive, why it's interesting in this, in this way, because it's A. It's a. It's been described by, for instance, Professor Michael Drought as a textual ruin. Right. It's like coming across these. Ruin, these ruins. Tolkien used this analogy as well. Coming across the ruins of this tower. Right. Kind of, you know, and you want to. You want to just, like, pick it apart and try to figure out, well, why did they, you know, and what's this about? And every single stone you pick up, right? Every little. Every little crux that you come across in the text, every little, like, clearly, this is not the right word. The scribe got this wrong. So what did it say? Every single example of that, and there are quite a number of them in the Beowulf poem is just sort of endlessly interesting and fascinating. And it's the kind of. At one point in my life, Jonathan, and I've. I've totally, utterly failed at this, but I really aspired to be like the man of one book. I forget whose. I forget who it was that had this concept. But basically it was the idea that instead of trying to read everything, you should just study one thing and just go as deep as you can possibly go into that thing. And for a long time for me, Beowulf was that really. Yeah, like I said, I've tremendously failed at being a man of one book, as my office, which is mostly bookshelves at this point, can attest. But there's something that's really deeply fascinating and beautiful to me about this poem. I'll talk more about that in the course. But what I want to kind of argue is that the Beowulf poem is a sort of Rosetta stone. It's a Rosetta stone for medieval Christianity and the ways that they interacted both with this much older, weirder Christian and Jewish tradition, inheritance that they'd inherited, and then also try to figure out how do we fit that into the things that our ancestors believed about the world, our pagan ancestors, the things they believed about the world. And if you kind of look at the Beowulf poem, it's really got all these things in miniature. You have the conflict of Christian and Germanic values. You've got the conflict of the religions as kind of their underlying things as well. One of the interesting conflicts that I probably won't talk very much about today that seems to be going on in Beowulf is actually a memory of an even older pre Christian conflict between kind of the older, let's say, like, fertility cults, which were focused around the bogs. Right, the bogs. And then the newer kind of Odinic religion, which is focused more around the hall. Right. And focus more on, like, war as opposed to. As opposed to fertility. So there's a bunch of different interesting things going on in Beowulf, and it kind of just soaks them all up into itself. But as I said, the fact that it's like this makes it. Because it's kind of overstudied in a way, makes it an incredibly contentious field. So there's almost nothing in Beowulf that's not up for debate by somebody."}
{"episode_id":"SW - #280 - 2023-03-31 - Richard Rohlin - Universal History - Beowulf","start":568.93,"end":573.09,"speaker":"Jonathan Pageau","text":"But you're going to have Beowulf scholars, like, arguing in the comments and yelling."}
{"episode_id":"SW - #280 - 2023-03-31 - Richard Rohlin - Universal History - Beowulf","start":573.09,"end":762.71,"speaker":"Richard Rohlin","text":"Actually, famously at the University of Toronto, there was a fistfight over the dating of Beowulf. This is in Canada, of all places. So there you go. There you go up there in Canada land. So there's almost nothing about the poem that's not debated. But one of the things that isn't debated is that the Beowulf poet was a Christian, probably a monk. I mean, certainly a monk. And then depending on when you think the poem was written, like I said, very contentious question, maybe in the 7th or the 9th or, sorry, the 8th or the 9th or 10th, 11th century, somewhere in there, a lot of different theories. I tend to follow the kind of the more conservative age of bead dating, which was the older belief, and then it fell out of style and now it's back in style. But anyway, I like it for metrical reasons and other things that I won't get into today, but it's not hugely important to our understanding of the poem. So you've got this Christian author, but then what people don't really necessarily agree on is to what degree was the Beowulf poet just telling his own story, making up a story? And then to what degree was he taking older stuff and kind of synthesizing it, working it together? And what I would basically say is that that is a. That's a weirdly modern question to ask about a pre modern work. Right. You know, people didn't think. Think about originality the way that we do today in the Middle Ages. They certainly didn't prize it the way that we do today. You know, so this is really kind of the wrong question to me. But the, the better question to ask is when we come across something that doesn't seem to match with, let's say, for instance. So, so here's what happens. People read Beowulf, they come across things that don't seem like they belong to modern Christianity or even, like, let's say, late medieval Roman Catholicism. And so they say well, this must be a pagan leftover. Yeah. So my question is, well, is it a pagan leftover? Which would be fine. I wouldn't really be bothered by that. But is it a leftover or is it the Beowulf poet using his Christianity, Anglo Saxon Christianity. Right. Which was his framework to try to make sense of the world that he had inherited from both his Christian and his pagan forebearers. Yeah. So that's, I, that's what I want to kind of show some examples of today because it's a great, like I said, it's kind of a great test case for the way that this was done in, in the Middle Ages. Yeah. So we talked about a little bit last time about how the Christian apocryphal literature was preserved in Anglo Saxon England in a way that maybe it doesn't hold on so many other places in Western Europe. Part of this is because, of course England and by extension Ireland is way out on the edge of things. So even though something like the Book of Enoch had already been sort of, I think, officially banned by the Pope by this point in time in history, you know, that is sort of like they might not even have heard about that ban, let alone there been any way to enforce it, you know, in, in, in 7th century. Yeah, 7th century, 8th century Anglo Saxon England."}
{"episode_id":"SW - #280 - 2023-03-31 - Richard Rohlin - Universal History - Beowulf","start":763.11,"end":780.47,"speaker":"Jonathan Pageau","text":"It's interesting because there are, there's a, like what you're saying, for example, the legend of St Christopher as a dog headed man. It exists both in the east and in England and Ireland because it's as if they just have access or they have kept certain traditions that have been kind of forgotten and left to the, to the wayside."}
{"episode_id":"SW - #280 - 2023-03-31 - Richard Rohlin - Universal History - Beowulf","start":780.71,"end":1062.19,"speaker":"Richard Rohlin","text":"Yeah. And this includes things like names of archangels and other things that show up in old Irish and English prayer books. I talked a little bit last time about the Psalter in the Rain, the Psalter of the Quatrains, which was this collection of 150 poems, basically giving the Irish version of medieval universal history, starting with the fall of the gods, starting with the fall of the devil and his angels, and how humanity is intended to take their place in the heavens. Right. That there are these empty thrones that we are destined for, you know, right there at the very beginning. And by the way, that same understanding of the fall of the devil is in the Anglo Saxon Genesis. So there's an epic poem retelling. Got it right here on the shelf. There's an epic poem retelling of the Book of Genesis. The Old English were real. They were real keen on the Old Testament. I think that they found a sort of kinship in the stories of the Old Testament in the. Not just because, like, there's a bunch of violent stuff that happens in the Old Testament, but really because I think that this idea of there's something really fundamental specifically about Genesis, that this is how it all came to be. Right. In fact, in Beowulf, this is the song. This is the song that the shop sings, the skald or the bard, this song that the shulk sings in the hall of Heorot, which angers Grendel. It's the song of the creation of the world. It's the song of Genesis. Well, you can think about how did they tell the story of Genesis, Right? How did the Anglo Saxons tell it? Well, it starts out with the tale of the fall, fall of the devil. The devil falls, and now there are these empty thrones, and that's the story of the creation of the world. That's the story of Genesis. That's why we're made, is to. Is to sit on those thrones. Right? So then you can start to see why Grendel, who, as we're going to see in a moment, is somewhere between a demon and a man, you can see why he would be angered by that kind of a song. Right? So there's lots of really interesting stuff like this. And of course, there's an old English poem called Solomon and Saturn which has a bunch of details for which the Book of Enoch is probably the ultimate source, Maybe, maybe. Or maybe not the original source. But I'm just saying all this to say I think there's every reason to believe that the author of the Beowulf poem either had access to the Book of Enoch or just a kind of access to this homiletic tradition based on Enochian and apocryphal literature that was really common in. Really common in England during the Middle Ages. So I'll give a couple of examples of that. Right. First of all, we've got Grendel. So for people who don't know the story of the Beowulf poem, come to my class. But for people who don't know the story, there are three monsters. Beowulf is the fourth monster. That's kind of the. Actually the hidden story. But he's the fourth monster. But he's the good monster, Right? In fact, sometimes the poem will, in Old English, will use the same language to refer to Grendel on one page, and then you turn a couple of pages, and now that same monster language is being used to talk about Beowulf. Right. I should say that Beowulf himself probably has an origin in something like a fairy tale or folklore. As a character. There is a. There's a very kind of common folkloric trope in European stories called the bear's son tale. Right. And so the bear's son tale is basically the idea that this woman has relationship with a bear and the resulting child is man. Is a man, but also kind of bear like. Right. He's way too big, he's a little too hairy, he sleeps a lot, he eats too much. And basically he's just a nuisance to everyone. Nobody likes him, nobody wants to, you know, and he sleeps too close to the fire and, you know, just this idea of this big, slow, stupid, hibernating bear. And then one day a monster shows up that nobody else can. Can kill, nobody else can fight. And the bear's son saves everybody. And then they're like, oh, now I kind of. I see your worth. I understand your worth now. And there are relics of this kind of story in the Beowulf poem. So after Beowulf has killed Grendel and Grendel's mother, for instance, he goes back home and we're told. And this is the first time we're told this, because the Beowulf poet doesn't. He doesn't give us information in a linear fashion. He's a very careful storyteller. And so when he goes back home, we find out that actually before he left, everyone kind of thought, well, you know, glad we've gotten rid of him, like, you know, because he was such a nuisance. And now he comes back and he's this big hero and everybody kind of realizes maybe we were wrong about this guy. So there's that kind of a thing going on in the story. Hence all the kind of monstrous language that's used about Beowulf. Interesting."}
{"episode_id":"SW - #280 - 2023-03-31 - Richard Rohlin - Universal History - Beowulf","start":1062.19,"end":1063.55,"speaker":"Jonathan Pageau","text":"You said there are three monsters like Grendel."}
{"episode_id":"SW - #280 - 2023-03-31 - Richard Rohlin - Universal History - Beowulf","start":1063.55,"end":1077.39,"speaker":"Richard Rohlin","text":"Yeah. So there are three monsters. Three monsters. The first is Grendel, the second is Grendel's mother, and the third one is the dragon. The dragon, yeah. Now, modern retellings. I'm looking at you, Grand Morrison. No, it's not Gram Morrison."}
{"episode_id":"SW - #280 - 2023-03-31 - Richard Rohlin - Universal History - Beowulf","start":1077.39,"end":1079.51,"speaker":"Jonathan Pageau","text":"Neil Gaiman is. Neil Gaiman wrote that."}
{"episode_id":"SW - #280 - 2023-03-31 - Richard Rohlin - Universal History - Beowulf","start":1079.83,"end":1081.43,"speaker":"Richard Rohlin","text":"Why did I confuse those two weirdos?"}
{"episode_id":"SW - #280 - 2023-03-31 - Richard Rohlin - Universal History - Beowulf","start":1081.43,"end":1082.95,"speaker":"Jonathan Pageau","text":"I don't know. Like, how could you?"}
{"episode_id":"SW - #280 - 2023-03-31 - Richard Rohlin - Universal History - Beowulf","start":1082.95,"end":1279.18,"speaker":"Richard Rohlin","text":"Yeah, how could I? Yeah, yeah. So modern retellings. Look, here's looking at you. Neil Gaiman, but not just his others as well, have tried to connect these monsters by, you know, like, saying, oh, there were relations and Then the dragon is Beowulf's son or Hrothgar's son or like, you know, all this stuff. But it's not like that in the poem. And I don't. Obviously, I don't like that retelling, but. But for a couple of reasons, not just because it's not, you know, the original or something, but because it really mistakes what the monsters are and what they do in the story. But in any case, so there are three monsters, Grendel, Grendel's mother, and the dragon. Grendel and Grendel's mother are probably the. One of the closest connections that the Beowulf poem has to the Book of Enoch. So they are, first of all, giants. They are referred to frequently throughout the poem as being giants, like normal words for giants, you know, Eotan, which is normal Anglo Saxon word for giant, fierce, which is kind of like means like a troll or a marsh troll or, you know, like, what's the difference between a troll and giant? Well, not really a whole lot for purposes of the story that we're talking about here. Yeah. But also, Grendel is frequently referred to as a demon. The language that's used for him is the language that is used to describe. That's the language that is used to describe demons and evil spirits and other Anglo Saxon literature. Grendel, of course, is a. He eats humans, but he doesn't just eat humans, he drinks blood. Yeah, he likes to rip the head off of. Rip the heads off of people. Famously Beowulf's retainer, Hansho, which by the way, means glove. A glove is a hand shoe. So anyway, some guy with the name Glove, he gets. Gets his head ripped off and Grendel drinks his blood. But this sort of cannibalistic blood drinking activity is one of the attributes, one of the things that is described about the giants in the Book of. So there are similarities there, but the similarities go beyond this. So when Beowulf is meditating on the fate of Grendel and the doom that he's going to, you know, the eternal torment that he's going to experience, he quotes this passage that is basically just a few lines which are basically a line from the Book of Enoch paraphrased into Anglo Saxon verse. Right. Talking about. Talking about the. The eternal judgment that will fall upon this evil soul. And so it gets even a little more complicated because first of all, in the Beowulf poem, we are told that Grendel is the descendant of Cain. But one of the major themes of the poem is this Idea that the flood. This is also an idea very clearly found in the book of Enoch, for instance, the idea that the flood was sent to the world primarily to destroy the giants. Right. Everybody, the old Scandinavian, old Germanic peoples had this memory as well, this memory of the war between the gods and the giants. Right. And so the Beowulf poet is able to take this, this knowledge that as Germanic people, they have that there was this war with giants and is able to take that and combine it with his. His knowledge of the same war with giants from the scriptures. But of course, it's not explicitly spelled out in."}
{"episode_id":"SW - #280 - 2023-03-31 - Richard Rohlin - Universal History - Beowulf","start":1279.58,"end":1280.9,"speaker":"Jonathan Pageau","text":"No, it's not in Genesis."}
{"episode_id":"SW - #280 - 2023-03-31 - Richard Rohlin - Universal History - Beowulf","start":1280.9,"end":1281.26,"speaker":"Richard Rohlin","text":"It's."}
{"episode_id":"SW - #280 - 2023-03-31 - Richard Rohlin - Universal History - Beowulf","start":1281.26,"end":1283.74,"speaker":"Jonathan Pageau","text":"It's like you said, it's in the Enochian traditions and."}
{"episode_id":"SW - #280 - 2023-03-31 - Richard Rohlin - Universal History - Beowulf","start":1283.74,"end":1309.39,"speaker":"Richard Rohlin","text":"Right, yeah, yeah, you get the question. And somebody sent me this question in an email recently, and I said, well, you have to listen to the next episode. And the question was, well, if the giants were destroyed by the flood, then how is Grendel the descendant of Cain? And how is Grendel a. Like, how is he like a giant? How is he like one of the Nephilim or whatever? Like if he's, if he."}
{"episode_id":"SW - #280 - 2023-03-31 - Richard Rohlin - Universal History - Beowulf","start":1309.39,"end":1325.91,"speaker":"Jonathan Pageau","text":"But there's a harder question than that, which is why in the Bible, like, there's two places where the word Nephilim is used. One is used in Genesis and one is used in, in the. I think it's in Deuteronomy when they come up to the land of. When they come up with the two spies."}
{"episode_id":"SW - #280 - 2023-03-31 - Richard Rohlin - Universal History - Beowulf","start":1325.91,"end":1326.87,"speaker":"Richard Rohlin","text":"Right? Yes, right. Yeah."}
{"episode_id":"SW - #280 - 2023-03-31 - Richard Rohlin - Universal History - Beowulf","start":1326.87,"end":1328.19,"speaker":"Jonathan Pageau","text":"In front of, in front of Jericho."}
{"episode_id":"SW - #280 - 2023-03-31 - Richard Rohlin - Universal History - Beowulf","start":1328.19,"end":1329.23,"speaker":"Richard Rohlin","text":"Sons of Anak and."}
{"episode_id":"SW - #280 - 2023-03-31 - Richard Rohlin - Universal History - Beowulf","start":1329.23,"end":1342.71,"speaker":"Jonathan Pageau","text":"Yeah, and they, it says they are of the Nephilim. Those are the two places. So it's like the same question. The Anakim and all these other giants are said to be Nephilim. So how do you. It's the same question, like, how do you. How does this work? Why are there still giants after the flood?"}
{"episode_id":"SW - #280 - 2023-03-31 - Richard Rohlin - Universal History - Beowulf","start":1342.81,"end":1363.17,"speaker":"Richard Rohlin","text":"Why are there still giants after the flood? And then are the descendant of Cain thing. Is the descendant of Cain thing, is that mutually exclusive with the idea of being like a Nephilim or a giant? Like, you know, like the two, like the, the Sethite hypothesis versus the Nephilim hypothesis or whatever. So we actually find pretty good answers to both of these questions in the Beowulf poem. Oh, really?"}
{"episode_id":"SW - #280 - 2023-03-31 - Richard Rohlin - Universal History - Beowulf","start":1363.17,"end":1363.69,"speaker":"Jonathan Pageau","text":"Okay."}
{"episode_id":"SW - #280 - 2023-03-31 - Richard Rohlin - Universal History - Beowulf","start":1363.69,"end":1444.22,"speaker":"Richard Rohlin","text":"So first of all, first of all, we're told that all these different monsters descend from Cain. Very common, kind of a medieval theory about the origin of like fairies, elves, orcs, goblins, you know, all these things. They're all bad guys. As far as the Beowulf poet is concerned. He's a hardliner, as an old professor of mine might say, he's a hardliner when it comes to fairies. But the way that they. But the way that then that this similarity to or this descent from Cain is used in the Beowulf poem, if you start to pay attention to it, you start to realize that it's not really a question of, like, lineal, let's say, genetic descent. Right. But the way that it's used and the reason that it's important to the poem is because Cain was a kinslayer. Yeah. So in Anglo Saxon society, and like the society, let's say, of the Germanic Iron Age, to be a kinslayer is the worst possible sin. Right. In a very similar way. And I think for a very similar reason that for Dante in the Inferno, the worst possible sin. And I mean, I lead a book club through Inferno every Friday night for, like, several years now. Or not just in. Through Inferno, through the whole comedy."}
{"episode_id":"SW - #280 - 2023-03-31 - Richard Rohlin - Universal History - Beowulf","start":1444.22,"end":1444.98,"speaker":"Jonathan Pageau","text":"The comedy."}
{"episode_id":"SW - #280 - 2023-03-31 - Richard Rohlin - Universal History - Beowulf","start":1445.06,"end":1595.32,"speaker":"Richard Rohlin","text":"And we just finished Inferno a couple of weeks ago. And what we see for Dante in Inferno is that the worst possible sin is betraying your Lord, betraying your master. And what both of these things have in common is that for their respective societies, for Dantes and for the Germanic Iron Age, these relationships are the relationships through which society coheres. If you cannot trust the bonds of kinship, right, If. If you can't even trust your brother or your cousin or your uncle, right, if you. If you can't even trust the bonds of kinship, then really, how are you going to survive as a people, how are you going to survive as a civilization? This is actually one of the big questions that is raised at the end of the poem. As Beowulf is the last of the Yads, he's the last king of his people. And the woman singing his funeral dirge, one of the things she sings about is, well, now who's going to fight for us? Now who's going to, you know, defend us? And so if you don't, if you can't trust a kinship, what that does is it makes, like, things like succession and things like that really unstable and really uncertain. Then society, human society, simply ceases to cohere. So for this society, that. And then ungenerosity being ungenerous, you know, hoarding, in other words, like a dragon. This is why the dragon is. Dragons don't always hoard gold. They hoard gold in Anglo Saxon, in Germanic society, because gold is the thing that you need to you give to your Retainers, right? A king gives gold to his thanes and his thanes give service to him in return. And it sounds the same as saying, I'm paying you for a service. But they didn't think of it that way. And actually they thought about it very differently than that. Right? It was always the idea that, you know, the king is, in the Anglo Saxon literate language, he's the ring giver. He's the one that breaks off the gold rings from his chain and gives it. And the idea is he's supposed to be giving it with an open hand, and if he doesn't, he starts hoarding the gold, then society starts to collapse. So these are kind of the two worst things. And these are basically the two kinds of evil that we see exemplified by the giants or by the monsters, right? We've got the giants or the trolls or whatever you want to call Grendela's mother, who exemplify this kinslaying, right? And also the. The kinslaying and the idea of the blood feud, which was just tearing through Germanic societies at this time. And then with the dragon, you have the idea of hoarding, right? The hoarding that eventually."}
{"episode_id":"SW - #280 - 2023-03-31 - Richard Rohlin - Universal History - Beowulf","start":1595.32,"end":1605.16,"speaker":"Jonathan Pageau","text":"So in Grendel, how are they. You mean in the sense that they're cannibals? Is that what you mean by their kinslayers? Like, do they. When you say kin, do you mean that they're killing humans, like, in that way?"}
{"episode_id":"SW - #280 - 2023-03-31 - Richard Rohlin - Universal History - Beowulf","start":1605.48,"end":1745.19,"speaker":"Richard Rohlin","text":"So they are called the kin of Cain. And then they're compared to, and sometimes explicitly, sometimes in a subtle way, to other famous kinslayers in the story. So there are a number of human kinslayings and also, you know, men betraying their masters and things like this in the background. That. So that when we read those stories and when we see these things happening, sometimes it's foreshadowing. Hrothgar is the king of the Danes. His hall is eventually going to be destroyed by a civil war, which is a thing that really happened. And people reading the poem knew it had happened, but this poem is set before it happens. And so there's like all this ominous foreshadowing. Later on, there's this awful, you know, war that involves kinslaying and betrayals of alliances and all these other things with the Swedes and the. And the yachts and all these different people. So the point is that, you know, C.S. lewis, when he talks about fairy tales, he says that they wear their insides on their outsides, right? And so Grendel and his mother are, in a way, they're they're manifesting, they're making. They're bringing to the surface the kinslaying, the blood feud and everything else that's really the big evil or represents one of the great evils that has to be dealt with in Germanic society. And so when we look at this, the other question is, well, how are there more. So to answer the question, how is there still a line of Cain after the Flood? Right. Well, it's very simple. The way that you become, you know, from the line of Cain, the way that you become a monster is by doing what Cain did. Yeah. Like him. Right. Be, you know, becoming a monster. Right. The way that you become like, demons is to participate in their works. And it's really interesting because there's other Germanic literature, for instance, old Norse sagas, in which you literally have people actually become a monster in a, like, very literal, transformative sense. Yeah. By, you know, for instance, this one guy abandons his comrades because they're being attacked, and so he just takes all the treasure and he jumps overboard and they never see him again. But there's this big sea serpent, like a dragon like that haunts that bay from that point forward. So it's like, well, that's. That's him. The guy. Yeah, yeah, yeah. So that kind of a thing."}
{"episode_id":"SW - #280 - 2023-03-31 - Richard Rohlin - Universal History - Beowulf","start":1745.99,"end":1827.37,"speaker":"Jonathan Pageau","text":"As far as what's interesting about. About this, like. And I've been. Because I've been pondering that I knew that some of these traditions, like I know the Beowpoam well enough, not in any way close to you, but because I was always interested about the way in which. Because Cain is both. Is a kinslayer, but he's also a civilizational figure. Like, he brings civilization. And so there's a. There's an interesting. There's a weirdness about Cain and there's also a weirdness about giants themselves, which is that there's a duality to the giants. One is the giant as an image of the. Of the civilization, the tyrannical civilization, or the. The. This. This kind of oppression from above. You know, the demons kind of come and rape women or, Or. Or impose their order. But then there's also the degenerate aspect of the descendants of Cain, which is the hybridity, monstrosity, chaos, cannibalism, you know, broken causality. You know, in some ways, it does represent. In general, when I talk about how the modern world is, that is like a separation of heaven and Earth. So the extremes manifest together. But this kind of extreme of tyranny and the extreme of chaos and broken Reality happen together. But in the Grendel poem, there isn't a sense that the giants represent an old civilization or that they represent, you know, a civilization that was there before us or something like that."}
{"episode_id":"SW - #280 - 2023-03-31 - Richard Rohlin - Universal History - Beowulf","start":1827.53,"end":1829.05,"speaker":"Richard Rohlin","text":"I mean, that's definitely there."}
{"episode_id":"SW - #280 - 2023-03-31 - Richard Rohlin - Universal History - Beowulf","start":1829.13,"end":1830.25,"speaker":"Jonathan Pageau","text":"It is there. Okay."}
{"episode_id":"SW - #280 - 2023-03-31 - Richard Rohlin - Universal History - Beowulf","start":1832.57,"end":1908.8,"speaker":"Richard Rohlin","text":"When Beowulf goes into hell. Actually maybe talk about that in a moment. But when he goes down into the. The. The lair, right? The underwater lair of Grendel's mother, the troll wife of Grendel's mother, he finds in there, he finds this sword. And the sword was forged by the giants, okay. And it was like this. It's like this huge sword. It's better than any sword that Beowulf has. One of the. One of the sort of tropes of the Bear Son tale is that the weapons always, like, his weapons break because he's too strong. And Beowulf, throughout the story, just constantly breaks swords. It's like three or four times, but it's bigger than any sword that he's ever held. But what's really interesting is that actually sort of inscribed on the sword is the actual legend of the giants in their war with God from the Book of Enoch. So it's the idea that this is a technological marvel, a technological wonderful, which is actually a result of giantish civilization. But that's what actually allows Beowulf to kill Grendel's mother, is when he uses that sword which himself had made. He uses it to cut off her head, whereas his own sword hadn't been up to the task."}
{"episode_id":"SW - #280 - 2023-03-31 - Richard Rohlin - Universal History - Beowulf","start":1909.12,"end":1959.64,"speaker":"Jonathan Pageau","text":"Yeah, I mean, that's interesting also, because. It's interesting because if you think of the whole problem that I always talk about, this problem, like the idea of how death. How death fights death, and how death kind of stands at that limit. And to understand Noah as also a civilizational figure, right? Noah builds the ark. And so it's like if. If Techne comes through Cain's descendants, Noah appears as this strange figure that seems to be able to bridge Cain and Seth because he takes Techne and he uses it to survive the. The flood. And often it's. There's all these weird ways in legends that you find that they try to bridge it. You know, they'll say that he married Naama Tubal, Cain's sister. Like, there are ways to try to show that Noah bridges the two sides in some ways, and he has to in order to survive. But it's interesting to think that he uses the giant sword to kill Grendel's mother."}
{"episode_id":"SW - #280 - 2023-03-31 - Richard Rohlin - Universal History - Beowulf","start":1959.88,"end":1975.82,"speaker":"Richard Rohlin","text":"Yeah, yeah. So that's what he uses. And Then of course, like, her blood eats away at the blade. So there's nothing but the hilt left. Yeah. When he. When he comes back up to the surface, there are a lot of other interesting similarities that go deeper on the connection between Grendel and his mother and the giants of the Old Testament."}
{"episode_id":"SW - #280 - 2023-03-31 - Richard Rohlin - Universal History - Beowulf","start":1977.41,"end":1988.21,"speaker":"Jonathan Pageau","text":"Maybe one question. When you say on the sword, it says that it is the story of the giants revolt against God, as in the Book of Enoch. How close is it to the Book of Enoch?"}
{"episode_id":"SW - #280 - 2023-03-31 - Richard Rohlin - Universal History - Beowulf","start":1989.89,"end":1991.13,"speaker":"Richard Rohlin","text":"So glad you asked, Jonathan."}
{"episode_id":"SW - #280 - 2023-03-31 - Richard Rohlin - Universal History - Beowulf","start":1991.13,"end":1993.89,"speaker":"Jonathan Pageau","text":"I'm so glad you asked because I can reach out and grab this book."}
{"episode_id":"SW - #280 - 2023-03-31 - Richard Rohlin - Universal History - Beowulf","start":1994.29,"end":2100.8,"speaker":"Richard Rohlin","text":"So actually this is my own translation of Beowulf. Oh, wow. I wrote this out by hand along with the. It's actually the. See if I can show you here. I mean, this is how fanatic I am about studying this. Like, basically, it's like. It's like an interlinear thing. But then I have, like, notes about facing page because there's like, two different passages. I should have had these ready to go. But in one of them, Hrothgar kind of like contemplates. He's looking at it way after the fight and he kind of like looks at it and contemplates the blade. Yeah. So it says so on that sword. Was the origin written or engraved of ancient strife? When the flood slew, when the flood of sloth, when the flood destroyed with the rush of the ocean, the race of the giants, they fared terribly. That was an estranged race. That race was estranged to the eternal Lord. That was their final reward. When the waters surge, the ruler gave. So like the ruler of heaven, that is, God gave them their final reward with the surge of the waves. And there's some references to it elsewhere in the poem. I don't want to spend the whole day just playing around through this, but, I mean, I do, but not on camera. But the point of this is that the Beowulf poet very clearly understands the flood as being mainly God's judgment against the race of the giants, which is a very common ancient Christian understanding. Pretty much everybody, regardless of whether or not you believe in a Sethite hypothesis."}
{"episode_id":"SW - #280 - 2023-03-31 - Richard Rohlin - Universal History - Beowulf","start":2100.96,"end":2104,"speaker":"Jonathan Pageau","text":"Yeah, you don't totally need the Book of Enoch to have that."}
{"episode_id":"SW - #280 - 2023-03-31 - Richard Rohlin - Universal History - Beowulf","start":2104.08,"end":2155.32,"speaker":"Richard Rohlin","text":"Yeah, you don't totally need the Book of Enoch to have this to kind of show out, like, draw out a couple of other similarities. Though I think the really strong linking. There are a couple of strong links to the Book of Enoch from the Beowulf poem. Either proof of a direct link or maybe, as I'm going to talk about in a moment, this May be like a case of vernacular apocryphal literature, which the Beowulf poet had access to. That doesn't survive, but the Beowulf poem does. There's some other examples of this I'll talk about in a sec. So there's a couple of things. There's the name of Grendel himself. So the grend is a pretty easy thing to explain. It's a perfectly good Germanic onomatopoeia. Sounds like grind. Not hard to understand. The L at the end of Grendel's name."}
{"episode_id":"SW - #280 - 2023-03-31 - Richard Rohlin - Universal History - Beowulf","start":2155.4,"end":2159.48,"speaker":"Jonathan Pageau","text":"Oh, right, that. It's Michael. It's Gabriel Grendel."}
{"episode_id":"SW - #280 - 2023-03-31 - Richard Rohlin - Universal History - Beowulf","start":2159.56,"end":2191.99,"speaker":"Richard Rohlin","text":"Yeah. It's not just them. I mean, like, you've got every. Pretty much every single one of the. The, the. The. The leaders of the fallen angels who mate with mortal men in the Book of Enoch. They're all like Tamiel and Ramiel and Daniel and Ezekiel and Barakiel and, you know, all those different. Yeah. So, I mean, that's. That is a difficult. There's no way to prove that association without, like, a bit of linking, like a missing link that doesn't exist for us. But it's not a normal Anglo Saxon ending for a name. It doesn't."}
{"episode_id":"SW - #280 - 2023-03-31 - Richard Rohlin - Universal History - Beowulf","start":2191.99,"end":2216.59,"speaker":"Jonathan Pageau","text":"And in some ways, without. Without the. Without the notion of the Book of Enoch, where the names of the fallen angels follow the structure of the biblical names for the angels, it's like there's a bit of a. There's a bit of a missing gap where you would be hard to jump from naming your fallen angel with an L and understanding that this is related to the archangels or the different names of angels in the. In the Bible."}
{"episode_id":"SW - #280 - 2023-03-31 - Richard Rohlin - Universal History - Beowulf","start":2216.91,"end":2329.53,"speaker":"Richard Rohlin","text":"So this is a. This is a connection which it would be difficult to absolutely prove. Yeah. But I think my intuition is that there's something here. But the even stronger association is probably Grendel's mother. Right. So if Grendel is associated with the Old Testament giants, we would sort of maybe reasonably expect that his mother is going to be associated with, like, the daughters of men. Right. What's really interesting is that in the. The Greek translation of the Book of Enoch, we are told that the daughters of men who interbreed in this way are turned into sirens. Right. Well, a siren, as it was certainly understood by people in the Anglo Saxon world, is a water monster, a solitary monster, who. This is probably related to the Hebrew word that's associated with Lilith. You know, that's. King James translates it like a screech owl. It's that kind of a word. But in the sort of understanding you know, of, you know, let's say medieval England by the time, by Anglo Saxon time, this. The idea of the siren was this sort of cannibalistic, solitary female water monster. Siren is. Yeah. And you find this, like, for instance, you know, some of the Church fathers reference sirens in this, in the same kind of a context. Right. So there's some support to this in the Beowulf home. Because in the Beowulf home, she's referred to as a mere wif, like a mere wife, literally a sea maiden or sea woman. Right. Which is exactly how you would try to express the idea of a siren in Anglo Saxon. And so there is a. Yeah, for sure."}
{"episode_id":"SW - #280 - 2023-03-31 - Richard Rohlin - Universal History - Beowulf","start":2329.53,"end":2332.53,"speaker":"Jonathan Pageau","text":"All her imagery is related to water. He has to go down into the water."}
{"episode_id":"SW - #280 - 2023-03-31 - Richard Rohlin - Universal History - Beowulf","start":2332.53,"end":2427.86,"speaker":"Richard Rohlin","text":"And so you can, you can like, you can kind of keep teasing this threat and chasing the threat. And maybe we'll look at this more in the class. Yeah, but there is a very strange. There's a very strange passage that refers to, you know, the Danes get really desperate, they can't fight Grendel, they can't get rid of him, they pray to God, nothing seems to be happening. And so they revert to demonic sacrifice, they start sacrificing to the demons, they fall back into idolatry, which is a very interesting thing because, of course, the Beowulf poet knows perfectly well that this is happening in pre Christian times. Christianity hasn't come to the north when this homosexual Hrothgar is a historical person we know pretty much. Right. Where he lived, where he lived, all that kind of stuff. And of course, the Beowulf poet knew that as well. So to set the events in his court, right, that's, you know, that's kind of nailing down a date to when this story is supposed to be happening. And it's before, way before any of the Germanic people started to convert to Christianity. But what's really interesting is that the, the Beowulf poet wants to present them as kind of virtuous pagans. Right, in this, in this way that there's not going to be room for in Western Christian theology later on. But maybe at this early point, there is this idea that there were sort of virtuous, you could say, like monotheistic pagans who were, you know, they're before the time of Christ, but they're still worshiping God. You know, they're trying to, you know, trying to seek God, trying to worship him in the best way that they know how. Yeah, right."}
{"episode_id":"SW - #280 - 2023-03-31 - Richard Rohlin - Universal History - Beowulf","start":2427.94,"end":2432.62,"speaker":"Jonathan Pageau","text":"I mean, you see images of that in the early Christian apologists, Right. That's how they talk about it, right?"}
{"episode_id":"SW - #280 - 2023-03-31 - Richard Rohlin - Universal History - Beowulf","start":2432.62,"end":2448.52,"speaker":"Richard Rohlin","text":"Yes. I mean, yeah, this is, this is a pretty. It's a pretty common Christian idea. And this is how the Beowulf poet tries to portray Hrothgar and the Danes, except that as a result of this, they fell back into idol worship and sacrifice to demons."}
{"episode_id":"SW - #280 - 2023-03-31 - Richard Rohlin - Universal History - Beowulf","start":2448.52,"end":2450.52,"speaker":"Jonathan Pageau","text":"Because they can't beat Grendel, basically."}
{"episode_id":"SW - #280 - 2023-03-31 - Richard Rohlin - Universal History - Beowulf","start":2450.52,"end":2473.14,"speaker":"Richard Rohlin","text":"Yeah, because they can't beat Grendel. And the interesting thing is that in the Book of Enoch, this transformation of women into sirens is immediately followed by a prophecy that giants would somehow lead men or cause men to start sacrificing to demons in this way. So this same kind of a pattern that unfolds in. In Beowulf is, Is established there in the Book of Enoch, but it's not explained how. It's."}
{"episode_id":"SW - #280 - 2023-03-31 - Richard Rohlin - Universal History - Beowulf","start":2473.14,"end":2486.02,"speaker":"Jonathan Pageau","text":"You know, I have a question, like when. Before they fall to demon worship, you know, it's a prey to God and nothing doesn't work. What is the term they're using for God in this case? Like, what is the. What. What. What do they. What's God to them?"}
{"episode_id":"SW - #280 - 2023-03-31 - Richard Rohlin - Universal History - Beowulf","start":2486.02,"end":2512.08,"speaker":"Richard Rohlin","text":"There's a really robust vocabulary that's used to refer to God in Anglo Saxon literature. Typically speaking, he's usually called like the Lord, the eternal Lord, the Lord Almighty, Almighty God. Yeah, there's. There's, like, there's like, this is pretty robust vocabulary, but. But it's, it's very, you know, it's. You can look at those."}
{"episode_id":"SW - #280 - 2023-03-31 - Richard Rohlin - Universal History - Beowulf","start":2512.08,"end":2514.24,"speaker":"Jonathan Pageau","text":"He's using church words basically in the."}
{"episode_id":"SW - #280 - 2023-03-31 - Richard Rohlin - Universal History - Beowulf","start":2514.88,"end":2533.64,"speaker":"Richard Rohlin","text":"It's unambiguously the God of the, of the scriptures and of like, like the Old Testament scriptures in particular. They like, they like using Old Testament terminology to refer to God even when they're talking about Christ, especially like Lord of hosts, Lord of armies. Right. That kind of stuff. Very unambiguously Christian language."}
{"episode_id":"SW - #280 - 2023-03-31 - Richard Rohlin - Universal History - Beowulf","start":2533.64,"end":2534.12,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #280 - 2023-03-31 - Richard Rohlin - Universal History - Beowulf","start":2535.08,"end":2901.28,"speaker":"Richard Rohlin","text":"So there are some, some ties here. Now, there are some other examples of apocryphal literature coming up in the Beowulf poem. The other one that I'll just kind of talk about real quick and maybe tease a little bit, comes up in. Comes up in the depiction, the description of Hel, or really the lair of the. Of the. Of the mere wife, the lair of the she troll of Grendel's mother. And it's very famously, there's this description of hell. It's really graphic, it's really scary. It's really, it's really, you know, dark, really beautifully written out in alliterative verse in the Beowulf poem. And people have noticed for a long time, they've noticed that this description of hell is almost the same or identical to the one that's given in one of the blickling homilies. So I talked last time about the idea of homilary, right. That most priests in medieval Europe were not expected to be great homilist or great preachers themselves. I sometimes think it'd be maybe good to go back to this model, like, take a little pressure off of. Of the priests, you know, and this will sound weird to Protestants who are listening to this because, like, your pastor's main job is to prep a sermon. But actually that wasn't the main job of the priest. The main job of the priest was to say the mass and comfort the sick and the dying. And, you know, he had, you know, preside over baptisms and weddings. He had a lot of sacramental duties. And so for him, the, you know, being a great preacher was not the main thing you were looking for in a pastor. And many of these men didn't have a very high level of education. And so the way that they handled this was that they had. There were what were called homilaries. And homily was basically a collection of homilies structured usually around the church year. So it'd be like a homily for every Sunday that you'll have to preach this year, and then also a homily for like, major feast days when people would be coming to church and you'd want them to hear a good sermon. And in one of the blickling homilies, there are a bunch of beautiful ones I'd love to mention. I probably mentioned it before, but it bears mentioning again. For instance, one of the blickling homilies refers to the Mother of God as God's own Arkenstone, which, if you've read the Hobbit, the Arkenstone, right, is this precious stone at the center of the mountain. But in Earkerkenstan, in Old English, means it can mean a pearl. It's very often used to translate Latin, Margarita, you know, pearl. And then it's also sometimes used to. It's also sometimes used to refer to religious relics, right? So the idea of the Mother of God as like a pearl, you can understand, but also the idea of her as like a reliquary, right? God's own reliquary, right, which. Which, you know, so, like, it's easy to understand that. Pretty beautiful, but it's a beautiful connection to the Hobbit. So anyway, so, yeah, so, but in one of these homilies, blickling Homily number 16, you get this description of hell. I'll read it real quick because it's not very long. Well, I mean, the poet. The homily is kind of long, but I'll just read the end. Yeah. But now let us bid the high angel St. Michael. So this is a. It's a homily for Mickleness for St. Michael's Day. Now let's bid the high angel St. Michael and the nine orders of the holy angels that they may be an aid for us against hell foes. Hellfo, by the way, very common term that's used throughout the poem for Grendel and his mother. They were the holy ones for the taking of the souls of men. So St. Paul was looking in the northern region of the world. So this is now referring to an apocryphal work known as the Visio Pauli, the vision of St. Paul, or the apocalypse of St. Paul. So St. Paul was looking at the northern region of this world where all the waters dropped down. And there he saw over that water a certain hoar stone. Remember that? They put the. They put the Germanic people, put Hel. In the north, in the extreme north, for obvious reasons, over that water, a certain horse stone. And north of that stone, very frosty woods had grown and there were dark mists. And under that stone was the dwelling place of Nicors and Weregs. Nightkor is a kind of a sea monster, and Beowulf fights like a bunch of Nicors. In the Beowulf poem, I said there were three monsters. There's really like three big monsters and just a bunch of little ones. And he saw that on the cliff hung on the icy trees, many black souls bound by their hands and their enemies in the likeness of night course, were grasping at them just like the greedy wolf. And that water was black down under the cliff. And between the cliff and the water was about 12 miles. And when the branches broke, then those souls that had been hanging on those branches fell, and the Nikors seized them. These then were those souls who had unjustly sinned here in the world and did not wish to stop before their life's end. But now let us bid St. Michael eagerly that he lead our souls into joy, where they might rejoice always without end in eternity. So what's being referred to here is that in the Visio Pauli, at least in this particular version of it, there's actually a few different versions of it circulating. And ultimately it's connected to the life of Adam and Eve and all this other literature. But in The Visio Pauli, St. Michael the Archangel is the one who is leading St. Paul through the afterlife. Right? And it's actually. I mean, this is a prototext for the Divine Comedy. There's no Divine Comedy without this kind of literature. The Archangel Michael is leading Paul through and showing him hell and showing him the tortures that await the wicked. And you'll notice it's not fire here, it's being frozen and falling, you know, and frosty icy cliffs and being eaten by water monsters and all these different things, right? This is a very distinctly kind of Northern Germanic vision of hell. So what's really interesting about this is that in this and in a couple of other places, the Beowulf poet will reference this homily or reference other things about St. Michael the Archangel, and never explicitly, because of course. Because of course, the. The people he's writing about, the Danes at this point, they're not Christian, so they don't know anything about Archangel Michael. And the Beowulf poet is pretty careful about not allowing his characters to know things that they wouldn't know if, without."}
{"episode_id":"SW - #280 - 2023-03-31 - Richard Rohlin - Universal History - Beowulf","start":2901.76,"end":2903.04,"speaker":"Jonathan Pageau","text":"The revelation, let's say."}
{"episode_id":"SW - #280 - 2023-03-31 - Richard Rohlin - Universal History - Beowulf","start":2903.04,"end":3082.14,"speaker":"Richard Rohlin","text":"Yeah, right. And so he's like, very careful about this, even like, very mundane things. Right. He's very careful about the flow of information. He's, I mean, really artistic, really, really good storyteller. But. So this is the thing. There are these little Archangel Michael references throughout the poem, but. But he never can mention him specifically. And so for a long time, people thought, just thought, oh, well, he's doing this thing here where he's referring vision of hell from a homily he had heard, and now he's putting it into his poem. Well, maybe that's what happened. But actually the more recent evidence, for reasons I won't go into right now, they have to do with textual findings and things like this. Is that actually probably both the blickling homily and the Beowulf poem are referencing the same vernacular translation of the visio poly. So there was an Anglo Saxon translation in the vernacular that they were both borrowing from. And later on, it's lost. And so all we have is these borrowings, but we don't have the vernacular version itself. But you can go on and look at the. The connections that are being drawn. And there's a really brilliant essay that basically posits, without, you know, just reading the whole essay to you here, there's a recent essay that's come out really beautiful that basically suggests that the reason that the Beowulf poet is use is making all of These subtle Archangel Michael references in the poem, which his audience would certainly have understood. So at the same time that he's making these references to the Archangel Michael, he is also making references to the dragon slaying of Fafnir, which is like the great prototypical quote, Germanic dragon slaying story. Okay. So he's consciously drawing this connection between the great Christian dragon slayer, which is of course St. Michael, or at least he's one of them, and then the great pagan dragon slayer. Right. Which varies a little bit depending on the vision of the story, Sigurd or Siegfried, depending on how old the story is. But point is, point is that he's drawing these connections between a great Christian dragon slaying story or serpent defeating story and then the great pagan serpent defeating story. And he's drawing connections in the minds of his audience to Beowulf, to his main character, to his protagonist, who is not quite a pagan. Yeah. But also not quite a Christian. And he gets the end of his life. Beowulf has this sort of speech where he's at the very end of his life, he's been fights the dragon. Spoilers. Kills it with some help, but is poisoned and is about to die. So as he's, as he's dying, he kind of. He's talking to Wiglaf, his. His young kinsman, and he's kind of going over, you know, his life and talking about the things that he did, the wars that he's fought, the monsters he's killed, the way that he's ruled his people into his old age, all these different things. And he's kind of like contemplating basically whether or not he's going to make the cut."}
{"episode_id":"SW - #280 - 2023-03-31 - Richard Rohlin - Universal History - Beowulf","start":3082.78,"end":3083.1,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #280 - 2023-03-31 - Richard Rohlin - Universal History - Beowulf","start":3083.1,"end":3123.73,"speaker":"Richard Rohlin","text":"He's got no certainty of salvation, you know, through the sacraments or through Christ or through the confession of his sins. But what he is, I never fought against my kin. I never betrayed any of my loyalties. I never. Right. You know, I was never stingy with my thanes. Right. All these things that we talked about that are like, these are the worst possible sins in this context. This is the work of Cain, Beowulf, who is, you know, sometimes this sort of monstrous or ambiguous figure, especially early on in his life, comes to the end of it and says he rejected all of those things. And so because of this, the King of Heaven will have no need to. To punish him. Right. So that's."}
{"episode_id":"SW - #280 - 2023-03-31 - Richard Rohlin - Universal History - Beowulf","start":3123.73,"end":3125.09,"speaker":"Jonathan Pageau","text":"It says the King of Heaven."}
{"episode_id":"SW - #280 - 2023-03-31 - Richard Rohlin - Universal History - Beowulf","start":3125.57,"end":3139.01,"speaker":"Richard Rohlin","text":"It's the King of Heaven or Lord of Heaven. I mean. Yeah, something like that. Yeah. Like I said, there's. There's a Lot of. But I mean, it's. It's very clearly, you know, for both the poet and the. For both the poet and also for the audience."}
{"episode_id":"SW - #280 - 2023-03-31 - Richard Rohlin - Universal History - Beowulf","start":3139.25,"end":3141.01,"speaker":"Jonathan Pageau","text":"Yeah, they know who they're referring to."}
{"episode_id":"SW - #280 - 2023-03-31 - Richard Rohlin - Universal History - Beowulf","start":3141.01,"end":3143.89,"speaker":"Richard Rohlin","text":"Yeah, it's very clearly. That's probably. Yeah."}
{"episode_id":"SW - #280 - 2023-03-31 - Richard Rohlin - Universal History - Beowulf","start":3143.89,"end":3174.45,"speaker":"Jonathan Pageau","text":"And it's an interesting. It's an interesting. Like, if you understand it subtly like this. This. This subtle poem where people could both, let's say, nostalgically participate in the ancient stories, but then also have a kind of a grip of sadness to see. Like, he's not. Like, he's. He's on the. And because of the lack. His lack of. Because he's not a Christian, it's like, what does it mean? You know, how. What. How do. How can we understand this? Like, there's a. There's a kind of a deep. A very. A very deep sentiment there that's happening."}
{"episode_id":"SW - #280 - 2023-03-31 - Richard Rohlin - Universal History - Beowulf","start":3175.09,"end":3360.25,"speaker":"Richard Rohlin","text":"So this is what's so interesting and complex and beautiful to me about the Beowulf poem. And I think why I'm so deeply attracted to it is because the Beowulf poet is. I mean, the story that he tells is very sensitive. It's very. It handles this question of, like, our righteous pagan ancestors and all these different things. Right? Handles it all with a great deal of delicacy. It seems like sometimes maybe he's trying to make a. Like to censure or condemn certain aspects of. Of, like the old Germanic paganism, Right. The. The blood feud and the were guild and all this different stuff. But he's. He never comes out as far as, like, totally condemning it to. And to this day, you know, students read the. The poem. Like, if they really read the poems, half of them will come away thinking this is a celebration of these old heroic ideals, and the other half will come away thinking that he. Oh, no, he's condemning these things. Actually, he's not really doing either. He is maybe kind of pointing out some of the problems, but also it's clear that he's passed the test of love, that he loves the thing that he's writing about and he loves the kind of story that he's telling. And so he never comes out quite as, like, condemning the old ideal of northern courage, but maybe also ultimately says, but this isn't really. It's not enough. You've got to move on from this now. So it's a really beautiful poem. And I think, like I said, I've given just a few examples here. There's a lot more. And if some of the stuff is murky, I apologize to the audience. Some of the stuff is like, well, if you gave me two hours where I could give you 20 pages to read, then I could get you all the way there. But hopefully this will be enough to tease connections for people and they can start to see a way in which a lot of the stuff I'm saying is only groundbreaking in that in the past, when people have read the Beowulf poem, they come across things like a plurality of divine beings, which you find at the beginning of the poem mentioned in the same breath as kind of this idea of a monotheistic biblical God. They'll come across stuff like that and say, well, Christianity doesn't have anything like this in it because they're thinking in terms of modern Christianity or maybe sometimes like really late medieval Catholic, Roman Catholicism, Christianity. And so this Christianity doesn't have this terminology and it doesn't have this vocabulary. It doesn't have these ways of thinking about the world. So this has to be paganism that's still, like, lurking somewhere in the poem. And if you believe that, then basically the poet doesn't know what he's doing, because then it's just like a really bad stitch job. And my argument is that that's not the case, that the poet is actually a supremely careful and gifted poet. He's striking this really delicate balance between paganism and Christianity, this apocryphal literature, the Old Testament scriptures, all those things come together beautifully in this poem. So if that sounds like your thing and you'd like to know more about it, and specifically to hear the reading available from this particular perspective, which there's scholarship out there, but as far as, like, in a classroom setting, you're not going to get that pretty much anywhere. Sign up for our class."}
{"episode_id":"SW - #280 - 2023-03-31 - Richard Rohlin - Universal History - Beowulf","start":3360.81,"end":3409.23,"speaker":"Jonathan Pageau","text":"Yeah, definitely. I mean, I definitely. I want to be. For sure. I want us to do it together if we can, because I find it very exciting. You know, I read Beowulf a long time ago, and I remember exactly the problems that you're saying, which is, you know, because you can't. It was hard. And you read it in your 20s, you always start to read it with a commentary because it's so difficult. And so you end up with that perception, which is that this is. But I remember when the very first time I read it and I read this idea of description of. Of Cain and the giants and the flood and thinking, you know what? I think this guy, he knew what he was doing. And so it's like, as we kind of understand more and more. More, you know, the. The mythological language of Christianity and we're kind of rediscovering it. I think that, that, that it's going to be clearer and clearer. So thanks. Thanks, Richard. Thanks for doing the work, man. It's just so amazing to have."}
{"episode_id":"SW - #280 - 2023-03-31 - Richard Rohlin - Universal History - Beowulf","start":3409.23,"end":3444.54,"speaker":"Richard Rohlin","text":"Thanks for having me. I. Like I said, I, I sometimes I come to the end of these things. I'm like, man, that was kind of muddled. And I hope people, you know, are able to kind of piece that all together because, you know, I've. I mean, I. Literally, this whole shelf right here to my right is about half just either commentaries on Beowulf or translations of it or like, different versions of the original text. Like, I just, you know, for years and years, I've just collected the scholarship on the poem and deeply interested in it, and sometimes my, My brain gets ahead of my mouth and, you know, I don't say everything I intended to say. But hopefully this is a good introduction to the poem and people will check out the class, so."}
{"episode_id":"SW - #280 - 2023-03-31 - Richard Rohlin - Universal History - Beowulf","start":3444.54,"end":3450.66,"speaker":"Jonathan Pageau","text":"Yeah, definitely. So everybody pay attention. And. And of course, our discussion with Richard will continue. So thanks, Richard."}
{"episode_id":"SW - #280 - 2023-03-31 - Richard Rohlin - Universal History - Beowulf","start":3450.74,"end":3451.63,"speaker":"Richard Rohlin","text":"All right, thanks, Jonathan."}
{"episode_id":"SW - #280 - 2023-03-31 - Richard Rohlin - Universal History - Beowulf","start":3453.54,"end":3506.99,"speaker":"Jonathan Pageau","text":"This episode is part of a series of discussions I've had with Richard Rowland on Universal History. You can find a list of all these episodes on my YouTube channel, or you can find them also in my podcast stream from the Symbolic World on your different podcast platforms. Make sure to check out Richard's second podcast, which he hosts in collaboration with Father Andrew Damick, called Amon Sewell, which looks at the relationship between Tolkien and orthodoxy. This podcast has also inspired in me some ideas for creating some images, whether it be the King under the mountain, whether it be the Grail or beautiful Ethiopian traditions. I've created some products which you can find on my store, the Symbolicworld Store, and there will probably be more of those to come very soon, so stay tuned. This conversation is ongoing and there is still very much to explore in the Universal History."}
