{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":0.32,"end":49.64,"speaker":"Bernardo Kastrup","text":"That microcosm. What played in the microcosm of Nietzsche is what is playing the macrocosm of humanity 150 years later. I just hope we don't go mad when we realize that we are failing to pull transcendence downwards and try to make it palpable. It's not in the nature of the thing to be that it is us who have to transcend ourselves. It doesn't make sense to pull transcendence into us. It's like pulling the word the world into the prison. No, it's not going to happen. You cannot pull the world into your prison cell. All you can do is break out. It's not going to work the other way around. It didn't work for Nietzsche. It's not going to work for."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":61.86,"end":65.38,"speaker":"Jonathan Pageau","text":"This is Jonathan Peugeot. Welcome to the Symbolic World."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":75.78,"end":123.55,"speaker":"Mark","text":"Hi. Welcome to Art Christ. Today I'm joined once again by two gentlemen I most like and admire, Jonathan Pageau and Dr. Bernardo Castrup. Jonathan is a French Canadian icon carver, a public speaker and a YouTuber, exploring the symbolic patterns that underlie our experience of the world, how these patterns emerge and come together, manifest in religion, art and popular culture. He's also the editor of the Orthodox Arts Journal and host of the Symbolic World blog and podcast. Bernardo, then, is the executive Director of Essentia Foundation. His work has been leading the modern Renaissance of metaphysical idealism, the notion that reality is essentially mental. He's a PhD in philosophy and another PhD in computer engineering. So then, just to begin, gentlemen, do you have any, I suppose, preliminary questions or statements about each other's work that you'd like to ask or to share then?"}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":123.79,"end":202.12,"speaker":"Jonathan Pageau","text":"Well, I haven't read Bernardo's books, but I have had a chance to listen to many of his lectures and listen to many of his discussions, because when I'm carving, that's the perfect medium for me. And so I think that I, first of all, I really appreciate this, let's say, not just what Bernardo is doing, but just this moment. I would say this return to understanding the importance of mind and the importance of consciousness in the way we experience the world and the way that the world kind of lays itself out. I think that there's a lot of points of contact with what I'm doing. I think that I definitely come to it from a specifically religious point of view. And so it's on that particular point that I would have questions for Bernardo. I heard him talk about, let's say, the manner in which the primary mind or the, you know, the divine mind. I don't know. He probably doesn't use the word divine mind, like the primary mind, of how it develops into multiple minds as a form of dissociation. And so I would have some questions on that, how he sees that in relation, for example, to the Christian notion that there's rather a giving, that this kind of giving and then there's a notion of love which binds the minds together and binds them towards the primary mind. And so that's actually my biggest question is related to that. But I'm sure we could have many, many things to talk about."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":202.46,"end":267.59,"speaker":"Bernardo Kastrup","text":"Yeah, I think the importance of symbolism and iconography is vastly underestimated in our society today. So from that perspective, I love Jonathan's work. I have a room in my house. It's not the one I'm in right now, but I have a room in my house filled with orthodox Christian iconography. I'm not an orthodox Christian. I don't consider myself a person aligned with any particular religious tradition. Maybe because of my education, my origins, and my father was very scientifically oriented, secular. But over the course of my life, I've grown to appreciate the depth and the subtlety and nuance of symbolism and religious iconography. And today I deliberately make it a part of my life, a discrete, small part of my life, but an important one nonetheless. So from that perspective, I appreciate very much what Jonathan has been doing all these years."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":267.83,"end":294.25,"speaker":"Mark","text":"And there's so many different things that I'm interested in talking about with you guys and points of convergence, but I don't want to lead the competition too much, so I actually have less notes, well, less concentrated notes than I usually do, a little more, probably, overall. So I'm just wondering, is there any particular direction that you would like to go in? Jonathan? I suppose, since you mentioned you had a few points that you wanted to clarify, I suppose, with Bernardo."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":294.25,"end":363.17,"speaker":"Jonathan Pageau","text":"Well, I think that the question that I mentioned is really my big question for Bernardo. I think what I tend to notice in his system is that the divisions of mind is something like, I wouldn't say an accident, or maybe that there seems to be something that is not particularly positive about the division of mind. Maybe that's the best way to phrase it. And so that's what I would like for him to talk about a little. Because, I mean, an example I can give is that if a human experiences dissociation, we would want to heal that dissociation. It seems like we would want to resorb these opposing personalities or opposing aspects into at least a centralized consciousness that can encompass both of them. And so if that Is the main image that he uses for the manifestations of multiple minds. Does that mean that existence itself, the way we experience it, is something of a scandal, like the Gnostics tended to display it? Or is there something more that's possible in that model? So that's my biggest question."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":363.49,"end":618.97,"speaker":"Bernardo Kastrup","text":"I don't think it's a scandal. I don't think it's a mistake. I mean, in Eastern traditions you hear a lot the notion of Maya or illusion being associated with some kind of error. Something went wrong at some point. And the best we can do is to just bear this illusory life for as long as it lasts. But the better yet is to get away from this while in life and to sort of transcend this world. Because it's a mistake. I don't relate to that very well. I may relate more to the Gnostic notion, but only insofar as the demiurge is itself part of God and we just use different words for different aspects of one and the same thing. I don't use religious language normally for two reasons, Jonathan. One is it's honestly the way I approach it, more secular language. It's closer to my background, to how I was educated both at home and at university and my work life and so on and so forth. And the other reason is religious language is symbolic. And that means two things. One, it's much more, it's much farther reaching, it reaches much, much further than secular language. That's the importance of it. That's the indispensable aspect of it. That's what it does that nothing else can do. But it's also very amenable to misinterpretation. So if I start talking about God or the divine mind, I don't know what people, what people will interpret my words to mean. Probably there are 7 and a half billion definitions of God out there. So that's the other reason. But in this company I feel very comfortable talking about the divine mind instead of a spatially unbound field of subjectivity. I'm pretty okay with that because I do identify these two things. I think the world's religious traditions are not a reflection of mental illness or wish fulfilling or. I think they reflect profound and ultimately true intuitions that the human mind has always had. And what I call the universal mind is bound to be what many people throughout history have referred to as the divine mind. Now, dissociation as the mechanism through which the divine mind becomes our individual minds, the kenosis of the divine mind. If we can start talking more religious language, I reserve Publicly, I reserve judgments about why that happened. If I'm pressed against the wall, I would say, well, it happened because it's one of the things that are inherent in the potentials of nature. And given enough time, it's bound to happen for the same reason that the volcano is bound to erupt, that a tornado is bound to happen. You know, I don't know that the star goes supernova. These are the things that can happen in nature because nature is what it is. And therefore they are bound to happen at some point in dissociation or life, which is extrinsic. Appearance is just one of those things. But if you ask me more deeply and more personal, personally in this smaller group where we are now, I don't think it's an accident. I don't think it's meaningless. I don't think it's pathological either. I use dissociation more as a metaphor than as a literal attribution of a pathological condition to the divine mind. For us, it's pathological in the sense that it may be maladaptive. We have non pathological levels of dissociation all the time. Every time you forget something, you're dissociated. When you dream, you're dissociated. Those are not pathological, they are adaptive. So I don't attribute the pathological aspect of it to the divine mind. And I even suspect that dissociation has to do with a felt telos, a felt purpose that is experienced by the divine mind and expresses itself in the form of life association. How do you see that?"}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":619.53,"end":725.2,"speaker":"Jonathan Pageau","text":"No, I think it's great that we're talking because I've heard you mostly talk in terms of use the more technical language. And so I was wondering what it implied to you. I mean, the way that I see it, I really have what you could call a Christian, non dualist perspective. That might be the best way to explain the way that I think. I think that the way that it's expressed is that unity and multiplicity have a manner of coexisting. And so in the same manner that there are multiple, multiple aspects of my attention, possible attention or possible aspects of my consciousness. And those can be, if I am in the proper, properly oriented, those can be gathered into me. It doesn't mean that I'm explicitly conscious of all those aspects, but they can be gathered into me, even though I'm not, let's say, explicitly conscious of all the possibilities. And I think that in that same manner, that is how we fit into what we would call transpersonal Beings, whether it be families or countries, but then also how aspects of us function in transpersonal beings as well, like virtues. And I have no problem with the notion of hierarchies of beings, hierarchies of angels, hierarchies of gods, but that all of that ultimately is never outside of the, of the divine mind. And that it exists in. In love, within the. The divine mind. And that it is. It becomes pathological to the extent that when. When a mind dissociates itself completely from its higher participations, that's when it becomes something like pathology. And I think that that's what we."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":725.2,"end":725.52,"speaker":"Bernardo Kastrup","text":"See."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":727.3,"end":814.59,"speaker":"Jonathan Pageau","text":"In the image of the story of the fall of Adam and Eve and in other traditions. I think the important thing for me is, unlike what you mentioned before, the notion of some Eastern traditions or Gnostic traditions that see multiplicity as something of a scandal in itself, or something of a deep illusion, or sinful in the very fact of its multiplicity, it seems to me that the Christian, or the highest Christian answer that has been given, which I find interesting, is that it seems to resolve that with the notion of kenosis in love, this idea of this self offering. But then there's also this return which happens at the same time inside God. And so you can see it eschatologically in Scripture from the beginning to the end. You can kind of see that full movement from procession to return. But it never implies that it annuls multiplicity like the returning to God. This is something you see in the Church Fathers all the time, that they'll say things like. They'll say things like in heaven. St. Paul is St. Paul, St. Peter is St. Peter. There is no loss of personhood, but there is rather the fullness of participation in God to the extent that that's possible for a person to do so. So multiplicity always continues to exist within the unity of the divine mind. I don't know if that makes sense. I never know if we have the same language. It's dangerous to talk too long sometimes."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":814.83,"end":1055.6,"speaker":"Bernardo Kastrup","text":"No, I agree largely with you, perhaps completely with some nuances. Dissociation is a very subtle mental process. It's very difficult to introspect into it and really pin down its mechanisms. And that's why my colleagues in analytic philosophy have a hard time really embracing dissociation as the solution to the so called decomposition problem. How one mind can seem to be many, because they are looking for something unambiguous and explicit, some conceptually clear mechanism that would explain how dissociation happens, how the appearance of multiplicity can happen within a unified, otherwise unifying mind. And we don't have language for that or sufficiently developed conceptual arsenals for that because everything is so subtle. The only thing one can appeal to is one's direct experience. And I have had the experience of resolving certain dissociative states that I have had for years. And in retrospect. And this will sound funny, maybe sound. Maybe even sound contradictory in retrospect. I know that I was both sides of that dissociation, like, for the longest time. If you could. If you would have asked me in the past, are you feeling this and that? I would have said, no, I don't feel that at all. That's not how I feel at all. It's. That's not me. It's not part of my world. Today. I look back and I realize, no, I was feeling that way. I was always feeling that way. I just didn't recognize it to myself. Now, how do you make sense of this to somebody who has not had that experience? It's almost impossible. Our vocabulary and conceptual arsenal, they are still evolving to pin that down. But I agree with you that multiplicity and unity are not a dichotomy. It may sound like a dichotomy, but it's a false dichotomy. Because our cognitive apparatus is not yet equipped or maybe sufficiently evolved to grasp what is meant there. Only somebody who has had dissociative identity disorder and has been, quote, cured will know that subtlety will know how that can happen, how multiplicity can exist in a unity that never ended. Another thing you said that I think is important is you talked about it as a Christian inheritance, and it definitely is that. I would go even further, and I would say it's one of the key characteristics of the Western mind, one of our contributions to the world, which is we are engaged with this world. There are some streams, even in the Christian tradition, that tell us, you know, this world is just some kind of penance. Life should be about what comes after. But by and large, the Western mind is engaged. We don't dismiss life. On the contrary, we seek meaning in the world. And I think, as I'm sure you do, that the world is not only pregnant with meaning, it is the very expression of meaning. Everything around us is not just the thing in itself, it's merely that. And there is no such a thing. Everything around us has an extra hidden dimension of depth and meaning that far transcends surface appearances. And I think the Western mind is very interested in engaging, engaging with that. As Jung put it, we don't try to get rid of the images. We try to relate to the images. We don't just say, oh, it's Maya, it doesn't matter, forget about it, wait for the next life. No, no, we engage with it. We try to find out what the meaning of this whole thing is. And I think that's a very important contribution of the Western mind. But even the west has lost touch with that fundamental stream of itself of its own inheritance."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":1056,"end":1122.85,"speaker":"Jonathan Pageau","text":"I know. I totally agree. I think that it's almost like it's a. There's a perversion of that inheritance which is. Which has become something like the scientism that we deal with or this, you know, the. The strange materialism that we. That we face. It's almost like a. Like an anti. A strange. The only way to say it is. It's a strange perversion of something which at the outset was positive. And that you find. And that's one of the reasons also why I. I really love iconography and I love the orthodox tradition, is because it has maintained this notion of the transfiguration and the resurrection as two of the most central images, that is, the possibility of fullness and the possibility of seeing light in phenomena. And not exactly like you said, like, I'm going to die, get rid of this world and fly off to heaven, but rather the image, the final eschatological image is one of the resurrection, which is that all aspects of reality are full of. Of God ultimately. Not that they're just resorbed into the. Into the one. So, no, thanks for that. That's. That's really helpful for me to understand your thought."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":1122.85,"end":1218.27,"speaker":"Bernardo Kastrup","text":"Definitely. And the other thing that I think is part of our inheritance, but we ourselves have rejected it because of, I don't know, some dialectic reaction to our own inherent archetypes. I don't know. But it's this notion that life is a matter of service and therein lies our freedom. Another seeming paradox and contradiction. But this notion that. It's the notion we perverted when we turned prayer into a ritual for telling God what to do, that's the thing that is perverted by this modern phenomenon. We turn to God when we need something, and then we go follow a ritual to tell God, okay, this is what you should do to help me out. And we completely forgot that it goes the other way too, that there is a service to be rendered to a divinity through this condition of being alive in this world. And perhaps iconography and symbolism is what we need to sort of revitalize that part of Our inheritance. That archetypal part of our inheritance. Who wrote recently about this was Peter Kingsley. He writes in a sort of very particular way. And he just said, yeah, we. We sort of forgotten, and we don't care anymore about what the divinity wants of us. It's like, yeah, the divinity takes care of itself. And. And we just ask for stuff. You know, we tell God what to do. Do you think a symbolic life can help us recover that. That part of our inheritance?"}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":1218.59,"end":1255.53,"speaker":"Jonathan Pageau","text":"Definitely. And one of the things that I been emphasizing with people is the notion of participation in general. One of the things that the modern world has brought to us is this idea of the distance, you know, this entertainment mode or this. This kind of observer mode in reality. And I think that religious participation, let's say the liturgy, for example, I think that one of its functions. And obviously, this is not the only function for those people who are listening or watching this, but one of its functions seem to be exactly what we talked about in terms of resolving dissociation. That is, the manner in which we."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":1256.01,"end":1256.49,"speaker":"Bernardo Kastrup","text":"If you."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":1256.49,"end":1395.91,"speaker":"Jonathan Pageau","text":"If you look at the progression of the liturgy, it moves. It's a moving in, right? A moving into this holy place. And a. At some point it says, we represent the angels. And there's this notion the angels come down. And so there's a movement towards a recognition that we're all dancing. Let's say we're all dancing together around that which unifies us. And one of the things we need to do is engage in this dance, celebrate that which unifies us, and then receive from it the seed or the point that all the philosophers talk about, this point that joined holds the circle together. That's what we receive. And then we move out, and we, let's say, bring that into the world so that the world holds together. So in that sense, that's why you'll see that often you'll find theologians saying things like, the liturgy holds the world together. And I think that that might seem like just a little bit of hyperbole, but I think it really is just in the same way that engaging in a family dinner properly and doing that with your family, engaging in that procession and that circumambulation holds your family together. Something like the liturgical service is a cosmic dance which binds the world together, and it's constantly expressing this relationship between unity and multiplicity, the relationship also to attention. If you listen to an orthodox liturgy, you'll hear attend all the time, stand and attend. This idea of a sacrifice of worship, all these things. I think that participating. There's A sense in which, at least in the Christian vision, that participating in that is a way to actually experience the resolving of dissociation and then be able to then internalize it so that we can see, even if not consciously or not thought out, it will be applied to your own life where just as you love your brother and you notice in this movement how you. You notice how all these other people are images of God and we're all images of each other. We're bowing to each other. We do what we do, doing all these things, and it's bringing us together. Then we can notice in our own lives these dissociative aspects."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":1396.47,"end":1524.41,"speaker":"Bernardo Kastrup","text":"I completely agree with you. The liturgy is a symbolic playing out of a dance that is happening all the time. Even. Even if we don't know, and the vast majority of people don't know. I do think that the orthodox tradition has preserved that a lot better than the usual Protestant or Catholic church that some people still go to on Sunday. Because some orthodox rituals, for instance, the priests have their backs to the public. They face the divinity, they face the altar. And these subtle little things are important because if they face the altar, the message is the priest is one of us, they are representing us. And we are trying to relate to the divinity as opposed to the Catholic priest who stands on the place where he stands facing us with his back to the altar and preaching moral codes. That hasn't worked for 2,000 years. And then after Luther, we completely got rid of symbolism altogether. I mean, I'm not here to chastise Luther because he saw several things that were true and needed a reaction. He saw that the church was becoming a temporal power as opposed to a spiritual power. He saw that clergy was hypocritical, focused on money and sinning. He understood that the people had to have more direct participation in a relationship with divinity. So they should be able to read the Bible and not only have the priests there as full controlling intermediaries for a relationship with God. So I understand all that, but it went so far that some Protestant rituals are now sort of a mock up of a trial. There is no symbolism. It's just telling you what not to do all the time. They even dress like judges. So there is a tremendous loss that maybe even religious institutions are guilty of promoting."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":1524.73,"end":1621.68,"speaker":"Jonathan Pageau","text":"Yeah, but I think that with even your work, or the work that I'm seeing, people like John Vervicke that you've talked to as well, and it seems like we're in, even what Jordan Peterson has been doing, seems like there's an interesting moment right now. And there's a moment in which even secular people are capable of suddenly noticing, for example, the ritualization of their daily behavior. The idea of the informal as being the place of authenticity. This has been the disease of the west from. I would say, possibly from the Reformation, for sure after that, this idea that that which is authentic is when we are informal. And this is absurd because as soon as you realize how even your bad habits are ritualized, everything that you engage with, anything that's teleological, has to be ritualized. That then all of a sudden you can think, okay, so that's why we have to have anything in common. It has to be ritualized, or else you can't do it in common. And so it seems like an interesting moment. And hopefully this will grow. I think even in the Protestant churches in the United States, those that are leading the edge, you could say, are returning to somewhat of a ritualized sense of time where they celebrate the different feasts of the church and, you know, they have more liturgy, a little more formalism. So I think that it's. We can't go any further than the rock and roll concert. Rock and roll concert and conference church. There's nowhere. There's nothing lower we can go to. And so hopefully it's all appeal from here for many of the churches."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":1623.44,"end":1782.44,"speaker":"Bernardo Kastrup","text":"I hope you are right. I do think that there is a psychological reason why we've embraced banality so. So thoroughly. You call it informality. I rather call it banality. We've made everything banal. Everything is superficial and banal and meaningless and nihilistic. And if I just put it like that, and everybody who is listening or watching this will think, well, but of course, that's not what we wanted. We don't want banality, we want depth. We want meaning. I think this is a superficial judgment. I think we do want banality because it spares us the confrontation with some great terrors within. Banality absolves from responsibility. It absorbs from the feeling of having to achieve something, of having to render some form of service, achieve some kind of goal. No, there is nothing. There's nothing to achieve. Nothing. It's the unbearable lightness of being, of Milan Convera. It's so light, it floats with the breeze. We are anchored in nothing. Nothing has any meaning. Nothing has any depth. I mean, there is a huge psychological payoff for this, an enormous price, a gargantuan price. That's depression. And it's all that stuff that we have an epidemic of the addiction, this gazillion different patterns of addictive living that we have today. When I say addiction, I don't mean only substance addiction. I mean addiction to distraction, to television, to buying shoes, to sex and porn, to everything eating meat and sugar. These are all addictions. And because we. We've lost depth and roots and meaning, we feel no responsibility. We no longer fear the experiential state after death because there is no such a thing. But we lost our meaning. And we compensate with that, with myriad patterns of addictive behavior. So in a sense, we've secured the payoff and we found a band aid to compensate for the price we pay. That's distraction, consumerism, television, pornography, eating, all this stuff. It is difficult to dislodge a civilization from this local minimum. I don't think it happens without major trauma. It didn't happen after two world wars. So that gives you an idea."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":1782.84,"end":1834.17,"speaker":"Jonathan Pageau","text":"Yeah, no, you're right. I don't think that we've dealt with anything that happened in those first world wars. We're just. We just were shocked for two generations. One, you know, two generations. And seems like all the patterns are returning. That's for sure. One of the things that I like to do is to help people notice, for example, that the patterns of addiction actually are religious in nature. They're just distorted religious patterns and that. So once you see that, once you understand that, you know, like whatever bad habit you have is basically a form of liturgy. It's just that it's one that is, let's say that spirals fast. And that runs out fast too. It runs out of. Of what it can offer you. It's a. And that higher attention is better. Is better than these low. These. These little. These little circles of attention."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":1834.97,"end":1984,"speaker":"Bernardo Kastrup","text":"Absolutely. I mean, it's not for nothing that we call alcohol spirit. There is. There is a deep root to this. Why alcohol is a spirit because it puts you in an inebriated state that the Greeks would. Would explain by saying, well, a spirit took possession of me. So alcohol is the spirit. It is impossible for human beings, it's impossible for living beings to get rid of the religious intuition because it's at the root of the tree. The intellect is the canopy. It came much later. It's. It's looking at the sun, and it doesn't see the dark and moist environment where we arise from that womb, where we arrive, arise from. And that's the religious intuition. We can't get rid of it. All we can do is misplace it. And we misplace it all over the place. We Misplace it by falling in love with that one person we can't have. And then that person receives a projection of a noumenon, an expression of the divinity and an achievable noumenon, and it attains an aura of impossible transcendence, of impossible value. And that's the religious intuition in us being projected outwards. What we see is what is in us, not on the person. The person is just receiving that projection. Or in transhumanism. I don't know whether you know anything about transhumanism. It's a religious movement. It's outwardly religious. It's the idea that there will be a God. We will build it. We will construct a computer that will be capable of producing a better version of itself, and that one, an even better version of itself, and so on and so forth, until God. And God is made of silicon. And it will, and it will find a way to help us live forever through drugs and surgery and finding new laws of physics. And we will bring back the dead by uploading all information about that person into some kind of artificial neural network. Ray Kurzweil. He wants to have his dad back. His dad. He's a kid who lost his dad young. So was I. I was 12. Lost my dad. He never found a way to integrate that experience and operate the alchemical work on it and transmute it into something else. He's still trying to bring back his dad. This is religion through and through."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":1984.57,"end":2055.44,"speaker":"Jonathan Pageau","text":"Yeah, but it's a very strange, materialistic and distorted religion, that's for sure. One of the things that interests me is the notion of this hierarchy of beings. I don't know if you have dealt with that at all. I've been thinking about Dante quite a bit in terms of, let's say, what you're saying. The way that the commedia seems to be structured, in part, is through the capacity for smaller loves to exist in larger loves, and that this is really an image of reality. So Dante starts with, let's say, poetry. And poetry is what awakens the possibility of love. Moving to Beatrice, then moving up to Bernard of Clairvaux, and then ultimately to the Virgin, ultimately to Christ, and then up into the transcendent unity of all things. And so I guess my question is, have you thought about that as well? Like the manner in which certain intelligences act as principalities for other intelligences, the idea of gods or patron saints, like how we can draw others into being."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":2056.48,"end":2063.12,"speaker":"Bernardo Kastrup","text":"Do you see that as a hidden hierarchy behind the world? In some sense I see it."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":2063.32,"end":2131.32,"speaker":"Jonathan Pageau","text":"I Mean, I really do see it just as the way that things work. That is that the way that we. There's. There's the personal aspect, which is that the little loves, those even like they're having a good drink, having a smoke or something, which could actually become addictive or sex. All of these good. All of these things can be goods if they are embedded in higher goods, and they're ultimately embedded in something like virtue, something like worship, something which leads you up. It really is a way to preserve the notion that all existence has the possibility of being good. But then that also works in terms of, let's say, beings themselves. So in myself, I experienced that hierarchy of goods. And in the world there's a hierarchy of goods and there's a hierarchy of beings which hold other beings together. A simple way to think about it is of course, you know, like how a country works, how you have a president and you have different beings that hold that together. But that this could go much further than just a physical. Just the way we see it in the world, something we can see, but that can work all the way up to something like patron saints or gods or angels or virtues that actually exist and hold aspects of reality together."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":2132.04,"end":2161.1,"speaker":"Bernardo Kastrup","text":"You mean more by this than just supervenience? Like, we can speak about the mind of China, but it merely supervenes on the minds of China's citizens. In other words, there isn't really a mind that corresponds to China in an ontological sense. It's just a way of speaking about the collective dynamics of the interactions between Chinese citizens. But you mean more than this. You mean something that has an ontological reality?"}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":2161.42,"end":2200.05,"speaker":"Jonathan Pageau","text":"Well, and the reason why I mean more than that is that, let's say the phrase that you just used to talk about China I could use to talk about myself or about you. That is that, you know, Jonathan doesn't really exist. He's just an image that we have to account for. The interactive aspects of my psyche and so that are not. And then you could keep going lower and lower and you could say that about every constitutive aspect of reality. So once I notice that fractally I can apply that type of argumentation to myself or to human beings, then I see less of a problem to then apply it up towards the ontological reality of higher beings."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":2200.45,"end":2342.51,"speaker":"Bernardo Kastrup","text":"If in. Under. Sorry, in other circumstances, sometimes another language creeps into my mind, in other circumstances, I would normally be cautious about this because normally I speak from reason and objective evidence. So if there is some structure in nature, I would look for its physical Correlates, in other words, how that structure manifests itself to my empirical observation. And if I cannot find that empirical manifestation of it, then I would say we would need to have very good conceptual reasons to infer that that thing exists in the absence of any direct empirical way to verify that it's there. So I would normally be very cautious. I would say dissociation in humans show us that our own otherwise unified mind can fragment itself. And it's fragmenting itself all the time. When you dream, you identify with your dream avatar, not with the rest of the dream. But guess what? The rest of the dream is you as well. You're just dissociated from a part of yourself until you wake up, or when you forget things, or when you compartmentalize things in order to remain functional, which is a deliberate form of dissociation. So we can speak of that, but it's more difficult to go the other way and say there is a bigger mind that, that we could call the hierarchies of heaven, the angels and archangels and the saints and so forth, because we do not have. Well, at least we think right now we do not have a direct physical correlate of that. Of course, there are people who would deny that. You talk about Dante. Dante would deny that because he talked about the love that moves the sun and the other stars. In other words, maybe the stars are the empirical physical expressions of some higher level form of mentation that also is circumscribed by some form of dissociative boundary and has an individual identity. Perhaps. But in the early 21st century, it's very difficult to go down these avenues of speculation, because how do you differentiate that from the aliens from the Pleiades sending us heart vibrations? You know what I mean?"}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":2342.91,"end":2444.95,"speaker":"Jonathan Pageau","text":"No, I think it's not that hard to differentiate in the sense that. So I'm a big fan of Sam Axmas, the Confessor. And in his. It's in his vision, the human being is, in a way, the laboratory of meaning. It's that in the, in the human, that even the higher principalities are gathered in a certain manner. It's difficult to fully. It's not super precise the way that he talks about it, but he has a sense in which in a certain manner, man is above the angels. And so you can understand that you see Christ represented as a man when he's creating the world. And so there's an idea, Adam Kadmon, which is there in Philo of Alexandria, but appears rather in the idea of, in iconography. We See it very clearly, the notion that man is at the outset, that the universal man is at the beginning of all things and so these intelligences. So a good example would be, right, Jung did something similar where he said, so the star. It's not that the stars are legislating. Our experience is that we project meaning into this infinite tapestry of possibility. And now that pattern has a certain form of reality because it corresponds to our psyche and to our psychic projection. And so it's like you could say that there are no patterns in the stars because there's millions and millions of them. And the patterns we trace are just projections of our psyche. But there might be a way in which, if the pattern of our psyche is the laboratory of how reality comes together, and it's hard to avoid that because we are the people looking at the world, then those patterns can also have causal effect."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":2445.51,"end":2447.11,"speaker":"Bernardo Kastrup","text":"I'll be more open."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":2447.27,"end":2467.83,"speaker":"Jonathan Pageau","text":"The big ball of gas, that's when we say, so it's not the big ball of gas, but it's the pattern of the heavens which is causally affecting the world through, if you want to see it as through the projection of the human psyche into that of objective patterns that have developed from millennia or millennia, it doesn't matter, but it can still have a causal effect."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":2469.23,"end":2665.11,"speaker":"Bernardo Kastrup","text":"I don't reject this at all. Recent studies are showing again and again that the universe at its largest scales, which we can simulate, we can't image it because we are within it, but we can compute it. And the structure of the universe, the network structure and topology of the universe at its largest scales is mind bogglingly similar to the structure of organic nervous system. And there is no known reason why this should be the case. To call it a cosmic coincidence would be the understatement of history, of all history, because the correspondence is rather precise. So it suggests the fractality of mind and its manifestations. So the universe as a whole looks like a nervous system because it too is the body of the divine mind. In other words, it's the extrinsic appearance of the divine mind. And the whole thing operates through hierarchies of self similarity, or fractal hierarchies, so to say religious iconography suggests that. And I take religious iconography seriously. There is an icon from the Ukrainian Orthodox Church with the church fathers gathered in a conference underneath two large mountains. So you see that, you know, those individuals are within the earth, which suggests that what we call the physical world is actually the outer appearance of a hierarchy of being. I do take that seriously. And I do take introspection seriously, and I'll be very open with you at this point in my life. I'm 47. I will be 48 this year. It's trivial for me. It has become trivial for me to notice the movements of the impersonal within me. I know what is my own shit, and I know it's not, if you know what I mean. Yeah, when I was 30, it would have been impossible to make that distinction because you just don't have the subtlety of inner perception to make these differentiations. So you are all the time deceiving yourself. Your ego is all the time pretending to be something higher and noble and driving your actions. Well, in fact, it's all of your bullshit, all of your wish fulfillment, your search for meaning. It's all that superficial stuff. It's all you. But if you get beaten up by life enough over the decades and you are paying attention, which most people don't, I happen to be put together in a way that I cannot help but pay attention. And I have paid attention for the best part of 40 years. And now I think maybe I'm deluding myself still, but I don't think so. I think I can notice the impersonal in me. But that impersonal is not oceanic consciousness either. That impersonal has an agenda. It's not mine, but it's not the whole of the universe either. It's an individual agenda of some form. I personalize it and I call it the diamond because it gives me some."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":2665.11,"end":2666.55,"speaker":"Jonathan Pageau","text":"The guardian angel is good enough."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":2667.51,"end":2668.23,"speaker":"Bernardo Kastrup","text":"Well, I."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":2669.43,"end":2671.71,"speaker":"Jonathan Pageau","text":"It's okay. I'm just pushing you."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":2671.71,"end":2757.38,"speaker":"Bernardo Kastrup","text":"No, I will tell you why I don't use that. Yeah. My diamond is morally neutral. And if I'm not careful with. I mean, my diamond doesn't give a damn whether I will have a roof over my head tomorrow, food on a plate. It doesn't give a fuck. Sorry. Doesn't give a damn about it at all. Because it's impersonal. Its agenda is not my individual survival as a tool of nature, as an expression of a part of nature, it's not operating at the level of comfort and survival. It's a force of nature. It's like the tornado that comes, destroys your house and kills your family. Did it have a bad intention to do that? Of course not. The tornado is not living in this frame framework of survival and comfort. So the diamond is a force of nature. And as a force of nature, I perceive it as very morally ambiguous or neutral. It knows where it wants to go, and it will Beat me up to help it go in that direction. But it's, it doesn't have my individual well being in mind, if you know what I, what I mean, my well being is something that I negotiate with it. Literally I negotiate with it every day. So I don't call it the guardian angel."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":2757.7,"end":2761.86,"speaker":"Jonathan Pageau","text":"So what would, what would it's telos be? Or can you recognize that?"}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":2762.02,"end":2877.97,"speaker":"Bernardo Kastrup","text":"Oh yeah, yeah. It. If you think you recognized it, right. And then you go down the path suggested by that misapprehension, it gives you very quick feedback that you're pursuing the wrong path. That was not it already. All right. It turns my mental inner life into sheer hell. All kinds of things will plague me. Unexplainable anxieties, obsessions, physical symptoms. I don't want to use certain words that, that informally. I would. But it's a show. It's a very bad show that happens within. So it gets to a point where it's inevitable to learn to recognize what its agenda is. So I do, I do recognize it. And that's why I do what I'm doing now. I've. Two years ago, Jonathan, I abandoned a 25 year long career in the high tech corporate world. If I had stayed, I probably would be close to what you would call rich. And it's not only the money, it's my social network, my sense of identity, my sense of value and differentiation. I left it kicking and screaming because my diamond was very clear about what I had to do and what I had to do. Part of it is talking to you today and leading essential foundation. I negotiated enough with it that I delayed the process until I could secure myself, more or less. But it does have an agenda. Yeah. Very impersonal. So that suggests to me there is indeed the hierarchy of dissociation in the divine mind. Because my diamond comes across to me as something that's not human. But it's not the whole of the divine mind either. It is an aspect of it. Yeah."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":2879.33,"end":2976.79,"speaker":"Jonathan Pageau","text":"St. Gregory of Nyssa talks about in the life of Moses, he uses Moses and Aaron as an analogy to talk about this. He calls it the helper. He has the notion that there's Moses and then there's his helper. And he differentiates two sides of the helper. And what he comes to is actually the little cartoon image of the angel on the right shoulder and the devil on the left shoulder, you know, and St. Gregory NYSE actually describes exactly that. And so he separates Aaron the helper into two. That is, it's something like. It's a Good way to understand it. It's like a transpersonal. A transpersonal pull towards something. And so it's something which is beyond you, which is pulling you in a direction. But he sees it as either going up or going down. So it's like you have a certain transpersonal aspect of you which is pulling you down towards these little circles of attention and this kind of chaotic levels of attention. And you have an aspect of this helper which is whispering to you and kind of pulling you up towards higher levels of attention. Of course, St. Gregory doesn't use the word attention. I'm using that here because it makes sense to what we're talking about. So you can see it in iconography. You've probably seen these images, if you know orthodox iconography a little bit. You know, the angel pulling up the. You know, the toll houses and then the. The devil kind of pulling someone down towards hell. This is this. This kind of image of how we are embedded in this transpersonal mind."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":2976.79,"end":3005.35,"speaker":"Bernardo Kastrup","text":"You could say that the push and pull exists. It's introspectively very clear to me. It's a. It's a datum of existence. It's not something that is open to theoretical speculation, if you know what I mean. It's there. I don't divide the diamond into one good and one bad. I tend to identify with the bad. Like the bad one is me. It's Bernardo. It's the guy that's probably the best."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":3005.35,"end":3010.95,"speaker":"Jonathan Pageau","text":"Way to do it, actually, in terms of terms of transformation. Probably the best way to do it."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":3011.75,"end":3139.84,"speaker":"Bernardo Kastrup","text":"It's not really a choice. It's how I feel it. Bernardo is the guy who is looking to secure his own comfort and safety and the comfort and safety of the other little beings that Bernardo cares about, like Bernardo's girlfriend and Bernardo's cats and Bernardo's friends. And he wants to have a little bit of power, a little bit of money and get some recognition, you know, and then. And that's me. That's. That's the ego. And the other pool, that's from the impersonal, that's not me. But it's neither good or bad. It's neither an angel or a devil. It's morally ambiguous. Again, it's a force of nature. That's how I experience it. But talking to other philosophers and reading history, and that's part of the reason why I sort of granted that there are reasons to think of a hierarchy, of being other people. Other philosophers seem to have other Daimons, like Socrates. Daimon would only tell him what not to do. Would never tell him where to go, only tell him when Socrates was doing something wrong, then the diamond would say, no, my diamond is not like that. My diamonds just kick me in the butt in a certain direction. You go there, you bastard. Here, boom, go. And I go kicking and screaming. That's not Socrates, Daimon, it's another diamond. And some people have a seductive diamond, a diamond that seduces from the front instead of a diamond that kicks you from the back. That's not my diamond. And I envy other people's diamonds. I think in the cosmic lottery. No, no, I'm not going to say what I was going to say because my diamond has brought tremendous meaning to my life, despite all the suffering and all this stuff. So I'm not going to spit on it. But there is nothing romantic about the Daimon, if you know what I mean. Yeah, there is something romantic. Oh, you have a guardian angel. Oh, you go out mushy and it's so romantic. There is nothing romantic about my diamond. Nothing serious."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":3140.64,"end":3146.8,"speaker":"Jonathan Pageau","text":"Yeah, I don't see anything romantic in the guardian angel myself. They're often represented as warriors anyways, it's not particularly."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":3147.68,"end":3148.48,"speaker":"Bernardo Kastrup","text":"I don't like it."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":3148.64,"end":3242.7,"speaker":"Jonathan Pageau","text":"Yeah, but so my. So let's say the way that I. How can I phrase this? And so the way that I like to think about it. So the Daimon. What? Your Daimon, One of the things it's asking for you is, let's say, direction and attention. That is, you have to look in its direction and attend to. And that is how it kind of pulls you or pushes you or kicks you, whatever, in the direction that you're going. And so the way that I like to think of transpersonal beings is similar. That is when we talked about the. For example, the existence of the angel of China would be a good way to think about it. It's that what the angel of China is asking of the Chinese is to attend to it. That's the first thing it's asking. And so by, by the multiple attending to the one, that is how it finds body in the world. And so that is how it kind of. It manages the body. And so you can apply that fractally at all levels. And you can understand that there's something about that which is, which is right. You can even think about your own cells without using the same level of attention. But that the cells that attend to the telos of my body, they're the ones which will make my body exist and go forward. And the cells that don't will be fought by those other cells. That are in line with the attention of my body. And so I think that when you notice that a country also works that way or that hire a basketball team or anything in which multiple individuals attend towards the."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":3242.78,"end":3254.7,"speaker":"Bernardo Kastrup","text":"But do you see these, these hierarchies as supervening on us? In other words, as just emergent phenomena from us, or do you see them as pre existing? Like there is a pre existing angel of China?"}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":3255.1,"end":3343.67,"speaker":"Jonathan Pageau","text":"Well, you could say something like the way that I would say it would be that, that all, all exists, pre exist in eternally in the divine mind. That is, to the extent that mind does not, is not unfolded in time, then all the aspects of mind exist in it from, you know, and then they unfold through what we call time and what we call space. And so the being, you know, the angel of China eternally exists in the mind of God and then unfolds in its time and in its space the way that any being unfolds in their time and their space. So you could, you, could you, if you wanted to say that it, like it doesn't exist before, before China, then I would say that's fine. It doesn't bother me that much. But I think there's a way to. The way I always do it is, I ask myself that of myself. Is that do I exist or am I just an emergent phenomena of particles and thoughts? And you could say, well yeah, I'm that. But I also think that I have a me or I have a consciousness which supervenes on the multiplicity of my being. It's not 100%, it's not something which is completely sealed shut and totally, let's say that's completely authoritarian, but it nonetheless exists. And so in that sense I also think that China exists and that families exist and that there's an, there's myriads of angels. The way that, you know, that Thomas."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":3343.67,"end":3367.7,"speaker":"Bernardo Kastrup","text":"Would have said, but if China tomorrow, I mean we know historically that given enough time, all nations will cease to exist, at least in their former form. If China tomorrow ceases to exist, or if you decades from now cease to exist, does that level of the hierarchy continue to exist? Does the angel of China survive China? Does the angel of Jonathan survive? Jonathan, you."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":3367.7,"end":3463.24,"speaker":"Jonathan Pageau","text":"Well, a good way to say it would be something like it exists in the eschaton, it exists in the totality of all things within the divine mind. It doesn't. It can continue to linger, to have a lingering existence without, without, without a localized body. So for example, I think that if we say that Greece doesn't exist Anymore, I would say that that's, that's malarkey. Like the Greece still exists today. And you know, we carry Babylon, we carry all these things. So there is, there is a certain manner in which these bodies continue to, although weaken, continue to, to exist and be assimilated into, into other beings. And so that's the way that I see it. And it's also these beings are. They fit into each other. It's not like. How can I say that I don't think any being has a discrete existence. It always exists in a fractal relationship with other beings within higher beings. And so the notion that. So in the same way. So a good example would be that these beings being held by higher beings. And so if the angel of all nations, right, or Christ himself holds authority over all the angels. And that is how it works. In the same way that if my cells come and go in my body, you know, you could say, well, does that cell still exist? Well, no, but you know, it's, it's held together in potential, you know, in, in the, the actuality of the higher being. So that's the way that I tend to think about it. I don't know if it makes sense. This is becoming a little more esoteric here."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":3464.04,"end":3469.72,"speaker":"Bernardo Kastrup","text":"Analytically, it's very difficult to unambiguously conceptualize what you're saying."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":3469.88,"end":3470.36,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":3470.36,"end":3546.2,"speaker":"Bernardo Kastrup","text":"Without internal contradiction. Panpsychists try to do exactly that. And it's very, very difficult. Some would say impossible. But I do feel the smell of what you're trying to say. Your dream avatar. There is a sense in which your dream avatar dies the moment you wake up. But there is a sense in which your dream avatar also survives in your memory. So in that sense, everything that has ever existed survives as an eternal memory in the divine mind. Yeah. And. But then you solved the problem in one way going forward, but you didn't solve the problem the other way, going backwards. Like, did the angel of China pre exist China. And it provided a template for the formation of China. Did it exist as an archetype in the sense that, like Jung said that the matrix structure of a diamond pre exists the diamond because it's encoded in the laws of nature. So that would be a sense in which things could pre exist without pre existing as particular manifestations of the thing that pre exists. But it gets into very difficult territory. Analytically. This is something that is better grasped intuitively."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":3546.2,"end":3661.17,"speaker":"Jonathan Pageau","text":"I think maybe that's, maybe I just grasp it intuitively. So I don't feel I have to analytically. But let's explore that. I mean, I think that it's a good idea to explore it. And so if we understand China as a species of something like human communities, right? And so you could ask that question that you're asking about any level of speciation of different beings. And so you have. So the question is like, do Rottweilers. How do Rottweilers exist within the speciation of dogs? Like, how do identities exist within higher identities? And I think that if we are able to resolve that problem at the level of the dog, where we understand that multiplicity is held in unity, and multiplicity is to a certain extent indefinite, the multiplicity that's held in the unity is indefinite. You could say that the identities that dog can give are indefinite. There's an indefinite amount of dogs, possible speciations of dogs, right? But they still nonetheless are held together by the dog speciation. And so I think that if we think about it that way, then the problem of the angels of countries is less complicated because we have the divine logos which manifests the bond of love of all possible things in the highest aspect. And then that speciation lower down is. And then lower from. From countries or lower, lower from countries. You have families, you have groups, you have associations, you have all kinds of things which are just possible speciations that are held together up into higher identity. Like, I'm really. I get. You can see I'm more of a Platonist, like, at this point, but. But I don't know if that. If that. Does that analytically, does that make sense or like the way that you see it?"}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":3662.46,"end":3688.95,"speaker":"Bernardo Kastrup","text":"I see it in a way that makes sense analytically. It's very difficult. And the reason it's difficult analytically. When I say analytically, I mean to make it fully explicit and unambiguous is very difficult. And the reason is it entails determining where boundaries lie. Where are the boundaries of identity, hierarchical or otherwise? Where do they lie? If we talk about the identity of China, is there the identity of Hong Kong?"}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":3689.43,"end":3690.35,"speaker":"Jonathan Pageau","text":"Yeah, I think so."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":3690.35,"end":3742.24,"speaker":"Bernardo Kastrup","text":"Is there the identity of Shanghai versus Beijing? If the table has an identity and I pull a leg off the table, does the leg now have its own identity? And if I nail it back to the table, did it lose its own identity? Does the mountain have an identity? And if so, when a boulder degloos from the mountain and comes bouncing down the slope, is it now. Does it now have its own identity when it's flying? And does it reconnect to the mountain every time it touches the mountain as it rolls down it becomes arbitrary because there are infinite possible boundaries. And if one doesn't have some kind of explicit and unambiguous criteria for determining boundaries lie here, then it's a free for all because you can put boundaries anywhere. And then it's an explosion of identity."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":3743.19,"end":3782.46,"speaker":"Jonathan Pageau","text":"So I don't mind the explosion of identities. That is, I think that there is an indefinite amount of possible identities, so that doesn't bother me. And I think that if we understand it as a hierarchy, then the boulder can exist in the mountain, and it doesn't prevent the mountain from existing. We can recognize lower level identities within. So like, the table is a good example. So does the tape, does the leg of the table have an identity? The answer is yes, it does. Well, actually it had an identity like while it was still nailed to the table. And if you remove it from the table, I can still recognize it as a leg of a table."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":3782.86,"end":3838.09,"speaker":"Bernardo Kastrup","text":"But we were talking about the identity of mentation in the sense that there is something it is like to be the leg of the table as opposed to the table as a whole. Of course, we can define boundaries on the screen of perception, but that's not what we were talking about. We were talking about individual individuated minds. So if the mountain has one individuated mind, like I have an individuated mind, when the boulder rolls down the slope and becomes separated from the mountain, does the boulder now acquire its own private mind as distinct from the private mind of, Of. Of the mountain? And there is a philosophical sense in which if you say that there are infinite mental identities, in this sense, entities with private inner minds, if you say there are infinite ones of those, it's exactly the same thing as to say that there are none."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":3838.41,"end":3881.41,"speaker":"Jonathan Pageau","text":"Yeah, no, I don't. The way that I see it is I see it really in the manner that I talked about St. Maximus before, is that I see them gathered into my mind. And so to the extent in which they have their own individual, like, discrete existence, in a certain extent is an extension of man, as when I say man, I mean the incarnate man as the image of mind, let's say, or the highest image or the most gathered image of mind that we have, because it's also that through our conscious experience that we have it. And so that's the way that I, that I tend to see it. I don't know if that resolves the conflict that you're seeing."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":3881.41,"end":3928,"speaker":"Bernardo Kastrup","text":"It does. It does. Because what you're saying is that within our private minds, which we know exist, even if they are illusions. They still exist as illusions. Something is making this illusion happen. Maybe there could have been no illusion, but there is one. So there is some kind of mechanism within the context of our private minds which are there. We experience fractal reflections of all the identities in nature. That. I agree with that completely because I think the subjectivity in me is the same as the subjectivity in you. And it's the same as the subjectivity of the universal mind or the divine mind. Like who. Who said it. That the eyes with which God sees me are the same eyes with which I see God. Was it a. No, it was not."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":3928.4,"end":3928.8,"speaker":"Jonathan Pageau","text":"Who?"}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":3929.12,"end":3930,"speaker":"Bernardo Kastrup","text":"One of the Christians?"}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":3930.48,"end":3932.32,"speaker":"Jonathan Pageau","text":"Is it a Christian? Sound like a Sufi to me."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":3934.08,"end":3936.12,"speaker":"Bernardo Kastrup","text":"Was it Eckhart? I think it was Eckhart."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":3936.12,"end":3938.24,"speaker":"Jonathan Pageau","text":"Yeah, that could be Eckhart. Yeah, that could definitely be."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":3938.4,"end":3983.13,"speaker":"Bernardo Kastrup","text":"Possibly. And. And if you grasp this, and it's very difficult to put it in sort of unambiguous analytical terms, we. We don't have the conceptual armor to do this. But if you grasp this, that the eyes through which you look for God are the eyes of God looking for itself, if you feel it in your being not only conceptually as a thought, but as. As an experience you're directly acquainted with, then it becomes very obvious that all seeming identities exist within you as experiences. As a reflection of the macrocosm in. In the microcosm. It's. Yeah. I mean, I can't defend it analytically. I can't write a paper."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":3983.45,"end":3983.85,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":3983.85,"end":3999.85,"speaker":"Bernardo Kastrup","text":"Or the Journal of Consciousness Studies defending this. But if you ask me, do I believe this. I know this. It's. It's a living experience for me. So I have a diamond. Jonathan. I don't want to change the subjects if you want to pursue this a little further. But I had this question."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":4001.13,"end":4008.63,"speaker":"Jonathan Pageau","text":"I mean, go for it. I don't. Mark, if you want to inject. Because we kind of. We kind of. We're just going at it here. So I don't know if you had things you wanted to. To talk about and deal with too."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":4008.87,"end":4028.87,"speaker":"Mark","text":"So I had thought about going in the direction actually of a recent essay about Paul Kingsnorth and talking about all the different myths of progress and using that as a kind of contrast to serve for clarity with what you guys are speaking about. But if you want to go with the diamond, that's fine with me, too."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":4029.11,"end":4032.79,"speaker":"Bernardo Kastrup","text":"Very quickly. I just wondered if Jonathan has a diamond."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":4035.27,"end":4125.9,"speaker":"Jonathan Pageau","text":"I don't. I don't experience it in the same way that. That. That you experience it. I. I think that I. I tend to experience it more in the way that St. Gregory talks about it, that is that I, I sense that there's a transpersonal aspect of me. Like I sense on the one hand something like what St. Paul says, right? I do the things that I do not want to do. I, I experience that all the time, right where I'm doing. I find myself lying. And there's another voice in my head going, why are you doing this? Like, why are you lying? Or like, why are you, why are you acting this way? Why are you taking the credit? Or whatever it is that I'm doing? That's this. And so I experience this kind of force that's pulling me down. And then I also, in the same way have a sense that something like a good Christian way of saying it would be like, I know I feel a calling is a good Christian way of saying it. I feel like I have this calling and that I'm being, like you said, I'm being kind of pulled forward towards certain things, both in my own life in terms of transformation, but also even like you said professionally in terms of the types of things I'm supposed to pay attention to, the types of things I supposed to put my energy into. And if I don't listen to that voice and I suffer greatly. And if I, if I listen to that voice, I suffer. But the suffering is worth it. Like, it's worth it for what it gives. And so that's the way that I tend to experience it."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":4126.3,"end":4141.11,"speaker":"Bernardo Kastrup","text":"It's exactly the same for me. You don't personalize it as I do, probably because you have always done the diamonds bidding. So you, you don't have a background to contrast it with, with you."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":4141.11,"end":4218.81,"speaker":"Jonathan Pageau","text":"But I also see it. But I think, I think that I see that, let's say something like my guardian angel. I tend to see through the guardian angel into Christ, into the incarnate God. And so, so it's not that I, it's like it, that's. That maybe even be just my Protestant background, because I used to be Protestant, where it's like I even, even if I, when I feel pulled, I tend to want to see through that towards something else. Like, so you'll hear people, I think that the experience you have, you'll hear Christians say something like that all the time, will say like, God showed me this, or God. And it's not God directly, it's. It is this intermediary being. But I understand too why, because it's pulling you up and it's pulling you into more being then it's easy. You Want to see through it and see, see the, the higher aspect kind of pulling you forward. So that's, that's how I tend to. But I have other beings pulling at me all the time, like my patrons. I have certain saints which have imposed themselves on me. Some like Saint Maximus, who I've chosen, but other saints, like Saint Christopher, for example, who really has imposed himself on me and. And is. Is there to. To. And is kind of pulling me, pulling me in certain directions. And I. Yeah, and I, I can't deny it."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":4219.16,"end":4365.5,"speaker":"Bernardo Kastrup","text":"Yeah. You always describe it as pulling, never as pushing. Yeah, I think it's somebody who feels pushed. Like I do it like I won the lottery the other way around. But what you describe, I recognize. And there is the Daimon, which, unlike you, I don't see it as the summum bonum. I don't see it as a morally positive force. I see it as a very morally ambiguous force who doesn't care much about my comfort or safety. But I also feel the push of the ancestors instead of the saints. Like I feel the push to sort of clear the record of the ancestors, clear the record of Jung, clear the record of Schopenhauer. And the one that's really pushing me now wants his record clear. I mean, it could all be fantasies of my mind, of course, somewhat impersonal, but it's useful for me to attach names to these things because it enables a relationship with them. I feel the push of Nicolaaus von Kus, Nicolai de Kusa Kouzanus. I don't know whether you know about him, no hardly known philosopher who was also a bishop of the church in the 15th century. And I feel the push of that image now. Like clear his record, you know, vindicate him because he left a treasure buried in the field and nobody has a map and we need to find that and open it up so that I feel too. It's less personalized than. Than the diamond. The diamond is just overwhelming with me, totally overwhelming. It's a very present reality for me because I used to not listen to it. So I know what it is like to ignore the presence of the diamond. And, and therefore its presence now is. Has great contrast against that previous background in which I thought, it's just me, I'm the master of my own house. And I remember that. And it provides a background that really highlights the diamond. Now there is that. That thing there that I used to ignore and not listen to and pretend that it didn't exist, but it was always there and it's very distinct."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":4366.78,"end":4377.74,"speaker":"Jonathan Pageau","text":"So mark Go ahead with your. You talked that you wanted us. I didn't read Paul King North's last essay, but maybe you can. I usually do read all his essays. I just haven't gotten to that one yet."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":4378.15,"end":4506.73,"speaker":"Mark","text":"No, that's grand. So I've taken a lot of notes about it, so I can try and phrase it in a way that aligns with you guys and see if we can use that as a springboard. So I wanted to phrase it within the context of the kind of meaning crisis, which I know you've spoken about, Jonathan, which I think in line with what you guys have said, is two things in particular behind that, even if I might phrase it that way, a crisis of authority and which authority or authorities are we going to trust, I suppose. And direction, with the kind of myth of progress that he describes having no direction, there's no destination clear in mind. Whereas from the Christian context, would you have the kingdom of God, however hard that might be to define? And this kind of general crisis of modernity. So Paul's recent work, I think, might help us find some convergence in clarifying some key trends and problems. I think he picks up in some ways where Alan Watts left off, which I know Bernardo likes. And from a customer perspective, I think even Nikolai Berdaev serving this kind of prophetic role. So I wanted to speak about this notion of progress that he critiques in his article. He suggests a number of things. Progress wants the end of history, it wants the end of transcendence and so on. And he mentions how modernity actually makes a major break by fully sort of developing the anthropological themes of the transcendence is pictured as beyond, is replaced by this kind of transcendence within the world. And he says that transcendence within the world can be translated as progress. With no ultimate truth or higher story. There's nothing to stop us kind of bending the universe to our desires. Indeed, to do so is our duty. And this, in Augusto de Nache's talent, then, is what explained actually 20th century history having replaced religion with this kind of perverse philosophy, we then tried putting philosophy into practice on a kind of grand scale with terrible results. So then he goes on, what progress wants is the death of God. So suppose really, considering all that, how do you hope in humility, then to help address this crisis with your work? And I've been thinking about that from both your perspectives. Then do you want to go first there, Bernardo?"}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":4507.53,"end":4771.44,"speaker":"Bernardo Kastrup","text":"2,000 years of preaching have not solved the problem. So we know at least a few things that don't work pure Philosophy has not solved the problem. Otherwise, you know, all the philosophers that occupy the path, the long path before us, would have made a significant difference in the way these things have evolved. I tend to think that the collective mind of humanity, and we can think of it as a, you know, the angel of humanity. In Jonathan's language, it. As people in religious circles say, the spirit will move the way it moves. The angel of humanity will stir and move the way it does. I think the only thing we can do is to put some beacons here and there. So even when that great angel of humanity looks around for some bearings that it will find the beacons, we cannot make it look. We cannot convince it to look. We cannot make it go in the direction of the beacons. All we can do is place the beacon there, light it up. If it does happen to look and find and does happen to want to come in that direction, then we've done our part. But it's not a process that can be forced. It's too big of a giant to be corralled in a certain direction by mere human minds and human actions or by preaching or even tremendously compelling philosophical reasoning. It will not make it happen. All it can do is plant the beacons around and hope for the best and cross our fingers. And to me, there is freedom in the recognition of this small part that I'm supposed to play because it doesn't make me feel a sense of responsibility for the final outcome. Because if you do feel a sense of responsibility for the final outcome, you are lost in a very dark space. And you may react to it through inflation, like Hitler taking responsibility for the final outcome of the destiny of the German peoples. That's what you get. You get this kind of tremendously dysfunctional pathological inflation that can lead to disaster. And if you don't get that inflation, then you feel like you're nothing. You feel powerless before a tremendously powerful universe that doesn't even know you exist and might as well step on you by just not noticing that you are there. Like, we step on an end, which is also not a good place to be. I think freedom resides in service, which is something that we in the west knew but have forgotten. And it's. It's a. It's a seeming paradox, because when you serve, it's like there is a kenosis involved. You're losing yourself because you're serving something that isn't you. Your life is no longer about you. You are just a tool, a small tool. So there is this sense in which you sort of extinguish yourself in service. So how can you be free? Well, you can be free from the claustrophobia of purely personal meaning. Because, you see, even if you achieve everything you want, ultimately, it's all for nothing. You're just a person. You will be forgotten 100 years from now. If you're extremely famous a thousand years from now, 10,000 years from now, you'll be forgotten. It will all be for nothing. If you think that it's about you. It's extremely claustrophobic. And it's a prison. It's the prison of the insignificance of the personal self. That's what happens if you think your life's about you. But when you extinguish yourself in service, wow. It's like opening the windows, you know, it's like looking at the horizon. Everything becomes huge. The moment you disappear the moment. How do we explain this? I've been trying to explain this the past year or so, and to fail every single time. To me, setting up that little beacon without any control of the process is my freedom. It's the insignificance of setting up the beacon that is my freedom. I lose myself in it. Yeah. I don't know whether I can say this any better. Maybe Jonathan, as an artist would do. No, but I think better than I do."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":4771.84,"end":4886,"speaker":"Jonathan Pageau","text":"I think that you're really. You're really coming right up to this mystery about how multiplicity and unity exist. It's really, in a manner, the surprise of what Christianity, in my vision, the surprise of what Christianity offers. But I think you see that in other traditions as well. But you definitely see it in Christianity, which is like, okay, so why is the cross, this cross thing? Like, what do we do with this? Like, what is this. What is this cross thing at the top of the mountain? Why is that the thing we're asked to pay attention to? And it's the realization that it is in giving yourself to a higher being that you lose yourself and then you're full. You, You. You find yourself filled. And so I think that that's what you're. That's what you're experiencing. And I. And I think that that's actually how things work. Like, that's actually how the world works. Is that fractally, things give themselves, sacrifice themselves for their higher participation. And I think that even the ritual sacrifices were ritualized versions of that. Like, we take something precious, we give it up, and then we receive fullness from above. And I think now in terms of Christianity, now we talk about this. The word, the Sacrifice of worship, the sacrifice of attention. So as you attend to the higher and you give yourself, then you are. You're filled. You're filled by that higher participation that can, of course, can become pathological. And we've seen many examples in which it has. But it's nonetheless the way that things work. And I tend to agree with Bernardo in the sense that I see that there are certain patterns which are playing themselves out, which we're not going to stop at this point. We're not going to stop this pattern. And there are stories from the past which tell us about these moments, you know, and there are versions of."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":4886.24,"end":4886.64,"speaker":"Bernardo Kastrup","text":"Of."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":4887.2,"end":5026.96,"speaker":"Jonathan Pageau","text":"I've. I made a video on the Book of Enoch recently where the description of the. The instrumentalization of intermediary beings towards power and towards desire and towards. It's kind of like taking these. These patterns from above and then, you know, incarnating them in these giants that then devour the world. I think that that's where we are. Like, we're really, you know, when St. Peter says, like in the time of Noah, I think that that's pretty much where we are. And so the only thing we can do is build an ark, you know, And I think that when Bernardo talks about beacons, I think that that's something like that. And the other thing we can do is understand that the world exists ultimately in a certain way. And I think that it exists through these types of principalities. And so when we hear this idea, acquire the spirit of peace and you will, and millions around, thousands around you will be saved. I think that that's also something which we can do, which is that to become more, and in becoming more, you somehow pull others in. Into the ark. Is the only way to say, I don't know how else to say it, is that in becoming more, in working out your own crap, in kind of consolidating what's immediately around you, your life, your family, your friendships, your relationship to the people around you, and encountering that in a manner which is true through the spirit of service that Bernardo talked about, I think that actually has more effects than we think that it does. And it actually acts as little beacons, little arcs of possibility that will rise up after the fire. But I think that in terms of the big pattern, I don't see. It seems like things are accelerating in ways that we could barely have predicted. Well, we could have intuited, but now we're seeing it, things are really accelerating. And this idea of progress. Right now we have people in Davos, you know, planning the Future talking about how we're going to have. We're going to have all these, you know, we're going to use all these different technologies to make us more, whatever that means. And that's exactly the problem that Paul is. Paul Kingsnorth is."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":5026.96,"end":5096.86,"speaker":"Bernardo Kastrup","text":"Is talking about, where it's not a recent thing. Right. I mean, Nietzsche was the first one to identify exactly this and to go through the consequences of this in the microcosm of his own life. Because there was someone with a profound religious disposition, Nietzsche, profound religious disposition, who thought his way out of religion by interpreting religion literally and building straw man for religion, then setting it alight, burning it up. So where would that man put his religious intuition that the fountain had of meaning, that that was active within him? Where was he going to put that? He put that in the Superman, in the Ubermensch. Yeah. Which was his way to sort of pull transcendence downwards and squeeze it into a physical entity of some form that he called the secular Ubermensch, the man that transcends himself. And what is peculiar is that if you read Nietzsche's work, he never says what the superman is."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":5097.34,"end":5098.06,"speaker":"Jonathan Pageau","text":"Yeah, there."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":5098.06,"end":5174.77,"speaker":"Bernardo Kastrup","text":"There is one passage in which he characterizes it indirectly. Like he talks about man being the intermediary step between the ape and the superman, but he never says, here's what the superman is. He doesn't define the bloody thing. It is the central pillar of his late work and he doesn't define it and he goes mad. That's how he ends his days. Eleven years of madness, mental illness. And I think that microcosm, what played in the microcosm of Nietzsche is what is playing the macrocosm of humanity 150 years later. I just hope we don't go mad when we realize that we are failing to pull transcendence downwards and try to make it palpable. It's not in the nature of the thing to be that it is us who have to transcend ourselves. It doesn't make sense to pull transcendence into us. It's like pulling the word the world into the prison. No, it's not going to happen. You cannot pull the world into your prison cell. All you can do is break out. It's not going to work the other way around. It didn't work for Nietzsche, it's not going to work for us."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":5175.17,"end":5183.57,"speaker":"Jonathan Pageau","text":"Yeah. I think that if Nietzsche knew that the Ubermensch would be furries in the Metaverse, I think he might have changed his mind."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":5185.49,"end":5314.77,"speaker":"Mark","text":"In agreement with what you described there, Bernardo. Dr. Wayne Gashado. An Australian philosopher, he describes Nietzsche as an idea, maybe butcher what he says, but text is a lady makes it the reality, I suppose, replacing the reality for the map and falls into the same trap the other people that he's critiquing. And he sees him in line with, in some ways with Plato and a whole host of philosophers. Got an interest in history of philosophy, but just swung into my mind whenever you said that. And I also thought about the way Dr. Ian McGilchrist has kind of framed the modernity, writing about how the left hemisphere skill kind of thinking has come to dominate so much. And he mentioned that idea that reason in its properties is fine, but as the emissary is fine was terrible as a master. And I think Rabbi Jonathan Sacks sort of mentions then in his work similarly in some ways that science, properly understood, takes things apart to see how they work. But the religion so called brings things together to see what they mean, which I think both of your works demonstrate in a more profound sense than the kind of social construct of religion is the privatized little myth that we have going on in the west, predominantly, I suppose. And south park says you're going to have a bad time. So I'd love to know what are some of the ways you think this is manifesting itself at societal levels and in line with what Jonathan described as kind of secular liturgies. So I think even down to how we design our cities for cruder notions of things like functionality and add ever growing kind of car parks for our major corporations. Not that it's all bad, but I wonder about some of the problems when that's our maybe major only emphasis. And there's no center like in traditional kind of European cities, I suppose around the church or temples and things like that elsewhere in the world. Would you like to describe that? I suppose then going beyond our individual selves to cities, towns, how that abuses our relationship with the creation then."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":5315.17,"end":5480.61,"speaker":"Jonathan Pageau","text":"And so I mean, I think Mark, what you're saying, what's interesting, you can kind of see when we talk about this kind of breakdown and this idea of progress, but how it's actually manifesting itself in a breakdown. I think you pointed to the image of the city is a great example of how this works. And so there used to be the way that cities were understood was almost mythological. I talk about this in one of my podcasts. We have this universal history podcast where we talk about how the founding of cities was. Even when Constantine founded Constantinople, there was this sense in which there was an angel walking in front of him and he was walking with this standard that he planted at some point which would mark the limit of the city. And they asked him, and he said, well, I walked until the angels stopped, and then he basically planted the city. So all these cities have these mythological foundings, and then they end up being created in a fractal way. So the city itself usually has higher points of attention. And so medieval village is a great example. So the church would be in the center or in something which represented the center. Then there would be the steeple, would be the highest building in the church. You weren't allowed actually to build higher buildings. And so it would act as a kind of access of attention for all the people in the city, an axis of attention. And also a place that binds you, literally in the sense that you go there together and you celebrate the things. Your baptisms, marriages, all the things that bind societies at different levels were celebrated there. And then even during the day, the bells would ring, and then you would do the angelus or something similar where all people in the village would turn towards the center and then would. Would pray to participate in the existence of the city. And so the city itself was built like a being, like, was built in the way that you're a microcosm of the same thing, these centers of attention and the highest thing, which binds all the other aspects of you together. And so right now, the way that we build cities is so completely utilitarian that we. The cities barely exist except for random distribution of houses in space separated by highways and functional malls and functional places for entertainment. And this is leading to massive breakdown in terms of people not knowing their neighbors, people becoming isolated and ultimately falling into despair and not even realizing that the very space in which they live is participating in their despair with. You know, it's not the only thing, but it's definitely fueling the. The despair that they're feeling is living in this. This, like, amorphous grid of houses, you know, on. On the landscape."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":5480.85,"end":5532.95,"speaker":"Bernardo Kastrup","text":"Absolutely. I feel it every time I go to the U.S. i. I don't have it here because, you know, the Netherlands is a very small country. All the villages are old, in a sense. There are. There are no. I mean, there are new constructions, but they grow in rings around the old towns. And sometimes the old towns merge together to form a city. But every little neighborhood has that center, and that center has a church, a baker, a pharmacist, the doctor, and a bar and the grocery. The grocery store. So these five or six things are in every little neighborhood. And when I go to The US I feel very ungrounded because you hardly touch the ground unless you are indoors, because otherwise you are in a car."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":5533.19,"end":5536.39,"speaker":"Jonathan Pageau","text":"Yeah, from car to indoors. That's how it works."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":5536.71,"end":5590.11,"speaker":"Bernardo Kastrup","text":"Yeah. You hardly have pedestrian pathways that you can walk from one place to the other. And people hop into a car to go 100 meters. For us here, it's unthinkable, 100 meters. You don't get into a car to go 100 meters. And I feel like I'm, I don't know, floating in the air. There is no center. I have a very strange feeling in the US this is one of the big reasons. The other big reason is television commercials. I find them very alienating in the US can't relate to them at all. So I can tell you that from an outside perspective, mine, what you are saying is not theory. It's not conjecture. It's a very, very real, palpable lived reality."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":5590.83,"end":5726.9,"speaker":"Jonathan Pageau","text":"But it's interesting because I think that the scandal of America and in Canada we have the same problem, is leading to a type of consciousness of this problem. And so I have a good friend of mine, Andrew Gould, who's an architect, and he is now realizing this, and the architects around him are realizing this. And so they're forced to consciously, let's say, re. Engage with this pattern. So something which, let's say in the Middle Ages wasn't thought out. It was just. That's how the world works. You just do it. And so now we have to. I think that this is true about all the questions right now of participation, is that we somehow have, like, we bit the apple, right? We took the apple and now we can reintegrate the garden. But it's the cross, right? It's the cross which will make us reintegrate the garden. It'll be difficult, it's going to be painful. And ultimately we'll end with something which is fuller in the end. And this is maybe like in terms of the hope of this whole problem, is that the story seems to be always something like that. That seems to be the story of all the stories. And so there's a sense in which possibly the crisis we're going through, although it is horrible and frustrating that there is a hope that ultimately the reintegration which comes after will be fuller than the one that was before. And that's the. That's kind of like the only hope that I can. I can bring. When you read in the Book of Enoch, it's really. It's very powerful because it's talking about the flood in the book of Enoch. And it talks about how all this calamity is coming because of these, because of these demons, these giants that are there and that are eating the world, that are devouring everything and that are engaged in all these kind of perverted destruction of the world. But then it says that, okay, destruction's coming and then after that God will fill all things. And you think, interesting, like that this is something describing the flood. But there's a manner in which that seems to be the pattern and even the pattern of ourselves. Bernardo, you talked about how someone who experiences dissociation and then is able to heal that dissociation is maybe more than the person that was there before."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":5727.22,"end":5753.23,"speaker":"Bernardo Kastrup","text":"Yeah, yeah. You get a level higher of insight. It's like you are in a spiral. So it feels like you've gone back to the same place where you were before, but it's a level higher. As you go through the spire, you're always going a level higher, always coming back to the beginning, but always with an understanding of nuance, subtlety and perspective that wasn't there before. Even though you're again looking at from that same perspective."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":5753.47,"end":5815.6,"speaker":"Jonathan Pageau","text":"Yeah, that's. And so the image, the image of the entire story of the Bible, that's the way that I see it. And so we all, we often forget that the last image in scripture, the image of the New Jerusalem, of the heavenly Jerusalem, is the Garden of Eden. It's the tree of life and the water of Life. But then around the tree of life and the water of Life is now this glorious city. And so from the moment of innocence in the garden, and then a fall. And the fall bring about all these human activities, all this kind of human technology which is constantly leading us into little levels of distraction and thinking that power is going to solve our problems. All these problems happen and then ultimately in the end, there's a way in which it gets resolved in this kind of glorious city where the tree is in the center, the water is in the center, the lamb, the self sacrificial lamb is in the center, center. But then it, it makes the rest meaningful. It fills the rest with, with meaning. So it's at least a little bit of hope, you know. As we talk about this, can I."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":5815.6,"end":5855.67,"speaker":"Bernardo Kastrup","text":"Run an idea by you? It's something I've been thinking about. It's not worked out in my mind, but I wonder what, what you would, how you would react to it. We were talking about banality and ritual earlier on when we began this conversation, and I'm totally with you that we have to re. Ritualize life in order to come back in contact with its extra dimension of depth, meaning, and significance at the same time. And I don't know whether this is a dichotomy or a paradox. I don't know. But I also sense that the word spirituality is the worst thing that has ever happened to spirituality because it made it distinct from reality."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":5855.91,"end":5856.39,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":5856.39,"end":5906.76,"speaker":"Bernardo Kastrup","text":"And sometimes I think that if we use too romantic language to talk about real stuff, the bedrock of existence, if we talk about it in two romantic terms, we create a distance between ourselves and it, because we are moist, living beings. We go to the loo every day, even kings. And it doesn't smell good when that happens. And we have to eat stuff and kill stuff to eat. Even if you're a vegetarian, you're killing plants to eat. And, you know, the business of life is messy. There is. It's very bloody. There is a lot of suffering. And it's moist. It's warm, you know, it's not sleek marble statue, if you know what I mean."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":5906.92,"end":5908.68,"speaker":"Jonathan Pageau","text":"Yeah, no, I know exactly what you mean."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":5909,"end":5967,"speaker":"Bernardo Kastrup","text":"And sometimes I think the romanticized language creates this impression, impassable chasm between lived reality and the treasure buried at the end of the rainbow, if you know what I mean. And we do that in language. So is there something to say about trying to get a little bit rid of some of the romanticizing, talking about these things in more visceral terms? Yeah, you know, if we talk about enlightenment, I always go like, what the heck does that even mean? You know, this business of enlightenment. What does that even mean? But there is something I know, which is suddenly I became a lot more empathic, and it's a shit show because I suffer with the Ukrainians. I suffer with the mothers and fathers in Texas. I suffer with everybody, and it's a horror show. Is that what we call enlightenment?"}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":5967,"end":5967.32,"speaker":"Jonathan Pageau","text":"Maybe."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":5967.32,"end":5970.13,"speaker":"Bernardo Kastrup","text":"Maybe that's what it is. You see what I mean?"}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":5970.13,"end":5970.45,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":5970.45,"end":5987.53,"speaker":"Bernardo Kastrup","text":"Yeah. But I call it a shit show, not enlightenment. And I think there is something to be said about, you know, bringing the language down to our level a little bit so we can relate to this stuff as reality and not a romanticized something that is unachievable. I don't know."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":5987.53,"end":6062.2,"speaker":"Jonathan Pageau","text":"Yeah, no, I totally agree. And I. People who watch my videos will hear me often say something like, go to church. And what I mean by go to church is, yeah, that's why I don't talk. That's why go to church is the most boring. It sounds like the most boring thing you could say to someone. But I'M saying go to church, you go to church. But it could be other types of participation. You go to church, then it's messy. It's messy because, let's say something like church, there are people there that you would choose to be with, and there are people there that you would not choose to be with. And so all your buttons will be pressed. Everything about you will be challenged, you know, but nonetheless. So there's something dirty and moist and smelly about it, but it's all this dirty, moist, smelly stuff, which is trying to aim higher and, and transform these aspects of reality into something more. And so you kind of get in my, my estimation, through participation in the things that are immediate to us, like, for example, like your family. It's like, don't. Don't talk to me about enlightenment. If you're, if you alienated your kids and, you know, you hate your wife and like. Okay, I don't. Because you can see it, right? You see that these kind of spiritual type people, that their lives are completely in shambles, but they're doing yoga and they're having mystical experiences. Like."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":6062.2,"end":6063,"speaker":"Mark","text":"Okay, exactly."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":6063,"end":6085.1,"speaker":"Jonathan Pageau","text":"Yeah, there's something, there's something off about that. And so I think that engagement is probably better, you know, and so, like, so, so, for example, finding a confessor in the Orthodox Church, like having someone you have to. You go to, you confess to, it's. Sometimes they'll say the worst thing. Like your confessor sometimes will say the most damaging thing you could ever hear. But it's like, you have to kind of understand that that's the messiness of this community."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":6085.26,"end":6085.62,"speaker":"Bernardo Kastrup","text":"Right?"}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":6085.62,"end":6108.58,"speaker":"Jonathan Pageau","text":"That's the messiness of this communion as we kind of move and kind of move awkwardly, you know, towards deification, towards transformation. So that's at least the way that I try to. And I say that, but it's like, it's hard for me as much as anybody, because we have all this comfort. It's hard for me as much as anybody to, To. To do it. But I. Yeah, at least that's the way that I'm trying to deal with that stuff."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":6109.06,"end":6143.88,"speaker":"Bernardo Kastrup","text":"And some. I'm trying to really pin down what I, what I'm attempting to say and not really succeeding yet. That's why symbols are so important. But when I talk about romanticizing, there is a mushy quality to it, a kind of perfection to the goal. Like the summum bonum, like the saint, is purely good, and it's all about love and playing the harp on the clouds. It's. I don't think this is a helpful image, if you know what I mean."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":6143.88,"end":6164.39,"speaker":"Jonathan Pageau","text":"Yeah, but do you think that that's really. So it's like if you look at the Christian version of that, you end up with like martyrs and Saint Francis of Assisi, like who. It's poor and like people who live in the desert and are, you know, and so it's like St. Mary of Egypt that these are the images of our saints. They're not, they're not angels on clouds, like, you know, strumming hearts."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":6164.39,"end":6166.63,"speaker":"Bernardo Kastrup","text":"You miss the big one. The big one is Jesus's life."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":6166.71,"end":6169.35,"speaker":"Jonathan Pageau","text":"Yeah, of course. The life of Christ is the big one. Yeah."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":6169.43,"end":6194.52,"speaker":"Bernardo Kastrup","text":"That's the reality of the thing. That's the reality of service and a sort of giving upwards of yourself. But if you tell people, just go to church what they think is Rubens, Caribbean, with, you know, plump bottoms, playing their harp on clouds and it creates this notion. You see what I mean, what I'm saying?"}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":6194.52,"end":6197.36,"speaker":"Jonathan Pageau","text":"No, I know what you mean exactly. I totally understand what you mean."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":6197.36,"end":6222.58,"speaker":"Bernardo Kastrup","text":"This stuff is real. How do we help people understand that? This stuff is real. And it's so real. It's not under their noses, it's behind their noses. It's as close as anything can possibly be. It's so close, nobody sees it. And there's nothing romantic about it. It's tough stuff. Yeah. You see what I'm trying to get?"}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":6222.58,"end":6233.79,"speaker":"Jonathan Pageau","text":"No, I totally agree. You know, I think they like, but I think the image of the cross is in that case, that's, that's the best image and helping people remember what, what that is."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":6234.03,"end":6235.79,"speaker":"Bernardo Kastrup","text":"But we romanticized even that."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":6236.03,"end":6239.23,"speaker":"Jonathan Pageau","text":"Yeah, yeah. There's work to do, that's for sure."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":6239.79,"end":6269.94,"speaker":"Bernardo Kastrup","text":"When, when Jesus was in the, in the Gethsemane and, and he asked God to take that chalice away from him. How do you think most Christians understand that today? Oh, it was a moment of weakness. It was just the human Jesus that suddenly was there but then went away. No, no, it was not a moment. It's an ever present reality. Drinking from that chalice is tough stuff. It's tough to be a real Christian."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":6270.02,"end":6270.5,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":6270.5,"end":6274.94,"speaker":"Bernardo Kastrup","text":"If you know what I mean. No, I told, yeah, it's not that romantic thing."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":6274.94,"end":6288.98,"speaker":"Jonathan Pageau","text":"It's unbearable, actually. It's unbearable listening. But just reading the words of Christ is unbearable. It's, it's a, it's, it's, it's very difficult. That's why we, we read them. But we, we. It's hard to really read what Christ asks of us because it's really unbearable. I agree."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":6289.3,"end":6319.41,"speaker":"Bernardo Kastrup","text":"So the Challenge is how do we recover the ritual, the sacralization of this world, the installment of this world through ritual, without this trap of romanticizing and lyricizing it to a point where it becomes unattainable and becomes different from reality. It becomes spirituality. You see what I'm struggling with, I can't even describe the problem, let alone find a solution. That's the issue right now for me."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":6319.65,"end":6371.66,"speaker":"Jonathan Pageau","text":"Yeah, well, I mean, I think that in a proper kind of balanced Christian life, there's an aspect of the Christian life which is celebratory and that's important. But there's also an aspect of the Christian life which is penance and repentance, constant repentance. So if you take the prayers that you do every day seriously, it's like you're constantly seeing how you are missing the mark. And even unwillingly with, you know, when you're. You're constantly kind of in that moment of missing. And so those two extremes held in balance, I think are what make it bearable. Because if you just had one, then you have the romantic part, if you just have the other, then you would just, you would just collapse. We just collapsed under the weight of what it means. Right. And so I think that having those two, having those two in intention is probably the best."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":6372.06,"end":6427.42,"speaker":"Bernardo Kastrup","text":"But at the same time, occasionally I do go to church and it has partly to do with my self nurture and partly to do with some kind of anthropological project. See what's happening in the culture then there is a way in which, in which transcendence has become cartoonified. It has been turned into a cartoon. And one of the mechanisms I suspect are partly responsible for this is turning religion into a moral recipe alone. So a moral code is no longer a consequence of religion, religious insight, it now is religion. Yeah. And that's a way to cartoonify the whole thing. If you do the right thing, my son, you will have eternal life. That's a cartoonification of the whole thing. And to some extent it's been done by the church, this cartoonification. You see what I'm trying to."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":6427.42,"end":6428.38,"speaker":"Jonathan Pageau","text":"Oh, I totally agree."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":6428.38,"end":6430.42,"speaker":"Bernardo Kastrup","text":"And I'm waving my way here, but."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":6430.42,"end":6450.13,"speaker":"Jonathan Pageau","text":"No, no, I totally agree, but sadly I have to. I like I'm watching the time go by. I need to go because someone is waiting. But I would love to continue this conversation with you, Bernardo and Mark. Thanks for. Thanks for organizing this. It's always wonderful to talk to you as well. So I'm afraid I have to leave you."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":6450.37,"end":6450.93,"speaker":"Mark","text":"No problem."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":6450.93,"end":6452.61,"speaker":"Bernardo Kastrup","text":"It's a pleasure talking to you, Jonathan."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":6452.77,"end":6457.65,"speaker":"Jonathan Pageau","text":"All right. It was great to meet, to talk to both of you and Renato. Let's do this again."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":6457.73,"end":6460.93,"speaker":"Bernardo Kastrup","text":"Let's do this again. Maybe I can be more coherent next time."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":6461.01,"end":6470.02,"speaker":"Jonathan Pageau","text":"No, no, no, it's great. I know exactly what you're pointing to and so we can explore that. I'll also meditate on it in my own life, let's say. All right, bye, everybody."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":6470.02,"end":6471.9,"speaker":"Bernardo Kastrup","text":"Thanks, Jonathan. Take care."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":6472.14,"end":6481.82,"speaker":"Mark","text":"Actually, Bernardo. Yeah, thank you. Bernardo, did you ever see Terrence Malick's A Hidden Life about Franz Jagerstadter?"}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":6481.9,"end":6482.3,"speaker":"Bernardo Kastrup","text":"No."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":6482.46,"end":6511.88,"speaker":"Mark","text":"Oh, you must watch it. You know, just what you outlined there. It's about Franz Jagestadter in Austria during the Second World War when he refused to pledge an oath of allegiance to Hitler and the consequences. And it shows that kind of pristine pseudo Christianity versus his embodied living out the Christian way in this messy but very real and visceral form. So I think you'd love it. Yeah, it's a Brilliant movie."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":6512.2,"end":6513.48,"speaker":"Bernardo Kastrup","text":"Recent one 2019."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":6513.88,"end":6524.36,"speaker":"Mark","text":"Yeah, I think you would enjoy it. And more than just enjoy it, it actually is Terrence Malick's movies, I think are quite challenging and change your mindset."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":6524.36,"end":6529.36,"speaker":"Bernardo Kastrup","text":"And I watch it tonight. It's with Bruno Ganz, one of my favorite actors."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":6529.6,"end":6541.28,"speaker":"Mark","text":"Oh, brilliant. So I think that would actually help a little bit with your queries there about this kind of a neat Christianity versus the authentic thing."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":6541.52,"end":6552.41,"speaker":"Bernardo Kastrup","text":"Yeah, I watch it tonight. I'm supposed to go down, have dinner now and I probably put it on. If I can access it, I'm sure there will be a way for me to access. Access this."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":6552.57,"end":6555.29,"speaker":"Mark","text":"Yeah, you can get it on Amazon prime if you have Amazon."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":6555.29,"end":6556.01,"speaker":"Bernardo Kastrup","text":"Oh, I have it."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":6556.17,"end":6557.05,"speaker":"Mark","text":"Okie dokie."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":6557.77,"end":6561.29,"speaker":"Bernardo Kastrup","text":"I'll get it there. And thanks for the tip. I will watch it."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":6561.37,"end":6575.41,"speaker":"Mark","text":"Yeah, please let me know what you think. I hope you find it as moving as I did, but I would love say to whether you want to do a separate conversation with Jonathan or whether you want to come back on to my channel, I'd love to set that."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":6575.41,"end":6582.88,"speaker":"Bernardo Kastrup","text":"Up because let's do this again, like parts too. There is no need to change the recipe when it works, right?"}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":6583.52,"end":6586.56,"speaker":"Mark","text":"Yeah. Wonderful. God bless you, Bernardo. Have a lovely evening."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":6586.88,"end":6588.96,"speaker":"Bernardo Kastrup","text":"You too. Thanks for this, Mark. Take care."}
{"episode_id":"SW - #237 - 2022-06-15 - Bernardo Kastrup - The Priority of Mind","start":6588.96,"end":6651.01,"speaker":"Jonathan Pageau","text":"I hope you enjoyed this episode of the Symbolic World. The Symbolic World is based on a series of videos that you can find on my YouTube channel, Jonathan Pageau's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course, leaving a review on itunes. Everybody knows that's the best way to get the podcast out there to get it heard. And if you want to get involved, you can also support support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon the Pageot videos as well, and on subscribestar, all those links you can find on my website or in the show description. So thank you and I will see you soon."}
