{"episode_id":"SW - #025 - 2019-01-02 - Discussion with Paul Vanderklay - Jordan Peterson and Contemporary Christianity","start":0.4,"end":1.56,"speaker":"Jonathan Pageau","text":"I would like to welcome you to."}
{"episode_id":"SW - #025 - 2019-01-02 - Discussion with Paul Vanderklay - Jordan Peterson and Contemporary Christianity","start":1.56,"end":17.04,"speaker":"Jonathan Pageau","text":"The episode 25 of the Symbolic World podcast. On this episode, I will be playing for you a discussion that I had with Paul vanderkly on Jordan Peterson and let's say, his effect, his place in."}
{"episode_id":"SW - #025 - 2019-01-02 - Discussion with Paul Vanderklay - Jordan Peterson and Contemporary Christianity","start":17.04,"end":19.36,"speaker":"Jonathan Pageau","text":"The discussion around contemporary Christianity."}
{"episode_id":"SW - #025 - 2019-01-02 - Discussion with Paul Vanderklay - Jordan Peterson and Contemporary Christianity","start":19.36,"end":31.77,"speaker":"Jonathan Pageau","text":"Paul vanderkly is a pastor, a reformed pastor, and he's been putting out videos almost every day about Jordan Peterson, trying to interpret what he's doing. Intellectual dark web, really diving into those."}
{"episode_id":"SW - #025 - 2019-01-02 - Discussion with Paul Vanderklay - Jordan Peterson and Contemporary Christianity","start":31.77,"end":35.21,"speaker":"Jonathan Pageau","text":"Subjects and trying to see them through a Christian lens."}
{"episode_id":"SW - #025 - 2019-01-02 - Discussion with Paul Vanderklay - Jordan Peterson and Contemporary Christianity","start":35.21,"end":37.33,"speaker":"Jonathan Pageau","text":"And so I hope you enjoy this discussion."}
{"episode_id":"SW - #025 - 2019-01-02 - Discussion with Paul Vanderklay - Jordan Peterson and Contemporary Christianity","start":50.61,"end":54.29,"speaker":"Jonathan Pageau","text":"This is Jonathan Peugeot. Welcome to the Symbolic World."}
{"episode_id":"SW - #025 - 2019-01-02 - Discussion with Paul Vanderklay - Jordan Peterson and Contemporary Christianity","start":65.03,"end":71.67,"speaker":"Jonathan Pageau","text":"So, Paul, maybe you can give a quick introduction to who you are and where you are and what you're doing in life."}
{"episode_id":"SW - #025 - 2019-01-02 - Discussion with Paul Vanderklay - Jordan Peterson and Contemporary Christianity","start":72.55,"end":269.87,"speaker":"Paul Vander Klay","text":"Well, Jonathan, just, it's a pleasure to meet you. I've been following your videos and really enjoying them and this is all new to me. I'm a pastor in Sacramento, California. I've been a pastor here at this particular congregation for 20 years. I've been in the ministry for now about 27 years, but I'm also a third generation minister. So the church has always in a sense been our family business. And I got interested in Jordan Peterson in many of the same ways that everyone else seems to have. Actually, it was Rod Dreier's blog that I was reading quite regularly and he had made a comment about Peterson at one point. And so I kind of followed it up and said, oh, here's an academic in Toronto who's kind of stepping out of the herd. Isn't that interesting? And then I kind of, I didn't think about it much for a while and then I caught one of the videos of the protesters and what really struck me was how calm he was in the midst of the melee. And that impressed me. And then I thought, I want to hear more of what he has to say. And then I saw that he was doing these biblical series and he's selling out this concert hall in Toronto and I know I have some friends who pastor in Toronto and I thought, well, their churches are empty and this dude on a Tuesday night is back and people are paying to see it and people are traveling there to see it. I gotta listen to this. So then I start listening to it and I'm a little bit addictive and once I find something that's interesting, I can't let it go. And so then of course I listened to all the biblical series and I listened to Maps of Meaning and I listened to the Personalities course and then I started and I'd been blogging I've been blogging for a long, long time. And just a tiny, little obscure blog. I'm known in my denomination, but beyond it, not too much. And so I had written some blog posts about him, and that was just kind of fun. But then I was reading. I always point this up in my. In my videos. Neil Postman's Amusing Ourselves to Death. I was rereading that at the same point, and I thought, you know, there's something integral about Peterson and YouTube, this medium. And so if I'm going to engage his work, I really should maybe try and make a video. And I've been playing around with video a little bit. So I made a video, and then I made another video, and the second video just kind of took off. And I had had, like 15 subscribers for six years on my channel. And I wake up one day and I've got 300. I thought, well, that's weird. And then the next day I had, you know, 400 and 500. And by the time it hit 2000, I was thoroughly unnerved because I thought, I don't want this messing up my life. And then after a while, it kind of settled down, and so. And I kind of figured it out, and then it was cool. And this has been what I've been doing. But I do this because I am kind of a pit bull when I get an idea that interests me and I don't let the darn thing go. And I've just got to process it to death. And enough people are like, oh, do more. So, all right, I'll process it with the camera on."}
{"episode_id":"SW - #025 - 2019-01-02 - Discussion with Paul Vanderklay - Jordan Peterson and Contemporary Christianity","start":271.23,"end":295.63,"speaker":"Jonathan Pageau","text":"So maybe you can tell us. I mean, I have my own take on this, and maybe I'll go into a bit later, and I've talked about it a little bit in different talks, but maybe you can tell us why you think it's important to deal with what Jordan is saying to the world, especially coming from your own perspective as a pastor, why you think that what he's saying is important and why it's worth, as a pastor, getting involved in it and getting involved into the discussion."}
{"episode_id":"SW - #025 - 2019-01-02 - Discussion with Paul Vanderklay - Jordan Peterson and Contemporary Christianity","start":296.27,"end":394.37,"speaker":"Paul Vander Klay","text":"Well, one issue was clearly I began. So I put up my videos. And the next Sunday, in comes the guy who's been watching my videos and says, I've been watching your videos, and I've never been to church before. And so here I am, and he gives me this poster of Jordan Peterson. And it's, as a pastor, this is like, well, yeah, this is, you know, shoot. Churches do all kinds of how many cockamamie things to Meet new people. And here people are just offering themselves. And every the next week another guy comes in, and the next week another guy comes in. And so my church is kind of. So I asked my church, I says, what do you think of this? And they're. And they kind of look at me like, well, I don't know. I said, well, it's easier than vbs, so I'll keep doing it. Vacation Bible school. That's, you know. Yeah, churchy stuff. But when I listen to Peterson, part of the issue that I've thought about for a long time is that there's a real disconnect in the modern period between a lot of the stuff that you talk about in terms of the symbolic world of the Bible and the assumed world of regular people. And so actually, I've done a fair amount of teaching on this in some colleges, and friends of mine who are university professors will have me come in and talk about this, where everyone. I'll ask people, you know, is the world round or flat? Well, it's round. Well, how do you know that it's round? Well, I saw that picture from the moon. Well, now, actually, the Greeks figured this out a long time ago, but. So in other words, in the imaginary space of the world, you know, we're on a globe spinning through space, but in the biblical story, the world looks very different. And so what's the relationship?"}
{"episode_id":"SW - #025 - 2019-01-02 - Discussion with Paul Vanderklay - Jordan Peterson and Contemporary Christianity","start":394.37,"end":411.97,"speaker":"Jonathan Pageau","text":"That is the biblical story, our actual existing life, we don't live. We don't live on a round world that's floating in space or, you know, around the sun. We live on a world that has the ground down here and the sky up there, and that's our lived reality. So that's where the Bible. That's how the Bible talks about the world, because that's how we live."}
{"episode_id":"SW - #025 - 2019-01-02 - Discussion with Paul Vanderklay - Jordan Peterson and Contemporary Christianity","start":412.53,"end":482.19,"speaker":"Paul Vander Klay","text":"Exactly. And I think the disconnect in people as a pastor, that separates them from the Bible, and it separates them from God. And so when you start getting into pastoral issues, the Bible isn't terribly useful for them. And a lot of what's happened in biblical theology and in biblical studies over the last 200 years hasn't been useful at all. It's been partly useful. And so when I saw Peterson, I said, huh, this could be helpful. And so then I started. And the first thing I started when I started listening to Peterson was CS Lewis. And I thought, I want to have CS Lewis in on this conversation with Jordan Peterson. Now, CS Lewis died the year I was born, so what does that mean? But he wrote a lot, so that's where I'm going with my videos, but before. I've just started that process actually, but I needed to talk a lot before I could get there."}
{"episode_id":"SW - #025 - 2019-01-02 - Discussion with Paul Vanderklay - Jordan Peterson and Contemporary Christianity","start":482.51,"end":696.53,"speaker":"Jonathan Pageau","text":"Yeah, well, you know, it's funny because when I kind of discovered Orthodoxy in the west and I converted and everything, one of the things I discovered is that a lot of orthodox priests and people love CS Lewis and love Tolkien. They almost feel as if the kind of the medieval, the rediscovery of a medieval worldview that Lewis was trying to get people to see is what needs to happen today. And that's exactly what I think too is that we need to be able to rediscover the lived experience and help people to see that that has value. And once you see that, then a lot of the stories of the Bible, a lot of the problems in the stories of the Bible disappear. I mean, just recently I told a priest that, I said, you have problems with dragons. Okay, fine, but just interpret the word dragon in terms of phenomenology. The problem goes away. It just vanishes because it just means a monster that's kind of, that's on the, you know, on the edge of being. And so then you don't. It's gone. So the story of St. George is not a problem at all. Who cares what it act like? Let's say St. George killed some beast. Like it, it doesn't matter what it was in terms of its biological, you know, name. Even if you could give it its biological name, you're missing the point of the story, which is that it's a, it's a crazy thing that has, that's coming out from the pit and it has a mixture. I said, you know, maybe it was like a two headed, you know, crocodile with elephantitis or something. Like who cares what it was? It doesn't matter. Like it was a monster. You know, like there is no biological category for a two headed crocodile with elephantitis. You know, it just. And who has rabies at the same time or something? Like, who knows? Yeah. So that, so engaging with that has definitely been something that I've seen that has brought me close to Jordan is I never had, never thought about it in terms of science ever. I was actually quite hostile to. Not hostile, but let's say oppositional to science. I wrote an article a few years ago called Most of the Time the Earth is Flat. Yeah. And so it was trying to say like how much the scientific worldview had invaded our perceptions and how it was actually damaging to our understanding of traditional stories, but also our understanding of our daily life. How that how we don't live in that, in the, let's say, in the cosmos described by black holes and all these. We don't live in that world. It's an abstract world. But then when I heard Jordan and he talked about neuro, like neurology and the brain and this idea that were kind of built in a way that these patterns are physically built into our brain. And I mean, I had heard of Jung before and I've never been really interested in him and still I'm not that interested in him. But the idea that we're constructed that way, no matter how it is that we got there, like if evolution made us that way, it doesn't matter. That's how we're made. And that the stories that the Bible bring out and that traditional stories bring out the, are actually tapping in, are a kind of program that, that runs and, and they fine tune our perceptions to, to be aligned with that, that, that biological program. I was like, it really, that's, that's what made me kind of reach out to, to, to Jordan when I heard him, I heard him talk on the radio like a few years ago and I was like, oh, there's something interesting here that's worth exploring and it can be helpful for what I'm trying to do. And so, yeah, that's how it all started for me."}
{"episode_id":"SW - #025 - 2019-01-02 - Discussion with Paul Vanderklay - Jordan Peterson and Contemporary Christianity","start":697.87,"end":768.94,"speaker":"Paul Vander Klay","text":"And part of what I really appreciated about him very early on was he's a clinical psychologist with clinical practice. And so my father was a pastor in Patterson, New Jersey, a very distressed, very poor community in the 60s full of heroin crime. And that's where I grew up. And so I'd always known chaos and I had always been immersed in, you know, clinical psychologists sit in a room and people, maybe I'm being a little biased, people come in and meet them. But as a pastor, you're kind of immersed in it. You don't have the clear boundaries. And so, you know, when he's telling his stories about, you know, a guy who, you know, a guy who loves his dog and I mean, this has been my life, my whole life and including the church I pastor in now, I. And so when I hear, I heard these stories and then I saw his kind of his chaos order construct, I said, oh boy, that really works. And I can use that. Pastors are thieves. We're not only liars, we're also thieves. And when we find something that's useful, we grab it and we run with it."}
{"episode_id":"SW - #025 - 2019-01-02 - Discussion with Paul Vanderklay - Jordan Peterson and Contemporary Christianity","start":769.58,"end":848.67,"speaker":"Jonathan Pageau","text":"Well, one of the things, one of the things that is one of the things that really Attracted me. I mean, the word order and chaos is the word that he uses. You could use like in the church fathers, you get the notion of death. Like just the notion of death itself is really, is this idea of fragmentation and a kind of falling apart at the edge and the idea of Hades and all that. And so it was easy for me to map, to map like the order chaos paradigm that he was using onto the center periphery and like the order death image that's used in the Bible and in the church fathers. And then because I was already talking about that stuff before, I was talking about logos before too. That's why he called me, because I, I told him, I said, you have to listen to this talk I did where I'm talking about the logos and how the logos brings things together. And so, and he's just kind of answering these quick emails. And then finally he called me because he saw that, yeah, where does this come from? Like, I never heard, like I never thought other people were talking about this. And I was like, it's there, it's in the Father. It's like it's Christian. This is it. This is Christianity, you know, this is what Christianity is about. So, yeah, so that was interesting. So how has been, I'm going to ask you a big question. What has been the reaction of other pastors around you in terms of this? Because that's something that I've been having to deal with myself."}
{"episode_id":"SW - #025 - 2019-01-02 - Discussion with Paul Vanderklay - Jordan Peterson and Contemporary Christianity","start":848.91,"end":902.91,"speaker":"Paul Vander Klay","text":"Yeah, it's been mixed. So I'm a part of a denomination, it's about quarter of a million people. It's called the Christian Formed Church of North America. It was founded by Dutch immigrants and it's a pretty, it's got a very thick culture. And in some ways, some people argue it's a quasi extended family, sometimes literally, because it's an immigrant church and it's not as much as it was say 50 years ago. But so when I started talking about this, there's a Facebook group, a closed Facebook group just of CRC pastor. I started talking about this and a few pastors were very excited because they had also been secretly watching this stuff and they're like, oh, you too? And then other pastors, usually especially Canadian pastors, have been on both sides. Peterson had been getting a lot of bad press in Canada."}
{"episode_id":"SW - #025 - 2019-01-02 - Discussion with Paul Vanderklay - Jordan Peterson and Contemporary Christianity","start":903.07,"end":903.47,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #025 - 2019-01-02 - Discussion with Paul Vanderklay - Jordan Peterson and Contemporary Christianity","start":903.79,"end":988.89,"speaker":"Paul Vander Klay","text":"And this, I'm also quite interested in what I see as what is essentially a, the culture war, I think is essentially a Christian, is a Christian civil war. Because it's two sides of Christianity. You had the kind of the Cold War. You had the Cold War, civil religion. And now we have this ascendant morality, kind of probably neo Marxist civil religion that's supplanting the Cold War civil religion. And so, and these divisions are even within my denomination, which is a pretty conservative denomination. And so right away, when people hear someone talking about pronouns or. And I've never heard Jordan Peterson in everything. I've listened to him say a word against gay people or trans people, I've never heard that. But his disagreement with refusing to signal along these culture war tribal lines even impacts people's kind of low resolution take on him. So boom, you shouldn't be listening to him, you shouldn't be talking about him. And then the association with Jung doesn't help because most people don't know anything about Jung, but what they do know."}
{"episode_id":"SW - #025 - 2019-01-02 - Discussion with Paul Vanderklay - Jordan Peterson and Contemporary Christianity","start":989.13,"end":989.53,"speaker":"Jonathan Pageau","text":"Is."}
{"episode_id":"SW - #025 - 2019-01-02 - Discussion with Paul Vanderklay - Jordan Peterson and Contemporary Christianity","start":991.69,"end":1037.33,"speaker":"Paul Vander Klay","text":"Some vague connection with the occult or with New Age movements. So once Jung's name comes up or a whole bunch of people just check out. But some pastors, I've been around a long time in the Christian Formed church. My father and grandfather were pastors in this denomination. So in a sense I'm a known quantity and I'm kind of known for kind of being on the left side of the denomination. And I pastor a church that is at least half African American. So I get a pass. People don't suspect me of being a racist, so they can't charge me with that. And then I talk about Peterson and then I just play the missional card on him. I say, hey, you know, there are thousands of people out there who are interested in following the Bible."}
{"episode_id":"SW - #025 - 2019-01-02 - Discussion with Paul Vanderklay - Jordan Peterson and Contemporary Christianity","start":1039.57,"end":1041.33,"speaker":"Jonathan Pageau","text":"Where are you to talk to those people?"}
{"episode_id":"SW - #025 - 2019-01-02 - Discussion with Paul Vanderklay - Jordan Peterson and Contemporary Christianity","start":1041.73,"end":1066.75,"speaker":"Paul Vander Klay","text":"Yeah, you know, this is my job. And so, you know, so I, And I'm also at a point in my career, you know, I'm 54. I, you know, where am I going to go from here? So I say what I want. I've always said what I wanted. So when I started doing this, some of my friends who know me just said, oh, well, you're doing what you always do. You're just doing it on YouTube. That's pretty much true."}
{"episode_id":"SW - #025 - 2019-01-02 - Discussion with Paul Vanderklay - Jordan Peterson and Contemporary Christianity","start":1068.03,"end":1212.18,"speaker":"Jonathan Pageau","text":"Yeah. I've had to deal with. It's been very weird because at first my relationship with Jordan was very. It was just. I was friends with him. And then we did this video, the Crazy Metaphysics of Pepe video on his channel. And that kind of exploded. That was very, that was weird, weird, weird. And then, yeah, and then recently I had a very, very. Some strange events where some clergy that I was actually quite close to just told me that they had to disassociate themselves with me publicly. They said, because you're an extreme right wing guy. I was like, what? Like, you're almost a fascist. And I was like, where? What? Like, where in the heavens could you get. And it was really. I think it's really just that somehow, somehow they heard something about Durin being alt right or being whatever or something. And then they had this. So they decided that to put me kind of next to him. And so I. We need to disassociate with you because of that. And even the idea of disassociating yourself with someone and not being willing to engage in a discussion with someone because there's someone, mate, they somehow make you less pure or something, something like that, that's very, that's very disturbing to me. And it. I have, I had never had to deal with that. And, and now I had to ask myself questions about that, about that itself, about, you know, oh, so if I speak to you now, I'm like, crypto Protestant, like, is that what it is? And, and, and I thought, I don't know. It doesn't seem like that's what Christ was doing. He was, you know, he was talking and he was calling out people when they needed to be called out. But he was also. Even the Pharisees. Like, he said to the Pharisees, you're hypocrites. But then he also said, you know, the Pharisees are sitting in the seat of Moses. You know, like, what they're saying is, fine, they're just hypocrites. And so it's. So I just thought, okay, yeah, I'm just not, I'm just gonna keep going. I'm not going to. People were asking me, like, why don't you denounce this? Why don't you denounce that? That Jordan saying, why don't you denounce this? Like, disassociate yourself? And I, and, but. And then you, then you fall. Like, I tweeted, I think you saw that I tweeted something about how I never, never cited Jung before. And after that I was like, I shouldn't have done that. Like, I'm just, you know, it's like, it's true that I'm not interested in Jung, but it's like I'm, you know, I'm giving them, I'm making, making people happy that, oh, now he's disassociating himself with. It's weird that you have to ask yourself these questions all of a sudden."}
{"episode_id":"SW - #025 - 2019-01-02 - Discussion with Paul Vanderklay - Jordan Peterson and Contemporary Christianity","start":1212.5,"end":1377.96,"speaker":"Paul Vander Klay","text":"Well, and I think, I think we're all getting an education in dealing with, dealing with this kind of context. And one of the things that you learn is self defense is really hard and often counterproductive because people are going to think what they're going to think, and the best thing you can do is do what you know you should do. And again, I really appreciate Peterson's emphasis on this. So one of the things that happened immediately after that, so I had these people starting to come to my church. And then as a pastor, I always have an outstanding. I said, if you're a visitor to my church, I will take you out to lunch because I want to hear your story. And so then I'd start talking to people who've been interested in Peterson. And he's had a remarkable impact on a lot of people's lives and for the better. And not just for the better in terms of a Christian sense, but they want to be better fathers, they want to love their wives better, they want to be more responsible, they want to keep their commitments, they want to tell the truth. And it's like, I don't care where you're from, this is basic. And so this is what you're criticizing this guy for. I mean, oh, okay, well, what's your agenda? I actually appreciated your tweet about Jung because it, you know, when I try and kind of locate all of this, I mean, part of what's beautiful about the Eastern, about the Orthodox Church, and now it's. I read an article a few years ago that talked about how, I mean, this church was in some ways kind of weakened and fragmented throughout, you know, the part of the Christian world that really took hits with Islam. But when, as I've seen this church coming to America, it's become less ethnocentric and I think in some ways unleashed. And so what this has meant, especially for people whose traditions come from the west and the Latin root, now suddenly we're getting reintroduced to the riches that the Latin Church didn't have access to. And I think ironically, you know, America and the United States has always been a place that intensified both. Intensified religion, but also forced it to be trans cultural. And so I, you know, I'm fascinated by what's happening with the, with the Orthodox Church here."}
{"episode_id":"SW - #025 - 2019-01-02 - Discussion with Paul Vanderklay - Jordan Peterson and Contemporary Christianity","start":1377.96,"end":1487.03,"speaker":"Jonathan Pageau","text":"Well, we hope so. I think that, I think that is definitely, when you're on the inside, it feels like a war sometimes. Because, of course, the ethnic question is the big question in terms of the structure of the Orthodox Church. In theory, there should be one Orthodox Church in one place. So let's say there's a city, there should be one bishop and there should be priests, and that's how it should go, but that's not how it is. So every ethnic church has kind of preserved their own churches in the country. And so I would say that that, in a way, is the weakest testimony of Orthodoxy in terms of. Of its presence in the US but at the same time, there's been some considerable efforts from the part of the Russian, coming from the Russian tradition and coming from the Antiochian tradition, let's say, to really open up and to talk about the church fathers and to try to talk in a way that Westerners can understand and to use a language that is maybe more accessible to people and to also open up their churches and make them accessible for people. Because if, you know, you go to the. If you go to, like a really kind of strict Greek parish like you, you'll go in there and it's like you're in another planet. You don't. You don't know what to do. You don't where to stand. You don't know where to look like, you know, people are doing things and they're speaking in another language. But at least at the oca, the Orthodox Church of America, which I'm part of, and the Antiochian parishes, especially in the United States, they have. They have mostly in English, sometimes with a little bit of Russian or a little bit of Arabic to kind of, you know, to connect to where they come from. But in general, it's quite accessible. Like, my parish is French. It's the only. Maybe not the only by now, but it's like it's one of maybe two or three French parishes in all of North America. Really?"}
{"episode_id":"SW - #025 - 2019-01-02 - Discussion with Paul Vanderklay - Jordan Peterson and Contemporary Christianity","start":1487.99,"end":1491.43,"speaker":"Paul Vander Klay","text":"That's fascinating. Yeah, that's fascinating."}
{"episode_id":"SW - #025 - 2019-01-02 - Discussion with Paul Vanderklay - Jordan Peterson and Contemporary Christianity","start":1491.75,"end":1505.77,"speaker":"Jonathan Pageau","text":"Yeah. So we get. I mean, we get our translations from France and stuff, but it's kind of interesting. My parish is very small. We have maybe on a good Sunday, there's like 20 people. It's like this miniature, miniature parish."}
{"episode_id":"SW - #025 - 2019-01-02 - Discussion with Paul Vanderklay - Jordan Peterson and Contemporary Christianity","start":1508.17,"end":1569.97,"speaker":"Paul Vander Klay","text":"God loves small churches, and if he didn't, there wouldn't be so many of them. So I was before. Before I was in Sacramento, I was in the Dominican Republic, and I worked with Haitians who were illegal, mostly cutting sugar cane and picking coffee in the southwestern part of the country. And most of those churches, to be a church, you needed 10 baptized members. And at any given time, two or three of them were under discipline. And, you know, and so up dotted in the hills and in the sugarcane communities. I mean, they're all these tiny little churches of 5, 10, 15, 20, people, but, you know, God and quirky and odd and wrong and, you know, all kinds of problems all over the place. But I am convinced that God just loves these little huddled groups and my congregation too. You know, on a Sunday morning, there's 50 or 60 or 75 souls here, but I wouldn't have it any other way. I love it."}
{"episode_id":"SW - #025 - 2019-01-02 - Discussion with Paul Vanderklay - Jordan Peterson and Contemporary Christianity","start":1570.45,"end":1575.57,"speaker":"Jonathan Pageau","text":"Yeah, that's great. That's great. I lived. You know, it's funny, I lived in. I don't know if, you know, I lived in Africa for seven years."}
{"episode_id":"SW - #025 - 2019-01-02 - Discussion with Paul Vanderklay - Jordan Peterson and Contemporary Christianity","start":1575.94,"end":1576.62,"speaker":"Paul Vander Klay","text":"No, I didn't know that."}
{"episode_id":"SW - #025 - 2019-01-02 - Discussion with Paul Vanderklay - Jordan Peterson and Contemporary Christianity","start":1576.62,"end":1742.55,"speaker":"Jonathan Pageau","text":"Yeah. Before kind of doing this icon carving, I was in Congo for four years and in Kenya for three years. And in Congo, I really got, like, the extreme version of that small church where we lived, because the organization I was with, we really lived in local neighborhoods. So we didn't live in, like, white enclaves. We lived, like, really with the local people. And the first house where we stayed, the neighbors to the left, they had a church. And then the neighbors, two streets, two. Two houses to the right had a church. And the neighbors on the diagonal from us, they had a church. And there was like. There was another church which was a little further down the street. Like, I didn't know exactly where it was, but it was like a little further down the street. And they would. And they. And they. And they would, like, they would pray, like, pray all the time. And like, with, like, loudspeakers. They love the loudspeakers. So we would have. Sometimes we'd have like three churches going at the same time, you know, at like 10 o' clock at night, you know, on a Wednesday. And you were just sitting there in your house and it's like, you think, wow, like, this is what it means to another culture. Like, seriously, like, you just. You can't believe what's happening. And. Yeah, so that was. I was a really, like a. Yeah, it was a shocker to kind of plunge into that world of like all these little churches everywhere. It was amazing, though. One time there was a pastor, like, the pastor next door on the left, he was going and going and going and going for like three hours with the microphone. And I thought, oh, what is happening? Like, you know, you think that you wouldn't get tired of hearing the name of Jesus, but you do. It's possible. It's possible for that to happen. And so at some point I was like, what is happening? So I go out and I go to see my neighbor to, like, see, like, what is this? And I walk in and it's just him with One boy, and he's just like. He's going and going and going. And I thought, wow. You know, it's like we go to church on Sunday morning, you know, and sometimes I don't go because it's too long, too much traffic, it's down in the city, and, like, I don't make it all the time. And I think it's like, wow, you know, in Africa especially, people are so spiritual. It's like it just takes up their whole life so much that me as a Westerner, like, I get tired of it. Like. Like, can you stop praying, please? I'm tired of it. And I have to slap myself and say, did you. Can you hear your thoughts right now? Like, you're actually criticizing someone for being totally immersed and in their. And anyways, so that's my little Africa. That's kind of totally off the track there. That's my little Africa story."}
{"episode_id":"SW - #025 - 2019-01-02 - Discussion with Paul Vanderklay - Jordan Peterson and Contemporary Christianity","start":1743.75,"end":1792.72,"speaker":"Paul Vander Klay","text":"Anybody who's done that kind of work, you just get so many stories. I'll often tell people, if you're looking for something to do right out of college, go overseas and live in a poor community for five or 10 years or something, you will learn more in that process than you can possibly imagine. And I think actually that I don't think it's accidental that these third culture experiences in some ways connect with what Peterson is doing. And I think especially with respect to your symbolism, because it forces you to think in other ways and have respect for other cultures and not simply be reactive, dismissive, which is."}
{"episode_id":"SW - #025 - 2019-01-02 - Discussion with Paul Vanderklay - Jordan Peterson and Contemporary Christianity","start":1794.32,"end":1938.28,"speaker":"Jonathan Pageau","text":"Or either dismissive or seduce. Like, people either dismiss other cultures or think that other cultures are just the most amazing thing that ever happened. One of the most amazing in terms of symbolism, one of the most amazing experiences that I had was in Congo. I was working with artisans, and we were designing products that were being sold locally but also sold internationally. So kind of helping them jive with what the international market wants and then design products based on that. And one of the experiences I had was I met a son of the. Of a. Of a tribal king, of the Kuba king. And the Kuba, they have these amazing patterns. They have these geometric patterns that they use on cloth and in carving and everything. And it's a really elaborate symbol system. And when I saw it, I thought, this is more than just geometric patterns. Like, there is definitely something meaning happening in these patterns. And so I interviewed him for hours and hours and hours. We recorded the interview, and he was explaining the symbol, the geometric patterns. And each geometric pattern had a story that was related to it. And then that pattern was used only in certain instances, let's say, on certain. For certain things. And so all of a sudden I had this amazing vision into like a proto, really a symbolic language. Like a full on fully developed symbolic language of geometric relationships. And it was really related to the symbol. It was almost like the symbols were kind of like abstract images, and depending on what was happening in the symbol, it actually meant something. And that was one of the things that it was weird because discovering traditional African art, it really bolstered my desire to make traditional Christian art because I was seeing this amazing language. And obviously I'm not going to come back here and make African art. That would be absolutely absurd. It's like coming back to Canada and then saying, no, I'm going to plunge into the history of Christian art and see if I can find those same patterns there. And obviously I had already kind of seen that they were there. So it was just natural that I would go from, let's say, living in Africa, then coming here and doing what I'm doing now. It seems very weird, but in the end, it's actually quite natural that that happened that way."}
{"episode_id":"SW - #025 - 2019-01-02 - Discussion with Paul Vanderklay - Jordan Peterson and Contemporary Christianity","start":1939.24,"end":1981.41,"speaker":"Paul Vander Klay","text":"It makes sense. It makes sense. And for me, to the. The. The way that culture. So, for example, the Haitians I'm working with, many of whom had been Christians already, but through successive waves of often American influence. But of course, the Roman Catholics had gotten there first. So then you have all of this, all of these ideas all mixed together along with ideas. You know, they're Haitian, so their voodoo comes from western Africa. And you just have all these layers of this, and this then gets manifest. So one of the things that often happened, we'd have these baptisms. Well, you get missionary stories. Here we go."}
{"episode_id":"SW - #025 - 2019-01-02 - Discussion with Paul Vanderklay - Jordan Peterson and Contemporary Christianity","start":1983.49,"end":1985.17,"speaker":"Jonathan Pageau","text":"I'm totally off track now, but it's good."}
{"episode_id":"SW - #025 - 2019-01-02 - Discussion with Paul Vanderklay - Jordan Peterson and Contemporary Christianity","start":1985.65,"end":2102.84,"speaker":"Paul Vander Klay","text":"We'd have these baptisms and I should. You know, you get these pictures of all these people dressed in white, and you're coming down the river, you think, okay, this is kind of an American Baptist thing. And then they go into the water. And because I'm way out, I'm way out there in terms of where we're at, we're a long ways from the capital, and you take the person for baptism and you put him in the water. But now for Haitians, there's spirits in the water. And this kind of connects in with the ancient Christian connection between baptism and exorcisms and cleansing the spirits of the body. So the pastor puts the person they're baptizing into the water, and then there's battle and then the person starts to thrash, and then the pastor grabs them and puts them in again, and they're still thrashing. The pastor just keeps putting them in until finally they surrender. And so what happens sometimes is some missionaries or even some pastors from the capitol had come and they'd look at this and they'd, oh, you know, this is horrible. This is wrong. And I was always of the sense of, no, this is theology manifesting itself, as Peterson talks about in drama. This is theology manifesting itself in drama. It's not a pretend drama for them that, you know, this is. What's happening in baptism is that, you know, old Adam is being drowned. That's one way to say it. Or, you know, that the spirits that have been inhabiting this person are being drowned and cast out. And so I always looked at this practice, which I think developed completely naturally in this context with all the successive layers of culture, and said, well, this is. This is the gospel working itself through all of this culture. And also on the metaphysical level, too, because I don't think. I think it's hard to live in a context like that and walk away a materialist. Just see too much stuff."}
{"episode_id":"SW - #025 - 2019-01-02 - Discussion with Paul Vanderklay - Jordan Peterson and Contemporary Christianity","start":2102.84,"end":2245.53,"speaker":"Jonathan Pageau","text":"Yeah. And it's interesting because that is really, let's say, the ancient way where we still, in our church, when there's a baptism, before the baptism, there's an exorcism the person, and then not only an exorcism of the person, but there's also like a chasing of the. Of the dragons from the water, like in the prayer. It's like one of my favorite services. And even during theophany, too, like during the feast of the baptism of Christ, we talk about, like, these dragons that are hiding in the deep waters. And so, like, we cast out these dragons from the deep waters. And so, yeah, for me, that's why. I mean, coming back to Jordan, when he kind of talked about, you know, that these idea of chaos and the dragon at the. At the bottom of the. Let's say, of the deep and all that, it just made total sense because it's still really part of our worldview. And it's there in the Bible. It's there, too. The whole idea of the splitting of the waters and then the idea of Jonah going down into the waters, all these images of going down into water all have to do with this, is going down into death, is going down into chaos, all the way up to St. Peter, who goes down in the water and Christ pulls him out. It's like there's this thread of water Which I'll probably make a video about it. I did, though. I talked about theophany in one of my videos, kind of explaining that thread that goes in to that. But definitely, I think that the west, like, or the modern world, I would say the west, but really it's the modern world. The modern world has lost the capacity to see those natural connections that are so intuitive to us. Right. They're just so natural. We actually have to fight to stop them from coming up. But once you've kind of fought them, then they're not there. They still appear. It's like the reason why people play video games is because they can inhabit that world like that. The world of video games is basically made. It's basically a traditional world with the whole structure of video games is. Is usually like some monsters kind of like dark under. Under something. And then the. And, you know, the world, this world is flat and there's a map and the edge of it is kind of chaotic. And so it's always that world is so deep in us that if you make our world a ball that floats up around the sun, we're going to make a world for people to flee from that abstract world and go. Go live in it."}
{"episode_id":"SW - #025 - 2019-01-02 - Discussion with Paul Vanderklay - Jordan Peterson and Contemporary Christianity","start":2245.93,"end":2298.18,"speaker":"Paul Vander Klay","text":"That's right. That's right. That's right. And so part of where. So when I was in seminary, for example, the work of Robert Alter, who's a Jewish scholar in Berkeley, was really kind of hitting its stride. And what Alter did was kind of change the conversation, which had been focused on this grammatical, historical, scientistic tradition of biblical interpretation. Said, now, wait a minute, there's intentional structure within this literature. And that then became kind of a half step to say. So that for me, I stopped. A lot of the commentaries that had been written were just completely useless as a pastor because nobody cares how many different documents there were behind the Old Testament. Nobody cares."}
{"episode_id":"SW - #025 - 2019-01-02 - Discussion with Paul Vanderklay - Jordan Peterson and Contemporary Christianity","start":2299.12,"end":2323.84,"speaker":"Jonathan Pageau","text":"These new Bibles, these new Bibles are death for church. Like the Bibles with like the texts that are kind of like not really in the text or that have a different. Different. Because it's like, this is an addendum and there's all these quotes. I know this was part of this text. And this. It's like, oh, man. Those are like, why would you use a Bible like that in church? Like, use it to study. But in church you want something you can read, right? You want an oral, like something you can participate in."}
{"episode_id":"SW - #025 - 2019-01-02 - Discussion with Paul Vanderklay - Jordan Peterson and Contemporary Christianity","start":2324.43,"end":2413.93,"speaker":"Paul Vander Klay","text":"That's right. And fortunately. So the Christian Reformed Church was kind of in the Netherlands, a breakaway from a modernistic church. And so part of the blessing of some of these rather even biblicistic traditions say, even maintaining the King James, which is an interesting translation. I don't personally use it a lot, but at least within those realms, for example, as a child, what did I learn? I learned Bible stories. And you get enough of these Bible stories and you now modernists, all these are. Well, you don't want to tell children these stories. It's like, no, you don't understand what a child is. I remember at our church early on, one of the mothers wanted to outlaw sticks because the boys were making swords. And it's like, they're boys, you know, if you take away. So we don't want to give them guns. Well, guess what? You're going to cut off their fingers. I mean, this is how we are. So leave the kids alone. And, yeah, they're gonna get poked and stuff, but for the most part, we'll all get through. And the Bible is like that. It's this enormous playground. And so a lot of what I discovered over the years, just doing basic pastoral work, and because I have to preach every week from the Bible, doing all this Bible study, I began to see these connections and say, hey, wait a minute. Something's going on here that we didn't talk a lot about at seminary. Why not?"}
{"episode_id":"SW - #025 - 2019-01-02 - Discussion with Paul Vanderklay - Jordan Peterson and Contemporary Christianity","start":2414.49,"end":2469.7,"speaker":"Jonathan Pageau","text":"Before seeing Jordan, you had already started to see or you already had some. Some insight into the fact that the. The Bible stories function in these. In these. These patterns like that there. That there are patterns that run through and go all the way to. To the end, basically. Okay, well, it's interesting. I grew up. I grew up in a Protestant church, and like, there was gonna. There was gonna be none of that where I grew up. I remember I have this crazy story of someone I love dearly who was told that the word snake in that. It says that the snake was crafty, right in Genesis or that was wise or something. And he learned that the word meant that it was naked. And it was like he was getting a hammer on his head, like he was getting. His whole world was being shattered. And he said, well, does that mean that we need to give a spiritual meaning to the story in Genesis? I was like, what?"}
{"episode_id":"SW - #025 - 2019-01-02 - Discussion with Paul Vanderklay - Jordan Peterson and Contemporary Christianity","start":2471.22,"end":2471.78,"speaker":"Paul Vander Klay","text":"I was like."}
{"episode_id":"SW - #025 - 2019-01-02 - Discussion with Paul Vanderklay - Jordan Peterson and Contemporary Christianity","start":2471.78,"end":2484.74,"speaker":"Jonathan Pageau","text":"I was like 19 years old, and already I was like, you mean you don't. You don't see. Like, you don't see that it's a story? Like, even if you. Even if you believe in it literally, still it has spiritual meaning, I hope. Or else, like, what is it for? Like, who cares about it?"}
{"episode_id":"SW - #025 - 2019-01-02 - Discussion with Paul Vanderklay - Jordan Peterson and Contemporary Christianity","start":2486.1,"end":2600.9,"speaker":"Paul Vander Klay","text":"And I think, you know, Also, what. What I think a missing piece is if you. I don't know if you're familiar with a. Another Protestant named Eugene Peterson. Another Peterson. He's very big in the Protestant world. He was a PC USA pastor. He's retired now. But one of the real issues the church has to figure out in this secular frame is what does the word spiritual mean? Because it has so many current meanings that we're not paying any attention to. And this is part of the. This is part of. So I started listening to Peterson, and I'm thinking, all right, well, what do you mean by that? And archetypes. All right, well, what do you mean by that? And so actually, a lot of what I've had to do in the last few months is to try to kind of nail things down and figure out Peterson's vocabulary, because he's using terms that in different contexts mean different things. And so then it's really important because, as he keeps telling us, I'm very intentional about my words. He keeps saying that. And he's right. He is. And so some of these skills that I use in terms of grammatical interpretation I kind of apply to Peterson. And I track down all these little videotapes and say, okay, he's using it here in this context, and he's using it there in that context. What does he mean by being. And now in some recent videos, he's talking more about metaphysics, which is very interesting. And so. Okay, well. And I think it's very interesting to me why certain things come up and why everybody almost always focuses right down in on the resurrection, because that's where the resurrection is, one of these points where all of the streams come together, just like the crucifixion."}
{"episode_id":"SW - #025 - 2019-01-02 - Discussion with Paul Vanderklay - Jordan Peterson and Contemporary Christianity","start":2600.9,"end":2601.34,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #025 - 2019-01-02 - Discussion with Paul Vanderklay - Jordan Peterson and Contemporary Christianity","start":2601.34,"end":2615.66,"speaker":"Paul Vander Klay","text":"And so, yeah, everyone's drawn to this point, say, well, what do you think about the Resurrection? And then he, you know, furls his brow. And I don't like answering these questions. And, you know, because he's. And he says, I'm not smart enough to figure it out. And so maybe in three years I'll know. And so."}
{"episode_id":"SW - #025 - 2019-01-02 - Discussion with Paul Vanderklay - Jordan Peterson and Contemporary Christianity","start":2616.14,"end":2744.82,"speaker":"Jonathan Pageau","text":"But I think one of the things about the Resurrection, which is important to say, and I think that. I think that Christians overestimate their capacity to understand what the resurrection is. Definitely. You know, and so I think that if you look in the text and you read what's actually. What it actually says, it's not at all obvious what in terms of phenomena the resurrection is. I mean, Christ hides in his own resurrection. You know, he appears, and the disciples don't recognize him. And then finally they recognize him. And they recognize him because he does a certain thing. And so it's made in the text itself. It wants to take away the simplicity of thinking that the resurrection just needed a dead corpse sitting up and walking out. There's something else happening. And the idea of what it means for his body to be glorified, what all these things mean, it's not at all simple. And then if you add what St. Paul says about the resurrection and he talks about spiritual bodies, and he talks like, what exactly do you even know what, what, what exactly is a spiritual body? It's like, it seems like that's a total contradiction in terms. And so if he's using an aporia to talk about something, something which is. Can't you. That's like either, either spiritual or it's a body. If it's a spiritual body, then he's, he's, he's definitely creating a category that transcends other categories or a category that, that is beyond our capacity to understand it. And so I think that one of the reasons why people have. One of the reasons why people have been hounding me, they've been hounding me about the resurrection too. Like, what do you think? And I'm like, okay, well, I think the resurrection is an event. I definitely believe that. And I believe it's an event that happened. But if you think that you can contain that event in your cat, in your little definitions, then you're as much, I would even say you're as much a heretic as the person who denies it. No, it's like that resurrected body is not at all an obvious thing to understand."}
{"episode_id":"SW - #025 - 2019-01-02 - Discussion with Paul Vanderklay - Jordan Peterson and Contemporary Christianity","start":2746.58,"end":2816.01,"speaker":"Paul Vander Klay","text":"Well, and I think that's exactly right. So N.T. wright has written about, as N.T. wright writes more than anyone can read, I think. But he's written about as much on this as anyone. And the point he keeps making again and again is that all of these texts seem to bear testimony not of a group of people arranging their stories to fix, to somehow develop a theological point, but they bear witness to events that they couldn't comprehend. And so what the New Testament spends its time doing. And actually, I think one of my favorite books in the New Testament is the Book of Revelation, because I think essentially the Book of Revelation is an attempt to update the Old Testament prophetic books with the new revelation of Jesus Christ. And in many ways, the only terms, the best tools they had at hand were symbolic tools in an attempt to represent the events that they're trying to come to terms with. And so then again, I listen To. So this is where, you know, this is all stuff that I knew and think about and work on and all this."}
{"episode_id":"SW - #025 - 2019-01-02 - Discussion with Paul Vanderklay - Jordan Peterson and Contemporary Christianity","start":2816.01,"end":2816.15,"speaker":"Jonathan Pageau","text":"So."}
{"episode_id":"SW - #025 - 2019-01-02 - Discussion with Paul Vanderklay - Jordan Peterson and Contemporary Christianity","start":2816.22,"end":2894.85,"speaker":"Paul Vander Klay","text":"And then I listen to Peterson and I hear him talking about this psychological. You know, this psychological process by which we come to create symbols and how these symbols get refined over time and eventually inscripturated. And, you know, and then I began to say, huh, this is really useful. Not as, in a sense, explaining away the Bible or Christian belief or traditional Christianity, but I think actually in terms of saying, here is. We don't know the process, but here is a plausible way we can understand why the Bible has the shape it has and why it's enduring, why it's had this enduring power transculturally throughout time, why you can't shake this book and why you can't shake these images. And so when you get to the Book of Revelation, one of the things that you recognize is that, at least in Protestant hymnody, so much of our hymnody comes from the Book of Revelation because it is just so rich. But we're all children before some great thing that we can't possibly understand."}
{"episode_id":"SW - #025 - 2019-01-02 - Discussion with Paul Vanderklay - Jordan Peterson and Contemporary Christianity","start":2895.17,"end":2906.16,"speaker":"Jonathan Pageau","text":"Well, if you look at. In the Orthodox Church, we never quote the Book of Revelation. We never. There's no readings of the Book of Revelations in the liturgy. Okay?"}
{"episode_id":"SW - #025 - 2019-01-02 - Discussion with Paul Vanderklay - Jordan Peterson and Contemporary Christianity","start":2906.16,"end":2906.56,"speaker":"Paul Vander Klay","text":"Really?"}
{"episode_id":"SW - #025 - 2019-01-02 - Discussion with Paul Vanderklay - Jordan Peterson and Contemporary Christianity","start":2906.64,"end":2920.16,"speaker":"Jonathan Pageau","text":"Right. But the entire structure of the liturgy itself and the entire structure of iconography is based on the Book of Revelations. And so the way the church is."}
{"episode_id":"SW - #025 - 2019-01-02 - Discussion with Paul Vanderklay - Jordan Peterson and Contemporary Christianity","start":2920.16,"end":2920.56,"speaker":"Paul Vander Klay","text":"Built."}
{"episode_id":"SW - #025 - 2019-01-02 - Discussion with Paul Vanderklay - Jordan Peterson and Contemporary Christianity","start":2922.72,"end":3155.45,"speaker":"Jonathan Pageau","text":"The image of Christ in the dome of an Orthodox Church, that's the Christ who's returning at the end of time. Right? And so the structure. And then below him, there's a hierarchy of angels, and then below the hierarchy of angels, then there are the disciples of the prophets, and then the disciples, and then it comes down, down, down, and then we are kind of part of that whole. And so the whole church is an image of the Last Judgment in a way, or the eschatological manifestation of the total church. And so although we don't use the text in the liturgy in terms of quoting it, like the entire liturgy is based on Revelations. And so, yeah, so when you say that, the hint that it comes into the hymns in Protestant hymns, it just makes sense, because that's what I think in terms of the more orthodox perception of Revelations is that it's a cosmic. It's like the ultimate cosmic puzzle, like the ultimate cosmic image of the totality of all things. And then the church is, in a way, like the kind of the temporary manifestation. Oh, no, not the temporary, but let's say like the man, one of the manifestations of the heavenly Jerusalem which comes down. And so the church is. Is the heavenly Jerusalem, physically, the way it's made, with Christ coming down and then the altar with the Lamb on the altar, you know, and all that comes from the Book of Revelations. When people. A lot of. When people talk about, you know, when I. Where I was growing up in the Evangelical church, we didn't have an altar. And they would say, no, we don't have an altar because we're not in the Old Testament anymore, and we don't want altars. But the altar in the church doesn't come from the Old Testament. It comes from Revelations. That's where the altar comes from. The Lamb on the altar and the idea that it flows out like his blood or the river that flow out into the. Into the world, then that is then joining that with communion and bringing communion out to the people. It's all these images that are kind of fused to create what has become the liturgical service. So maybe that's, like, maybe a big question that I want to ask you is that as you start to see the stories and the patterns and the idea that there are these structures, let's say, in the patterns and the stories that are the way we're made, or you could even say the way we're made in God's image, let's say we could say it that way. How does that affect the way that you would see then, like, a church service? Because in terms of the Orthodox tradition, you would say that the reason why we have liturgy is because we participate in that. We actually live in the patterns, and then we act it out. And it's not so much a theater the way Jordan presents it. That's one of the points places where I disagree with Jordan. Like, he tends to say, we act it out before we understand it. I don't think that's the right way to see it. I think that we inhabit it so that the patterns can become. We act it out as a group, right, in terms of a community, so that the patterns become the unifying structure which holds the group together. And so the procession, the bowing, all these things they create. They create a way that we can physically and spiritually participate in that giant pattern which is basically the Bible, or ultimately, like the Book of Revelations, let's say, like the final manifestation of all those. Those patterns into one kind of crazy, you know, story. So I'd like to know, like, kind of how you. Because I know that the Protestant. I mean, the Protestant ethos or the Protestant Tradition tends to emphasize more the sermon and let's say, some hymns and the sermon. So maybe you could talk about that a little bit."}
{"episode_id":"SW - #025 - 2019-01-02 - Discussion with Paul Vanderklay - Jordan Peterson and Contemporary Christianity","start":3156.73,"end":3158.41,"speaker":"Paul Vander Klay","text":"Boy, that's a big conversation."}
{"episode_id":"SW - #025 - 2019-01-02 - Discussion with Paul Vanderklay - Jordan Peterson and Contemporary Christianity","start":3159.45,"end":3161.61,"speaker":"Jonathan Pageau","text":"You didn't expect that one, I guess, coming in here."}
{"episode_id":"SW - #025 - 2019-01-02 - Discussion with Paul Vanderklay - Jordan Peterson and Contemporary Christianity","start":3161.85,"end":3431.28,"speaker":"Paul Vander Klay","text":"No, I didn't, but it's a really important conversation. So I'm. My little church was like the first Christian Reformed church that was planted in Sacramento because Hollanders moved in here. And then it was in an African American community because the crazy missionary said, you know, all these second and third generation islanders want to make money and have nice houses, but here the black folks are, you know, they're interested in the gospel. And so that's kind of how my church got going. And I grew up in a church that was similar in some ways because it was here. My father was planting a church amongst African Americans. So I had. Liturgically, I have this Dutch Calvinist liturgy and then an African American twist on it. And then I went overseas. And so liturgically, I'm a complete catastrophe, but I just am. I mean, I'm one of these beasts that comes out of the sea in the Book of Daniel. I've got different heads and arms and body parts and I'm a mess. But so one of the things that we've been doing in Sacramento are planting new churches. And one of the things that's been interesting is that a lot of the younger church planters are far better attuned to liturgy. And I won't. I gotta be careful here because some of my friends will watch this video and I don't wanna rat them out, but there's some serious Orthodox and Roman Catholic envy going on in the heart of a lot of Protestant church planters for the reasons you just described, because they have seen how liturgy can, especially, I think, culturally right now, can help younger people get the gospel at a different level via liturgy than they can through, let's say, a sermon. And so in the Midwest, where the culture's a little different, when they do a church plant, they're still kind of in this seeker mode with guitars and big music and big sounds and a ball pool and all that kind of stuff. Out here on the West Coast, a lot of church plants, when they plant the thing they're doing, they're having weekly Eucharist. They're calling it Eucharist and not Lord's Supper. They're paying a lot of attention to liturgy. They are including much more symbolism. Now, again, in my iconoclastic tradition, they got to be careful with some of these things. They can't go full blown icons. But this is happening in church plants because church planters, more than any other type of pastor, usually are much more sensitive to what's happening in the culture. And so they're saying, you know, the sermon alone can't carry the freight. We need to embody this in liturgy. And this is bringing young church planters to study liturgy and bring in a lot of elements that were cast out in the Protestant Reformation. And see, that's not entirely fair either because if you actually look at John Calvin, John Calvin had weekly Lord's Supper. John Calvin loved the church fathers. A lot of the stuff that gets associated with real iconoclastic bear Protestantism is really third, fourth, fifth generation things that happen further on down the line. So when you get into, say, Luther, who's first generation and Calvin, who's second generation, a lot of that stuff from the church fathers was still in there. And I think as modernity really got going, people decided that they wanted to keep up with the cultural Joneses. And, and that's when, you know, liturgy kind of goes out the window in some cases. And that's when, you know, the kind of what I call the iron box of secularism really gets in. And so now we're going to demythologize the Bible and we're going to take on all this stuff and we're going to study it as scientists study, you know, something over here. So a lot of, if you dig down deep into Protestantism, the possibilities are not as grim as they might appear in 1975 evangelicalism."}
{"episode_id":"SW - #025 - 2019-01-02 - Discussion with Paul Vanderklay - Jordan Peterson and Contemporary Christianity","start":3432.16,"end":3589.9,"speaker":"Jonathan Pageau","text":"Well, it seems like, I think that what you're saying. I'm getting a whiff of that too, in terms of. I've noticed that certain that there is a. I think that with the breakdown of modernity, I think there is something positive that postmodernity brought in terms of its capacity to show the limit of just rationality or the limit of only, you know, living up in the mind and the necessity for the embodied experience, let's say, which, which goes with it, which can go towards kind of the more Pentecostal experiential stuff. But that has its, has its, has its own limits and its own downsides, let's say. But I think, I mean, at least for me, it has been the going towards the more, let's say, integrative and symbolic understanding and these patterns as well. Because the patterns, the patterns, we intuitively get them right if you can explain them properly, you know, and that's why I think, that's why I think a lot of people also, they like what Jordan's saying because he has, no matter where he gets it from, like, even if it's from Jung, you know, even if I don't like Jung or whatever, there's some of the patterns that Jordan gets so intuitively that he's really integrated them very profoundly. So when he gives an example, people just, it just, you can. People just click like they're like, yeah, okay, yeah, that makes absolute sense. And I think that that's something that if we as Christians can go back into the Bible and go back into those stories and, and find those gold nuggets, then, then, then we can do the same. When we talk about patterns to people and we say, you know, that's why, that's one of the reasons why I'm doing these movies interpretations is to say these are the patterns of reality. People, like, they're not, they're not just in the Bible, they're in reality. So they'll appear all over the place. I can, I can show you like, okay, here, here's a kind of less profound. But still, it's still there. Like, and it's the same as when King David did this and when, you know, and so I think that that's an interesting way to, to be able to awaken people to like the structure of reality basically, and then final. And hopefully it will help them see that there's something, you know, that there is a transcendent aspect which, which goes beyond all of it and which kind of out of which everything flows. Like, it's interesting to see what's happening now. Who knows? It's hard to know exactly how all of this is going to, how all of this is going to go. But for sure it's an exciting time to kind of be alive and to be able to talk to people."}
{"episode_id":"SW - #025 - 2019-01-02 - Discussion with Paul Vanderklay - Jordan Peterson and Contemporary Christianity","start":3590.38,"end":3689.6,"speaker":"Paul Vander Klay","text":"Yeah, it sure is. It sure is. Part of what this project for me has been getting my mind around technology because I've also always been interested in technology. And so part of me figuring out, okay, what does YouTube mean? Because what we're seeing now. So what I've done in some of my videos is, you know, if you look at John Walton, who's a scholar from Wheaton Wheaton College, Old Testament, basically, ancient near east cultures, their impact on the Old Testament. You know, he reminds people that first, you know, before the Bible was inscripturated, it was likely oral. And so YouTube is in a sense the new orality. And so I've been, for example, I've watched obviously way a lot of hours of Peterson Videos. And now I'm reading his book and Jordan Peterson in text. And I'm also listening to the audiobook, which is Jordan Peterson's voice. But Jordan Peterson reading his book is different from Jordan Peterson on YouTube. Okay, what does that mean? How does that work? How does that change things? And so I think, especially when it comes to liturgy, what are you doing with liturgy? So you're taking stuff from the printed page, and now you're. In a sense. Let's think about Tang. You're taking it, and you're. You're bringing it to life in the congregation."}
{"episode_id":"SW - #025 - 2019-01-02 - Discussion with Paul Vanderklay - Jordan Peterson and Contemporary Christianity","start":3689.84,"end":3799.61,"speaker":"Jonathan Pageau","text":"Yeah, well, it was there, right in the beginning. I mean, it was there from the beginning. The Hebrew text was only consonants. And you can see it, really, in that way where it's like a dead thing. It's only stop sounds, right? It's only guttural sound and stop sounds. And then you literally breathe into the text. You literally add the vowels, which are the. The breathing and the continuity. So the text would take life as you would read it out loud, because it's not actually even fully there in the written. It's not even fully there. The meaning is actually missing from it. And the meanings plural also were kept in the community and kept as an oral tradition. It had to be, because each word maybe had four several words would have several possibilities of interpretation. So, yeah, so there's definitely a deep oral. I mean, even the idea of reading Scripture in private, it's not a pretty recent thing, which comes with modernity. Like, Scripture was made to be read out. And that's why, like, even in the Orthodox Church until today, we have these super long services. Like, during Lent, during Holy Week, we have these long services that read, like, the. Read the 12 Gospels of the Passion. And they go on for, like, three hours, and they just read every single Passion narrative in the text. And we have these. We have during Lent and Holy Week, we have these services where there's, like, all the readings from the Old Testament, where almost every single prefiguration of Christ is, like, read out loud. So you stand there for, like, five hours, like, listening."}
{"episode_id":"SW - #025 - 2019-01-02 - Discussion with Paul Vanderklay - Jordan Peterson and Contemporary Christianity","start":3800.01,"end":3807.61,"speaker":"Paul Vander Klay","text":"Protestants are wimps, Protestants are whips. At least American Protestants, Haitians, boy, we go four hours, no problem."}
{"episode_id":"SW - #025 - 2019-01-02 - Discussion with Paul Vanderklay - Jordan Peterson and Contemporary Christianity","start":3808.57,"end":3831.93,"speaker":"Jonathan Pageau","text":"Asians go forever. Yeah. Africans, too. Like, they. They. They, you know, like churches, their life, like, they live and breathe it. You know, they just keep going forever. Yeah, we get. I mean, I. I struggle through these long services. Oh, my goodness, the Russians. And we sit down. Like, the Russians, they don't sit down. Like, they have. We have chairs on the sides of our church where you could sit if you need to, but the Russians just stand for five hours, you know, like the iron legs."}
{"episode_id":"SW - #025 - 2019-01-02 - Discussion with Paul Vanderklay - Jordan Peterson and Contemporary Christianity","start":3833.29,"end":3929.28,"speaker":"Paul Vander Klay","text":"One of the things that impresses me is these ancient practices endured and they formed communities and people beliefs in ways that for all of our technological flashiness, you know, we're, we just. I think, I think we are. I think in many ways. And C.S. lewis makes this point often. I think we are, as is said in the Lord of the Rings, we are lesser sons of greater men, you know, because these, these practices in these communities that we so quickly dismiss, you know, built civilization and, you know, and, and, and developed faith that, you know, the, or the Russian Orthodox Church, you know, they endured, they endured communism and you know, the, and the Chinese church, you know, grew and took root during communism. And so there's very much kind of a Darwinian. There's very much a Darwinian reality that it's. I mean, these churches have been purified and yeah, they're churches, so they got all our messed up baggage with them too. But I think we are so dismissive when we should be respectful."}
{"episode_id":"SW - #025 - 2019-01-02 - Discussion with Paul Vanderklay - Jordan Peterson and Contemporary Christianity","start":3930.8,"end":3935.36,"speaker":"Jonathan Pageau","text":"Yeah. Yeah. All right. I think we've gone for quite a long time."}
{"episode_id":"SW - #025 - 2019-01-02 - Discussion with Paul Vanderklay - Jordan Peterson and Contemporary Christianity","start":3938.64,"end":3941.28,"speaker":"Paul Vander Klay","text":"I think could have a conversation for a long, long time."}
{"episode_id":"SW - #025 - 2019-01-02 - Discussion with Paul Vanderklay - Jordan Peterson and Contemporary Christianity","start":3941.28,"end":3944.96,"speaker":"Jonathan Pageau","text":"That's right, exactly. So maybe we could. We'll do this again at some point."}
{"episode_id":"SW - #025 - 2019-01-02 - Discussion with Paul Vanderklay - Jordan Peterson and Contemporary Christianity","start":3945.12,"end":3945.84,"speaker":"Paul Vander Klay","text":"That'd be great."}
{"episode_id":"SW - #025 - 2019-01-02 - Discussion with Paul Vanderklay - Jordan Peterson and Contemporary Christianity","start":3946,"end":4006.78,"speaker":"Jonathan Pageau","text":"So I will, what I'll do, I will def. I will wish you all the best. I follow your YouTube channel and I wish you all suggest that people go and check it out. I wish you the best as you continue to talk to people and try to mince out, show the good and, you know, how Jordan connects to Christianity, how he disassociates himself with Christianity, trying to find that balance. That's something that I try to find myself in terms of my discussion with people too. I always tell people, okay, Jordan is a heretic. Like, it's obvious that he's a heretic. He does everything to tell you that he's a heretic. He's told you that he started his own church called the Church of St. Joe Aquima Flora. Like, what more does he have to tell you to tell you that he's a heretic? Okay, now once you've gotten that, don't write 10 page, like articles about how he's a heretic. He's told you that he's a heretic. Now let's move on to something else and have a real discussion. Right? It's like, so hopefully we can keep doing that."}
{"episode_id":"SW - #025 - 2019-01-02 - Discussion with Paul Vanderklay - Jordan Peterson and Contemporary Christianity","start":4007.02,"end":4044.25,"speaker":"Paul Vander Klay","text":"Yeah. Thank you and thank you for having me. And thanks for this conversation. This was. I really have appreciated your work. And you mentioned I've got to preach a sermon on Moses and the bronze serpent. And I thought, oh, boy, you've got resources in that that I don't have back here. And so I really. I appreciate your work and I really pray for God's blessing on your work and your family and on your little church. Thank you for that story. I'll have a whole nother image now of. Of you and your. And your blessed tribe. And I do pray that God blesses you richly."}
{"episode_id":"SW - #025 - 2019-01-02 - Discussion with Paul Vanderklay - Jordan Peterson and Contemporary Christianity","start":4044.33,"end":4048.49,"speaker":"Jonathan Pageau","text":"All right, thanks a lot. Thanks a lot. I really appreciate it. So until next time."}
{"episode_id":"SW - #025 - 2019-01-02 - Discussion with Paul Vanderklay - Jordan Peterson and Contemporary Christianity","start":4048.81,"end":4049.29,"speaker":"Paul Vander Klay","text":"All right."}
{"episode_id":"SW - #025 - 2019-01-02 - Discussion with Paul Vanderklay - Jordan Peterson and Contemporary Christianity","start":4049.45,"end":4050.25,"speaker":"Jonathan Pageau","text":"All right, thanks."}
{"episode_id":"SW - #025 - 2019-01-02 - Discussion with Paul Vanderklay - Jordan Peterson and Contemporary Christianity","start":4050.73,"end":4051.77,"speaker":"Paul Vander Klay","text":"All right, take care."}
{"episode_id":"SW - #025 - 2019-01-02 - Discussion with Paul Vanderklay - Jordan Peterson and Contemporary Christianity","start":4052.49,"end":4108.46,"speaker":"Jonathan Pageau","text":"Thank you for listening to the Symbolic World podcast. As you know, this podcast is, for now based mostly on my YouTube videos, which I am transferring into audio format. Please go ahead and visit my YouTube channel. There are more videos there on different subjects that I'm not going to put into audio. And please share this to your friends. I know a lot of people know about the YouTube content, but not so many people know that this is also a podcast. So share it to your friends. Share it on social media. And if you can, feel free to support this financially as well by going to my Patreon page, which is Pajo videos, strangely, you can go there and you can support it at any amount that you want. A month for all the patrons. I do a monthly Q and A live Q and A in which people can ask questions in the chat. And I try to have a more personal connection with people. The YouTube comments have become difficult to follow and to answer. I'll see you soon."}
