{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":0.64,"end":7.88,"speaker":"Jonathan Pageau","text":"I would like to welcome you to episode 30 of the Symbolic World podcast. On this episode, I will plan for you a discussion that I had with."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":7.88,"end":10.08,"speaker":"Jonathan Pageau","text":"John Vervecki, who is a professor at."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":10.08,"end":48.71,"speaker":"Jonathan Pageau","text":"The University of Toronto. I had mentioned John's work in one of the talks that I gave at Furman University. And John is also a friend of Jordan Peterson, a collaborator of his. And so through all those connections, he reached out to me and we set up this very interesting discussion about consciousness, about cognitive science and how it relates to traditions of the sacred. This is Jonathan Pageau."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":49.11,"end":50.79,"speaker":"Jonathan Pageau","text":"Welcome to the Symbolic World."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":60.68,"end":157.7,"speaker":"Jonathan Pageau","text":"I'm here in conversation with John Vervaeke. John Vervaeke is a professor at the University of Toronto. He teaches in the psychology department, in the cognitive science departments, and I think in other departments as well. It's very interesting how we kind of came to this discussion. Two years ago, as many of you know, I had a discussion with Jordan Peterson, and in the discussion I talked about monsters and zombies. And someone in the comments said, oh, it's funny you're talking about that. You should check out John Vervaeke because he talks about zombies, too. And I found a little video of his. And I. And I saw he was talking, I think you were talking in front of. Like you were in a house somewhere, and there's a. And you're talking about zombies. And I really thought, wow, he really understands in a similar manner that what I was understanding. But then life goes on. And I gave another talk on zombies a few years later, and someone wrote me again and said, you know that John Vervaeke just published a book on zombies and the Meaning crisis. I thought, oh, that is hilarious. So I looked up the book, and then one of my Patreon subscribers started to tell me that he was having nightmares about zombies, constant nightmares about zombies, and he was trying to solve the zombie problem in order to kind of get through his nightmares. And he told me that in discussion with. By reading John Vervaeke's book and then our discussions talking about zombies, he. He had basically solved his nightmare problem. And so I thought, huh, so that's great. So there's some things that we can do together and talk about. So, John, maybe you can give a bit more an introduction about yourself so we can get the conversation going."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":158.26,"end":358.8,"speaker":"John Vervaeke","text":"Great. Thanks, Jonathan. Yeah, as you said, I'm assistant professor teaching stream at the University of Toronto. I've been teaching there since 94. And as you said, I do work in psychology. My core is cognitive psychology. So I do work on the nature of cognition. And then that Overlaps and it's part of. I'm also in the cognitive science program. Cognitive science is interdisciplinary. We're trying to get basically psychology, linguistics, neuroscience, artificial intelligence, anthropology, to all talk to each other because they all talk about the mind in different ways at different levels and using different methodologies, different ontologies, getting them to bridge so we can get some sort of coherent convergence. Difficult but interesting task. So I spend a lot of effort on that. And then as you mentioned, I also teach overload in the Buddhism Psychology and Mental Health program where I teach a course on Buddhism and Kokusai where I try to explore why is it that we see this growing confluence between what's known as third generation cognitive science and Buddhism. Why is it like people like Francisco Varela, Evan Thompson, increasingly there's this convergence between these. And so the thesis of that course from which the zombie book was born was the idea that we see this increasing confluence between Buddhist practice and cognitive science, epistemology and ontology, as a way of trying to address the emerging meaning crisis in Western civilization. So I do a lot of work around that. And what happens is the work I do in my cog sci is actually sort of centrally devoted towards that because the cognitive revolution in psychology was born out of the idea that human beings don't respond primarily to the physical properties of the stimulus, they respond to the meaning of the stimulus. And this has been sort of a basic notion throughout all of cognitive psychology. But I became progressively interested how within most of cognition there was this core problem. And then I noticed that this is also a core problem independently in linguistics, in artificial intelligence, neuroscience. And it's sort of three interlocking sets of problems. One is out of all of the information. Now, people often don't quite get what this means because they equivocate between two different meanings of equivocation. There's a technical sense of equivocation, which is probabilistic relations in the environment that are available to. That's very different from what we say when I there was a lot of information in a newspaper article where we mean there was a lot of meaningful content to us. And so part of the problem facing your brain is out of all of this technical information, it has to select which information it's going to pay attention to and how it's going to convert that into meaning, meaningful information. So there's that there's this tremendous selection problem attention. And all the models of attention are about, well, how do we zero in on relevant information, how do we exclude or ignore the irrelevant information? And that's that? And people don't quite understand why that's so tricky. Because it's. You see, this is what you can't do. It's kind of like a Zen thing. You can't check all of the irrelevant information to make sure it's irrelevant because that's combinatorially explosive. That would be uncountably too long for you to do."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":358.88,"end":362.6,"speaker":"Jonathan Pageau","text":"Right. You spend your life checking everything. Before you could decide, you couldn't get."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":362.6,"end":454.66,"speaker":"John Vervaeke","text":"Out of your room in the morning. Right. So the thing is, right, it's kind of, please be careful with how you take this, and I know you will, because you're a careful thinker. But a lot of intelligence is about ignoring irrelevance. Right? Now, the thing is, you can't completely ignore it because sometimes when you judge that something's irrelevant, it actually turns out to have been very relevant to you. And when we realize that, when we realize that how we frame things in our attention needs to be reframed, that we formulated our problem in the incorrect way, that's insight. But then that takes me to the next stage. Okay, so once I've attended to the relevant information, is that enough? No, because then I have to choose how to respond. I have to solve my problems. I have to achieve my goals. I mean, if your viewers want, there's technical papers I published on this, more technical talks. But the basic idea is when you try to plan what you're going to do, there's a culminator, explosive number of options that you have to consider. So once again, out of all the possible options and courses of actions, you have to somehow again, zero in on the relevant information. You have to ignore the irrelevant information. You have to be able to insightfully recorrect that. And then once you've decided to act, you think, oh, now I'm done. I'm done with the relevance problem. No, you're not. Because now you hit the frame problem in artificial intelligence, which is whenever I'm acting, if I'm an actor, everything behaves, everything generates effects. Agents are different in that they pay attention to the consequences of their own behavior."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":454.86,"end":455.26,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":455.42,"end":477.26,"speaker":"John Vervaeke","text":"Which means when I'm acting, I have to try and pay attention to the effects. Problem is, I can't pay attention to just the intended effects of my behavior. Every year this happens. People go into an area where they know there is a gas, a flammable gas. It's dark, and they light a match. They light a match because the intended effect is to produce light."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":477.34,"end":477.82,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":477.82,"end":480.3,"speaker":"John Vervaeke","text":"Unintended side effect is Boom."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":480.38,"end":481.02,"speaker":"Jonathan Pageau","text":"Exactly."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":481.47,"end":559.81,"speaker":"John Vervaeke","text":"So the thing is, while you say, oh, well, that I should. What I should do is in addition to paying attention to my intended effect, I should pay attention to my unintended side effect. The problem is, once again, now, the unintended side effects that you'd have to check. Indefinite, indefinitely large. So once again. So there's this interlocking. You have to pay attention, you have to formulate your problems, and then you have to determine the consequences of your action in this dynamically interlocking relevance realization. And I've tried to argue with my colleagues. Tim Williclap, Blake Richards, Leo Ferraro. Right. That this is the core of what it means to be intelligent. And you see in psychology that when people are talking about intelligence, they're talking about. They're talking about, well, at least fluid intelligence, your online intelligence. That's relevance realization, working memory, consciousness. There's a growing consensus that the primary function of consciousness is sort of higher order relevance realization. Attention is all about dynamic relevance realization. This is turning. I at least would argue that this is the core thing. It's the core. And you see all these different disciplines. I could go into it also for linguistics and neuroscience. I'm just trying to give you, our audience, an idea of this. Like, this is the core of cognition. I often call it the criterion of the cognitive. Sorry, that was a bit of a speech. But I'm trying to compress a lot of arguments."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":560.53,"end":584.35,"speaker":"Jonathan Pageau","text":"I think that, that, you know, when I encountered your work, obviously encountered it to this notion of the meaning crisis and zombies and everything. And then when I saw that you're working on relevant realization. Wow, this is, this is definitely what I've been thinking about, you know, for years now. You know, the. I guess, I mean, I don't come at it. It's funny because I don't come at it scientifically. I come at it really phenomenologically. And, and I think that."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":584.35,"end":586.39,"speaker":"John Vervaeke","text":"Do you want to discuss the phenomenology with you?"}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":586.39,"end":696.8,"speaker":"Jonathan Pageau","text":"Right, right. And so I think that my, my kind of not. It's not my solution. I think it's the. It's the traditional. Let's say the traditional Christian or traditional orthodox solution has been to talk about hierarchy and to have this notion of attention and this focus on nodes, let's say, these nodes of attention. And then there's a hierarchy of attention which manifests itself around, and then it kind of splinters and splinters into basically just kind of this chaotic potential that's there on the fringe. And so that seemed to me like that's how we experience the world. And because of that it makes it possible for things to move, let's say from the periphery into the center. And there's room for that to happen. And so like you said, you don't necessarily have to pay attention to the things that are on the fringe. They kind of exist at these monstrous, you know, ambiguous forms, but then as they move closer towards the center, all of a sudden they start to take their identity, starts to clarify, let's say. And then they connect themselves to the nodes that are already there. That's kind of how, at least phenomenologically that's how I see it. But I don't, like, I don't know enough. That's one of the things that has been interesting for me in the past two years has been through my kind of relationship with Jordan Peterson. I was very. Not anti scientific, but I was very. I tended to see a limited interest in science because I thought that approaching things phenomenologically was more useful for living your life. And so. But then this whole cognitive science all of a sudden came on my horizon and I thought, wow, this is, I mean, it's very interesting because it can help to help people to understand the mechanisms of attention and ultimately moving towards this notion of the sacred, which I hope is something we'll get to talk about."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":696.8,"end":786.28,"speaker":"John Vervaeke","text":"Definitely want to talk about that. So let me respond to both your points. The first point, I think one of the best and current models of attention is Watts notion of prioritization. And he basically has, you'll be pleased to know, he has a hierarchical model of prioritization. So I think that comports very well now the issue I have, and I don't think this is an issue for you from what I've seen in your videos, I'm not clear about Watts of because I've never seen him in person. So I only have his print. But his model of the hierarchy tends to be very static. So I tend to follow Mason from an older book from 1976 called Sentience. And I see it as much more dynamic, simultaneously bottom up and top down. Think about when you're reading, right, you're building the words out of the letters, but you're also disambiguating the letters in terms of the word. So you go simultaneously bottom up and top down. So I tend to talk about what I call a salience landscape. You're very focal to me right now. You sort of, you're a peak in my salience landscape. And then there's this Dynamic topography that is constantly shifting around in various ways. And I don't just mean visually also, you know, you're working memory, you're tapping it. And that's all contributing to what you're finding salience in this very sort of textured and dynamic topography that's constantly unfolding and shifting. And I think a lot of what it, a lot of what consciousness is doing is exactly creating a kind of perspectival knowing within that salience landscape. That's the first part."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":786.59,"end":814.45,"speaker":"Jonathan Pageau","text":"Like to you, if I was going to use like, if I was going to use like a traditional image, let's say that, that I tend to address you, is that there'd be, there's a constant exchange between heaven and earth. You could say yes, right. So, so there's, it's like Earth is constantly offering food and offering potential. Right. And then, and then heaven is constantly trying to embody ideas into, into, into the earth. And so, so it's like there's, there's really this exchange of two sides of."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":815.48,"end":827.68,"speaker":"John Vervaeke","text":"I think that's totally right. And so again, the consonants between. This is. Jordan would be happy. He would think this was synchronicity everywhere. Your viewers should know that Jordan and I are colleagues at the University of Toronto."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":827.68,"end":854.47,"speaker":"Jonathan Pageau","text":"Right. Yeah. That's what's strange about this whole thing because it happened kind of on the sidelines and then finally. Yeah, so the people are watching. I actually asked Jordan to, when I saw Jordan a few weeks ago, I said, Jordan, you have to connect me with John Vervaeke because his ideas seem so close to mine. Like, could you write an introductory email? And then John reached out to me and said, oh, I saw your videos and everything and I was sure it was Jordan who had reached out to him. And then it turns out no, he had seen them on his own. So yeah, all these synchronicities coming together is hilarious."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":855.03,"end":931.42,"speaker":"John Vervaeke","text":"So anyways, I wanted to say that that notion, by the way, which has universals to it. I mean the relation between heaven and Earth is very constant in both Confucianism and Taoism, for example. Yeah. And so how that actually plays into the work I do on relevance realization is I talk about the idea of sets of top down and bottom up constraints that are regulating our sense, that are sort of shaping and regulating the space within which this salience landscape is occurring. So our brain is putting a lot of top down selective pressure to try and be as efficient as possible. But the brain is also has this aspect that's bottom up. It's trying to create as many try to keep as many options open as possible. So it's very analogous and this is intended to Darwin's biological theory of evolution. The brain opens up variations and then right, and then it narrows them down and it's constantly right. The sensory motorcycle is constantly be dynamically shape. So I'm constantly, if you'll allow me the metaphor, I'm constantly evolving my cognitive fittedness pension, my problem solving and my action, my agency."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":932.7,"end":1004.57,"speaker":"Jonathan Pageau","text":"One of the images that I've been kind of also my brother at some point, I hope you'll meet my brother because he's publishing a book right now and he really talks about this exchange between heaven and earth in a way that's the clearest that I've seen yet. But one of the idea, one of the traditional ideas is this idea of the left and the right, like this. The left and the right hand or the left and the right eye. You see that in the story when Christ talks about the sheep and the goats, you have this notion of bringing closer and pushing away. And so as you bring closer, you bring towards unity and towards meaning, towards oneness. And as you push away, you move things out towards fragmentation and fire or whatever, how you want to image it. And so those two tendencies at the same time, this left and the right eye or hand playing together, are what kind of bringing together and separating? I always say that, like this idea in the creation of the world, that the notion that the logos comes in and he both separates and unifies, and he does it at the same time. Because when you give something an identity, you're both separating it out from everything around it, but you're also unifying it as an identity totally."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":1004.57,"end":1112.89,"speaker":"John Vervaeke","text":"And so this is the whole thing. I mean, again, so there's people who talk about. Right, so the efficiency tends to get your. Your cognitive processes to integrate as much as possible, because that makes them more efficient. They use less resources, they talk to each other. But you. But as you do that, you become more rigid, you lose the differences. So you. Like if I take off my glasses, my perceptual acuity goes down, my ability to differentiate things goes down. So I don't want to integrate to the point where I get an amorphous blob. I also need to differentiate. I need to have that representational power. And it looks. And again, you can see theories of intelligence. You've got these competing theories of intelligence that say, no, it's all about integrating information. Same thing with consciousness. Other people say, no, no, it's all about differentiation. What I argue with my co authors is. No, no, what you have is this dynamic thing that's constant. And the thing about that, Jonathan, is that leads to complexification. So what makes me a complex being? Think about, we all start out as zygotes, right? Right. And then initially all we do is the cells just reproduce. But something really interesting happens, right? The cells start to differentiate. You know, some become lung cells, some become eye cells, and then they literally self organize organs. And so you've got in parallel, the cells are differentiating, but they're also organizing into organs, into systems. And that makes you a complex thing. Right. You're simultaneously very highly integrated and very highly differentiated, which means you have emergent abilities. You can do things now you couldn't do as I do. Complexification produces. It's part of what drives our developmental self transcendence, that we are all, we have this capacity to transcend ourselves in an ongoing manner. And what's really interesting is complexification produces hierarchies."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":1114.35,"end":1174.07,"speaker":"Jonathan Pageau","text":"It's really fast. Like right now it seems like that's the big, let's say, the big question, people, in terms of what you're saying, we see it happening before our very eyes. You've got Justin Trudeau saying, diversity is our strength. And you've got Donald Trump saying, make America great again. And so you've got these two extremes, as if. And people can only see the positive of their extreme. They don't understand it. You need both, you need both unity and diversity at the same time in order to have something, like, in order for something to be. And I always, I tell people that sometimes people wonder in the Christian tradition why we have the Trinity. And the Trinity is the infinite representation of those two things together. The notion that you need in reality the highest image of all things is both absolute unity, completely one, and then at the same time, completely three, or completely multiple at the same time, without contradiction. And so it's, it's really an image of how the world, the world works, basically."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":1174.23,"end":1176.23,"speaker":"John Vervaeke","text":"Right, right. Very powerful image."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":1176.23,"end":1210.22,"speaker":"Jonathan Pageau","text":"Yeah, yeah. So maybe I would like you to talk a little bit about this notion of the meaning crisis that you talk about in your zombie book. Because I really, really like the zombie book also because you talk about superheroes and all the stuff that I'm interested in right now to help people understand where this, you know, where there are still at least semblances of sacred stories in our culture. And you even mentioned that in your book. So maybe you can talk a little bit about how you perceive the meaning crisis and maybe a little Bit about the monster and the zombie and how you see it as a sign, let's say, of that meaning crisis."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":1210.22,"end":1222.7,"speaker":"John Vervaeke","text":"Sure, sure. So you should know that my co authors, Chris masterpietro and Philip, we're currently working on the second, third and fourth book. There's actually four books."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":1222.7,"end":1223.26,"speaker":"Jonathan Pageau","text":"All right."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":1223.66,"end":1236.7,"speaker":"John Vervaeke","text":"The second book is going to be done very shortly. And the second book is all about the genealogy of the meaning crisis, which we touched upon in the first book. So, I mean, it's kind of a long story."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":1239.58,"end":1241.02,"speaker":"Jonathan Pageau","text":"The 12th century, pretty much."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":1242.86,"end":1318.96,"speaker":"John Vervaeke","text":"Well, part of it is. See, I would challenge you on that. I think part of it is, first of all, to get clear about the emergence of this notion of meaning and wisdom that comes about with sort of around the collapse of the Bronze Age and that sort of thing, okay, where the Axial Period, where you have the birth of all the world religions, you have the birth of philosophy, you have the birth of science. And see, before that, you know, you have this sort of very continuous cosmos, right? There isn't really differences in degree between sort of the natural world, the social world and the sacred world. They form a continuum where the primary differences are differences of power, right? And time is also continuous. Time is more of a circle and a loop, right? And so what you get is you get this. You get the notion of, you know, conserving, getting back to the origin. The point about wisdom is to fit into these cycles, right? And to find, you know, the Vulcan thing, to live long and prosper. That's the core of wisdom. And then what comes along is you get cognition has fundamentally changed. First of all, the greatest collapse in civilization that has ever occurred in the west occurred in the Bronze Age collapse. I mean, more cities go out of existence, literacy, more lost their language, they."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":1318.96,"end":1319.96,"speaker":"Jonathan Pageau","text":"Even lost their own writing."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":1319.96,"end":1545.61,"speaker":"John Vervaeke","text":"So, yeah, everything just collapses. And some of the writers on the Axial Revolution have an analogy. It's only intended as an analogy. It's like when the asteroid hit 75 million years ago and you get the, you know, the dinosaurs are wiped out, and that affords all these, what was previously the small mammals to speciate. The idea is when these Bronze Age titanic empires all collapse, get all these smaller societies that are doing all this experimentation, and then you get the invention of a lot of what I call psycho technologies. A tool fits your biology. Like suppose I had a bottle of glass, right? The glass fits my physiology and enhances it. If I was trying to carry around water in my hand, pathetic. But this really enhances it. Well, psycho technologies, they're designed to fit your cognition Their ways of formulating and processing information that fit your cognition and enhance it. One of these, of course, is literacy. Think about how much literacy empowers you to. I mean if I was to take literacy, not language, but literacy away from you, the problems solved, the people you could interact with, the amount of information, it would just collapse like this. So what happens is, and we don't know quite where, it looks like it's some, it looks like it's an ancient Canaan, ancient Israel, it's not clear because the distinction between proto Hebrew and Canaanite is so it's controversial. But the thing is you get the invention of alphabetic literacy, right? And alphabetic literacy just opens up literacy to way more people, you see. And what that does, it puts the power of distributed cognition in your hands and it also does something else that allows you to externalize your cognition. You can look at your own thoughts, you can come back to them again and you can share your thoughts over time and space with other people. And what that does is that produces what's called second order thinking. Everybody has metacognition, everybody's aware of their own, can become aware of their own mind. But second order cognition is. If I put that psychotechnology into my metacognition, when I'm aware of my own mind, I can use the power of literacy to really enhance it and to, I can externalize it, become much more aware of my, my mistakes, my errors and I much and then I can use that power to self correct. And what a lot of people argue, myself included is this and other things like numeracy, there's a whole bunch of new because currency is invented, coinage, right. All of these psycho technologies really empower our ability to, our abilities to self correct, right. Become just massively enhanced. Now I think that carries with it a phenomenological and existential change. Because what happens is, what seems to happen is there seems to be this radical transformation historically in people's sense of responsibility for violence. So in the pre axial world, violence is kind of part of just the natural order of things. But what seems to happen, right? And you see this, you see this. I think you see this emerging in the Bible. I think you clearly see this emerging in the acts of revolution in Greece. You see it clearly with the rise of Buddhism in India, right? Is this sense of no, no, no, no. Our capacity for self deception is so great. We are very self destructive. And this the way our mind makes meaning and here's the connection is deeply responsible for how we're suffering, creating illusion Hurting each other. But there's the other side. But what we're also aware of is mind's capacity, right, for self transcendence, for insight, for realization, for breakthrough. And I think what happens mythologically, and I hope you understand I don't use myth to mean things that, you know, false beliefs."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":1545.61,"end":1547.93,"speaker":"Jonathan Pageau","text":"Yeah, if you did, I wouldn't be talking to you."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":1547.93,"end":1985.98,"speaker":"John Vervaeke","text":"Pretty much, yeah. I understand myth as a kind of symbolic grammar by which we try to articulate and express especially these kind of fundamental properties and or transformations in our cognition and consciousness. So myths aren't sort of ancient stories about the past that are irrelevant. They're about perennial patterns or pivotal moments in the transformation of consciousness and cognition. So I think we're sort of in agreement about the use. Okay. So I think what emerges is a two world mythology. The two, the point about the two world mythology, there's a deep grammar there. It's trying to articulate this difference. It's that there's the everyday world of suffering and illusion, right. And there's different ways of doing that. You can think of it as illusion, you can think of it as fallen, you can think of it as something that we have to transcend in the future. There's various ways of unfolding this grammar. And so I'm not going to talk about it specifically right now. But then there's the higher world, there's the world that we can realize in both senses of the word. We can come into awareness and we can make real. It's where we can be most real. And what happens is the notion of meaning is about being connected to the real world. Notion of wisdom isn't about why would you want to fit into the everyday world? Why do you want to live long and prosper in this torturous world of suffering and delusion? Wisdom now becomes, no, no, how do I self transcend so that I can increase the meaning, I can increase the connectedness to this realness where we can stop suffering and we can come to come to flourishing. And so what happens is you get this whole axial world mythology and then I think what happens is philosophers, thinkers, I won't go through them all, but I'm thinking of Plato and Aristotle, particularly Plotinus. Plotinus. Really, really important. I've been interested, I've been watching some of this stuff you also do on the Eastern Orthodox Christianity and just I don't know very much about it. I was just amazed about how much Neoplatonic like language and discourse is in there. Anyways, and then, and then Augustine. Augustine is a Pivotal figure. And what happens is we get. They sort of articulate this two worlds mythology into sort of three conceptual orders. Now there's a difference between the mythology and the conceptual order, but they're tied together. One is sort of a nomological or this idea that we are sort of radically connected. When we know things, we're realizing that we're getting connected to reality and it's making us more real. And then this brings sort of a nomological sense that we can improve ourselves as we make these connections to realness. As we enhance meaning, we overcome foolishness, we afford flourishing, we become more wise. And then that's linked particularly by Augustine because Augustine takes basically Plotinus and the narrative heritage and what, what's going on there is the axial revolution. And I hope you believe I do not want to trespass on your Christianity in any way. I'm deeply respectful of it. So I'm not trying to be reductive here. So I'm saying one of the things that happens in the Judeo Christian revolution is right. The idea of the open future. You get the idea of the narrative idea of history. And I see this particularly mythologically represented in the God of the Bible because unlike the pre axial gods, he's not a God of a specific place or location or function. He's the God of the open future. He's the God of the Exodus. He takes you out of the prototypical pre axial civilization, Egypt, and he takes you the New World. The New world, the Promised Land is the real world, is where we're going to come to fruition, flowing with milk and honey as the symbolism goes. Right. And this idea that we can co create with God, we can participate in the creation of this future, but by the moral quality of our action, by how we participate in this unfolding narrative. I think it was Augustine's brilliance to bring that Hebrew Christian notion into this integration with the Neoplatonic and the nomological. You see sort of Aristotle. I do. At least I see Aristotle and Plotinus and the whole, like I say, Hebrew Christian tradition being brought like integrated together into the narrative order. So this is where we get the sense of progress and we get the sense of purpose. So even people who are highly secularized, this is my, this is the point. Sorry, it's been a long speech. I'm trying to compress so much. Even people who are secularized still try to understand the meaning of their life in terms of how it progresses or purpose or they understand it in terms of the normative. How am I self Actualizing how am I self transcending? Or they understand it nomologically, how well connected am I to reality? So you can reliably do this. For example, one of the things that really contributes to people's sense of meaning in life is their relationships to other people. But watch this. You can say to people, how many of you are in meet, like really satisfying, personal. Oh, they'll put up their hands and I'll say, how many of you would want to know if your partner was cheating on you, even if that means the destruction of the relationship? And everybody put up their hand. This is why. Insights, right? In addition to whatever we want to be meaningful, we want it to be real, we want it connected to what's real. And so this being in touch with reality, this self actualization, this progress, right? All of these are still the grammar, secular or whatnot by which people try to conceptualize, right? This axial legacy of wisdom and meaning. The problem is, as you said from the 12th century, we start reading differently. We start moving from recitation to silent reading, right? We do that. There's, there's, there's the, there's the within theology, there's Occam. Occam, right? And you got, right. And so you get, you get the priority of will. Like, see what's in Augustine, right? For me, what you see is, you see this deep interpenetration, and this goes back to Plato and Plotinus, between love and reason. They're completely interdefining, interdependent. And what's happening in Aquinas and then like pushed by Occam is that. No, no, it's separated, right? There's the, there's the natural world is grasped by reason and then the supernatural world is grasped by love. And now love is separate from reason. Love is an act of will, it's an act of assertion. And then Occam brings in this idea that the primary feature of God is his will, right? And then the black plague comes along and. Right. And so what happens is this notion of willful imposition, arbitrariness, power starts to come back. And what happens is, right, all of the orders start to collapse. You have the Copernican revolution, which radically undermines that Aristotelian framework. Now experience is blinding us disconnect from the world, the nomological collapses because the whole Neoplatonic hierarchy is lost, right? And then you get, of course, with Galileo, you get the emergency of the inertial universe. And so all sense of purpose and narrative is removed. So we have this scientific Worldview. I often tell myself, my students in cognitive science. One of the central tasks of cognitive science is solving this problem. We have a scientific worldview in which we don't belong."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":1986.06,"end":1999.82,"speaker":"Jonathan Pageau","text":"Exactly. We don't live in the scientific. I keep telling people, you do not live in the scientific world. It's a form of alienation. To think that you live in that world is to be very alienated into your actual experience."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":2000.83,"end":2084.46,"speaker":"John Vervaeke","text":"So what happens is we have this whole mythological and conceptual grammar. We're still using it, right? We're still using it. But be careful here. Don't misinterpret me. I'm a scientist. I believe in the value of science. Right. But the scientific revolution, the Protestant Reformation, what's going on in the 12th century with the changing and reading, the change in the conception of God, where what's primary about him isn't what you would say his noose, but is his will. Right. That leads right to Nietzsche's will to power. There's a direct line there between, you know, the dominant feature of us and God is our will, not our rational love or our loving rationality, but our will, our assertiveness and belief goes from belabin giving your heart to assertion to assertion to assertion to assertion. Right. And so I think what I mean by the meaning crisis is what we see is we still have this grammar all the way back to the actual period of trying to understand meaning. But the two worlds mythology and the three conceptual orders that allowed us to express it, articulate it, celebrate it, share it, they have all been seriously, seriously undermined by our intellectual and cultural and also economic history, because we also live more by ourselves, which is also bad."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":2084.62,"end":2085.02,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":2085.1,"end":2157.62,"speaker":"John Vervaeke","text":"So all of these things have conspired. I don't, I'm not a conspiracy theorist. Yeah, yeah, right. To basically undermine our ability to, to access the. These three orders and to partake in the axial mythology. So while we still. While it. But it still fills our cognition because we still use literacy and numeracy and second order thinking, we still have these experiences we don't have the means for, as I say, articulating, expressing, celebrating. And so we're in a meaning crisis. And so people keep looking for things that will, you know, feel surrogate things that will give them a sense of purpose, give them a sense of self transcendence, give them a sense of connectedness, etc. That's what I mean by the meaning crisis. And I think the zombie is a mythological in the sense that we mean by mythological way of trying to articulate, even celebrating it. You Talked about the zombie walk. Zombie walks celebrated. It's a weird thing, Right, right. And what they're trying to. The zombie represents, right, this loss of meaning, the loss of intelligibility, the loss of connectedness, the loss of community, even the loss of shared cultural meaning, the loss of purpose, the loss of all of these things."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":2158.1,"end":2163.64,"speaker":"Jonathan Pageau","text":"You know, in a normal, like in the traditional world you would have these, these cycles, right?"}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":2163.64,"end":2164.16,"speaker":"John Vervaeke","text":"Yes."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":2164.16,"end":2211.14,"speaker":"Jonathan Pageau","text":"And so I know that you talk about how Christianity is more linear and moves towards, let's say the eschaton, but there is, in Christianity there's both movements. Like there's the cyclical movement of the liturgical year and then there's this movement towards the eschaton. But the eschaton is also, it's circular to an extent in the sense that it's a return to the garden, but then it's the expansion of the garden into the totality, let's say. But what I wanted to get to is that in a normal world you have, at the end of each cycle you would have these carnivals and the carnival like the zombie would have been. I mean, obviously it wasn't. But something akin to the zombie is what you would encounter in a carnival that is like a moment of loss of meaning at the end of a cycle."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":2211.14,"end":2211.62,"speaker":"John Vervaeke","text":"Yes."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":2211.78,"end":2250.34,"speaker":"Jonathan Pageau","text":"So that it's like everything has to kind of go back into death and then everything starts again, you know. And so the sense that I get is that let's say if you have these little cycles, you know, and every year you have the carnival and then, you know, but then you have these in the Bible you have, let's say the week with the Sabbath at the end. And then you have a Jubilee, 50 year Jubilee. You have. And then like at the end of every year you have Purim. So you have these, you know, these cycles on cycles, on cycles. And so it feels like now like the whole cycle, it's a. From, you know, from the. What you, how do you call it, the actual, the actual age, the actual revolution."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":2250.34,"end":2253.26,"speaker":"John Vervaeke","text":"It's not my term, it's Carl Jasper's term. Also talks a lot about it."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":2253.26,"end":2284.38,"speaker":"Jonathan Pageau","text":"I'm fine using that, using that, using that term. Like let's say from the act, the whole, the whole cycle we're reaching the carnival of that whole cycle. So it's like everything has become upside down. Everything is. The monster is entertainment, is diversion, you know, and so there's all these sites except as if it's filling up our whole whole society. Like our whole society is a clown society basically. And so. And so it's like. There's definitely a huge shift that has to happen. Like that has to happen in order for things to start again."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":2285.26,"end":2348.64,"speaker":"John Vervaeke","text":"I believe so. And I mean, I think what's happening is we're sort of degenerating, I think that's the right word, into sort of the lowest level at which that connectedness is available to us, which is salience. Yeah, salience is sort of. The salience is what grabs your attention. Right? And let's not pretend that's an integral part of meeting. If things didn't grab your attention, you're facing the amorphous combinatorial explosion. So salience is important, but it's not sufficient. Right. You have to. You know, that salience landscape has to. It has to configure. Right? It has to configure how things are present to you. It has to open up affordances for you. It has to. Has to set up this. Clifford Geertz's idea of a relationship between agents and arena. The world has to be. You have to have this connectedness that makes the world a place for action. And you have to be connected to yourself and to other people so that you are a relevant actor within it. And we aren't. That's what we just said a while ago. We don't fit into the arena that science presents to us."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":2348.64,"end":2396.33,"speaker":"Jonathan Pageau","text":"Well, there's a kind of. There's a kind of salience which. I mean, tradition would be called desire. I mean, passions, let's say. And so that type of salience, which is the. The. The attaching oneself to. To some passion, then that's. That's exact. I mean, that's a real. It's a. It's real in the sense that it's. Feels like it gives you life, let's say that it. That it enlivens you, but then it ends up disconnecting things from each other, you know, and so that. That's really. That's like the traditional. I'd say. I know you said you don't know a lot about orthodox, but in orthodoxy, we have this notion of. Of the entering into the heart like this. This Castic anthropology, where your desires are on the edge and they pull you, but they're not bad, but they're meant to be connected together, kind of moving towards this central place where the illumination happens."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":2396.49,"end":2454.25,"speaker":"John Vervaeke","text":"I get that from sort of the Neoplatonism that I'm familiar with. I mean, I think you. In one place, you described me as a secular Buddhist. That's how other people, I think, see I talk more about my practices, and I'm a devoted practitioner. Some Buddhist practices, vipassana, meditation, meta contemplation. I also practice a lot of Taoist practices. Tai Chi, Yichuan, Zhenjiang, Fujian. I also practice Neoplatonic practices of dialectic, contemplation, divinity. Right. I do. So calling me a secular Buddhist is a little. Right. So I have a little bit more familiarity. But I wanted to point. I wanted to bring up something, and I hope you don't mind me using a term because we used it in the book and it's important because it's been used in academic circumstances and it's culturally prevalent. And this is Harry Frankfurt's notion of bullshit. And I think it's very important to talk about that. And I don't mean to be vulgar, but it's an important term because there's a distinction between the bullshitter and the liar."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":2454.25,"end":2454.65,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":2454.65,"end":2496.71,"speaker":"John Vervaeke","text":"The liar manipulates you by depending on your commitment to the truth. Right. And the bullshit artist works differently. The bullshit artist works by getting you to disregard how salience should track truth. So what the bullshit artist does is just try to make things salient to you. So there's a great episode in the Simpsons where the two aliens, they're running for political office, and the one gives a speech and he says, my fellow Americans, when I was young, I dreamt of being a baseball, but we must move forward, not backwards, upwards, not backwards twirling, twirlings towards freedom. And you feel this sort of rush if you're an American. Right? And it's like, but there's nothing being said. There's. Yeah, but advertising works the same way."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":2496.71,"end":2498.27,"speaker":"Jonathan Pageau","text":"Advertising, exactly that. Yeah."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":2498.35,"end":2605.5,"speaker":"John Vervaeke","text":"Okay, so here's. But here's the. Here's the existential cognitive point I want to make. And this is not a point that Frankfurt made. This is. So this is. This is a point I'm making on the basis of. Frank, I'm not trying to take credit. I just don't want to miss a tribute to him. Right. You can. We have. We have metaphors of self deception as lying to yourself, but that generates what philosophers called the paradox of self deception. Because how could you possibly lie to yourself? That doesn't. But here's the idea. You can bullshit yourself because the way attention works. Remember we talked earlier? Attention is both bottom up and top down. If I make something salient to you, then it'll draw your attention, but by paying attention to it, you make it more salient. And then you get this thing. And that's how it Works the advertiser shows you. Here's people drinking in a bar, they're having alcohol. Look at all the attractive, happy people around. Go into a bar. It's not like that, right? And you know it's, you know it's not true. And they know, you know it's not true, but they make that product salient to you. And so when you go into the store, what do you do? You buy the product, right? You buy the product. We deceive ourselves through this capacity for bullshit. And part of what is endemic, at least we argue this and there seems to be, we have some empirical evidence for it. What seems to be part of the meaning crisis is this increasing stance. And by the way, here's what I would want to argue. When people talk about being in a post truth era with Trump, post truth is just euphemism for bullshit, right? And we are in an era you track the complaints, the worry, the concern, and these two are locked together. The prevalence of bullshitting and the increasing capacity for self deception. I think what happens when salience is all that's left."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":2606.38,"end":2673.13,"speaker":"Jonathan Pageau","text":"Yeah, that's really interesting. And I think that you're right that in a way, you know, the kind of bullshitting that we're seeing now in the political sphere, we've been prepared for that for the, you know, the last 50 years. Like they've just been preparing us constantly. And I think that you can you experience it too, like every time, every time you give in to some passion, like whether it's eating your second piece of cake or whatever, you know, there really is this idea that, you know, if you, if you would stop, you would think of the effect it's gonna have on you. Like, you know, that, you know, but there is a line to yourself. Like there is a, There is a folk. If you focus on the piece of cake, right? And you focus on that, then it's like all the rest just vanishes. You just zoom into that. And so you, you, and then, then, then you realize it afterwards. Then it's like you have this wake up, you know, you have the wake up moment after you give. It's like, oh, okay, what did I just do? You know, why did I do that? And I mean, there is an unconscious, I mean, you really do feel like there's this slip into unconsciousness, right? You can feel it almost happening to you. You kind of, you kind of just focus in on the, on the desire, and then your consciousness just kind of slips and then smacks."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":2673.13,"end":2847.4,"speaker":"John Vervaeke","text":"Well, there's a lot of good cognitive science on this. But. And maybe this will line up with your Eastern Orthodox anthropology because Plato talks, right? About the tripart caplet was. Plato was trying to figure out, I mean that's the core. He tried to understand why did they kill Socrates? And he comes up with this idea. He takes the phenomena of inner conflict as the core thing. He wants to understand how are people getting in, like eating the second piece of chocolate cake, why does it happen? Right? And he gets the idea that we have, that our cognition isn't sort of a monolith. There are different centers of functionality and they, and they have different phenomenologies and cognitive framing associated with. There's a part of us that's very stimulus bound and it's very urgent and it's designed to allow us to enable us to work with what's in the present moment, right here, right now. Urgent. We need that. If you try to eradicate that, you can't get out of bed. And then there's another part of us that's our cultural right, that we are not just biologically shaped, we are culturally shaped. And then there's the part of us that is capable of abstract goals, right? And then Plato's point was no, no, the problem is, right, you need to get these into alignment. You need, and this is if you want to, let's say you wanted to lose weight, you know what you do, yes, you rationally, you believe it. But that is radically insufficient, right? You need to go and join a group, you need to get disconnected to other people. Because distributed cognition, that cult, he calls it the lion. The man and the lion together can control the monster. And I think this is another important thing in Plato. Plato not only discovered that we want to be in, he discovered the meta desire. In addition to whatever we desire, we desire it to be real. He also discovered the other meta desire. In addition to whatever we desire, we desire to have it with peace of mind. We desire to have this internal alignment so we're not at war with ourselves. And his great insight in my opinion is the idea of anagogi, the ascent that these can be linked together as I align the parts of the psyche, right? See the thing about that, inner conflict, right? When I'm, when I'm in inner conflict, the monster is making things salient way above and beyond what I believe. That's bullshit. Yes, that's, that's the field of bullshit. But if I can get more properly aligned, my self deception decreases. I start to see a little bit more deeply into reality that satisfies that desire and Then reality starts to disclose itself to me that aids me in aligning the psyche and these loop together. As I get more internally aligned and get more aligned with reality. As I get more aligned with reality, I get more internally. Right. And this anagogue, the ascent out of the cave, the famous myth in Plato, that to me is I think, the great insight. And what I think when I say we're. That we lack wisdom, institutions, I'll say to my class, where do you go for information? Oh, the Internet."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":2847.4,"end":2847.79,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":2847.86,"end":2871.7,"speaker":"John Vervaeke","text":"Where do you go for knowledge? Well, science, the university. Where do you go for wisdom? And there's a deafening silence because we don't have institution and cultures that afford anagogic. We do not have that anymore. That's also what I mean by we lost the meaning. That's also what has been lost in the meaning crisis. We do not have collections of people that are instituted together to help us afford anagogi. Right."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":2871.78,"end":2997.32,"speaker":"Jonathan Pageau","text":"I mean, I think that maybe that's where we will kind of disagree in the sense that I, I think that one of the things, like one of the things that in your book you talk about this, this meaning crisis and kind of the break. The breakdown of the Christian. The Christian narrative, let's say. And I, and I totally agree, obviously, I think that that's what's happening for sure. But I. The other thing that I see is that the, the Christian narrative seems to have that breakdown in itself. Right. And so the Christian narrative sets itself up as, as a, as something that will die and will come back. Like Christ died and came back. And Christ says, you know, this idea, like, when I return, will I find faith in the world? And so this notion that there, that even the church itself has to somewhat die or at least come down, like go down into death and then, and then come back. And so I, to me, I don't see the, like, I don't see the Christian narrative as being completely done. I see it as. As part of that kind of descent. You know, it's in that obvious descent. But then there's something. I think that it, that there's. It doesn't mean that what's going to totally come out of it is going to be the same as what was there before. But I think that there is something in the. There is something in the story of Christ which anticipates this, like, anticipates this going to the end and then coming back. And so for me, I still think that the best place in order to find that alignment is the church, because you still actually do Physically go to the same place you do, physically stand in the same direction. You sing together, you recite. All those things are there to create that common experience. But then there's also an anthropology and a spirituality, I think especially in the orthodox tradition, which is a mystical transformation of the person through, through, through the Jesus prayer and hesychasm and all that. So, so I still think that, that, that, that's. But I, because in your book you don't, you don't spell out the solution."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":2997.4,"end":2998.36,"speaker":"John Vervaeke","text":"It's only one book."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":2998.76,"end":3014.29,"speaker":"Jonathan Pageau","text":"So I, I, maybe you can give me a sense of what you think. Like how, what could play out as a solution at least like a, A mix of a social and, and per. Because you talked about how you're a practitioner, which is, which is a personal solution, but that's not a social. Like it doesn't bring people together, right?"}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":3015.01,"end":3051.66,"speaker":"John Vervaeke","text":"No, no, it does. I mean, but I also create social settings. I led, sorry, a wisdom sangha for many years. I teach meditation contemplation classes. I agree with that and I think that's a very important point. And so I want to acknowledge that there is some significant self criticism when I say we don't have wisdom institutions. I'm not exempting myself from that. I want to be clear from that, clear about that. Secondly, so there's a bunch of things I want to say. First is like I shouted over you and I shouldn't have. I apologize. I tend to get very enthusiastic, as you can see."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":3052.22,"end":3053.34,"speaker":"Jonathan Pageau","text":"I love that. Don't worry."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":3054.38,"end":3170.11,"speaker":"John Vervaeke","text":"It's the first book in four books, right? Because part of what I teach my students about how to be rational and cognitive is like formulate the problem really well. It goes back to what we talked about at the beginning. If you haven't done really good relevance realization, really good problem formulation, you're not going to get the insight, you're not going to get the solution. This is a very complex problem. Laying out the mythology and I mean that the deep sense. We did the genealogy in the second book. The third book is all about the cognitive science of meaning and sacredness. And we need to talk about sacredness at some point. And then the fourth book is, okay, what would this. What. How can cognitive science contribute to that? So there's that the first about what I think, what I think is, and I wanted to mention this earlier, I think that third generation cognitive science is. So if you'll allow me, let's distinguish two different things. Let's distinguish sort of the historical factors. And you talked about this very nicely in the trajectory that have led us to where we are Occam, through the Descartes, et cetera, et cetera. Those are different from the perennial problems that human beings face just because they have self consciousness. Right? Right. There's perennial problems of confronting absurdity and horror, meaningless despair. Right. All cultures have that. Normally what cultures have. Right. Is they have. And I think this is the right way to use it. They have some sort of religious meta meaning system that coordinates psycho technologies so that they have a way of existentially and ethically responding to perennial problems. Now the problem with us is we're in a historical situation where our worldview, we don't have worldview to it doesn't do that for us. So part of the, part of the solution, the historical thing is to understand. And I think you're seeing some of it right now. I think I'm a representative."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":3170.46,"end":3170.7,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":3171.26,"end":3214.1,"speaker":"John Vervaeke","text":"Of third generation cogsci. This generation of COGSCI is trying to radically undermine that Cartesian grammar of disconnectedness. We're not. The mind isn't radically disconnected from the body. Minds aren't radically disconnected from each other. They're not radically disconnected from the world. We talk about embodiment and embeddedness and connectiveness. Right. These are becoming. And I've tried to show you a little bit and what I've trying to exemplify this generation CogSci is radically trying to undermine that worldview in which we don't belong. And it's taking. Cognitive science is taking, I call it the naturalistic imperative in cognitive sciences. How do we fit back into this worldview?"}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":3214.1,"end":3215.3,"speaker":"Jonathan Pageau","text":"Right. Yeah, exactly."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":3215.54,"end":3424.54,"speaker":"John Vervaeke","text":"So I think cognitive science is gonna. Is helping. Now what's interesting for me, and so let's talk about this is for me, I don't know what to call it, the spiritual tradition, the sapiental tradition. Both those words are a little bit inadequate. Put them together in something we don't have a term for of Buddhism is what a lot of the people in third generation Kagusai are attracted to sort of Buddhism and Taoism. Part of that is purely historical. Part of it is because those are traditions that aren't part of that decadent history. And so people want to get outside of that history because they don't want to fall prey to it. And so I think that's a very. I don't think it's fair to just ignore that. I think that's a legitimate concern people have. So I would hope, and this is a real hope, I'm not being coy here. I would hope that the Resources that people like you have within. Right. Christine, like I said, I'm especially appreciative of. I want to talk to you, but I just ran an experiment on mystical experience and how it contributes to meaning in life. Like the data is like it's there. Like I would love it if you guys could also articulate that. But what I wanted to say, and then I'll return things back to you, is I say the very same thing about Buddhism that you say. I say, look, because a lot of people are in the class and they come in with Buddhism, I say, and here's why I'm influenced by Stephen Batchelor a lot. And as you know, he's become a post Buddhist. We've met, had a very good discussion. The Buddhism that's going to come out of this interaction with cognitive science is not going to look like the Buddhism right now, right? It's, they're going to, they're changing each other, right? The sapiential, the cultivation of the wisdom practices within Buddhism, right. And the science within the cognitive science, they're changing each other. And what's going to come out on the other side, I don't know what it's going to be to look like. So I mean, Buddhism has done this repeatedly, right? It goes into China and it meets Daoism and becomes Chan, and then it travels right into Tibet and because it becomes Vajrayana, travels to Japan and meets Shinto and becomes Zen. So the idea of a single Buddhism, constant. So I think I'm in agreement with you that I think something analogous is going to happen. So here was, here's what I would say. I mean this is a friendly challenge. Part of the issue for many people is a, as I've already mentioned, and you were nodding, so I think you were giving it some acknowledgment, this desire to escape from the historical constraints that we're in and then coupled with that is sort of a pluralistic understanding. The understanding like I see people cultivating what I would call real wisdom and compassion within Buddhism, within Daoism, within Zen. And so for many people, the idea of a singular voice on this seems very questionable to them. And so for me, that's what I ultimately mean when I say I'm sort of non theist, secular A. That's, I'm not, I'm not like Sam Harris, I'm not trying to, I'm not trying to attack religion. I'm trying to say what can we draw from all of them that can be shared by all of us, right?"}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":3425.58,"end":3484.4,"speaker":"Jonathan Pageau","text":"I think that. I think that the. For me, the difficulty in that. And I mean, I've had my kind of flirtation with that idea, let's say, before I became orthodox, I kind of flirted with perennialism and those types of ideologies. I think that the difficulty that I came to realize is that you have to embody a narrative. Like you have to live inside a story. And so the difficulty of the. Let's say, of that approach of, let's say, wanting to take into account pluralism within your own story is that you end up. You end up being on the margin, you end up living in the margin. Right. You can't enter into the story. So to me, there's. There has to be a way to be able to live in the story and to embody the narrative. And that also includes. That includes the actual physical, you know, going into a space, you know, joining, being part of a group. All that has to be part of."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":3484.4,"end":3486.44,"speaker":"John Vervaeke","text":"It has to be a shareable story. I get that."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":3487.08,"end":3502.26,"speaker":"Jonathan Pageau","text":"And so, and so that. That has to. That has to be there. Right. And so the fear that I have about. I mean, I know I don't know enough about your solutions. I do. I have seen kind of what Sam Harris talks about in terms of."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":3502.34,"end":3503.86,"speaker":"John Vervaeke","text":"No, no. Yeah."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":3503.86,"end":3512.98,"speaker":"Jonathan Pageau","text":"Well, even without attacking, let's say, religion, the idea of pulling different. Different things from. From different. Different technologies, let's say, from different traditions."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":3513.06,"end":3518.66,"speaker":"John Vervaeke","text":"Okay, definitely. And I mean this in the philosophical sense. I am not advocating eclecticism."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":3518.66,"end":3519.46,"speaker":"Jonathan Pageau","text":"Right. Okay."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":3519.46,"end":3528.2,"speaker":"John Vervaeke","text":"I'm a cognitive scientist. We practice synoptic integration. I mean, I mentioned at the beginning, this very difficult practice."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":3528.44,"end":3528.8,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":3528.8,"end":3628.47,"speaker":"John Vervaeke","text":"You know, of how do I integrate the ontology, the epistemology, the methodology of neuroscience with psychology, with artificial intelligence. Like, that's really. I'm talking about that. I'm talking about trying to come up with a synoptic integration. We both acknowledged, I think, that in the history, even in the history of Christianity, I mean, like the way Plotinus and Paul were brought together by Augustine, that's a radical thing. And many people, of course, rejected it when Augustine did this. I'm talking about that. I'm talking about that kind of transformative synoptic integration that's going to produce something that is not currently foreseeable. I'm not trying to be an empty utopic. What I'm saying is. No, here are the practices you do. Here are the, you know, here's how you do the cognitive science. Here. Here's what the cognitive science says. Here are the kinds of processes of attention and insight and reflection and self regulation that seem to reliably correlate, predict, help to afford enhanced meaning in life, enhanced wisdom. We are studying all of this scientifically right now. Right. And so I am saying no, get these to talk to each other as much as possible. So not. I'm definitely not advocating either perennialism or eclecticism. That's not talking about this kind of synoptic integration that we have seen being vital like a kairos in, you know, in moments in our history where these things have come together. I gave you instances both from Buddhism and we. And you've acknowledged there's a. There's these, there's these chirotic moments within the history of Christianity too, where you get this happening. That's what I'm talking about."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":3628.47,"end":3671.04,"speaker":"Jonathan Pageau","text":"Yeah, yeah, I think, I mean, I think that definitely. I mean, I could say it this way in a way that would be. That would. Some people might not understand what I'm saying, but I think that that's. The idea of the return of Christ in Christianity has to do with this notion because the. All coming together, let's say in the end it has to happen in a story. It also has to happen to a certain extent. It has to happen in a person. Which is why most, most religions have these central figures. Moses, you know, Buddha, Christ, like there. It has to be embodied in the world. I don't think."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":3671.04,"end":3674.12,"speaker":"John Vervaeke","text":"I mean, Taoism doesn't have a person."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":3674.52,"end":3703.33,"speaker":"Jonathan Pageau","text":"Right? I mean, they do, but he's not as, he's not as prevalent. I mean, he's almost abstract. I agree. Taoism definitely, but is. Yeah, that's, that's for sure. Taoism is different. That might be the, the way I said it might be the, the exception that, that. But we're not. I don't know how Chinese we are in the sense that there's something, There is something very particular about far. About. About Far East Asia, like a way of being that is."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":3704.13,"end":3796.4,"speaker":"John Vervaeke","text":"I mean you, I mean like this. Taoism is like swimming or making love. You have to do the practice. You would say this. You have said it, I've seen it. You have to go into church, you have to do the liturgy, you have to recite with people, you have to do the Daoist practices. I've been doing them for 26 years. It gives you like. You get an understanding. You get this perspectival, participatory understanding that isn't the same as having beliefs or assertions about the nature of reality, etc. It's this other thing. And so I do think that that's definitely there in Daoism in a particular way. And so for me, and again, I'm not trying to press you, but that stands, and that stands for me as this, this like. But here is this right? And people say, well, that's impersonal. No, no, that's not right either. It's. The dao isn't personal or impersonal. It's, It's. It's neither one of those. If you, the way that can be spoken of is not the way. If you try to lock it down into either one of those categories, you're missing, you're missing that dynamic coupling that is so central to relevance realization that we've been talking about from the very beginning. I think Taoism is largely the religion of getting into the flow state. And we're doing increasing cognitive science about the flow state. And we know that the flow state is deeply conducive to people's sense of meaning in life. And the more people get into the flow state, the better they judge their life to be independent of a lot of other variables. And I think Taoism plugs into that in a very powerful fashion."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":3797.6,"end":3819.9,"speaker":"Jonathan Pageau","text":"I think maybe we can. I was. Since we do want to talk about sacred, let's shift gears and talk a little bit, since you didn't mention relevance realization, and that's something that interests me. So I would like to hear a little bit about your vision of how relevant realization connects to the notion of the sacred sacred space or, or even, you know, sacred objects or the sacred in general."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":3820.3,"end":3931.24,"speaker":"John Vervaeke","text":"Yeah. Okay. So I mean, a couple of caveats. I mean, every academic says this, I mean, this is complex, but. And I'm not trying to divert you from possible criticism, but this is very much still, you know, something, a work in progress. This is all I think of. All of my work, all of my scientific work, all of my existential practices, all of my sapiential endeavors are all pointed towards getting this. Okay, you want to put it that way. So. Right. Because I think the ability, whatever what we were talking about, we were disagreeing in some ways, agreeing in others. Getting back to an enacted sacredness is ultimately the solution to the meaning crisis. Everything else I was talking about, about solving historical things, affording people, anagogue, affording them self transcendence, wisdom, compassion, all of that, a way of putting that in a sentence is okay, can we today, today give people this right, the sacred. So how I. How do I think this connects to relevance realization? I think it connects in some very fundamental ways. First of all when I say relevance realization, the way I was talking about it, right. It's not only evolving, it's deeply involving. What I mean by that is relevance realization isn't a cold calculation of where I should pay attention. It's about where you should pay attention. And you know what you really care about, where you pay attention. It's deeply affective to you, the engaging of your energies. It'll touch your central sense of agency. Yeah, you deeply care. Relevance realization isn't only about coping. It's also. It's inextricably also about caring bound together."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":3931.64,"end":3936.84,"speaker":"Jonathan Pageau","text":"Heidegger said Dasein is care. Yes, I fully agree. That's like one of the best definitions."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":3937.32,"end":3970.38,"speaker":"John Vervaeke","text":"And something you should know about that historically is, you know, Heidegger has a huge influence on Dreyfus, Herbert Dreyfus. Herbert Dreyfus introduct. What he did is he is the conduit of Heidegger into cognitive science. And read, for example, being in the World by Dreyfus, you'll see the term he is invoking repeatedly to try and disclose what Heideg is on about is relevance, relevance, relevance, relevance, relevance, relevance. And it was. And it was Dreyfus who criticized sort of the older computational models, what computers can't do."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":3970.46,"end":3970.86,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":3971.18,"end":4016.05,"speaker":"John Vervaeke","text":"Because if they couldn't do relevance realization. So there's a. You're exactly right. Yes. That is a direct, explicit line into my thinking. So it's about this caring. But let's pay attention to this. Right? I'm going to. I have to make very quick gestural arguments and I invite your readers to look elsewhere to other talks and published work. So I'm not arguing from authority, but I can only get like the phenomenology of this relevance realization. Right. It is. It is much lower than the level of our sort of propositional thoughts. Right. And our logical grammar. Think about it. You talk about this, and I was just. Was it the one on. You're doing the Church and you're doing Jacob's Ladder."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":4018.69,"end":4019.25,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":4019.49,"end":4028.17,"speaker":"John Vervaeke","text":"And you talk about this and you even indicate how there's sort of a preconceptual element to this. Because you talk about this like you."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":4028.17,"end":4030.97,"speaker":"Jonathan Pageau","text":"Like that finger pointing, like."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":4030.97,"end":4057,"speaker":"John Vervaeke","text":"Yes. Right. So think about demonstrative reference. Demonstrative reference, right. Any attempt to categorize things presupposes demonstrative reference. If I'm going to say, you know, here, I'm going to group these things together and say, they're all cats. You know what I have to do first? I have to go this, this, this, and that's salience tagging. That's this initial relevance realization that it's pre categorical, allow you to create your categories."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":4057.48,"end":4057.68,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":4057.68,"end":4170.99,"speaker":"John Vervaeke","text":"Whenever we're making a similarity judgment, we're not doing logical similarity because everything, any two things share an indefinite number of properties, we're judging the relevant similarities. So whenever we categorize, whenever we form concepts, we're already relying on relevance realization. Look, if I have concept of glass, out of all of its properties I select the subset and not. And they're not just some arbitrary feature list, it's how they gestalt together, how they. Right. So out of all of this I select some features as relevant, how they're relevant to each other, how they're relevant to me. Representation, categorization, conceptualization depend on relevance realization. All your normative judgments depend on having meaningfully structured experience. I can't judge if something's true, good or beautiful if it isn't meaningful to me in the first place. Right. So all of this, what I'm trying to point to is. And so I mean this overlapping but deeper than is meant in transpersonal psychology. Relevance realization is pre egoic. You emerge out of it, but at the same time, the same time, right. The world as the combinatorial explosives, it is disclosed to you as an arena, the world. And right is right. So there's also all that post egoic combinatorial, explosive depth to reality that is also being disclosed. It's being realized in relevance. It's being put into a form that can couple to your emerging agency. So relevance realization, I try to use this term, it's transjective. It's not what the romantic said. It's not some inner arbitrary thing that we paint on the we express onto the empty canvas of the world either. Is Locke, right? It's not something that the world just imposes on our blank slate of our mind. It's like, and this is what relevance realization says, it's a way in which the world and the mind are coupled together so that they are mutually self disclosing. Mutual self disclosure is love."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":4171.32,"end":4173.12,"speaker":"Jonathan Pageau","text":"Yeah, it's a cell. It's like a sexual relationship."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":4173.12,"end":4208.3,"speaker":"John Vervaeke","text":"It's that of heaven and earth in the Hebrew Bible. Yes, exactly. So, and the idea is, because it has these pre and post egoic elements to it, it is mysterious in Marcel's sense of the word. We can't ultimately frame it. I can't make my relevance realization, I can't completely externalize it. I'm always framing. And so whenever I try to frame my framing, I realize oh crap, I can't do it. And whenever I'm framing the world I realize oh, there's a more encompass."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":4208.3,"end":4210.46,"speaker":"Jonathan Pageau","text":"Oh, oh crap here it's bigger. Yeah, exactly."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":4210.54,"end":4254.35,"speaker":"John Vervaeke","text":"Mystery to mystery. Or as you know, I think of the verse in the psalms. I often use the deep calls to deep. Right in the Psalms. Right. And I think of that as the. So what relevance realization does is it couples these mysteries so they're resonating together in a way that co. Creates our cognitive agency and a meaningful world to us. Now here's the thing. Remember we talked about at the beginning, relevance realization is inherently self correcting insight. And think about how insight is that flash and how meaningful insights are to us. So one of the things that relevance realization is constituted to find an interest in deeply care about is relevance realization."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":4254.43,"end":4255.31,"speaker":"Jonathan Pageau","text":"Yeah, exactly."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":4256.27,"end":4285.66,"speaker":"John Vervaeke","text":"One of the things we do is, and I mean this both in the sense of enhancing and celebrating is we play with our capacity for relevance realization. Think about music. Think about how much we associate music with sacredness because we're playing with this process, these coupling of these mysteries, co creation of our agency and the world and the way in which music is kind of like, you know, moments of insight that are being triggered and it's."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":4285.66,"end":4292.42,"speaker":"Jonathan Pageau","text":"Like an ebb and flow. Like you move from. From insight towards question towards insight towards question. Like totally."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":4292.42,"end":4314.42,"speaker":"John Vervaeke","text":"It's that evolving. Evolving. And I think so when we, when we, when we come up with cultural forms, mythos, right? Symbols, stories in order to make significant to us this significance making. When we make meaning making meaningful to us when we celebrate it and enhance it and cultivate it. That's what I mean by sacredness."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":4314.42,"end":4372.46,"speaker":"Jonathan Pageau","text":"Okay, yeah, yeah, I understand. Yeah, I totally understand. I totally said. I always tell. Tell people that like the structure, the structure of the church. Let's say that this concentric structure of the church with Eucharist in the center and you know, and this kind of moving towards invisible mystery that's hidden in the, in the, in the. The host and everything that. What that's about is. Is it's about getting you to participate in how the world works. Like it's. It's. It's not about that. You know, it's. It's about. It's like you said, it's. It's about relevant realization. Like it's about. It's the sacred is about knowing what's sacred like it. Or participating in what's sacred. It's a. It's this. It's the things which, which. Which moves into it. It's. And so, so it's not when people kind of ask you, like, what does it refer to ultimately? It's like it's, in a way it is referring outwards towards certain signs and symbols, but in the end it's actually moving into itself. It's trying to move you into that very process of moving into something."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":4372.78,"end":4447.16,"speaker":"John Vervaeke","text":"And that's what I mean, I think the coupling. And that's where I like to use the term religion as one of the. One of the contending etymological basis of our word religion because it means this binding, this coupling, this bonding together. You see, the thing that I become really interested in and when I'm looking sort of through the history of the Axial Revolution, Neoplatonism, Gnosticism, I'm very interested in this because gnostic is this sense of participatory knowing. Not just like, not just asserting propositions, not just having skills that I can operate on the world, but this sense of like, no, no, I know it because I'm becoming one with it. I'm internalizing it. I'm not knowing it just with the machinery of my mind. I'm knowing it with the machinery of myself. I am being transformed. And that transformation is disclosing, is informing, informing me the structure of the world. And I'm really trying to get clear about the cognitive science and the phenomenology of this participatory knowing because I think our. If you'll. I hope I'm going to sound postmodern self referential here, but I think our understanding of understanding is impoverished precisely because we have reduced understanding to mostly propositional assertion."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":4447.16,"end":4447.88,"speaker":"Jonathan Pageau","text":"Right, exactly."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":4447.88,"end":4480.8,"speaker":"John Vervaeke","text":"A little bit about. We're now acknowledging procedural knowledge that knowing how to catch a baseball is very different from knowing that a baseball is round. Baseball is. Right. But people are starting to. And I'm. This is what I'm really pushing a lot of work on, this perspectival knowing. Knowing what it's like to be here now, this, this here nowness, this is a kind of knowing that isn't the same as having beliefs or the same as having skills. Ellie Paul talks about this in her book on transformative experience. But below that perspectival knowing, right? Is this participatory knowing."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":4480.8,"end":4497.22,"speaker":"Jonathan Pageau","text":"Right. And that, you know, when you talk about gnosis, I always kind of. Because Gnostics are very popular right now, you know, and they're kind of all around and, and it's interesting because St. Irenaeus, when he wrote his book, you know, against the Gnostics, it was actually called something like the so called Gnostics."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":4497.38,"end":4497.86,"speaker":"John Vervaeke","text":"Yeah."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":4497.86,"end":4534.69,"speaker":"Jonathan Pageau","text":"What he said is that when you propose when your proposition is that let's say phenomenological world or the manifest world is corrupt in itself, you're actually missing out on true knowledge, which is this union of heaven and earth. And so he posits the incarnation as true gnosis because it is really this joining of all things together like the. The. And so it is this. It is this joining of heaven and earth and the figure of Christ that's, That's was. Is true. Is true gnosis for St. Irenaeus and, and it has to do with what you're saying is that in order for true not true knowledge is really this, this, this. Yeah. This, this idea of. Of the. The. The."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":4534.69,"end":4535.01,"speaker":"John Vervaeke","text":"The."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":4535.49,"end":4561.47,"speaker":"Jonathan Pageau","text":"We would say the noose in. In course. So this pre. Ego. Ego capacity into it. The world, you know, and then it comes into. To contact with the created world and then there's this, there's this unity, this possibility of a. The transfigured world of a world that is. That is full of. But it's also. But it's also not static, it's dynamic, but it's, it's constantly full of light."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":4561.47,"end":4605.87,"speaker":"John Vervaeke","text":"But that's what I mean. And I mean that fundamental. That I mean this is. I mean this is from social psychology. You know how you get two people to fall in love with each other have accelerating mutual disclosure. So the more. If I disclose more about me and that makes you disclose more about you. Right. We will fall in love whether it's platonic or romantic. That's how you. And but the thing is that. Right. The knowing by loving. Right. Which is also a theme all the way through. Right. This is the participatory knowing that we're talking about. This knowing by loving. And you know, and the problem. See, you and I have had a long discourse so we can now make those propositions. And they don't sound like Hallmark cards or they don't sound right. But. But that's a problem, right?"}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":4605.87,"end":4646.67,"speaker":"Jonathan Pageau","text":"It is a problem. Yeah. We had, I had. We had. Jordan and I had a discussion with evolutionary psychologist Brett Weinstein. It's on my channel if you want to check it out. And it's interesting because we had this discussion. We talked about relevant realization in other terms. But this notion of, of how, you know, that we have these deep, these deep, let's say imagistic structures that basically shape the way we then look at facts. You know, like you can't avoid it. And it's interesting to watch the comments on Those on that video, because the people coming in from the new atheist side, they basically say you're all gobbledygook. Like what you're saying is just a bunch of, you know, you're just saying stuff. Religious nonsense that doesn't mean anything."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":4646.99,"end":4698.63,"speaker":"John Vervaeke","text":"No, because they're the heart of the science of cognition right there. That's just. I'm sorry, I'm not usually this bold. That's just false. That's just a false claim. I mean there is. I mean there is very good cognitive science behind what I'm talking about. And if you don't think cognitive science is central to the scientific enterprise right now, you're not paying attention to what's happening. The real possibility of autonomous AI is going to impact this culture and our self understanding in a way that is going to make the industrial revolution lead look like a cakewalk. You're not paying attention to cognitive science and you're off running your idea of reducing rationality to syllogistic reasoning. Right. Then you're just not preparing people or yourself for what's coming. I think that is just a deep mistake and it's a false claim. Sorry, I don't mean to be so striking, but I'm very strong on this."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":4698.87,"end":4747.23,"speaker":"Jonathan Pageau","text":"That's good. I'm happy. No, I totally agree. I really, I don't know, I think that, I think. I think we've been going for like almost an hour and a half. I think we could keep going forever. But with that last glorious statement of yours, I think might be a good place to end our first conversation. But for sure, I definitely hope that we can have more because my kind of growing knowledge, understanding of cognitive psychology and cognitive science is kind of pushing me in directions that I had thought. And so I'm going to keep pushing it. Jordan told me to read that book the Master and his emissary by McGilchrist. Yeah, I'll probably be reading that and starting to try to address these questions that I haven't addressed in those terms yet. So I'll probably look at. I mean, hopefully as these books keep coming out, I'll be looking forward. When is the next one coming out?"}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":4748.03,"end":4773.76,"speaker":"John Vervaeke","text":"The next one? The Genealogy of the. We call it Unsheltered because we're evoking the loss of the sacred canopy that's in the first book and the whole sense of domicide, the loss of a sense of being at home in the world. So we're hoping to have the draft done by sort of June, end of June and then there'll be the two or three month process of the publication. So probably by the fall of this year."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":4773.84,"end":4774.56,"speaker":"Jonathan Pageau","text":"Okay, great."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":4774.64,"end":4809.64,"speaker":"John Vervaeke","text":"I mean, I go on sabbatical in July, so I'll be able to devote more time. I would very. Look, I was excited about this and it more than met my expectations. I would love it if we could talk again. I think. I mean, we have disagreements, but they seem to be. I mean, we seem to be able to incorporate them into furthering the dialogue and the discourse. And it seems to be mutually informing in a way that I think we both are benefiting from. Like I say, you've provided me with a lot of insights. I'm now teaching the Buddhism and cognitive science course in the summer and I'm going to have my students look at some of your work."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":4809.72,"end":4842.3,"speaker":"Jonathan Pageau","text":"Oh, that's great. I appreciate that. I would say if you, if you want to look into a few things, like I, I really tell people to look into Saint Maximus the Confessor. He's really, he's really a key and I think he's a key right now to helping people make sense of what, how, what, how religion could fit into, into the world right now. And also how it relates to cognition and how it relates to the notion of gathering phenomena into coherent entities. Like, he's really, to me, he's a key. And there's quite a few introductory texts to his work that are, that are easily."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":4842.3,"end":4847.84,"speaker":"John Vervaeke","text":"They can. After watching some of your talk, I ordered Andrew Louth. I don't know."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":4848,"end":4848.88,"speaker":"Jonathan Pageau","text":"That book is great."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":4849.04,"end":4858.96,"speaker":"John Vervaeke","text":"Introduction to Eastern. So I got that because I do want to understand it better. One last. What is the connection between people like Maximus and see, I know Dionysus very well."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":4858.96,"end":4859.44,"speaker":"Jonathan Pageau","text":"Yes."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":4859.52,"end":4860.76,"speaker":"John Vervaeke","text":"Because of the. Yeah."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":4860.76,"end":4869.92,"speaker":"Jonathan Pageau","text":"So you could see St. Maximus as taking Dionysius the Dionysian corpus and trying to, let's say, smooth it out a little bit."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":4870.25,"end":4870.57,"speaker":"John Vervaeke","text":"Yeah."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":4870.57,"end":4919.81,"speaker":"Jonathan Pageau","text":"Make it more incarnational. Because Dionysus really, really, he stresses the hierarchy so much. And so it's like St. Maximus takes Dionysus ideas of hierarchy, but then really tries to bring them into this notion, this incarnational notion and the idea of the gathering in. And so he. A lot of people say that he makes Dionysus more Christian. Let's say that's what one of the ways that people tend to see St. Maximus because, because there were some difficulties with Dionysus in some of the terms he uses and he's trying to kind of help make it more. But Saint Maximus is really in the line of Saint Gregory of Nyssa as well and other fathers that were more into These questions, obviously, the ones that I'm interested as well. But there's also St. Gregory of Palamas, who's really harder to read because he's later. And so he's using a lot of technical terms."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":4919.81,"end":4920.61,"speaker":"John Vervaeke","text":"Right, right, right."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":4922.13,"end":4926.48,"speaker":"Jonathan Pageau","text":"But for sure, Maximus, if you read a good introduction of him, he's. He's accessible, for sure."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":4926.48,"end":4929.64,"speaker":"John Vervaeke","text":"Well, like I say, I'm going to read the Laos book and then I'll proceed from there."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":4929.88,"end":4939.08,"speaker":"Jonathan Pageau","text":"And yeah, so I think that'll be. And as I, as I keep watching your lectures, I'm probably going to watch your Buddhism lectures as well. And so it'll give us fuel for a future discussion."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":4939.24,"end":4941.24,"speaker":"John Vervaeke","text":"I would like that very much. I look forward to it."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":4941.32,"end":4955.92,"speaker":"Jonathan Pageau","text":"All right, so everybody, I would say you can find the book Zombies in Western Culture that John wrote. It's free online. You can also order a printed version if you want, but you can read it as a PDF online. So that's great. And I look forward to another discussion with John."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":4958.4,"end":5013.27,"speaker":"Jonathan Pageau","text":"Thank you for listening to the Symbolic World podcast. As you know, this podcast is for now based mostly on my YouTube videos, which I am transferring into audio format. Please go ahead and visit my YouTube channel. There are more videos there on different subjects that I'm not going to put into audio. And please share, share this to your friends. I know a lot of people know about the YouTube content, but not so many people know that this is also a podcast. So share it to your friends. Share it on social media. And if you can, feel free to support this financially as well by going to my Patreon page, which is Pageau videos, strangely, you can go there and you can support it at any amount that you want. A month for all the patrons. I do a monthly Q and A, a live Q and A in which people can ask questions in the chat. And I try to have a more personal connection with people. The YouTube comments have become difficult to follow and to answer."}
{"episode_id":"SW - #030 - 2019-03-05 - Cognitive Science and the Sacred","start":5013.43,"end":5014.31,"speaker":"Jonathan Pageau","text":"I'll see you soon."}
