{"episode_id":"SW - #200 - 2021-11-16 - Richard Rohlin - The Holy Grail - The Key to Understanding the West - Part 1","start":0.24,"end":40.71,"speaker":"Jonathan Pageau","text":"So, hello, everybody. We are back with Richard Rowland for one more episode of our Universal History. We've been talking about a lot of stuff in the past several months, some things that many people had never heard about strange legends going to the ends of the earth with our series on Ethiopia. But now a lot of people will be excited because we're finally coming to talk about the Grail. And many people have been waiting for us to talk about the Grail just because it's such a prominent figure in Western legends and there's so much around it, even up to today in popular culture. So I'm really happy to have Richard to talk about this because I know he's going to surprise me as well with some of his knowledge. And so, Richard, thanks for coming along."}
{"episode_id":"SW - #200 - 2021-11-16 - Richard Rohlin - The Holy Grail - The Key to Understanding the West - Part 1","start":41.51,"end":72.51,"speaker":"Richard Rohlin","text":"I'm super excited to do this. The Grail is really important to me and I think it's one of these great nexus points in the whole question of universal history. So I think that. I think that by the end of probably it's going to take us maybe a couple of videos to get through some of this Grail material. By the time we get through that, I think people will have a much better idea about, let's say, sort of the organic way that universal History kind of develops. And then it's actually kind of this ongoing process."}
{"episode_id":"SW - #200 - 2021-11-16 - Richard Rohlin - The Holy Grail - The Key to Understanding the West - Part 1","start":72.75,"end":121.62,"speaker":"Jonathan Pageau","text":"Right. This is Jonathan Pedro. Welcome to the symbolic world. So before we start, though, I have a little personal thing going on, which is that Richard is one of the first people to actually read a copy of God's Dog. As many people know, at the end of October, probably when this is coming out, the crowdfunding will have already started for our graphic novel. And so I wanted Richard to say a few things about what he thought about our graphic novel."}
{"episode_id":"SW - #200 - 2021-11-16 - Richard Rohlin - The Holy Grail - The Key to Understanding the West - Part 1","start":121.94,"end":222.38,"speaker":"Richard Rohlin","text":"Well, first of all, you owe me an afternoon because I had sat down. I was actually at a coffee shop working, and I sat down, I was like, all right, I got this list of things. I'm going to do some writing and some study and all this different stuff. And then as I'm in the middle of that, you messaged me and you're like, hey, do you want to look at God's dog? And I was like, well, I guess that's the rest of my day. So it's really cool. There are just, I mean, just the opening pages, there are so many things in them which if people have been attentive long term viewers and listeners of your podcast, they're going to pick up on probably instantly. But I think the thing that's really impressive to me is the way that all of those symbolic elements, like, they're not just, like, here's a neat symbolism thing. Let's wedge this in. But they are really brought together in this very cohesive way, in this medieval way of relating them to each other in such a way that we can see how these concepts relate. I think there are probably very few people who are going to be really bothered by, let's say, the freedom that you take with chronology. I say very few people because I think that kind of person probably isn't going to read your graphic novel anyway. But I also think it's maybe going to be a really great proof case for how a bunch of the things that we're talking about in universal History, in hagiography, in all these Christian legends, the lives of the saints. I mean, you've got Saint George is in there, Saint Christopher is in there. Saint Simeon the stylite is in there."}
{"episode_id":"SW - #200 - 2021-11-16 - Richard Rohlin - The Holy Grail - The Key to Understanding the West - Part 1","start":222.95,"end":225.15,"speaker":"Jonathan Pageau","text":"Um, where people who obviously did not exist."}
{"episode_id":"SW - #200 - 2021-11-16 - Richard Rohlin - The Holy Grail - The Key to Understanding the West - Part 1","start":225.15,"end":247.87,"speaker":"Richard Rohlin","text":"People. People who obviously didn't. Didn't ever meet. Right. Yeah. And. But they're all sort of in there together. And. And of course, St. George is. Is a really cool character. We're big St. George fans at my. At my house. So there's that one. That one sequence that I sent you a screenshot of, and I was like, this is really cool. And I. I had to. I had to come and come home and show that to my son George, who's named after St. John. Nice."}
{"episode_id":"SW - #200 - 2021-11-16 - Richard Rohlin - The Holy Grail - The Key to Understanding the West - Part 1","start":247.87,"end":248.71,"speaker":"Jonathan Pageau","text":"Oh, I didn't know."}
{"episode_id":"SW - #200 - 2021-11-16 - Richard Rohlin - The Holy Grail - The Key to Understanding the West - Part 1","start":248.71,"end":275.26,"speaker":"Richard Rohlin","text":"And, yeah, so I don't know. It's going to be really great. I think this. It's going to do a lot of really important things. One of the things it's doing, and I know this is probably one of your main goals, is to return what should be, let's say, our native storytelling language. And you know that I am obviously a big Tolkien fan. I have a whole podcast about Tolkien. Right."}
{"episode_id":"SW - #200 - 2021-11-16 - Richard Rohlin - The Holy Grail - The Key to Understanding the West - Part 1","start":275.26,"end":276.58,"speaker":"Jonathan Pageau","text":"There's no doubt of your."}
{"episode_id":"SW - #200 - 2021-11-16 - Richard Rohlin - The Holy Grail - The Key to Understanding the West - Part 1","start":276.82,"end":399.93,"speaker":"Richard Rohlin","text":"There's no. So my. My Tolkien bona feeds should not be in. Right. But I think part of the reason that Tolkien is so dominant when it comes to imaginative storytelling, especially in Christian spheres, to the point that most of us, if we are going to sit down and write a work of, like, fantasy fiction or something, I mean, Tom Shippey says you have to spend the first few years just writing the Tolkien out of your system. Right. But part of the reason that he's become so dominant is precisely that his books came along at a time when Christians had lost their native storytelling language. Like, we become so disconnected from it that the only option that we really had was to make something like Middle Earth. So I think that. And I'm not saying that's bad, obviously, again, I don't think anyone's going to question my love of Tolkien, but I do think that it's really important that we regain our. Regain this. This what should be for Christians, it should be our native language. Right. And the thing is, like, once you do that, once you get really deep into something, then you go from having, you know, you enter into the glorious freedom of the sons of God. Right. You go from having to be, like, just really rigidly strict with, okay, this. This chronology. And I'm going to write this. This incredibly, you know, like, detailed historical novel, and maybe I don't believe these miracles and got to question all these things. Right. You go from that approach to instead being able to. Because you inhabit these things as like a native speaker of the language, you can then play with it with the kind of freedom that a native speaker of English has. Right. A native speaker of English can do certain things with poetry that somebody who's learning English as a second language can't do or wouldn't understand. And I think you've accomplished that in this graphic novel. And I want to encourage everyone to please go and back it. I'm going to be getting multiple copies for gifts. I mean, Christmas is coming up soon, so I don't know if they'll fulfill before Christmas."}
{"episode_id":"SW - #200 - 2021-11-16 - Richard Rohlin - The Holy Grail - The Key to Understanding the West - Part 1","start":399.93,"end":400.77,"speaker":"Jonathan Pageau","text":"Probably not."}
{"episode_id":"SW - #200 - 2021-11-16 - Richard Rohlin - The Holy Grail - The Key to Understanding the West - Part 1","start":401.01,"end":416.41,"speaker":"Richard Rohlin","text":"Probably not. I didn't promise. Promise, just to be clear. But anyway, I'm going to be getting multiple copies as gifts, and I would encourage other people to do so as well. We want this book to do well so that we can have lots more things like this. Yeah."}
{"episode_id":"SW - #200 - 2021-11-16 - Richard Rohlin - The Holy Grail - The Key to Understanding the West - Part 1","start":416.41,"end":438.43,"speaker":"Jonathan Pageau","text":"Thanks, Richard. I appreciate it. Yeah. The goal of this first crowdfunding is to kind of generate enough excitement and, honestly, enough money so that we can now put these out regularly, you know, like every six months or whatever, so we can get the whole story out. Because this is just the first chapter. It's just the beginning. The story is already totally written. It's very big, so we need a lot of room to tell it."}
{"episode_id":"SW - #200 - 2021-11-16 - Richard Rohlin - The Holy Grail - The Key to Understanding the West - Part 1","start":438.51,"end":469.73,"speaker":"Richard Rohlin","text":"There's this great moment at the beginning of the graphic novel. If I can just share a little bit of. It's not really a spoiler, but where there's, you know, these pilgrims are walking along and they're singing this hymn. And I read the hymn and I messaged you and I said, which Syrian hymn is that? Like, I couldn't remember which one it was, but it was so obviously Syrian, you know, that it. It seemed like it. Like it had to be. And then you messaged back and, oh, it's this one. But it was just. It was really cool. Yeah. So I'm jazzed about it."}
{"episode_id":"SW - #200 - 2021-11-16 - Richard Rohlin - The Holy Grail - The Key to Understanding the West - Part 1","start":469.73,"end":473.81,"speaker":"Jonathan Pageau","text":"Cool. All right, now onto the Grail. So we'll start us off with the Grail."}
{"episode_id":"SW - #200 - 2021-11-16 - Richard Rohlin - The Holy Grail - The Key to Understanding the West - Part 1","start":474.05,"end":501.33,"speaker":"Richard Rohlin","text":"So what I wanted to do for this first video on the Grail is to talk about what we could say. The seeds or the sources are the ground out of which the Grail legends, which are primarily explored through a genre of literature called a romance. Not. Not like, you know, people falling in love, married. Hopefully the people who watch your show are, like, astute enough to know what. What that term means. Right. A romance basically just means, like a high adventure story. Right, yeah."}
{"episode_id":"SW - #200 - 2021-11-16 - Richard Rohlin - The Holy Grail - The Key to Understanding the West - Part 1","start":501.33,"end":505.25,"speaker":"Jonathan Pageau","text":"Because we've been talking about the Alexander Romance, and so I'm sure they knew it wasn't a love story."}
{"episode_id":"SW - #200 - 2021-11-16 - Richard Rohlin - The Holy Grail - The Key to Understanding the West - Part 1","start":505.33,"end":632.74,"speaker":"Richard Rohlin","text":"Right, right, right. Yes. Now, actually, people, you know, do actually fall in love and get married in these stories, but they're not just about that. So. Okay, so I want to talk about three sources, and the first will be what I'll call the Celtic reliquary tradition. So those of you who are wanting, like, the symbolism of Ireland and things like that, you're not going to quite get that in this video, but you are going to get some of it. The second thing I want to talk about is the. Let's call her the Iberian Virgin and her Grail. And then finally, I want to end on Joseph of Arimathea, who is, of course, very important to the great legends and his links to the Byzantine mystical tradition and sort of how all that comes in. So I'm not going to actually talk about the romances themselves today. And I think the reason for that will be sort of more apparent when we get to the end. So, to begin with, in the Celtic tradition, the way that Celtic Christianity thought about and treated relics is a little bit different from what maybe other traditions have done. So in the Celtic tradition, there's a great deal of veneration given to the relics of the saints. This is nothing unusual in Christianity. What's unusual is that these relics don't always mean bones. In fact, they usually don't mean the bones of a saint. They usually seem to mean items that the relic that the saint has left behind them. Liturgical books, gospels, crosiers, bells, chalices, etc. And if you read Celtic hagiography, and I've been reading quite a lot of it lately, what you're going to find is a very unique honor and reverence that are given to these items that's different from what you find in the rest of Christianity. And there's some scholars who think that this is like a, Say, a sanctification of the idea of the tribal palladium, like the relics or the idols of the tribe or whatever that are sort of passed down in Celtic culture. That may or may not be the case. If it is the case, it's not a problem for us. Right, yeah."}
{"episode_id":"SW - #200 - 2021-11-16 - Richard Rohlin - The Holy Grail - The Key to Understanding the West - Part 1","start":632.74,"end":651.43,"speaker":"Jonathan Pageau","text":"But it's also there in scripture in terms of the passing of the skins of Elijah to Elisha. And then there's also the ark itself, which is this kind of physical object, which isn't. Which isn't the body of the saint, but which, let's say, gathers together a certain amount of authority or power with it."}
{"episode_id":"SW - #200 - 2021-11-16 - Richard Rohlin - The Holy Grail - The Key to Understanding the West - Part 1","start":651.51,"end":654.15,"speaker":"Richard Rohlin","text":"Right, right. And that's the thing to remember the."}
{"episode_id":"SW - #200 - 2021-11-16 - Richard Rohlin - The Holy Grail - The Key to Understanding the West - Part 1","start":654.15,"end":657.91,"speaker":"Jonathan Pageau","text":"Arkad to this idea of this ephod which is transmitted, you know, all this stuff."}
{"episode_id":"SW - #200 - 2021-11-16 - Richard Rohlin - The Holy Grail - The Key to Understanding the West - Part 1","start":658.15,"end":705.07,"speaker":"Richard Rohlin","text":"Yeah. That's the thing to remember about the ark is that it's a container. It held the tables of the law and the manna, and Aaron's rod that budded and Goliath's sword, weirdly enough. Right. So that's. Or at least. At the very least, they kept Goliath sword in the tabernacle. Right. When David shows up there to get some food, he needs food and a weapon. And they said, well, the only food we have here is the showbread, and the only weapon we have here is Goliath's sword. So they had taken the sword of this Nephilim and they had actually kept it in the holy place in the tabernacle. So that's. Yeah, that's another video for another day. But. All right, so the flaming sword symbolism on the. I know, I know."}
{"episode_id":"SW - #200 - 2021-11-16 - Richard Rohlin - The Holy Grail - The Key to Understanding the West - Part 1","start":705.55,"end":714.11,"speaker":"Jonathan Pageau","text":"So basically, this Gaelic tradition of the importance of objects which are transmitted and which can be connected to a saint."}
{"episode_id":"SW - #200 - 2021-11-16 - Richard Rohlin - The Holy Grail - The Key to Understanding the West - Part 1","start":714.59,"end":948.26,"speaker":"Richard Rohlin","text":"Right. And so, for instance, you had things like the book of Saint Columba, which was supposed to be. Which was born. They carried it out in battle, which is not unusual for relics in the Middle Ages. But the belief was that if a person who was pure of heart carried the book, then it would bring victory for the clan. And of course, there are other relics that give oracles. One of the most important kinds of relics in the Celtic tradition is a bell, which is actually one of the forms that the grail takes. We'll talk about that later. Probably the bell. And of course, what are bells used for in Western liturgy? They're used at the Moment of the sacring, right at the moment of. Of the consecration of the gifts. That's a bell. There's a bell. It's called the sacring bell. That is rung. They still do this in some traditional Western liturgies. So bells are very important. And the idea was. And the miracles that are attributed to these relics, they're oracles. There's bells that refuse to ring in the hand except of the person to whom it belongs, the saint. So how do you know is this saint legit or not? Right. Is he really the one who's supposed to be our bishop? Well, the bell rings for him and not for anyone else. There's, you know, there's another bell that actually, like, sails through the air from Jerusalem to Wales, right. As a gift from heaven to this particular bishop. Some of the other items are really, really interesting. For instance, one of the most common forms that we find in Welsh and Irish hagiography is the idea of a. Of an altar. Right. And we don't typically think of an altar as being a relic because we think of an altar as being like, you know, it's large, it's unwieldy, and it's more or less fixed to a certain place. Right. But in the Celtic tradition, there are all of these floating altars, flying altars. Right. And I think this is somehow connected to the. The interconnectedness of. So the ancient Irish thought of, let's say, mist. Of course, there's a lot of mist in that part of the world. They thought of it as still sort of being part of heaven. And so there was this idea that heaven and earth kind of became, like, were a little more permeable at certain places. Right. And so this idea of the floating altar seems to be connected to this. So one that's actually really important to the Grail legend is the altar that was given to St David of Wales. This is, you know, the patron saint of Wales. And the story about him is that his birth was foretold to his father by an angel in a dream. And his father was supposed to go out hunting when he was going to find three things. He was going to find a stag, a fish, and a honeycomb. Each of these items are somehow foretelling or prophetic of St. David's ministry. So, for instance, the angel says that as the honey is in the wax, so he, that is David, will hold a spiritual sense in a historical instrument, which I just mentioned here, because I think that's a great way to sort of describe symbolism or way to describe universal History, where you have these patterns that are above the historical, but now they're manifesting in historical ways. That was supposed to be what the life of the saint is. But there's also this fish and this fish on which he was supposed to be fed. Now, I think most people know that the fish is an ancient symbol for Christianity. What people sometimes don't realize, especially down here in Texas, pretty much every other car has like a little fish bumper sticker on it. What most of the people who have those bumper stickers don't probably understand is it's not just that the fish is a symbol for Christianity, but it's specifically a Eucharistic symbol."}
{"episode_id":"SW - #200 - 2021-11-16 - Richard Rohlin - The Holy Grail - The Key to Understanding the West - Part 1","start":948.26,"end":949.86,"speaker":"Jonathan Pageau","text":"Yeah, it's a symbol of the Eucharist."}
{"episode_id":"SW - #200 - 2021-11-16 - Richard Rohlin - The Holy Grail - The Key to Understanding the West - Part 1","start":949.86,"end":956.14,"speaker":"Richard Rohlin","text":"Right, right. So you got all these, you know, evangelicals, God bless them, driving around with the symbol of the Eucharist on the back of their."}
{"episode_id":"SW - #200 - 2021-11-16 - Richard Rohlin - The Holy Grail - The Key to Understanding the West - Part 1","start":956.78,"end":969.18,"speaker":"Jonathan Pageau","text":"Yeah, because it's the fish giving in a way. It's like the gift, because the fish is giving itself to be eaten. Yes, that's the mystery. It's like, that's why like. Or else why would you have a fish as a symbol for Christianity?"}
{"episode_id":"SW - #200 - 2021-11-16 - Richard Rohlin - The Holy Grail - The Key to Understanding the West - Part 1","start":969.18,"end":971.54,"speaker":"Richard Rohlin","text":"And it's also like the treasure that's drawn up out of death."}
{"episode_id":"SW - #200 - 2021-11-16 - Richard Rohlin - The Holy Grail - The Key to Understanding the West - Part 1","start":971.54,"end":972.46,"speaker":"Jonathan Pageau","text":"Yes, there's that as well."}
{"episode_id":"SW - #200 - 2021-11-16 - Richard Rohlin - The Holy Grail - The Key to Understanding the West - Part 1","start":972.78,"end":1010.26,"speaker":"Richard Rohlin","text":"All these different things. Right. There's another saint that's really wonderful. His name is Ilar, which is the same name as Hillary, but it's not Hilary of Poitiers, it's a different Ilar. And Ilar was just found. He was a foundling. He was found on the stone in the middle of a river. So they took him and the monks that found him took him. They came back the next day and on that stone in the middle of the river, there was just a fish. So they took that and they fed the child with the fish. And they came back every day. Every day for his whole childhood, there was the fish and that's what they fed him with. And then he grew up to be this, you know, awesome wonder working saint. And he could talk to animals and all this stuff. Right. I mean, I loved."}
{"episode_id":"SW - #200 - 2021-11-16 - Richard Rohlin - The Holy Grail - The Key to Understanding the West - Part 1","start":1010.26,"end":1011.66,"speaker":"Jonathan Pageau","text":"I love all the best stuff of."}
{"episode_id":"SW - #200 - 2021-11-16 - Richard Rohlin - The Holy Grail - The Key to Understanding the West - Part 1","start":1012.62,"end":1019.34,"speaker":"Richard Rohlin","text":"I just love this stuff just enormously. Right. And so of course, the. There."}
{"episode_id":"SW - #200 - 2021-11-16 - Richard Rohlin - The Holy Grail - The Key to Understanding the West - Part 1","start":1019.42,"end":1021.42,"speaker":"Jonathan Pageau","text":"We're talking about the floating altars, right?"}
{"episode_id":"SW - #200 - 2021-11-16 - Richard Rohlin - The Holy Grail - The Key to Understanding the West - Part 1","start":1021.98,"end":1038.95,"speaker":"Richard Rohlin","text":"Yeah. So I'm just mentioning the fish thing because the fish and the floating altars seem to be connected. And there's of course, this really important floating figure in the later Grail stories, the rich fisherman or the fisher king. Right. Who's going to become really important to the story of the Grail So just sort of like, you know, put a pin in that."}
{"episode_id":"SW - #200 - 2021-11-16 - Richard Rohlin - The Holy Grail - The Key to Understanding the West - Part 1","start":1038.95,"end":1046.59,"speaker":"Jonathan Pageau","text":"I'm interested to hear your opinion on that, because as a French person, I always see it as the sinner king. Like, that's how I see it, but."}
{"episode_id":"SW - #200 - 2021-11-16 - Richard Rohlin - The Holy Grail - The Key to Understanding the West - Part 1","start":1046.59,"end":1059.7,"speaker":"Richard Rohlin","text":"Oh, interesting. Yeah, we can talk about that. Yeah. So in the. Yeah. So in the earliest Romantis, we see the ancestor of the grail keepers is he's made to catch this miraculous fish. And that's what gives him this title. That's. That's passed down."}
{"episode_id":"SW - #200 - 2021-11-16 - Richard Rohlin - The Holy Grail - The Key to Understanding the West - Part 1","start":1059.94,"end":1060.22,"speaker":"Jonathan Pageau","text":"And."}
{"episode_id":"SW - #200 - 2021-11-16 - Richard Rohlin - The Holy Grail - The Key to Understanding the West - Part 1","start":1060.22,"end":1071.38,"speaker":"Richard Rohlin","text":"Yeah, we can talk a little bit more about that. But I want to note it. Just note here that among Welsh saints and among Celtic saints, this. This idea, this. There's a connection to fishing and to fish that."}
{"episode_id":"SW - #200 - 2021-11-16 - Richard Rohlin - The Holy Grail - The Key to Understanding the West - Part 1","start":1071.38,"end":1071.94,"speaker":"Jonathan Pageau","text":"Okay."}
{"episode_id":"SW - #200 - 2021-11-16 - Richard Rohlin - The Holy Grail - The Key to Understanding the West - Part 1","start":1071.94,"end":1141.58,"speaker":"Richard Rohlin","text":"Seems to crop up over and over again. Now, I mentioned all of this because the possession of these relics of the saints, altars, bells, chalices, croziers, gospel books, et cetera, the possession of these relics is a real, really important theme, so especially in Welsh Christianity. So, you know, when. When Cad Waller, that is sort of like the last great Welsh king, when he dies in battle, is prophesied that he will return, obviously this is what happens, Right? It's prophesied that he will return when all of the ancient relics of the Welsh church are revealed, when they're uncovered, when they manifest again. So it's like. And the idea is it's not that we've totally lost them, but they're in hiding right now. So there's this idea that you have these families very much like what's going on with the ark in Ethiopia, but obviously more obscure. There's this idea that you have this handed down tradition of the relics of one saint to somebody in their lineage, and that the person who has inherited them also inherits, like that cloak of Elijah that you mentioned, also inherits some degree of their grace."}
{"episode_id":"SW - #200 - 2021-11-16 - Richard Rohlin - The Holy Grail - The Key to Understanding the West - Part 1","start":1141.74,"end":1142.22,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #200 - 2021-11-16 - Richard Rohlin - The Holy Grail - The Key to Understanding the West - Part 1","start":1143.02,"end":1197.19,"speaker":"Richard Rohlin","text":"So I mentioned all of this to say that in the Celtic tradition, and this is picked up in one of the later romances called the High History of the Holy Grail, the Grail doesn't have one form. The Grail has five forms. And it is strongly implied that these forms, at least one of these forms, is a bell, a sacring bell. We're not told what all of the forms are, though. And the reason we're not told what all the forms are. I'll read this again in our next video. The reason we're not told what all of the forms are is that it says it's not good to speak too explicitly of the sacraments. So when Arthur goes into the chapel of the Grail. And he actually sees the Grail in this particular version of the story. He sees it in the context of the mass of the liturgy, and the five forms of the Grail are revealed to him. And we're told the final form is the chalice, but we're not told what the other four are. Again, there's a strong implication that at least one of them is the bell."}
{"episode_id":"SW - #200 - 2021-11-16 - Richard Rohlin - The Holy Grail - The Key to Understanding the West - Part 1","start":1197.19,"end":1197.87,"speaker":"Jonathan Pageau","text":"Is the bell."}
{"episode_id":"SW - #200 - 2021-11-16 - Richard Rohlin - The Holy Grail - The Key to Understanding the West - Part 1","start":1198.35,"end":1198.87,"speaker":"Richard Rohlin","text":"Interesting."}
{"episode_id":"SW - #200 - 2021-11-16 - Richard Rohlin - The Holy Grail - The Key to Understanding the West - Part 1","start":1198.87,"end":1312.88,"speaker":"Jonathan Pageau","text":"I want to say something a little bit about the idea of the relic and the power, because one of the things you mentioned, I think it's important for people to see the connection is that when you believe in a world where symbolism happens, let's say there's a sense in which you talked about how if someone carries the book of St. Columba and has a pure heart, then the relic will be effective. That is, the relic will become a vehicle, you know, a connection between the two. And so there's a sense in which this is something which I think would have been implicitly understood in the different legends of these relics and goes into the Grail, which is that the only knight that can find the Grail, that can reach the Grail, has to have a pure heart. So there's actually a notion. The fact that you receive it is almost like a proof that you're a pure heart. Right? There's a connection where because you have a pure heart, you. You have access to this, but then having it becomes a proof of the fact that you also have a pure heart. And so there's a. There's a incarnational way of seeing the world where it's not like there isn't this arbitrary capacity. I say this because just. Because I was telling Richard recently that I Just before that, I watched the movie Constantine again, where you have this arbitrary idea that if you can get this relic and if you can get this object, then you're going to have a certain power that you can then use. And it's almost like finding a grenade or finding a bomb. It's completely arbitrary. It has nothing to do with virtue. It's like Harry Potter style magic, where you just have to, like, technically be proficient and learn these spells in the right way and know how to use these things, almost like mechanical tools. But that is not the way in which ancient people thought there was a deep connection between a virtue and, let's say, the power that the objects could have and also kind of Christian faith and all of this, and the manner in which objects could manifest or have power in the world."}
{"episode_id":"SW - #200 - 2021-11-16 - Richard Rohlin - The Holy Grail - The Key to Understanding the West - Part 1","start":1313.28,"end":1389.27,"speaker":"Richard Rohlin","text":"So all of this. So all of this, it's important to remember because the relic is always a. It's not just that the. That the relic has, like, the powers of the virtues of the saint. Right. That this is God's power. Right. It's God's grace, we would say his, you know, like his energies. It's something that's constantly given to. To us as a gift. Right. And so, yeah, it's not this mechanical thing. And that's part of why we have to be really careful about how we talk about this stuff. And that's why there would be a certain amount of secrecy about, you know, even just like a saint whose relics we have. Right. We don't parade them around the streets, you know, just, you know, for the, you know, exposing the mystery. Right. At the very least, we're going to have it in the name of the church, Some relics or, you know, especially holy icons, Things like this. We might bring out uncertain feast days. Right. There would be a time when the mystery is revealed, but we don't, you know, again, yeah. It's not this mechanical thing. I was literally just arguing with somebody about that on discord before this video started. I said, every time you say the word magical system, a fairy dies. You know, I can't. I really. I cannot stand systematized magic in fantasy fiction."}
{"episode_id":"SW - #200 - 2021-11-16 - Richard Rohlin - The Holy Grail - The Key to Understanding the West - Part 1","start":1389.27,"end":1389.79,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #200 - 2021-11-16 - Richard Rohlin - The Holy Grail - The Key to Understanding the West - Part 1","start":1389.79,"end":1488.17,"speaker":"Richard Rohlin","text":"I want to mention one thing, because this will be really important for talking about the grail later on, but also, you're going to get just a tremendous kick out of it being who you are. Okay. So St. David is given this altar, right? And so this happens when he is on. He is on his pilgrimage to Jerusalem. That he is. We're told that as God gave Matthias in Judea, Christ in Jerusalem, and Peter in Rome, so he has given St David to be in the island of Britain. So the idea that St. David was sort of like the keeper of the apostolic lineage in the island of Britain. And this is a long time before the Joseph of Arimathea stuff and all this. Right. And we're told that the patriarch of Jerusalem, who's the one consecrating David as bishop, gives him one of these altars, it says, a certain hallowed altar in which the lord's body had reposed. And this seems to be connected to that stone. There's that stone in the church of the holy sepulchre. I can't remember the name right now, that stone on which Christ's body was laid after he was brought down off the cross. And that whole. All the legends and the stories surrounding what happens to Christ's body when it's brought down off the cross are going to be essential to understanding where the Grail comes from. So we're told that he's given this hallowed altar in which the Lord's body had repose, which abounded in innumerable virtues. And then we're told, never was this altar seen after the death of the Bishop, St David by any son of man. But it lies hidden, covered with skins."}
{"episode_id":"SW - #200 - 2021-11-16 - Richard Rohlin - The Holy Grail - The Key to Understanding the West - Part 1","start":1488.81,"end":1489.21,"speaker":"Jonathan Pageau","text":"What?"}
{"episode_id":"SW - #200 - 2021-11-16 - Richard Rohlin - The Holy Grail - The Key to Understanding the West - Part 1","start":1489.61,"end":1490.41,"speaker":"Richard Rohlin","text":"I know, right?"}
{"episode_id":"SW - #200 - 2021-11-16 - Richard Rohlin - The Holy Grail - The Key to Understanding the West - Part 1","start":1490.57,"end":1491.77,"speaker":"Jonathan Pageau","text":"Strange legend."}
{"episode_id":"SW - #200 - 2021-11-16 - Richard Rohlin - The Holy Grail - The Key to Understanding the West - Part 1","start":1492.09,"end":1503.85,"speaker":"Richard Rohlin","text":"Yeah. And so. And so. And it says, hence the common people call it the gift from heaven. So as we talk about the. I just. I knew you would love the fact that it's covered in skin."}
{"episode_id":"SW - #200 - 2021-11-16 - Richard Rohlin - The Holy Grail - The Key to Understanding the West - Part 1","start":1503.85,"end":1504.53,"speaker":"Jonathan Pageau","text":"Oh, yeah."}
{"episode_id":"SW - #200 - 2021-11-16 - Richard Rohlin - The Holy Grail - The Key to Understanding the West - Part 1","start":1504.53,"end":1608.98,"speaker":"Richard Rohlin","text":"What else would you cover it in? But there's also another saint actually, in. In the same book, Saint Karanak, to whom we're told that Christ gave an honorable altar from heaven the color of which no person can comprehend. But this altar is also wrapped in skins most of the time. So it's like this jeweled altar that's like a color that no one on earth has ever seen, but it's kept veiled. Right. So I'm going to mention. I mentioned this because the key idea of the Grail isn't really just a chalice. Right. Obviously, that becomes the most enduring image for kind of obvious reasons. In some senses, it's because it's the best image. Right. But the idea of the Grail is really something which is hidden, which contains or has contained the body and the blood of Christ. Right. So there's this altar which had somehow contained the Lord's body. We're not. It's not. That's not elaborated on because it's in Jerusalem. There does seem to be a connection to this stone on which Christ's body was laid. And keep in mind that most of the Grail legends start popping up in Western Europe during the time of the Crusade. So people are coming from the east, and they're bringing back these. These tales of, like, amazing relics that they've seen or, like, heard legends about. But that's the key idea of the Grail. So we're told, for instance, like I mentioned, the height. History of the Grail. The Grail has these five forms, only the last of which is the chalice. It's going to be much later. We'll talk about this in our next video when Robert de Baron, he has the Grail become the cup of the Last Supper. Right. But that's sort of the final form. You could say that's the final form that the Grail takes in the romances. Like, once it takes that form, the Grail is always that in all the future retellings of the story. Yeah, for sure."}
{"episode_id":"SW - #200 - 2021-11-16 - Richard Rohlin - The Holy Grail - The Key to Understanding the West - Part 1","start":1609.06,"end":1613.14,"speaker":"Jonathan Pageau","text":"Because in Kritian, it's not clear that that's what's going on. Right."}
{"episode_id":"SW - #200 - 2021-11-16 - Richard Rohlin - The Holy Grail - The Key to Understanding the West - Part 1","start":1613.14,"end":1616.3,"speaker":"Richard Rohlin","text":"When he sees grain, that idea is not at all there in Creatien."}
{"episode_id":"SW - #200 - 2021-11-16 - Richard Rohlin - The Holy Grail - The Key to Understanding the West - Part 1","start":1616.3,"end":1617.46,"speaker":"Jonathan Pageau","text":"It's for sure a vessel."}
{"episode_id":"SW - #200 - 2021-11-16 - Richard Rohlin - The Holy Grail - The Key to Understanding the West - Part 1","start":1618.1,"end":1763.94,"speaker":"Richard Rohlin","text":"It's for sure a Eucharistic vessel. Yeah, that's it. That's it. And we'll talk more about where that connection comes in in a little bit. So you have this idea of, like, the altar, which is kind of like the ultimate version of this in the Celtic tradition, this hidden altar that comes from heaven, that's contained God's body and which is now covered over. It's veiled, it's covered in these garments of skin. Okay, so that's the. That's kind of the first thread in what eventually becomes the Grail story. The second one we could talk about is in the. What I've called the Iberian Virgin and her Grail. And if you want to know more about this, by the way, I know people love. Like, where can I go read about this myself? There's this great book called the Virgin, the Grail by Joseph. Joseph Goering. And it's all about this image. So the image that you see manifesting in, let's say, in the Pyrenees, right around the time between the third and the fourth, and a little bit after the Fourth Crusade, you have these images that come up over and over again. These beautiful Romanesque frescoes. I mean, they're really stunning. Whenever somebody's like, I'd like to see more Western art in churches or something like that, I'm like, well, I would, too, but I don't think we mean the same thing by that. I think you mean, like, Renaissance stuff. And I mean this stuff. Like, this is. This is like, amazing, amazing stuff. And very, like. It's very sort of distinctly Western, but also really consonant with a Byzantine tradition. And so the first image of this seems to be. And this isn't a. It's by an anonymous painter. Fresco. Do you call somebody who paints frescoes like a painter or. They are. I don't know. Anyway, he's called the master of St. Clement because we don't know who he was. People didn't sign their work, but he was a really gifted iconographer. And in the apes of this church, the St. Clement's of Tull in the Pyrenees mountains, you have this image of Christ in glory, surrounded by the Four creatures. It's very Byzantine image. If you've ever been to an Orthodox church, you've seen this somewhere, you'll immediately recognize it. But then beneath him, around the. The. You know, around the base of the. Of the apse of the church, you see the choir of the apostles, Right. So the. The 12 apostles plus. Plus some. But then in their. In their center and sort of standing as like the first among equals among them is the Mother of God. And the Mother of God is standing there, and she's holding. You can kind of see it in the COVID art right here. Because this is. Yeah."}
{"episode_id":"SW - #200 - 2021-11-16 - Richard Rohlin - The Holy Grail - The Key to Understanding the West - Part 1","start":1763.94,"end":1765.62,"speaker":"Jonathan Pageau","text":"She's holding a cup of some kind."}
{"episode_id":"SW - #200 - 2021-11-16 - Richard Rohlin - The Holy Grail - The Key to Understanding the West - Part 1","start":1766.26,"end":1792.18,"speaker":"Richard Rohlin","text":"It's a dish. It's a dish. Yeah. So the word grail means. It means like a large, shallow serving dish. And actually. Specifically. Specifically, it's a serving dish for serving fish. That's what you serve on a grail. And this is in Kratjan, it says he sees this virgin coming in, holding this large grail in which you might serve, like a pike or a lamprey. In other words, like a very large fish. So again, thinking about fish here."}
{"episode_id":"SW - #200 - 2021-11-16 - Richard Rohlin - The Holy Grail - The Key to Understanding the West - Part 1","start":1794.9,"end":1806.27,"speaker":"Jonathan Pageau","text":"Right? This idea of a container for food, a container for fish. An altar. Or an altar or like a tombstone. All of these images of these containers, but that are also."}
{"episode_id":"SW - #200 - 2021-11-16 - Richard Rohlin - The Holy Grail - The Key to Understanding the West - Part 1","start":1807.15,"end":1807.51,"speaker":"Richard Rohlin","text":"Yeah."}
{"episode_id":"SW - #200 - 2021-11-16 - Richard Rohlin - The Holy Grail - The Key to Understanding the West - Part 1","start":1807.51,"end":1810.51,"speaker":"Jonathan Pageau","text":"That are also secret, that are heavenly. All of this is kind of coming together."}
{"episode_id":"SW - #200 - 2021-11-16 - Richard Rohlin - The Holy Grail - The Key to Understanding the West - Part 1","start":1811.23,"end":1849.54,"speaker":"Richard Rohlin","text":"So there's something about this. And this original image seems to be of the Ascension. I should have prefaced that by saying this original image seems to have been of the Ascension. So in the Byzantine tradition, when we portray the Ascension, it's essentially exactly like this. We show Christ in glory. He's being taken up to heaven on the, like, the cherubic throne. And then beneath him, we have all of the apostles. And in the midst of the apostles, we have the Mother of God. And she's flanked on either side, right, by two angels. You've done some really great videos. It's been a while, but you've done some really great videos about this icon of the Ascension, Right. Which is an icon of the church, where the church was at that moment, what it is now. And of course, the way that we."}
{"episode_id":"SW - #200 - 2021-11-16 - Richard Rohlin - The Holy Grail - The Key to Understanding the West - Part 1","start":1849.54,"end":1858.06,"speaker":"Jonathan Pageau","text":"Yeah, and it's an eschatological vision as well. It's also how. Because it says, even in Scripture, that Christ will return in the same manner that he left."}
{"episode_id":"SW - #200 - 2021-11-16 - Richard Rohlin - The Holy Grail - The Key to Understanding the West - Part 1","start":1858.22,"end":1936.07,"speaker":"Richard Rohlin","text":"So this seems to be a reworking of the Byzantine image of the Ascension. But what's different about it? And this is the crucial difference. And this is about 50 years before Chretien wrote his grail story, which is the first real Grail romance. Right. So 50 years before that, this guy painted this image, and he shows the Virgin Mary holding in her hand this Grail. And in the grail, there are flames shooting up out of it. So it's not totally sure what's in the Grail. The author of this book has some theories. I don't think they're all totally right, because there's some things. I mean, he's writing about Christian ritual from an outsider perspective, whereas anybody who's lived in the church and been to liturgy enough times and things like this. But on the whole, I think he's right in that he says that the contents of the bowl are either. It's either the Eucharist or. Or it's Chrism. And that for our purposes, it doesn't really matter which one of those it is. Right. That. That. In other words, like this. This. This fiery bowl. Right. Contains. Let's say it shows the way in which the grace of the Holy Spirit has been given to the church, which the creator of this fresco saw as being mediated through the incarnational experience of the Church, which. Which we understand through the. The Mother of God."}
{"episode_id":"SW - #200 - 2021-11-16 - Richard Rohlin - The Holy Grail - The Key to Understanding the West - Part 1","start":1936.15,"end":1939.67,"speaker":"Jonathan Pageau","text":"So this author, does he see this as a kind of small image of Pentecost?"}
{"episode_id":"SW - #200 - 2021-11-16 - Richard Rohlin - The Holy Grail - The Key to Understanding the West - Part 1","start":1939.99,"end":1947.63,"speaker":"Richard Rohlin","text":"Yes, he doesn't talk about Pentecost so much. He does talk about it a little bit. Again, that's where I think, you know."}
{"episode_id":"SW - #200 - 2021-11-16 - Richard Rohlin - The Holy Grail - The Key to Understanding the West - Part 1","start":1947.63,"end":1982.26,"speaker":"Jonathan Pageau","text":"Because in the Western tradition, by the way, the image of the image of Pentecost resembles the image of Ascension, right? We have this image where we don't show. We don't have a character in the center. And it's like. It's like these. These chairs going around like this in the door. But the Western version and the one in the Rugula Gospels, which is like one of the earliest versions of Pentecost, we see the disciples in a line with the Mother of God in the center and then the fire coming down upon them all. So, like, it's more. It's closer to the image of the Ascension that you would find. That you would find normally."}
{"episode_id":"SW - #200 - 2021-11-16 - Richard Rohlin - The Holy Grail - The Key to Understanding the West - Part 1","start":1982.5,"end":1998.92,"speaker":"Richard Rohlin","text":"I didn't know that. I did know that in Armenian depictions of the Ascension, it's very often the same. So that, you know, where you do have the Mother of God there. And I actually have seen some Byzantine icons that have her there. Not the one that's in our church, but like my home parish. But I have seen that a few times."}
{"episode_id":"SW - #200 - 2021-11-16 - Richard Rohlin - The Holy Grail - The Key to Understanding the West - Part 1","start":1998.92,"end":2008.04,"speaker":"Jonathan Pageau","text":"So, yeah, it's a very old tradition. People say people don't like it because it's not the One we ended up with. But the idea. It's a very, very old tradition to have the Mother of God in the center."}
{"episode_id":"SW - #200 - 2021-11-16 - Richard Rohlin - The Holy Grail - The Key to Understanding the West - Part 1","start":2008.12,"end":2050.82,"speaker":"Richard Rohlin","text":"So it's. I mean, this is a little aside, but once my daughter, for an art class, decided that she wanted to do an icon of the. Of Pentecost, and she was just doing it, like, totally from memory, having grown up in the church and things. And she just. Even though the fresco that we have on the ceiling of our chur, it's like, right on. Right on the other side of the apes, on the other side of the archonists, that's from the apes, we have a very traditional Pentecost icon. Nobody seated in the middle. And that's the icon that she's seen in her entire growing up. But when she did the icon, she put the Mother of God right in the middle. It was just like a normal. Here's Mary, here's baby Jesus, here's the church around them. And. Yeah, so she's like, oh, that's really interesting."}
{"episode_id":"SW - #200 - 2021-11-16 - Richard Rohlin - The Holy Grail - The Key to Understanding the West - Part 1","start":2051.91,"end":2070.55,"speaker":"Jonathan Pageau","text":"If anybody's interested, by the way, I wrote an article specifically about that on the two women, on the two images of the church. Let's say the Church of the Jews and the Church of the Gentiles, or the inner woman and the outer woman. And so how it's related to Pentecost, to Ascension and Pentecost. So I'll put a link of that in the description."}
{"episode_id":"SW - #200 - 2021-11-16 - Richard Rohlin - The Holy Grail - The Key to Understanding the West - Part 1","start":2070.87,"end":2149.33,"speaker":"Richard Rohlin","text":"Yeah, that'd be great. Right after this image, what we see then happening in churches all across, let's say this certain region of Spain is. And then into France, we see this image of. And it very quickly changes into just Mary holding a chalice. But we show this image popping up in Romanesque iconography from the century again and again and again. And it's worth noting that the romancers who wrote down their versions of the Grail stories, that their patrons, their original patrons were these troubadour crusader kings and lords who originally came from this region. Right. So that. So that they're coming east. They're going east for the Crusades, they're coming back. This iconography pops up. And then about 50 years, 50 to 100 years later, that's when all of the Grail romances start showing up in Western Europe. So I find this very interesting. Of course, it is in Katyan. It is the Virgin. It is a virgin. Maybe not the Virgin, but it is a virgin who is carrying the Grail in the procession in the Fisher King's palace. Okay, so the third seed of the Grail story, and this is where things get a little weird. The third seed."}
{"episode_id":"SW - #200 - 2021-11-16 - Richard Rohlin - The Holy Grail - The Key to Understanding the West - Part 1","start":2149.33,"end":2153.57,"speaker":"Jonathan Pageau","text":"You don't think slaying altars is weird enough? We need much weirder."}
{"episode_id":"SW - #200 - 2021-11-16 - Richard Rohlin - The Holy Grail - The Key to Understanding the West - Part 1","start":2153.81,"end":2280.3,"speaker":"Richard Rohlin","text":"I mean. Yeah, okay, so we have this icon of, we call it like the Holy Mendelian or the icon made without hands, right. If you've been to an Orthodox church, probably seen this icon, right? It's weird because it's like an icon of a towel with the face of Jesus on it. Right. And this goes back to this legend which is, let's say, attested in some of our earliest Christian historical sources, Right. So much so that, you know, I mean, I personally, I mean, it's a feast of the church. I take for granted that it's a, it's a real thing that happened, Right. I have no reason to doubt it. Right. But this legend that essentially there was King Avgar of Edessa, right. Who had desired an icon of Christ and so he sent his, his people to, to make a copy of Christ's face, like to make a picture of him, a painting, right. Or to get something of Christ. You know, Avgar is sick, and in some versions of the story, he's sick with leprosy. But actually, very importantly, in other versions of the story, especially in the Middle Ages, as the, the legend gets sort of elaborated, he's paralyzed. In other words, of course, paralysis is also always sort of associated with, let's say, infertility and all these things, right? So you have a paralyzed king, a wounded king, right? And so he sends for something of the Lord's which will, which will be able to heal him. And basically what happens when the, when the people, they come to draw Christ is that they can't do it. Like they're actually not able to depict him. They can't get his image. Actually in one of the. Remember what I said about the Grail having five forms, right. In one of the versions of the story in the Middle Ages, the reason they can't get his image is because as they start trying to draw him, his image constantly changes. And it goes from being a little child to being a 30 year old man, to being Christ in his passion, to being the ancient of days, right? And it moves through these like all these different things, right? And they can't do it. So finally, Christianity basically makes them an icon and it's at least of his face, but possibly of his entire body. Yeah."}
{"episode_id":"SW - #200 - 2021-11-16 - Richard Rohlin - The Holy Grail - The Key to Understanding the West - Part 1","start":2280.62,"end":2284.62,"speaker":"Jonathan Pageau","text":"He imprints his form onto the claw, right?"}
{"episode_id":"SW - #200 - 2021-11-16 - Richard Rohlin - The Holy Grail - The Key to Understanding the West - Part 1","start":2284.7,"end":2430.51,"speaker":"Richard Rohlin","text":"And so he gives that to them and they take it back to the city of Edessa. And there are all kinds of this is. People don't understand. Now, we understand a little bit in the Orthodox Church because, again, we. We have this icon in a lot of places, and we do have a feast for it. It's one of the three feasts of the Lord in the month of August. But this is a big deal. In the Middle Ages, people copied and recopied and copied and recopied the story. Many of the Crusaders who. Obviously, Edessa was taken by the Western Crusaders during the First Crusade. It was retaken. And then in the Fourth Crusade, of course, Constantinople was sacked. By the time of the Fourth Crusade, the icon of the Holy Face, the Holy Mandelion, was in Constantinople at Blacarnae. And if you go back and you read the firsthand eyewitness accounts of the people who saw this icon, but then you also, if you read the legend. So there were legends that got copied into Latin from a pretty early date, a lot of these Crusaders brought back west with them. And you start looking at, let's say, the theological connection between. Or not the theological connection, but you start looking at the connection between the things that are supposed to happen in the Grail Chapel or in the Grail palace or the Grail Castle. If you look at those, and then you look at the rituals that were associated with the veneration of this icon in Edessa. And then in Constantinople later, they map very tightly, okay? And of course, there's a lot of other stuff. Obviously, the spear is, you know, the Holy Spear, the Lance of Longinus, whose feast day was in the. In the Orthodox Church, was just a few days ago, by the way, from when we were recording this. That comes up during the time of the Crusades. Right. Because it's uncovered, or it's believed to be uncovered during the siege of Antioch. And all this other stuff is going on, Right? So all of the stuff is kind of coming west. And in particular. And I don't totally understand because obviously there's the. You have basically like, three versions of this idea of, like, a cloth that has Christ's face on it, right? You have the Shroud of Turin or the burial shroud. You have the, like, the cloth that St. Veronica is supposed to have pressed against Christ's face, came away with an impression of the icon. And then you have this, the Holy Mandelion, the icon made without hands. But in a lot of these earlier stories, those all basically seem to be the same thing."}
{"episode_id":"SW - #200 - 2021-11-16 - Richard Rohlin - The Holy Grail - The Key to Understanding the West - Part 1","start":2431.35,"end":2436.71,"speaker":"Jonathan Pageau","text":"Well, for sure, they all seem to. At least the earliest one is the Mandelian tradition."}
{"episode_id":"SW - #200 - 2021-11-16 - Richard Rohlin - The Holy Grail - The Key to Understanding the West - Part 1","start":2436.71,"end":2470.38,"speaker":"Richard Rohlin","text":"Yes, that's very old so this is where it gets a little kind of mind blowing. And I don't even know how much I want to say about this, but in the earliest descriptions that we have of people who went to Venaritha Mandelian and wrote about us, these are firsthand eyewitness accounts. It's not just the face. Okay. That it's actually a cloth that has been folded, but if you unfold the entire thing, it would give you this impression of Christ's body, at least from like the waist up, and that this impression was made with Christ's sweat and with his blood."}
{"episode_id":"SW - #200 - 2021-11-16 - Richard Rohlin - The Holy Grail - The Key to Understanding the West - Part 1","start":2470.7,"end":2474.06,"speaker":"Jonathan Pageau","text":"So it's more like the turin, the shroud."}
{"episode_id":"SW - #200 - 2021-11-16 - Richard Rohlin - The Holy Grail - The Key to Understanding the West - Part 1","start":2474.14,"end":2505.54,"speaker":"Richard Rohlin","text":"Yeah, yeah. So, but typically speaking, what they would do is that this whole thing would be folded up. In fact, one of the names for the cloth means, like the cloth that's been folded eight times or something like this. And they would fold the cloth up so that only the face could be seen and you could only see. See the face. I mean, this is. It's heavily protected, so you could only see the face if you look through the certain aperture, which you're only allowed to do at sort of certain times. Right. And so, so it's again, it's this idea of here's something that contains Christ's body, that contains Christ's blood. Right. Or at least the impression of them."}
{"episode_id":"SW - #200 - 2021-11-16 - Richard Rohlin - The Holy Grail - The Key to Understanding the West - Part 1","start":2505.54,"end":2507.22,"speaker":"Jonathan Pageau","text":"Yeah, well, it did. I mean, it's."}
{"episode_id":"SW - #200 - 2021-11-16 - Richard Rohlin - The Holy Grail - The Key to Understanding the West - Part 1","start":2507.22,"end":2549.59,"speaker":"Richard Rohlin","text":"It's a container for Christ's body, just like. Right. And so all of this is tied then, with the, the Byzantine apocryphal tradition surrounding Joseph of Arimathea. So Joseph of Arimathea, who was put into prison and released after the emperor of Vespasian was healed by the holy cloth of leprosy. You know, this is the, this is the legend that's found in the. There's the Gospel of Nicodemus and the Acts of Pilate, these two apocryphal works that are really important in our tradition. When I say they're apocryphal, I don't mean that we totally discount them. I think maybe by now people know that. But."}
{"episode_id":"SW - #200 - 2021-11-16 - Richard Rohlin - The Holy Grail - The Key to Understanding the West - Part 1","start":2552.47,"end":2554.55,"speaker":"Jonathan Pageau","text":"The source of the Anastasis icon."}
{"episode_id":"SW - #200 - 2021-11-16 - Richard Rohlin - The Holy Grail - The Key to Understanding the West - Part 1","start":2554.55,"end":2559.91,"speaker":"Richard Rohlin","text":"Is from the Gospel, right? Exactly, exactly. Yeah. So obviously a really important part of our tradition."}
{"episode_id":"SW - #200 - 2021-11-16 - Richard Rohlin - The Holy Grail - The Key to Understanding the West - Part 1","start":2561.19,"end":2567.63,"speaker":"Jonathan Pageau","text":"Yeah. So Joseph takes the blood or he takes the cup or he carries it."}
{"episode_id":"SW - #200 - 2021-11-16 - Richard Rohlin - The Holy Grail - The Key to Understanding the West - Part 1","start":2568.03,"end":2644.2,"speaker":"Richard Rohlin","text":"So he's closely associated originally with his burial cloth, especially in the rituals surrounding its veneration at Edessa, or burial cloth, or the Mandelian or whatever you want to call it. He's very closely associated with that in the tradition of the city of Edessa. Now, the other place where this comes in would be two things. One is that during the first. Especially the first millennia of the Church, going into, like, the 13th and 14th century, there's a really rich tradition of Byzantine, Eastern, Christian mystagogical commentaries on the liturgy. Right. You could basically say it's like doing allegorical commentary on the liturgy, except that nobody knows what allegory means anymore. And so I don't like to use it. That word because people get confused. But it's just. It's ways of. Of sort of, let's say, interpreting and explicating the mystery of. Of the Divine Liturgy. And, of course, the most most important one of these is probably Saint Maximus the Confessor's mystical ecclesial mystagogy, which I've talked about a lot, and I'm a big fan of that particular work. One of the things I love about it is that I only understand maybe like, a fourth of it, because he's like, the liturgy has these four or five senses, and he explains the first sense, and I'm like, okay, I get that. He explains the second sense, and I'm like, okay, I get that. And then he starts explaining, like, the third, fourth, fifth senses, and I'm like, I don't. I can't even."}
{"episode_id":"SW - #200 - 2021-11-16 - Richard Rohlin - The Holy Grail - The Key to Understanding the West - Part 1","start":2644.2,"end":2645.96,"speaker":"Jonathan Pageau","text":"I don't even know what the subject is."}
{"episode_id":"SW - #200 - 2021-11-16 - Richard Rohlin - The Holy Grail - The Key to Understanding the West - Part 1","start":2646.04,"end":2682.53,"speaker":"Richard Rohlin","text":"I don't even. Can't even. Yeah, right. Like, I don't even. Like, my. My. I'm such a baby, you know, spiritually, like, I have no idea what that's even about. Right. Yeah, exactly. But basically, in these commentaries, what we get is this idea. So you find this in, like, St. Germanus's commentary, this idea that there is a. Let's say, like a polyvalence or an overlapping sense of meaning between the. The chalice or the patens, the. What's it called? The epitaphion. You know, like the. Like the. The cloth that has. Which is. Exactly."}
{"episode_id":"SW - #200 - 2021-11-16 - Richard Rohlin - The Holy Grail - The Key to Understanding the West - Part 1","start":2682.93,"end":2684.97,"speaker":"Jonathan Pageau","text":"Which is an image of the Shroud, basically."}
{"episode_id":"SW - #200 - 2021-11-16 - Richard Rohlin - The Holy Grail - The Key to Understanding the West - Part 1","start":2684.97,"end":2685.25,"speaker":"Richard Rohlin","text":"Right."}
{"episode_id":"SW - #200 - 2021-11-16 - Richard Rohlin - The Holy Grail - The Key to Understanding the West - Part 1","start":2685.25,"end":2690.93,"speaker":"Jonathan Pageau","text":"The image that has the body of Christ stitched or painted on it and that which is on the altar."}
{"episode_id":"SW - #200 - 2021-11-16 - Richard Rohlin - The Holy Grail - The Key to Understanding the West - Part 1","start":2691.17,"end":2750.8,"speaker":"Richard Rohlin","text":"Right. So between that. Between the. The patents and the. And actually, the epitaphian seems to have developed. And I'm sure there are people out there who know way more about liturgical history than I do, but it seems to have developed originally from the veil which is placed over the chalice and over the patens. So those seem to be related, which, you know, intuitively, like, on a symbolic level, all that stuff makes sense. Right. So there's a relationship between these things and then the deacon who carries them out during the liturgy and such that we are told. And this is in a Byzantine liturgical commentary which is then translated into Latin, which then is like re reworked into another Latin commentary on the Latin Mass. And like there's three or four levels of this, versions of this that come to the West, Right. About all the time. Right about the time that all the Grail legends are popping up in which we are told that the deacon at this moment is imaging the role of Joseph of Arimathea. Really. So this stuff is like deeply. And of course, I mean."}
{"episode_id":"SW - #200 - 2021-11-16 - Richard Rohlin - The Holy Grail - The Key to Understanding the West - Part 1","start":2750.88,"end":2758.4,"speaker":"Jonathan Pageau","text":"Well, I mean, I guess because he carried, you could say it really immediately because he carried the body down and he put the body in a tomb."}
{"episode_id":"SW - #200 - 2021-11-16 - Richard Rohlin - The Holy Grail - The Key to Understanding the West - Part 1","start":2758.64,"end":2801.3,"speaker":"Richard Rohlin","text":"And think about, Right. Think about how heavily Joseph of Arimathea features in the Eastern liturgy. Right. That long, beautiful, the noble Joseph Triparia that we sing every year. We sing it during Holy Week, we sing it again on the Sunday of the myrrh bearers. Right. The role that he had in taking the body of Christ down and sort of carrying it. He's so closely connected in the Eastern liturgical tradition, not just in like the Byzantine version that's come down to us in our church, but also like in the Syrian tradition. He's so closely connected to the act of carrying the body of Christ that. That's the connection that these liturgical, like these mystical commentaries on the Mass and on the Divine Liturgy. That's the connection that they make."}
{"episode_id":"SW - #200 - 2021-11-16 - Richard Rohlin - The Holy Grail - The Key to Understanding the West - Part 1","start":2801.61,"end":2819.25,"speaker":"Jonathan Pageau","text":"Yeah. And because also Joseph offers the vessel. Yes, he actually offers the tomb. Like he pays for it. Right. He. He buys the tomb and so he offers this vessel for the body. And so it's like. Yeah, it all makes sense, like very. In a very immediate way, notwithstanding all the legends which are going to come later."}
{"episode_id":"SW - #200 - 2021-11-16 - Richard Rohlin - The Holy Grail - The Key to Understanding the West - Part 1","start":2819.25,"end":2826.41,"speaker":"Richard Rohlin","text":"Right. So the legends about, like Joseph coming to England and all this stuff that comes much later. Okay. Comes much later. Right."}
{"episode_id":"SW - #200 - 2021-11-16 - Richard Rohlin - The Holy Grail - The Key to Understanding the West - Part 1","start":2827.14,"end":2829.9,"speaker":"Jonathan Pageau","text":"They make so much sense with all this symbolism."}
{"episode_id":"SW - #200 - 2021-11-16 - Richard Rohlin - The Holy Grail - The Key to Understanding the West - Part 1","start":2829.9,"end":2830.22,"speaker":"Richard Rohlin","text":"Right."}
{"episode_id":"SW - #200 - 2021-11-16 - Richard Rohlin - The Holy Grail - The Key to Understanding the West - Part 1","start":2830.22,"end":2831.7,"speaker":"Jonathan Pageau","text":"We know what England is."}
{"episode_id":"SW - #200 - 2021-11-16 - Richard Rohlin - The Holy Grail - The Key to Understanding the West - Part 1","start":2831.78,"end":2877.04,"speaker":"Richard Rohlin","text":"Right. So that's the thing though, is one of the things I want to point to with something like the Grail legends where you have a story that is clearly non historical, let's say, but also so fundamentally true that we keep trying to tell it over and over again. Right. Like the Holy Grail. As far as I'm concerned, the Holy Grail is the great story of Western civilization. It's the big problem, the fact that in the early stories of the Grail. I'll talk more about this in the next video, but in the early stories of the Veil, the Grail quest is achieved, but the more we retell it and the longer it goes, the more unattainable the Grail becomes. I think that's really, really telling."}
{"episode_id":"SW - #200 - 2021-11-16 - Richard Rohlin - The Holy Grail - The Key to Understanding the West - Part 1","start":2877.2,"end":2929.43,"speaker":"Jonathan Pageau","text":"Yeah, but it also has to do. If you understand what's going on when the Gr. Legends are appearing and you notice that, you know, there's the idea that there's a mystery which is no longer accessible. To me, this is something that, especially as someone. As an orthodox person, I can see as related to the. One of the problems which comes in the late Middle Ages, as this nominalism gets set in as certain branches of. So it's almost as if mythically, there's an intuition that there's something off and that there's something that we used to have access to or that we should have access to that we could. We don't anymore. Like, there's an aspect of the mystery which has been kind of. That has been kind of pulled away from us. And so there's. There's. I think there's. It's related to the schism. I think so."}
{"episode_id":"SW - #200 - 2021-11-16 - Richard Rohlin - The Holy Grail - The Key to Understanding the West - Part 1","start":2929.43,"end":3030.63,"speaker":"Richard Rohlin","text":"Yeah. So. So this is where I'm going to get into. Get myself into a little bit. You shouldn't say these things so that I can be the one that get. I can be the one that gets in trouble with some of your listeners. Okay. Um, but a lot. Okay, But. But there are a lot of serious Grail scholars out there who have pointed out the fact that the Grail legend begins to arise in Western Europe exactly at the time that people start arguing about transubstantiation. Right. Right at the time that Berengarius and all these people, like, they're like, is it a symbol? Is it. What? Is it this? Is it that. Right, Just right at the point that, of course, that's where somebody like Alexander Schmemann sort of points the original. That's where maybe things start to go wrong. Everyone's got maybe their date for when things start to go wrong. But what everybody agrees with on. Is that something obviously went wrong, but right at the time that the secularism begins to be born and that that rift in Western sacramental theology starts to slowly widen in what's eventually going to become the Reformation. And all the things that kind of are downstream from that. Right at the time that was happening is when the Grail story starts to manifest itself in Western Europe. The idea of the unattainable Grail culminates right around the time of the Fourth Crusade, which is kind of the death knell in Any hopes of reunion between the Eastern and Western church? I think my reading, and I think there's a lot of evidence for this, is that historically, people still thought they were going to be able to get the band back together, right. Until, you know, Latin crusaders sacked Constantinople and they put a prostitute on the throne of the patriarch of Constantinople in the church of Hagia Sophia. And at that point, they were like."}
{"episode_id":"SW - #200 - 2021-11-16 - Richard Rohlin - The Holy Grail - The Key to Understanding the West - Part 1","start":3030.79,"end":3032.39,"speaker":"Jonathan Pageau","text":"This is not happening anymore."}
{"episode_id":"SW - #200 - 2021-11-16 - Richard Rohlin - The Holy Grail - The Key to Understanding the West - Part 1","start":3033.51,"end":3060.07,"speaker":"Richard Rohlin","text":"Maybe, like, you know, maybe this is not going to work out after all. Right, so. And I think you're right. Like, I think it's connected to those things, and it's part of what makes the story of the Grail so important and also so tragically painful. And when I. What I want to do in the next video is to start going through some of the romances of the Grail, and I want to start with Chretien, because even though his version is not, let's say, the definitive version, I think in some ways it's still the best."}
{"episode_id":"SW - #200 - 2021-11-16 - Richard Rohlin - The Holy Grail - The Key to Understanding the West - Part 1","start":3060.15,"end":3060.71,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #200 - 2021-11-16 - Richard Rohlin - The Holy Grail - The Key to Understanding the West - Part 1","start":3060.95,"end":3074.07,"speaker":"Richard Rohlin","text":"And I think that actually people have been reading it profoundly wrong for a very long time that everyone thinks it's unfinished and everyone thinks Percival doesn't get the Grail. And I think that's totally wrong. Oh, right. Yeah. So just tease that for next video."}
{"episode_id":"SW - #200 - 2021-11-16 - Richard Rohlin - The Holy Grail - The Key to Understanding the West - Part 1","start":3074.64,"end":3212.67,"speaker":"Jonathan Pageau","text":"So maybe. So what I. My last words are going to be something like. Even now, in the discussion that we've had talking about the sources of where the Grail legend comes from, we notice that there is something about the Grail itself which is related to the west that has to do with the west, if we understand the west in the sense of the place where the sun sets, that western edge of the world. And we always have to remember now we live in America, and so this has kind of been thrown up. There's been a stretching out of the west, you could say. But for the ancients, Britain was the edge of the world. Right. It was represented, that western edge of reality where the barbarians were still there and it was still kind of a wild land that had to be tamed. We remember that the giants were there. There's all these stories about what it is that Britain represents. So there's a sense in which all these stories are kind of coming together and manifesting the west and manifesting this notion of the container and the support for something sacred, something which holds the sacred in it. The altar, the cup, the chalice, the Grail, the cloth. All of these are all these supports. And it's also a book. There's also a version of the Grail which is a book. It's all these idea of the support of something from above, right? And so it is, of course, related to the feminine. And so we can already see that why so much of the madness of the Grail stories that have come to us recently. And Dan Brown, I'm talking to you in this statement is they wanted to make it about, right? They all wanted to make it about the feminine. And they're totally right that it is about this, about the feminine. But we also need to understand it rather as something which is pointing beyond the kind of crass. The crass way in which people like Dan Brown have wanted to bring about, like, as if all these mysteries, all these stories, what they're pointing to is some historical fact that everybody wants to hide. And that's it. There's no more meaning to it than that. It's all about hiding something that happened that nobody wants you to find out about. And so that's really, like, if it was that, then she just all throw it in the trash anyways, because it's not really interesting."}
{"episode_id":"SW - #200 - 2021-11-16 - Richard Rohlin - The Holy Grail - The Key to Understanding the West - Part 1","start":3213.63,"end":3351.65,"speaker":"Richard Rohlin","text":"So I think that the things you're saying are so. Something that's really curious to me about this Grail stuff, right, Is that essentially all of the pieces are there in the east, but the east never has a Grail story, they never have a Grail legend, they never have a Grail romance. And in general, the east never. They. They just never develop, let's say, imaginative literature to the same degree. Even like, you know, like the great orthodox novels like Dostoyevsky or something like that are, you know, they're like super, super in your face and very like, grounded and gritty and realistic and things like this. And it's not that we don't have, like, wonder tales or things, but when we have them, they tend to be in hagiography or in stories of miracles and things like this. And there's like a. Like, just this experience of a much more proximate experience of the divine, of the miraculous, of relics, of saints, of angels, of all these different things that is there initially in, say, like the age of the saints, like the 5th and 6th century Wales or somewhere like that, but starts to be lost in the West. And as that distance begins to stretch out, you have something very much like. And this is. I mean, this is something I've been thinking about a lot because I write fiction, obviously. I love talking about fiction, right? Fiction is the garment of skins in which St David's altar is wrapped, right? It's our inability to come to some of these things in, like, A really bald way in, like a really open way. We can't do it anymore. And I say this, you know, as a. Obviously, I'm a practicing Christian. I'm a member of the Orthodox Church, but I'm also a Western person. And that hasn't changed. And I'm like, I'm totally as much as I can be. I try to be aware of what that means and what. You know, obviously there's some great things about that. There's also some. Some big limitations that I'm trying to work through. And I think that you could say the Grail romances, right? And the way that they develop. They develop precisely at this time that something is being lost, that there's a rift that's happening. And they become a way to take that thing that's being lost and sort of wrap it in this protective covering of skins, which becomes poetry and romance and all this stuff."}
{"episode_id":"SW - #200 - 2021-11-16 - Richard Rohlin - The Holy Grail - The Key to Understanding the West - Part 1","start":3351.89,"end":3355.89,"speaker":"Jonathan Pageau","text":"And a sense of nostalgia. There's a sense in the Grail of nostalgia."}
{"episode_id":"SW - #200 - 2021-11-16 - Richard Rohlin - The Holy Grail - The Key to Understanding the West - Part 1","start":3355.89,"end":3369.61,"speaker":"Richard Rohlin","text":"Yeah. Especially the later. Especially the later version, like Robert de Baron, this deep sense that, man, if we could have. If we could have. I mean, this is all the way back in Chretien, like in his romance, which is the first Grail romance, like that sense that if he could have asked the right question, he could have."}
{"episode_id":"SW - #200 - 2021-11-16 - Richard Rohlin - The Holy Grail - The Key to Understanding the West - Part 1","start":3369.61,"end":3370.6,"speaker":"Jonathan Pageau","text":"Asked, what's the Grail?"}
{"episode_id":"SW - #200 - 2021-11-16 - Richard Rohlin - The Holy Grail - The Key to Understanding the West - Part 1","start":3371.31,"end":3385.11,"speaker":"Richard Rohlin","text":"Yeah, if he could have asked the right question, then he would like. Then the land would have been healed. In other words, communion would have been restored, which I think actually again happens in that romance, and people miss it. So we'll talk about it."}
{"episode_id":"SW - #200 - 2021-11-16 - Richard Rohlin - The Holy Grail - The Key to Understanding the West - Part 1","start":3385.11,"end":3406.35,"speaker":"Jonathan Pageau","text":"All right, well, that'll be the way to end this to see. How is it that Richard thinks that Kitsane got it right? Well, I love Kitsane's romance, and so I'm really excited to find out about it. So everybody, thanks for your time. Thanks for your attention. Of course, it's just the beginning of our. Of our discussing the Grail. And so we're looking forward to the next episode having an announcement. Go for it."}
{"episode_id":"SW - #200 - 2021-11-16 - Richard Rohlin - The Holy Grail - The Key to Understanding the West - Part 1","start":3406.59,"end":3407.79,"speaker":"Richard Rohlin","text":"Go back God's dog."}
{"episode_id":"SW - #200 - 2021-11-16 - Richard Rohlin - The Holy Grail - The Key to Understanding the West - Part 1","start":3407.95,"end":3411.39,"speaker":"Jonathan Pageau","text":"Oh, and go back God's dog. All right, everybody, talk to you soon."}
{"episode_id":"SW - #200 - 2021-11-16 - Richard Rohlin - The Holy Grail - The Key to Understanding the West - Part 1","start":3411.39,"end":3412.03,"speaker":"Richard Rohlin","text":"Bye. Bye."}
{"episode_id":"SW - #200 - 2021-11-16 - Richard Rohlin - The Holy Grail - The Key to Understanding the West - Part 1","start":3412.67,"end":3474.69,"speaker":"Jonathan Pageau","text":"I hope you enjoyed this episode of the Symbolic World. The Symbolic World is based on a series of videos that you can find on my YouTube channel, Jonathan Pedro's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course, leaving a review on itunes. Everybody knows that's the best way to get the podcast out there to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon, the Pageau videos as well, and on subscribestar, all those links you can find on my website or in the show description. So thank you and I will see you soon."}
