{"episode_id":"SW - #377 - 2025-02-20 - Annie Crawford - The Breakthrough of Myth","start":0.16,"end":59.17,"speaker":"Laura Diaz","text":"Tucson, the weight is over Mediweight loss. They're officially open on North Oracle Road. That's right. No more counting down the days. You can walk in right now and start your journey to a healthier you. Hey, it's Laura Diaz from iheartradio and you can trust me. This isn't just another weight loss clinic. I know that because it's where I lost weight safely with real medical support. GLP1 medications. You can see them everywhere online right now. But the truth is your health shouldn't be a DIY project ordering these meds without the professional guidance. It can lead to dangerous mistakes, wrong doses, no oversight, and serious risks at mediweight loss. I got the same medication but with a customized plan, weekly check ins, and a licensed physician guiding me every step of the way. And the cost? The same as those risky online options. Tucson, your moment is here. If you're ready to take control, feel better and lose weight the right way, mediweight loss is ready for you. Walk in, get started and see real results. Call or visit mediweightloss.com to learn more and book your free consultation today."}
{"episode_id":"SW - #377 - 2025-02-20 - Annie Crawford - The Breakthrough of Myth","start":59.25,"end":96.06,"speaker":"Annie Crawford","text":"That's mediweightloss.com and for Lewis, the key is myth. In myth, mythic stories. Not modern novels that are full of idiosyncrasies, but mythic stories. What we have is an imaginative experience of universal truths. So myth itself will bring together our participatory, embodied ritual, imaginative mode of reality with all of these truths that reason has discovered, but give us an experience of them in a way that brings the parts of our soul back together."}
{"episode_id":"SW - #377 - 2025-02-20 - Annie Crawford - The Breakthrough of Myth","start":96.3,"end":178.62,"speaker":"Jonathan Pageau","text":"What you're saying is really important and this is the question in some ways in the symbolic world we've been talking about. Exactly. What you're saying is that this is inevitable. Like this is in some ways modernity is yielding to something like that. The question is, is it simply going to happen to us or will we have some form of participation in the way it does? Because sometimes these myths, you know, they break in and then they break in in ways that is, that can also be extremely destructive. You know, we've talked about during COVID the George Floyd like situation where all of a sudden this story like just falls into culture and like captures everybody and mobilizes everybody in the world. Like not just in America for some reason, like all over Europe, people are out in the streets, you know, and, and, and this character gets lifted up, you know, like a, like an almost divine figure. But there are other type, there are other versions of that happening all the time. Where these stories kind of break in and, you know, it's interesting to think about Till we have Faces almost as a story about that. This is Jonathan Pedro. Welcome to the symbolic world."}
{"episode_id":"SW - #377 - 2025-02-20 - Annie Crawford - The Breakthrough of Myth","start":189.01,"end":232.13,"speaker":"Annie Crawford","text":"Hello everyone. This is Annie Crawford inviting you to join me this January for a symbolic world reading of Til we have faces, the book C.S. lewis calls far and away the best I've written. Till we have Faces is Lewis's modern retelling of the myth of Cupid and Psyche, a mysterious tale of dark idolatry, classical enlightenment, and the shocking discovery of true religious vision. In our four week online course together, we'll explore what CS Lewis has to show us about the nature of myth, the dangers of love, the limits of reason, and the secrets of genuine re enchantment. This is a book, an author, and a class you won't want to miss."}
{"episode_id":"SW - #377 - 2025-02-20 - Annie Crawford - The Breakthrough of Myth","start":235.09,"end":270.43,"speaker":"Jonathan Pageau","text":"Hello, everyone. I am here with Annie Crawford. Those of you that follow the symbolic world have seen her around. She's becoming our CS Lewis expert. Our CS Lewis teacher, she had gave a class on CS Lewis's space trilogy, the cosmic trilogy. And now we have a new class on Til we have Faces, which is kind of in the air because, you know, this kind of Return of the Gods moment where people are being aware of principalities and this neopaganism that's emerging. It feels like it's definitely the book to talk about. And so I'm happy to have you on with us."}
{"episode_id":"SW - #377 - 2025-02-20 - Annie Crawford - The Breakthrough of Myth","start":270.59,"end":273.15,"speaker":"Annie Crawford","text":"Yeah, thanks for having me. It's always a pleasure to talk with you."}
{"episode_id":"SW - #377 - 2025-02-20 - Annie Crawford - The Breakthrough of Myth","start":274.11,"end":298.35,"speaker":"Jonathan Pageau","text":"And so we're a little late on this. The class has already started. I think we already have two. There's already been two classes. And so I apologize to everyone watching. You can catch up. You can still sign up. I've heard amazing things about it. People are definitely excited to talk about this important book. And so maybe tell us a little bit, why you? Because you're the one who proposed this. So why do you think that it's important to talk about this book at this moment?"}
{"episode_id":"SW - #377 - 2025-02-20 - Annie Crawford - The Breakthrough of Myth","start":299.32,"end":418.96,"speaker":"Annie Crawford","text":"Yes. Well, I proposed it because I think it is Lewis's best book. And as his friend Owen Barfield said, everything Lewis thought about, everything was gathered together in what he said about anything. So Lewis is a very systematic thinker who would pull together all the threads of his thought into each thing that he said and created. And nowhere is that more true of Till we have Faces that this book really gathers together in his most mythic form, in his highest level of literature, everything that Lewis thought about, everything. So if people are going to study one book, I think that Till we have Faces is the book to study, not only because it pulls together all the threads of Lewis's thought in a really well crafted novel, but also because it is his most difficult book. And so if you're going to have a guide, if you're going to discuss it with others, this is the book to do. So. Andrew Lazo, another Lewis scholar, he calls Till we have Faces like the Rosetta Stone of C.S. lewis's work. So if you can decode the language of this book, then you can go to all of Lewis's other work, have the tools you need to read the rest of his corpus. So that's the main reason I thought, okay, if we're going to do another class, it's my second favorite book after Perelandra. We already did the Ransom trilogy. But then also because everybody's talking about Re Enchantment, right? Everyone is talking about the return of the gods. And this book is a myth retold, and it's told in an ancient pagan mythical context. And so if we're going to start talking and thinking about Re Enchantment and how do we approach that, this book is right on point for the theme that we see percolating through culture right now."}
{"episode_id":"SW - #377 - 2025-02-20 - Annie Crawford - The Breakthrough of Myth","start":420,"end":488.51,"speaker":"Jonathan Pageau","text":"Yeah, well, when I read it, I felt very similar to what you're saying. It's a very strange book in some ways because I'm used. How can I say this? I've had my criticism of C.S. lewis in some ways, the same criticism that Tolkien had of some of his work, which is that there's too much of a one to one thing and is a kind of metaphorical language that is a little too on the nose. You know, it's like Aslan is Jesus. We all know the critique, you know, and I still love, Yes, I love his theoretical work, of course, and I think he's a. He's really a prophet for the modern, for the modern age. But reading Till we have Faces, you don't get that sense at all. You. There's something far more eerie about the presentation. There's. There's a kind of ambiguity about some of the elements in the story. And, you know, there. The meditation, let's say, on our experience of the numinous. We could say this is Rodrier's word that he's using is far more subtle. For those who don't know, it's a take on the myth of Eros and psyche. So maybe you can take us through some of the key things that make it relevant to us right now."}
{"episode_id":"SW - #377 - 2025-02-20 - Annie Crawford - The Breakthrough of Myth","start":489.39,"end":769.83,"speaker":"Annie Crawford","text":"Well, let's start with why you feel that a lot of Lewis's work is a little on the nose or a little overly allegorical or as you said, Tolkien had that criticism. So Lewis himself felt really deeply this bifurcation between his rational side, you know, he's a modern man educated in the modern world, and then his mythic side or his imagination. He was an Ulster Irishman. He loved the mystical green hills of Ireland and the myths and the legends of Ireland. And so Lewis himself felt, he felt very bifurcated. He wrote in his autobiography that the two hemispheres of my mind were in sharpest contrast on the one side this mini islanded sea of poetry and myth, and on the other, this glib and shallow rationalism. And he said for, you know, most of his young adult life, everything he loved, he thought was imaginary or unreal. And everything he thought to be real or true, he thought grim and meaningless. And so he started adulthood with this really bifurcated experience of reality. It was Tolkien, Barfield first, and then Tolkien and Hugo Dyson who helped him see that in Christ, right, myth and fact came together. And so that was the turning point for him. But I think it took him a long while to actually work out how to integrate those modes within his own imagination and his own work, right? So early on, his first work was pure allegory. So he tries to write his conversion experience in the Pilgrim's Regress, which is just like Pilgrim's Progress, total allegory, you know, that one to one correspondence. And then he starts to write his apologetic work and nonfiction fiction. So he's writing in nonfiction or the analytical mode, and then he'll write, you know, something imaginative like screwtape letters or a great divorce. And you kind of see him switching back and forth between rational mode and then mythic mode. And, you know, his friend Owen Barfield would tease him that he had this expository demon, that he would try to write fiction. He would slip back into the analytical mode and have a digression on philosophy or theology. And it was another turning point for him was his debate at the Oxford Debate Club with the philosopher Elizabeth Anscombe. So he was debating his argument in miracles with Anscombe, and he kind of lost the debate. And that caused him to reevaluate, you know, one, he always wanted to be a poet, not a philosopher. So was this really the best way to use his energy in kind of this analytical, rational mode of argument? Was that really the best place for him to be? And so that's when he, he kind of set aside his rational apologetic work and picked up the Chronicles of Narnia, picked up fairy tales. And what I think is that he has this essay called Sometimes A Fairy Tale May Best say what's To Be Said. Right. Maybe you can relate to fairy tales being the best way to say what we need to say. And he says that what he loved about fairy tales was their severe fear form, the way that a fairy tale is. So it must be simple, it must be pure, and it is intolerant of what he called gas. And so what he did, I think, is submit himself to the form of a fairy tale as a kind of mode of discipline to purge himself of that expository demon. And so writing those children's fairy tales disciplined him as a writer, forced him to stay within the mode of narrative and not fall into those rational, analytical digressions. And then I think by the time he finished his seventh Narnian chronicle, his seventh fairy tale, he kind of trained himself in how to better communicate what he had to say while staying within the narrative, within the mythic. And then he was ready for that mode at the level of an adult novel. Right, because an adult novel, you pull off the training wheels. You can start to slip into digression if you want to. But by that time, I think he'd figured it out. And then unfortunately, you know, he passed away within a decade after writing that. Till we have Faces. And so we don't get more of these novels from the mature Lewis, but at least we got one."}
{"episode_id":"SW - #377 - 2025-02-20 - Annie Crawford - The Breakthrough of Myth","start":770.79,"end":836.85,"speaker":"Jonathan Pageau","text":"At least we got one. And so the strangest thing about two Wiff Face is that it. I mean, some people have said it's his most Christian work or something like that, but it's also really a pagan story, you know, and the strangeness of the pagan world and the kind of cruelty of the pagan world is put at the forefront. You know, the figure of the Father, you know, is this kind of brutal. This brutal man, and the daughter is trying to kind of find their way around that, you know, and it seems to continue. It's interesting because it also seems to continue in the line of Narnia, which Narnia, although it's more Christian in the appearance because of Aslan and some of the characters are kind of really kind of Christian allegories. But nonetheless, he picked a kind of pagan landscape, you know, for Narnia as well. And so do you have insight about that? Like, something I've been thinking about a lot for Tolkien as well. Why. Why did they skirt writing within the Christian cosmology? Why did they want to write within the. With these pagan images. I have nothing against it, by the way. It's not a critique. I'm just curious about what it is that prompted that."}
{"episode_id":"SW - #377 - 2025-02-20 - Annie Crawford - The Breakthrough of Myth","start":837.01,"end":1189.96,"speaker":"Annie Crawford","text":"Yeah, and I do think a lot of people experience it as confusing. Lewis tells us that again in that essay, sometimes fairy tales may say what's best to be said, which is a wonderful and a terrible title all at once that, you know, what he felt like is when you speak directly to someone, you, you rouse their self defenses, right, Jonathan, you should do this. You should believe that. And by nature we say, well, should I? You know, we have a natural defensiveness. And so he says that myth and fairy tale can sneak past the watchful dragons. It can take an idea that if we encounter it directly with, you know, this is what the law does. Like Paul tells us that the law actually rouses sin in us. It's just something true about our human nature. When you tell me not to think about unicorns, well, I want to think about unicorns. And so if we take the truth or the thing we need to know, the thing we need to see and we put it, we tell it slant, like that poem, tell the truth, but tell it slant that we put it in the context of, of a fantasy world or a mythic world or a world over here, then we can sneak past the watchful dragons, we can bring in truths we need to see about reality in a way that is slant, in a way that we don't expect, in a way that strikes at the roots deeper than our conscious self defenses. And so that's why I think both Tolkien and Lewis looked to myth, looked to fairy tales, looked to things that didn't feel overtly Christian because they wanted to reframe these truths about reality that they wanted to share with people for their own good. Right? But in ways that could sneak past those dragons and help open people up to them in different ways, but in terms of till we have faces. And it's very pagan because it does feel dark, doesn't it? We have human sacrifice. It's a story about human sacrifice. And so I've been, you know, thinking about this and I think what Lewis, how he created stories is he said that, you know, he did not have a truth he wanted to tell, you know, that, oh, I want to tell children about the love of Jesus. How could I do that? Let me think of a lion that could, you know, he said that's not the way the imagination works. The imagination works by perceiving an image or being captured by some image. And then Meditating on the image, to perceive through the imagination the meaning that is there, right? So an artist doesn't impose meaning on the world. An artist perceives the meaning of the world through the muse of the imagination. And so the story of Cupid and Psyche caught Lewis's imagination, actually, when he was a very young man. And he tried to write several poems early on, and they just. They never worked. They never resonated. We talk about this in the class, in the first session. You know, why? I don't think they resonated. But it wasn't till, what, 35 years later, as an older man, that finally he had the maturity, the religious vision to perceive what those stories were trying to tell him. And my theory is. And this is something I want to talk to you about, because I know, you know, Rene Girard and his theory of mimetic desire. And what struck me is that, you know, for Lewis, when he's coming to myth and he's talking about myth most of his life, he's seeing myth as anticipations of truth, that myth is our way of trying to see through the veil and perceive truths about the divine nature. And so for Lewis, myths are gleams of light. But that strikes me as fairly different from what Rene Girard is saying about myth, right? Because Girard is saying that myths are actually. That as humans, we encounter a good, so we see someone else desiring a good. So in the story of Till, we have Faces, we see that the beauty of Psyche, she's beautiful, and we see people desire her beauty. And when Orowell sees someone desire the beauty of Psyche, that rouses, in Orwell imitative desire. She also wants the beauty of Psyche. And then that creates a rivalry. The archetype of this is Helen, right? This is, I think, one reason why. Why do all stories connect back to Troy, Right? Isn't it bizarre? Everyone's always wanting to be on the side of the losers, right? We want to identify with the Trojans, like, what's going on. Part of, I think, is that Helen is the archetype of mimetic desire, the most beautiful woman in the world. Well, what does beauty do? Beauty rouses our desire. Everybody wants the most beautiful woman in the world. That creates this mimetic competition for a finite good. Well, not everyone can have a finite good. Therefore, there's violence and conflict, and the whole world burns down, right? The cities are destroyed, the Greek armies are destroyed. Mimetic desire destroys the world, right? So what does Gerard say? So how do we cope with that? Well, you create the scapegoat mechanism. Right. So that. And, you know, the whole. The whole war, the Trojan War could have been avoided if they just let Paris be the scapegoat. Right."}
{"episode_id":"SW - #377 - 2025-02-20 - Annie Crawford - The Breakthrough of Myth","start":1191.33,"end":1198.61,"speaker":"Jonathan Pageau","text":"Yeah. They just killed Paris. Just given up Paris. Like things would have been solved. Yeah, something like that."}
{"episode_id":"SW - #377 - 2025-02-20 - Annie Crawford - The Breakthrough of Myth","start":1198.61,"end":1259.52,"speaker":"Annie Crawford","text":"Well, and you actually find in the Iliad that they try, but the gods won't let them. Irony. Right. So you come with a scapegoat mechanism. Well, we'll put all the blame on this one person and then cast out exile or kill the scapegoat so as to resolve the violence, so as to present, prevent the whole world from burning down. And then, for Girard, a myth is the story that we make up to justify that violence, to give that violence, you know, the. These. The divine justification. Well, the gods required it. So for Girard, myths are lies or deceptions that we create and then participate in through ritual in order to justify. Right. The violence against the victim. Okay, so it struck me that those are two very different approaches to myths, where, for Girard, myth is deception, and for Lewis, myth is gleams of truth. Well, which one is it?"}
{"episode_id":"SW - #377 - 2025-02-20 - Annie Crawford - The Breakthrough of Myth","start":1260,"end":1504.21,"speaker":"Jonathan Pageau","text":"Yeah, Well, I think it's both. I think, for sure, Girard, as you. I mean, I'm not an expert on Gerard, but, you know, the more that I think about his basic premise, the more I realize that he's. He's 50% right and therefore 50% wrong. Like, he gets. He gets half of sacrifice, but he doesn't understand the other half, you know, because there are two aspects of sacrifices. You know, there is the scapegoat sacrifice. And one of the things that I think this is the most difficult aspect of this idea is that if you understand the problem of scapegoat, the question of scapegoat sacrifice, it's more than just an idea of mimetic desire. It is that, but it actually is the way that identity functions. In order for identity to function, you have to decide where. How can I say this? You have to eject the things that don't fit from an identity. That is actually how all identity functions. You have to be able to expel the things that aren't conducive to the cohesion of the identity, whether you do it conceptually or whether you do it in practice. Like, in a group, you. You know, if you have a company and there's someone in the company that is not a good employee, and you eject them, like, is that a scapegoat sacrifice? I mean, maybe it's a scapegoat sacrifice. Sometimes it has a Mimetic aspect, which would. Which. In which you can put more blame on the person you eject than they deserve in order to reinforce the cohesion. But it's also a necessary part of identity to eject things that don't fit. Now, of course, the extremely ritualized aspect of mimetic sacrifice that appears in the ancient world obviously has. You can kind of understand how it's closer to what Girard is saying. But I think that this is where Girard gets it wrong, is that mimetic sacrifice is revealing an aspect of how reality works, and it is revealing an aspect of how identity functions. It actually works. And the idea that Christ is only exposing the false nature of mimetic sacrifice, I think that that's a wrong take on it. I think that what Christ does is that he fuses the two aspects of sacrifice together. Which is the second part of sacrifice is the one that Girard seems to at least struggle to understand, which is the idea of giving up the best. Up to. Up to God. Right. The scapegoats. In the Yom Kippur sacrifice, there are two sacrifices. One is the scapegoat sacrifice, and one is the purification sacrifice. One is cast out of the identity in order to wander and to kind of become the crooked aspect of, you know, take on the crooked aspect of our identity, the sins. And the other is offered up to God, and its blood comes back down to cover, you know, the holy things and bind them. That's a good way of understanding it. And so those are the two aspects of sacrifice. And Christ shows us how, joins them together in a very particular and transcendent way. And so that's why I think that. And it's. You think about it like that. The two aspects of reality in general, which is all representations of reality, are both a representation of reality and not the thing that is represented. And so all levels of being can be represented as truth, which manifests God to us, and as a lie, which is a veil that's hiding truth from us because God is beyond that reality. And so that's just how the world functions. If you take the veil for itself, then it's an idol. Then it's a mistake, then it's a lie. Then it's a. Then it's a. You know, but if you take the veil as something that's translucent, through which you see the light come through, and as something that is revealing, you know, imperfectly, a higher truth, then it's a form of truth, right at the level that it's supposed to be, not ultimate. Truth. And so I think that that's the. That's the way to understand it, you know? And, you know, interestingly enough, I think that these are themes that are in Till we have Faces."}
{"episode_id":"SW - #377 - 2025-02-20 - Annie Crawford - The Breakthrough of Myth","start":1504.21,"end":1506.41,"speaker":"Annie Crawford","text":"Yes, yes."}
{"episode_id":"SW - #377 - 2025-02-20 - Annie Crawford - The Breakthrough of Myth","start":1506.49,"end":1511.13,"speaker":"Jonathan Pageau","text":"I mean, you can elaborate on that, because the whole question of veils is very important in the. In the story."}
{"episode_id":"SW - #377 - 2025-02-20 - Annie Crawford - The Breakthrough of Myth","start":1511.37,"end":1656.3,"speaker":"Annie Crawford","text":"Yes. And I think. So I think this is part of why the story captured his imagination, is because the story itself points toward this polyvalency of symbolism and of sacrifice. And I think Lewis as a young man, it's almost like the world is like a Rorschach test. Right. Because symbols have that polyvalency, you know, and as Christ said, to the pure, all things are pure. To those undefiled, unbelieving, nothing is pure. Right. So. So that symbolism has that double vision to it. Right. And so that we can see what we want to see, or that what we see is actually a revelation of our own hearts and our own desires, the way that the symbolism is set up. And so Lewis, as a young man, looked at this myth and he saw that the gods were in the wrong, but he could never make the story make sense from that perspective. Right. And then later, as an older man, he came to see that the older sister was indeed in the wrong. And so I think the story captured him because of its double vision, because of the way it shows both the demonic side of sacrifice and the true side of sacrifice. And, yeah, it very much is connected to the imagery of the veil itself. Right. Which is, I think, one of the most clearly polyvalent symbols. Right. A veil both conceals and reveals. And you see that double symbolism all throughout the story. And then the main character wrestling with being. You know, this is part of why the story is so fascinating, because the whole first half is written from one side of the symbolism. And then she has an experience that forces her to. To change and then begin to rewrite her own history, to rework and see the other side of the veil throughout her own story, which she didn't see before. So all of those themes are in this story. And I think it's what attracted Lewis to the story, the way that it did pull together the major themes of his life into one narrative."}
{"episode_id":"SW - #377 - 2025-02-20 - Annie Crawford - The Breakthrough of Myth","start":1658.26,"end":1772.75,"speaker":"Jonathan Pageau","text":"Because, you see, like, it's interesting, there is a sense, like in Perelandra, in the Marston series, you get this sense that the principalities are double. Like, you really do see that. That in some ways he tries to formulate it. In a way, he's saying, in some ways, the way that we perceive these principalities has been twisted by the evil one. And therefore the version we have is kind of an impure version of the. Of the principalities. But if you. But at the end of the series, you know, you see this glimmering image of Venus and Mars, who are ultimately the ancient pagan gods. But like, as they are messengers from the. From the high God in the sense how they are representations, you know, in their proper sphere of masculinity and femininity, you could say of. Of God. And so, you know, it's. In this book you have kind of the same idea because this, you know, for people who don't know, like we're talking about it and we're not telling people what the story about. Like this. This woman is given, you know, kind of sac. Sacrifice to this God. And there's a strange. You know, in some ways she's supposed to die there with the God. And when you see her from the outside, she becomes this, like, ragged princess. You know, she looks like she's almost like a homeless lady, but in her inner experience of what's happening, she's actually the bride of a God. And she's a bride of a God. But she has to be careful in the way in which she deals with the God that she has to, like, not look at the God directly. She has to be patient and kind of wait for the God to reveal himself to her in the proper circumstance so that she doesn't, you know, let's say, transgress what the relationship she has with the God. And so. And ultimately these two parts seem to be true. Like, you can actually read it. You can read it from both sides. Like she really is this ragged princess, like, running around barely, almost homeless. But her inner experience is also described as true in the story."}
{"episode_id":"SW - #377 - 2025-02-20 - Annie Crawford - The Breakthrough of Myth","start":1772.99,"end":1871.43,"speaker":"Annie Crawford","text":"Yeah, I think that's part of what makes the story so well crafted, is that the way that Lewis tells the story, he maintains the tension of a double vision or a double interpretation. You know, one way he does that is the contrast between the priest who represents the pagan mythic imagination and the Fox, who represents. He's a stoic kind of enlightenment philosopher, in a sense, rational enlightenment. And that as the events of the story progressed, you can interpret it from either angle. It makes sense if you look at it from the priest angle, who is referring to the gods, you know, who are demanding the sacrifice of the accursed to make the fields, you know, to bring. To heal the plague and the famine. You can also interpret it from the Fox's perspective of. That doesn't make sense. He's saying Things. Let's see, how the Fox's perspective might work is that, well, of course, the reins came after the sacrifice because they had to come sometime. Right. Of course, when things go badly, you can always invent a scapegoat to blame. That doesn't mean it was the scapegoat who caused the famine. And so the way that Lewis tells the story the whole time, he pulls out this double vision. He pulls out this polyvalency again, so that the story functions as a reflection on the reader, so that, you know, the first time I read it, I didn't like it. And the first time."}
{"episode_id":"SW - #377 - 2025-02-20 - Annie Crawford - The Breakthrough of Myth","start":1872.23,"end":1873.95,"speaker":"Jonathan Pageau","text":"Pardon, you didn't like the story?"}
{"episode_id":"SW - #377 - 2025-02-20 - Annie Crawford - The Breakthrough of Myth","start":1873.95,"end":1920.16,"speaker":"Annie Crawford","text":"I didn't even make it past page 10. You know, the first time I read it, I was like, what is going on? Then the second time I read it, I sided with Orowell and the Fox and kind of my maybe more conservative Christian bias against the evils of paganism. Right. Then the third time I read it, I saw the darkness of Orowell. And so each time you read it, because he's done such a perfect job of pulling out that tension, showing the. The double vision that we do experience in reality makes the story itself a mirror in which you have to wrestle with your own desires and what you want to see out of the world and out of the story."}
{"episode_id":"SW - #377 - 2025-02-20 - Annie Crawford - The Breakthrough of Myth","start":1921.12,"end":1945.4,"speaker":"Jonathan Pageau","text":"Yeah. And I mean, do you see those two sides? Because at the outset, you presented Lewis as someone who, in himself, kind of wrestled with these two aspects. A more, you know, kind of medieval, enchanted vision of the world. But then also this, you know, kind of rationalistic modern man. I mean, do you see that these. This is what's going on in the story itself with these. These two characters or these two aspects of the story?"}
{"episode_id":"SW - #377 - 2025-02-20 - Annie Crawford - The Breakthrough of Myth","start":1945.48,"end":2235.03,"speaker":"Annie Crawford","text":"Yeah, very much. And you can see quotes that Orwell speaks that are paraphrases from Lewis's own autobiography. You know, she almost says, I felt literally torn in two the way that Lewis says that. So he very much is. There's an autobiographical element, but it need not be about Lewis because it's really about us as modern people. Right. At the end of the modern world, the collapse of modern rationalism, wrestling through how to find a mode of reintegration, knowing that we can't go back to ancient paganism. And Lewis is very influenced by his friend Owen Barfield. Right. And I don't know if you've read Barfield saving the appearances or poetic diction. And he very much talks about how for the ancient person, he. The ancient person would perceive the world as unity. So you'll See, this in the classic example is the idea of breath, right. Is it breath or is it spirit? Well, for the ancient person, yes. They didn't experience that as separate things. It was the breath and the spirit were a unity. And so they would perceive the world in unities, and that it was, you know, let's say, beginning with Greek philosophy, and then, you know, that being a foretaste of what would come in the modern Enlightenment, where through. Because think about reason. Reason works through bifurcation. Is it A or not A? Is it A or B? And so reason works by differentiating, right? So it's that fall into duality, which brings a certain kind of knowledge, but at a certain cost. And so for Barfield, you know, human consciousness began through experiencing the world through these unities. And you talk about this all the time, right. Where those distinctions almost don't make sense when you're going back to look at a biblical or ancient mode of being. And then in the modern world, moving toward the modern world, more and more and more and more we separate using the instrument of reason into this or that, you know, and these are some of those. The silliness that happens over theology. Well, is it works or faith, you know? Well, that makes no sense to ancient. The faith that works. What do you mean? Believing and not embodying it? Right. Like that makes no sense. And so modern man has really ripped the world apart into body and spirit, into this or that. And so, Louis, we are all striving after now, as we see that's not gonna work. It's led us to nihilism. We're striving after a mode of reintegration which Barfield called a final participation. And in that sense, it's that the. You can maybe see a kind of providence there. So in sports. So for me, I'm a dressage writer. Is that so? Like snobby or what? But in dressage, we'll talk about, in training, that you're aiming for a simplicity on the other side of complexity. Okay. So when you start something, there's a kind of simplicity. We'll just get on the horse and kick, right? Yeah. Okay. And then you get into it and you try and get good. You realize it's not that simple at all. It's extraordinary, complex, and you fall into multiplicity because you're trying to figure out how to control every inch of your body. But once you move through that complexity on the other side, you have a reintegrated simplicity where you. Then you just ride. And that's the flow that People are aiming toward in sports. Right. And for Barfield and for Lewis, that's what modern man. We're trying to reach toward a simplicity, a reintegration of mind and body that's on the other side of this multiplicity that we've fallen into. And for Lewis, the key is myth, because he thinks that in myth, mythic stories, not modern novels that are full of idiosyncrasies, but mythic stories, what we have is an imaginative experience of universal truths. So myth itself will bring together our participatory, embodied ritual, imaginative mode of reality with all of these truths that reason has discovered, but give us an experience of them in a way that brings the parts of our. Our soul back together. Sorry, that was maybe."}
{"episode_id":"SW - #377 - 2025-02-20 - Annie Crawford - The Breakthrough of Myth","start":2236.39,"end":2445.51,"speaker":"Jonathan Pageau","text":"I think that this is really. What you're saying is really important, you know, and then the. The. The question. And this is the question in some ways, in symbolic world we've been talking about. Exactly. What you're saying is that this is inevitable. Like, this is. In some ways, modernity is yielding to something like that. The question is, is it simply going to happen to us or will we have some form of participation in the way it does? Because sometimes these myths, you know, they break in, and then they break in in ways that is. That can also be extremely destructive. You know, we've talked about, during COVID the George Floyd, like, situation, where all of a sudden this story, like, just falls into culture and, like, captures everybody and mobilizes everybody in the world. Like, not just in America, for some reason, like all over Europe, people are out in the streets, you know, and. And this character gets lifted up, you know, like a. Like an almost divine figure. But there are other type. There are other versions of that happening all the time where these stories kind of break in. And, you know, it's interesting to think about. Till we have faces almost as a story about that, because the Fox. The fox, for those who don't know, the fox is like a Greek slave that is brought into this pagan world. And he. He kind of is a more rational person. He's a. You know, he's. He's. He's in some ways a representation of the modern mind that's thrown into a kind of primitive and pagan world, that he is trying to pull the people kind of out of that world. But then what happens to this figure and to everybody in that world is that the numinous just breaks in. Yeah, basically, it's like, now what. Now how do you deal with this thing that's happening, this thing that is beyond what Reason can account for. And in that context, like you said, in some ways the character of the Fox all of a sudden becomes insufficient to be able to account for everything that's happening in the novel. Even though the character is very sympathetically portrayed. Not at all like I would tend to portray the modern person as, with a kind of frustration of my experience with the kind of modern reductionist. But. But Louis presents it very, very sympathetically. And so in some ways, the whole story is an image of what it is that's happening to us now, which is as we. As modernity kind of runs out. And now this numinous is peeking in, you know, for those who are. I mean, for goodness sake, I was watching the Trump's press release today with like all the AI people, and they're saying we're funding the largest AI thing in the world, $500 billion to build into AI infrastructure. We're calling it Project Stargate. And I'm like, what the hell is happening? Why are you calling it Project Stargate? It's like, I mean, this is happening to us. Like something is, you know, and Everybody's talking about UFOs and everybody's talking about these unidentified things and is it. And so we're right there. Like we're right at the. The cusp of some of these things that we've been, that we've been seeing peek through culture now for the past decade become absolutely unquestionable. Like it's going to be, at some point, everybody is going to be thrown into this perception of something more than what reason can account for and how do we deal with it."}
{"episode_id":"SW - #377 - 2025-02-20 - Annie Crawford - The Breakthrough of Myth","start":2445.67,"end":2629.41,"speaker":"Annie Crawford","text":"Yeah, for sure. And I think, you know, there's a reason that Lewis portrays the Fox sympathetically, because reason does play a function in protecting us from deception. Right. And so I think until we have faces, we can look at the character of Psyche, who is a kind of idealized character. She's kind of a saint. We can just think of her as what a saint looks like in her own context. And as she. So I love how you're describing, you know, the numinous, the mythic just breaks in and how do we respond? And that, you know, the demand of Psyche sacrifice looks very demonic, looks very scary. Looks very much like a demonic story breaking in to seize control of the world. Right. So how is it that Psyche responds to it? And there's this chapter, I think at 7, it's a conversation between Orwell and Psyche the night before she's sacrificed. And Orwell's upset and just wanting to weep, but Psyche is preparing herself as a saint prepares themselves for martyrdom. Right. And she's giving us an image of the martyrs. Well, I'm sure that when the martyrs were being thrown to the lions that it felt like a demonic myth breaking in and taking control of their world. Right. How do they respond to it? And the way that Psyche responds is that she. And this is that polyvalent. And it very much echoes Saint. My goodness, can't remember his name right now. Please forgive me, Ignatius. Saint Ignatius, who says, what I'm afraid of is that you will. You will or will prevent me from being sacrificed because I desire God and by being offered to him is how I participate in his life. It is how I am joined to my lover. It is how I become one with my bridegroom by becoming the bread of Christ offered and an anamnesis, an imitation of my Lord. Let me participate in the story. Because from the way that you're looking at, again, to the pure, all things are pure. To the undefiled and believing, nothing is pure. Right. And so for Orowal and the people who see the demonic side, it's terror. But to the saints and those who see the divine side, it is an opportunity to participate in the life of Christ for the life of the world. And so I think, you know, that story is going to break in, but there's always a divine side to the story that we can see and choose to participate in."}
{"episode_id":"SW - #377 - 2025-02-20 - Annie Crawford - The Breakthrough of Myth","start":2630.45,"end":2715.64,"speaker":"Jonathan Pageau","text":"Yeah. And Orwell, you know, there's this scene which I think is probably one of the most, obviously the most crucial scenes in the story. You know, when her sister, when she sees her sister after the sacrifice, you know, for the first time. And she, she glimpses the palace, right? She glimpses the God's palace. And then that's just a glimpse. And then she refuses the experience. Like, she basically says, no, I'm going to stick with this, just the reason part. And that's when, you know, she starts to, in some ways embitter herself and become, you know, that's when she starts to wear. She literally wears like a veil over her face at some point. Like, it's even hard to imagine it. The character in the story, like, she becomes kind of like the king figure, but she, she's hiding herself behind this, this veil, you know, and. And I think that again, like, in terms of this moment, like that we're going through it, it is also going to become dangerous for us to refuse what's happening, you know, and what's happening right now is very dangerous. Like, it's not there's nothing. There's nothing that's just good about it. Like it. There is an. We're in an extremely dangerous, crucial transformation of society. But we also cannot simply pretend and think that we can hold on to the old world because the old world is going away."}
{"episode_id":"SW - #377 - 2025-02-20 - Annie Crawford - The Breakthrough of Myth","start":2717.4,"end":2878.02,"speaker":"Annie Crawford","text":"Yeah. And there's where I very much agree with Paul Kingsnorth, that, you know, the previous world has died, has ended. And I think that there are many points of participation in the formation of a new world. You know, personally, in terms of as a homeschooler and homeschooling in the classical renewal, I feel like I've had the opportunity to participate in the seeds of renewal, right? And the preservation of the old story, in the preservation of functional family models. And so I think you're right. Like this myth, the numinous has broken in. It has seized us. The old world is ending. The new world is being born. We have to choose what we will participate in. But there are seeds of. There are arcs. There are seeds of renewal, seeds of a new world being born. Arcs, temple arcs, spaces in which we can participate in. Right. And so this is what Lewis shows us, I think, at the end of that hideous strength is. Okay, well, when the world collapses, you know, what do the faithful Christians do? Well, they gather around the table, they grow vegetables, they take care of their dogs. They have babies. Right. You do the same thing you've always done, which was faithfully participate in the thing that we've been called what is human. We faithfully participate in what it means to be human. And one other polyvalency that I want to point out, since I brought up hideous strength, is that it's really interesting at the end of that hideous strength, it's the end of a world, right. It's an image of the collapse of modernity and the techno bureaucracy and the machine, Right. And what you have, as Belbury, is you have two banquets, and this is part of that polyvalency, right? So the banquet that we see in Revelation, this feast that happens at the consummation of a world, let's say, is destruction for the enemies of God, but a banquet for the people of God, right? And that. You have that, that. That double vision in Revelation where Christ comes with the. With the. The feast of the Lamb. And yet. And I think It's Revelation either 19 or 21, it's the WinePress is the trampling of the enemies of God."}
{"episode_id":"SW - #377 - 2025-02-20 - Annie Crawford - The Breakthrough of Myth","start":2878.42,"end":2941.25,"speaker":"Jonathan Pageau","text":"Yeah, yeah, yeah, yeah. But like you said, there is this duality of it also being the consumption and the marriage, you know, of the bridegroom and the bride, you know, and that is definitely present until we have faces that that duality is there all through. All through the book. And so, you know, I, you know, I. I'm really happy that. That you're doing this. Like, I'm really happy that it seems like this is the right time, you know, for people to dive into this story. Folks, if you haven't read the book, now's the. Now is the time to read it. It is definitely. It is definitely something that speaks clear, that's not clearly, but speaks very profoundly to our moment. And I'm really happy that you're. That you're doing this class for us. So there's still time to catch up, folks. I think there's only two classes that have started. You can watch the first ones and then jump in, live with Annie and the people. And I think you're doing this very interactive, in my understanding."}
{"episode_id":"SW - #377 - 2025-02-20 - Annie Crawford - The Breakthrough of Myth","start":2941.65,"end":2945.45,"speaker":"Annie Crawford","text":"Yes. So. And we've only had one class. Well, although by the time this."}
{"episode_id":"SW - #377 - 2025-02-20 - Annie Crawford - The Breakthrough of Myth","start":2945.45,"end":2947.33,"speaker":"Jonathan Pageau","text":"I think by the time this comes out, we'll have two."}
{"episode_id":"SW - #377 - 2025-02-20 - Annie Crawford - The Breakthrough of Myth","start":2947.87,"end":3010.87,"speaker":"Annie Crawford","text":"Yep. And then we're having a week off. We're gonna have two more classes in February. So, yeah, if you want to join, jump in. The recordings for all of the symbolic world classes are always available for people to come in, watch those recordings on their own time. Participate, you know, go look at the discussions on the forums. I'm providing quite a few supplementary resources, essays from Lewis and other scholars to walk you through the. A story that really. It does not speak clearly. But I think that is exactly why it's important for this moment, is because we are having. We are being pushed to move past leaning on our own clear understanding and learning to trust in participatory ways of knowing right through the great story, through. Like you say, go to church. Go to church. Participate in a reality that is greater than your own understanding. And then that reality can carry you. When you go through seasons, you know, that. That are. That are harder than what you can control."}
{"episode_id":"SW - #377 - 2025-02-20 - Annie Crawford - The Breakthrough of Myth","start":3012.23,"end":3106.42,"speaker":"Jonathan Pageau","text":"You know, I'm curious. It's so interesting. CS Lewis, the more that I think about him, the more that I meditate on him, it seems like he really is a prophetic figure, you know, because some of his insights, he was seeing something that really was just in the germ that was really still very seed, like, you know, that hideous strength. Although there was already. You know, you can sense already after World War II that there. That there were these seeds of things happening. But, you know, when you read it today, you feel like, my goodness, like this could have, you know, except for like the technical details, some of the descriptions of the technical way they do things that it's talking exactly about our age. And so he definitely is a prophet and in some ways a precursor for a lot of the things that we talk about in symbolic world, a lot of the things that Martin Shaw talks about or Paul Kingsnorth and all these people that are kind of appearing on the scene right now and even in a weird way for what Jordan Peterson's doing as well, strangely enough, although Jordan sometimes he has a love of the, he has a bit of a love of the machine that, that, that we're still, we're still figuring out. And so everybody go, go to symbolicworld.com you members of the symbolicworld.com get also a discount on the courses. You can find that out as you go on the website and you can find Annie's class and jump in. It's definitely worth it. And so Annie, thanks for everything you do. And I can't wait to see what the next, what the next class that you think is worth our time in the future."}
{"episode_id":"SW - #377 - 2025-02-20 - Annie Crawford - The Breakthrough of Myth","start":3106.66,"end":3108.9,"speaker":"Annie Crawford","text":"Yeah. Thanks, Jonathan. I appreciate the opportunity."}
{"episode_id":"SW - #377 - 2025-02-20 - Annie Crawford - The Breakthrough of Myth","start":3109.22,"end":3170.24,"speaker":"Laura Diaz","text":"Tucson, the weight is over Mediweight loss. They're officially open on North Oracle Road. That's right. No more counting down the days. You can walk in right now and start your journey to a healthier you. Hey, it's Laura Diaz from iheartradio and you can trust me. This isn't just another weight loss clinic. I know that because it's where I lost weight safely with real medical support. GLP1 medications. You can see them everywhere online right now. But the truth is, your health shouldn't be a DIY project ordering these meds without the professional guidance. It can lead to dangerous mistakes, wrong doses, no oversight and serious risks. At mediweightloss, I got the same medication but with a customized plan, weekly check ins and a licensed physician guiding me every step of the way. And the cost, the same as those risky online options. Tucson, your moment is here. If you're ready to take control, feel better and lose weight the right way, mediweightloss is ready for you. Walk in, get started and see real results. Call or visit mediweightloss.com to learn more and book your free consultation today. That's mediweightloss.com."}
