{"episode_id":"SW - #113 - 2020-08-21 - July Q&A","start":12.56,"end":5508.25,"speaker":"Jonathan Pageau","text":"This is Jonathan Peugeot. Welcome to the symbolic world. All right, everybody, we are live. So today was a very strange day for me. Basically, my cousin, who is also possibly my best friend, I would say, passed away this morning from an aggressive pancreatic cancer. And everything happened very fast. You know, he was one of the strongest people that I know. He was training for hours every day. He was doing Ironman competitions. And then in. During COVID all of a sudden, he started having weird symptoms. And within a few months, he was dead. And so I saw him on Saturday and he was really. There was nothing much left of him, of his body. I would say he was really just like a skeleton. But he had kind of very odd and astounding piece to him. And. And I really. It really helped me understand some aspects of symbolism in a very powerful way, I would say, in a way that's. It's not just understanding it, let's say in your thoughts, but, you know, my cousin Pascal, he was really an amazing person. He was just an amazing husband, an amazing father. He was just a pillar in everything that he did. He was a straight shooter and just, you know, that the kind of person who's a motor in every group that he is involved in, he ends up being the. The kind of fulcrum that everything kind of turns around. And whatever he did was excellent. And he was really involved in people's lives in the sense that he cared and he was there for people. He was there for me all my life. And. And so what happened as he was kind of passing away is I. All of a sudden, I saw all the seeds that he had planted in other people, all the effort that he had put in, all the help he had given, all the times he had been there for other people. All of a sudden it just started pouring back on him, and he was just flooded with love and attention and people praying for him and crying for him. And it really made him glow, I would say, in a way that I had never seen before. And so I. When I went, I tried to go visit him about once a week since he got sick, maybe once a week and a half or something. And as I saw him kind of diminish his body, I could see his glory increase. And it was. It's hard to explain it, but I really. It was really an experience of seeing this dying man, but also seeing, not with my eyes, but seeing this glory kind of coming out of him as all the fruits of his life were coming to maturity. And so it was a. It was a good symbolism. Symbolism happens moment despite the fact that I miss him very much. And so I'm gonna try to get through these questions, but I don't know how far I'm gonna go, guys. I'm gonna try and so. All right, so I just want to say I really. I really appreciate everybody. You know, all of this obvious obviously kind of makes you rethink everything and. And try to be attentive to the people who are around you. And. And I just say I'm just so grateful for the past few years that all of you guys have given me a chance to be able to. To speak and to say what I think. And all your emails and. I know, guys, look, I know so many people have written me all kinds of emails, and I don't answer anymore, but, you know, it's not a reason to stop. I'm really touched by your emails. I'm touched by your story. I really appreciate, you know, when people reach out to me and. And. And I. And I apologize that I'm not able to answer all the emails. So. All right, here we go. Okay. So Carlos Ponce Vargas asked, what is the relationship between mythos and ethos? I would like to understand how history is affected by mythos and how mythos are affected by history. So I'm not sure I totally understand. Not try to totally understand the relationship between those two questions. I guess it just. It depends how you. What you mean by ethos. You know, if you mean ethos in the sense of morality, the way that we kind of understand it today, then maybe it's not enough. But if you mean ethos kind of in the ancient manner, in the sense of a manner of being, you would say, you know, of a character, something like that. Something like the. The. A way of being in the world. Right? The proper way of being in the world. A good way of being in the world. Then I would say that there's definitely a relationship between ethos and mythos in the sense that ethos would be the. The being the way of being, and then mythos would be. The story would be, you know, the. The way that the. The way that ethos kind of runs through time or runs through different aspects of life would look like mythos. And so I would say I would like to understand how history is affected by mythos and our mythos affects history. If you mean by mythos, you mean the patterns, if that's what you mean. I hope that's what you mean. At least that's what I mean when I use the word if. If that's what you mean. Then I would say that, on the one hand, mythos will affect history in the sense that it will be the pattern of historical movements. And how history affects mythos. It affects it in the sense that it manifests the pattern in the particular. And so, for example, different countries or different peoples will embody different aspects of the great story, or the great narrative will embody more certain aspects. And then certain times in history will also embody more fully certain aspects of the story. And. Right. And so if. Depending on if. If. If a civilization is ascending or descending in its. In its pursuits, then it'll obviously be embodying different aspects of mythos, and that will affect the stories they tell. They'll end up telling the aspect of stories which are closer to that which they're embodying in history. And so, you know, I keep saying things like, you know, we are at the end of the world, the edge of the world, the end of the world, the end of something. You know, the end of a. Of. Of some cycle of some kind. And so because of that, then the types of mythological representations we're seeing are those that are related to the fringe, that are related to the exception, that are related to all the things on the margin. Which is why I talk about it so much, because I figure because it's what we're faced with all the time, it's best we understand it so that we can then understand the bigger pattern, which obviously points us towards the center, hopefully, at some point. Okay, so David Flores asks, is submitting embodying a principle similar to hosting angels? Yes. I mean, at least that's what my brother Mature talks about in his book the Language of Creation, that hosting angels is providing food for a spiritual presence, and so providing body. And that's what embodying a principle is. And so to properly host an angel is to provide the right body for the angel so that there's a fit when there is a misfit between the body and the principle. That's when you get monsters, and when you get disorderly things, it's most. You know, when I say it's like it's the idea of understanding that there's nothing that is bad in itself. Things are bad only when they're not in their proper place. And so, you know, there's nothing wrong with going to the bathroom. There's nothing wrong with that, but there's something wrong with going to the bathroom in the kitchen. Right? That's. That's where there's a. That's where monsters appear when there's a Misfit. Between. Between the categories. Right. Anyways, okay, so Adam Schillard asked Paul V, brought up the centurion from Matthew 27:54. And it seemed to me like you may have wanted to say something about it. Paul V. Sorry, Paul V. Paul Vanderkla, like Paul V. Who's that? Any interesting, any interest in talking about this verse, Matthew 27:54, when the Centurion and those with him who were guarding Jesus saw the earthquake and all that had happened, they were terrified and exclaimed, surely he was the Son of God. I mean, I think that that's an important, that's an important part of the story of, of Christianity, the way that the story is told in the sense that, you know, when Christ talks about that when a seed dies, then the fruits, the seed has to die for the fruit to appear. And so in this case, as they saw the effects of the death of Christ, then the foreigner, the Romans, recognized the Messiah. And so that moment is then repeated, let's say, in the story of the church when the martyrs of the church are dying constantly. And at some point, the testimony of the martyrs and the testimony of this, this for them, foreign religion, that is, that is kind of this kind of pathetic thing. All of a sudden it's that testimony which ends up converting the Romans. And so you can see it play out in the story of Christ, and you can see it play out in the story of Christianity. All right. By the way, I just want to say there, I, I was scrolling through fast, and there are a lot of questions, like, way too many questions. There's no way I'm going to get through all of these. But I will try. I will try. All right. Okay. And so, so ask what are some comparisons and contrast between rabbinical Midrash and the theoria allegory of the Church fathers utilize in interpreting scripture? I would say that there is a difference between Midrash and allegory or the way that the church fathers will interpret scripture in the different levels of scripture. I would say that Midrash is closer to extra biblical traditions. And so, for example, I'll give you an example of Christian Midrash is if you look in the icons of. Or if you look in the feast, if you look at the icons, there are some details which are mentioned that are not in Scripture. That, that means that it's like filling the holes between in the story. And so that's what Midrash does. It's like it fills in the holes that are there. And obviously a story doesn't encompass everything There are places where the attention isn't turned. And so Midrash tends to turn your attention to a missing link in a story in order to help you see more clearly what the original story is about. And so there are versions of that in Christianity. A good example that I mentioned is that in Scripture, it doesn't say that Christ was born in a cave. It just says that he was laid down in a manger. Now, to say that Christ was born in a cave is something like Midrash in the sense that it's an extra biblical tradition, which helps you understand the meaning of what is in Scripture, which is what is the meaning of being born in a manger is to be there in the lowest part, in the deepest part. And so the fact that he was born in a cave in a manger re emphasizes that symbolism. And there are many examples of that as well. And so that is mostly where you will see something akin to Midrash in Christianity. And so, and I would say, like, a lot of people won't be happy with what I'm saying, but I think it's useful to look at Midrash if you do so in, in a proper hierarchy, that is, if you understand that this is not, let's say, your text. But you look at Midrash, sometimes the Midrash can surprise you because they will, they will, will connect certain aspects of a story through some extra biblical tradition, extra biblical extrapolation, and it'll help you understand the story as well. So it can be interesting. It just has to be in the, just has to be in the right place. Just don't, don't, you know, don't put it in the hymns in the. Of the church, for example, that would not work. But you can see, like, if you read, if you read S from the Syrian, there is a lot of stuff in his hymns on paradise which could be considered something like Midrash in the sense that it is. In the sense that, you know, in Scripture, there are certain things that aren't said about the garden. But when St. Ephraim says them, says those things, then all of a sudden you can understand the story in the garden better. You know, the idea that, for example, that there were no animals in the paradise, for example, since Ephraim says that, it's like, okay, so it doesn't say that in Scripture, doesn't say the opposite, just doesn't say that. So what, what could it mean that they're. That Adam had to come down the hill of the mountain of paradise to name the animals. You Know, what could that mean? You can see that there's a hierarchy established, and it's related. And you can see that then it's connected to the animals that weren't allowed to touch the holy mountain that Moses went up to get the law. And then all of a sudden, you see connections with other texts in scripture which actually do say that the animals can't go on the mountain. But the fact that St. Ephrem will then say that in the story of Genesis that animals didn't touch the mountain. Right. Didn't go into the garden, then you can understand what that means. All right. Hope I'm not going too much on these questions. All right. Okay. All right. So Egalis asked, how can I best raise my children with a symbolic worldview? I was raised with a very literal view of scripture and everything else. And while I hope to avoid that for them, I feel like I'm fumbling and just confusing things. I would say the worst thing to do for your kids is to explain the symbolism like I do. That would be the very worst thing. The way that I explain symbolism is for all of us who are lost. It's for all of us who have lost symbolic thinking. And so we have to explain it. Normal societies don't have to explain their symbolism. They just live them. And so the best way to help people have children have a symbolic worldview is to just point out analogies, is to just say, let's say you're reading a story in scripture, and then you can say, oh, doesn't that remind you of another story? And ask them what it reminds them of, what other story it reminds them of. Then they might remember another story in scripture, or they might remember a story from a fairy tale or another story. And so the idea is to have a lot of stories and to help your children see the. The. The analogies between the stories. Then when they get older, they can. They'll just start to intuit the patterns. Like, I'm at that point, for example, with my oldest son, who's 15, who really has a good intuition and is able to see the pattern. Sometimes he surprises me, and he says he watches a movie, and he says, dad, did you notice that? And I'm like, oh, I didn't. Nice, nice, nice perception there. So Cooper Hayes asks, seeing as it has become particularly political, what is the symbolic. What is worldview of firearms? Certainly something to do with the technological extension of man. Yes. Perhaps a step away from our experience of death. Yes. I mean, firearms are no different than other weapons. They, in the sense of their basic symbolism. They're related to weapons, they're related to swords, they're related to lances, arrows, all of those. They're of course, they're more related to something like an arrow in the sense of it's not just about hitting, but it's about also hitting a point. Right. So it's about aiming and hitting a being true in your aim. Right. And so it has a very particular, it has a very particular aspect of symbolism which has more to do with, let's say, shooting an arrow from afar and hitting something. And so it does have to do with technology and the extension and this notion in Genesis about the, the garments of skin which are then extended into the cities and into metallurgy, etc. Etc. All right, so Cooper Hayes asks. No, sorry, he already asked that. I already answered that. So Josh the mover asks. Many hagraphies describe miracles the likes of which we seem to see very little of today has the scourge of modernity and many living outside of Christian story caused God to distance himself from us, Such as these miracles no longer occur with the same frequency or has the complexity of the modern world simply caused these stories to be fewer and farther in between? I think that there's for sure there, I would say that we are in dark times. That is probably part of it. But there's also, there's also a question of attention. There are a lot of miracles that still happened today. Oh, and then you say that later, you said, upon doing my some research, you said, I'm finding that miracles happen far more often than I was previously aware. Glory to God. Yes, I mean, there are miracles that still happen today and there are crazy things that still happen today. And so I think that it's very difficult for us to read those stories because it doesn't see, they don't seem, we don't seem to live in that world. And I think one of the reasons why we don't see miracles is also part of our own. Like you said, it's part of our own blandness and our own incapacity to see and to participate in the magic of the world. And so that is also one of the reasons why I think that there are, that we see less miracles, but there are still miracles. So Luka Asovic asks, he says, oh my goodness, what does he say here? He says, I know that this is a semi death sentence to ask a modern Orthodox Christian. All right, so let's see if I dare answer this. But since you opened the Pandora's box, my questions are about magic. Do you recommend any literature to better understanding, symbolically or otherwise? Which should I be careful of if I ever come across someone who dabbles in it? What's the distinction? Distinction between white and black magic? My goodness. I primarily ask these questions because I spent a good part of my life trying to be as objective as possible. And it is really difficult for me to see through the symbolic lens and understand the old way of seeing this phenomena as opposed to the modern one, this modern worldview. As I. I also include the video game notion of magic. Mages are displayed that some sort of batteries that when full expelled. Yes, exactly. Forget about the. Forget about the kind of video game version of magic. The notion of magic is the idea that you can use meaning to create phenomena. And that's why you'll see a lot of people who will say, and I think it's true that there's very little difference between magic and technology in the sense that it's a manner in which you. You are able to take an idea, an image, and you're able to make it appear in the world. And so one of the problems with magic, or the way that we understand magic is we always understand it as, let's say, some kind of. Some kind. We always want to understand mechanically, you know, and we don't really understand what magic can be if we try to understand the meaning of it, or let's say powers or magic or something like that, you know. And so let's say. Okay, so I like to give a very silly example, a very simple one, which kind of help you understand why magic is not. The notion behind magic is. Isn't such a. Such a big deal. Is that like, do you believe in action at a distance? Right. Do you believe that you can say something and it'll happen? And the answer is, obviously everybody believes in that. If it's silly, you'd have to be a total. Not to believe in. In action at a distance, you know, if I have power and I have authority, then I can speak something into being and it'll happen. Even me as a father, I can tell my son, hey, Elise, could you get a cup for me? And he'll go get the cup and he'll bring it to me. Voila. Action at a distance. Magic. It's magic. That's what magic is. And so obviously I'm trying to. I'm trying to. I don't want to make it banal. I'm not saying that there are more, aren't more subtle manners in which meaning can create effects but that's the power that you have to say something and it happens is that's the power behind magic. So the problem with, let's say, dark magic or evil magic or that kind of stuff is there are. There are. There are two things. One is the desire to use your power, your authority as a spiritual being to. To affect the world in a way that makes you more powerful. And so in that sense, the sorcerer who is trying to acquire power to himself is very similar to someone who would do that in the world through political scheming and do. And. And through lying and convincing and doing all that kind of stuff. And so that obviously is bad. The other problem is invoking, let's say, invoking demons or making yourself. Aligning yourself with, let's say, principalities that aren't in the hierarchy or that aren't properly aligned in order to gain. In order to gain power for yourself. And so that. And that is very dangerous. It's dangerous for you, and it's dangerous from. For all. For all the people around. And so, I mean. Yeah, that's as much as I'm going to say now. I would say that as a Christian, if you're a Christian, I would say it's better to just avoid that stuff because that's not what we're called to do. We're not called to use our meaning, use our words, use our spiritual capacities to. To gain power and to accumulate phenomena for our own sake. Like, that's not what we're called to do. And so in that sense, it is not something that we should be. But. But I'm also being very. Trying to keep it at the very rational. But there are more subtle ways in which this stuff works. I used a very simple example, which is to say, you know, I asked someone to do something, and they do it. But there are more subtle ways. And you. Yes, there are uses of different patterns and different rituals which can. Which can manifest patterns in the world. Of course there are, but it's probably best to stay away from that stuff because that's not. That's not our point. That's not a purpose in the world. All right. Okay. Hope that I haven't confused everybody with that answer. So Keenan Cronin asked. I really struggle to control my passions. You talked about this before, but what advice would you give when it comes to learning to control your passions? Is prayer enough? Is it simply about discipline? What can I do to become a better mediator between heaven and earth? I mean. I mean, prayer for sure. Prayer for sure. Knowing yourself and Knowing where your weaknesses are and seeing them from afar. I think I've talked about this before, knowing not the step where you give in, but the steps before the steps you give in. I mean, I think that that's helpful in, in, in kind of helping you control your passions. It's probably good to have someone to talk to. To have, of course, I would say a confessor is the best, but to have someone that you can talk to about which you're struggling and that person can give you advice. And also, you know, in a way, the best would be to have someone who can actually be an authority over you so that, so that you kind of give up your will to, to someone else. And that's helpful too, because that's the giving up your, your will to someone else or to something above you is the very mechanism by which you, you are healed from your passions because your passions are giving in to your particular wills in a disorderly manner. All right, so Alex Riddle asks, how does the symbolism of the mask compare contrast to the veil? One obvious parallel particularly resident with the mask that we're currently wearing is that they're both meant to protect what is behind the. The veil mask from the outside, while at the same time protecting the outside from what is veiled mask. However, as you recently noted on Twitter, a key piece of mass symbolism is the breakdown of identity in order to make a new one. Clearly, that runs counter to the ostensible purpose of protection. So is the mask merely an inversion of the veil or just this negative aspect or something like that? Like the veil dissimulates in order to preserve, while the mask dissimulates in order to dissolve. In which case the kind of mask we're wearing right now might be said. Might said to serve both as masks and as veils. I don't know. What do you think? It's a complicated question. A lot of people have asked me to do a video on masks. I was thinking about doing one, but it's difficult because it's so touchy for people and it's because it's so right now it's very difficult to talk about that without emotions kind of flaring up. But I would say in terms of the pattern, the reason why we're asked to wear masks right now is extremely similar analogically to the veils, to the veils in the temple, to the veil that Moses wore. But like all symbolism, it doesn't necessarily. It doesn't. Not necessarily positive and it's not necessarily negative. It can be both. The purpose of wearing a Mask is, especially a mask that doesn't have features is to separate you, to separate you from others. And so you can want to separate people from others for good reasons, and you can want to separate people from others with bad reasons. You can separate people from others in order to dissolve their bonds of communion. Right? Especially if you're doing it like everybody's, where everybody's separated from each other. Now, it can also be a way to create a new form of communion. Right? Because as you dissolve the bonds that we normally have, then the mask can become like a blank slate on which to write a new. A new identity. Right. That we'll all share. So that's also part of it. But I'm hoping I can make a video on this. But I would say that ultimately it's the same reason in terms of pattern, but like I said, it's not always good. So Gary New says, what's the significance of the fact that God is the one who introduces the first supplement and technology in the garments of self skin, while the other supplements and technologies are introduced by the descendants of Cain? So what you have to understand in the fact that God introduces the garments of skin is you have to understand it as a kind of condescension. You have to understand it as a, as a giving in, right, to the situation where as man falls, God puts on the protection. And so it's, it's not, it's a, it's a good thing. God gives the garments of skin to Adam and Eve out of compassion. And I would say that to a certain extent, each layer of the garments of the supplement are both a positive and a negative all the time. They are both negative in the sense that they are a mark of moving away from the center, but they are both positive in the sense that they are a protection so that you don't fall further. And so it's a double bind all the time. That's the duality of the supplement that I always talk about, right? It's a poison, it's a cure, you know, it's an extension of yourself. So it's more death, but it's death protecting you from death. And so, but it's already there in, in what God did. It's just that it's a process which will, as it follows its own course, will lead to death. Right? You know, the wages of sin are death. But God gives us the garments of skin to halt or to slow down the process of death, to give us a chance while we're in this body of death. All right, so bleeding Mermaid asks, what is the proper Christian way of thinking of what happens to us when we die? I had a disturbing dream recently of losing a loved one. The only thing that could console me was the thought that by memory, unity through long distance, I was brought back in unity with them. And of course, Christ conquered death by being in the body of Christ. We're not destroyed by death. But I would like more detail on this by observing how some Protestants talk about how somebody dies is in a better place. It sounds like the dead are detached from this world, but I believe we still have a body or some sort of extension in the world even after we die. Is that correct? So in the Orthodox Church, we say. We say that we ask for memory eternal. For eternal memory. And that is really, you hit the nail in the right place, that memory is the manner in which we exist after death. That is, God remembers us. And we also remember each other in prayer, and the saints remember us. And so it is through communion. It's through the communion of all of us that with God that we exist, you know, in a different manner after our bodies are. Are. Are broken. And so. So the idea that the dead are totally detached from the world, I think is. Is just not possible. And I. And I understand why people say that, but. And it's kind of like an arbitrary thing that people say. But they. They are still connected to us because we remember them. And in a mysterious way, they remember us. And so they are still, you know, they are still, in a very mysterious way, we are still connected to them. And yes, they still have, in a certain manner, a body, you could say. But it's a body in the eschaton. It's a body that. Which will be revealed when all is revealed. Right? The body of all things will come to fruition when everything is revealed. So it's difficult to understand this stuff. So we talk about it in. We talk about it very much in signs and symbols and signs. And then here it really is a, you know, a kind of language that we talk about something beyond our immediate understanding. We use words to talk about them. All right, so. All right. I hope everybody in the chat is doing okay. As I said, there are so many questions. It's very difficult. And I don't know how people do it. I don't know how people are able to follow the chat at the same time as they're doing the Q and A's. I just can't. So I apologize for that, guys, but it's very difficult for me to follow the chats, especially if I don't want, I don't want this to be like three hours long. I don't know how people do that. All right, so similar question here. Nicola asks what would be the most succinct way of talking about life after the Last Judgment to someone who is not religious or maybe even for the religious types as well. So a good way to understand. It's very difficult to understand the idea of eschaton, but it's not that difficult in the sense that obviously people, if someone hasn't broken their kind of materialist sign science, you know, kind of bad science, scientistic thinking, then they won't be able to understand. But so a good way to understand is that. So the logos, the, the logos, the, the reason, right? The principle. The, the say the reason for something, right? The origin and the reason for something as the thing is going. So imagine I make, I make. Say I'm making a spoon, right? And I'm working on it. And I'm working on it. And so while I'm working on the spoon, okay, the logos of the spoon is, is it's, it's telos, it's that which I'm working towards. And it's, it's drawing it to it, right? The logos of the spoon is drawing the spoon to itself. So I'm making the spoon to make it resemble this, the spoon ness of the spoon so that it can function as a spoon. And so as, as I am working on it, the logos is, let's say it's merciful. The logos is merciful because it's kind of. It's calling upon me to continue and make the spoon. And I have still room to make the spoon more like a spoon as I'm working on it. But once I'm finished, right, once the spoon is finished, then the logos of the spoon becomes its judge. It judges the spoon because it's done. And now the, the, the logos of the spoon will judge whether or not it was a good spoon and where it, where it is in the hierarchy of, of spoons. Okay, I didn't use cup this time. And so now take that notion, right? And so the idea is that some of the spoons are going to be like, recognized as being proper spoons, good and faithful servants. And some of the spoons are not good spoons and they don't work as spoons. And so then those get tossed into the fire as Christ talks about when he talked about this stuff. And so the Logos who is calling all these spoons to himself when they're finished, then they're judged, and some are cast aside and some are kept. And so that is. So take that process and now imagine it for all of everything. Imagine spread that knowledge. Like, take that notion and, like, pull it all the way out. And then that's when you can understand what it means for the. What the Last Judgment means. And what it means that some things will not have reached their proper purposes and then will fall away. And some things, even, like, within yourself. And we always want to see it as people getting cast into hell or, you know, people getting cast into heaven, but you can also understand it as the aspects of you which will also be cast away. And, And. And that of you which is closer to Christ will be brought into Christ. Like, you can see it that way as well. And. But that's also a form of judgment where it's happening at every level of reality at the same time. And so that's what the Last Judgment is. And the Last Judgment is not an event in history, I'm sorry to say. It is the end. Right? It is that which happens when all has happened that would have. That which happens when all has been revealed. And so it's not. It's not a. It's not a normal event. All right, that's as good as I'm gonna get, guys. You got me on a. On a bad date. And you always, You, You. You're all. Everybody's talking about death. What's up with that? It's not a good day to talk about death. Okay, here's a better one. All right, Dorothy, KK Says. Hi, Jonathan, can you comment on the symbolism of shoes, like, in losing your shoes, unfitting or wrong shoes, glass shoes, like in the Cinderella store, etc. So shoes are really coverings. They're a great example of coverings. They're garments of skin in the sense that they are that which protect your feet from the outside world. But there also can also be a type of glory. And you can see that because, you know, some people who have a lot of shoes and definitely see shoes as their glory. And so understanding the notion of losing your shoes means losing your covering. Like, losing the means you have to engage with the world, so you lose. So a shoe that doesn't fit means that it's this lack of fitting between the manifestation of something and like, the. The mist, the. The wrong hosting of angels. You could say that hosting angels is also putting on the proper shoes for the angel's feet to touch the ground. Right? You could see it that way. That could be a good way to Understand the symbolism of shoes, like providing the proper shoes so that the angel can touch the ground, because the angel needs shoes, or else his bare feet cannot touch. So that's a good way to understand it. And so in the glass shoe in Cinderella, it's interesting because I talk about this in one of my videos. It might be a patron only video. I'm not sure is it? I don't remember. Anyways, I talk about Cinderella and the glass shoe. And I talk about how in French, there's this confusion because the shoe is made of vair. And there's this. There's a legend that the word actually refers to type of fragment fur. And then some people say, no, it doesn't. It's wrong, but it doesn't matter. There's a story which says that there's a mistake, that it's not glass slippers, but it's fur slippers. And that's really this. This relationship between death and glory that I talk about all the time. The relationship between the crown and the horns of the animal, all of that type of symbolism that I. That I talk about. All right, and so we're done with the website, and we're going on to Patreon. And on patreon, there's like, 25 questions. All right, we can do this. Sometimes I wish I could hear you guys. Maybe not all at the same time. Like, if I could hear a few people, kind of encourage me to keep going. All right, I think I've got them all out here. All right. Okay, here we go. All right. So Blake Payne asks. I've been reading a lot of Mircea Ilad and just finished the Myth of Eternal Return. He seems to take issue with the concept of history that the Judeo Christian worldview introduces as its opposition to a more cyclical view. The idea that God acts in time and then marks that time and creates a linear view of reality where there is a beginning and an end. What are your thoughts on this, and how do we look at it symbolically? Well, Blake, the way we look at it symbolically is that it's just all hogwash. It is absolute hogwash that Christianity presents a linear view of history. You know, there's so many scholars say that, and you just want to slap them around because. What are you talking about? Seriously, what are you talking about? My goodness. It is clear when you read, and it's so clear in scripture that when you read in Scripture, all that Christ is doing is a kind of recap and return and transformation of the story in Genesis. When you look at how the story ends in, in Revelation, that it's a return into the garden and an adding of the crown of the city around the garden. And so it's not a linear view of history. By no means. It is a kind of giant, giant cycle where the end of the cycle comes into the beginning, but transforms the beginning by giving it an end. And so it actually shows us the fullness of the cycle. So it's not that it's just one story with the beginning and an end. It's that it's what the Christian story is showing is the giant, giant, giant cycle, the ultimate, eternal, ultimate cycle, you know, the pattern of which all the small cycles are, are patterned on. And so, and so it's just not, it's just not linear. I don't know what to say. And I, I really, really am annoyed because I don't see. I just don't see. Read. Read. Like when, when it's when the church fathers or when, when Christ says to the, the, the, to the, the good thief. He says, tomorrow you will be. Be with me in paradise. He's saying, you will be with me in the garden. How can that be linear? He's bringing them back. He's bringing the, the. The thief back into the garden. He's bringing the end into the beginning. And so I don't know. I just. I like me Eliade and, and, but I mean, I think he just gets wrong. I'm just. There's just so many people who get it wrong. So many people. And it really is a weird. I think it's like an Enlightenment view of, of, of Christianity which wants to see Christianity in its own idea of progress and all this kind of nonsense. All right, sorry, I'm going to start to rant now. It's not good. Not good. Okay. All right. And the. Milligan. Another question, if I may. I started. So another question. I'll just answer you one question. Sorry, Andy, I just, I just can't answer one question each because it's just too much. Okay, so Andy Milligan asked. I watched the video of your talk and q A from St. John, Kansas Church talked about hierarchy in state, flag, the church, the market, etc. The model of this brought to mind was of a chessboard. So what is the symbolism of chess? What can we learn as society starts to chip away at the levels monarchy, American Revolution, the church, etc? Well, there are a lot of questions in your, in your question, my friend. Okay, so what's the sy. Maybe I could just answer your question. What's the symbolism of chess. The symbolism of chess is very powerful. It's a very, very powerful symbolism because it really does have to do with the interaction of two opposites. It really is a war. And it can make you understand the relationship between opposites even on the board, because it has black and white. And, you know, you're not allowed to, to, to, you have to follow a certain rule, the movement on the board. And so there it really is a, it also, chess really is powerful because it forces you. It really is pattern thinking is it forces you to think of straight, let's say straight movement, diagonal movement and crooked movement and a kind of crook movement. Okay. And so you have certain figures that move in an S shape, and then you have certain figures that move straight, and then you have those that move diagonal. Then, then you also have, of course, one that moves in every single way. And so like, that is really very powerful in terms of understanding possibility within the world. Like how to deal, how to. How do you answer someone who's moving crooked? How do you answer? How do you deal with someone who's moving straight? How do you deal with someone who's coming at an angle for you? So it's a very, very powerful mind microcosm. We probably take like a full video to talk about the symbolism of chess. Maybe another video. I, I, if I counted the number of times that I said I should make a video about that, it's probably would be very embarrassing. All right. Okay. So, Ronell Canada, I'm sure is that it can't be your real name Ronell. All right, so. Hey. Hey, Jonathan. I just finished reading the Life of Moses by St. Gregory. And as I find myself progressing from the standpoint of constantly looking to Christ in order to avoid the pull away from the passions, I find it harder to experience, rely on the salvific passion that St. Gregory references in his book. I think my confusion that I don't really know the qualities associated with this new way of being. Could you describe the qualities of this new passion and how we might cultivate it today? Thanks so much. And so, I mean, the idea is that our passions are made, are not bad. Our passions are fine. Our passions are actually the way in which we are deified. Right? We're deified. Passion just means the capacity to move towards something else. Right? That's what passion is. Passion is the capacity to move, the capacity to move towards an object that, that attracts you. And so that's also what, what God does. And so the idea is that each passion, each passion has its opposite in a virtue. And that those virtues are. They're. You could say they're dispassionate in a way, but they're also. You could say in terms of God, they are also passionate in the sense that God is pulling us towards him. But it's true. The idea is that that's the. That's the paradox about Christianity is that is that as you tame your passions, like the passions that have power over you, then it opens up the possibility for those passions to kind of push you up or to pull you up into. Into. Into love. But, you know, I'm not a saint, so it's very. It's very theoretical. I mean, it's not theoretical completely, but it is theoretical to a certain extent. Because if I. If it wasn't, I would. I would be a holy person and probably wouldn't be on YouTube. All right, okay, so Joshua Martin says. Hi, Jonathan, Some of the folks on the Discord server have a wager going on an art question for you. What do you think of William Blake? All right, so what do I think of William Blake? Well, okay, so I think that this is the thing this. This question is. It refers. Can refer to all the kind of, let's say, romantic artists or artists who were flirting with occult ideas in. In the Enlightenment and in post Enlightenment. And so. And I think William Blake is one of those. And I think that Blake. And I've said this before, I think that Blake's and other people of that time, I think that their disillusion with the humdrum Christianity that they were facing was what was kind of pushing them to search for more mystical answers. And so in that search, I think sometimes they get it right, and I think a lot of times they also get it wrong. And so sometimes I'll look at an image, a drawing by Blake, for example, and I'll find it very inspiring. And even in the way that he uses a kind of iconic digital language, and there's very powerful imagery. And then other times, I look at. At an image from William Blake and I'm like, sorry, dude, you just. You just fell off right there. You just. You. You're missing something. Like, you don't get it. And so I think it. I think that's the same for a lot of. A lot of the thinkers of that period. All right, so Charlie Longoria says hello. Jonathan, I had a question about Jordan Peterson's interpretation of the word meek, which is something like those who have swords and know how to use them, but keep them sheathed. Is this right? I'm not sure. Where he's getting his translation. Yeah, I don't know where he's getting his translation either. I can kind of understand the thrust of his answer, which is that there's nowhere in. In Christianity that it is suggested that weakness, you know, is. There's only one place, and it's in St. Paul where he talks. Talks about boasting of his weaknesses. But I would say that the idea is to be. One of the aspects of the. Being meek is the idea of being dispassionate in the way that we talked about. It's the idea of not letting other things rule you and rule you by provoking you to action. Right. And so when someone. Someone insult you and you retort, which I've done number of times, I'm not free from that sin, then you are actually making yourself a slave to them. Right? You are actually. And so meekness is the capacity to not be taken by passion, but it doesn't mean that you. That you. So in the sense that. In the sense that it's a form of strength, it's not a form of. Of weakness, it's the capacity to not be affected and to not be kind of. That's the way I see it. I might be wrong. Today is a bad. Today's bad day for. All Right, okay. I'm losing control here. Let's. Let's keep it together. Okay. So. Hi, Jonathan. Could you tell us what you think of the mindfulness revolution? This is Paul. Of the mindfulness revolution and the current trend from psychologists like John Verbecki to use. To use Oriental spirituality as psychology students. I see a lot of it, and it makes me somewhat uneasy, but I cannot put my finger on what bothers me about it exactly. Seems to have something to do with Father Stephen Freeman's warning about the modern tendency to see spiritual practices as mere techniques. Yes, I agree. I totally agree. I think that. I think that there's something about the mindfulness revolution which is extremely individualistic and continues in the kind of individualism of the modern world, and which is why it wants to create technique without story, technique without cohesion, you know, techniques without love, that kind of thing. And so now. So it doesn't mean that mindfulness is bad. Of course. Mindfulness is fine. In the church, we are said to always remember death. That's the way Christians talk about mindfulness, is to remember your death. So it is to be attentive to your sins, to be attentive to the places where you misstep, to the places where to see yourself in your in your. In your crookedness, you could say, and so to be mindful of your sins and to be mindful of God, to remember God, to remember your sins, those two things at the same time, to always remember that there's something above you and to always be aware of. Of the places where you are stepping aside. And so that is the way that mindfulness is a form of. Mindfulness is. Has always been part of Christianity. So a. Wait. A good way to understand that, if you want to connect it to something like the mindfulness revolution, it's. There is something about that. So, for example, like if you were to be mindful of your death while you pray, what you would be doing is as you're praying, let's say you're praying the Jesus prayer, you're repeating the Jesus prayer, and all of a sudden you notice that you're saying the Jesus prayer, but then you're also thinking about something else, right? So that's a form of remembering death, noticing the places where you die, noticing the places where you break apart, where your being is broken and fragments. And so when you notice that, often it can be enough to snap things back together, to snap the fragments back into the whole. And so that's a good way to use it as a Christian. So AJ Del Toro asked, hey, Jonathan, hope you've been swell. The other day my friend asked me why there are so many terrible Christian movies and books. I remember you mentioning how modern stuff doesn't even compare to writers like Dostoevsky. So I was wondering if you had any thoughts on what went wrong. Thanks. Yes, I can, I can. I think I've said it before. It's that Christians don't understand the Christian story. The most of the bad Christian movies and books come from a world where they have this idea that the Bible and Christianity is about being saved. And the purpose of our existence in the world is. Is to be a testimony to others so they can also be saved and that they can go to heaven. And so if you live in a world like that, I mean, what exact. How can you make anything besides propaganda? Like, how could you. Because that's what you think your entire existence is about. You think that you're here in the world to evangelize. And so what is that going to be? So, I don't know. It's just. And so I think that if Christians understood the power and the amazing narrative that is in scripture, if they could embody it, if they could be inside it, then all of a sudden the stories they would tell would be better. Because they would be telling stories that have analogies to the stories of Scripture. They would be embodying the pattern instead of. Instead of a weird kind of propagandistic move to hide your message enough, you know, to either, like, have the message out there so that people get converted, or because you feel bad about that, you try to hide the message, but secretly you'd really like people to understand the message so that they can also be saved. All that. It's just all. It's really not. Not useful at all. All right, all right. So, Mark Kalashnikov, I was hoping you could explain the transfiguration in 30 seconds. Just kidding. Hoping for a few thoughts, if it's not too much to ask. Maybe in reference to the sleep of the disciples, Peter not knowing. Comment. And a cloud that overshadowed them, in which they fearfully entered. Thank you for your work. So I would say, if you want to hear about the transfiguration. Do I talk about that? Did the dis. Probably not. 30 seconds. I mean, the transfigur. The transfiguration is basically just an image of the whole story. It's always the same story. Going up the mountain, going to the top of the mountain, and then in that top of the mountain, there's a joining of light and darkness, glory of Christ, but also an overshadowing presence. And so it's shadow and light at the same time. And those that are below the mountain can't look at it because they have to cover themselves, just like Adam and Eve had to cover themselves in order to. To. Not to. To. To. To be there. And then St. Peter says, we will build tents. And so we will. We will host these spiritual presence. We will host these spiritual appearance in the world. And that's. That's it. That's. Christianity is building a tent or being a tent for Christ. All right, Nick Scott says hello. Mr. Peugeot, can you talk about the symbolism of wings? Are they related to spirit breath? Since they are always ways to move air, I'm thinking in particular beasts from Revelation whose wings made a terrifying sound. If I'm on track, that would be the symbol of we. Of wings covered with eyes. This is a topic already covered. So, yeah, the. The idea of wings is definitely related to spirit. It's definitely that. Related to that which is above that which flies above. And if wings have eyes, then it's also connecting it to meaning. Directly connecting it to meaning. So you have this notion of a spirit that has wings and that can see through its wings, and therefore that which is keeping it above you is Also that which can see the world and which can identify the world. I like the word identify because it's a word that talks about seeing but also giving meaning to. So, yeah, usually in general, if you find a story where something has a lot of eyes, it usually has to do with. That has to do with a kind of hyper consciousness or hyper awareness. So Don Palermo asks Jonathan from Timothy 1 Timothy 6:19, instruct them to do good, to be rich in good work, to be generous and ready to share. Storing up for themselves the treasures of a good foundation for the future so that they may take hold of that which is life indeed. Storing up for themselves the treasure of a good foundation for the future so that they may take hold of that which is life indeed. So what do you think of the. The meaning of working for future heavenly treasure? I mean, what do you, what do you mean? I don't. What do I mean? What does it mean to work for future heavenly treasure? I mean, it means. It means the same thing as any form of planting that you do in order to get fruit in the future. Okay, so. So let's say you have a plant and then you. Let's use a good example, let's use a simple example, which is that you have wheat. So you grow wheat and you get the wheat. Now that wheat, you eat that wheat, right? You make bread out of it, but then you take a part of it and you, you sacrifice it. You don't eat it, you, you put it in the ground and you do that because you are storing up treasure for the future, right? And so that's the thing with good works is that some people are going to be annoyed with me because I'm really gonna, I'm gonna bring this down to you guys in a very practical way, which is that if you're nice to people, you are putting seeds in them so that later on there's a better chance that they'll be nice to you. It doesn't necessarily work that way. There is a way in which you can. There is a kind of a. An even higher manner in which the saint will plant seeds in others and he will not bear fruit in this life. And therefore this idea that the fruit that you don't get in this life are accumulated for you, right? But you understand the process because that's what we do all the time, right? You, you, you. If you don't love your kids, good luck when you get old, right? If you love your kids and you care for them, then, then you will be planting seeds for fruit in the future. And so it's the same pattern, but take it to its extreme. There's a manner in which, like I said, if you do good and you do not get the reward, it's as if you're storing up in the world bigger and bigger treasure. Hi, Jonathan. Throughout Roman Catholic tradition, there have been instances of eucharistic miracles where the host bleeds. Have there been any in. In the Eastern Church? I don't know if there are any of those miracles. At the top of my head, I do not remember any. All right. Okay. So Arie Fisher asks. Hi, Jonathan. I was wondering if you would be willing to talk about the significance of the paraphrase passage from Jacob and Esau's reunion that your brother opens his book with. I tried to puzzle. Puzzle over it myself, but I've only come up with some vague intuitions and nothing super satisfying as of yet. Perhaps Jacob's story fits the pattern of how materialism stirred the birth out of religion. All right, I will type the patch. Let me. I'll give you guys a hint. I won't tell you what it's fully about. Some of you probably already know. I will type the passage out below, in case you don't remember. Oh, I remember. Here we go. He says, esau, quote, I have enough, brother. Let that which is yours be yours. Jacob, please take my gift, because God has shown me grace, and I also have enough, Esau. Let us take our journey together, then. And I will go before you, Jacob. I will journey according to the place of the flock and children until I come unto you, my brother. Unto Sayer. So if you want to understand that question, that. That passage, you have to understand that Jacob and Esau never met. That is, Jacob told Esau. He says, esau says, let us take our journey together, and I will go before you. And then Jacob says, basically, I will come and meet you. But he never does. And so Matthew is calling for that to happen. He's calling for Jacob to meet and join with Esau. Now, you have to know who Jacob is. It's hard, a little harder to understand who Esau is. If you understand who Jacob is, at least that'll be. That'll help you understand the rest. All right, so Daniel DeMarco says, hi, Jonathan. Can the wheel of revolution ever be turned backwards? Or once it is past a certain point, must it bring an end to the old world and usher in a new one? Can a new world ever come about peacefully? Or must it always be preceded by pain and violence? Dude, I'm afraid I know the Answer. But maybe there are instructive counter examples. Well if there are instructive counter. If there are counter examples, I don't know any death comes before life, you know, that seems to happen all the time. All right, so Leo asks. Hi Jonathan. Christians generally define Far Eastern religion. That's gnostic, antimatter, even anti the body and yet yoga, martial arts, etc are some of its fruits compared to Christianity. Then emphasizes fasting and martyrdom. This. Does this mean seem like a contradiction to you? I mean I don't think that Far Eastern religion are necessarily gnostic and matter. So it's like, I don't know, I think that people say that. I mean there's a hierarchy for sure like in Hinduism there's definitely a hierarchy between let's say that which is spiritual and that which is material. There's a, there's a hierarchy but they also, especially something like Hinduism, they also believe that the spiritual world has to find body in the world. Right. That's why they have these different practices and they have rituals and have all this stuff. So, so, so I don't know. So I don't. I, I've never thought that, I've never thought that, that they're necessarily gnostic or antimatter. If they are, then, then, then they're off. All right. Jason Lindsay asks. Hey Jonathan. An image that seems to be appearing more and more in modern stories is a being in particular a higher being from the heavens that has no mouth but can still clearly communicate with others. Is there anything like this from scripture? Myths are history or is it a modern phenomena seems to have its origin in the sci fi genre and has spread elsewhere from fantasy to horror to even religious works. I've had no luck finding medieval or ancient versions of these images. What would be the symbolic meaning of a being that has no mouth, that can communicate another's with other clearly as if it were speaking? Yeah, I don't think I've ever seen versions. I've never seen stories that where that happens. I think it's pretty simple what it means, the symbolism of telepathy or the symbolism of communicating through thought is the idea of, is the possibility of clear communication, of communicating without the accidents of language. And so that's why you said it's a higher being that will do that because it's, it's as if something from above is infusing meaning directly into you. Right. And so I think that that would be the reason why they would use that kind of symbolism. You know, it makes sense. It's helping your needy Neighbor. An instance of not accounting for everything. Like how the Good Samaritan lets himself get interrupted. Yeah, I think that's a good. That's a good. That's a very good way of understanding because, you know, it's interesting. It's like in the story of the Good Samaritan, there's so much in that story, just like everything Christ says, there's so much in everything he says. But in that story, there's so much because you. You have this sense that there's someone on a path. It's kind of. That has a purpose. And then he is distracted by death. He's distracted by not. He's not completely dead, but he's. He's mostly dead. Let's say he. He gets distracted by death. And. And then you can see what the difference. So it's like, that's the story of Genesis. That's what happens. It's like we're supposed to go up, and then. And then Adam and Eve get distracted by death, and they end up going down, and then they get. They end up being. Falling into that distraction. But in the story of the Good Samaritan, it's like the answer to the problem. It's saying Christians answer the problem of death by caring for those who are falling, for those who are down on the ground, for those who have. Have lived. And so it's like, that's the answer. That's the Christian answer. The Christian answer to suffering is to help those who suffer. The Christian answer to death is to bring the light of God into the dark places. And so it really is the same story as that which we see in Genesis. It's just showing you what the Christian answer is to that. All right, so Ed asked, what is a good place to start in exploring a deeper spiritual life for Christians who have so far stayed more at the surface level? I mean, it depends. It depends how far you're. You're. You're. You want to go. I mean, I would say read the church fathers. You know, read especially certain church fathers. I know I mentioned St. Gregory of Nyssa, St. Anthony from the Syrian, but there's also church itself. You know, I would say it's hard now because of COVID and everything's crazy and everything's still insane, but, you know, the idea would be to look. To attend a traditional church service and see how it fits together in terms of actual practice and, yeah, look at old things, try to understand them. All right, so Kenan Wang asks, I was wondering if you could talk about the idea of obedience as it relates to the tree of knowing, good and evil. In particular, I noticed that passion seems to be desired to know things that are chaotic or strange. I've also frequently felt that innocence lost and regained, or faith lost and regained. So I guess maybe my question is, what is the place for rebellion? How does the story of the Fall or of Christ inform obedience or rebellion when we are faced with passions? So, I mean, you could kind of understand, like, the best way to understand rebellion in the sense there isn't an absolute rebellion. You're always rebelling to one thing in order to submit to another. Like, that's very important to understand. You know, the idea of rebelling towards absolute freedom is just. Just. It just. It's just a delusional impression of reality. And so a way to use the trope of rebellion is the notion of rebelling against the world of death, rebelling against the passions, rebelling against. So there is a possibility to use that type of imagery, but you always have to understand that it's happening in a manner which is that you are making yourself servant, a slave to God and to. And to the actual ruler of things. So if you want to look at some people who are doing that, you can see, you know, there's a company called Death to the World. They write some. Some. They also have some magazines that they put out. I'm supposed to write an article for them, but it just seems to not be happening for some reason. But you can look up Death to the World, and they're kind of using the trope of rebellion to kind of turn death against death and to turn. Like, what do they say the last true rebellion is? The rebellion against this world and then a submission to God. All right, so Herman Smith asks. My question is about your comments in recent videos that science is running up against the problem of consciousness. I feel woefully out of the loop about that. Are there any particular videos you would suggest to shed some light on this man? Which videos? I think I talk about that all the time. The. Okay, so the problem of consciousness is the problem of attention. It's the problem of the too much of the world. The world is too much. It has too many things. It's indefinite in number. Right. All things explode into millions of detail. So the problem is, why do we attend to certain things? Because we have to. We can't account for all the facets of all things. There's just too many. And so that is when we understand that attention and consciousness and this experience we have of the world is central for the world. To cohere and for us to be able to make sense of it and ultimately for it to exist in the manner in which we experience it. And so that's what I mean by hitting against consciousness. As for videos, I don't remember at the top of my head which videos talk about that specifically. So in the language of creation, your brother writes, the realization quoted above, Genesis 8:21 implies that evil is inherently part of humanity, which means a certain degree of wrong must be acknowledged for its perfection. More precisely, there exists a higher reality, a meta space in which a certain degree of lower evil can be transmuted into a higher good for the knowledge of God. This is the spiritual truth that Amony were not equipped to handle in the Garden of Eden, which led to their death. Is this another way of putting the idea of transforming death into glory? Or about the inability on the part of humanity to adequately acknowledge or integrate the fringe or time adequately into space? I think so. I would say the way that Matthew phrases it is difficult in terms of Christian theology, but I think that. And so I probably wouldn't phrase it that way. And I think someone asked in a question that I didn't read because I answered it before, like what's. What are the differences between Matt and. I've not mentioned this before in a Q and A. This would be the. The thing where I. The way that he phrases that particular text is 1. Which is difficult for Christians. But I think that if we understand it as the notion that there's a way, there's a relationship between death and glory and that it's. That there's something about their incapacity to. To. To fully see that. That because they were unable, they weren't ready to see the glory of God, that glory fragment fragmented for them and fragmented them and broke them, brought them to see the. Or to embody the. The multiplicity of glory, like the shining. But it's. There's also this notion that it's a. Can also be a kind of fragmenting. And that's what happened. That's the. That's the problem is the. Is that the. The multiplicity became a fragmenting rather than being a kind of shining, kind of overflowing of. Of being. You could say so, but it is. It is difficult to say that it's inherently part of humanity. But. Right. It's complicated because in the text it says the knowledge of good and bad. So it means that you could say something like the possibility of. Of absence or something. I don't quite know how to phrase it properly. I'm probably getting into deep water just by talking about this stuff anyways. All right, all right. So Dionysus asked. Hello, Jonathan. I would like to ask a question on the pattern of covering the nakedness of our Father. I sometimes observe specific issues in Christian culture, especially in its more dogmatic levels, as things seem to me much clearer and coherent in the mystical level. I find myself desiring to criticize and expose these issues as hiding them seems insincere and also detrimental in the long run. Covering seems to suggest a respectful adding of a layer instead of a shaming. Criticizing, but it nevertheless does not signify ignoring or denying. Could you elaborate on the manner of this covering? Is there a story where it is presented in more detail? Thanks. I mean, I think the story of Noah is really the best story to understand this covering. I'd have to think about it to see if there are other stories which are, which are similar. But I'm not saying there isn't a way to do that. Like, let me give you an example of someone who doesn't do that. There's. St. John the Baptist doesn't do that. St. John the Baptist calls out the king, says he is scandalous and calls out the authorities, says that they're scandalous. This so. And Christ does it as well. Christ uncovers the Pharisees. He says that they are leaf sepulcher. Sepulchers. He says that they are hypocrites, says that they're inside and their outside doesn't match. So there is a, there is a time to do that. But I'd live by the sword, die by the sword. You know, Christ said that and that's what happened. So there's that as well. So I don't know. I don't know. It's like the, the, there's also the notion that the, you know, the, the measure by which you judge that is the measure by which you will be judged. And so you have to be careful that you uncover the scandals of others because everybody has scandals. Everybody has something they would want the world to see. So, so, yeah, but I don't know where the line is. I, Look, I, I, all I know is the ones that I see in my own reality, in my own. And it's not my responsibility to call out, you know, other people. It's not those, those that are not my father is not my responsibility to call out their nakedness anyways. And so I have to, I have to be attentive to what's happening around me. And if I see that there are some Things which are bubbling over and are too scandalous, then we have to see how to do it in a way that is proper. So Sean Carnow and asked it seems like most people on the right have. Half of the political spectrum have correctly identified woke speech and identity policing as a serious threat to the existing liberal order. However, I am of the opinion that more most on the right are pretty blind to the ongoing material physical experience of police brutality and corruption that sparked the current fire. In the same mode, police people on the left are blind to the injustice of the woke social policing which is brutal in its one own way. It's as though each polarity has a piece torn out of their ability to empathize. And any attempts to talk about that lack of empathy are met with expressions of extreme self righteousness. Is there a story we can tell or method we can apply to heal that or are we just destined for increasing violence and combat? Man, to be honest, I don't see I right now, especially as a social situation, I really don't see things getting any better. But I think in your own life the way to do this is to remember your sins, remember to death, like I said, is to always try to find fault in yourself. It's hard to do, but that's what you're supposed to do because it's easy to find fault in the other because we see the outward signs of people like, you know, we encounter their outward signs so we can see those things. So it's better to. It's better to punch inside, you know, mostly. All right. Father Matthew Marinelli. Father, you're asking me about the situation with spoons in the Greek church, in the Orthodox church and communion and seriously, I'm sorry but I'm not going to get into church politics. It's just, it's just too, right now, it's just too painful because there's this, there is a controversy right now about communion and whether or not you should adapt communion to Covid and, and it's just, it's. It's all very painful and I will let my. I would, I would leave it up to my authority to decide that. All right. So James Cortite asked, I heard you mention two options with regard to a path forward out of our current state social pretty predicament. I gave a solution. I'm pretty negative these days. All right. Okay. So he says first was the continued resurgence and potential resurrection of Christianity and New Eden. And second was build an ark. What is the symbolic significance of the ark and how can we conceptualize this idea for today, what would a modern ark possibly potentially look like? All right, I'll give you an example of an. I can't tell you what a modern arc would look like. I'll give you an example of an ark which was built. An ark that was built is, is Dante's Comedy, Dante's Divine Comedy. That's an arc. It's an art because it is a. A bundling up together of all the levels of reality within a narrative that people could actually inhabit. People. People treat Dante's comedy as if it's describing a spiritual reality that they can live. And so Dante did a great job. So. Right. So who's going to build an art today? I don't know. Hey, Jonathan, Is there a symbolic reason why the horizontal line in the. The crucifix is placed a little higher than the middle? I think about that in general, you have to understand that. That there are three horizontal lines in the cross. That there's not just one. There's. There's a. There's a headboard or a sign and there's a footboard where the feet and then there's a transversal, which is the arms. And so those are more important to understand in terms of understanding, like three levels or, you know, the name, the identity, you know, Jesus Christ, King of the Jews, then the, the. The. The body or the hands which are spread out, the left and the right hand and then the feet, you know, the final connection with the ground. That's more important to understand. But I'll think about it in terms of why, why it's higher, besides the fact that, you know, the practical aspect of why would be higher. But let's say in terms of symbolism, I mean, a simple way of understanding could be like a kind of lifting up of the world. That could be a subway of understanding it. But I might be stretching it. I don't like when I'm stretching it. All right, so Sidi Haroun, for $5, ask can the search for the Holy Grail in Christian sense be compared to the Buddhist Awakening, the jewel in lotus, or the Islamic story of Majnun and Laila? I'm afraid that I'm not aware. I don't know what those stories are. I don't know what the story of Majnun and Laila is. Maybe if I knew, if I heard the story, I'd recognize it, but I don't know what it is. And awakening the jewel in the lotus, maybe. I mean, there is. There seems the notion of finding a jewel in a lotus is definitely Something which would be related to the symbolism of Grail or in general, the symbolism of the pearl. Finding the pearl in the, in the field, mostly that seems to be related to something like the jewel and the lotus. All right. And so Paul L for 25. No question. Thanks, Paul. And Indie Visual says a good starter to the problem of science addressing consciousness is found in the first Vervecki interview and more. So thank you, Indy Visual. Thanks for pointing that out. And so you can check out my first interview with Paul Vanderklee. I'm going to be on Paul vanderklae's I'm going to be on Paul Vander Clay's podcast, I think next week or something. So I'm looking forward to that. I haven't talked to him in a while. There is some talk that I might. I don't know if I'll be able to. To make it though. On Sunday I, I put a word out and I might be participating in a discussion slash debate with, with Adam Friended and Paul Vanderklee and Sargon of Akkad, I think. And was it PSA stitch, all these, these, these kind of, kind of atheists on the borderline, you know. So anyways, if I can make it, I think that would be an interesting conversation. I guess it would be interesting to talk to Sargon because he's smart, but sometimes, you know, the religion, it's just so funny to see. It's funny because you see him getting closer to understanding what religion is about, but he's still like, I still think it's silly, but I see that without it we're basically falling apart. But it's silly. It's silly. It's silly. So it's not for me, but for them, you know, all the plebs. Anyway, so it might be interesting to talk to him. And so also those who haven't seen, you know, I, I've been working for like, I've been working for, for, like months on. Been working for months on the idea of this image which would encapsulate all of the symbolic world into one image. And so I kind of finally finished it. I have it right here. I'll show it to you. Show it to you. Slash, tape on it because I was tracing from my pencil drawing. And so anyways, I'm pretty happy that happened because I've been kind of thinking about this for like years, I guess. And so anyway, so you can check that out. I put it out on different formats. People are interested in that image and, and so, yeah. So guys, thanks for thanks for your attention. And I'm sorry if I was a little. If I was a little convoluted and, and not super clear in some of my answers, but, you know. So I appreciate everybody's support. Thanks for your attention, everybody. I wish you the best and I will talk to you next month. All right, bye, everybody. I hope you enjoyed this episode of the Symbolic World. The Symbolic World is edited by Justin Ward and it is based on a series of videos that you can find on my YouTube channel, Jonathan Pageau's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by, of course, leaving a review on itunes. Everybody knows that's the best way to get the podcast out there, to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon Pageau videos as well, and on subscribestar, all those links you can find on my website or in the show description. So thank you and I will see you soon."}
