{"episode_id":"SW - #300 - 2023-08-11 - The Role of Art in Identity - Princeton Scala Conference","start":0.16,"end":68.78,"speaker":"Jonathan Pageau","text":"This is a monument in Montreal. It's in Montreal. That's why I care about it so much. The Museum of Fine Arts bought a church across from itself and used it to show art. And so the beautiful old church, and then they commissioned a monument to put in front of the church. And this is the monument. The transformation is full. The broken, empty angel whose wings are falling off that has an empty chest that has no face, you know, that is half mechanical, half flesh. You don't know what it is. And these types of statements, they're not arbitrary, right? It's like if I take a picture of your mother and I rip it, you know what that means? If I show a disfigured version of someone you love, you know what that means? This is Jonathan Pedro. Welcome to the Symbolic World."}
{"episode_id":"SW - #300 - 2023-08-11 - The Role of Art in Identity - Princeton Scala Conference","start":78.98,"end":205.88,"speaker":"Margarita Mooney Suarez","text":"Well, welcome back. For this panel, we are pleased to welcome Jonathan Pageau, who will be speaking to us about memory and the role of art and identity. Jonathan Pageau is a professional artist, writer, and public speaker who comes to us from Quebec, Canada. He lectures in universities, conferences, and numerous venues on art and the symbolic structures that underlie our experience of the world. If you're like me, you first encountered Jonathan through one of his many engaging YouTube conversations on the symbolic world. And if you're not already one of his 177,000 YouTube followers, I encourage you to sign up. That number indicates that the topics we're talking about here today have a broad resonance, as we heard earlier in this morning, not only with people of faith, but people asking questions about meaning and purpose and how to integrate art and beauty into identity. He's a skilled icon carver, and as you heard from Aidan earlier this morning, he's also an artistic entrepreneur because he started the Orthodox arts journal that's trying to revive liturgical art. Today, he gives carving workshops with the Hexameron School of Ecclesial Arts, which is accredited through Pontifex University. He's also working on a graphic novel, and I heard last night, maybe on some fairy tales. So he is an artistic, creative entrepreneur. We are delighted to have him. Following his presentation, there will be a conversation between Jonathan and myself, as well as RJ Snell, who also hails from Canada. And he is here locally now at the Witherspoon Institute, where he is the editor in chief of Public Discourse. He studied philosophy and taught philosophy for quite a number of years at Eastern University and the Templeton Honors College. He is widely published on natural law, ethics, the liberal arts, and a giant now in the Catholic intellectual tradition. So after we hear from Jonathan we will then have a conversation with myself, RJ And Jonathan. Thank you, Jonathan."}
{"episode_id":"SW - #300 - 2023-08-11 - The Role of Art in Identity - Princeton Scala Conference","start":216.98,"end":2148.87,"speaker":"Jonathan Pageau","text":"So, first off, I'd like to thank Margarita and David and Aidan. This is a bit of a tangent, but it's important to understand that I started wanting to thinking that maybe I could carve icons. I could do liturgical art professionally almost as a dream, as a prayer, as a hope. Maybe about 20 years ago, but about 10 years ago, the situation in my life made it possible that possibly I could maybe do this, maybe at first, in my spare time, wasn't sure trying to figure out how to make it happen. And David Clayton, who's right here, is the very first person to ever write about me, promote my work, just talk about what I was doing. And the same with Aidan Aydin. For those who are not in the Orthodox world or not in the world of liturgical art, there are waves of artists, and in some ways, the waves that came before are the ones who struggled the most and who made it easier for those that came after. And Aidan is part of that wave that made it possible for so many of us who are able to paint icons that it's credible that we could create liturgical art. And he was also one of the first people that I wrote when I was kind of struggling. And he was an icon carver. He was actually doing it. And I wrote him, sent him some images of my carvings, and his criticism of my work was extremely helpful, and just a kind of common sense about how to go about this was very helpful to me. So it's a great pleasure to be able to speak with you and to meet all of you for the first time in person. So I want to thank you for that. It's one of the prime reason why I came was like, oh, I get to meet Aidan and David. All right, I'm there. I'm coming. And so what I want to talk to you about today is I want us to maybe start thinking a little differently about art or kind of provoke you to think differently about art. I'm very fortunate that Aidan went before me because he really set the stage for what I'm going to say. I almost wanted to, like, when you hear someone speak and he really does a good job, you almost want to kind of reformulate everything just before starting. But we're going to go along, and I'm going to try to try to answer also some of the powerful ways that Aidan presented his vision of liturgical art. And so in the modern world, we have a. You know, we are the fruits of the avant garde, right? We are the fruits of modern art. And there's a lot of tangents in modern art, but one of the things that modern art has done, and not just modern art, but even the Romantics before, you know, even the pre moderns, there's a sense in which we started to understand art in a few particular ways. One was to understand art as something like questioning what the artist questions. The artist pokes, the artist provokes and tries to change and tries to revolutionize the means of seeing, the cultural means. And so we are left with this idea, the creative artist who is trying to find some new way of representing things, to challenge the old ways of seeing. And this is a very deep. This is a very deep kind of underlying assumption that we have in the manner in which we understand art. And so, you know, of course, the king of this is Marcel Duchamp, who really went so far, you know, as to just take common objects, put them in the gallery, you know, to play with identity, you know, to question identity itself in his art production. And this is like the culmination of what it is. And people like Marcel Duchamp became, in some ways, the pioneers for what then became contemporary art. Whether it's pop art, Andy Warhol, and all the way up to today, the contemporary artists are in the line of Marcel Duchamp. And so you all know Banksy. Now, here's a very powerful theatric example of what it is that we tend to think that art is. And so Banksy had this very theatrical stage. I'm sorry, it's obviously staged, but they brought one of his paintings out to sell at auction. And while they were doing the auction, it started to shred into pieces as they were selling it. And everybody just celebrated this thing. And now the piece is worth way more than it was when it was just a painting. But this type of gesture is a. It's a prime example. It's a very recent example of how it is that we understand what it is that we understand art to be as this idea of questioning, as provoking the punk rock, rock and roll idea of what culture is. And so what I want to bring you towards is a different perception of art, and it is, in some ways the more universal perception of art. Now, I don't think think there isn't room for the provoking. There isn't room for the fool, the holy fool, who, you know, make sure you know that the king is in God, right, the graffiti artist that reminds you that this thing isn't full in itself. There's a role for that. But because we're so unused to thinking about art in the very ancient, more traditional way, we almost have to react, to relearn how that is. And so, you know, the word art means well fitted together. That's what the word means. It's actually close to the word also in Greek, techne, which is our origin of technology, and even poesis, which is the origin of our idea of poetry, comes. The root of it is something like making. So this idea of bringing things and poetry, putting them together properly towards their purpose, right? That is the manner in which the ancients understood art. And so you have a. There's an idea, there's a pattern, there's a episteme, there's a high understanding. And now you want that to land in the world. And so in order to do that, you have to gather things together and, you know, bring them together and make the thing visible for us, right? And so this is actually very much closer to the way that the ancients understood what art is. And funnily enough, like so much irony in the modern world, in America and in the west, it took someone who came from Ceylon. So Ananda Kumaraswamy, who is up here being quoted, was one of curators at Boston Museum at the beginning of the 20th century. And he was the one who, for the Westerners, reminded them, reminded them that ancient art, that the medieval art, the liturgical art, but also the art of all cultures is first and foremost in light of this. That is art, the art of carpentry, the art of cooking, the art of wine making, but also the art of rhetoric, the art of poetry, and then the art of painting, the art of sculpture. That these are all ways in which someone is skillfully capable of gathering means together towards a purpose, right? Towards a telos, towards something which is the reason why the object exists in the first place. And so this is really a, you know, it changes our way of thinking about art, you know, because not only in the contemporary world, we understand art as being provocation, as being questioning, as being, you know, kind of poking at the system. We also tend to understand art as something which is received as a viewer, right? Received as a. As public. And so you have a performer and you have a public, you have a painting and you have a viewer. And this is so ingrained in ours, right? It's the root of entertainment. It's what brings us to watch our television screens. But there is a far deeper way of understanding art, in my estimation, that is more about this gathering, because the gathering that the ancient arts did was not just the gathering of the stuff, but it's also the gathering of the people. It's also the gathering of the people around that care for the thing you're doing. But if you make a good meal and you do it well, obviously it's not just about making a good meal, right? It's about the people that will come in and sit with you and enjoy it with you. And that's true for anything, right? It's true for making a piece of furniture, right? You don't just make a piece of furniture because you dream it up in the morning. You make a piece of furniture to hold, clothing to sit on, to participate in the life of people. And so this ancient vision of art is not only gathering the stuff, but it also ends up being. Gathering people into the purpose of that the art is making manifest, okay? And so. And there are a few people in the 20th century that actually started to have inklings of. That started to re. Understand it. For example, interestingly enough, Heidegger, in his questions concerning Technology, you know, because for the ancients, there was no different, no difference between art and techne. These were the same. You know, when it says in Scripture that. That Christ was the son of a carpenter, what it says is that Christ was the son of a tecton, the son of an artisan, right? The son of someone who makes things. And for the ancients, there was no difference between. I mean, there's a difference because obviously making a piece of furniture and making a painting is not the same skill, but it was all about bringing these things together. And so Heidegger, in reading the ancients, in reading Aristotle particularly, he comes to this image where he says that techne, technology or art, right, Is a mode of unveiling. It's a mode of revealing. Because whoever builds a house or a ship or forges a sacrificial chalice reveals what is to be brought forth. And so the artist gathers the things together so that all this wood, all these bits of stuff, become a boat, become a chalice, become something which has telos, something which has purpose, okay? And so it's very important to understand that. And when we understand that, then when we look at ancient art, we have a different. A different perception. Now, one of the difficulties that we have even looking at ancient art is, of course, that we encounter these things in museums that are septicized, that are reduced. You come up to a statue that is on a pedestal with a nice blank wall behind it, and then you just look at the art. Now, of course, none of that art was made that way. None of that art was made to be participated with that way. It's fine. There's nothing wrong with the museum, especially since these arts don't have a participative role to play anymore. It's wonderful to be able to see them. But the ancients in every culture would have understood the arts mostly this way, in the sense that this is the building that is the highest point in our city. It's dedicated to the God that is the patron of our city. And we make these things that bind us together as a city. So for Athens to exist, the Parthenon is key. It's this gathering together of things, this gathering together of people, this gathering together of attention, right? The reason why these temples were often higher than all the other buildings. So that everywhere in Athens, you could look up and you could see the thing which is binding you together. You could see this image of your patron God, let's say, that is binding you together. And so this is the. This will make you now again see different things. So if you think, for example, of folk dancing, then all of a sudden, folk dancing takes on a very different allure. You know, we think that dancing. We think that, you know, dancing is something. You go to a performance and you watch ballet. You sit there and then you watch the ballet. That is somehow high culture, right? That is the highest form of culture, is to be an observer of people that are doing something with excellence. Now, there's a very. There's a big difference between that and something like folk dancing. Because what does folk dancing do? Folk dancing makes you participate, right? Square dancing in the United States, for a long time, did something like that force you to participate, but not just to participate, right? The traditional clothing, the traditional music, the language of our culture. And so there's a way in which folk dancing becomes a concentration of a certain level of identity. That's a good way to understand it. It's like I have something in common with these people, and it's actually the reason why I live with them. It's a reason why we're not just a bunch of strangers like in the suburbs, but we actually live together with reason and with a common identity. And so we have a way to celebrate that. We have a way to remember that. We have a way to bring all this stuff together. So now the dance, the costume, the music, all of that becomes art, becomes art in the sense that I'm trying to get you to understand. It becomes this joining together of things, of people, of aspects of reality together so we can recognize them as an unveiling of unity. It's like, oh, yeah, we're Bulgarian or whatever. Like, we have something in common. We're a group. And once you understand that, then this is the beauty of what Aidan was bringing out, this notion of liturgy, this idea of liturgical practice, where in the church you have all these things that were made with love and attention by people and that enter into a dance together in order to manifest the very reason why we're together in the church. It's different from this because we're not just celebrating or participating in the reason, you know, the fact of being this or that group or this or that, you know, having this or that origin in common, but we are celebrating the very source of reality itself. We are celebrating the. The reason why everything exists, why all things exist, is something that we're celebrating when we come to church and we are in the building and we have all these objects, this music, the words, all of this comes together with the people in order to reveal this and make us participate in that reality. And so this can help you understand maybe also why, because. So these are some of my carvings. Understanding this, and there are a few people in this room that had the same revelation. Understanding this and understanding the power that art has to bind us towards that which is most important, you know, is what made us move away from the contemporary art world, what made us realize that there's a richness here that people have forgotten. There's a richness here that is really tapping in to the way the world works. It's not just something that is a nice picture or that is a nice object that I can look at and enjoy, but it's more than that. It is a deep form of participation in the way that we exist together and actually in the way that reality reveals itself to us. And so, of course, there's still a lot of that today. We often don't think about it, but there's still a lot of this idea of art as participation, of art as celebration. And usually the remainders of that is, of course, civic art, the public spaces, or the. You know, the. Go to Washington, D.C. why would you go to Washington, D.C? it's not like you can talk to the president or anything. You go there to liturgically participate in the common origin that binds you together as a nation, you know, and so why would you go and look at a statue of this dead guy? And, you know, I'm going to be really. I'm going to push you, but it's like there's a little bit of veneration there's. A little bit of. I want to stand there and look at the image of someone that I recognize and as having that participating in the reason why I'm here. Like, I look at this image and I know that one of the reasons why the United States exists as a country that is one. Is because of this person, okay? And so it is liturgical. You cannot. You won't be able to avoid liturgical. If you try to break it down and you try to avoid liturgical, you're going to end up in Graceland and you'll be looking at Elvis's shoes like, you just cannot avoid it, right? Or you'll be dressing up as Obi Wan Kenobi with your lightsaber, right? You cannot avoid this. This is something that is deeply human. And the most cynical anti religious person will unironically dress up as Obi Wan with his lightsaber and will go to Comic Con and will just be so excited to enter liturgically into the story of Star wars. Okay? So I just want. I just hope you can kind of see how inevitable this is, you know, and in this image, you actually see that the artist tried to portray this in the very image itself. You know, in the seat that Abraham is sitting on, there are the. The fasces. They are the. This ancient Roman symbol of binding unity, right? All these sticks that are bound together in order to manifest unity. And so the artist clearly understood that not only is this person one of the reasons why that unity exists, but also at a secondary level, the people who come there, who read the inscriptions and the stone, who look at this statue, are reenacting, are participating to some extent in that story and in that identity, okay? Now, this also means that we have to be very attentive. We have to be very attentive when that starts to shatter, when it starts to break. And I don't want to say any statement for or against whatever, but it's important to understand that when those liturgical things, when they get taken down, there is a world that is changing, right? There's a memory that is changing. There's an identity that is changing, and you can't avoid that. You know, the Christians took down the Roman God statues, and when they did that, it meant something very profound. It meant the world is no longer the same. The thing that binds us together is no longer the same as what it was before. There's a deep transformation which is afoot when you start to see this happen. And so it's important to pay attention and to. It's not my job to deal with that. But it's important to understand what is happening. And so this, of course, you know, and this. Aidan, I want to talk about this one last time, so one more time. This. This is also important to understand that art that is civic and that is celebration, that is participating in identity, necessarily has to have certain forms, right? If you take an art that is there to question, to poke, to rip at the identity of something and you put it up in a public space and you put it up as a civic monument, you are entering a very dangerous place. And the difficulty we have, and I'm saying this because there's a lot of that that happened in churches in the past 50 years, and it wasn't done on purpose. It was done with people who were looking at the modern art around them and not totally, sometimes understanding visually what the art was doing, not completely gathering into themselves the implications of showing broken people, of showing things that are cut, things that are shredded, and then just putting that up in public spaces, in the church, just wanting to kind of be modern and not realizing that there are. These are very organic. They're not arbitrary. It's like if I take a picture of your mother and I rip it, like, you know what that means? If I show a disfigured version of someone you love, you know what that means? And so the fact that we just kind of forgot that and we've accepted these weird things. And so this is a monument in Montreal. It's in Montreal. That's why I care about it so much. By David Atmed. You know, the Museum of Fine Art bought a church across from itself and used it to show art. And so the beautiful old church, you know, and then they commissioned a monument to put in front of the church. And this is the monument. And so, right, the transformation is full, right? The broken, empty angel whose wings are falling off, that has an empty chest that has no face, you know, that is half mechanical, half made, half flesh. Flesh. You don't know what it is. And these types of statements, they're not arbitrary. And so, you know, what you're seeing in some ways is the evisceration of the church, which was now transformed into something else. I wish they would have done it differently. They could have, or they could have done it differently, but that's the way that they decided to go at it, possibly for reasons. And so this, of course, is. I showed you an image of the Parthenon to kind of tease you a bit or to poke you myself. I'm sorry. There's a way in which There's a problem with this. There is a problem with this thing. The gods fight amongst each other. The identities fight amongst each other. All these cultures, they also lead to conflict and war. And so how do we deal with that problem? Right. The questioning of identity, the poking at the system, is not always completely illegitimate because identity leads to conflict. It just does. That is part of. That's part of the problem. And what you see in scripture is you see the beginning of a transformation of the problem. There is a very deep relationship between art and identity in the negative sense in the Bible, and one which God transforms into something beautiful and positive and glorious. But it's important to understand it because we have to be cautious about the way we enter into identity. And especially as people start to poke at identity, we sometimes want to just react and say, it's like, no, I am this, or I have. I have this identity. We have to be very careful. And so in scripture, the development of the arts follow one thing. They follow the murder of Abel. And so Cain kills Abel, and then Cain is chased away from God. On his body is placed a mark which excludes him from the presence of God, we could say. And then that mark leads Cain, and that exclusion leads Cain to develop civilization, to develop. The first thing he does is he builds a city. The first city is built by Cain himself. And then his descendants are the origin of music, the origin of metallurgy, the origin of tent making. And so you see in the descendants of Cain this strange thing. Why? Why is it that it's in the descendants of Cain that this happens? And there are corollaries to this actually, in other cultures. Hephaistos, for example, is almost like a Cain figure. He is thrown out of Olympus for some impropriety, and he lands in Hades. And it's in Hades that now he develops the skill to make the beautifully forged objects, the weapons, the things that the gods prize in terms of. In terms of techne and in terms of art. Right. The capacity to make things. And so why is that? It has to do with the problem. It just has to do with the problem of inside and outside. It has to do with the problem of identity. Because once civilization starts, war starts. It's an inevitable part of building a wall around your city. If you build a wall around your city means there's some people that are inside and there's some people that are outside. And those people that are outside, you know, they're looking inside. Maybe they want what you've got. And now you've got to defend your walls. Against the people outside. And it creates. It's an acceleration of the fall itself, right? That's what happens when Adam and Eve take the fruit for themselves and are see themselves as naked, they immediately see the other as a threat, right? Right away, what happens? Adam blames Eve, you know, Eve blames the serpent. It's right away me, you, you know, you're the bad guy. It's not my fault. There's just this immediate opposition which happens. And this, this opposition is just a part of civilization and it ends up being a part of technology and of human making, one which is difficult to deal with. Now what happens in the, in the Bible is that God takes that and transforms it powerfully, right? He does, exactly. Aidan had such a beautiful image, taking it from St. Ephrem, saying, the fruit of the knowledge of good and evil. Think about it this way. The fruit of opposition, of opposition between two things, if taken for yourself, becomes. Yeah, it becomes that. It becomes opposition. Now if you are given the fruit, then it can become life itself in the sense that it becomes the capacity to distinguish. The capacity to distinguish is not wrong, but it has to be. Let's say it has to come from heaven is the best way to understand it. It has to come from above. And what you see in the story of the tabernacle is exactly that God reveals to Moses the pattern of the tabernacle. The tabernacle is the memory of Eden. That is what it is. The tabernacle is based on the image of the Garden of Eden. It is the idea of the candelabra that's there. And you also have the cherub that are guarding the ark, guarding the tabernacle. And so there is a direct relationship between the participation in this space and a return to paradise, a return to Eden. And it is, you could say it's something like memory perfecting itself slowly, memory being. Because memory is two things, right? Memory is distance from something, and memory is also direction towards something. Even the word like we remember, it's like we bring multiplicity back into its telos when we remember. And so when you remember God, when you remember the heart, all these expressions that we use in Christian thinking, that is what you're doing, you know, you're going to see that obviously all of this will lead, you know, to communion ultimately, as this perfect, you could say perfect memory. But this is already what's happening here in the, in the tabernacle. And so if you read, if you read Exodus, you'll see it's not just the tabernacle. It's the Passover. It's all these things which are remember, remember, remember what happened. Remember your origin, remember where you come from, remember what binds you together. Why are you Israel? Because I am the God of Abraham, Jacob, Abraham, Isaac and Jacob. That is why you are Israel. You are bound both by especially this revelation is powerful because God is saying, I am the God of heaven, I am the source of everything. I am supreme, but I am also the God of your fathers. One comes after the other. In an important way, I am that I am, but I'm also the God of your fathers. I am the place where you recognize your origin to be in Abraham. So the participation in the ritual of the tabernacle, the remembrance of Passover, the remembrance of these feasts was always to remember where you come from, remember where you are. And that becomes a way to participate in it or to participate in something which is kind of beyond the beyond the beyond the now, now like or just the. The commonality of everyday life. And so now this, this, this, this question again, right? This is the problem, right? This is, this is the problem that I'm talking about is that techne, unity, identity often leads to this. It leads to Babel, you know, and this is of course the ultimate image of the city gone wrong, right? The city that tries to contain everything, the city that tries to take the fruit for itself, that tries to make a name for itself and not receive the name from above, not receive the revelation from above, but make a name. We're going to make a name for ourselves, right? We hear that in common parlance. But this is of course what leads to Babel in the kind of the complete distortion of. Of art into this pride is the best way to understand it. What I want to show you is that this idea of memory and of celebration and of remembering is one which, even though we have this kind of modern art there, it's always there. It's always kind of. It's this underlying current. You're going to see it. If you pay attention, you'll see it. And so everybody, you know, this is. He's the famous artist. Jackson Pollock is the famous artist. You know, it's process. It's all about process. It's not about the thing, it's about this expressivity. It's about a kind of ordered chaos us. It's about this explosion of color and of art. And he's the avant garde. He's the one who's pushing the boundaries, who's at the edge. But while this was happening, and even the teacher of this person is this person, Thomas Hart Benton. And in the United States, you have this whole current called regionalism that a lot of people don't know about. For some reason, that was a desire to, you know, with the crumbs that are left, to celebrate something about our lives, to celebrate the worker, to celebrate, you know, the stories, the difficulties that people. That people went through. And so there was this desire. And you can see that this type of art, this type of art and the other is a completely different nature. They're just not in the same world. They're talking about things very differently, not just visually in terms of subject, but also in terms of purpose."}
{"episode_id":"SW - #300 - 2023-08-11 - The Role of Art in Identity - Princeton Scala Conference","start":2149.39,"end":2149.55,"speaker":"Margarita Mooney Suarez","text":"Right?"}
{"episode_id":"SW - #300 - 2023-08-11 - The Role of Art in Identity - Princeton Scala Conference","start":2149.55,"end":3048.01,"speaker":"Jonathan Pageau","text":"In terms of purpose. And so regionalism is the type of art that you will find in the 1930s in civic art in the United States. Because it had some. It had the right way of celebrating, of remembering the things that. The sacrifices of our forebears and putting them there for us to be able to see them. Okay, now this is. I want to show you how difficult it becomes. Is that you have a similar situation happening in Europe and in Russia. And there it goes. The other way that it went with Pollock is that you have this push in Russia, this push towards supremacism and constructivism to kind of break the way that people used to see the world, to really push it to its edge. You see, the craziest example is, of course, in futurism, Italian futurism. Boccioni is a. Was one of the members of the futurist movement in Italy, where it was really explicit, like, art is violence, art is destruction. Art is this push that we need to break everything to be able to move into the future, but that can't hold. It's almost like you pull the pendulum so far, and then when it snaps, then it goes into this, which is also modern art. This is modern art. That's modern art there. And there was obviously a version of this in Germany as well. And so how do we deal with that? Because that's a problem. I hope you agree. That's a problem. This is a problem, right? It's like, why is Stalin. Stalin the hero? So how do we avoid participative art that wants to remember, that wants to make us connect to our origins, connect to our world, to our commonality? Without propaganda, how do we do it? Right? Because the modern artists that were breaking everything, some of them had the right intuition about the problem of propaganda. And we have to understand that this is not a new question. Plato knew that in the Republic, Plato knew already the problem of Art, the problem of poetry, the problem of rhetoric, the problem of artistically putting together things because they can be used to manipulate your idea. They can be used to make you care for things that maybe you wouldn't care about. They can be used to make you think something is important that maybe you shouldn't think is important. Ultimately, for us, that becomes advertisement. It's like advertisement is all celebration, advertisement is all participation. But that's not what we want. We don't want something that is so shallow and so manipulative. And so how do we do it? How do we deal with this? And I think that Christians, as they came into place and as the language of the art in the church started to establish itself, I think they found what I think is the best solution. And it's one which is not arbitrary to Christianity, but is rather at the very source of the particularities of what Christianity is. As images started to appear in the Christian church and started to take shape, it took several centuries, it took a while for this to kind of gel and to crystallize. You know, by the 10th century, by the 11th century, you could say that there were two basic images of Christ, two central images of Christ. And one is the one we could call the Pantocrator, which is Christ here shown with the book. And this is an eschatological image. It's a Christ as he will appear in glory. It's Christ as he will show himself to us when all has been revealed and all has been brought together. The finality, right? It's not just about future. It's something that can pierce in now, it's something that you can experience now. But there is a sense in which it's beyond the. It's beyond the mere historical something which is piercing through from the other side, piercing through from that final moment. And then the other image that becomes central. You know, especially there is a sense in which one becomes more central in the east, one becomes more central in the west, but it's a little over exaggerated. But then you have the cross. And so, you know, we have to. Every time you look at a crucifix, like, don't forget how weird that is. Like, don't forget that, you know, you have this thing above the iconostasis or above the altar in front of you that is the image of a dead person. And it's crazy, but it's an interesting. Just, just I'm going to be utilitarian. It's an interesting idea. It's like, wait a minute, at the top, the thing that's the most celebrated is actually the thing that gives itself. Oh, the thing at the top. The thing that's actually most celebrated is the thing that empties itself. Huh? Okay. Well, that's different from the king, right? That's different from Athena or Zeus that goes around raping everybody. It's like. It's quite different, right? It's quite different. You know, there's a different vision. It's the same for this idea of Christ, the eschatological Christ. It's like, no, no, don't think you've got it right. Don't think you've mastered it. It's coming. It's coming over the horizon, right? Call for it, ask for it, ask Christ. Come, Lord Jesus. But don't think that you got it right, that you're the one. And so these two powerful images, like I said, it's not arbitrary. It's something about the very nature of the Christian faith which makes these images the central images and bring the possibility to celebrate, to remember, to worship, at least giving the possibility of alleviating the problems of pride and the problems of identity doesn't mean the Christians were always able to do it. You know your history. Obviously not. But there's a difference between. There's a qualitative difference between that and the, you know, the Augustus, the son of God, who is all powerful and is literally a manifestation of a divine principle in the world. And that can rule over you, you know, with his. With his fist or some other Roman emperor or some other ancient Egyptian pharaoh that had right of life or death over everybody in their kingdom. There's a big difference between the two. So what that will give in terms of culture, what type of images it will provoke, can be very interesting to think about this way. And so this is a type of image that you'll see in many medieval churches, orthodox churches. And what it is, it is the rich, powerful person, in this case, a rich aristocrat in Constantinople, sometimes the emperor himself, sometimes the king himself, prostrating himself before the true emperor, the true king. And what is he doing? He's offering the church. But the church, the building, that is, he's offering the art, he's offering the arts to Christ. That's what's going on there. It's like, I paid for this church, I hired a bunch of architects, a bunch of artisans to make this beautiful church, and I'm offering it to Christ. And so the summit is again, eschatological. This image of Christ is the Christ he's sitting on his golden throne. He has returned. He is the Christ that fills up the entire cosmos. It fills up the entire world. This is what the art is being offered to. And then you'll notice that in, let's say, several, there are different images that manifest that. This is an image called the hetimasiyah, which is this image of the prepared throne. And so it's an image of the throne which is prepared for the final revelation of Christ. And so, you know, it's a beautiful image of this offering up, right? It's like gathered these elements together. There's the book, there's the throne, there's this throne of the emperor which is prepared for. For this final moment. And so that is what we do. Aidan this morning, you know, beautifully talked about the Eucharist in a way that, like, might scandalize some of you, because he came right up to it. And I'm going to push you over the edge. He said, the Eucharist is art. The gifts are art. We made them, we made the bread, we made the wine, and then we offer it up to become the very blood and body of Christ. You know, it's like, that's a really powerful image. You know, in some moments during the Byzantine period, it was the emperor who would come up to the door of the. Of the iconostasis of the templon and would bring the bread to be to hand over to the priest or the bishop who would take it and then consecrate it. It's like, here's my kingdom. Here's all these things gathered, right? Here's all these things that our works, our efforts, all this stuff that we do, all these activities that we do, and we're offering up to become the body of Christ. And so that's a very powerful image. And then that again. And then the Eucharist, obviously it has many. There's beyond symbolism in the Eucharist, but one of the aspects is that emptying as well that's there in the Eucharist, right? The Eucharist is both the eschatological Christ and also the Christ that empties himself and gives his body and his blood for to fill us up. And so I'm going to speed up really fast. And so this is one of Aidan's ascension. And so if you start to think that way, then you're going to start to notice that a lot of the images, especially in the orthodox tradition, the tradition that I know, have a very strange eschatological element, you know, in them. And so this image of Ascension is obviously an image of the Ascension. I mean, it's the moment that Christ rose. But it also is an image eschatological in its very form, right? It's revealing to you the structure of the world. The divine Logos is above in heaven, and he's either going up or coming down. You're not sure. This could be like the return of Christ in a very strange way. And then down below is the footstool of the throne. The Mother of God is there underneath him. And then you have the church which is gathered. And how do you know it's eschatological? Because St. Paul is there. Why is St. Paul there? This is not just a snapshot. This is trying to bring you into that moment where the entire church is gathered in the Pantocrates or in the one who rules over all things. And then you have some images which have aspects of. Of kenosis and of emptying. And so an example again is in the image of the Nativity, where Christ is represented as a child who is already in the tomb, who's already contained in this. It's weird for people. Again, that story of Jesus is so weird. It's just so bizarre. We're so used to it, we stop thinking about it. Like, why was Christ laying in the food trough for animals? Why? Because he's going to the bottom, right? He's going to do it. He's going to do it when he dies, but he's already doing it now. He's going to the very bottom of the world, the very place where animals eat, right? To the foundation of all things. And so you have this kenotic element as well. All right, and then all of this is, of course, leading to the final image, right? And this is the final image which restores the story from the beginning. We have to understand the heavenly Jerusalem as the final restoration, even of, you could say Cain, not say Cain is saved. I don't know. God knows that. But it's the restoration of the very first moment of that sin, that sin of murder that led to civilization, is being transfigured, is being filled, you know, in the image of the heavenly Jerusalem which comes down. And if you read it, if you read the text, it's very powerful, right? It says, I did not see a temple in the city because the Lord of God Almighty and the Lamb are its temple. The city does not need the sun or the moon to shine on it, for the glory of God gives it light. And the lamp is its lamp. This is where it's related to what I'm telling you about in terms of how do we make our identities proper? How do we make our rejoicing, our celebrations proper? It says the nation will walk by its light and the kings of the earth will bring their splendor into it. So what do the kings do? They offer their glory to God. They bring their glory into service of the heavenly Jerusalem. On no day will its gates ever be shut, for there will be no night there. The glory and honor of the nations will be brought into it. And again, a repetition of that very theme which is all our identities, all these little identities that we have, if we live them properly, we live them in service, we live them in giving them up towards the true king. And so there's nothing wrong with being American or Canadian or French or whatever identity that you participate, it doesn't have to. You can also be like part of a soccer team or a football team or part of. Of something that you recognize as being you, something that you participate in that gives you a sense of meaning and a sense of purpose. All those things can really be filled if they are ultimately directed towards the heavenly Jerusalem, towards the highest good, towards the highest image. And in this image, again, surprisingly enough, you have these two images represented quite powerfully in this particular image, which is, you see the Christ, you see Christ in glory, Christ as the king, Christ as the ruler of all, the one who fills the world with his power and his judgment. And then on him is the lamb, which is the sacrifice. And those two together are what these two images. I talked about this eschatological and kenotic image coming together as being what the Christianity proposes as a possible solution to art, to identity, and to the way we participate in the world. So thank you, everybody for your attention."}
{"episode_id":"SW - #300 - 2023-08-11 - The Role of Art in Identity - Princeton Scala Conference","start":3054.33,"end":3220.83,"speaker":"Margarita Mooney Suarez","text":"Thank you, Jonathan. I have to say, that was fantastic. I was cheering there as you got to the end. And I want to give the first question to rj, but don't worry, I decided I'll kind of summarize a little bit of what I heard from Jonathan to get us going. When I'm teaching a great text or have students listen to a great guest lecture, I often try to pull out some key themes. And I wanted to do that here. I was doing that myself as I was listening and we were having a conversation yesterday about thinking visually. I often kind of teach visually. Okay, how would I organize what Jonathan said? And I wanted to highlight some really key terms. And the mic is not on. So good. Okay. Is the mic on now? Great. Okay, sorry. Especially for those of you on livestream, what I would like to do to start us off is to pull out what I heard were some really key themes from Jonathan. And if we don't get through them all today, we also. I mean, this morning, we also have the breakout sessions with him later. But what I thought, the very first thing you said really struck me. And I have, like, this schema that I have, right? On the one hand, there's identity as performance or identity as participation. I also heard you say we can think of art as tearing down or gathering. We can think of how we interact with the material world and art as something that's a manipulation or a celebration. Art can have an impact on our common life by promoting division or union. We can think that what goes into art is purely arbitrary or there's form. Then we can think about our relationship to the material world as one of possessing or offering. And then I thought you pulled it together so beautifully because after kind of laying out those tensions around the place of art and identity and culture, you then offered a vision. You know, Aidan this morning kept talking about art as offering a vision. And you offered an incredible, beautiful vision of what art could be. Because you brought in the transcendent, you brought in God. You started with the cross and you talked about worship and the eschatological and the Eucharist. And you essentially led us to see that the proposal of Christianity is that the heavenly Jerusalem can be made known through form and through worship and through art, and then flow back out in a healing river to a culture that has suffered a lot of division and manipulation and tearing down and in a way of forgetting of who we are as human persons. So that's what I took away from your talk. Jonathan, does that sound. Would you own that?"}
{"episode_id":"SW - #300 - 2023-08-11 - The Role of Art in Identity - Princeton Scala Conference","start":3222.51,"end":3297.12,"speaker":"Jonathan Pageau","text":"Most of it. I would say, what did I miss? No, no, you didn't miss anything. I just am saying, just. I would say. I would say that. I would say that at least in our situation, I don't like. The heavenly Jerusalem is eschatological, right? So in some ways, it can't be completely known by human forms. Now, it can be. You can be. It can bring you closer, right? And so you can be brought into an inkling and into an anticipation and into a, say, a smell of what is the final revelation. And in some ways, it has to do. So, you know, I didn't go as deep into the notion of memory, but that's the best way to understand it. It's like, you know, we think we only remember things in the past, but actually, no, we also remember the future. And that's a moment when we're Remembering the future. You know, we're actually remembering in the future. And you do it all the time, by the way. It's not weird. It's not like this weird magical thing I'm saying, you know, every time you build something, you're remembering the future because you haven't made your thing yet. And so you're looking into the future and you're remembering towards that point. And the heavenly Jerusalem is the ultimate version of that. Right."}
{"episode_id":"SW - #300 - 2023-08-11 - The Role of Art in Identity - Princeton Scala Conference","start":3297.92,"end":3303.92,"speaker":"Margarita Mooney Suarez","text":"Thank you. I'll just say there's a term already and not yet, that's a kind of anticipation."}
{"episode_id":"SW - #300 - 2023-08-11 - The Role of Art in Identity - Princeton Scala Conference","start":3304.96,"end":3578.29,"speaker":"Rj Snell","text":"I turn it on. Thanks so much for your talk, Margarita. Thank you for the invitation. Thanks to all of you for being here. I apologize for my eye patch. I'm not. Congratulations, Cosplaying pirate, whatever. My seven year old thing recovering from eye surgery. Marguerite had asked me to think about some of the questions of art and Jonathan's talk as they relate to the political common good, of how we might think of the work of the artist contributing or failing to contribute in some ways, from your own talk to the ability to have a shared common political life. So we see this, I think, in many ways in your discussion of the gathering together. The folk dance brings a common good of the dance. The temple which is raised high above the city, gives a source of unity and direction to the people. So that there's a kind of common good. But I'd like to explore a little bit some of the challenges that I think we face at the contemporary moment and wonder if art's up to the task in some ways of needing to do what we need it to do. So first, if we think about some of the challenges facing us in the political common good, I think it's not the case that everyone goes to Washington D.C. and venerates the Jefferson and Lincoln memorials. If anything, it may be quite the opposite. So some months ago, when Margarita mentioned that I may be part of this panel, I watched some of your videos and this week I thought I better watch some of them again. I was watching very serious videos about symbolic realism. But then because of the wickedness of the powers of the algorithms on YouTube, there was on the side a conversation about the inverted Pentagram. Talk about you. So of course I had to watch about the inverted pentagram. And in your conversation you mentioned how the pentagram, the right side up pentagram, has a source of unity at the head and then you have the top of the triangle and then you have the four differences brought into unity. The inverted pentagram is quite the opposite. The inverted pentagram is trying to, in some sense bring unity at the bottom out of the many E pluribus unum from the many one. But it doesn't work. And you make in that talk a very interesting suggestion, which is you suggest that in our own cultural moment, not having a source of unity, we're trying instead to fragment by going to the margins those who were previously the oppressed or the marginalized, the subaltern. Their experiences are privileged, and there's not a veneration for unity. In fact, a whole lot of our culture looks like the angel in front of the church. In Montreal, Prime Minister Trudeau recently said that the nation of Canada has no identity at all. It's a post identity nation. It's the inverted pentagram. That's why I moved to the United States, where it is also E pluribus unum, though, but not working. So that's 1. The political reality seems very difficult. 2. The power of the arts to do this. Many years ago, the Welsh poet David Jones wrote his epic poem the Anathemata. It's his attempt to recreate British identity through art, and it fails miserably. No one understands any of the references to the Arthurian legends. And in fact, the introduction to the poem begins with his notion of the break, which is that because there is no cultural memory, there can be no art. He says the poet is dead. The poet can't make reference to wood and assume that the citizen will think of the cross or the tree of life. There'll be no reference at all. Can't refer to water because there'll be nothing there to refer to. Even some of the images that you refer to here, I wonder about their power. So you show us the reference of Tubal Cain. The image of Tubal Cain that you showed us is from the Spanish Chapel in Santa Maria Novella. Those of us in my own school call that fresco the triumph of St. Thomas Aquinas. But Tubal Cain is in the very bottom right of the piece. There's a narrative unity prior to the works of Cain. If you think of the piece at the top, we have the Holy Spirit descending upon the upper room where the disciples are gathered around Our lady, and she's immediately above Thomas Aquinas, who is the source of synthesis. It's a Dominican propaganda piece. Across the wall is the Dominicans dressed as dogs, attacking and tearing apart the heretics. Thomas is above Averroes, Arius and Nestor and all of that theology and Holy Spirit provides the backstory for the arts and sciences. And Tubal Cain is on the Very bottom and the very right and the ordering of the arts and sciences is from the least important to the most important. So does art, really."}
{"episode_id":"SW - #300 - 2023-08-11 - The Role of Art in Identity - Princeton Scala Conference","start":3578.85,"end":3584.45,"speaker":"Jonathan Pageau","text":"It's actually. It's the left. He's not on the right. Because from the point of view of."}
{"episode_id":"SW - #300 - 2023-08-11 - The Role of Art in Identity - Princeton Scala Conference","start":3585.41,"end":3586.69,"speaker":"Rj Snell","text":"From our perspective, he's on."}
{"episode_id":"SW - #300 - 2023-08-11 - The Role of Art in Identity - Princeton Scala Conference","start":3586.69,"end":3591.33,"speaker":"Jonathan Pageau","text":"Yeah, it's always the point. Point of view of the people in the icon will help you understand which side he's on."}
{"episode_id":"SW - #300 - 2023-08-11 - The Role of Art in Identity - Princeton Scala Conference","start":3592.77,"end":3635.71,"speaker":"Rj Snell","text":"And then very briefly, the tabernacle that you referred to, Lord. Rabbi Jonathan Sacks used to use the image of the tabernacle in a very interesting way. He would say the story of creation in Genesis 1 is very short. The story of the creation of the tabernacle is very long. It goes on and on. And his take was, it's very easy for God to make a home for us and very difficult for us to make a home for God. But that the story of the tabernacle was in some ways the story of the formation of the Hebrews themselves as they made it. But then he would also remind the reader, but of course, there had been a story before of God making the people. So what is it that we're remembering now if the break is so severe? And are the arts really up to the task?"}
{"episode_id":"SW - #300 - 2023-08-11 - The Role of Art in Identity - Princeton Scala Conference","start":3638.83,"end":3851.4,"speaker":"Jonathan Pageau","text":"No, I don't think the arts are up to the task. If you think of it in the political realm, there's no way. It's not possible. You can really understand it. If you want to understand what's going on, you can understand a culture in what it celebrates. If you want to know where a culture is, just look at what it celebrates, and then you will see what's going on in that culture. And we could say in some ways that if you think of a traditional church of, like, a medieval Gothic church, you had the altar in the center, and then you had the. The nave and the narthex, and then outside you have the gargoyles and the weirdness. And it's actually, you know, we looked at the manuscripts yesterday, and in late medieval manuscripts, they had that very structure in the manuscript itself, where in the middle of the manuscript, you had even a sacred image. And then on the outside and on the margins, you had even sometimes quite lewd and, you know, vulgar or humorous or kind of crazy images of mixtures of different animals and. And all this stuff. And so, you know, there's a sense in which our whole culture right now is like worshiping the carnival. The best way to understand it, it's like we're worshiping the gargoyles, like all the idiosyncrasy. All the strangeness and. But it's important to understand that the carnival has a role. The carnival isn't bad. The carnival is good. We need the carnival. Purim is like a celebration in the Bible and we have Mardi Gras, we have carnival in the orthodox tradition, right? So there's nothing, there's nothing wrong with carnival. It's always about its place, right? And there's nothing. And the gargoyles are fine if they're in the proper place. Now if we flip it and then we take the gargoyles and put them on the altar, right? Then you have the problem of the abomination, right? You have this. Then all of a sudden it becomes like a scandal to have that. And so our culture, through many, many iterations has come to a point where there is this like, worship of Carnival is the only way to say it in terms of entertainment, in terms of this kind of upside down and swirling culture, all of that is what carnival is. Think about just like a giant carnival wheel, just woo. Going around with clown music playing. That's what we celebrate. So I don't think politically it is possible to deal with that because politically it. The solution to that is not a great one. Because politically it's like, all right, well now we're going to just bring the knife down and the end of Carnival is Lent, right? Remember that? And so it's like we're going to fast now. And so that's a dangerous, it's like a dangerous move. When I showed you Alinsky and the Russian constructivist and the Russian artists, the same thing was happening in Germany. Things were chaosic, Dada and all this weird stuff. And then the knife came down. And what you have after that is a kind of authoritarian reaction to the carnival. And honestly, I don't think politically it's a solution. That's why I think the solution is a religious one. There's no other solution. The solution is to turn our hearts towards God, to become saints, to become the thing that we're talking about, to live it out in our families, to live it out in the world around us. And to know that, that, you know, that remnant, whatever, however it looks, you know, it will ride the ark through the waters. And to me that is really, you know, and I'm not against political action. I think political action is fine. But I don't think that. I really don't think the solution ultimately is there."}
{"episode_id":"SW - #300 - 2023-08-11 - The Role of Art in Identity - Princeton Scala Conference","start":3860.54,"end":3894.09,"speaker":"Margarita Mooney Suarez","text":"Thank you, Jonathan. I wanted to just continue with this conversation. If you could perhaps say a little bit more about following on RJ's question about the Civic. So the solution is not a political solution. It's turning us back to God. But then could you talk us through what that would look like? Right, if we turned back to, to God and then that specifically, you mean. Yeah, well, because I think the implication was that if we turn back to God, it'll have an influence on the Civic."}
{"episode_id":"SW - #300 - 2023-08-11 - The Role of Art in Identity - Princeton Scala Conference","start":3895.05,"end":3999.77,"speaker":"Jonathan Pageau","text":"I'm fine to talk about that. One of the problems we're facing right now, especially all you in America, I'm Canadian. It's weirder, but it's different, is that one of the problems we have is that if we don't have the top place, which is held by the divine Logos, all we have are idols. And so one of the things that's happening is that we expect the. We expect the founders of your nation, we expect the important people that have led to important historical transformations to be God. That's what we expect. Because the problem that's happening is people are seeing their sin and then they're freaking out like they're sinners. Destroy the statue, right? And that's the problem. That's what happens, like when things fall into the political sphere. That's what happens, right? Those statues of Stalin and of Lenin, they are gods for all intents and purposes. They are the highest point of attention. And so this is the problem. Now, if I think the medievals had a really interest, had an interesting way of seeing it. You know, they had this whole tradition they called the nine Worthies, where they would celebrate the people, the ancients of the past. And there were a certain amount that were like from the Old Testament. And then there was pagans and there was people in their own age. And, you know, when they celebrated Alexander, they would say, this is why we celebrate Alexander, and these are his sins. Right? This is why we celebrate this person, and these are his sins. But it's like, yeah, that's it. That's what it means to be human. But that is also because our highest point of attention was beyond those people. It wasn't a kind of worship of the political leader. It was something which moved beyond it."}
{"episode_id":"SW - #300 - 2023-08-11 - The Role of Art in Identity - Princeton Scala Conference","start":3999.77,"end":4067.99,"speaker":"Margarita Mooney Suarez","text":"So could I ask you maybe a follow up to that, Jonathan? We had a conversation on YouTube a while ago about Mary, the mother of God. And I've been teaching a class on ecumenical devotion to Mary here at Princeton Theological Seminary. And I taught that class because there seemed to be a renewed interest among my Protestant students to think about Mary. Mary in Revelation, Mary in Scripture. And then I had a local artist who's here with us Today, Juana Belcha, whose art is in the room, come give a presentation on prototypes of Marian art. And, boy, the students were just fascinated by the images. And so, as I've taught this class, I've actually begun to wonder if maybe, you know, we said. You just said a moment ago, the answer isn't purely political. I wonder if part of the enduring attraction of Mary the Mother of God, is that it connects the liturgical and the charismatic, the church and the home, and that maybe what liturgical art can do, and proper veneration, including veneration for Mary the Mother of God, it can make the faith that you're talking about personal. And from the home, then can outflow the grace to build community."}
{"episode_id":"SW - #300 - 2023-08-11 - The Role of Art in Identity - Princeton Scala Conference","start":4068.23,"end":4068.55,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #300 - 2023-08-11 - The Role of Art in Identity - Princeton Scala Conference","start":4068.55,"end":4105.76,"speaker":"Margarita Mooney Suarez","text":"I mean, I think sometimes people want to build community with a strategy. Anyone ever been to a community building strategy session? Yeah. I mean, you all laugh, right? Community has got to be built person by person. And I think somehow I'm just conjecturing here that Mary the Mother of God represents that personal person to person, that what happens in Sunday worship has got to be taken into the home, into the place of the messiness of home life, with pain and suffering, but also celebration and joy, and from the church to the home and then back out into society. So is that my question, I guess, is Mary the Mother of God?"}
{"episode_id":"SW - #300 - 2023-08-11 - The Role of Art in Identity - Princeton Scala Conference","start":4107.6,"end":4210.96,"speaker":"Jonathan Pageau","text":"No, I think for sure the Mother of God is important, especially even because she is, in some ways, that body. Right. She's that place where it comes together in the sense that she's that gathering, you know, you saw in the image of Ascension. It's. Well, it's beautifully represented where she stands in the center and all the disciples gather around her. It's like she's this mother that is kind of gathering them inside. And so she is, of course, an image of the Church, like the culmination of the Church on earth, you could say. I don't know how to say it in the right way. And then also, she's also been very much the great protector of cities, by the way, because she is also an image of the city or the common or the coming together of people. And so when the. The barbarians would come to the gates of Constantinople, they would take the icon of the Mother of God and they would parade on the walls with that icon. And there are many examples of, you know, them just turning back or all kinds of miraculous stories. And then, of course, the image of the protection of the veil, which some of you might have seen, where there's a kind of a version of that in Catholic art, too. You see The Mother of God standing above the church and she's holding a veil which protects, you know, the common, protects the unity in the Catholic tradition. You have this image of her with her coat, like her vestment open, and then all the people that are gathered inside her. And so I think that definitely there is something in order to embody and in order to be able to understand the common and the places where we can recognize each other and recognize each other as participating in something that binds us. That her example and her. Her guidance is you."}
{"episode_id":"SW - #300 - 2023-08-11 - The Role of Art in Identity - Princeton Scala Conference","start":4210.96,"end":4217.32,"speaker":"Margarita Mooney Suarez","text":"Thank you, John. I'm keen to keep us on time. So if RJ Has a brief question, he can go. Otherwise, I'll wind it down."}
{"episode_id":"SW - #300 - 2023-08-11 - The Role of Art in Identity - Princeton Scala Conference","start":4218.36,"end":4220.36,"speaker":"Rj Snell","text":"Well, she is the patroness of the Americans."}
{"episode_id":"SW - #300 - 2023-08-11 - The Role of Art in Identity - Princeton Scala Conference","start":4220.6,"end":4221.4,"speaker":"Jonathan Pageau","text":"Oh, yeah, yeah."}
{"episode_id":"SW - #300 - 2023-08-11 - The Role of Art in Identity - Princeton Scala Conference","start":4222.2,"end":4331.02,"speaker":"Margarita Mooney Suarez","text":"Well, and I'll just say. I mean, I began this morning, you know, and I talked to you about how when I visited my mother's home village in Cuba, that the villagers came out, and after 40 years, they had preserved the memory of the people that had lived there before. Before. And the stained glass windows with the Blessed Mother and roses. Not only had the church been desecrated, the rose garden that my mother remembered was gone. Right. If we don't protect our churches and our sacred art, people stopped planting roses, you know, and then after time, you know what else happened? They stopped working. Because if we tell people that they're only made to work and they're not made to garden and they're not made to worship, people in Cuba stopped working. And I asked myself, these people have preserved for 40 years. These windows. What have I preserved for 40 years? You know, the only thing I could think of that I've not thrown away in all my moves. Well, two things. Photographs of family members I have preserved and an icon of the Mother of God that I got when my best friend got married in Cyprus. And I've taken that icon and I've kissed it. I've slept with it when I was scared or upset. And it comes with me on every single trip. Photographs of my family and an icon of the Mother of God help me connect, remember past, present, and future. Help keep me grounded to those mysteries that happen in the sacred liturgy. And remind me, as you know, Aiden talks as if it's so easy to live up to our vocation as human beings. I often want to, you know, pull back and just kind of put the covers over my head. But when I have that icon with me and I have the memory of the people who've gone before me, I remember that my life has a purpose and that I'm participating in something, and I'm not doing it alone. Thank you, Jonathan."}
