{"episode_id":"SW - #411 - 2025-09-25 - Dr. Michael Levin Dr. John Vervaeke - Brave New Biology - Intelligence Trumps DNA","start":0.16,"end":59.17,"speaker":"Laura Diaz","text":"Tucson, the weight is over Mediweight loss. They're officially open on North Oracle road. That's right. No more counting down the days. You can walk in right now and start your journey to a healthier you. Hey, it's Laura Diaz from iheartradio and you can trust me. This isn't just another weight loss clinic. I know that because it's where I lost weight safely with real medical support. GLP1 medications. You can see them everywhere online right now. But the truth is your health shouldn't be a DIY project ordering these meds without the professional guidance. It can lead to dangerous mistakes, wrong doses, no oversight, and serious risks at mediweight loss. I got the same medication but with a customized plan, weekly check ins and a licensed physician guiding me every step of the way. And the cost? The same as those risky online options. Tucson, your moment is here. If you're ready to take control, feel better and lose weight the right way, mediweight loss is ready for you. Walk in, get started and see real results. Call or visit mediweightloss.com to learn more and book your free consultation today."}
{"episode_id":"SW - #411 - 2025-09-25 - Dr. Michael Levin Dr. John Vervaeke - Brave New Biology - Intelligence Trumps DNA","start":59.25,"end":135.66,"speaker":"Michael Levin","text":"That's mediweightloss.com I look forward to a class in school where the young kids learn about us the way that we learn about cavemen. When we read that, oh my God, you used to step on a sharp stick and get sepsis and die. And that was the end of that. And they would learn about us and they would say, wait a minute, you're telling me these people, they would have to live their whole life in whatever body they randomly got at birth. So they just got some random cosmic ray would hit their embryonic cells and they would be crippled or they would have whatever their limitations of IQ or whatever, they would just have to stay in that body and there was nothing they could do about it. And they would have to kill other things to eat just to survive. These are all crazy. These are a mature species, shouldn't be doing any of this. And I feel like if in the future when they look back, they this is going to seem ridiculous. It's going to seem crazy that our lives and the meaning and the achievements of our lives would be limited to things that we had absolutely no control over because we didn't know what to do. The cells seem to poop out after 80 or 90 years. We don't know what to do. And that's it. That's how we were born and that's how we stayed. To me, this is going to seem the kids aren't even going to believe that this is how we lived our lives."}
{"episode_id":"SW - #411 - 2025-09-25 - Dr. Michael Levin Dr. John Vervaeke - Brave New Biology - Intelligence Trumps DNA","start":147.54,"end":197.47,"speaker":"Jonathan Pageau","text":"This is Jonathan Pedro. Welcome to the symbolic world. So, hello everyone. I am here with John R. Vacci that all of you know very well. But I'm also here with Michael Levin. It is the first time that I meet him. For years now, people have been telling me, you have to talk to Michael. You have to talk to him. You have to talk to him. And so finally, with John's help, we were able to connect and hopefully we can have a productive discussion. Michael runs a research lab at Tufts University. He's doing some research, really amazing things that we're going to talk about obviously in the podcast and that connect to, obviously to the things that John and I care about. So, Michael, thank you for accepting this."}
{"episode_id":"SW - #411 - 2025-09-25 - Dr. Michael Levin Dr. John Vervaeke - Brave New Biology - Intelligence Trumps DNA","start":197.63,"end":204.03,"speaker":"Michael Levin","text":"Yeah, thank you. It's very nice to meet you. And yeah, John and I have had many conversations and he said I should come on. So let's do it."}
{"episode_id":"SW - #411 - 2025-09-25 - Dr. Michael Levin Dr. John Vervaeke - Brave New Biology - Intelligence Trumps DNA","start":204.83,"end":205.31,"speaker":"John Vervaeke","text":"Yes."}
{"episode_id":"SW - #411 - 2025-09-25 - Dr. Michael Levin Dr. John Vervaeke - Brave New Biology - Intelligence Trumps DNA","start":205.63,"end":223.24,"speaker":"Jonathan Pageau","text":"All right. So, I mean, I think we could maybe start and maybe you can explain briefly what it is that you do, especially in some ways, what are the things that you're bringing to the table that have been surprising in terms of the system that you're discovering and that you're implementing on the biological world."}
{"episode_id":"SW - #411 - 2025-09-25 - Dr. Michael Levin Dr. John Vervaeke - Brave New Biology - Intelligence Trumps DNA","start":223.88,"end":440.43,"speaker":"Michael Levin","text":"Yeah, well, there's kind of many ways to describe it. I think I'll try this one for today. If you look from the outside at what it is that my group does, and I run the Allen Discovery center at Tufts University, and we have applications that range across birth defects, regenerative medicine, meaning trying to repair really drastic injuries and aging and things like that, that we have applications in cancer, in bioengineering. And so one way to look at this as really pretty normal science, we publish in all the normal scientific journals. All that aspect of it is conventional. But one of the interesting things that I think is an unspoken assumption in that work in general in the community is, is that there's a certain set of formal models. And these formal models come from chemistry, they come from some math and some physics. And there's this notion that those formal models, specifically formal models that people associate with mechanisms or machine like processes. Right. And so we'll have to define that word, but fundamentally it's defined by a set of structures like things around Turing machines and these tools of computation. The idea is that those kinds of things are going to be sufficient for the life sciences. So this idea that those formal models, they've done great for us in physics, they've done great for us in engineering, and all of that, and then if we just keep using those kinds of models, we are going to get what we're looking for in life sciences, which is to understand where we come from and why. And then more importantly than just explaining the stuff that's already happened is facilitating the research going forward and really gaining control of our embodiment and repairing all these horrible afflictions that plague living systems. And so one of the things that I'm fundamentally interested in, and this has been kind of the central point of my career, is understanding embodied minds. So for me, I want to very much help patients, that's for sure. But also the way we use things like regenerative medicine and bioengineering and so on is as model systems for testing our approach to various very ancient philosophical questions. So there are some really deep questions about what it means to be a mind in the physical unit, how minds can be composed of parts, so collective intelligence, that kind of stuff. So my claim is that you can't just decide that chemistry and those kinds of formal models are the right way to go. You have to do experiments, and you have to, in fact, consider what you might be missing with those models and try other tools that we have in our toolbox to see if they might actually be more appropriate. Some of those tools come from behavioral science, right? And so then what we do is apply some of these things that are typically used with brainy animals or, you know, the subjects of behavioral science. And we. And we find that, hey, wait a minute. Actually, those tools give you some really good advantages in dealing with molecules and with cells, with molecular networks, and even with some really weird things that we can talk about that aren't even stranger than that. And so that starts to open up some really fundamental questions about how we've been thinking about cognition, intelligence, and how far. How far in terms of diversity of embodied minds can we go? So that's what my group does, is it seeks to understand different ways to address our mind blindness and what I think of as our very limited ability to see other beings that are not like ours, that are not like us."}
{"episode_id":"SW - #411 - 2025-09-25 - Dr. Michael Levin Dr. John Vervaeke - Brave New Biology - Intelligence Trumps DNA","start":441.31,"end":463.37,"speaker":"Jonathan Pageau","text":"So maybe you can tell people just a little bit about the results that you've been having. Some of the experiments you've been, that you've been running and that you've been, I mean, that are giving measurable results that are, at least to me, when I first started seeing them, just completely astonished me. I couldn't believe some of the things I was seeing. He give some examples of how that that lands in practice, and it'll help People understand why, why this is so important."}
{"episode_id":"SW - #411 - 2025-09-25 - Dr. Michael Levin Dr. John Vervaeke - Brave New Biology - Intelligence Trumps DNA","start":463.69,"end":682.05,"speaker":"Michael Levin","text":"Sure, sure, yeah. I'll mention a few things. One, one important thing to put this, all this in context is that there's a, there's a, there's a certain game that tends to get played, which is that we will, we, we have discovered something. And I describe it and then people will say, well, that's consistent with chemistry and physics. That doesn't prove anything. And so my, Let me be very clear about my claim. My claim is not that we've discovered some sort of magic underneath that is inconsistent with physics. That is not what I'm saying in the slightest. What I'm saying is the reason that you're, that people are saying this now after we've discovered the thing that wasn't discovered before, is that it's not just this. The task here is not to just find consistency when somebody does something new. The thing is to find new frameworks that help you find the new thing. It's not enough to look backwards and say, well, yeah, I suppose I could tell a biochemical story about this. Of course you can. It's not going to be fairies underneath. It's always good. If you want to look underneath and tell a biochemical story, you always can. But the question is, why didn't that biochemical story get you to this discovery? And what other stories are needed to add to our toolbox? Okay, so some simple things that we found. One of the big things that we've been studying is how memories exist in all kinds of living material that is not brain. And so what we've discovered, for example, is that the standard picture of morphogenesis or embryonic development or regeneration. So basically cells getting together to build complex structures. Is that the standard version of. Okay, the cells follow simple rules. And we all know there's systems where if you follow a bunch of simple rules, something very complex will happen. That's kind of a. And people call this emergence, this feed forward process. You sort of turn the crank and something emerges. Well, we found out that sometimes that's what's happening in biology, but other times there's a very specific goal directed process. When I say goal, I don't mean human level purpose as in I know what my goal is. I don't mean that. I mean goal in the sense in which your thermostat has goals or your self driving car has goals, or a guided missile has goals. In other words, there's an error minimization loop where the system represents some kind of state and it has different degrees of Ingenuity to get to that state. Even if things go wrong or something, things change or whatever. So we found that biology actually stores set points or morphological goals and we can rewrite those goals. And that cells are basically a collective intelligence. Not just your neural cells, like we all know, that's a collective intelligence that helps make you. But all cells can make a collective intelligence that can reach certain kinds of goals and you can rewrite those goals, which is amazing because what we found is that those goals are encoded bioelectrically looking backwards, not such a shock, because, you know, this is how our brains work. Turns out that's a much more ancient system. So we can do things like you take a flatworm and the flatworm is regenerative, so you cut it into pieces, and every piece makes one head, one tail, very reliably, and you get your worm back. So it turns out that if you look, there's a bioelectrical memory in the tissues that tell you how many heads a worm is supposed to have. And we can rewrite that memory without touching the DNA. This is not about the hardware, this is not about the genetic hardware. This is about the memories that guide the problem solving intelligence of the cells. And you say to those cells with an interface that we worked out. No, actually a good worm should have two heads. And then guess what they build? They build two heads. And now it's super cool. You can cut it into pieces and those pieces will forever, as far as we can tell, it's been what, 20 years that we've been doing this. Those pieces will continue to make two headed worms."}
{"episode_id":"SW - #411 - 2025-09-25 - Dr. Michael Levin Dr. John Vervaeke - Brave New Biology - Intelligence Trumps DNA","start":682.13,"end":688.69,"speaker":"Jonathan Pageau","text":"Oh, so if you have a two headed worm and you cut that one into two, then the part will continue to make two headed worms."}
{"episode_id":"SW - #411 - 2025-09-25 - Dr. Michael Levin Dr. John Vervaeke - Brave New Biology - Intelligence Trumps DNA","start":688.69,"end":828.9,"speaker":"Michael Levin","text":"Correct. That lineage. You have now made a lineage of two headed worms that will forever be two headed worm. And by the way, if you sequence it, genetically sequence it, you will be none the wiser about it. Because we haven't touched the genome. The genome is completely normal. So it's invisible to the standard methods of molecular genetics. So we can do that, we can alter these kinds of things in software, as it were. We've shown that certain kinds of birth defects, and this is in animal models, this is not in humans yet, but we're going hopefully to the clinic at some point. We can repair certain really nasty kinds of birth defects by reminding the cells again through this bioelectric interface, reminding the cells what is the pattern that they're supposed to be building. So we can override certain kinds of birth defects. We can create new organs where they don't belong. So we've made tadpoles with eyes in their guts and things like this where you can say to the cells, build an eye. And this is important. When we do this, we don't micromanage the genes, we don't micromanage the cells. We figured out a message that says, build an eye here. And the reason that works is because we're dealing with an agential material. It's a material that I don't have to be as an engineer. I don't have to be in charge of everything. It has competencies. All I'm doing is plugging into those competencies. And I. And if I. If I can speak the language that it understands and if I'm convincing, because that's a key part of this. You have to convince the material. This is not. You know, there's ways that it will ignore you. If you do it wrong, it'll ignore you. So you have to be convincing. And then you say, build an eye here. That's what it'll do. It'll build an eye. We've done normalization of cancer. So injecting nasty human oncogenes into the frog model. Normally they make tumors. Basically a dissociative identity disorder of this collective intelligence. And we could talk about what I mean by that. But you can reverse that by artificially forcing the cells into a particular bioelectrical state. And then you've normalized the tumor. The cells will go on to do normal, build healthy organs and do normal things. And even though the oncoprotein is blazingly strongly expressed, and I guess the final thing I'll mention, we've done induction of regeneration. So allow animals that don't regenerate to grow their legs back. And we've made some synthetic life forms that are made of living cells, but in a form and function that has never existed on earth before. These are some of the things that we work on."}
{"episode_id":"SW - #411 - 2025-09-25 - Dr. Michael Levin Dr. John Vervaeke - Brave New Biology - Intelligence Trumps DNA","start":831,"end":872.31,"speaker":"Jonathan Pageau","text":"Yeah. And so, I mean, this is. To me, it's. It's amazing. I mean, it's amazing in the sense that this. This idea that. Because we. We have to get to the right terminology. And so you. You use the word memory, okay. And when you mean what you mean by memory, and you relate the met the notion of memory to. To purpose, right? Like there's a goal and then there's a. That goal produces a memory. Because we always think of memory as something in the past. But I keep telling people that actually a goal is a type of memory because you're always aligning yourself towards that goal. You have to remember what you're doing, you know, as you're moving towards the goal. Is that what you mean when you use the word memory?"}
{"episode_id":"SW - #411 - 2025-09-25 - Dr. Michael Levin Dr. John Vervaeke - Brave New Biology - Intelligence Trumps DNA","start":872.79,"end":899.53,"speaker":"Michael Levin","text":"Well, I agree with everything you just said. A goal I do think is a kind of memory that looks into the future. But there are other kinds of, there are many different kinds of memory and there are other kinds of memory that don't involve goals. Right. So there's habituation, sensitization. They're very simple kinds of memories that are not forward looking like that. But memory is a requirement, I think, for significant goal directedness. You have to remember what your goal is, otherwise it's not going to happen."}
{"episode_id":"SW - #411 - 2025-09-25 - Dr. Michael Levin Dr. John Vervaeke - Brave New Biology - Intelligence Trumps DNA","start":900.09,"end":911.53,"speaker":"Jonathan Pageau","text":"And so when you say that you give, let's say you give certain being, you reprogram their memory. Like what type of memory are you talking about here?"}
{"episode_id":"SW - #411 - 2025-09-25 - Dr. Michael Levin Dr. John Vervaeke - Brave New Biology - Intelligence Trumps DNA","start":912.39,"end":1014.28,"speaker":"Michael Levin","text":"So there's two. Okay, in the experiment you're talking about, so there's a one headed worm. And we've created a technology that is kind of similar to what the neuroscientists do when they try to scan your brain and guess what you're thinking of, you know, this neural decoding kind of thing. So we have a technology whereby we can look at the cells of the planarian and we can see the visually. And we've made videos like anybody can see these pictures and videos now, the bioelectric pattern that encodes for the collective intelligence the answer to the question how many heads should I be building? Because all of this stuff, when you're injured, you have decisions to make. What are we going to build? Are we going to build anything? Should we grow in what direction? There are many decisions to make. There's a particular pattern that says how many heads we are going to build. And what's important is that it's a homeostatic process. Because until that goal is satisfied, the cells are going to work really hard. They're going to keep working like your thermostat. It's going to keep working until the error is within acceptable bounds. So we see that pattern that says one head, one tail. And we figured out a way to rewrite it. And so we go in and we rewrite it and we say two heads. And the ultimate goal of the regenerative medicine side of the lab is to be able to write any pattern you want. So complete freedom of embodiment. So first to rewrite all the normal human patterns. So you've lost a finger or you've lost an eye, or you need a new liver or whatever. It is. Here is the pattern that will make the cells grow that for you from scratch every time. That's the goal. Then ultimately to be able to say new patterns, five fingers is good and all that, but what if I wanted something else? Ultimately you could have whatever, but that's the idea, to be able to communicate your goals to the collective intelligence of the cells in a way that they will then build whatever you want them to build."}
{"episode_id":"SW - #411 - 2025-09-25 - Dr. Michael Levin Dr. John Vervaeke - Brave New Biology - Intelligence Trumps DNA","start":1016.76,"end":1041.78,"speaker":"Jonathan Pageau","text":"In this vision, the genetics, they become a kind of like bound potential that the, the, these patterns are tapping into. Because I imagine there's a limit, right? You can't, you can't. How can I say this? Like, you can't make, be careful, you know, grow wings, let's say, like you can't make a flat. Or maybe. I don't know. I don't know how far it goes, but."}
{"episode_id":"SW - #411 - 2025-09-25 - Dr. Michael Levin Dr. John Vervaeke - Brave New Biology - Intelligence Trumps DNA","start":1041.86,"end":1107.52,"speaker":"Michael Levin","text":"Yeah, yeah, that's, that's a good question. So, so that's a good question. So. So you're asking if the morphogenetic machinery is universal and we don't know yet. The real answer is we don't know. But I'll tell you what. I think there is a fundamental problem, which is that the hardware does constrain some things you can do. So, for example, if in the planarian genome there are no genes that will make hard materials, right? So there's nothing to make bone or any of that stuff. No amount of bioelectrics is going to make that thing grow. Something that it doesn't chemically is not able to do, however, maybe we're not sure, but I suspect that's a reasonable limit. However, other than that, my strong suspicion is that it's universal. So if you wanted to have wings and you had the hardware, you were capable of making the molecules needed for whatever your wings are supposed to have, I bet you could have wings and a propeller and whatever you want as long as the hardware is important. But boy, I don't think it is as limiting as being people think it is."}
{"episode_id":"SW - #411 - 2025-09-25 - Dr. Michael Levin Dr. John Vervaeke - Brave New Biology - Intelligence Trumps DNA","start":1110.32,"end":1177.74,"speaker":"Jonathan Pageau","text":"So, yeah, this is very, it's, this is very scary. I mean, it's, it's exciting and it's scary. You know, the, so the, the, I mean, the thing that I'm interested in obviously is talking about patterns. So have you this type of, of idea? Because it does seem like it's something like a new, like it's kind of Platonic, it's, it's kind of Aristotelian platonic. You know, there's this. You have a set of bound potential that's quite malleable. You know, and then you have a form, you have information that is, that is in some ways calling it or helping it know where to direct its energy towards, in what direction. And then that's creating this union between the pattern and the, the embodiment. Like if you, if you tried to put in a pattern that didn't, that couldn't be realized. Let's say if you tried to force a good example, again, like you said, you have, if the genetic structure can produce hard material and you tried to use some pattern or try to force a pattern on it, then it would just ignore it or it would just not work. Like, what would happen?"}
{"episode_id":"SW - #411 - 2025-09-25 - Dr. Michael Levin Dr. John Vervaeke - Brave New Biology - Intelligence Trumps DNA","start":1178.54,"end":1536.2,"speaker":"Michael Levin","text":"Yeah, well, let's, let's take a step back into the. Because you've opened a very big kind of issue here with these platonic patterns. So look, if we had done this a year and a half ago, I would not have been talking about this at all. I've been thinking about this for decades, and I had not broached the topic of platonic patterns until this year. And that's because I think it is now actionable. In other words, we're now to the point where we can actually make useful progress and it's time to test out some of those ideas. And the reason is, among other things, is that let's just ask the question of where do these patterns come from? So we look at an early. Like, for example, one thing that was discovered in my lab by Danny Adams years ago is there was this thing we call the electric face. And it's literally the fact that when you look, when you do the electrical profiling of an early embryo, long before it has a face, okay, what you can see in the electrical pattern is something that looks like a little face. It's like a little pre. Pattern, a scaffold. Here's where the eyes are going to go, here's where the mouth is going to go. Here, it's all there. So same thing in the flatworm and so on. So one thing you might ask is, okay, but where do these patterns come from? And so the standard answer is, well, they come from selection. In other words, for eons, all the other. There were all kinds of patterns. All the other ones died out. They were, they weren't as good. So now, now you get this. That's the, that's, that's the standard answer. So in the last few years, what we've done in our lab and other people have done relevant things too, but they just don't, they don't sort of put it this way. We've made things like xenobots and anthrobots. These are living constructs that are made from standard cells. We do not touch the DNA. We don't put any synthetic biology. There's no scaffolds, the 3D printed anything. These are stock hardware. So standard cells. And what we found is that if you give them a chance to kind of reboot their embodiment, they make novel creatures that have new behaviors, new patterns of gene expression, new form and new physiology, and new capabilities that don't look like anything that we've had in our evolutionary history. And they do this immediately out of the box. You don't need to train them to it, you don't need to force it. People say, how did you make them? I say, with all due respect to the hard working scientists in our lab, we barely made them. They sort of make themselves. What we did is we facilitated some of these things to come forward. And now I think we have to. Now there's an important question which is information costs energy to compute. And if you ask when did we compute human form and when did we compute the frog form? We know the answer. Well, for millions of years of the genome bashing against the environment and sort of though that's when the computations were done. When were the computations done to make xenobots and anthrobots? There's never been any selection pressure to be a good anthrobot or a good xenobot. Okay, and, and if you, and if you say that, well, they sort of, the genome sort of learned it at the same time as it learned to be a frog or a human. Well, that undercuts the whole point of, the specificity of the theory of evolution is you're supposed to be able to explain the things you see here by a specific history of how you got here. If it, if that history is not a good clue, then you know, what are we doing here? So now it becomes time to ask a very simple question. Do you want to be pessimistic? Which I think it, this view is, which is the standard view. It's a very pessimistic view which says these are emergent phenomena. They're surprises that we didn't see coming. They come for. They're just a random grab bag of facts that seem to hold in our universe. And when we come across them, we will write them down in our big book of cool emergent surprises and that'll sort of be that. And then, and then we have to. And then we, you know, some, at some point we'll find some new ones and that'll be great. Or I think the more optimistic, and I can't prove that this is correct, this is the metaphysics I prefer, the more optimistic view is what the Platonist mathematicians do, which is they say, right, there are tons of these weird facts about numbers and shapes and so on, but they're not a random grab bag of surprises. They are made by an ordered structure. They exist within an ordered structured space. We know that space is not the physical space because there's nothing you can do in the physical world to change Feigenbaum's constant and the, you know, the value of E and all this stuff, you can't change that from the physical world. It's a separate space of all these truths and we can have. And the reason I say it's optimistic is because once you posit that it's a structured space, you can have a research program to explore the space as the mathematicians do. You can systematically go from one to the other and find out, find new ones. And so the model I'm proposing, and I'll send you guys, if I haven't already, I'll send you a link to this where I'm organizing an asynchronous symposium on the Platonic space. We have a bunch of computer scientists and mathematicians, and I did the first talk on biology and so on, where we'll be talking about this idea that there is this structured space of patterns. Some of these patterns are the low agency things that mathematicians study. So you might say that mathematics is like the behavioral science of kind of simple inhabitants of that space. But some of those patterns, I think, and this is kind of like a crazy, you know, sort of controversial claim that I wouldn't have made, you know, until recently. I think that some of the more complex high agency patterns from this space are behavioral propensities, AKA kinds of minds. I think that's what minds actually are, is that they're actually the inhabitants of that space. And so you get forms of forms that ingress into the physical world. Some of these are shapes of morphogenesis, some of these are behavior, some of these are gene expression profiles or physiological circuits. But I am with you in the sense that I think very quickly, once you see what modern life sciences are doing, you get into this idea that, yeah, we're going to have to understand this. Not just the math, but the deeper contents of that space."}
{"episode_id":"SW - #411 - 2025-09-25 - Dr. Michael Levin Dr. John Vervaeke - Brave New Biology - Intelligence Trumps DNA","start":1538.12,"end":1538.8,"speaker":"John Vervaeke","text":"Can I say something?"}
{"episode_id":"SW - #411 - 2025-09-25 - Dr. Michael Levin Dr. John Vervaeke - Brave New Biology - Intelligence Trumps DNA","start":1538.8,"end":1539.72,"speaker":"Jonathan Pageau","text":"You want to say something, John?"}
{"episode_id":"SW - #411 - 2025-09-25 - Dr. Michael Levin Dr. John Vervaeke - Brave New Biology - Intelligence Trumps DNA","start":1539.88,"end":1749.37,"speaker":"John Vervaeke","text":"Yeah, yeah, I would. I think I agree, of course, with what Mike's saying. Mike and I talked about this. I think there's a further argument. Mike isn't building this argument, but I'm building this argument. I think when he moved that biology into a Platonic space or a neoplatonic space, the already existing convergences between his work and a lot of the work that's going on in 4e, cog, psi, and Mike is talking about kinds of minds now. So it's not inappropriate for me to do this. I think when you move into that neoplatonic space, you get a shared ontology that combine that biology and that cognitive science together even more tightly in a mutually informative and mutually beneficial fashion. So some of the action on the ground isn't just going to show up biologically. It shows up in new ways and new things we can do when we're trying to understand the nature of cognition. And for me, that's a very exciting thing. And one of the things that shows you, like Mike is talking about anomalies are building up. And we'll just note these in our notebook. Well, Thomas Kuhn says eventually the anomalies become systematic, and then you make a paradigm shift. And if the paradigm shift is fruitful, then it lives. And I think that's what we're on the cusp of right now. I think the anomalies have piled up too high. We're looking for a kind of systematicity, and I think Mike is pointing towards that. And I think a lot of my work, you know, coming out of four e, cog, psi and embodiment, you know, it converges in some very, very powerful ways. And I don't think I'm forcing anything on Michael. He's talking about collective intelligence. He's talking about levels. He makes use of Eric Holle's work, as I do. That's that vertical dimension, horizontally. He talks about the cognitive light cone, which is very overlapped. And he talks about it in terms of care, which overlaps a lot with the work I do on predictive processing and relevance realization. He talks about memory in terms of agency, where agency is expressed in terms of ingenuity, which is, are there multiple pathways from the initial state to the goal state, and can the system access multiple pathways? Like all of this just goes like this. And for me, that is a powerful reason. I think it is a good epistemological reason to pursue what Mike is calling the optimistic frame because its potential to massively, like, imagine if we really, really wed, which I'm trying to do. And I think Mike is trying to do biology and cognition Together in this way. I mean, then embodiment, look at terms that are becoming out here really powerfully. Embodiment becomes not just a phrase, it becomes a deep ontological principle that explains so much. Or Jonathan, something like logos. Mike is talking about information patterns and you have to persuade, and that makes things actualized in different ways. And so, Mike, if you want to object to anything I'm saying, please feel free. But I think another argument, an argument I make by making use of Mike's work is, look, this has the potential. We have a convergence from 4 EcoGSCI and Mike's take on biology. And they really open, overlap and reinforce and mutually, mutually afford insight. I think this is a powerful justification for pursuing this program, for taking it as something plausible, something that should be taken seriously within scientific and philosophical domains. So I just wanted to add that as an additional argument. And that's why I am so excited about Mike's work."}
{"episode_id":"SW - #411 - 2025-09-25 - Dr. Michael Levin Dr. John Vervaeke - Brave New Biology - Intelligence Trumps DNA","start":1750.09,"end":1848.93,"speaker":"Michael Levin","text":"Yeah, no, that's great. Nothing for me to complain about there. The only thing I would add is, is just that at the end, right before that, Jonathan was asking about, you know, what happens if you try to force the wrong pattern into the wrong embodiment. And I, you know, I view everything we do in the physical world when we make robots, cells, embryos, biobots, chimera, like whatever we make, I think these are interfaces. What we're making are the interfaces for these patterns. I don't think it's a matter of trying to cram the wrong pattern into the interface. I think it's a weird way of putting it, and I don't exactly know what it means. But my strong suspicion is that these patterns are kind of under positive pressure in the sense that you don't need to do much to get them to come through. You make an interface, there they are. And in fact, the key for us, I think, going forward, if we're going to survive as a species, you, is to get much better than we are now about what patterns do you get when you make specific kinds of interfaces. We make Internet of things, swarm robotics. We make social and financial structures. We never mind all the cyborgs and everything else. We make all these things. We have no clue what patterns we're picking up. And we may be picking up patterns that have never had embodiments. And I have a feeling that a lot of when we talk about AI and things like that, we're fishing in a pool that, that maybe has never been embodied on this planet. Maybe, although I doubt it, but maybe nowhere in the universe, you don't force these things in. You make an interface and then you better have some idea of what's going to show up is my. How I see it."}
{"episode_id":"SW - #411 - 2025-09-25 - Dr. Michael Levin Dr. John Vervaeke - Brave New Biology - Intelligence Trumps DNA","start":1849.49,"end":1898.35,"speaker":"Jonathan Pageau","text":"Because one of the things, I mean, as I'm listening to you speak, because if we're, if we're bringing up these types of languages, and I like how John mentioned the word logos, you know, at least in some Christian metaphysics, the ones that I care about, Saint Maximus the Confessor, especially the notion of form gets fused with the idea of logos and logos in the sense of reason, in the sense of purpose. Right. And so the form is actually purpose driven. It's not just like a shape that doesn't have any. It. It actually is actually something that leads you towards purpose. Which is why when we talked about the idea of memory and purpose, it really kind of lit me up that these patterns, they're active, right? They actively constrain reality towards the purpose that they pattern. And so to me, all of that makes sense."}
{"episode_id":"SW - #411 - 2025-09-25 - Dr. Michael Levin Dr. John Vervaeke - Brave New Biology - Intelligence Trumps DNA","start":1900.59,"end":1928.87,"speaker":"Michael Levin","text":"It's important. Right. Because that's a very important point. And in the talk. So in that symposium I put up last night, I put up an hour and a half talk about Platonic space and biology And I spent 20 minutes of that specifically talking about these patterns being goal states and not just, you know, here are the patterns that happen to show up. This is an actual goal state that a system, that an intelligent system is pursuing. I think that that's actually a very important feature of all this."}
{"episode_id":"SW - #411 - 2025-09-25 - Dr. Michael Levin Dr. John Vervaeke - Brave New Biology - Intelligence Trumps DNA","start":1928.95,"end":2106.03,"speaker":"John Vervaeke","text":"Yeah. Kevin Corrigan has made quite a significant argument about the ancient Greek notion of logos being understood. Much more like the way we talk about, you know, the system of constraints on feedback cycles within a dynamical system rather than just like connecting dots on a piece of paper. Right now I want to throw one potential fly in the ointment if I can, just because I want to see what both of you say about this. You know, and I've been talking about this. I was talking about this to Zevi Slavin about the work of a Jewish Neoplatonist called Ibn Gabiral and other people, and Whitehead too, is this. And Mike, you used a Whiteheadian term, so it's not. You talked about ingression. Right? Now, the thing that people often don't notice, you know, Whitehead said he's a Platonist and he is. But there's an inversion that's going on in terms of what classical Platonism looks like, because at the top is form and form is pure actuality and at the bottom is hula, it's pure potentiality. But when Whitehead talks about. Up here, he's talking about. He's talking about possibility, space and potentiality. Right. That gets loaded or ingress down to use the term you used. And it calls out from. Calls sort of causation up from the hula at the bottom, the matter at the bottom. And that's an inversion of the classical Platonic model. And why that's important, I think paradigmatically is because when we had the older model where it's actuality at the top, we tended to equate actuality with reality. In fact, we use the term synonymously. Our language. We'll say I actually love her or I actually. And we use it synonymously. But if you accept the inversion, then of course now you've got possibility, real possibility being constitutive of reality in a fundamental way. And I just want to note that although we're talking and we're using a lot of the Platonic language, and I'm very happy to be there, as you know, there's also an inversion that has occurred to my mind and I wanted to know what either one of you or both of you thought of that. Does that matter? Does it matter very much to either one of you? And what is the relate. How do we. I'm very much for reading these old authors, you know that, Jonathan. But you know, there's a hermeneutic thing here. There's a lot of similarities, but there's also this fundamental inversion. And so what we do there. And so who wants to. Sorry for putting."}
{"episode_id":"SW - #411 - 2025-09-25 - Dr. Michael Levin Dr. John Vervaeke - Brave New Biology - Intelligence Trumps DNA","start":2106.03,"end":2140.53,"speaker":"Jonathan Pageau","text":"I mean, I can start in the sense that I, I tend to think incarnationally. That's, that's the, that's my Christianity speaking or my Christian metaphysics is that I. And. And I'm maybe closer. Closer to Aristotle in that sense, which is that the, the. To me, the, the reality is the embodiment. That's the reality. That's where reality happens. That you have patterns and you have the, the potentiality into which these patterns can get embodied. But for something to be real, it has to be embodied because the."}
{"episode_id":"SW - #411 - 2025-09-25 - Dr. Michael Levin Dr. John Vervaeke - Brave New Biology - Intelligence Trumps DNA","start":2141.25,"end":2142.29,"speaker":"John Vervaeke","text":"But I have a problem with."}
{"episode_id":"SW - #411 - 2025-09-25 - Dr. Michael Levin Dr. John Vervaeke - Brave New Biology - Intelligence Trumps DNA","start":2142.29,"end":2146.21,"speaker":"Jonathan Pageau","text":"Pattern doesn't exist without, without its instantiation."}
{"episode_id":"SW - #411 - 2025-09-25 - Dr. Michael Levin Dr. John Vervaeke - Brave New Biology - Intelligence Trumps DNA","start":2146.37,"end":2152.48,"speaker":"John Vervaeke","text":"But, but how can you talk about what Mike is saying? The patterns have to be ordered and you know."}
{"episode_id":"SW - #411 - 2025-09-25 - Dr. Michael Levin Dr. John Vervaeke - Brave New Biology - Intelligence Trumps DNA","start":2152.56,"end":2153.04,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #411 - 2025-09-25 - Dr. Michael Levin Dr. John Vervaeke - Brave New Biology - Intelligence Trumps DNA","start":2153.2,"end":2158.56,"speaker":"John Vervaeke","text":"And the old way of ordering them was there was an actuality, the mind of God. And that's how you got around."}
{"episode_id":"SW - #411 - 2025-09-25 - Dr. Michael Levin Dr. John Vervaeke - Brave New Biology - Intelligence Trumps DNA","start":2158.96,"end":2164.88,"speaker":"Jonathan Pageau","text":"But I like actual. But pure actuality is not, Is not being like."}
{"episode_id":"SW - #411 - 2025-09-25 - Dr. Michael Levin Dr. John Vervaeke - Brave New Biology - Intelligence Trumps DNA","start":2164.88,"end":2165.36,"speaker":"John Vervaeke","text":"It's not."}
{"episode_id":"SW - #411 - 2025-09-25 - Dr. Michael Levin Dr. John Vervaeke - Brave New Biology - Intelligence Trumps DNA","start":2165.6,"end":2182.64,"speaker":"Jonathan Pageau","text":"It's. How can I say this? It's like in order. I think that the realest thing is the relationship between the two. Like the realest thing is when these forms, they embody themselves. That's the thing, at least, that I care about the most."}
{"episode_id":"SW - #411 - 2025-09-25 - Dr. Michael Levin Dr. John Vervaeke - Brave New Biology - Intelligence Trumps DNA","start":2182.88,"end":2219.92,"speaker":"John Vervaeke","text":"Okay, well, I want to hear what Mike has to say. I mean, because the model is very much like, to my mind, Alicia Guerrero's, where you have top down constraints and you have bottom up causation in a way where constraints are what patterns do is shape what is possible. They're shapings of possibility. That's how most mathematicians, Platonists, talk about mathematical formula or scientific laws. If you're a realist about those laws, they're not events, they're not actualities. They're constraints on what is possible for us. So they're the real shaping of real possibility. And they're top down and then bottom up."}
{"episode_id":"SW - #411 - 2025-09-25 - Dr. Michael Levin Dr. John Vervaeke - Brave New Biology - Intelligence Trumps DNA","start":2221.36,"end":2226.08,"speaker":"Jonathan Pageau","text":"If the constraint is a purpose, then it makes sense to me."}
{"episode_id":"SW - #411 - 2025-09-25 - Dr. Michael Levin Dr. John Vervaeke - Brave New Biology - Intelligence Trumps DNA","start":2227.77,"end":2228.25,"speaker":"John Vervaeke","text":"That's good."}
{"episode_id":"SW - #411 - 2025-09-25 - Dr. Michael Levin Dr. John Vervaeke - Brave New Biology - Intelligence Trumps DNA","start":2228.97,"end":2249.13,"speaker":"Jonathan Pageau","text":"But if the constraining of possibility is a purpose, and that purpose manifests itself ultimately in certain shapes, certain, certain directions, certain certain alignments, like all kinds of words we could use. I mean, I might not be using the right words for, for Michael, but. But then to me that makes sense."}
{"episode_id":"SW - #411 - 2025-09-25 - Dr. Michael Levin Dr. John Vervaeke - Brave New Biology - Intelligence Trumps DNA","start":2250.73,"end":2311.75,"speaker":"John Vervaeke","text":"Yes, I agree, but what I'm saying is we're opening up the kinds of things we consider when we attempt to give explanations. We're not just looking like in a Humean fashion for relations between events. We're also looking for constraints on what's possible because we now long. So what I'm arguing for is you can't be a nominalist about possibility anymore. You can't say possibility is just something we humans do, lack of knowledge. Possibility has to be real. The constraints have to be real because you have to be able to. If they're not, I mean, this is the. I think this is part of an implication of Mike's argument. Like there seems to be a real ordering and a real. I don't. I'm struggling for word, a real existence. In order to explain the radical novelty that he. Like there hasn't been some long historical process. You can't give a causal history for this. Right. But nevertheless, it's playing a fundamental role. Mike, maybe I'm misrepresenting you, but please."}
{"episode_id":"SW - #411 - 2025-09-25 - Dr. Michael Levin Dr. John Vervaeke - Brave New Biology - Intelligence Trumps DNA","start":2312.31,"end":2426.96,"speaker":"Michael Levin","text":"Yeah, really interesting question. So, three things I'd like to say. First, about the views of Plato and Whitehead and all of that. None of what I do is meant to stick closely to what any of these people thought, to whatever extent we know what they thought. And I thought about this really hard about the naming of this And I may at some point need to change the name. The reason I went with Platonic space is because it tied what I'm saying to a body of work among mathematicians where they know exactly what I'm talking about. That is, that is, that is really it. You know, other things that Plato may have thought about unchanging forms and all that I don't really, you know, go along with. And so, you know, within none of these things am I trying to stick close to any of that. Right. This. And so we can talk about how much of this, this I think is right or whatever. The second thing I wanted to say is in terms of constraints. So here's my thought on this. The kinds of things that are constrained by these forms, I think these are the things we generally call physics. In other words, hey, why do the fermions do xyz? Oh, it's because this mathematical structure has a symmetry that only allows what. Like that's, that's the constraints. What I think happens in biology, okay, there are some constraints, but I think it's much more than that. I think the things we call life and that we call biology are things that exploit and are potentiated by those forms, not just constrained by them. So the big thing, and we can talk about how I think biology exploits the hell out of a lot of free lunches that are provided by these forms so that it is no longer enough. If you're just talking about, about constraints, you're talking about the low end of my spectrum, which is machines and the kinds of things physics likes to study. By the time you get to the things biology likes to study, what you're finding is that these forms are not just constraining what happens, they're actually potentiating or greatly enhancing what can happen."}
{"episode_id":"SW - #411 - 2025-09-25 - Dr. Michael Levin Dr. John Vervaeke - Brave New Biology - Intelligence Trumps DNA","start":2427.12,"end":2442.86,"speaker":"John Vervaeke","text":"Right, right, I get that, Mike, but there's a problem here because they don't prototypically have the defining features of causal events. They don't have a definitive location or, or time. Right. And so talking about them as if they're causes is also equally problematic."}
{"episode_id":"SW - #411 - 2025-09-25 - Dr. Michael Levin Dr. John Vervaeke - Brave New Biology - Intelligence Trumps DNA","start":2443.02,"end":2504.19,"speaker":"Michael Levin","text":"So let's, so let's talk about this is really good. And I'm interested to see what, what you have to say about this. Chris, Chris Field said the same thing to me once, that it's really hard to think about these things as causes because causes are supposed to precede effects, for example, and if there's no. I don't know how to add a time component to this to the Platonic space, at least. Yet I agree. I, but I do think they're causal And I'll tell you how I'm using a slightly different emphasis for causation. I'm using the following. And I don't know who exactly this is due to, but it goes like this. You have two features and you want to know which one causes which one. What you do is you tweak this one and you see if this changes, and then you tweak this one and you see if this one changes. And the driver. Right. So what I'm looking for is to find out which one is the driver of the other one. And that's the causation. The causation is when you. If I. If I change thing A and thing B inevitably follow suit, then I can say that A is causal to B. What to do with time, I don't claim to know, but I'm interested in the functional causation."}
{"episode_id":"SW - #411 - 2025-09-25 - Dr. Michael Levin Dr. John Vervaeke - Brave New Biology - Intelligence Trumps DNA","start":2504.27,"end":2552.31,"speaker":"Jonathan Pageau","text":"And so in terms of time, it's not that. It's not that complicated because purposes are causes and you can't measure the purpose until you've reached the goal. And so the cause appears at the end in many systems because the purpose is drawing things into it. And then you only see its result once you've reached that reach there. It's like when you watch a movie and you. Let's say you watch Sixth Sense and you don't understand what's happening. And then at the end, it reveals to you what all of these things were doing. And once you see it, it becomes the cause of the movie. But it's not a cause like a billiard ball hitting another. I mean, it's a formal cause. It's a cause that is explaining the reason why all of these things are together in the first place."}
{"episode_id":"SW - #411 - 2025-09-25 - Dr. Michael Levin Dr. John Vervaeke - Brave New Biology - Intelligence Trumps DNA","start":2552.71,"end":2555.71,"speaker":"Michael Levin","text":"Yeah, I get it. And I agree, Mike."}
{"episode_id":"SW - #411 - 2025-09-25 - Dr. Michael Levin Dr. John Vervaeke - Brave New Biology - Intelligence Trumps DNA","start":2555.71,"end":2558.63,"speaker":"John Vervaeke","text":"The person is jsml. It's called the method of differences."}
{"episode_id":"SW - #411 - 2025-09-25 - Dr. Michael Levin Dr. John Vervaeke - Brave New Biology - Intelligence Trumps DNA","start":2559.19,"end":2658.93,"speaker":"Michael Levin","text":"Fantastic. Super, super. I didn't know that. Okay, that's great. So here's the kind of thing I have in mind for the. For the causation bit. This is just one of a million examples we could talk about. The cicadas come out at 13 years and 17 years. So you're a biologist and you ask, so why is that? And then you say, well, it's because they're trying to time their. Make sure that their predators don't time the cycles. Right. Because if it's 12 years, then every two years, every three years, every four years, somebody would be. And so you say, oh, that's amazing. So what Is it about 13 and 17? They say, Ah, these are prime. Okay. And so why specifically 13 and 17. And so now what's happened is you've left the realm of biology, you've left the realm of physics. Now you're in the math department, and they can explain to you why the distribution of primes is the way it is. And so now we have this situation where if the distribution of primes had been different, the cicadas would be coming out at a different time. But on the other hand, there is nothing I can do in biology and physics. I can tweak the constants of the Big Bang. Whatever I want to do at the physical world, I am never going to change the distribution of primes or the value of E or Feigenbaum's constant. So what I see as causation is simply this. I see that the patterns are determining aspects of the physical world, and I don't see any way for things we do in the physical world to feedback. Although there's a caveat to this. But that is what I see as the causation, that the influence flows, that if we want to understand what's happening here, the source is in these facts of mathematics and in facts of other things that are not mathematics. So that I think are actually psychology or whatever they are."}
{"episode_id":"SW - #411 - 2025-09-25 - Dr. Michael Levin Dr. John Vervaeke - Brave New Biology - Intelligence Trumps DNA","start":2659.65,"end":2769.57,"speaker":"John Vervaeke","text":"So I agree with you that there are determination relations. I guess I'm pressing on this because one of the classic problems, I mean, this is a standard trope in the philosophy of mathematics for Platonists, is accounting for the causal status. You can't seem to get any causal relation out of these things because they don't seem to bear a temporal or spatial location. Like, where is any of those functions? You just. Where are they? Like, are they over there? Like, no, they're nowhere, and they're everywhere. And they don't happen at a specific time or a specific place. And so I think I hear what you're saying, and this is why I want to press you, Mike, because I think something's happening. Let's take up your proposal because it's a really good one. Let's reserve constraint for something where we're just talking about. No, we have to give them their due. By the way, there's not only selective constraints, there are enabling constraints. So it's not just this. But you said it's more than that. I get there's a sense of almost an exploratory element to this. Is that fair? Okay, so constraint does not convey that. But, you know, classically. Cause doesn't either. And the stuff you're talking about doesn't have a lot of the Other features of cause. It sounds to me almost like. And Dennis Walsh is trying to do the same thing here, he's a philosopher of biology at the University of Toronto. Is to come up with, you know, that there is something other than what we mean by cause or constraints that we're talking about here that we. And this is why I try to invoke the. I think I mentioned it to you, the neoplatonic notion of a paradigmatic cause, which is not a formal cause, an efficient cause, a mechanical cause or a final cause. It's this accessing and downloading vertical kind of determination. Yeah."}
{"episode_id":"SW - #411 - 2025-09-25 - Dr. Michael Levin Dr. John Vervaeke - Brave New Biology - Intelligence Trumps DNA","start":2771.89,"end":2862.56,"speaker":"Michael Levin","text":"I like that a lot. And I agree with you in the sense that if the standard version of causation doesn't capture what's going on here, too bad for the standard version of causation, I mean, I agree, okay, it doesn't have a location, it doesn't have. Well, too bad, who cares? I think there's something much more important going on here. I think those kind of causes were worked out largely by people focused on building steam engines and things where this knob is over here, touching this thing and the gear. And this is why that kind of causation does not going to do us in the biological and the cognitive sciences. I don't think. And in fact I make the connection to. There was another case where this came up which is when Descartes sort of announced this idea of a non physical mind running the brain around like a puppet. The princess of Bohemia, I forget her name, wrote to him and said, well look here you said the non physical physical mind doesn't have a location and we have conservation of mass. How is that going to happen? And what I find really weird and I've been playing with this stupid idea of writing some sort of a fictional dialogue between the two of them that I think should have happened if it didn't happen. Because Descartes was a mathematician. What it seems to me he should have said is, excuse me, we have had since the time of Pythagoras and before that we have already had examples of non physical physical facts determining reality in the physical world. We've already had this."}
{"episode_id":"SW - #411 - 2025-09-25 - Dr. Michael Levin Dr. John Vervaeke - Brave New Biology - Intelligence Trumps DNA","start":2863.6,"end":2902.73,"speaker":"John Vervaeke","text":"Yeah, but. And your question is a good one, why doesn't he. Because he gets committed to a completely horizontal notion of causation. Yeah, that's committed to. And because there is the rejection of any verticality to ontology. There's a deep, there's deeper ontological moves that are going on that precludes him from continuing. Considering you're right, that answer should have been available to him, but he's rejecting any kind of Platonic verticality. And what I see you doing, and I think we're actually fleshing it out. That was an unintended pun. We're fleshing it out is like the strong need to bring a verticality back into our ontology in a deep way."}
{"episode_id":"SW - #411 - 2025-09-25 - Dr. Michael Levin Dr. John Vervaeke - Brave New Biology - Intelligence Trumps DNA","start":2903.13,"end":2975.09,"speaker":"Michael Levin","text":"Yeah. And specifically, I mean the kind of. Just to be clear, I'm not a philosopher. I don't. You know, I. The reason that I prefer this kind of version is driven by engineering. It's driven by simply by the following. The cause. When I'm looking for causes, I'm not looking to match any philosophical notion of causation. What I want as an engineer is where should I be looking in order to understand and control the system that I want to understand and control? And if the traditional notion of causation doesn't help me do that, then fine, then I'm not interested. What I want to understand is if I have a system that behaves in a certain way, whether it's cicadas that come out at 13 years, or whether it's a xenobot that does things that we didn't ask it to do, or a bubble sort that has side quests that are not in the algorithm, or these kinds of things that we study. If the answer lies in the properties of mathematical objects, then as far as I'm concerned, that's the cause I'm looking at. If somebody wants to come up with a different terminology for it, fine. But as an engineer, this is what I'm looking for. I'm looking to understand what is actually driving the thing that I'm interested in."}
{"episode_id":"SW - #411 - 2025-09-25 - Dr. Michael Levin Dr. John Vervaeke - Brave New Biology - Intelligence Trumps DNA","start":2975.17,"end":3027.89,"speaker":"John Vervaeke","text":"And I think you're completely epistemically virtuous. I'm not making anything, although I do think good philosophical argument matters too. But what I'm saying is, and you're basically doing. You're following the science, and I mean that in a good way, not the way that phrase has been used in the past, the recent past, but you're following the science, and it's basically leading us out of a framework that was given to us, a fundamental ontological, epistemological framework given to us by the Enlightenment. The framework called modernity, where we understand reality, we understand causation. This way, there's no vertical, et cetera, et cetera. And this, like I see, you tell me if this is wrong, but the science, you're following the science and it's leading us out of that framework. And I'm trying to point out how profound I think that is."}
{"episode_id":"SW - #411 - 2025-09-25 - Dr. Michael Levin Dr. John Vervaeke - Brave New Biology - Intelligence Trumps DNA","start":3028.69,"end":3206.4,"speaker":"Michael Levin","text":"Yeah, well, I appreciate that. I agree with you. I think, I think we made certain assumptions around. Again, I'm not a historian of science, but my understanding of what happened during the Enlightenment is that we made certain assumptions about the sets of tools we were going to use. Like every set of tools, it has blind spots. We are still sort of coasting along on those, on those tools. Assuming that turn the crank long enough and things will be okay. I think we've gone way beyond now understanding that a lot of these assumptions were not good. They were fine at the time, they served us well for some time, but they're not actually going to, going to keep going. And there's something else I wanted to mention which is this notion of embodiment. So the part that people tend to agree with me on is the part that I think embodiment is absolutely critical, it's very important. The part where I tend to lose everyone is the following. I think as human beings with a very particular. The cognitive apparatus and evolutionary history and whatever, I think we are obsessed with the three dimensional world. I think that there are spaces in which kinds of minds, meaning beings, and some of them are morally important beings do this perception, decision, action, loop, right? The world in which they strive, they solve problems, they suffer, they win, they lose, they do things. I think there are numerous spaces that are very difficult for us to visualize as humans. And because we have trouble visualizing these spaces, we assume that they don't exist. And when we say embodiment, we mean a physical body. If you're a software agent, you need to have a robot and trundle around on wheels or now walk around or something. You can't just be sitting in a box somewhere. You don't engage with the physical world unless you're running around touching things. Well, biology, long before nerve and muscle evolved biology was doing all of these kinds of problem solving, navigational, goal directed things in physiological state space, in transcriptional state space and metabolic state space. And in this is what we study in our lab mostly is anatomical state space. These spaces are as real to these beings that live in those spaces, I think as the three dimensional world is to us. They are as fictional and as constructed as the 3D world is by us, I think. And they are real and also constructed to the same degree. And there are many different kinds of embodiment that we do not traditionally recognize as embodiment. And there's actually a good chunk of my lab now is devoted to creating tools, empirical tools for people to use to recognize beings in non, you know, in non traditional spaces and to communicate with them. This is one of our goals, is to enable you to recognize, communicate with and ethically relate to beings that live in all kinds of other crazy spaces that we don't, you know, we can't visualize. So I just want to be really clear that it's, to me it's not that, okay, there are four and then there's like 3D universe. There are many other spaces as far as I'm concerned."}
{"episode_id":"SW - #411 - 2025-09-25 - Dr. Michael Levin Dr. John Vervaeke - Brave New Biology - Intelligence Trumps DNA","start":3206.64,"end":3329.84,"speaker":"John Vervaeke","text":"Jonathan, before you say, I just want one more point of conversion. Dan Chappie and I did a lot of work about the NASA scientists moving the rovers around on Mars. And does that violate embodiment? Because the scientists are here and the rovers are up there. And what we found was no, no, there's a different way in which they collectively organize themselves, themselves and make use of the information from the rovers to create this overall dynamical system that has the capacity to grok hyper patterns that like individual human cognition can't grasp. Now we argued that was a kind of embodiment, even though it's not a physiological body. We were trying to understand embodiment as are you adaptively coupled to your environment in a way that makes a difference to your ability to solve problems in that environment or something like that. But again, very convergent. What was interesting, and this is where my work overlaps with Jonathan and then I'll shut up so Jonathan can talk is you know, the kinds of things that the scientists had to do in order to participate in that collective intelligence, in order to make it a sense presence. They had to do all this imaginal weird, they had to identify with the rover, they had to internalize it, they had to do all this stuff. And you know, I'm being a little bit provocative here, but it looks very similar to a lot of the stuff people have typically done in religious settings. They do imaginal things, they extend identity, they internalize like the saint. And frankly, the scientists got kind of religious about the rovers. They really did. They started to talk as if they had like a sympathetic magic connection to them. These are these hard headed scientists. But if you do the actual ethnography, that's obviously not what they publish, but if you go do the ethnography of how they're doing the work, it's really messy like that. And so I just wanted, I put a fly in the ointment, but now I'm putting a flower in the ointment as a potential point. Like yeah, we talk about this, but you know, there's the question about."}
{"episode_id":"SW - #411 - 2025-09-25 - Dr. Michael Levin Dr. John Vervaeke - Brave New Biology - Intelligence Trumps DNA","start":3332.09,"end":3332.33,"speaker":"Michael Levin","text":"Do."}
{"episode_id":"SW - #411 - 2025-09-25 - Dr. Michael Levin Dr. John Vervaeke - Brave New Biology - Intelligence Trumps DNA","start":3333.45,"end":3392.37,"speaker":"John Vervaeke","text":"I think it's very plausible that human beings can participate in these collective intelligences in some way or form. And given Eric Hall's work that gives us access to otherwise inaccessible causal power and information access that's otherwise not available. I'm not invoking anything woo here. You and I know Eric Hull's got some pretty rigorous argument and some good simulations providing evidence for this. But for me, you know, if we got a verticality and we have that kind of participation and it seems to be actually allowing, and I'm using your language, Mike, the engineering to move the rovers around and be able to study the hyper objects, the hyper patterns of the Martian atmosphere. Then there's the possibility that maybe stuff we had dismissed as being in the Enlightenment, as being superstitious, we should take seriously again. And now I'm going to turn it over to Jonathan because that's my flower in the ointment."}
{"episode_id":"SW - #411 - 2025-09-25 - Dr. Michael Levin Dr. John Vervaeke - Brave New Biology - Intelligence Trumps DNA","start":3392.53,"end":3491.5,"speaker":"Michael Levin","text":"Right, well just very quickly, I like that a lot. And I can tell you that something very similar I think is the future of molecular medicine. Because what we are doing right now is pointing out that if, if you have a bowling ball on a landscape, then your view as a third person external observer tells pretty much the whole story. You can see, you know what's going to happen. But if you have a mouse on a landscape, your view as an external observer is kind of useless. You need to know what is the mouse think of this landscape, what does he see and where? So, so, so, so now when we look at, okay, we want to control the physiology of the liver or we want to control the blastema to regenerate a limb or an eye or whatever, which of those models is going to do. And I'm here to tell you that it's not the bowling ball model, it's the first person perspective model. So that in the future when you are going to, and we're trying to make tools for this, we're trying to make practical tools for this. Instead of controlling the rover in three dimensional space on Mars, you are controlling, as a worker in regenerative medicine, you are controlling the movement of cells in, in an invisible anatomical morphospace that you can't see or the movement of your liver in physiological state space that has 29 dimensions that you couldn't imagine. And so you need tools for you to become that being, to share your, your inner perspective with it and say, okay, I'm kind of again like, right, I'm not trying to get woo here, but I think There will be tools, there will be augmented reality tools that will say, I want you to navigate the space. Thus how are you going to do that if you, you don't understand the space? How are you going to communicate to this being if you're not part of it? In the same way that you were talking about merging with that rover."}
{"episode_id":"SW - #411 - 2025-09-25 - Dr. Michael Levin Dr. John Vervaeke - Brave New Biology - Intelligence Trumps DNA","start":3491.82,"end":3492.22,"speaker":"John Vervaeke","text":"Right."}
{"episode_id":"SW - #411 - 2025-09-25 - Dr. Michael Levin Dr. John Vervaeke - Brave New Biology - Intelligence Trumps DNA","start":3492.62,"end":3515.99,"speaker":"Michael Levin","text":"And I think we're going to end up in a lot of very weird spaces that are at different scales, different time scales, spatial scales, distributed, disconnected, where we are going to be part of that first person perspective of really weird beings, like body organs, like cells, like synthetic self growing douses and God knows what that we are going to have to be part of that, you know, from the inside, not from the outside."}
{"episode_id":"SW - #411 - 2025-09-25 - Dr. Michael Levin Dr. John Vervaeke - Brave New Biology - Intelligence Trumps DNA","start":3518.71,"end":3635.57,"speaker":"Jonathan Pageau","text":"So I, there's a lot of, a lot has been said, but for sure, in terms of the idea of non 3D bodies, I think people have known about these for a long time. We call them subtle bodies. They're different iterations of it. Of course, most ancient traditions care mostly about those that are at the personal and transpersonal level. But you know, you can find embodiments, for example, at a personal influence level in stories. That is the way that I influence others through even just speech is that type of non completely physical embodiment. If a very influential celebrity endorses a product and then that gets taken up in the minds of parents that then buy that product. For children, what you're encountering is a non physical pattern that's embodying itself at different levels and it's kind of reaching all the way, all the way down. And so in the human sphere and in the kind of social sphere, we have these types of bodies that they're all different types of bodies that are not completely gross like that aren't brute, but we're used to understanding how influence functions. And I don't know if you've thought about the analogy between those types of influences like the way that you could say the way that music makes people dance and the types of things that you're doing. Because music obviously is not a, music is a auditory pattern. It's not a brute, it's not a brute thing that runs into each other, but nonetheless what it does is that it embodies itself first in just vibrations of sound and then it slowly moves down until it manifests itself in a bunch of people square dancing on the floor. And so I don't know if there are analogies that you can see between those types of transpersonal patterns kind of embodying themselves and what it is you're doing at the biological level."}
{"episode_id":"SW - #411 - 2025-09-25 - Dr. Michael Levin Dr. John Vervaeke - Brave New Biology - Intelligence Trumps DNA","start":3636.29,"end":3664.06,"speaker":"Michael Levin","text":"Yeah, yeah, There's a lot going on there. And one person that you guys probably should talk to is Richard Watson. So University of Southampton. So he's a computer scientist, evolutionary biologist, and he and I have done a bunch of work together. He's very interested in metaphors of music and things like this, in driving collective intelligence and these spaces and all the. Everything you just said, you guys could talk for hours with him. So I would suggest that as well."}
{"episode_id":"SW - #411 - 2025-09-25 - Dr. Michael Levin Dr. John Vervaeke - Brave New Biology - Intelligence Trumps DNA","start":3664.86,"end":3699,"speaker":"John Vervaeke","text":"That's interesting because, I mean, first of all, for me, I've been doing Taoist practices for 30 years and I really have objected to the very North American way of talking about this in terms of energy and stuff like that in situ. The metaphor that's used for the dao are almost always musical metaphors, not energetic metaphors. And it's much more aligned with that. I very much. Mike, could you link?"}
{"episode_id":"SW - #411 - 2025-09-25 - Dr. Michael Levin Dr. John Vervaeke - Brave New Biology - Intelligence Trumps DNA","start":3701.08,"end":3702.12,"speaker":"Michael Levin","text":"I'll make a connection."}
{"episode_id":"SW - #411 - 2025-09-25 - Dr. Michael Levin Dr. John Vervaeke - Brave New Biology - Intelligence Trumps DNA","start":3702.92,"end":3703.56,"speaker":"John Vervaeke","text":"Thank you."}
{"episode_id":"SW - #411 - 2025-09-25 - Dr. Michael Levin Dr. John Vervaeke - Brave New Biology - Intelligence Trumps DNA","start":3704.28,"end":3720.52,"speaker":"Jonathan Pageau","text":"So the biggest question though, that comes to my mind is that, I mean, I want to make sure I understand correctly. If I'm not understanding correctly, please, please do correct me. And so what you seem to be talking about, it connects to this idea that in some ways these patterns that."}
{"episode_id":"SW - #411 - 2025-09-25 - Dr. Michael Levin Dr. John Vervaeke - Brave New Biology - Intelligence Trumps DNA","start":3720.52,"end":3720.84,"speaker":"John Vervaeke","text":"Are."}
{"episode_id":"SW - #411 - 2025-09-25 - Dr. Michael Levin Dr. John Vervaeke - Brave New Biology - Intelligence Trumps DNA","start":3722.61,"end":3876.96,"speaker":"Jonathan Pageau","text":"Framing or that are, you know, gathering this potential together towards purposes, and that these are these bioelectrical patterns that are manifest, manifesting themselves that way, but that ultimately they represent certain purposes or certain goals that this multiplicity now organized itself towards. If that's right, then it seems that there is, I believe at least most traditions in the history of the world have ascertained that there are. That there is a hierarchy of those goals, that there is a natural hierarchy of the goods through which these patterns manifest into the world. And in that way, that's why in some ways the classical Darwinian system is almost easier to understand in that sense, which is if it survives, then it's closer, it's closer to the good in some ways, that there's a goodness calling. There's something that makes being persist and through iterations, you know, that, that, that maintains itself and things get thrown off, things get brought back. Like there's all this, these, this back and forth, but in the space that you are able to enter now. And like in some ways, by bringing human agency into these systems. Let me just frame this with one last statement, which is that at least at the human level, because of human consciousness and especially human self consciousness, we have recognized that in the way that we act, that there are certain patterns that are parasitic There are certain wills that you can download, that you can interact with, that you can be influenced by, that are actually destructive, but that we do so nonetheless for all kinds of perverse reasons, which I want to go into too much. And so the thing. When I hear you talk about, like, we could do anything, right? We could give, you know, you could grow wings. You could grow five eyes. You could. You could do all these things. I also am worried of the fall, right? Worried of. Worried of us bringing our parasitic processes into. Into a space which until now has, in some ways been. Hasn't been completely tainted by it. Of course, it is tainted to some extent. I mean, we do species breeding. These are slow versions of imbibing patterns into species. Now you're doing it at one generation. You create a chimera. And the reason why we have warnings about chimeras in mythology is not completely, I think, irrelevant that we have this image of the sphinx that will eat you."}
{"episode_id":"SW - #411 - 2025-09-25 - Dr. Michael Levin Dr. John Vervaeke - Brave New Biology - Intelligence Trumps DNA","start":3877.92,"end":4324.73,"speaker":"Michael Levin","text":"Well, there's many things that are not chimeras that will eat. Eat you. So I guess. Okay, so you brought up two things. I'd like to talk about both of them. Let's do the first one first. So the patterns that we pick up. So I want to float an idea roughly summarized in this idea of thoughts are thinkers. And which is this. Let's visualize the second idea that there are many patterns of one way to do the hierarchy. And I don't know what kind of hierarchy this space has, but I'm open to that. And I can see there's one hierarchy that I can see immediately, which is there are patterns that you might characterize as fleeting thoughts. They come and they go. They sort of go through a cognitive system and they're gone. Right? Patterns. There are other patterns that are persistent thoughts. They kind of do a little niche construction in the cognitive agent that make it easier to keep having those thoughts. And they're kind of. They try to hold on a little bit, right? But they're not very complex. They just kind of all. They're sort of the viruses of that world is they just kind of like to hold on. And that's pretty much it. Then there are more complex things that we can see as, for example, personality fragments. So if someone has dissociative identity disorder, there are things that are. They're more than just intrusive thoughts because they have some planning and they have some goal directedness and they have a little bit of cleverness to them. And then. And by the way, there are some things that we could talk about in Weird ancient traditions that are between those two things. But let's just move on. I'm sure you know what I'm talking about. And then there's whatever is transhuman, whatever else, right? So if we like this continuum, we can say that we ourselves are patterns. That's what I think we are. I think we are embodied patterns. I think we are extremely sophisticated, self constructing, self maintaining patterns. We interact with many other. In fact, we throw off, we spawn off patterns all the time, which are the results of our cognitive and emotional activity. We are susceptible to other patterns. Some of these patterns are autocrine, meaning that we generate them ourselves. Other patterns are not. They don't come from us, they come from other beings or whatever. And we may or may not resonate with them. We may or may not offer them a home to whatever extent we indulge them. Some of these are patterns that are known to, for, you know, computer science, as thoughts that break the thinker. So there are patterns that once you've seen them, you can't really unsee them. And it actually feeds back to alter your structure. And so like that's it in a certain sense. Right. And so, yeah, I think, I think there's a perfectly reasonable. I think in all of these things, it's not necessarily a difference in kind as much as a difference in degree. And yeah, we have to be very intentional in what kind of patterns we generate and what kind of patterns we accept because they all have consequences. So I'm kind of on board of that. I do want to talk about the other thing, which is this being worried about chimeras and things like this. A fundamental claim that I'll make. And I make it mostly because I'm not even a clinician. And you should see the emails I get every day. Okay, probably 50 to 100 emails. Well, okay, maybe 10 or 15 emails that say, what you're doing is scary frog. Sell biobots too much. Freaking me out. You know, planarians, you know, they shouldn't have to heads. A good old fashioned worm has one head. You should stick to that, you know. Okay, so, so, so some of that. And then probably 10 times more of that saying, what the hell are you waiting for? My kid has a birth defect, I've got cancer, Somebody else has you lost a limb. What are you screwing around for? When are we gonna get, when are we gonna get relief from these, from these ridiculous, painful, you know, maladies? And, and what I'll say is this, you know, are we, do we need humility in all of this? Absolutely, 1,000%. Are we going to make mistakes occasionally? 1,000% we're going to make mistakes. However, what I see as the status quo, here's what I don't believe, because a lot of people make this argument implicitly, they make this argument, everything right now is cool and you scientists better not screw it up, everything's great and don't do anything to make it worse. Now granted, sometimes scientists come up with some stuff that make things worse. It can happen. But the claim that everything is fine now is, I think, incredibly outrageous. And the people who are freaked out about the two headed flatworms tend to be the young, healthy people. And as soon as their kid has some kind of problem, they run to the hospital and they pray like hell that somebody had figured something out. And then maybe they start wondering where do medical solutions come from? And so my point is this, that I think where we are now is in no way optimal. I don't believe, and I am not, I am not saying outright that there are not interesting verticalities that guide what happens here. What I am saying is I do not believe that the current status quo of our embodiment, meaning the obligate loss of cognitive capacity after about eight decades, the, you know, the astigmatic, the lower back pain, the birth defects, the cancer, I don't believe any of this is optimal or was intended to be this way. Our physical embodiments, as far as I can tell, are the products of cosmic rays hitting our embryonic cells. They're the results of processes that really don't have. And I mean, I know this is a controversial opinion, but this is what I think. They have not been looking out for us in terms of any of the values that we care about. And in the way, to me what's happening is that all of this has been waiting basically for us to gain the knowledge and hopefully the wisdom to improve on some of this stuff so that everyone, everywhere can have the kind of quality and length of life that it takes to have an intentional life with meaning, not distracted by pain and avoidable, preventable tragedies that we are simply too stupid currently to do anything about. I understand the worries and there are many things to be worried about, but the number one thing to be worried about is where we are now. The status quo is unsupportable. I think there's a massive amount of suffering for, as far as I can tell, no good reason. You know, and people argue with this and they say, look, you know, the shortness of our lives, that's what gives it meaning? Because you have to, like, great. So how about maybe 10 years? How would that be? No, no, no. 10 is ridiculous. 80, like 80 is great. Why is 80 great? Why is 10 too short and 80s great? Why not? Why is it not the fact that maybe you need a good thousand years before you get to really understand the wisdom of how to live a good life? You know, I just. I don't see the. That any of the things that we have now were carefully chosen so that we could have an appropriate set of values. I don't think that's what's happening. So, yes, we will make mistakes, but, boy, the situation right now is, I think, untenable. And it's on us, all of us, I think, to try to improve it as best as we can."}
{"episode_id":"SW - #411 - 2025-09-25 - Dr. Michael Levin Dr. John Vervaeke - Brave New Biology - Intelligence Trumps DNA","start":4325.45,"end":4361.8,"speaker":"John Vervaeke","text":"Could I amplify Mike a little bit? Because I'm a bit of a shit disturber myself, which is not only are there all those things that Mike talked about non optimalities, I think the meaning crisis is a real thing, and I've argued for it at length and I think the kind of work where we're exploring this stuff and I've tried to argue that here right now gives us opportunities to deeply, in a philosophically and scientifically respectable manner, address the meaning crisis. And so that's right. I think that's a powerful benefit that we need to put into our cost benefit analysis. I just want to amplify Mike that way."}
{"episode_id":"SW - #411 - 2025-09-25 - Dr. Michael Levin Dr. John Vervaeke - Brave New Biology - Intelligence Trumps DNA","start":4362.2,"end":4487.54,"speaker":"Jonathan Pageau","text":"Yeah, I mean, I think. I mean, I bring that up because there is a lot of. There are a lot of mythological stories that talk about this problem, you know, the problem of the making of chimeras or the chimera in some ways being a puzzle that destroys you. But at the same time, I agree with you, John, and I also agree with you, Mike. I think one of the reasons why I wanted to talk to you is because I can see in the work you're doing that you're opening up all kinds of ways of talking about things that I think many people have forgotten what they're about. You know, a lot of the ancient wisdom in some ways had become arbitrary and people didn't understand what it was referring to. And so I think some of the work that you're doing and the work that John's doing is helping us understand what it is we're talking about. Like when we talk about transpersonal agencies, like, you know, the language of angels and demons and ancient gods, it became a kind of arbitrary marvel science fiction thing, you know, with beings that exist, but we don't Know what that means. But when you start to kind of understand these, this, these, the way that intelligences influence us, you know, the way that our intelligence influences the world, and then the way that you can see intelligences running through systems, purposes that are agentic, all of a sudden you can start to at least reinterpret or look back at some of the things that we have we've just tossed aside and forgotten and it can help us understand our world again. So I wanted to put a caveat on what I said. I mean, in some ways a lot of the things you're doing are so wild and new that it is a little frightening. But I also find, find it exciting because I can see that for a lot of people that would have refused the possibility of vertical causation, at some point it becomes impossible to ignore it because it's actually not yielding. You've reached the limit of what it can yield for you without considering it. Like, if we don't start thinking about things this way, then we're actually, even scientifically, we reach a limit. We can't go for any further. So I just wanted to caveat that."}
{"episode_id":"SW - #411 - 2025-09-25 - Dr. Michael Levin Dr. John Vervaeke - Brave New Biology - Intelligence Trumps DNA","start":4487.62,"end":4568.01,"speaker":"Michael Levin","text":"Yeah, thank you. Well, I think it is. I mean, I'll tell you why I think I. It's frightening because it is frightening. It's frightening because it places the responsibility on us. I think that when people, people ask me, you know, what are you most scared of? And you know, it's not that the xenobots will eat us all. It's that we will fail to rise to the level of intelligence and wisdom that are needed to address these issues that have plagued us forever. That is what that is. What's frightening to me is that is that I don't, you know, it's not, not a foregone conclusion that we can do it. And it places the responsibility on us. And it means that we are, in an important sense the adults in the room responsible, all of us responsible for relieving the level of suffering and for solving the meaning crisis. I think that's absolutely critical. And, you know, I understand the ancient texts warn about certain things. The one thing I haven't really, and this could just be me, maybe they exist. I'm. I'm not a scholar of that stuff, so I don't know. The one thing I haven't seen, or maybe they did exist and got suppressed for specific reasons, is whether any of these things warn of the dangers of the status quo. Where are the ancient texts that say, look around. Are you seeing all this stuff? Don't let it sit like this, do something, learn, and let's get past this. Does that exist?"}
{"episode_id":"SW - #411 - 2025-09-25 - Dr. Michael Levin Dr. John Vervaeke - Brave New Biology - Intelligence Trumps DNA","start":4568.25,"end":4589.89,"speaker":"John Vervaeke","text":"Mike? I would put it to you that the Axial Revolution was a significant change from the Bronze Age, in which the status quo was taken as the normative. And the Axial Revolution said, no, no, the status quo is somehow fallen or decadent or illusory or filled with foolishness and violence, and we need to transcend it. And it brought about a totally different conception of whiskey."}
{"episode_id":"SW - #411 - 2025-09-25 - Dr. Michael Levin Dr. John Vervaeke - Brave New Biology - Intelligence Trumps DNA","start":4590.29,"end":4675.83,"speaker":"Michael Levin","text":"I think that's very interesting. And I have this fantasy looking forward, assuming we all make it, which is also not a foregone conclusion conclusion, but assuming we all make it, I look forward to a class in school where the young kids learn about us the way that we learn about cavemen. When we read that, oh, my God, you used to step on a sharp stick and get sepsis and die. And that was the end of that. And they would learn about us and they would say, wait a minute, you're telling me these people, they would have to live their whole life in whatever body they randomly got at birth. So they just got. Some random cosmic ray would hit their embryonic cells and. And they would be crippled or they would have, you know, whatever their limitations of IQ or whatever, they would just have to stay in that body and there was nothing they could do about it. And they would, you know, they would have to kill other things to eat just to survive. Like, these are all crazy. These are a mature species, shouldn't be doing any of this. And I feel like if, you know, in the future when they look back, this is going to seem ridiculous. It's going to seem crazy that our lives and the meaning and the achievements of our lives would be limited to things that we had absolutely no control over because we didn't know what to do. We didn't, you know, the cells seem to poop out after. After 80 or 90 years. We don't know what to do. And that's it. That's just. That's just how. That's how we were born and that's how we stayed. To me, this is going to seem. The kids aren't even going to believe that this is how we lived our lives."}
{"episode_id":"SW - #411 - 2025-09-25 - Dr. Michael Levin Dr. John Vervaeke - Brave New Biology - Intelligence Trumps DNA","start":4676.63,"end":4800.71,"speaker":"Jonathan Pageau","text":"One of the things, I mean, this is something, I don't know, hopefully I can make it relate. And you can tell me if it's sounds completely arbitrary, but one of the differences that we see in traditional way of seeing is that there seems to be a difference between, let's say, a liturgical practice, if you think about like a liturgical practice in which you Are in some ways coming together, and you are attending to something above you, right? So you. A group comes together, they sing, they process, they do all these things, and they, in some ways, are attending. And making themselves dependent is a good way of thinking about it, like consciously making themselves dependent on something that is a higher good, right? The God of infinite love, a patron saint, something that is a good. And that has always been differentiated from the sorcerer, right? The sorcerer that is able to perceive these patterns in the world and is able to kind of grab them and manipulate them towards power, you could say. And there's a relationship between the two, because in some ways they're doing similar things, which is that you kind of see this pattern and you want to bring it into the world. And so in the first case, you kind of submit yourself to something grand and higher, and you embody it through procession, through liturgy, through all these things. And also then to be. Through behaviors in the other sense, you. It's like you. You know, you create the interface. This is a good. A good example of a sorcerer. Like, you know how to become more powerful. You find out, and you create the interface. You make a golem or you make a monster. The next question we need to ask you about AI. So you could already, if you want, feed into the AI question, right? And then basically you pull, right? It's always an image you trap, right? This is the image in mythological terms. You trap the spirit in a body so that it serves your purpose, all right? And then it acts in your. As an extension of you. That's the. The kind of. That's the mythological or kind of, you know, fantastical image. But there are, of course, things to say about. About AI if you want to bridge that together, go ahead."}
{"episode_id":"SW - #411 - 2025-09-25 - Dr. Michael Levin Dr. John Vervaeke - Brave New Biology - Intelligence Trumps DNA","start":4801.11,"end":4909.33,"speaker":"John Vervaeke","text":"Can I just say one thing? Because Mike. I mean, Mike's work has the potential. And Mike, I'm not imposing on you. You wrote a. You wrote an article with others about care and Buddhism and AI. I'm not. So I'm not bringing in something foreign here. And I think I've made enough connections here to make the claim. What Mike's work's doing, especially, you know, if it can integrate with my work and if my work can integrate with his work, is the possibility of stitching back knowledge and ontology and the cultivation of wisdom, rather than having them separate, culturally separate and orthogonal from other. Each. Each other, there's the possibility of saying, well, the science would say that, you know, we have to pay attention to how we care. Mike's work argues that in at least one paper and that matters. And that, you know. And maybe, Mike, you made use of Buddhism. You know, here's a set of an ecology of practices that helps orient us in the right way. Like, the possibility of bridging like. Like between knowledge and wisdom, to put it sort of simplistically, is opened up by the kind of work that Mike is doing and the kind of work that I'm doing. And we don't have to live with the enlightenment idea that there's knowledge over here that is completely valueless or something like that, and then there's wisdom over here, which is kind of arcane. And we could go back to a different way, which is the possibility that our wisdom could impact on our knowing, and our knowing could make an impact on our attempts to cultivate wisdom and meaning. I think Mike's work and my work is arguing for that possibility and strongly recommending it to people. Mike, you've published on this, so I don't think I'm putting anything into your mouth to say that."}
{"episode_id":"SW - #411 - 2025-09-25 - Dr. Michael Levin Dr. John Vervaeke - Brave New Biology - Intelligence Trumps DNA","start":4909.73,"end":4968.87,"speaker":"Michael Levin","text":"Yeah, yeah, yeah. No, that's. That's absolutely true, and I apologize. I'm already quite late. I. I'm gonna have to go in about three minutes. Sorry. In about three minutes, I'm gonna have to. I'm gonna pop off for sure just to say that. Look, I totally understand the distinction. You know, the sorcerer picture that you were painting. I get the distinction. I am not claiming that, you know, pure intelligence, un. Sort of guided by wisdom, by compassion, by these other things, cannot be used for very sort of selfish, destructive aims. Of course it can. I once did a poll of the following situation. Just visualize your OG and you just discovered fire. And so you're on your way back to your tribe to show them this, like, amazing thing. And then you have this vision of everything that follows after that. Steel weapons, you know, artificial hearts, nuclear bomb, you know, submarines, anti antibiotics, like the whole. The whole thing."}
{"episode_id":"SW - #411 - 2025-09-25 - Dr. Michael Levin Dr. John Vervaeke - Brave New Biology - Intelligence Trumps DNA","start":4968.87,"end":4969.15,"speaker":"John Vervaeke","text":"Right?"}
{"episode_id":"SW - #411 - 2025-09-25 - Dr. Michael Levin Dr. John Vervaeke - Brave New Biology - Intelligence Trumps DNA","start":4969.15,"end":5078.39,"speaker":"Michael Levin","text":"So now the. So now the question. Do you sort of put the stick out and be like, nope, I haven't got anything, or do you. Or do you roll? Right. So about. So about 6% of. And these are people who read my stuff. So they. Presumably they're, you know, sort of. They like some of this. Six percent of them said you should have put out the fire and stayed outdoors. Freezing, you know, freezing and stuff like that. So, look, I understand the difference. I think that difference would be more convincing to me if there was some way to be sure that if you do the former thing, you described someone with great wisdom and power is going to take care of stuff and has your back. If someone has your back. I understand there are large swaths of people in the world who think that is the case. I get it. I suspect, and I'm not even necessarily arguing against that, I suspect that whatever exists along those lines is more along the lines of that old joke like, well, how come you didn't save me from the flood? Hey, I sent you three boats. I'm more thinking that there's a sense of impatience going on, which is like, figure it out, people. And everything can be elevated. So I don't think the right framing and who am I to say anything on the matters. Right. I don't know. But this is just my own personal view. Is that the way I see it is not as a matter of we got to find the right way to relinquish responsibility and then things will be good. No, it's to what as what John said is to try to couple the intelligent, the rise in capacity with the rise in the cone of compassion. Right. The level of care that we can and wisdom that we can manage so that we can actually be the positive agents of change. Because I just don't see waiting for somebody else to do it. It doesn't seem to be working out well."}
{"episode_id":"SW - #411 - 2025-09-25 - Dr. Michael Levin Dr. John Vervaeke - Brave New Biology - Intelligence Trumps DNA","start":5078.39,"end":5090.51,"speaker":"Jonathan Pageau","text":"Michael, thank you so much. Thanks for your patience and thanks for. This was in some ways kind of exploratory to try to figure out how we could. We can discuss together and. But I think there's some, some really great nuggets that have come out of the conversation. I really appreciate it."}
{"episode_id":"SW - #411 - 2025-09-25 - Dr. Michael Levin Dr. John Vervaeke - Brave New Biology - Intelligence Trumps DNA","start":5090.51,"end":5095.23,"speaker":"Michael Levin","text":"Fabulous. Thank you so much. Yeah, lots, lots more to talk about. Happy to, happy to do it anytime. Yeah. Thank you. I appreciate it."}
{"episode_id":"SW - #411 - 2025-09-25 - Dr. Michael Levin Dr. John Vervaeke - Brave New Biology - Intelligence Trumps DNA","start":5095.87,"end":5096.93,"speaker":"John Vervaeke","text":"Great seeing you again, Mike."}
{"episode_id":"SW - #411 - 2025-09-25 - Dr. Michael Levin Dr. John Vervaeke - Brave New Biology - Intelligence Trumps DNA","start":5097,"end":5099.6,"speaker":"Michael Levin","text":"Thanks, John. Yeah, very good to see you both. Take it easy."}
{"episode_id":"SW - #411 - 2025-09-25 - Dr. Michael Levin Dr. John Vervaeke - Brave New Biology - Intelligence Trumps DNA","start":5099.6,"end":5100.04,"speaker":"John Vervaeke","text":"Bye."}
{"episode_id":"SW - #411 - 2025-09-25 - Dr. Michael Levin Dr. John Vervaeke - Brave New Biology - Intelligence Trumps DNA","start":5100.28,"end":5115.32,"speaker":"Jonathan Pageau","text":"If you enjoy these videos and podcasts, please go to the symbolicworld.com website and see how you can support what we're doing. There are multiple subscriber tiers with perks. There are apparel and books to purchase. So go to the symbolicworld.com and thank you for your support."}
{"episode_id":"SW - #411 - 2025-09-25 - Dr. Michael Levin Dr. John Vervaeke - Brave New Biology - Intelligence Trumps DNA","start":5115.8,"end":5179.85,"speaker":"Laura Diaz","text":"Tucson the weight is over. Medi Weight Loss. They're officially open on North Oracle Road. That's right. No more counting down the days. You can walk in right now and start your journey to a healthier you. Hey, it's Laura Diaz from iHeartRadio. And you can trust me. This isn't just another weight loss clinic. I know that because it's where I lost weight safely with real medical support. GLP1 medications. You can see them everywhere online. Right now, but the truth is your health shouldn't be a DIY project ordering these meds without the professional guidance. It can lead to dangerous mistakes, wrong doses, no oversight, and serious risks. At mediweightloss, I got the same medication but with a customized plan, weekly check ins, and a licensed physician guiding me every step of the way. And the cost? The same as those risky online options. Tucson, your moment is here. If you're ready to take control, feel better and lose weight the right way, mediweightloss is ready for you. Walk in, get started and see real results. Call or visit mediweightloss.com to learn more and book your free consultation today. That's mediweightloss.com pack up though, because Chevy."}
{"episode_id":"SW - #411 - 2025-09-25 - Dr. Michael Levin Dr. John Vervaeke - Brave New Biology - Intelligence Trumps DNA","start":5179.85,"end":5206.81,"speaker":"Michael Levin","text":"SUVs have the capability to take you to some incredible places. Like an adventure in the middle of in the Equinox Active, an SUV that will help you get away with confidence. Or head off for a night in the in Chevy Traverse with all the tech you need to stay connected. While the undeniable value of Chevy Trax will keep you moving from here to over here to way over here, get to all the places you want to be with Chevy SUVs. See Watson or O'Reilly Chevrolet."}
