{"episode_id":"SW - #276 - 2023-03-03 - The End Of Desacrilization in Art","start":0.48,"end":3535.63,"speaker":"Jonathan Pageau","text":"A good way to understand the history of modern art is through a lens of desacralization, that is, a movement away from the sacred art, and let's say at least an art that pointed towards the sacred in the Middle Ages, you know, in the Byzantine era as well, and how this. This art moved towards secularization, towards desacralization, sometimes implicitly, sometimes explicitly in the art. And at the same time, it feels like that movement has come to an end. And so we're going to look at some of the history of some of the artists and see what that means. Why do I think that in some ways we've reached the end of desacralization in art and how there is an opening, even within the very narrative of fine art and contemporary art, that there is a narrative for recycleization possible in the moment. This is Jonathan Peugeot. Welcome to the symbolic world. So the first thing to understand when we're looking at this question is to understand how ancient art worked. You know, not just in the Middle Ages, but I would say art in many of the traditional cultures that, you know, art was integrative. And in some ways, that is the meaning of art itself. The word art means to gather together things. And the way that the ancients understood art was in this way. That's why they could talk about the art of rhetoric or the art of. Of, you know, the art of painting or the art of poetry, you know, or we could even say the art of making cheese or making wine. That is, art was in some ways gathering multiple elements together towards one purpose, one, you know, one vision. And. And so that is. That is what it means to be. That is what it meant to be an artist, someone who had the skill and the capacity to take a bunch of stuff, bunch of materials and gather them together towards a common meaning. Of course, you know, but materials in terms of physical materials, but also in terms of ideas, in terms of words, all of that together. And so the way to understand the ancient art is that it was integrative, not just in its constituents, that is, not just in the things that made up the object of art, but the way in which art functioned in the world. That is, art was participating in society. You know, if you think of sacred art and it was used in service of God, in service of. Of church functions. You know, a reliquary was there to hold relics. Paintings were there to both to decorate important places, but then also to remind us of what is important in the images of the sacred. But then also, you know, if you think of how castles or the houses of nobles were decorated, was there to, of course, decorate, but also to celebrate the things that were important to people. The hunt, you know, the jousting, if someone, you know, commissioned a poet to come and give an elegy to the king, to a wedding or something. Music was used for dancing, music was used for celebrating God. And so there was a sense in which there was this integrative aspect. And so this integrative aspect, you know, comes in this basic idea in the Middle Ages of the great chain of being, that is, the way in which God manifests himself in the world and. And how things participate in that. And you can see art becomes a means of embodiment of skill or craft. And there is a desire to find unity in the multiplicity. And this hierarchy is both in the means and the expression, that is, in the very style of the images. There was this desire, but then also in the use of materials and towards the direction, the direction towards the sacred. And so there wasn't only sacred art, but in some ways, sacred art informed the profane, that is, church architecture, church music, Church art became the model, the thing to look to, to know where to get the influences for everything else. And so, of course, a church building would be the most beautiful and the most ornate and the most complete building in a city, but it would inform the forms and the structures of the rest of the buildings. The same goes for art. If you look at Byzantine art, for example, you'll notice that if you made a book that illustrated the life of Alexander the Great, you would use the same tropes that you would use in icons and in sacred art. Because in some ways, sacred art was the highest and it informed the lowest as well. This was true both in the east and in the West. And it was true really up to, you know, I would say up to the 13th, 14th century. If we look at, for example, in Florence, the baptistery, in Florence, you will find late versions of this type of art, where the baptistery is there to baptize people. And then in the baptistery, you will find a type of imagery which is looking to, let's say, integrate the way the image is made into a deep theology. And it wasn't as concerned with certain questions which would come later in. In the art. It was concerned with really showing the meaning and also having us understand the participation. And so the way that it's often phrased by historians, you know, maybe a little less today, but at least for a very long time, the way it was framed by art historians was that there was a shift at the end of this period into now wanting to show the natural world. You know, the ancients, the. They didn't show the natural world. They showed this type of iconology, this type of focus on theological meaning and not so focused on representing reality the way that it looks. And that then in the late 14th century, I would say then 15th century especially, is when you start to see this kind of stuff. Of course, this is Van Eyck and Raphael. And so van Eyck is an early example used by art historians to show the shift that happened where now there's a desire to represent the textures of reality, represent the folds in a more realistic way, and that this is a major shift in art making. And then you have examples like Raphael, you know, Leonardo da Vinci, as people who are now focused on the. The material world and trying to represent things in a material world in a different way. Now it's very important to pause even here and to. To question some of the assumptions that we have about the Renaissance. And so what's interesting about the Renaissance is that in the Renaissance, there's a little microcosm, you could call it, which is that although it is true that if you look at the beginning of the Renaissance, there seems to be a desire to show visual. The way in which we experience visual reality, to kind of emphasize that. Emphasize the momentary, emphasize the capturing the moment, you know, because in the ancient images, they tended to represent figures from the front faces that you could see. You know, that's how you encounter a person. So if I'm going to show a person, then I show them face first. I show them, you know, in a way that I can see their face, their expression that's clear. And so that, of course, in the everyday life, you know, if you're walking down the street, then that's not the. The experience you have. Although you could argue that this way of representing is more real because it takes into account the fact that this is a representation of a person. And what's the best way to represent a person? Then? This is the way that it is. But of course, when you see a Raphael, then all of a sudden you see people from behind, people that you don't see their faces, people that you can see the backs of their heads here. You know, all of that is going on. And then you can see the bottom of people's feet. This kind of stuff that you would never see in a. In a traditional. An ancient image. And there's this kind of atmospheric desire to show the sunset and to show, you know, these kind of natural details. Of course, in Van Eyck, you see that especially. And so the way that it's often framed is that, okay, so this is the major shift. And then from then on, there is kind of this desire to show natural reality and a desire to show the visual world. But I would say that it's not completely true. And like I said, there is an interesting microcosm that happens in the Renaissance is that it starts this way, then it ends with this. This is what we call mannerism. And so mannerism is a part of the Renaissance that people don't like to talk so much about because they don't quite know how to fit it into their narrative. And so immediately after the artists start to try to represent, let's say, what you could call visual or physical reality, they immediately start to deform it. They immediately start to stretch it out and to create, let's say, expressive deformations in the art. So this is Parmigiano, who shows excessive proportions here in the body of the Virginia, extremely long neck. Everything is ridiculous in terms of natural proportions. I'm not trying to mock it because of that. And then the body of the baby is completely stretched out. These are not natural proportions. And then you look at someone like Archimboldo, which goes even further, and paints figures with flowers and with different vegetables and different types of. Different types of details. And so you could say, interestingly enough, that these artists, here they are. These are contemporary artists, that is that their concerns are very much the concerns of a contemporary artist today. You know, Archimboldo, the things that he's dealing with, the questions that he's dealing with, are questions that are completely akin to what you would see in a modern installation or in much of modern art. And so there's a little microcosm in the Renaissance of the transformation that is going to happen. And the transformation is a movement, you could say, away from the representation of the sacred, a representation of the visual. But the way to understand the visual, to understand why it leads to Mannerism, is that you have to understand that even in Van Eyck, is a desire to show the little hairs on the dog and, you know, the little folds in this clothing. And so because there's a desire to show idiosyncrasy, a desire to show, you know, the little details rather than the patterns of the world, although it's not, of course, it's still all very patterned, then this will lead to what will lead to idiosyncrasy. And so there are many types of idiosyncrasies and this kind of idiosyncrasy, the kind of idiosyncrasy that shows exception and shows strangeness and shows a kind of, you know, especially in Archimboldo, you know, a kind of fantastical impossibility is, of course, the end of what we could call idiosyncrasy, you know. And so the idea that the movement from this to this, if that surprises you, then you're missing out on what is going on. And you can understand now, for example, why something like the scientific revolution or why the Enlightenment leads to postmodernism and leads to idiosyncrasy. Because the desire to show the world in its details, let's say rationally in its details and to kind of explore the textures of reality, and looking down at the earth and trying to explore phenomena will ultimately lead to something like idiosyncrasy. Because you're not looking above, you're not looking at the patterns. You're not trying to embody the patterns. You're rather trying to disconnect yourself a little bit. It's not yet completely clear that that's going on. Disconnect yourself from the patterns. And look, let's say, down below. And so down below is, of course, detail and all of this stuff. And then also, you know, moments that are not captured for the reason of their meaning. And so showing someone the back of someone's head is, you know, looking at the transfiguration is. Is to show, like an idiosyncratic moment in that. In what happened, you know, because, okay, maybe someone had their head, you know, you could not see their face. But, you know, what is the purpose of showing that, except to just show an idiosyncrasy of the moment? And you also always need to compare it to the way in which the traditional image was. Would tend to show things in a manner that was more. That tended to be more ordered and tended to show the pattern of reality. And this movement, this transformation, it's there even in the great artists. It's there in their lives. And so if you look at someone like Michelangelo, the Pieta has this very powerful image in terms of emotion, in terms of realism, in terms of showing, you know, the Virgin's fingers on the skin of Christ. You know, these little details, like the finger of Christ that is caught in her clothing, like these little beautiful little details have, nonetheless something to do with this kind of movement towards idiosyncrasy. And this movement towards idiosyncrasy appears in the Pieta Already as something like a beginning of that. You see it in the way in which her clothing, the Virgin's clothing, is represented. So if you look at an ancient image, you know, here's an image of the Virgin here. There was a way in which, although it wasn't completely ordered, the clothing was showed with a certain restraint. And so there was. There were patterns of fold and everything. And so it's not like it was just completely straight, but there was a certain restraint to avoid, you know, to show something that is completely chaotic, especially in her veil on her head. That would have been the case. But of course, here you see, you know, her clothing completely frumped and completely mixed. And this is, of course, to show her emotion in this. In this crucial moment, which, like I said, is very effective. But when you get to the end of the life of Michelangelo, he is really taking this Mannerism to the extreme. So if you look at the Florentine Pieta, you can see how twisted and how strange the proportions are. Look at the proportions of this woman compared to the man behind Christ who is holding him. You know, look at how his body is twisted, how his arm is completely twisted, how his leg is folded in ways that are no longer even have the subtlety of what is, of what is in this image, but really push the deformation of the body to extremes. This has many corollaries. It has many things that it involves. And what I especially want to show you is, of course, El Greco. And so El Greco is a great example of what's going on in terms of art as something like desacralization. Because El Greco, in his own story, moved from being a traditional icon painter to being a Renaissance painter. And you can see in his art very strange things going on that we can look at. So, of course, this image here on the left is a version of a traditional icon. It has a Western flavor to it. It shows the ascension of the Virgin and her dormition. Down here, the clothing of the apostles is done in the traditional style. This kind of gathering, the way in which the architecture is shown from the outside with a gold background, all this represents at least a ordering on the pattern. So what I want to suggest in this move towards Mannerism is really a kind of inversion. And the inversion appears visually. You can see it visually. It appears in. You could say something like it is in some ways the perspective of the earth, you know, or the earth kind of moving up and taking the place of heaven. This, of course, appears in the showing of idiosyncrasy, the. The emphasis in Idiosyncrasy, but it can be shown in many ways. So if van Eyck shows it as showing the little details of the, you know, the fold and all this kind of luscious, beautiful stuff, then in El Greco you find stranger things. Now you find what I call angel upskirts, which is one of the strangest thing in medieval patterns. So what is happening in this image? Why are we seeing up this person's skirt, up this person's clothing? Why is this vision of kind of seeing up? And there's a sense in which you really do get a strange inversion that's going on, you know. And it's the same with some of the positioning, for example, of these little cherub babies, you know, with the. With the leg up and kind of not being very careful of showing here, you know, what's going on with the legs up and kind of seeing in there. It's very disturbing what is happening. And so why is this happening, you know? And it really is a kind of inversion and a kind of a movement from below all up into the sacred. Now, I know that some people might think that I'm exaggerating, but I'm going to show you a few more images of. Of El Greco, and you'll start to see that this starts to be a pattern, you know. And so you can see again, seeing right into underneath the skirts of the angels, like this one is a little. Is even more egregious. And seeing these. These kind of cherubs from behind with their legs up, it's very disturbing in terms of what it is suggesting in terms of, you know, in terms of focus and in terms of what is important. Now, there are more egregious examples in El Greco. I'm going to show you some more, even more egregious examples. Now. These are the most egregious now in terms of what exactly is going on in El Greco, and why are we seeing this mannerism, what is involved, the mannerism, in terms of a kind of inversion? Now, the inversion here appears many ways. And so you, of course, you have Christ resurrecting. And, you know, this is a. Despite the fact that Christ is naked, you know, there is a kind of, you know, there is a kind of, you know, a centralization that the character is in the middle. He's putting his hand out. There's something about it which has a regal quality, which isn't completely weird. But then what's going on over. Over here? Why is this character that is upside down, you know, naked with his head from behind. And then you think, well, that's strange. But then you realize something even strange is going on. What is going on with this person's foot? Why is this leg going down in between the legs of this upside down character that is there on the ground? You know, and you might think, well, okay, Jonathan, you're just seeing things. Obviously, you're just seeing things, you know, but obviously this is happening. But if, if it was just this, you would think, maybe it's not that big a deal. But then why is this man's sword going up here? So why is it the same guy has his sword going up into this area and then at the same time has his foot going down into between the legs of this upside down character? Now these is. This is more than just a coincidence. And it shows you this strange kind of upside down thing which seems to be happening already in late Renaissance art. You know, whether it is in terms of Archimboldo's showing of the human face made of natural things. But here you also have a strange sexual element to it as well. Now, if you look at this image here, of course, at the outset, you know, I mean, this is military scene and you have. You have the angel upskirts a little bit. Not as bad as in some of the others we've seen. It's when you look down here that things start to get strange. There are very strange things going on down here. It's supposed to be a kind of martyrdom where, you know, people are being killed. But look at down here. If you look at what's going on down here in the image, you have these upside down decapitated people. And so this is already something. I mean, to have the person upside down and decapitated is already something, but it's not. It becomes a lot weirder when you realize that this decapitated person, El Greco, put his head in his crotch, which is like, why did he put that person's head in his crotch? And so it's like, probably for the same reason, similar reasons as why he did. As why he was doing this. I can't imagine anything else. And then when you look at El Greco's image of Sinai, this is when things really kind of start to appear even more. You really see something like the, let's say the, the winning of the phallic, you could say, right? The. The sexual energy kind of taking over the sacred image in the representation in the way that it's done. It's difficult to ignore what it is that's happening in this particular image. And so if you still don't believe me in terms of what I'm trying to show you about these images, you have to understand then what happens in the story of art and in the history of art and how art no longer appears as integrative, no longer appears as something which is trying to unite opposites, but rather starts to appear as a form of opposition. And this grows, of course, not right away. It starts to take momentum in culture when you start to see things like opera appear, when, then you start to see things, you know, in the great painters that are very legendary, in the musicians, you start to see culture as opposition, you know, as dialectic, rather than culture as unitive and as bringing opposites together. And so these are opposites, of course, that you, you will recognize if you're attentive to, to culture. And that grows and grows until in the 20th century, you really reach almost like a. A kind of. It reaches a head where all of a sudden the, you know, the, the culture becomes dialectic to a point where it's almost a caricature. And so of course, in these oppositions or in this dialectic, you find the coming about of high art and low art, this idea of the difference between art and craft, or art and folk art, the difference between something which is meant to be purely aesthetic and then something which is meant to be functional. Think of how boring the industrial objects are. And then think of how at the same time as this development of the industrial object, there is the fetishization of the art object, which is supposed to be purely aesthetic, without any function in the world. And then the industrially made object which is purely functional and doesn't try to have beauty or to try, have any aesthetic purpose. And so of course, we have the opposition of art and industry, the difference between the pure expression, the pure artist and the commercial artist. And realizing you have to realize that all these opposites didn't exist before, didn't exist before the acceleration of the narrative of the Renaissance, you could say, into Romanticism and then into modernism, art and advertisement, the difference between man made and machine made, etc. Etc. You can look at these opposites for yourself. And then this of course becomes a. There's a kind of pendulum which starts to swing in culture between what you could call neoclassical movements and then romantic movements. And so if you look at the Renaissance and the Mannerism, then you can kind of understand that movement. There's a movement towards a kind of purity and a kind of excessive order, like a kind of weird tyranny. And then in it, you also have this desire to show expressiveness and transformation, and you see that in the arts themselves. So if you look at Baroque art, for example, if you look at a Rubens, you'll notice that it is. It looks chaotic, but underneath is this iron fist of geometry and control, which wasn't as much there in the medieval art. There was geometry in medieval art, but it wasn't as radical as what you end up finding even in the Roman. Even in the Baroque, where the Baroque also looks, let's say, also looks like it's chaotic. So it's interesting to see those two extremes appearing, even sometimes in the art itself. So this now sets up a kind of dialectic where now you have a revolutionary movement in art. So you can understand now when I tried to show you that, when I showed you the El Greco ad, you can understand the movement as revolutionary. So here's kind of idiosyncrasy trying to take the place, here's desire. There are different ways to show the bottom of the pyramid, you could say, but always trying to kind of rise up and take the place of the tradition and the patterning. This will then kind of appear in the history of what we could call avant gardes. And so this idea that now there are these new artists that come about and try to take the narrative from the artist before this is what we consider to be avant garde thinking. This, of course, expresses itself so much in the Impressionist. The Impressionists appear as these revolutionary figures who are trying to take the narrative from the kind of more classically looking academic artists that are there on the spot. And it's important to understand the themes of the art. The art becomes more and more about the common. It comes more and more about everyday life. It becomes more and more about explicit sexuality and sexual encounters. And then it also becomes more and more about the mechanistic. This is one aspect which we forget about the Impressionists is that they were obsessed with progress and technology. And so, you know, Manez, this is Monet, sorry, Monet's showing of the trains and the smoke coming out of the trains with this celebration of technology and of technification of society that this can. We often think of the Impressionist as being more kind of dreamy and almost opposed to industrialization and technification. But they go hand in hand, and they saw themselves as going hand in hand. But in this kind of separation of high art and low art. But what you see is that in some ways the low art, or what is considered low, is constantly trying to be lifted up into the high, despite the opposition. That's the revolutionary move. And so as soon as you set up this opposition, then you see that the ones below try to take the top. And so the Impressionists were on purpose trying to make paintings that were bothersome to the elites, that didn't have the kind of smoothness and finesse that you would see in the academic painting. The. And all of this, in this kind of desire to create this revolution. You can see, of course, in Manet, you know, this image which was so scandalous at the time, and you can understand why it was scandalous. You know, we're so blase that we don't realize that to show a woman naked in a. In a park with two men is extremely scandalous. It's. It's a. It's vulgar. It's trying to imply all kinds of, of sexual things, you know, and so the idea that now this is supposed to be high culture, you can understand why it was resisted, but you can also understand why Manet did it, because the very movement of the art is revolutionary. The movement of the art is to bring up the stuff below, bring it up into the elite. And so there's this strange relationship which continues to happen. This, of course, goes into absolute extremes when we come to modern art. You know, I'm going to look at a few images. Of course, Marcel Duchamp was a genius at this. Marcel Duchamp was a genius at inverting art completely. And so if you think. Think of the art already of El Greco as a kind of inversion, you know, as this showing of the angel upskirt. And, you know, this, this kind of turning upside down of the figures, this, these suggestions of sodomy, the suggestion of whatever, autoerotic, whatever that happened in El Greco then become more and more explicit as the works progress. And when you get to Mahsa Duchad, then of course, this becomes extremely explicit. You have in Mercedes du Shah, you have, of course, the urinal is the most known of his works, where he just takes something common, but not just common, but something that is there to receive our, you know, our waste and then prize to bring it up into the gallery. Now doing that is no different than what Monet did or what Manet did. And it. Honestly, I don't think it's different than what was happening at the time of the manarest. It's just that this wheel of extreme revolution always has to get, let's say, move faster and faster. And so by the time you get to. To Duchamp, then you have These radical moves, which is taking, of course, taking something that's there to receive waste and putting it in a gallery to be exposed. But then also the way that he uses graffiti on what, for them would have been the traditional art. So you have a Leonardo painting, which is considered the height of art and the height of traditional culture, even though even at the time, it was meant to be kind of disruptive and a new type of art. Now the graffiti on it, right? Then putting an accident on top of marking, of defiguring, of desacralizing that art by making the Mona Lisa into a kind of transgender character. And then, of course, in this inscription below, L hooq. It's a French play on words, which is relating to sodomy. And so it's like a joke on Sodom that is being suggested in Duchamp's work. And like I said, this was, in some ways, that is the ultimate move, right? That's the ultimate idea of revolution, you could say. And the same with Duchamp was also obsessed with mechanical works. Showing this Grand Jatte, which is supposed to show, whatever, several sexual encounters between a woman and different men. But then that is broken down into mechanical processes. And so this obsession with the sexuality, but also the mechanics of it, the idea of showing this stuff down below, right? The way that things work and the way that things work, like a bunch of levers and a bunch of biological processes that are represented as just mechanics and industrial mechanics. Industrial. And so this continues. There are many examples. Francis Picabia is a great example, because Picabia, he was also obsessed with the machine. You know, you can see here, it says woman, man. So this is the woman, this is the man. And so this is supposed to represent a sexual encounter that is mechanized and that is reduced to it, to that kind of mechanistic relationship. But Picabia was also really good because he. He had a really good sense of integrating bad art into the fine art. And so he took kitschy art, you know, like bad clown art, stuff that was popular culture, stuff that wasn't at all considered elite. And then he tried to integrate that into high art. You see this, of course, he was painting badly on purpose and was doing, you know, these kind of bad faces and these kind of really bad compositions. It was like bad art. But he was trying to make bad art in order to bring about this revolutionary movement. So think about, if you can see it in that line, you can see that there is a coherence in the transformations that start in the Renaissance as a kind of revolutionary move, a move towards idiosyncrasy and towards showing the lower things. And then those accelerate and accelerate until you get to this, which is. In the very means of art, there is a desire to be crass and to show things that aren't well painted, things that are. That are not well composed, but then try to bring that into the high art. And this, of course, is just this movement towards desacralization. I think that it reaches an interesting peak in terms of Andy Warhol. And so Andy Warhol was a Byzantine Catholic, interestingly enough. And so Andy Warhol knew very much about icons. There's legends that he went to church every day, which. Which may be. I don't know, it's possible. But nonetheless, in his art, he is inspired by icons. And so what he does is almost like a return to iconography or ultimate desacralization, that he kind of understands, in some ways the language of the icon in a way that the Renaissance artist didn't totally understand. He understands this idea of a centralized image of something which is just framed, simply presented to you as something to look at, and then in some ways something to venerate, of course, in icons. But then what he tries to do is he tries to one bring into the space of the icon the common and the, you know, the glitzy and the celebrity, and then brings that into the. The way that he would paint these. These celebrities, this kind of simple, iconic structure. But then he also makes it reproducible indefinitely. And so at the same time, he is kind of has this mechanical process that he's using. And so, of course, here they're Campbell Soups. They're all different, right? They're all different flavors, but they have this kind of mechanical reproduction aspect to them. So he's trying to bring in mechanical reproduction itself into the art. That's why he was using screen printing. He was using these different mechanical processes to kind of bring that into the. Into the art. And so you can see it as a continuation of the revolution. But what starts to happen in pop art is very interesting. It's very interesting because what happens in pop art is that they reach into the opposition of high culture, low culture, elite, you know, high art, low art, gallery art, popular art. And they try, of course, again, to invert the relationship. You know, until then, popular art was still seen as emanating from high art. It was still seen as. In this opposition. It was seen as being influenced from that which is above. And now, all of a sudden, there's a very interesting idea, which is that the low art starts to become the influence of the high art. And so there's a desire to completely invert the relationship of art by making popular industrial things. It was already there, right? And it was already there in Peculiar Kabia and in Marcel Duchamp. But then in Warhol, it becomes very explicit and. And becomes a. A technique that he uses over and over. And so. But then this is where it starts to get even funnier and where I think there is a surprising. There is a surprising shift that happens, you know, and so the common object, the. The can of soup is an object of participation. That eating food is still something that we can claim is participative. You know, there is something. So when you buy a can of soup and you open it and then you eat the contents, it is not that contemplative thing that high art had been from kind of accelerating from the mono mo time of the Renaissance. Because one of the oppositions that happens is to make things that are useless, right? These paintings don't have uses in the world. They are just objects of contemplation. They're not like the ancient images that were there to celebrate God. They're not like the ancient objects that were there to participate in the life of an aristocrat or in the life of. To celebrate the hunt or to celebrate things that. That the people participated in, or a dance, music, or whatever it is that was there. These art objects become useless. And this is, of course, the thing that Duchamp is doing himself, which is taking a useful object and making it useless. But then that's the weird thing that happens when you get to there. So as if you're getting to the bottom, you're at the bottom of the process. And now you're basically trying to take the lowest thing you can and try to put it at the top. And then I think a flip happens, and I think it happens in. In Warhol, interestingly enough. And so, like I said, you know, a urinal is an object of participation. It's a low object of participation, but it is. And so it's like trying to take that which is still low and participative and make it useless. Warhol is doing the same, trying to take that which is low and participative and try to bring it up into elite culture, and then also making it useless, making it more valuable, at least in the elitist eyes. Then something weird happens, which is that Campbell starts to make cans of soup that are based on Warhol's designs. And so what just happened? What just happened? All of A sudden there's this strange reintegration, because in some ways what Warhol is trying to do is to praise the soup can, praise the common, bring it up into the elite space, but he's also denaturing it while he's doing it. But then all of a sudden there's this flip where now Warhol's designs of the soup cans get put on the actual cans. And so you can go to the store and then you can buy an Andy Warhol soup can and you can eat the food inside the soup can. And it starts to happen weirdly in. In other artists as well. Another pop artist especially. So Keith Haring is a good example where Keith Haring is still a gallery artist. He's still making art for, you know, that have a kind of elitist thing, but because he wants to fully invert the process. Because in some ways he. He wants to be the punk rocker who is, you know, who is with the people and, you know, elevating the people into this high cultural space. He starts to enter into the space of participation and then does. You know, a lot of these artists, even up to Warhol, would have been cautious at making like, T shirts and. And selling. Selling objects that had their images on them because in some ways it's a dangerous thing if you want to stay up in the elite. But of course, it hap. It happens anyways with this strange flip of Campbell's Soup using his designs. But then Keith Haring, he was doing it himself, which is that he was selling T shirts with his art. He was putting it on skateboards on different. Different objects. And so he was kind of bringing. The low art itself was starting to be revalued. A participative art or a more low art. And the relationship of the inversion started to become messy. And you see the same happen in Lichtenstein. So Lichtenstein is this artist here who would copy comic book panels and would make them into paintings. And so he was trying to take pop art and elevate it into the cultural space, still maintaining the opposition, which is something that happens all the time. But then at some point that opposition just collapses. And then you have pieces, for example, this, this. This one page of Spider man sold for what, like $2 million, which is just a page from a comic book that is not high art, that is actually low art, but now is being treated like high art itself. And so it collapses. The opposite, ultimately, in terms of, let's say the flip actually happens. The inversion completely happens. Because these other inversions, they constantly need the duality in order to function. And so then the collapse of the invert of the duality and things like this point towards what we could call a reintegration. It's not totally yet a reintegration. And you see something strange, of course, in Warhol happening in some of his work. You know, here you could say something that, like, this is the ultimate desacralization. Warhol did quite a bit of religious art, but then his art is of course, to manifest the reproducibility, you know, the mechanical reproduction of the art object. You know, very much in line with. Some of the early theorists talked about this. Walter Benjamin, who was a. Who was a German, I think. I think he was Jewish thinker, you know, that's considered kind of like post war thinker during World War II. And post war thinker, he really called. He was a communist. He really called to the movement towards mechanical art and reproducible art in order to destroy the sacred. He really understood that this would destroy the very idea of the sacred. But then in. In Warhol you have this weird thing where he brings that to its extreme. But then it's like. It's just so weird. It's so weird. Then they make. Last year there was a show, I think, in Brooklyn of Andy Warhol's religious art. They call it Andy Warhol Revelation. And so it's just fascinating to realize that, like, why are you making a show about Andy Warhol's religious art? Because his art is about this kind of leveling. You can see it in the work, right? It's like here is, you know, Renaissance image of the Virgin and child, you know, that next to it has just a kind of, you know, grocery store price tag, which is kind of glued next to it. But there's something strange going on in terms of the collapse of the opposite and then a kind of desire to reaffirm the sacred in the very collapse. And this is something, you know. You know, I've talked about this weird idea how this kind of double inversion, you see that like in the. The soup cans especially. But something happened recently, interestingly enough, at. At my house. I got a letter. I got a letter from the local church, you know, and I don't know how ironic this was or how conscious it was, but nonetheless it happened, you know, and I got a letter from the church, and it was a letter to ask people to tithe, you know, because there are still a lot of Catholics in Quebec. And so they kind of send a letter out in the city to ask people to give their tithe and then on the letter was Buddy Jesus. I swear on the letter was Buddy Jesus. And, you know, this image is of course, used to kind of mock the Catholic Church for trying to be cool, for trying to make its art accessible to people. And then this priest uses the very image that was used to mock them and then uses it as an image for asking people to tithe for the Church. Now, like I said, I don't totally know how conscious the priest was of whether or not, you know, maybe he is so like Vatican II guitar Mass, that he thinks this is okay, which is hilarious, or he's a little conscious of what's going on, and he's using the imagery of mockery in order to kind of reappeal to participation. Now, the jury is out on that. But I think that the fact that it happened is still pointing to. Towards a notion of this kind of flip. Now, you know, it's important to understand that this is there in Christianity itself, that this is in some ways part of the Christian story. We have to understand that there is a great desacralization in the Christian story, you know, and that desacralization is, of course, the crucifix itself. And the way in which the modern world move towards desacralization is in some ways a parody of this, you know, parody of the crucifixion. Maybe there might be something more mysterious going on, but we have to understand that there is, of course, this movement in the Christian tradition. It's kind of moved towards idiosyncrasy, you know, and then, like I've mentioned many times before, the surprising aspect of how Christ, in the fact that he's derided, in the fact that there is this mocking of him as a king, the fact that he's given a crown of thorns, gets ultimately transformed by Christ into glory. So I think that that's an interesting thing that happens. And I think that it's the very process of trying to revolutionize constantly. There is a moment where we get to the bottom of that, and there's a. There's a switch that happened. And I think this switch opens up some interesting possibilities to deal with questions of the whole history of art and how it can be reintegrated in the proper way. And so if you want to understand what I'm doing, you can understand it like that. You can understand that. In some ways, I feel like my work, and it's not just me, there's several artists out there. I think of Father Silouan Giustiniano and other iconographers that have come out of contemporary art and now see the possibility at the end of contemporary art to, in some ways, reintegrate. Reintegrate art into life and reintegrate and understand how this is what art calls us, what art is calling at this moment to become. And so if you look at my work through that lens, you'll understand a lot of the things that I'm doing and a lot of the different things that I'm doing. And so I do think that there is a possibility of reintegrating art into life and to do it at different levels and to do it in a kind of hierarchy, you know, a hierarchy which even takes into account the developments of. Of pop art, the developments of. Of contemporary art. But I do think that there is now a possibility to reformulate a reintegration of the hierarchy of values. And that, of course, has to do with something like appropriate beauty for the appropriate thing. It has to do with the message, but also the function. That's why, of course, I'm making sacred art that's very important. And so if I make a reliquary, you know, this is being used in a church, you know, this is not. This is not. And what I'm doing is I'm also taking the ancient art and I'm reintegrating it in a way that is also never seen before. Of course, no one has ever made a reliquary that looks. That has this together. It's a reintegration of these ancient things towards a purpose, towards participation in the world and considering a certain hierarchy. And so depending on what it is you're making, the materials, the vision that you're trying to bring to it will be appropriate to it. And if you think of here's a funerary monument and an iconostasis cross, a cross that goes at the top of the iconostasis that tries to integrate materiality and the Christian vision into something which is going to participate in reality. But there's also a kind of possibility of reintegrating hierarchy. So when you make. When you make a soup can, you have to consider the materials you're making based on the purpose that it has. And so if Andy Warhol can make a screen print of a soup can, and it's kind of arbitrary, maybe not completely, but kind of, then once they take Andy Warhol's design and they make it a soup can out of it, then they have to make the soup can out of aluminum or tin. They have to make the paper out of paper. You know, they have to put the soup Inside the can, the soup can't be made of paint or else people won't buy it, people won't eat it. And so there is a, there's a possibility. And the same with Keith Haring. Like if Keith Haring made a skateboard with his print designs on it, he couldn't make the skateboard out of something ridiculous. He has to make the skateboard out of something that can be ridiculous written. If you make a T shirt, you have to make the T shirt out of something that can be worn. You can't make a T shirt, you know, out of some imaginary artistic, creative thing, or else people won't buy the T shirt. And so that's what I mean by this kind of reintegration. So there's a kind of new hierarchy possible which takes into account the function of materiality, you know, the symbolism of materials themselves, what their purposes are and what they can be used for. And so you have this, this great thing and then you, you have the possibility of creating a kind of hierarchy again between handmade to mechanical objects, all the way down into digital objects. So you make. And if you're going to make a unique piece for a church that is, that, that is going to go into the altar, you know, if you make, you make a precious image using semi precious stones, using gold, using all these, these techniques that are unique and they're kind of pointing up towards participation in worship, but also uniqueness, then you're not afraid to also kind of devolve that into, into other things. And so, you know, if you make, if you make a T shirt, if you make a print, you can use some of the same images, you can use some of this similar, similar tropes, but then they get applied differently depending on the purpose that you're trying to apply them. And so, and then you can also use. So here I wanted to show how I use similar images, similar structures as my iconography to make a secular image of a siren. And then if I apply this type of thinking to prints and to T shirts, then I applied appropriately to that level. And the same goes for. Here's another example where I made a kind of semi precious image in terms of the angel. And then the same on a T shirt gets applied appropriately and mechanically. And that's okay because it's not meant, this object is not meant to be liturgical and it doesn't have enough to be liturgical in its structure. Here's another example, of course, that helps you show the shift between purposes and how they get integrated and people you know, and then Even in terms of imagery, the. The, let's say the imagery that I use is different. And so when I make an image for a church, I will, of course, let's say, use sacred imagery very clearly, have inscriptions there. There are kind of rules that you use in order to make images for churches. And then as you move down towards, let's say, more popular art and. And clothing, for example, I would make what I could call semi icons. They're not icons in the sense that, you know, these figures are not people that are represented. They are. They are kind of. They are allegorical or they're analogical representations of the Evangelist. And then angels are also not. This is not a representation of a person. Say Michael, St. Michael doesn't wear an armor, and he doesn't. He doesn't have wings. This way, you know, this is the way that we represent angels is analogical. And so that's why in my T shirts, I tend to have things that are semi icons that are not icons in the traditional sense. You'll never see me making a T shirt of Christ, you know, just with his halo. It'll always be something that is mitigated, you know. And so if I make an image of the. When I made the image of the. An image of everything, you know, the faces, they're not completely done. I try to. I leave some elements out of the face in order to. Not for people not to mistake this with an icon to be venerated. There are different techniques that I use in order to try to make something like semi sacred images that are lower on the hierarchy but still participate and still remember, you know, and then, of course, going all the way down into pop art. Then, of course, the, you know, as, you know, the. The making of God's Dog was about. That was about, can we get all the way down into very popular art that is remembering its connection to the sacred, that is participating in it. But at its level, these aren't icons. These aren't meant to be liturgical. And that's why they're also printed mechanically. That's why they're drawn in a way that is more sensuous, that is closer to the Renaissance tradition, further from the iconographic tradition. But that's the idea, that's the interesting possibility, is that in some ways we have the possibility of kind of moving away from the irony that came about through this whole history, this revolutionary aspect, and try to reintegrate things at the proper level, where they belong or where they should be. And of course, there could be discussion about where things should be. And I know some people think that I'm going too far with my. With my popular art in terms of the images I use. But I think that that's a discussion that will happen and there'll be some play. But the thrust, I think, is important, the thrust of thinking about this, of understanding how we can reappropriate participative art in different ways. I think it's very important. And I think in some ways the state of contemporary art almost calls to that. Right? We're at that level where the irony is so strong, where the inversion is so strong. But then there's also a weird moment of double inversion that's happening that's kind of calling towards new participation. So hope this was helpful and interesting in order to kind of understand why I'm doing the things I'm doing, but also how the history of Western art has a coherence when you start to think about it in terms of this simple, revolutionary move, which started, I think, somewhere around the time of the Renaissance and continued until today. So thanks everybody for your attention. I'll talk to you very soon. I hope you enjoyed this episode of the Symbolic World. The Symbolic World is based on a series of videos that you can find on my YouTube channel, Jonathan Pageau's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by, of course, leaving a review on itunes. Everybody knows that's the best way to get the podcast out there, to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon, the Pageau videos as well, and on subscribestar, all those links you can find on my website or in the show description. So thank you and I will see you soon."}
