{"episode_id":"SW - #297 - 2023-07-20 - Rumpelstiltskin - Credit and Resurrection","start":0.64,"end":34.84,"speaker":"Jonathan Pageau","text":"As you know, we are currently crowdfunding Snow White and the Widow Queen. And I thought that in this context would be a great idea to put out some old patron only videos that interpret fairy tales. It gives you an idea of what it is that you can find when you support the symbolic world. But this one in particular is the strangest of all. It is the story of Rumpelstiltskin and I interpret it in relationship to understanding how credit works. You know, it sounds very strange, but it'll help you kind of understand what it means to borrow from the future, what it means to borrow from the strange, and what cost that has and."}
{"episode_id":"SW - #297 - 2023-07-20 - Rumpelstiltskin - Credit and Resurrection","start":34.84,"end":36.44,"speaker":"Jonathan Pageau","text":"What opportunities that brings."}
{"episode_id":"SW - #297 - 2023-07-20 - Rumpelstiltskin - Credit and Resurrection","start":36.52,"end":1727.55,"speaker":"Jonathan Pageau","text":"So this will be the last video that we're going to put out in this series, Interpreting Fairy Tales. If you haven't backed Snow White and the Widow Queen, please do it now because it's. The time is getting short and. And enjoy. This is Jonathan Pageau. Welcome to the symbolic world. Hello everybody. I am currently in Charleston, South Carolina. I come here every year to do some work with my collaborator and good friend Andrew Gould, who's an architect. I have an interview with him on my channel and if you want to check that out. But I thought I would take some time to make this video that I've been planning for a while. And it's a video on Rumpelstiltskin, the symbolism of Rumpelstiltskin. You will see that I'm gonna take you guys, I'm taking you guys to expert level symbolic interpretation here. And so hopefully I'll be able to pull it all together and hopefully you'll be able to get something from it. Now one of the things I like about the symbol, the story of Rumpelstiltskin, just how strange it is. I really love the strange fairy tales because. And also the strange verses and the strange parts of the Bible, because that's the place where you can surprise people the most and show them that. No, actually, despite the fact that it looks completely off the wall and weird, the structure of the story is actually quite coherent. Now, the story of Rumpelstiltskin. I'll tell you the basics of the story as I usually do, and then we'll go into the interpretation. So the story starts with the idea that some poor man is brought before the king. He's presented for the king. For some reason, I forget what it is. I don't think it's very important in the story. And while he's speaking to the king, he makes this boast, which is that his daughter can thread straw into gold. And so he kind of does this boasting. And the king, you know, when he hears this, he says, okay, well, then you have to bring your daughter to me so that you can do that for me. And now the. The poor man is caught in his boasting and has to put up. Of course, he. He knows this is not possible. This. It's impossible for you to thread straw into gold. But nonetheless, he's forced because it's the king, because of all, because he's. He has no choice. He brings his daughter to the king and he presents her to her. So the poor man's daughter is caught in this situation, despite herself. And so the king tells her he's going to put her in a room and a room full of straw. And he had. And she has to thread this straw into gold before the end of the night or else he's going to kill her. And so, yeah, of course. So this. This young lady is there at night, alone in this room, and she starts to cry and she start to weep that she can't do this. And then that's when this small, strange, bearded man appears. Rumpelstilts. Who. He doesn't say his name, of course he appears and he makes a deal with the lady. He says, you have to give me something. If you give me something, then I will be able to change this straw into gold. And so, you know, she has a necklace or a bracelet. And so she gives this to Rumpelstiltskin. And Rumpelstiltskin works all night threading this straw, changing it into gold. Of course, the next day, when the king discovers this, the king is extremely happy. But as most people, he. He just sees that he could get more. And so he brings her to a second room that is even bigger and has more straw. And he tells her that she has to do it again, and if she doesn't, he's going to kill her. So once again, she cries and cries. Rumpelstilts appears. Same deal. Make a deal, exchange something for him to change straw into gold. She exchanges another piece of jewelry and. And then finally he works all night. And once again, he is successful. And once again, the king sees this. And just like all fairy tales, the rule of three, it has to happen three times. The third time, the princess goes in and she's crying. She's crying, but now she has nothing left. She has no jewelry. She has nothing to give Rumpelstiltskin. And so the king also says that this time, if you don't succeed, of course I'm gonna kill you. If you do succeed, I will marry you. And so there she is in this room, desperate. And Rumpelstiltskin appears again. But she has nothing to offer. And so Rumpelstiltskin tells her that she has to give him her firstborn when her firstborn comes to be in the future. Of course, for those who have followed my videos, you probably know what this is about or what's going on here, but try to figure it out as I'm telling the story. Hopefully you'll get some hints. And so the Princess is desperate. You know, she has no solution. And so, you know, despite herself, she agrees to this deal. And Rumpelstiltskin does it. Here you go, there's the gold. And the king marries her. Very strange situation. The king marries the woman that he wanted to kill, but nonetheless, the princess marries the king. And, you know, they live their life. And of course, as per the usual ways, she gets pregnant and she has a child. When she has a child, who. What do you think happens? Rumpelstiltskin shows up and demands the child. So the woman cries and cries and weeps and says, please, please don't take my child away. What can I do? There must be something, you know, give me a chance or whatever. And then Rumpelstiltskin proposes that if she is able in three days to discover his name, then he will leave her with her child. If she is not able to discover his name, then that's it, the end of the deal. He keeps the baby. And so Rumpelskilton goes away and says he'll come back once every day. And she has three chances, three days to find his name. So, of course the princess goes to work, you know, by this time she's the queen, I guess this queen goes to work and tries to gather in all the names that she can imagine, all the names you can find. She asks her servants to gather all the names and the kingdom, you know, to figure out, you know, what name. And so when Rumpelskilson arrives, she has this list of all these names that she was able to find. So she starts to say, is it Robert? Is it George? Is it Patrick? And she goes on and on, she goes down the list, and every time Rumpelstiltskin says, nope, nope, nope, that's not it. Nope, that's not it. Goes through all the names, and of course, she doesn't succeed. Rumpelstiltskin, of course, finds this extremely amusing, is overjoyed by this and says, well, I'll be back tomorrow. We'll see if you can do it tomorrow. So he leaves. She sends now her. Her servants to all the adjoining kingdoms, to all the kingdoms nearby, to try to figure out all the different names that she didn't account for in her own list, though they go out and they go a little further out and the names are becoming a little stranger. Different names. They write them down, make lists, bring them back to the princess. And once again, the princess starts the naming process when Rumpelstiltskin arrives. And is it. I don't know, is it Vladimir? Is it? She starts finding the stranger names that are from further away, you know, and robots says, no, that's not it. No, that's not it. No, that's not it. And of course, once again, on the third day now she sends them out to the furthest regions of the world, to the furthest areas of all the kingdoms that are far away, that nobody knows much about, to gather all the names and to bring them back to the princess. So she has all these names, and she's afraid because she's wondering, is she going to be able to do it? Is she going to find Rumpelstiltskin's name? And then her last servant arrives just before Rumpelstiltskin does and says that he got lost and he wandered, and he got lost in this forest. And then in this dark forest, he heard this little imp that was running around a fire and was singing to himself that he was going to have the queen's child and that he was going to have a baby that for himself. And he says, and he says something like, you know, and she wouldn't able to be to fool Rumpelstiltskin, something like that. But he says his name, that's the point, is that he's boasting to himself as he's kind of boasting of his success. He says his name. And so the servant says, maybe that's it. Like, that must be his name. So, of course, the queen, now she's got her tool and Rumpelstiltskin comes in and he says, this is it. This is your last chance. And she starts. She starts, she gives a few names at the beginning to get him on his way to say, no, that's not it. No, that's not it. And then finally she says, is it Rumpelstiltskin? And then the imp at first is just gonna say, no, but then he realized that, no, she got it, she got his name. And so there's different versions, like, he becomes really furious. Sometimes he vanishes in a puff of smoke, or he leaves and makes a hole in the in the floor as he goes away. But finally, the queen succeeds and is able to keep her child. All right, so what is this about? I imagine some of you might have gotten to the fact that this has something to do with this discussion about credit that I've been talking about. And so, Rubble, Steelskin, it all starts with the proposition of something which is impossible, the boasting of the possibility of something which is not possible. Okay, now you have to think of that in terms of what borrowing means, right? What credit means, because that's something. That's pretty much why we borrow in the first place. It's like, I want to buy a car that's not possible. I don't have the money. So what do I do in order to have access to that car is I'm going to borrow, right? I'm going to borrow from the future in order to be able to have the car now. So that's the beginning of the problem. He proposes something impossible. So you can understand in terms of this credit, but you can also understand it in terms of a scientist who imagines something impossible, like, you know, like, let's go to the moon, you know, like, I can go to the moon, something like that. And so that possibility doesn't exist within the world right now. And so the only way to get that possibility is to increase your reach. You could say to. To reach out into the future, to reach out into the outside, to reach out further than what you are, and to be able to gather that to yourself in order to accomplish this, this boasting that you've done, this proposition, this imagination or whatever. But so on the one hand, the. The image of turning straw into gold is an image of something impossible, but on the other hand, it's actually an image of. It's an image of the purpose of everything. Now, what do I mean by that? The idea of changing straw into gold is the same as the, you know, the idea of changing lead into gold that we find, you know, in ancient sciences. And it's also the idea, if you want to understand why, how this notion of changing straw into gold is. It can help you understand, for example, why is it that Christ was put into a manger? Why is it that Christ was put into the food trough for animals? Because straw, that's all that it's useful for. It's not useful for our food. It's lower than us, right? It's the remainder. It's the grass of the field. You know, it's like this dust or whatever. It's not that which we can integrate, but it's lower than us. And you can see it as this notion that it's something that animals can integrate. And so this image of Christ in the manger is the same idea of taking that which is the lowest and turning it into the highest. I've been telling you guys about this for months now, that changing death into glory, that is the purpose of everything, right? And so. And you find it in images like that. So, so, so here's this useless thing, this straw, this, this kind of the lowest thing. And so the question is, can you change that into gold? Can you change the lowest into the highest, the last into the first? And that's the transition spot. That's the place where something ends, something begins. There's a mysterious thing that happens. You know, the sun sets, the sun rises, the, the, the. The solstice where the sun is the lowest and flips into the highest, the seed where. Which falls into the ground and dies, but then becomes a tree. It's like all those images, like, how is it that something that's the lowest can flip, can turn into that which is the highest? How can the ornament become the crown? All of this, this is one of the biggest mysteries in the world, really. And so the story of Rumpelstiltskin is dealing with this mystery. And so what imagery does it propose? First of all, it's important to understand that the transformation happens at night. That's all that's very important. So you can imagine the transformation happening in the bottom of the ocean where Jonah is in the whale, and then he repents, he flips, and then he comes back out. You can imagine it as Christ in the tomb, who mysteriously, something flips and then he resurrects. Now it has to happen at night, just like the sun is gone at night, but then it's out of night that the sun comes back up again. And so it happens at night at the time when we're supposed to rest, at the time where we're not supposed to work. So there's this upside down thing going on where the imp is working at night. And that is the opposite of what should happen. You see that in several other stories, like the Shoemaker and the Elves, where while you're resting or while the world is supposed to rest, there's a secret work that's happening. Okay, that is 1, 2 is the very image of the wheel, this very image of the threading wheel that changes the straw into gold. That is also this image of the. Of the change, right? It's an image of you could call it an image of change itself. And it is related also. This change is of course related to death. And what I'm trying to suggest you is that it's related to death, but also to resurrection. You see that in of course, this idea of the relationship between the threading wheel and death. You see it in the story of Sleeping Beauty, but you see it in this, in this situation as well. The, the life of the princess is in the balance. It's kind of up in the air, right? It's, it's, it's, it's uncertain. We don't know if she's going to come out of the box alive or dead. So in this moment of uncertainty, that's when, that's when this transformation is going to, to happen. Now then we have the, the question of borrowing from the future. So this is how it presents itself in this story. There's this idea in the problem of the impossibility. The only way she can do it is to go and take from the future, but also at the same time to take from this monster or to take from this foreign agent, you know, this agent of the unknown. She has to be able to go in there and get something from that. But it has a, it's dangerous. It has a price. You can see it in terms of the problem of borrowing, right? We talk about it in the video on credit. The problem of borrowing is that you run the risk that your fruit is going to go to that foreign agent, that outside thing. You know, there's some proverbs that talk about that. This idea that you should not go to the strange woman, you should not go to the, to the, to the, to this kind of foreign woman. Because the risk is that if you unite yourself with the strange, then you run the risk that your seed, your fruit is going to profit the outside. You know, and that's exactly the situation here. Because Rumpelstiltskin, she's borrowing from Rumpelstiltskin, but she's running the risk of making herself subservient to Rumpelstiltskin. She's running the risk of putting herself, yoking herself to Rumpelstiltskin. And that will then the possibility that her future fruit is going to go to him. It's not crazy to imagine, like to think of when you borrow money from the bank, what are you doing? You're borrowing money from the bank. And it means that you, as you're paying the bank back and you're paying back interest, your future work, the future fruit of your labor is going to the bank, you know, and more than what you borrowed. And so although it can be useful sometimes it's dangerous because you don't realize that the money that you're making in the future, that you're actually making less because you're paying interest on your loan. You're constantly giving some of your value, some of your fruit to this outside element from which you borrowed the future from the bank, you know, whatever. And so this is. This is the situation that is being set up in the story of Rumpelstiltskin. It's really showing us the, let's say, this structure of the problem of increasing your possibility. How does this happen? How does it shift? And what's the danger in this kind of. This kind of. This transformation of straw into gold? Because it's not. It's like I said, I keep trying to be saying people to be careful. Like it's neither positive or negative. You have to just understand the structure. Okay, so. So she borrows from Rumpelstiltskin, right? She owes him something, and she owes him her future son, which is an image of everything. It's an image of all her future, all her future identity, you could call. She's making herself subservient to Rumpelstiltskin because it's not just her son that's going to go to Rumpelstiltskin, but the king's son. So it's like she's giving the king's son, the future king is becoming subservient to this outside dark forest, okay? And that's because she was willing to borrow from him in order to meet this impossible requirement, right? To meet something that needed to happen, but that was impossible. All right. Hope you guys are following me until here. So that's the first part of the story. Now she's in trouble because when she has the child, then she. How can I say this? Then she becomes subservient to him. But you also have to understand that this changing of the straw into gold is not just about the straw into gold. It's also about her. It's about how she, as this lower, as this peasant girl, has also been transformed into the queen, right? It's not just the straw into gold. Her trip is the same trip as the straw into gold. And so she's able to become the queen by engaging in this. By engaging in this dubious transaction, right? Transaction that has given her value now, but that is putting her in trouble for later. But now she has to solve the problem. So it's like, you could call it that's this whole flipping thing that's going on, right? So it's a strange situation. She's the queen. She's become the queen by making herself subservient to others. Now this, this is not. Don't, don't. This is very not. There's nothing strange about this. This has happened all the time in history where someone who wants to become king or who think that they should be king, they ally themselves with a foreign power in order to be able to displace the king that's there and replace the king, right? This is not something. This is something which happens all the time in terms of politics, but it is also a transaction which you could operate on a smaller scale as well, but understanding it in terms of the person who wants to be king but can't. Allying themselves with a foreign power replacing the king. But now once he's gotten what he wants, he's in trouble because he is also, at the same time, he's made himself subservient to that, that outer power, that foreign power. Okay, you can understand it that way. Now how does she solve the problem? Now? She solved the problem by learning the foreign names. Learning names. Now this idea of learning names really is this capacity to master things. And in the traditional notion to know something's name, to know someone's name is to somehow have to be. Not necessarily to have power over it, but to have some power over it, to have some capacity to engage with it, to commune with it. It's no longer see it this way, it's no longer a dark, chaotic potential. Right? If you know the name of something, then now it has integrated into your world. And knowing the name of something can, can mean mastering a skill that you don't have. You know, it can mean all kinds of things, like you're increasing your capacity to go further out into the world. And that's how she has to do it. Now the problem is that Rumpelstiltskin comes from the end of the world. You could say he's a monster from the end of the world. And so she, she wants to get to him. She wants to be able to master Rumpelstiltskin. But so, so to do that she has to increase her capacity and conquer. You could call it conquering. She has to conquer all these names, right? She has to master these names. And so she moves out, out of her. Her sphere of knowledge and she starts to know the names of the things that are outside. So she grows her influence, her capacity to understand. Her purpose is to get to Rumpelstiltskin now, that's ultimately, right, that's ultimately an image of the resurrection, right? That is what we. When we talk about Christ descending into Hades, right? Going to the bottom of death. But he does it in a manner in which he becomes the master of death. Death by descending into death. It's like bringing light into darkness. And so he illuminates the darkness all the way till the edge. And going all the way to the edge, you have to go all the way to the end. You have to go all the way to the end. And then that's when the resurrection can occur, right? The sun has to go all the way down on the solstice to the bottom of the world. And then that's when the mystery occurs and it comes back out. So she's. She's going all the way out, she's moving out, trying to find Rumpelstiltskin's name, trying to master all this potentiality around her. And so it takes three days. I don't have to tell you why it takes three days. You know, of course, three is a number in all fairy tales, but that's also the reason why three is a number in a lot of fairy tales is a similar reason to why Christ is three days in the tomb. So. So it takes three days. She reaches, going further and further out, and finally, in the dark forest, in this kind of surprise, this unexpected moment that the servant actually got lost. He's coming right to the edge, right to the end. That's when he encounters the name of Rumpelstiltskin. And he brings it back to her so that she now can master Rumpelstiltskin. And that brings about the resurrection of the king. Now, you have to understand it, that the king was dying. That is, the son of the king was. His fruit was going to be cast away, cast out to the outside. And now by her reaching out and reaching to the edge and finding Rumpelstiltskin's name, she's able to resurrect the seed of the king. And it happens also in the way that I've tried to explain it to you before, it happens as tricking the trickster, right? Because it's so satisfying to imagine that moment when she is talking to Rumpelstiltskin and that last day where Rumpelstiltskin is so arrogant and thinks that he's got it, and she's naming these names, but he's like, no, no, no. And then finally she says, rumpelstiltskin. And it's like that moment where the trickster is tricked is so satisfying, but it's so satisfying because it is. It has that idea that that's how the world starts again. Like, that's the last trick. That's Christ going into Hades. And Hades thinks that he's won. And he thinks that I finally done it right? I brought Christ into death. But then the trickster is tricked. And the death of Christ actually is, like I said, bringing light into darkness. And so when he. He thought he won, but by the very fact of winning, he's lost. And so, so you see a little bit of that. Of course, Christ's story is a million times more, but you see a little bit of that structure in this. In the manner in which the Rumpelstiltskin narrative concludes, let's say. And so I think that I'm hoping that this has given you some food for thought. Like I said, this is really a. This is master level symbolism. Because like I said, it's not about credit, it's not about borrowing. It's not about. But all those things, like borrowing, like credit, like a kingdom which compromises itself by making itself subservient to a foreign power. All these, these parallel structures, they're. They're there. I'm bringing them up in order for you to be able to see the pattern, because the pattern is beyond all of these. These particulars, right? They manifest themselves in the different particulars. So it's not that the story of Rumpelstiltskin is about credit or about this or about that. It's more that it. It shares the pattern of these different elements of reality. And often because the story is so strange, we can't see that pattern so well. But as we start to see the analogies between the different other stories, we're able to understand how this is manifesting a common pattern and how that pattern is in fact a pattern of reality. And ultimately, maybe it is the. One of the ultimate patterns of reality, which is how does the bottom become the top? How does the end become the beginning? How does the lowest. How do we transform the. You know, it's like this is going to sound, but how does a little seed planted in dung, planted in excrement, how does that become a tree? Right? That's the. How does that happen? Right, in terms of pattern, right? Not in terms of the chemical things that happen, but that pattern is the same as these other patterns of turning and of cycling and of flipping. All right, so guys, I hope you enjoyed this and thank you all for your support. These videos are being put out for patrons only and So I really appreciate your support. As you know, I'm still in kind of a chaotic situation. Our house has not yet been renovated and so we're still in transition. It's been difficult for me to carve. So your support has been extremely helpful in helping me to keep going. So thanks again guys, and I will see you soon."}
{"episode_id":"SW - #297 - 2023-07-20 - Rumpelstiltskin - Credit and Resurrection","start":1734.98,"end":1773.16,"speaker":"Jonathan Pageau","text":"Jonathan I'm Jonathan Peugeot and I'm inviting you to participate with us in our retelling and our celebration of one of the most iconic fairy tales of all. Snow White. A beautifully illustrated storybook, Snow White and the Widow Queen places our iconic character at the beginning of eight upcoming fairy tales which will speak to each other and harmonize in surprising ways. Snow White and the Widow Queen rekindles an adventure which will make you remember, rediscover, but also marvel and wonder at our rich heritage of stories. A heritage that still has secrets to reveal even after centuries of being passed down to us."}
{"episode_id":"SW - #297 - 2023-07-20 - Rumpelstiltskin - Credit and Resurrection","start":1773.64,"end":1775.28,"speaker":"Jonathan Pageau","text":"In the past few decades, we have."}
{"episode_id":"SW - #297 - 2023-07-20 - Rumpelstiltskin - Credit and Resurrection","start":1775.28,"end":1786.92,"speaker":"Jonathan Pageau","text":"Watched many of our stories, our fairy tales, our myths become completely exhausted by efforts to deconstruct them, to reinvent them, and sometimes to even invert their original meaning."}
{"episode_id":"SW - #297 - 2023-07-20 - Rumpelstiltskin - Credit and Resurrection","start":1787.81,"end":1789.21,"speaker":"Jonathan Pageau","text":"It has come to a point where."}
{"episode_id":"SW - #297 - 2023-07-20 - Rumpelstiltskin - Credit and Resurrection","start":1789.21,"end":1898.6,"speaker":"Jonathan Pageau","text":"We'Ve almost forgotten why we cared about these stories in the first place. I firmly believe that for this reason, it is now time to retell and redisrupt our original fairy tales. In a spirit of celebration, of admiration and unashamed joy, I've spent the past two decades meditating on the strange narrative elements of Snow White and other fairy tales. After much thinking, and now bringing this story to our common hearth, we find in the fire of time ready to present hidden treasures most of us have never noticed. To accomplish this, I have paired up with Heather Paulington, a world class artist and designer who has worked on some of the most beloved film franchises of our time. Her work mirrors my writing. In a collaboration that has produced a powerful synthesis of medieval style with the best 19th and 20th century illustration. I love the Kickstarter model because we can make the book more and more beautiful with every stretch. Goal we can offer art prints, a limited edition drawing by Heather, and even a Snow White illustration of my own. Finally, we're planning a super exclusive leather bound edition which pulls out all the stops. A storybook mantelpiece for sure. The profits of this crowdfunder will be used to start a new publishing company, Symbolic World Press, whose christening publication will be this very fairy tale series. Each book illustrated by world class artists. Jack and the Beanstalk, Cinderella, the Valiant Little Tailor and several more are next in line for publication. All existing in the same world and all fitting together like a puzzle moving towards the final, surprising resolution. After all that, there's no limit to."}
{"episode_id":"SW - #297 - 2023-07-20 - Rumpelstiltskin - Credit and Resurrection","start":1898.6,"end":1899.36,"speaker":"Jonathan Pageau","text":"What we can do."}
{"episode_id":"SW - #297 - 2023-07-20 - Rumpelstiltskin - Credit and Resurrection","start":1900.64,"end":1907.84,"speaker":"Jonathan Pageau","text":"It's time to reset the clock to retell our stories. So please join us in this celebration and creative venture."}
