{"episode_id":"SW - #107 - 2020-07-08 - Why the Protests Look So Religious","start":0.4,"end":1074.99,"speaker":"Jonathan Pageau","text":"So in the wake of the death of George Floyd and the ensuing protests and riots, and with all the craziness that happened afterwards, including the destruction of statues, I wanted to take a little bit of time before I gave you some of my analyses on the situation. I'm going to separate this into a few videos. I'm going to talk about the toppling of statues. I will probably put out a patron video about the washing of feet. But for this first video, I want to look at the narrative, how it played out, how it connects very much to symbolic patterns, to our religious impulse, to things like human sacrifice and catharsis. All of these patterns that we find in human behavior and religion and in narrative. And so hopefully we can navigate through that and do it in a way which will not be polarizing, but will help us understand how. How things are playing out in terms of storytelling. This is Jonathan Peugeot. Welcome to the symbolic world. So in order to understand what is happening in terms of the protests, we, of course, cannot separate it from the coronavirus pandemic and the narrative which surrounds this pandemic. The way that it has separated society, the way that, especially in North America, there has been some polarizing discussion. Much of the problem of the pandemic, of its. How serious it was, how bold we can be facing it, became politicized very fast. And so it was difficult to navigate through the facts and through the scientific analyses without giving in to narrative. It was almost impossible. I would say that I have not heard anybody who has succeeded, because although science can tell you facts, how many people are dying, how many people are sick, how many hospital beds there are, the science cannot tell you what is acceptable, cannot tell you how many people should die, cannot tell you, cannot help you weigh between science, between the death of innocence and the economy, the fact that food might become scarce, all of these things are impossible to weigh. And so it fell back onto the narrative. And as we're watching the identity and the narrative of Western culture break apart, it inevitably breaks, would play out in that term, in terms of the decisions and the people complaining about the decisions. So that's the first thing we have to understand. So what ended up happening in the time of the coronavirus is a type of fasting. A type of fasting and a weird type of separation because of all the mask, all the confinement. Everybody became isolated in their houses, stay, stopped working, stopped communing with others. It really became almost like a monastic fast. And strangely enough, it happened during Lent, which adds to the strangeness of it all. People ended up being Forced to fast from sports, which is a big deal. It's difficult to understand how important it is because sports is a place where we can non violently put our identity, where we can non violently enact the patterns of aggression and violence related to identity. By identifying with the team, by seeing the other team as the bad guys, and by putting all our emotions into the simulated conflict, we're able to get rid of a lot of our. Of the dangerous aspects of being human, let's say. But this was taken away from a lot of people and everybody, everything just got pent up and things started to accumulate within the communities, within people. And the death of George Floyd was like a match that was put in and everything exploded. Now, one of the things that's important to understand at how religious the narrative ended up being is, is the first thing we need to see is the fact that people watched the death of George Floyd. I have to be honest with you, I did not watch it, but I would say most people ended up watching it. And what I'm told is it's very long, it lasts almost nine minutes where the policeman is crushing this man's neck and he is crying out for his mother. It's a horrible scene. And so people watched someone being tortured. Now, we have to understand the mechanisms of catharsis to understand what exactly that can do to you. One of the things that is meant to happen when you're looking at something like that narratively in terms of drama, is that is why tragedies had had such an effect on human, human culture. The Greek tragedy was exactly this thing. You're supposed to watch the hero die, the hero go down. And in this particular case, you watch someone being killed, you are watching them, you are identifying with the person dying. But ultimately what was also meant to happen was you're supposed to identify with the person that being killed. But let's say as a white person, you're also supposed to identify with the policeman who is killing George Floyd. Right? That is the. That is the catharsis moment. That because you identify both with the victim, but you're also identifying with the killer, then that is what is. Leads to the explosion, the religious explosion, which came after the witnessing of this murder. And so it is almost impossible to understand the massive protest without understanding that. And so on the one hand, you have the people of African descent who are portrayed as the victim in the situation, who are being killed. But most people, the great, the vast majority of people in North America and in Europe are still white people. And so the event, most people in the protests were white. Most people in the rioting were white as well, it seems. Maybe. I don't know about the statistic, but a lot of the images that I saw were kind of these, like, young antifa types who were provoking the riots. I don't know. But in terms of narrative, it's important to understand that, that as you watch the person getting killed and as you identify both with the person who being killed and the murderer, that's what leads to the catharsis explosion. That's what leads to people going out into the street and then communing together in mass protests. And the mass protests are really a form of religious event where you are communing together, there's mass contrition, you are asking forgiveness, you are pouring out your. Your sadness of seeing of. Of how you identify with the suffering of the one who was killed. But you. But also the sadness and the. The. The emotion of identifying also with the killer. And so it is a form of ecstasy. It's a form of religious ecstasy which we saw some people get it being engaged in. If you look at the manner in which the mayor of Minneapolis was acting, if you look at the manner in which the mayor of Minneapolis cried and had these gestures which were extreme in terms of someone who he didn't know, you can understand that he was activating a form of religious ecstasy as he was engaging in these acts now. And that is why the. If you watch the protests, if you watch images of the protests, they were religious in nature. They included kneeling, they included chanting, they included forms of, like I said, forms of contrition. Because what it, what was being called upon in watching that video was a. A form of religious catharsis which led to all of this coming together. And we need to also understand that what had been happening until then was that everybody was being pulled apart. Everybody was being held apart from each other. Everybody was being held in their houses. And now they were coming together and they were coming together under a religious guise into a common principle, into a common value. And the only common value that they are allowed, let's say, to come in together into is the value of openness. It is the value of inclusivity. It is the value of the global system. It is the value of, you know, the only value left. The value of wokeness, of inclusivity as the principle, the only principle which can unite us. And so usually principles of unity are exclus, exclusionary, right? What unites your family together is also what separates you from other families. What unites your country, your nation, your history, your soccer club, or whatever it is that unites people together also has an exclusionary aspect to it. But the last religion, we could call it the religion of the. Of the end, is a religion of inclusion. It is a religion in which the only value which brings us together is to include everything. And we can see it in the speeches of those who embrace that type of thinking. Justin Trudeau comes to mind especially because he really has been a prophet of this type of thinking, where he says things that. When he talks about how diversity is our only value, our only value is diversity. We are a post nationalist nation. All of this is the last value, this last value possible. And so. And what it does is it creates also a radical exclusion. Now that is very important. The only sin left is the sin of exclusion. And it is a sin which is unforgivable. It is a sin which cannot be. You know that you can. And there's a strange contradiction in there, because on the one hand, all the people who are meant, who are supposed to identify with the chauvin, the chauvinistic chauvin, are supposed to understand that they have this sin. It becomes the reason why they are able to commune with all of each other. But ultimately, it is an unforgivable sin and it is the only thing which will exclude. And so the only way that you cannot be excluded is by ramping up the acts which show that you are inclusive, right? All the virtue signaling we saw, all the. All the desire to take the sins onto your back in order to then at least be safe inside, so that although you cannot be forgiven, you, you nonetheless are able to be inside the inclusive group by doing that, and then all, then by criticizing and by criticizing all those that aren't as being the ultimate outsider, the only outsider, is the one who won't include everything. And the final part of this, the final part which really does make it into a religious of religion, of wokeness, is of course, the human sacrifice. Now, some people will say that I'm being hyperbolic in saying that human sacrifice was involved in this story, but I have to tell you that it is clearly there within the very narrative that the people who are engaging in this are proposing themselves. Now, of course, the first human sacrifice was George Floyd. He was of course, the first person to be sacrificed unwillingly for, for this communion of inclusion. But the very coming together, the very act of communion became a form of human sacrifice. Now, like I said, it is within their own narrative that it is so, because we saw that because of the Coronavirus, what we were told is that if you come together, if you come and meet in groups, if you go to church, if you go to your work, if you go to parties, if you invite people to your house, or all of these things is killing people. You are killing people if you engage in this. And of course, the. The ultimate version of that was when we saw that the people who were protesting the lockdown, they were telling. They were presenting them as being completely insensitive, completely selfish, because here they are killing their grandmothers and grandfathers in order just so that they can start the economy again. And so now the very same people who said that then engaged in the very act that they decried. They came together and they joined together in communion. Massive, massive communion. You know, tens of thousands of people meeting together in these protests. And they understood, even if secretly, that they were doing what they said not to do, but they were willing to accept it. And you can see that in the. In the letter that the medical. These medical people signed in order to say that they encouraged the protest, you know, that they encourage the fact that people protest racism because racism is worse than the coronavirus, and you can understand it. So it ends up being a hierarchy of values. The highest value, the transcendent value, is the value of inclusion. And you are allowed to sacrifice others for that value. It is considered a noble act to sacrifice others. Now, I'm not even saying whether or not it is actually sacrificing people. That's not the point. The point is to see within their very own religious narrative how within that narrative, that is what they're doing within their own story. They. They are sacrificing others in order to commune in the name of their highest principle. So that really cinches it, and it really cinches it in terms of a new religion. Now, I want to call out. I want to call out to all of the new atheists, all of the Steven Pinkertypes, all of these types of people who for the past generation have. Has been. Have been decrying religion in terms of the belief in the Supreme Being, the belief in the afterlife, and all of these things. Now look around you. The pattern is playing out no matter what. It is playing out haphazardly because it is happening in a manner which is not. Which is not turned towards the highest, highest thing, right? And because of that, it's going to play out in all kinds of chaotic ways and. And I dare I say in dangerous ways. But it is a religion nonetheless. And what it shows is that we have these patterns in us, we have these patterns pro. We are made as religious beings. If you try to remove religion, it is going to come back. It might not come back the way you want it to come back. And it might come back in ways which are scary and dangerous. And so we need to be, we need, we need to be very attentive to that and to remember why we have the stories we have, why the story of Christ is meant to do something similar than what we saw when we saw George Floyd being killed. We are also supposed to identify with Christ, supposed to identify with his killers. But in that identification and in that coming together, we are not left with a dead end. We are left, we are not left in with a dead end of infinite contrition and infinite guilt that we pile upon our shoulders. It is meant to bring us into a type of freedom and not a, not a, not an eternal recurrence of, of contrition that you can never get out of. And so hopefully that is going to help you understand a little bit of what is happening. And in my net, in my other videos, I will also look at some of the, the acts that we've seen, the pulling down the statues, the watching of feet and other similar things. And so I hope this was helpful, everybody and I will talk to you very soon."}
{"episode_id":"SW - #107 - 2020-07-08 - Why the Protests Look So Religious","start":1075.95,"end":1084.79,"speaker":"Justin Ward","text":"I hope you enjoyed this episode of the Symbolic World. The Symbolic World is edited by Justin Ward and it is based on a series of videos that you can find."}
{"episode_id":"SW - #107 - 2020-07-08 - Why the Protests Look So Religious","start":1084.79,"end":1088.03,"speaker":"Jonathan Pageau","text":"On my YouTube channel, Jonathan Pageau's YouTube channel."}
{"episode_id":"SW - #107 - 2020-07-08 - Why the Protests Look So Religious","start":1088.43,"end":1114.4,"speaker":"Justin Ward","text":"You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course, leaving a review on itunes."}
{"episode_id":"SW - #107 - 2020-07-08 - Why the Protests Look So Religious","start":1114.4,"end":1116.64,"speaker":"Jonathan Pageau","text":"Everybody knows that's the best way to."}
{"episode_id":"SW - #107 - 2020-07-08 - Why the Protests Look So Religious","start":1116.64,"end":1140.62,"speaker":"Justin Ward","text":"Get the podcast out there, to get it heard. And if you want to get involved, you can also support the podcast financially going to www.thesymbolicworld.com support or else on Patreon Pajot Videos as well and on SubscribeStar, all those links you can find on my website or in the show description. So thank you and I will see you."}
