{"episode_id":"SW - #235 - 2022-06-02 - Richard Rohlin - Universal History - Beyond the Horizon - Part 1","start":0.16,"end":43.57,"speaker":"Richard Rohlin","text":"People saying things like, well, okay, everything you're saying is nice for like a Eurocentric world. Everything you're saying is nice for like an American centric world. But what about people in the Far East? Or what about people in Australia? Right. So this is one of the, one of the critiques I saw on our Groundhog Day video. Oh, all the stuff you're saying about there being more light in the world, you know, you know, on the vernal equinox, for instance, all the stuff you're saying about there being more light in the world, that doesn't apply if you live in Australia. So checkmate Jonathan Peugeot to this I just have to say Australia is upside down world. People like people are walking around upside down in Australia. There are."}
{"episode_id":"SW - #235 - 2022-06-02 - Richard Rohlin - Universal History - Beyond the Horizon - Part 1","start":43.89,"end":46.37,"speaker":"Jonathan Pageau","text":"Yeah, it's the antipodes. It's the antipodes."}
{"episode_id":"SW - #235 - 2022-06-02 - Richard Rohlin - Universal History - Beyond the Horizon - Part 1","start":46.53,"end":48.69,"speaker":"Richard Rohlin","text":"There are insane hybrid animals."}
{"episode_id":"SW - #235 - 2022-06-02 - Richard Rohlin - Universal History - Beyond the Horizon - Part 1","start":60.99,"end":101.04,"speaker":"Jonathan Pageau","text":"This is Jonathan Pedro. Welcome to the symbolic world. So hello everybody. We are back for Universal History with Richard Rowland. I am super excited about the next few episodes because we are going to be talking about the Far east, about Mongols, about Prester John, about all what people consider to be all these crazy medieval legends. But we're really going to dive in and we're going to make sense of it and see how it can help us understand something about how the world works. And so, Richard, go for it. Let's do this."}
{"episode_id":"SW - #235 - 2022-06-02 - Richard Rohlin - Universal History - Beyond the Horizon - Part 1","start":101.2,"end":141.74,"speaker":"Richard Rohlin","text":"So as Jonathan and I were just discussing, there's too much stuff, like there's so many details and there's so much information that this is going to be a slow build. So everyone buckle in. My plan for this episode and our plan that we just discussed is that we're going to lay a foundation looking at some of the, basically you could say like the Ur texts for how the Christian world and how the Roman world thought about the Far east and engaged with it, although sometimes also the other way around. And then we're going to go from there, we're going to build from there and just very lightly tease the presser John stuff, which is the really fun, juicy stuff. And that's going to be next episode."}
{"episode_id":"SW - #235 - 2022-06-02 - Richard Rohlin - Universal History - Beyond the Horizon - Part 1","start":142.06,"end":145.22,"speaker":"Jonathan Pageau","text":"Who knows how many of these are going to take but we're going to do this. It's going to be a lot of fun."}
{"episode_id":"SW - #235 - 2022-06-02 - Richard Rohlin - Universal History - Beyond the Horizon - Part 1","start":145.22,"end":209.01,"speaker":"Richard Rohlin","text":"Yeah, this is really cool stuff. So I thought that we would start by addressing. I do read the comments, comments on our YouTube videos. I know that you're not supposed to do that, but I do it, you know. And one of the common things that I've seen the last couple of videos is people saying things like, well, okay, everything you're saying is nice for like a Eurocentric world. Everything you're saying is nice for like an American centric world. But what about people in the Far east? Or what about people in Australia? Right? So this is one of the, one of the critiques I saw on our Groundhog Day video, which has, like been weirdly popular. I mean, it's not weird, it was a lot of fun to do. But one of the critiques on there I saw is, oh, all the stuff you're saying about there being more light in the world, you know, you know, on the vernal equinox, for instance, all the stuff you're saying about there being more light in the world, that doesn't apply if you live in Australia. So checkmate, Jonathan Pedro. To this I just have to say Australia is upside down world. People, like, people are walking around upside down in Australia. There are."}
{"episode_id":"SW - #235 - 2022-06-02 - Richard Rohlin - Universal History - Beyond the Horizon - Part 1","start":209.33,"end":211.81,"speaker":"Jonathan Pageau","text":"Yeah, the antipodes. It's the antipodes."}
{"episode_id":"SW - #235 - 2022-06-02 - Richard Rohlin - Universal History - Beyond the Horizon - Part 1","start":211.97,"end":272.61,"speaker":"Richard Rohlin","text":"There are insane hybrid animals and people. I was thinking about this because recently I got to hang out with a friend of a friend who was passing through Dallas from Australia, and he lives in Australia and he's a pretty interesting dude. We had a meetup and I just had all kinds of questions for him about living in Australia and what's that like and things. And the thing that I came away with was, man, that's the other side of the world. Like, Australia is a weird place. Sounds like an awesome place, would love to visit. This is nothing against Australia. I know we have some Australian listeners, but Australia is the other side of the world. And most importantly, it's the other side of the world from Jerusalem. So this is the thing that I want to kind of start out by pointing out is that the Christian grammar, right. I joked to somebody the other day that this must be a universal history series, but like low key. It's actually a universal grammar series where grammar, meaning the old in the old sense, means something like the way everything connects and relates to each other and what the proper names for things are. Things like this."}
{"episode_id":"SW - #235 - 2022-06-02 - Richard Rohlin - Universal History - Beyond the Horizon - Part 1","start":272.69,"end":333.57,"speaker":"Jonathan Pageau","text":"I want to say a little thing about Australia because important to understand, let's say people will think what you said is weird, but when you understand the idea, the ancient idea that people, you know, on the South Pole or in the southern part of the world were upside down, of course we think of it in a very simplistic way, but we can understand it in a. In a little more subtle way, which is they are upside down in the, in the heavenly pattern. They're upside down and they encounter the, the pattern of the lights in the heaven. And they are also, like you said, they have all these creatures. I mean, if there were ever dog headed men, kangaroos are like good candidates for that because look, and just think of what they look like. And so, and there's a way in which when the Europeans will encounter Australia, the way it will happen will be related to the upside down. When we say that Australia was a colony of criminals, you know that there's this whole fringe aspect of Australia which is it can help you understand why the world lays itself out this way. If you think about it in the way we're trying to help you understand it."}
{"episode_id":"SW - #235 - 2022-06-02 - Richard Rohlin - Universal History - Beyond the Horizon - Part 1","start":333.57,"end":407.06,"speaker":"Richard Rohlin","text":"Yeah. And if you think about, I mean it's easy to read some of these things that we'll be quoting from today. There's a great Anglo Saxon text that I'm not going to read from today, but it's worth your time to look it up and read it. It's called the Wonders of the east. And it's basically just a catalog of here are all the weird hybrid creatures that you're going to encounter when you go out beyond the edge of civilization. And some of those things sound, oh well, clearly he's describing a rhinoceros or something like that here. But some of those things are just super weird. But also, if you know the history of European colonization, exploration of Australia, when they would send animals back, they'd shoot an animal and kill it and ship it back to England and they'd get it at the, you know, the academy in England and they open it up and dissect it and start looking for the seams on the duck billed platypus because obviously this is a hoax. This animal couldn't possibly exist in real life. Right. So Australia is actually a great example of what we're talking about. It's not a, it doesn't disprove the categories that we're using here. It actually kind of demonstrates Australia is a really real way in which, in which hybridity and the culture of the edge and the upside down world, all that stuff manifests itself. And none of that means Australia is bad."}
{"episode_id":"SW - #235 - 2022-06-02 - Richard Rohlin - Universal History - Beyond the Horizon - Part 1","start":407.38,"end":454.92,"speaker":"Jonathan Pageau","text":"And also none of it implies the fact that there isn't an inner experience of, let's say Australian Aboriginals, like these things are. But we cannot, we can only formulate the world from the perspective in which we live. And so the idea that we are formulating this universal perspective, but the universal perspective from the point of view of our own story, of our own interactions doesn't invalidate the existence or the inner possibility of Aboriginals to have their own story and their own way to fit into the universal history. But we don't have access to that. We have access to our story. And the best way to encounter even something which to us would be as strange as, let's say, Australian Aboriginals, is to be able to fully embody our own story and encounter them in the proper way."}
{"episode_id":"SW - #235 - 2022-06-02 - Richard Rohlin - Universal History - Beyond the Horizon - Part 1","start":455.24,"end":476.05,"speaker":"Richard Rohlin","text":"Right. That is a super underrated point that you just made there. Like, I feel like we almost need to spend some time talking about that later or something like that. That's the thing. Like, if you want to most honestly interact with someone else, another culture, another world, you have to honestly and legitimately and authentically embody the world and the story that you actually belong in."}
{"episode_id":"SW - #235 - 2022-06-02 - Richard Rohlin - Universal History - Beyond the Horizon - Part 1","start":476.85,"end":512.53,"speaker":"Jonathan Pageau","text":"Because one of the simple example that is biological is that when you encounter the strange, there is a danger of infection. And you can't pretend that that doesn't exist because Europeans weren't careful about the way that they encountered the strange. Massive populations were wiped out because of. Of, of not understanding that you were encountering things that don't fit with your identity. And if you're not careful, those. There can really be a destruction which is not which, of course, there was the war and, and all that kind of stuff, but even just in terms of disease."}
{"episode_id":"SW - #235 - 2022-06-02 - Richard Rohlin - Universal History - Beyond the Horizon - Part 1","start":512.85,"end":513.25,"speaker":"Richard Rohlin","text":"Right."}
{"episode_id":"SW - #235 - 2022-06-02 - Richard Rohlin - Universal History - Beyond the Horizon - Part 1","start":513.33,"end":537.27,"speaker":"Jonathan Pageau","text":"It actually could create that. That type of interaction. So think about how we talk about extraterrestrials, for example, and people are all excited about supposedly encountering extraterrestrial life, but they don't. If they don't think about it properly in terms of a medieval way of thinking, then that encounter, if it would ever happen, could completely annihilate us, even without the ill or goodwill of either party."}
{"episode_id":"SW - #235 - 2022-06-02 - Richard Rohlin - Universal History - Beyond the Horizon - Part 1","start":537.51,"end":716.8,"speaker":"Richard Rohlin","text":"Right? Yeah. So the medieval account of the world is Jerusalem centric. And this is how I want to kind of frame the way we talk about this going forward. I'm not saying in all of the series, you shouldn't be coming away from this and hearing, oh, Richard and Jonathan are just a couple of white guys with their American centric point of view about the world and things like this. I acknowledge I live on the edge. I live in the land of the barbarians, I live in the extreme West. All the things that that means and that it embodies for good and for evil. That's the world that I live in. But the medieval account of the world is Jerusalem centric. So they would put Jerusalem at the center of the map. I have a funny story about this. There was an American seminary that I walked into evangelical seminary once. And this particular seminary very, you know, had a really big focus on overseas missions and things like this. So in the lobby of their building, their main building, there's a massive like mosaic on the floor. It's a map of the world and all the different places that this denomination is sent missionaries to and things like this. But the headquarters of the denomination where you were was the center of the, of that map of the world, like laid out in terms of the floors, like we're the center, we're sending things out. And I remember remarking to a friend at the time, it's like, you know, if this was the Middle Ages, Jerusalem would be in the center. We'd be way over here on the edge, right? And that's the account of the world that we're trying to help people understand. And so when we talk about engagement with the Far east, we're really talking about the way that the Middle east engage with the Far east, which then colors the understanding of all of the sort of Jerusalem's children, right, The Christian and the Roman world during the Christian era. So that's where we're going to be doing and what I want to do in this video is just basically lay down a little groundwork for vocabulary and perception and then we can get into the really fun, juicy bits in the next video. So the or text for kind of, or the Ur texts rather for understanding Middle Eastern and therefore European engagement with the Far east is the legends of Alexander the Great. And I'm going to say legends broadly because there are a lot of first hand accounts from Alexander and his generals. And then there are other accounts that proliferated well on into the Middle Ages. For example, probably about the 6th or 7th century a letter began to circulate called the letter of Alexander to Aristotle. And there's a Greek original which is lost, but it was definitely written in Greek originally. That version was lost, but there's a Latin version that survived and that Latin version was translated other times. And for instance there's an Anglo Saxon like an Old English translation of the Latin which is actually, this is a case of the translation is better than the, the original because the Anglo Saxon version has a much more satisfying ending that's really dwelling on Alexander's mortality in kind of this melancholy way that the Anglo Saxons are really good at. So that's worth reading. And it's really actually that whole thing becomes quite important to the legends of Prester John, which we'll talk about later."}
{"episode_id":"SW - #235 - 2022-06-02 - Richard Rohlin - Universal History - Beyond the Horizon - Part 1","start":717.36,"end":747.93,"speaker":"Jonathan Pageau","text":"For people who don't know, most people will know this. But for people who don't know, Aristotle was Alexander's teacher. So there is an relationship between Aristotle and Alexander the Great. And there has been speculation all through the history to understand to what extent Aristotle's metaphysics and Aristotle's vision had an influence on Alexander's imperialism. And you know, how it is it that they continue to communicate? And so these letters pop out as these kind of legendary manners in which to explore that question."}
{"episode_id":"SW - #235 - 2022-06-02 - Richard Rohlin - Universal History - Beyond the Horizon - Part 1","start":748.09,"end":986.52,"speaker":"Richard Rohlin","text":"Yeah. And so Plutarch, for example, in Plutarch, in his lives, he has the life of Alexander the Great. And one of the most important things that comes about in the life of Alexander the Great as he makes it to India, which of course, he did do historically, is that he encounters what in Greek are called the gymnosophists or gymnosophists, the naked philosophers that he encounters on the banks of the Indus River. And you can go and read about this if people are curious. There are literally dozens of real historical groups in India that are identified as the gymnosophist. Because the basic idea of a naked ascetic is like, happens all over the world, right? Certainly happens all over the East. And there's a story about how Alexander captures 10 of these naked philosophers because they've been stirring up trouble for him. And he says, I'll let you guys go if you can answer some riddles. This is in Plutarch's lives, and this is great. And I'll give you just a couple of examples of the riddles. First one, he asks, he says, who is more numerous, the living or the dead? You know, like, are there more dead people or more alive people? And the philosopher says that the living are more numerous because the dead no longer exist. Right. Which is like a nice. That. That itself is a nice kind of riff on or play on the kind of the contrasting ideas in the ancient world between, like, the Greek world, the Semitic world, about death and existence and things like this. The second being asked whether the earth or the sea produce larger animals, said that the earth did, because the sea, but a part of the earth. So, like, all these. All these riddles, you know, are like a little clever, you know, and in the end, he. He lets them all go with presents, with gifts. And so this is one of the. But it's kind of the first recorded encounter of Western civilization with Eastern philosophy. And it's. It's a pretty neat little encounter. And ancient and medieval encounters with the Far east, other than the career of Alexander, ancient and medieval encounters with the Far east, other are geographically usually Limited to trade routes, which for the Roman Empire usually means the trade routes of what at the time was called the, at the time of crisis was called the Erythrian Sea. And the Erythrian Sea was the name for what nowadays we would call the Red Sea plus the Persian Gulf plus the Indian Ocean. And that was all understood as a single maritime trade area. And so silk from China, for instance, would have to pass over a really long overland trade route and then it would take turn towards the south, it would go to India, and then it would sail across this Erythrian Sea until it comes to Ethiopia. And by the way, this is why we talked about back in our very first videos on Ethiopia, ancient sources often conflate or combine Ethiopia and India, right? Even though Ethiopia is sort of the extreme south and India is the extreme east. Because anything coming into the Roman Empire from India would have to pass through Ethiopia. At least that was the case for a very long time. But there are other examples. For instance, Florus, who's a Roman historian, he records Chinese and Indian ambassadors actually coming to bring gifts to Caesar Augustus. Like this is at the time of Christ. And I want to read a little bit of what he says because it is quite lovely actually. He says, thus even Scythians and Sarmatians sent envoys to seek the friendship of Rome. Nay, the Serres, that's the Chinese came likewise. And the Indians who dwelt beneath the vertical sun, bringing presents of precious stones and pearls and elephants, but thinking all of less moment than the vastness of the journey which they had undertaken and which they said had occupied four years in truth and needed but to look at their complexion, to see that they were people of another world than ours. Now this is not a, like a racist thing or something like that, but it's just to say the Romans, when they encave encounter with these ambassadors of the Far east who'd come to bring."}
{"episode_id":"SW - #235 - 2022-06-02 - Richard Rohlin - Universal History - Beyond the Horizon - Part 1","start":986.52,"end":989.02,"speaker":"Jonathan Pageau","text":"Them these gifts, they notice the difference."}
{"episode_id":"SW - #235 - 2022-06-02 - Richard Rohlin - Universal History - Beyond the Horizon - Part 1","start":989.34,"end":1103.02,"speaker":"Richard Rohlin","text":"You guys are from another place. Yeah, yeah. And so in all of this literature we basically see the Far east presented to us as a land of extremes, right? So it's a world of naked aesthetics on the one hand, but then also like you could say, like unbound potential in the form of luxury goods. And I don't know, it might be useful sometimes, Jonathan, if you're just out of video ideas, to do something like on the symbolism of luxury goods and like the symbolism of decadence, Right? Because it always seems like the failure to properly orient luxury goods towards, you know, a hierarchy, say Like a crown or a throne, an altar, a church, that results in decadence. And the way that the Romans experience this is that the wealth of the east and even the kind of nearer East. So in the case of, like, Persian emperors, this was experienced by Romans as being extreme, extremely decadent. So one of the things Diocletian does, for instance, is that he basically, there are ways in which Diocletian is the first true emperor of Rome. Right. In the sense that Diocletian is the guy who basically says, sorry, you can't approach me directly. Right. And he surrounds himself in kind of the mystery and the hierarchy and the distance. Nowadays, when we use the word Byzantine to describe bureaucracy in, like, a negative sense. Right. Diocletian is the one who invents that, and he does it in kind of imitation of the great Persian kings of kings. And that whole structure was very effective for running the empire at that particular point in time. And of course, it gets carried into the Byzantine era. But at the early stage, when the Romans encountered that, when they saw their own people start to do it, they saw that as ways that the east was. The decadence of the east, you could say, was like corrupting, you know, homespun Roman virtue."}
{"episode_id":"SW - #235 - 2022-06-02 - Richard Rohlin - Universal History - Beyond the Horizon - Part 1","start":1103.02,"end":1125.9,"speaker":"Jonathan Pageau","text":"Yeah. But you can see it, you can understand it as the east itself. That is the sense in which light comes from the East. But there's also a sense in which there's something like unchecked glory is a way to understand that. And that is what accounts for the decadence of hierarchy, because that's one of the things that hierarchy offers. It offers a kind of pride and that kind of danger."}
{"episode_id":"SW - #235 - 2022-06-02 - Richard Rohlin - Universal History - Beyond the Horizon - Part 1","start":1125.98,"end":1126.26,"speaker":"Richard Rohlin","text":"Right."}
{"episode_id":"SW - #235 - 2022-06-02 - Richard Rohlin - Universal History - Beyond the Horizon - Part 1","start":1126.26,"end":1143.36,"speaker":"Jonathan Pageau","text":"So you can understand why both of those idea of the naked ascetics of these rigorous spiritual beings that exist in the east, but then also this other extreme, which is something like the dark side of light. Not the dark side of light, but the dangerous side of light in a hierarchy."}
{"episode_id":"SW - #235 - 2022-06-02 - Richard Rohlin - Universal History - Beyond the Horizon - Part 1","start":1143.36,"end":1152.48,"speaker":"Richard Rohlin","text":"I mean, it's just. I mean, you can just think about sunlight, right. If I stand in the sun too long without protection, especially at certain parts of the world, I'm going to get burned."}
{"episode_id":"SW - #235 - 2022-06-02 - Richard Rohlin - Universal History - Beyond the Horizon - Part 1","start":1152.56,"end":1153.52,"speaker":"Jonathan Pageau","text":"You can't get burned."}
{"episode_id":"SW - #235 - 2022-06-02 - Richard Rohlin - Universal History - Beyond the Horizon - Part 1","start":1153.84,"end":1194.41,"speaker":"Richard Rohlin","text":"That's it. It's that easy, right? Yeah. So there are a number of kind of important texts in the Christian tradition which help bring this symbolic experience of the Far east into the four. Obviously, there are a lot of biblical texts. And the biblical texts that are really important to our purposes are a lot of the ones that discuss Ethiopia as being an example of the extreme, the edge. And I'm not going to cover those again, because see our previous works. Yeah. But there are also these texts that talk about Gog and Magog and the enemy, like, coming down out of the north. Yeah. And we're going to talk a whole lot more about that in the next video, so I'm going to maybe just bracket that for the moment."}
{"episode_id":"SW - #235 - 2022-06-02 - Richard Rohlin - Universal History - Beyond the Horizon - Part 1","start":1194.41,"end":1229.34,"speaker":"Jonathan Pageau","text":"It's important to understand that people, ancient maps, are oriented east. It's super important to understand that. So you have the sense in which Jerusalem is at the center, we are facing east towards the sunrise, and then on our left is the north, and on our right is the south. And so these relationships are so important. And in terms of also how we experience light, on the left hand, we have the dark place. You know, we have the light coming from the east. And so all of these things will be important in understanding the way in which, for example, we understand the barbarian hordes coming down. And this idea of this dark power that comes from the north is important. We have to understand it that way."}
{"episode_id":"SW - #235 - 2022-06-02 - Richard Rohlin - Universal History - Beyond the Horizon - Part 1","start":1229.5,"end":1345.94,"speaker":"Richard Rohlin","text":"Yeah. And there's something to be said for the way that cultural memory can sort of bear a scar. To give, like an opposite example sort of would be for the Scandinavian peoples, who were themselves some of those barbarians coming down out of the north and wrecking Rome and all this other stuff. Right. But for the Scandinavian people is the invasion of the huns in the 6th and 7th century is the invasion of the Huns that basically just burns a deep scar in their cultural memory. And so for Scandinavian and Western European storytelling, the bad guys come out of the east. Right. The invader comes out of the east. And actually, this is going on. This is still going on in Tolkien, right, where Tolkien is like, here's like a Germanic mythical prehistory. That's what Tolkien kind of starts setting up to do. And so for Tolkien, you know, Sauron is in the east. The hordes, the barbarian hordes, things like that, they're in the east. And the civilization is just like these tiny little outposts on the western coast of the world. Right. Which is very much how the Northern European people saw themselves, where they had the Huns coming in out of the east and wrecking them really badly. And they're just kind of like, holding out over here. Not just the Huns, obviously, the Mongols also come out of the east and actually wreck up a good bit of Eastern Europe. And actually the kind of thing that keeps the Huns and Mongols from, like, coming all the way west is probably just the weather. At some point, the composite bows made by steppe nomads start to fall apart in really humid weather. Yeah. And so. So it's probably, probably the humidity of, like, western north northwestern Europe that that kind of saved them. But anyway, in the same kind of a way here, if you're living in the Levant, there are dangers to the. There are dangers directly to the east, usually in the form of the Parthians, the Persians, who were never seen as the same kind of barbarian. The Parthians, Persians were like, equally developed civilization. Right."}
{"episode_id":"SW - #235 - 2022-06-02 - Richard Rohlin - Universal History - Beyond the Horizon - Part 1","start":1346.1,"end":1346.46,"speaker":"Jonathan Pageau","text":"But."}
{"episode_id":"SW - #235 - 2022-06-02 - Richard Rohlin - Universal History - Beyond the Horizon - Part 1","start":1346.46,"end":1850.05,"speaker":"Richard Rohlin","text":"But also Rome's main rivals in that area. But to the north and kind of the northwest, that's where you have. The Scythians are coming from there. That's where you have all these, what are essentially Celtic tribes that are invading. And then later, a few centuries later, it's the Germanic tribes that are invading from the north. Right. Gog and Magog, which we'll talk about more in the next video. All that stuff is to the north. And of course, the north is where Alexander goes and builds his gates to keep Gog and Magog out. Yeah. So some other texts that are really important for understanding the symbolism of the Far East, Herodotus histories, which is probably we could eventually, if we wanted to do like a whole video on the histories, or maybe somebody should do like a video series on the histories. That would be maybe a fun symbolic world discussion group to do. Actually, I'll think about that, because Herodotus is. History is the first example of kind of a universal history. It was like an attempt to take here's everything we know about the world and put it together in one place. And so it's really important to this project that we're doing now. And at the time that Herodotus writes the histories, the Greeks, Persians are not really aware of the geography of India or of Asia in general, east of the Indus basin. And so Herodotus says that India is the end of the habitable world. He says as far as India, Asia is inhabited land, but thereafter all of the east is desolation. Nor can anyone say what kind of land is there. But he also talks about Indians living far away from the Persians southwards. He's talking about the Indian subcontinent and who were no subjects of King Darius. And in some of his books, for instance, in book three of the Histories, Herodotus gives an account of some of the peoples of India who'd been encountered by Greek traders and by the Persians. And he talks about them as being very diverse, makes reference to their eating habits. Some of them eat raw fish, others eat raw meat, others practice vegetarianism. And Talks about all this different. Gives really elaborate descriptions of them. Not just descriptions of them, but of the animals that live in that part of the world. For instance, there is in this part of India that the sandy desert lies here. In this desert, there live amid the sand, great ants in size somewhat less than dogs, but bigger than foxes. I don't know what he's talking about, but this vision of the giant ants out in the desert is in almost every medieval description of the east after this. So that that image, like, of giant ants stuck in somebody's mind for sure. And for instance, it shows up in that Anglo Saxon text I was talking about, the symbols of the wonders of the east, where you have the great ants out in the desert digging up gold, you know, and talking about how the men, like, scare the ants off and come collect the gold and things like this. Herodotus mentions the Indian tribe of the Kalati, for instance, who. The reason they get a mention is because they have the practice of what is sometimes called funerary cannibalism. Great name for a metal band, funerary cannibalism. Or sometimes it's called endocannibalism. Basically, it's the idea of eating your deceased ancestors, which is something that was horrifying to the Greeks. And Herodotus actually has this weirdly, almost anachronistic moment of cultural relativity or something like that. And he's like, well, we think this is terrible, but they think it's terrible that we burn our ancestors. So, you know. Yeah, so there's. There's a bunch more stuff about the Far Eastern Herodotus histories. But then the. The texts that are really, really important to us. For this series, we're going to come back to this text that we've talked about before on the show, the Apocalypse of Pseudo Methodius. This is a. It's essentially a Syrian work of universal history that is written at a really important time, a moment in time, which is when the. The Arab caliphates were really wrecking Christianity in the Near East. And. And so he's trying to kind of address that and kind of answer some questions about why is that happening? And how are the. How are they going to be judged for what they've done to the people of God? And which is very common theme in apocalyptic literature. And in this, we very. At the very beginning, we get this idea, this idea that the Far east is populated by philosop kings who are descended from a fourth son of Noah. And so I'll just read this. It says in the 620th year of the life of Noah. In the 20th year of the third millennium, after Noah left the ark, the sons of Noah established a new settlement in the outer earth, so kind of out on the edge towards the east, and named that place Famnon, which is Syriac word for eight, after the name of the number of the eight souls who left the ark. In the hundredth year of the third millennium, a son was born to Noah in his likeness, and he named him Yonatos, or like Yonton in Syrian. In the 300th year of the third millennium, Noah gave gifts to Jonatos, his son, and sent him into the land of the dawn. So he sent him farther east. The tower of Babel happens. And it says then that the Jonas, as the son of Noah, went to the east, as far as the sea and the place called the country of the sun, where the rising of the sun takes place. And he settled there. This Yonatos received from God the gift of wisdom, and he was the first to discover the practice of astronomy. Nimrod the giant came down to him and was instructed and took from him the council by which he ruled. This Nimrod was of the heroes of the children of Shem, and he was the first to rule as a king on the earth. And in the 799th year of the third millennium, in the third year of the reign of Nimrod, he, Pontipos, the king of the sons of Ham, sent strong and able men from the sons of Japheth, wise in regard to all aspects of craftsmanship and architecture, and they went down to the land of the dawn to Yonatas, the son of Noah, and built a city for him and called it Yonatos after his name. And I read all that because it's. To understand the idea of universal history in general, especially from the Syrian point of view, it's really important to understand that each of the sons of Noah have kind of their own unique symbolism associated with them, right? So you've got the sons of Shem, who are the. Basically the Mesopotamians, right? The Fertile Crescent, the Mesopotamians. These are your city builders. This is civilization. And you could say it's the closest to being something like the center, right? Then you've got the sons of Japheth, who are basically Europeans, right? And these are craftsmen. And they kind of, in this account, they kind of represent something like Techni in the service of civilization, right? And then you have the sons of Ham. And the sons of Ham are in this particular story, they are Africans. Specifically, in this passage, they're specifically Egyptians. But as Africans, Egyptians, as traders, and all that kind of the symbolism of the edge that we talked about in our Ethiopia videos. So that's kind of like the three canonical sons of Noah, if you want to say that. But then here in the Syrian account, we have this idea of the fourth son, Yonatas or Yonton, who symbolizes the Far East. And he lives in the land of the dawn. And the interesting thing is that he has, you could say, the most access to light. He lives in the land where the sun rises. He is able to learn astronomy, like real astronomy, the gift of wisdom, all these things, but he's not able to build a city for himself. So he's not able to embody himself in the world. So it takes the involvement of these other sons of Noah. And this story is probably, you could say in this, the Apocalypse of Pseudo Methodius. This is a reference to another work called the Cave of Treasures, a very, very important Syriac work that it was historically attributed to Saint Ephrem the Syrian. And it's one of the main sources, basically. The whole thing is, you could say it's like an extended midrash on Genesis. So if you want to know, like, early Syrian Christian understandings of things like the watchers and the descendants of Seth still living on the. The lower slopes of the Mountain of Paradise, whereas the descendants of Cain live down in the valley. And then Cain's lineage, they're taught by demons and they invent musical instrumentation so they can make this noise and make these sounds and actually attract and seduce the sons of Seth down. Yeah, it's a whole. I mean, it's the whole thing pretty important to. To, like, you know, that understanding of the world. We've talked about this, but that understanding of the world, and I think specifically the Syrian expression of it, is down at the roots of pretty much all attempts to write universal history in the Middle Ages. So I think it's a really important word."}
{"episode_id":"SW - #235 - 2022-06-02 - Richard Rohlin - Universal History - Beyond the Horizon - Part 1","start":1850.05,"end":1922.93,"speaker":"Jonathan Pageau","text":"So if you think about it in terms of Jonathos and the idea of the East, I mean, it can help us understand the east in its symbolism as the source of light. And so that's why Ionatos, in this case, in the positive sense, is the place of wisdom, the place of, you know, he has this secret knowledge, this knowledge of the patterns. That's what astronomy is. He kind of understands the pattern, but like you said, he needs support from the west to give him body, basically. So you have a basic image of the kind of the spiritual influence coming from the east and then the west capable of producing body so, but it's important for people to understand that because when you, when you read it, it might sound a little silly, it might sound a little ridiculous, but you have to understand that most people still think that way now, most people, even non Christian. There's a weird perversion of that, which is, you know, go to India, find a guru, go to. Go find some Buddhist master, go. So, like this wisdom from the east that comes, you know, and we are these like horrible technical people that make machines but have lost their spiritual connection. So the manner in which this is presented in these very ancient texts finds a corollary in the way some New Ager will think about the world today."}
{"episode_id":"SW - #235 - 2022-06-02 - Richard Rohlin - Universal History - Beyond the Horizon - Part 1","start":1923.09,"end":2075.86,"speaker":"Richard Rohlin","text":"Yeah, so the danger here is actually also in this story, because in this version of the story, in the Cave of Treasures, there is this guy, a priest named Edashir or Ardashir, and he sees that Nimrod goes to the east and all the stuff, and he sees that Joratos has this wisdom, this true wisdom of astronomy that he's gotten from God, right? And it says that Ardashir is a priest who ministers to the fire that ascends from the Earth. So, you know, the idea there's another source of light, but the source of light is, it's like an artificial sunrise, you could say, like as this fire that comes up out of the earth. And there is a devil that appears to him in connection with the fire. And so in this story, he asked that devil to teach him the wisdom that Yonatos has. And so the devil that appears in connection with the fire that comes out of the Earth. And obviously this is a reference to, I mean, this guy is the, the guy who founds the magi. So this is a reference he's talking about. Zoroastrianism basically says, okay, well, if you want to do that, there are these carnal rituals you have, like these incestuous rituals that you have to partake in. And if you do that, then I'll give you the wisdom that you want. So this idea of participating in these carnal rituals, you get the wisdom that you're looking for, but the wisdom that he gets isn't the true knowledge like the true astrology or the true astronomy that Yonatas has. And the idea, by the way, is that that true astrology or that true astronomy, that's how the magi knew that Christ was being born, because. Because they had access. Maybe, you know, in the Middle Ages, people believe that, that the magi had access through Daniel to like the real, the real wisdom. But that this guy is the founder of the Zoroastrian Magi. And he gets this knowledge from a devil, from a demon. And that's the. That's the introduction of divination magic, which is the main kind of magic. For instance, in the Bible, when it's talking, like all these things about witches and wizards and things like this, it's not talking about people who are, like, playing D and D and they cast fireball. Right. You know, that's. It's talking about. It's usually talking specifically about divination magic and also, like curses, things like that. Lord spirits just did a great episode about cursing and how that works and stuff like that. But so there's this idea that there is a. There's a real pattern, but then there's a danger, like a false, you know, a false riff or a false rendition of that pattern. And the danger would be going east and finding not actually the true wisdom that is from above, but this. This false wisdom that actually comes from below. Yeah."}
{"episode_id":"SW - #235 - 2022-06-02 - Richard Rohlin - Universal History - Beyond the Horizon - Part 1","start":2075.86,"end":2109.59,"speaker":"Jonathan Pageau","text":"And it's kind of instrumental and use. And you can see that. Right. In the basic narrative of the Book of Enoch, you get a similar image of it, or it's more spiritualized. We have the sense that Enoch, there are these secret patterns and there are these. All these secret patterns of reality and that the angels are the watchers over these patterns. But if they are, let's say, like the children of Seth and the children of Cain, if they come together in seduction and a desire for power, desire to make yourself more powerful, then they become a counterfeit version of those patterns."}
{"episode_id":"SW - #235 - 2022-06-02 - Richard Rohlin - Universal History - Beyond the Horizon - Part 1","start":2109.67,"end":2158.78,"speaker":"Richard Rohlin","text":"Yeah. So you could say in the Syrian literature, which is really foundational to the whole idea of a universal history, the Far east is a place from which a genuine knowledge of that which is higher can come. And even to the point of pointing you to the coming of the Messiah into the world. But that there is, you could say, like an intermediate power in this case Zoroastrianism. But you could. You could substitute anything else in that particular part of the world. Right. One of the things that we're going to see that comes up constantly is like, there's something in the. In the Far east, and then there's something at Jerusalem. And then whatever is in the middle is always a problem. Right. That's going to be one of the general patterns. So eventually it's going to be in the Far east, you have Presser, John. But in the middle, you have the Muslim caliphates, and then you have Jerusalem right here and the Crusaders and all that. Yeah."}
{"episode_id":"SW - #235 - 2022-06-02 - Richard Rohlin - Universal History - Beyond the Horizon - Part 1","start":2158.78,"end":2185.05,"speaker":"Jonathan Pageau","text":"And there's a cosmic. Like, again, there's a cosmic version of that, which is really exactly this idea. The powers of the air of these beings, you know, the jinns or whatever, all these kind of intermediate. Intermediate. This intermediary space is a space which is important, which has a function to kind of embody these higher things into things we can deal with. But that's where all the danger is, because that's where pride is. That's where desire kind of finds its. Its. Its glimmer."}
{"episode_id":"SW - #235 - 2022-06-02 - Richard Rohlin - Universal History - Beyond the Horizon - Part 1","start":2185.13,"end":2286.28,"speaker":"Richard Rohlin","text":"Yeah. Another important idea that I think also comes to the fore here, especially in the. The apocalypse of Pseudo Methodius, is this idea of someone going from Rome. In other words, Japheth. You know, Europe, medieval writers believe that Japheth was that the word Jove, like the name Jove. Jupiter was like a corruption of Japheth. Interesting. You can agree with that or disagree with that, but that's what. When people were writing medieval history, they saw Jupiter as being this, you know, like a real historical figure, one of the sons of Noah, the founder of Europe, who is then sort of remembered and worshiped as a deity. And then maybe some demon comes in and starts appropriating that worship at some point. But that. That's how they saw that. So you see. You see Rome or Japheth going to the Far east to Yonatas as a craftsman, in order to build a city or to give body to this pure Logos of the East. And this turns out to be the premise of a really important early Christian slash Gnostic work called the Acts of Thomas. And it is a Gnostic text. I don't. So I'm not recommending people go out and read it. There's a bunch of weird stuff in there about, you know, how married people shouldn't procreate, even for the purposes of procreation. And stu. Like this. This is certainly not what the Church teaches, but this is a really early work and there are versions of it that became very popular in the Middle Ages. But for our purposes, the part of that story which is important is that it has Thomas going to India to evangelize. But the way that he evangelizes, you know, he's talking to Christ and Chris is like, go into the East. And in this story, there's a. There's a legend that you probably know that Thomas was like, Christ doppelganger."}
{"episode_id":"SW - #235 - 2022-06-02 - Richard Rohlin - Universal History - Beyond the Horizon - Part 1","start":2286.36,"end":2287.4,"speaker":"Jonathan Pageau","text":"Yeah, it was his twin."}
{"episode_id":"SW - #235 - 2022-06-02 - Richard Rohlin - Universal History - Beyond the Horizon - Part 1","start":2287.4,"end":2382.89,"speaker":"Richard Rohlin","text":"Yeah. And in fact, this is even kind of like maybe hinted at in the Gospels. Right. Thomas is in hiding because he's afraid people are going to mistake him for Jesus. And kill him. You know, that is kind of in this story. But basically he's talking to Christ, and Christ is like, I want you to go to India and convert them. And he says, well, how am I going to get there? You know? And so Jesus says, it's quite simple. And so Jesus takes him down to the docks and sells him into slavery, and he sells him as Thomas. Like Christ, Thomas is a carpenter, he's skilled workman. And so Christ sells him into slavery to this Indian trader. And that's how he gets to the Far east, is as a carpenter. And this brings him to the Far East. And then we get this idea of going into the east and building a city for the King of the East. This story actually gets inverted a little bit, because what happens, this is the story of the conversion of King Gondifares, who is historical figure who converted to Christianity. And the story of his conversion is that Thomas shows up, and Thomas is a very skilled carpenter. And so the king puts him in charge of building him a new palace. He gives him a whole bunch of money, goes away, and every so often he writes Thomas and says, hey, Thomas, how's the palace going? And Thomas says, oh, it's going great. The walls are up. I just need more money to finish the roof. So he sends more money. Oh, the roof's on. I just need more money to finish out the trim work, all this stuff. So the king keeps sending more money and more money, more money. Finally, the king comes back and there's no palace. And he goes to his guys and he's like, what is going on? Where's the palace that Thomas supposed to be building? And they're all like, yeah, that Thomas guy, he's just been walking around giving all your money away to."}
{"episode_id":"SW - #235 - 2022-06-02 - Richard Rohlin - Universal History - Beyond the Horizon - Part 1","start":2383.45,"end":2384.09,"speaker":"Jonathan Pageau","text":"That's right."}
{"episode_id":"SW - #235 - 2022-06-02 - Richard Rohlin - Universal History - Beyond the Horizon - Part 1","start":2384.41,"end":2457,"speaker":"Richard Rohlin","text":"And so he's very upset and, you know, he's going to punish Thomas for this. But then the king's brother Gad dies and goes to paradise. And the angels are showing him around and they show him, and he sees this amazing palace and he says, I'd like to live there. And they say, oh, well, that should be just fine. Thomas has been building that for your brother. I'm sure your brother wouldn't mind. And so Gad comes back to life after the prayers of St. Thomas and tells Gondifares what he's seen. And Gondifares and Gad, they both are baptized, they become Christians and so on. And of course, there's a whole lineage of ancient apostolic Christianity still in the Indian subcontinent today, which was founded by the Apostle Thomas. There are a bunch of different groups and it's kind of loosely usually called St. Thomas Christianity. So I just point that out to say the Acts of Thomas, very important work in the Roman and Christian world, understanding the Far east, but also a very. And like the whole idea of the naked philosopher and all that stuff is in there too. But it actually takes this ancient sort of Syrian idea of going to the east to build the city for the king of the east, but it, it makes it a heavenly city."}
{"episode_id":"SW - #235 - 2022-06-02 - Richard Rohlin - Universal History - Beyond the Horizon - Part 1","start":2457.16,"end":2516.87,"speaker":"Jonathan Pageau","text":"Yeah. I wanted to point out one story from the legends of Alexander show about what the east could mean in terms of it's. It's also like a weird inversion of that, which is one of the stories is that Alexander comes and meets the philosophers and they're naked, they have nothing, they have no possession. Then. So Alexander wants to give them something, so he gives them this like precious oil or whatever. And of course the naked philosopher just pours it out as a libation because they can't own anything. They are, they represent this lack of absence of body. Right. They're almost like these crazy stories we hear of the naked ascetics up on Mount Athos. Right now that we're hearing from Father Stephen and Father Andrew, you know that there are, these are patterns of. These are patterns that kind of reproduce themselves and help us understand what. What is the relationship between, let's say the higher aspect and how body interacts with it. Anyway, so that's something for all of you to think about that we still have a tradition of naked aesthetics on Marathos right now."}
{"episode_id":"SW - #235 - 2022-06-02 - Richard Rohlin - Universal History - Beyond the Horizon - Part 1","start":2518.15,"end":2562.5,"speaker":"Richard Rohlin","text":"Yeah. So all of this is like a nice setup for the thing that we really want to talk about next. Because there's this, you could say this idea of the king in the East. Right. That this becomes one of the most important ideas about understanding the east when we get into the Middle Ages. So there are all these early stories of these righteous pre Christian and Christian kings in the Far East. The acts of Thomas being a really good example that are the fountainhead for what eventually becomes the medieval legend of Prester John. Right. Prester John, meaning John the priest. Prester means priest. The idea of Presser John is that he's a priest king, he's a king of the east who is also a Christian priest and is able to offer the Eucharist."}
{"episode_id":"SW - #235 - 2022-06-02 - Richard Rohlin - Universal History - Beyond the Horizon - Part 1","start":2562.58,"end":2564.22,"speaker":"Jonathan Pageau","text":"He's a Melchizedek figure."}
{"episode_id":"SW - #235 - 2022-06-02 - Richard Rohlin - Universal History - Beyond the Horizon - Part 1","start":2564.22,"end":2592.03,"speaker":"Richard Rohlin","text":"Yeah, yeah, Melchizedek kind of a figure. And this idea, I mean, when this idea that arises in the 12th century, 13th century, that there would be a Christian King out of the east, who would actually attack the Arab caliphate, liberate Jerusalem, and sort of save the Christian people in the Middle east from their oppressors. And. And so those are kind of, let's say, that's the groundwork. Those are the big patterns, and that's what starts to manifest in the legends of Prester John."}
{"episode_id":"SW - #235 - 2022-06-02 - Richard Rohlin - Universal History - Beyond the Horizon - Part 1","start":2592.27,"end":2664.92,"speaker":"Jonathan Pageau","text":"All right. And so. So I think we've got the basic structure. We understand that for the medieval Christians, Jerusalem is at the middle. It's like the heart of the world. And then you have the east, which has two aspects of it, two extremes, which could be something like the two aspects, some of the aspects of what hierarchy offers, this order, this light which comes from above, but then also the possibility of a kind of excess, of this idea of luxury and of excess, of degeneracy, which also is represented as coming from the East. There is the relation. There's also the notion that there's this intermediary space which appears in our cosmic vision of the world itself, which is that we have the highest point of light above, and then we have all these intermediary beings in between. And those intermediary beings are possibly ambiguous. They could go, they said they're good ones and there are bad ones. So you have that sense as well in this. So you can understand how the way in which the medievals understood the map itself and the way they embodied space was something which was based on their own kind of cosmic vision and will strangely manifest itself that way as well. As we continue on the story, maybe."}
{"episode_id":"SW - #235 - 2022-06-02 - Richard Rohlin - Universal History - Beyond the Horizon - Part 1","start":2664.92,"end":2684.69,"speaker":"Richard Rohlin","text":"A nice coda to leave people on. If people want to go do a little homework. For next video, go Google something called the Voyages of Raban Bar Salma. S A U M A the Voyages of Raban Bar Salma. Do you know about this? No. So I mentioned this earlier to you when we were planning, but."}
{"episode_id":"SW - #235 - 2022-06-02 - Richard Rohlin - Universal History - Beyond the Horizon - Part 1","start":2684.69,"end":2686.65,"speaker":"Jonathan Pageau","text":"Oh, this is the. This is the monk from China."}
{"episode_id":"SW - #235 - 2022-06-02 - Richard Rohlin - Universal History - Beyond the Horizon - Part 1","start":2686.97,"end":2891.56,"speaker":"Richard Rohlin","text":"Yeah. So there's a monk from Peking in China. So this is all the way in northeastern China almost, you know, like almost in Korea at this point. Okay. That's how far east this guy is. He is a. We're going to be talking a lot next time about what is sometimes called the Nestorian Church or the Church of the East. So he's a monk and a bishop in this church, and he is asked by his bishop at the time to undertake a journey to Jerusalem, to the Holy Land, to undertake a pilgrimage. And so he begins this journey all the way from Peking in what we now call Beijing. Sorry, I know that's all my old books sometimes sort of get in the way. Yeah, you guys know what I'm talking about. So he goes all the way from Beijing in China, makes it to Baghdad, makes it to Constantinople, he makes it to Rome, he makes it to Paris, he makes it all the way to Gascony, what is now called Bordeaux, France, where he meets Edward I, the King of England and also part of France at the time, and actually serves liturgy and communes. Edward the first at the liturgy. Before heading back, he stops in Rome. We're going to talk more about this next video. But he stops in Rome, he has arguments with the Roman cardinals about the filioque, which he writes about in his own first in his own words, and then eventually makes it back to Baghdad, where he dies in 1294. So the great thing about this travel account is that it's sort of. It's roughly contemporary with Marco Polo a little bit earlier, I think. But he is. It's a firsthand eyewitness account, not of the strange experience of going west to east, but rather the experience of going east to west. And the thing is, if you take a look at his account, what you will see is that even though he's from Beijing, even though he's traveling the complete opposite direction, as most of the travelogs that we think about, when we think about this, his world is also centered on Jerusalem. And what you will read is even though it seems like he should belong to a different world with a different perspective, because he also has this Jerusalem centric point of view as he travels, his account is a Christian account of the world. When he goes to Constantinople, when he goes to Rome, when he goes to all these different places, what does he want to do? He wants to go see the churches. And he has this beautiful description, for instance, of Hagia Sophia and the relics that he was able to venerate while he was there, he wants to see the churches and he wants to see the relics that they keep in those churches. And these are the most important things to him. So I think that this account really goes a long way, and unfortunately, it's not well known. And I encourage people to go out and read it. You can find the whole thing online in translation for free. But this account is a very important witness to the things that we're talking about, not just being Eurocentric, not just being like an American idea or something like this, but as being truly universal. Right. They're universal because they are first specific. Right. And it's a universal way of understanding the world because it's a way of understanding the world that is oriented towards Jerusalem. Yeah."}
{"episode_id":"SW - #235 - 2022-06-02 - Richard Rohlin - Universal History - Beyond the Horizon - Part 1","start":2891.56,"end":2899.48,"speaker":"Jonathan Pageau","text":"All right, everybody. So next, next episode, a lot of crazy stuff. Muggles. Professor John we're going to get into the real juicy stuff."}
{"episode_id":"SW - #235 - 2022-06-02 - Richard Rohlin - Universal History - Beyond the Horizon - Part 1","start":2899.48,"end":2901.32,"speaker":"Richard Rohlin","text":"It's going to. It's going to be really fun."}
{"episode_id":"SW - #235 - 2022-06-02 - Richard Rohlin - Universal History - Beyond the Horizon - Part 1","start":2901.48,"end":2902.84,"speaker":"Jonathan Pageau","text":"Going to get bloody. Also."}
{"episode_id":"SW - #235 - 2022-06-02 - Richard Rohlin - Universal History - Beyond the Horizon - Part 1","start":2903.24,"end":2905.28,"speaker":"Richard Rohlin","text":"Also very bloody. It's going to be very bloody."}
{"episode_id":"SW - #235 - 2022-06-02 - Richard Rohlin - Universal History - Beyond the Horizon - Part 1","start":2905.28,"end":2905.72,"speaker":"Jonathan Pageau","text":"All right."}
{"episode_id":"SW - #235 - 2022-06-02 - Richard Rohlin - Universal History - Beyond the Horizon - Part 1","start":2905.72,"end":2906.12,"speaker":"Richard Rohlin","text":"Yeah."}
{"episode_id":"SW - #235 - 2022-06-02 - Richard Rohlin - Universal History - Beyond the Horizon - Part 1","start":2906.12,"end":2910.04,"speaker":"Jonathan Pageau","text":"All right, everybody, thanks for your attention and we'll talk to you very soon."}
{"episode_id":"SW - #235 - 2022-06-02 - Richard Rohlin - Universal History - Beyond the Horizon - Part 1","start":2910.92,"end":2911.4,"speaker":"Richard Rohlin","text":"Bye."}
{"episode_id":"SW - #235 - 2022-06-02 - Richard Rohlin - Universal History - Beyond the Horizon - Part 1","start":2911.72,"end":2965.37,"speaker":"Jonathan Pageau","text":"This episode is part of a series of discussions I've had with Richard Roland on Universal History. You can find a list of all these episodes on my YouTube channel, or you can find them also in my podcast stream from the Symbolic World on your different podcast platforms. Make sure to check out Richard's second podcast, which he hosts in collaboration with Father Andrew Damick, called Amunsoul, which looks at the relationship between Tolkien and orthodoxy. This podcast has also inspired in me some ideas for creating some images, whether it be the King under the mountain, whether it be the Grail or beautiful Ethiopian traditions. I've created some products which you can find on my store, the Symbolicworld Store, and there will probably be more of those to come very soon. So stay tuned. This conversation is ongoing and there is still very much to explore in the Universal History."}
