{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":0.24,"end":32.39,"speaker":"Richard Rohlin","text":"Probably everything that you imagine purgatory is is wrong according to the 12th century, which is what I'm going to be talking about now. So if I describe things to you from the popular medieval experience of purgatory in the 12th century, and you're like, no, no, that's not right at all. I know I'm not coming at anybody. What I'm really interested in is the world of the Middle Ages. And, in fact, I'm going to be sort of defending why this was like a reasonable thing for them to believe. Even though it's not something that I personally believe, it's not something my church teaches."}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":32.39,"end":106.46,"speaker":"Jonathan Pageau","text":"These realities are realities that we deal with now. I don't believe in the idea that when we talk about the afterlife, that we're only talking about what happens to you after you die. The reality of sin is that it makes you suffer. When that happens, you have two choices in dealing with the suffering that sin causes in your life, and one is torment and the other is purgation. Those are the two possibilities you have. That is actually the reason you could say why sin causes suffering. The suffering is an opportunity for repentance every time. This is Jonathan Peugeot. Welcome to the symbolic world. So, hello, everyone. We are back with Richard Roland for another universal history. And Richard has a great surprise, one that I did not expect, so I will let him introduce the subject today."}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":106.7,"end":158.11,"speaker":"Richard Rohlin","text":"Yeah. Okay. So we're going to try something a little tricky today, which is going to be taking you all the way from the edge of the world, which is, of course, Ireland, which is kind of where we are in universal history right now, all the way to the mountain of purgatory in Dante's Divine Comedy and the unlikely connection between those two things. So what I'm going to try to do is to outline some things that are kind of. And I know, by the way, that in our last episode, I said, here's what we're going to do, the next two videos, and then we're not doing either of those things today, but we will get to them. But what I wanted to do today was actually to outline some things that are kind of unique and interesting about Irish Christianity, one of which is the sort of the genesis of the popular medieval idea of purgatory, which I did not know."}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":158.11,"end":183.11,"speaker":"Jonathan Pageau","text":"This is like the massive surprise, and it comes right at the right time, because as all of you might know or might not know, on August 27th, we are going to start to ascend the mountain of purgatory, Richard and I, and continue on the second Dante class, so you can please go and sign up. The first class was just an absolute blast and everybody really enjoyed it. So we're hoping that everybody will continue on the track with us."}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":183.67,"end":338.69,"speaker":"Richard Rohlin","text":"And yes. So as Jonathan said, We're starting August 27th. You can get the course now at Symbolic World courses. There are payment plans and everything there to make it convenient for you. It's going to be incredible. Purgatorio is actually my favorite book of the whole comedy to teach. It's the one that most people, when you're in school, you start, you read Inferno and that's all you read. If, if you read Dante at all in like high school or college, you probably only read Inferno. Purgatory is my favorite one to teach. It's the one that is kind of, you could say, in a certain sense, the most relevant to where many of us are in our Christian life. That is to say, Purgatorio is about the purification, right? It's about the process of becoming saints. And so whereas, you know, Inferno is like about sort of rejecting sin. And then paradise is about what is, what even is holiness. And paradise is the hardest teach. We are going to be doing it later this year. Paradise is the hardest one to teach, though, because it's very hard to explain to somebody exactly what it means to be holy. But I think all of us can understand what it's like to try to become holy. So, anyway, join us for Purgatorio. It's going to be really awesome and you're going to get a little bit of a foretaste of that today, but you're going to get it via Ireland. Ireland, yeah. All right. So in no particular order, I've been really immersing myself the last few weeks in a ton of reading about Irish Christianity and specifically Irish 6th century monasticism. So this is monasticism in Ireland in the 500s. Why specifically that? A couple of reasons. So first of all, the thing that you could say about Irish Christianity right off the bat, and it's fair to call the church of the Church of the British Isles and even sort of the northern France during the 6th and 7th centuries, it would be not an exaggeration to call it an Irish church. Even in Northern France or Northern Gaul, as it was called at the time, a lot of the main churches, a lot of the main Christian settlements there are being established by Irish missionaries. Christianity in great Christianity in Britain, it's not really England at quite at this time quite yet, but Christianity in Britain is also mainly founded and kind of directed by these Irish spiritual Centers. Yeah, same thing. In what is now called Wales."}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":338.85,"end":356.59,"speaker":"Jonathan Pageau","text":"And people have to remember that the relationship between the. The Gauls and the Irish, there is a. Affiliation like that would have been recognized by. It's not the same. The Franks, the French, as we understand them today, they're not the same peoples as the Gauls and the Gaelic people. All these people that are related to Ireland."}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":356.67,"end":433.15,"speaker":"Richard Rohlin","text":"The Gauls are Celts, as are the Welsh and the Irish. Right. And so, yeah, you're absolutely right. There is a kind of a similar culture there. And we'll talk a little bit about some of the things that were preserved in Ireland. This is actually the origin of a very compelling thesis that was really popular, I want to say, in like, maybe the 1970s, maybe that's the wrong decade. But there was this book that came out called how the Irish Saved Civilization. And the thesis of the book is not terrible. It's also very reductive. Like, almost any convincing thesis is extremely reductive. Like, his history itself is very complicated, but in the Irish, how the Irish Saved Civilization, they basically kind of posit that while the Dark Ages was going on in Western Europe, if you want to say that there is a period, obviously everybody who knows me knows I hate the term the Dark Ages and almost never use it. But you could say there is a period when, like, the Huns are invading and stuff is getting burned and stuff is getting destroyed and stuff. But Ireland was kind of far enough removed from the action that they were able to preserve learning and literacy, the Christian faith and all these other really important things. Okay. So."}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":433.39,"end":440.91,"speaker":"Jonathan Pageau","text":"Yeah, hence why Charlemagne. Yeah, Irish monks to basically help him re. Christianize the Europe."}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":441.07,"end":441.79,"speaker":"Richard Rohlin","text":"So. Yeah."}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":441.79,"end":441.95,"speaker":"Jonathan Pageau","text":"And."}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":441.95,"end":613.08,"speaker":"Richard Rohlin","text":"And again, because history is a little. Always a little more complicated than that. Charlemagne brings people in not just from Ireland, but he brings people in from the British Isles generally. So, for instance, Charlemagne's court, main court theologian and basically his minister of education was a. Was a. An Anglo Saxon deacon named Alcuin, who is my bitter enemy. Of course, he doesn't know this because he's been dead for a long time. But Alkoen didn't like icons, actually, there's a whole thing about this. But he also didn't like Beowulf. So, you know, it's just like. No, no. Well, we don't know if he liked Beowulf specifically, but he really hated stories like Beowulf. He hated that these monks were, like, writing down and telling, like, old Germanic heroes stories. And he also really rejected the idea of representational iconography. So he was okay with like, you could depict the ark in church, but you couldn't like, depict Christ. Right. And so anyway, this is neither here, here nor there, but. But yes, Charlamagne basically went to the British Isles looking for. Looking for help in trying to sort of re. Establish his educational project on the continent. So all of this to say, Christianity in Ireland and in Northern Gaul and Britain in the 6th and the 7th centuries was first and foremost monastic. So the main unit in Irish culture, in Celtic culture in general, is like the Tuat, which means basically like the clan or the tribe. So this is the sort of main unit. And then you have somebody called Duri, who is the head of the tuat. He's the chieftain, he's the warlord, he's the king. And this is basically how Irish civilization kind of arranged itself. And then you had these. We'll talk about this in a couple of videos when we look at the colloquy of the elders of Ireland, or As our friend Dr. Martin Shaw calls it, old men talking, in which you have kind of these remnants of war bands. So you have like the Tuat and which are like the. This is the ban. This is the tribe or the clan with a defined social structure and a leader. But then you also had these roving bands of basically single young men running across the countryside and causing trouble. And the main job of basically all civilization, people out there don't know what is civilization for the main job of civilization is how to. Is to figure out how to properly harness your single young males. That's the main problem that every civilization has ever had to solve. I'm really serious about this."}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":613.08,"end":613.96,"speaker":"Jonathan Pageau","text":"Yeah, yeah, yeah."}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":614.44,"end":806.22,"speaker":"Richard Rohlin","text":"But that's the main problem every civilization has. Has had to solve. So the way that they would try to. To solve these like, roving war bands, which are basically, you know, in some other age, bandits. Right. But they were like sort of like bands of heroes, you could say, in their own minds, or. I mean, is somebody a bandit or are they a hero? This is really a matter of perspective. Right? Exactly. World. And so they would, you know, they, you know, very often what you do is you try to hire these people, you give them some land and they settle down and you give them wives and they marry and they become integrated into your tua, they become integrated into your tribe or into your clan. So anyway, all this to say when Christianity comes to the British Isles under a variety of unnamed missionaries, and ultimately through via the salmon of heaven, St. Patrick, who was not himself Irish, he was British, but he came to Ireland as a missionary. After having escaped Ireland as a slave, he came back to Ireland as a missionary and sort of converts the island. And there's all kinds of stories about this. We'll probably read some of them. I mean, part of the struggle, as I said last time in talking about Ireland is the sheer breadth of the content. I have this wonderful collection just of Irish saints lives, which are so mind boggling. I mean, there's some of these saints lives, Jonathan, that we could do seven or eight videos just on the crazy, sometimes really messed up symbolism in one of these. Like, like there's some of these that are like, I don't know if I can even talk about this on the Internet. Like, I don't know if I just don't know if I can even like talk about this in public. But they're, they're really beautiful and, but, but also very strange and wonderful and so what. And I'll. We'll come back to that in a moment. But the thing I'm trying to say is that basically what happened was as Christianity was established in Ireland, that the monastery took the place of the tuat and the abbot took the place of the re. And so what you had was kind of in, in Irish Christianity is kind of this unique situation that, that does show up other places in Christianity as well, but not to the same degree or in the same intensity where almost every bishop is the abbot of a monastery. And bishops are based not out of cathedrals and cities, but they're based out of monastic communities. And then the rest of Irish life kind of orients itself around the monastic community as opposed to, you know, the situation that you have in most of the Christian world where you have a city and a bishop of the city and then there are monastic communities that support the Christians in the city, but the bishop has his like own cathedral. Right? So it's, it's a, it's a different kind of a situation. It's actually, honestly, it's one of those things like being orthodox in America today, it's not totally dissimilar from this in the sense that, you know, you still got bishops and cathedrals and things like this, but being orthodox is like, it's so weird. Like, it's so you're so sort of like kind of separate from the, the rest of the world around you in a certain way that, that everybody's kind of oriented around that community and it's not unusual at all for us to have like our bishops living in monasteries, even here in the United States. But, but at the time my bishop."}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":806.22,"end":807.06,"speaker":"Jonathan Pageau","text":"Lived in a monastery."}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":807.06,"end":914.45,"speaker":"Richard Rohlin","text":"Yeah, there you go. At the time. At the time, this was pretty kind of exceptional. So one of the other things to say about. And this is something I would love your insight on because it's something I've noticed before, and as I've been kind of reading through the literature on the subject and, like, reading some very long dissertations and very long books about this, like, really deep kind of academic studies, it seems to be something everybody notices and nobody has an explanation for. And that. Is that the two kind of defining features. Well, you could say that first of all, the way that the Irish thought about history, this is before the conversion and after the conversion, that the way that the Irish thought about history, and this is what makes it so interesting for universal history purposes, is of history as embodied in persons. So the Irish are basically never interested in what we would consider, like, you know, forensic sort of history today for them, the word history, and they have a particular word for this in Gaelic, means nothing like trying to remember the formulation here. It's the oral traditions passed down by the elders, which are helped and enhanced but not overwritten by the written laws. And then it's like the sort of, like the customs of your people, like the stories of your. The stories of the bards. The stories of the bards. So it's those three things, and it's the sense, by the way, this is something you find in very ancient cultures is the idea that something that's oral has precedence over something written. Yeah. Where writing is actually less trustworthy than what your grandfather told you. This is completely reversed."}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":914.45,"end":918.93,"speaker":"Jonathan Pageau","text":"It's already there and. Yeah, it's already there in the. In the. In the Fedra, in Plato's feeder. There's."}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":918.93,"end":927.01,"speaker":"Richard Rohlin","text":"Yeah, exactly. Yeah. Yeah. But. But basically, of course, you know, Plato wrote all of that down, but. Yeah. No."}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":927.01,"end":930.25,"speaker":"Jonathan Pageau","text":"Well, there's an irony in all of these situations."}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":930.25,"end":930.49,"speaker":"Richard Rohlin","text":"Right."}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":930.49,"end":930.73,"speaker":"Jonathan Pageau","text":"Where."}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":930.73,"end":931.13,"speaker":"Richard Rohlin","text":"Yeah."}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":931.13,"end":932.86,"speaker":"Jonathan Pageau","text":"God reveals the law to Moses."}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":933.25,"end":934.21,"speaker":"Richard Rohlin","text":"Yep. Then."}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":934.29,"end":939.49,"speaker":"Jonathan Pageau","text":"Then he writes it down. And so it's. It's. It's like a kind of lower level, you know."}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":939.57,"end":940.13,"speaker":"Richard Rohlin","text":"Yep."}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":940.45,"end":956.05,"speaker":"Jonathan Pageau","text":"And so I think. I think that the implicit notion that, in fact, the written word is weaker than the oral tradition is something that is there. Is there everywhere. It's there even, I think, in the. In the gospel, to some extent."}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":956.37,"end":978.66,"speaker":"Richard Rohlin","text":"Oh, for sure. I mean, that's. That's the whole thing that you have kind of going with Christ and like, how. How's the Sabbath supposed to be kept in these different things? Yeah. It's like, dude, I'm the one that revealed this to Moses to begin with. Right, right. Yeah. This is something that you find in every single ancient culture, is that oral tradition is more reliable than what is written."}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":978.98,"end":984.06,"speaker":"Jonathan Pageau","text":"But also, I mean, I think that the way that written culture develops also is a testimony to that."}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":984.06,"end":984.3,"speaker":"Richard Rohlin","text":"So."}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":984.3,"end":1015.84,"speaker":"Jonathan Pageau","text":"Right. So if you look at early manuscripts or early inscriptions, right, they're written without punctuation. They're written without separation between the words. And so the only way to read it is to say it out loud, because when you look at it, you just see a stream of letters. And even the same with the Hebrew, this idea that, in fact, the vowels in ancient Hebrew are not even there. Not there. And therefore, the only way for you to know the meaning of the text is to vocalize it. But not only to vocalize it, but to vocalize it in the way that you heard it before."}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":1016.08,"end":1016.68,"speaker":"Richard Rohlin","text":"That's right."}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":1016.68,"end":1028.4,"speaker":"Jonathan Pageau","text":"Because there are multiple possible readings of the. Of the text, especially in Hebrew. But you. You've heard it in synagogue, you've heard it read at the temple or whatever. And so you know what this. What it is when you vocalize it yourself."}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":1028.8,"end":1087.03,"speaker":"Richard Rohlin","text":"Yeah, no, that's. That's. That's a beautiful way to put that. So those are the sort of the three sources of knowledge or tradition in Ireland are. Are the. The. The. The laws passed down orally, supplemented by what's written down, and then the stories of the bards and the stories of the bards. And that. It's the combination of those three things is what medieval Irish people mean by the word history. Right. And so history in this sense, actually, it's much closer to how we've been trying to help people understand universal history, that it's the sort of the story of who you are and how you got to be who you are. But the role of laws, then, isn't just to help you learn right from wrong. Even the Torah is this way, by the way. It's not just to tell you, like, here's what's right, here's what's wrong. It's not like God. It's not like God is deeply offended on an ontological level when you eat shrimp. Right. No, you're."}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":1087.03,"end":1090.31,"speaker":"Jonathan Pageau","text":"Absolutely. I'm sure that's. As Christians, we know that that's not."}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":1090.31,"end":1124.34,"speaker":"Richard Rohlin","text":"Yeah, well, yeah, for sure. As Christians, we know this is not the case. But the point of much of the Torah, right, is to sort of make a. The make a distinction is how Exodus says it, to make a distinction between you and the Egyptians, to make a distinction between you and the nations. You're going to live among. So the purpose of a law, of. Of. Of laws or of history, you know, in this sense is to. It's not just the stories that tell you how you got to be the people you are today, but it's the stuff that describes why. Like, what does it look like to be you and not somebody else."}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":1124.34,"end":1128.65,"speaker":"Jonathan Pageau","text":"Yeah. Why you're Irish and not why you're part of this clan and you're not just something else."}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":1128.65,"end":1128.93,"speaker":"Richard Rohlin","text":"Exactly."}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":1128.93,"end":1131.73,"speaker":"Jonathan Pageau","text":"It's the distinguishing characteristics that get remembered."}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":1132.37,"end":1200.75,"speaker":"Richard Rohlin","text":"And so the expression of this in Irish Christianity, then, is that each of these monastery communities starts to develop its own. You could call them canons, which just means a rule. You could call them a rule of life. Very often they're called penitentials. Penitentials, as in, here's like, a list of sins that somebody might come and confess, and here's the kind of penance that should be assigned to them based on that. But basically, these different monastic centers kind of just come up with their own. And again, it's not unique to Ireland, but it seems like it happened in Ireland in a more extreme way, that each of these monastic centers basically starts to develop its own. Its own law, its own history. In terms of helping you understand. This is what it looks like to be a part of this community as the monastic community at the heart of the Christian community in a particular, like, Irish place replaces the idea of being a part of a clan or a tribe. Right. So this is kind of one prong of this, but remember that the other prong of history is the stories of the bards."}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":1200.83,"end":1201.31,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":1201.71,"end":1224.71,"speaker":"Richard Rohlin","text":"And so one of the other things that's going on in Irish culture seems to be a. How do I say this? A very. A very free use of the imagination. And that's not even the right. Like, everything I just said is wrong because it's so hard to talk about this for the medieval Irish."}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":1224.71,"end":1242.68,"speaker":"Jonathan Pageau","text":"Like, you could say it's like a lyrical approach to memory. Like, it says, in the sense that there's a kind of. Yeah, there's a sense that it's not so much about the. It's not so much about the precision, but rather than the story itself, let's say."}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":1242.76,"end":1510.47,"speaker":"Richard Rohlin","text":"So in this sense, to me, Irish Christianity is really close to Syrian in that way where, like, let's say, like, you're reading the Syrian fathers and you come across, like, certain formulations, and you might be like, oh, well, okay. I wouldn't say this, like, in a homily or. I wouldn't say this, like, you know, we've had an ecumenical council since then that has kind of put boundaries around our language. So I wouldn't express this in exactly this way. Saint Ephrem. Right. But seeing Ephraim's not an Aryan, you know, he's writing hymns against those guys. He's not an Aryan at all, but he's expressing things in this very creative, very imaginative kind of a way, like his Kentucky for the Nativity and things like. This is what I'm thinking about right now. But Syrian Christianity had this beautiful. And it's very much a Semitic expression. Just to talk about. Someday, guys, we're going to get to Syria. But just to talk about Syrian Christianity for a moment, people like St. Ephrem the Syrian, and Jacob of Sorouge, who I really love. I literally have a book of his hymns on the Mother of God that I talked about at the summit back in February. But that's just in my jacket pocket. Like, I carry it everywhere because it's so beautiful. But in these Syrian fathers, what you find is the same sort of things that people are dealing with in the Greek world at the time. And in the Greek world, they're dealing with them in these kind of very specific, precise formulations. And then in the Syrian world, they're just like writing crazy poetry and they're really saying the same stuff. But Irish Christianity really doesn't have dogmatic formulations. It's mostly just crazy poetry. And what they do is they take the inheritance, the Semitic inheritance, of like Second Temple Judaism. We've talked about this before, and they do a bunch of things, but they're really big into the Psalter. This is what I was trying to get at, that Irish Christianity has much more in common with the Psalter and with the sort of psalmic tradition that's come out of that, where everything in the Psalter is deeply personalized. Everything in the Psalter is deeply poetic. You're not reading the Psalms, or at least you shouldn't be reading the Psalms, trying to derive dogmatic formulas. But what you're actually doing is entering into a conversation really between the Father and the Son, right? And that's very much what Irish Christianity is kind of like. So it's much more, like you said, lyrical. It's much more poetic. There's no distinction in Irish Christianity between the natural and the supernatural. It doesn't exist at all. Now, you could really say, I think to an extent, to a very large extent, that that's true about most of the ancient world. But basically, Ireland is one of these Places, maybe because it's an island. Islands tend to have, like, the most extreme versions of everything. Like the most extreme language changes, the most extreme culture, you know, everything. Nowadays, if we want to actually say that something is being. If something is, like, kind of extreme, or we want to say something is not taking into account the culture around it, we say it's insular. Right. Which means it's on an island. So you have all these things in ancient cultures in general, but in Ireland, they seem to be really emphasized. And I think it's something like the sense of the other world always being very close to you. In Irish paganism just kind of carries forward into Christianity. And so in the lives of Irish saints, there's a great deal of what today we would probably call magical realism. And in the future, I'll give examples of this where miraculous things happen. But we don't make a big deal about the miraculous things that are happening because we expect miraculous things to happen. In fact, it's not even accurate to call them miraculous things that happens are, you know, if the nearby Warlord butchers your 20 cattle and you're really sad about this and everything, and you go to the hermit who lives nearby, of course that hermit is going to raise those cattle up out of the cauldrons and they're going to run around alive. By the way, this. This sort of thing happens a lot in Irish hagiography. Or the cattle. Yeah, with cattle, like resurrecting animals. Resurrecting. Resurrecting a cooked animal in specific. Like, this is a. This is a specific kind of miracle that shows up in a lot of Irish and Celtic hagiography."}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":1510.47,"end":1512.71,"speaker":"Jonathan Pageau","text":"Now, I have to admit that that's a new miracle for me."}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":1512.95,"end":1519.03,"speaker":"Richard Rohlin","text":"Yeah, there's. Well, there's some crazy ones in there. There's some in there. Again, I'm like. I'm not sure we can talk about this on YouTube, but there's some."}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":1519.27,"end":1522.95,"speaker":"Jonathan Pageau","text":"We have the story of St Nicholas who resurrects, like, the pickled boys."}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":1523.84,"end":1524.08,"speaker":"Richard Rohlin","text":"Children."}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":1524.08,"end":1525.36,"speaker":"Jonathan Pageau","text":"But they're cooked animals."}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":1526,"end":1543.92,"speaker":"Richard Rohlin","text":"Yeah, cooked. Cooked animals. And it's always. Sometimes it's like the saint's own cattle. Like, somebody gives the saint cattle to live off of while he's like, you know, for milk and stuff, because he's a hermit. And then some warlord comes by and cooks them all, and then he raises them sort of out of the pot, and then the warlord converts. This sort of thing happens."}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":1544.64,"end":1555.04,"speaker":"Jonathan Pageau","text":"Sounds a little bit like the whole idea of Thor's goats, right? That Thor has his own goats that he can Eat. And then they just come back and he just like keeps eating them over and over."}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":1556.16,"end":1720.95,"speaker":"Richard Rohlin","text":"I feel like at some point you get tired of goat. But anyway, yeah. I mean, accounts like this are very common. Another very, very kind of common miracle and, you know, at least that looms large in terms of the number of times it shows up in various hagiographies is the, you know, the idea of someone. It's always a young woman, like a virgin, being beheaded and then sort of like putting her head back on her shoulders and resurrecting her. That's. That's pretty common. But there's, there's a lot of. There's a lot of crazy miracles. And, and one of the things that I like about Irish miracles is that they do very often sort of involve food, you know, food and drink, which seems really biblical in a certain sense. There, there's a lot of miracles in the Bible that actually have to do with food. Yeah. Which is not an accident. Yeah. But I think that because we live in modern times and we're so separated from the process of getting food, making food, you know, in the ancient world, if you decided, I would like a steak tonight. So for people who don't know, we're recording this on the feast of the Door Mission. So for Orthodox Christians, this means that we've just wrapped up like a two week long feast. And I'm thinking, what are my plans for tonight? I want a ribeye tonight. That's what I want. I want a ribeye steak. Now I can just go down the store and buy ribeye steak. But in the ancient world, if you decided you want a ribeye steak, then you have to kill an animal that you've been raising for this purpose. And once you kill that animal, you can't ever get anything out of that animal again. Right. So there's like a real lost economic opportunity that comes with the decision to, like, kill something and eat it. And so it is very interesting to me that so many biblical miracles in both Old and New Testament. Right. Have to do with food and the wondrous multiplication of food. In Ireland. They just took that personally and they were like, yeah, obviously this would be like your main kind of miracle is we have milk for a year or we have, you know, the cows come back to life after we've eaten them and like all these other things. And so anyway, it's very interesting. We will probably do at least one dedicated video just on the life of St. Brendan the Navigator, whose various versions of his tales are deeply wonderful. And I mean, you Think about just an episode, like celebrating Posca on the back of Leviathan, right? So Leviathan is. Which you could say is a whale or whatever, but it's. For them, it's not a whale, it's a. It's Leviathan, right? It's a sea monster."}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":1721.27,"end":1736.55,"speaker":"Jonathan Pageau","text":"And they celebrate amazing. But because it has cognates, like every culture, like you have, there's version of that in sort of Alexander, like. Like Islamic stories about Sinbad and everybody, like the idea that they draw on the back of something and then it ends up being a monster."}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":1736.55,"end":1742,"speaker":"Richard Rohlin","text":"But the fact that you can, like, celebrate Posca there, like on the back of Leviathan, like, that's."}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":1742.16,"end":1743.12,"speaker":"Jonathan Pageau","text":"That's pretty cool."}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":1743.12,"end":1943.6,"speaker":"Richard Rohlin","text":"That's an incredible moment. So there's. There's all kinds of crazy things that I think are really kind of beautiful and unique and. And kind of weird and wonderful. And this is the stuff that when you talk about Celtic Christianity, people are really into all this stuff because what they have is this impression that Celtic Christianity is going to be like kind of goosey hippie Christianity and kind of kind of like, yeah, hippie Christianity and everything. And at this point, this is the turn in the video where we have to say, nothing could be further from the truth. Irish Christianity, which has all these beautiful sort, you could say, imaginative expressions that really go back to this experience of history as personal. It's always. For them, history is always embodied in a person. So there's not a history of a period, there's just the life of St. Brendan. Right. It is also one of the most rigorous, strict, ascetic, whatever, you know, adjective you want to apply here, forms of Christianity that existed in the early days of our faith. And this seems to actually also be the case for Syrian Christianity, by the way, very strict ascetic, even for lay people. Very, very. A lot of Syrians lived very, in fact, so strict and so ascetic that they actually at some councils had to say, no, no, you guys need to actually get married because we're going to run out of people soon if you don't knock this right off, right? Because people were. People were like, upon their baptisms, taking vows of virginity, dressing in a white robe, because they're reading, you know, Revelation and they're like, ah, Jesus is coming back soon. And so we're going to. We're going to be here in our white robes and we're going to be waiting. Eventually the church had to say, no, you guys have to get married, because we got to have more Christians, like, Like, you know, and so this is, this is kind of an interesting feature to me that you could say the most imaginative forms of Christianity. And I know there's somebody out there who's really upset with the way I'm using the word imagination right now, but I, I don't know how else to say. You could say the most poetic, whatever, also tend to be the most rigorous. And there's certainly this idea as well that extreme places produce extreme kinds of Christianity. This is actually one of Chesterton's theses in. I think it's in one of his Father Brown mysteries where he talks about, like, you know, the dizzying heights of the Scottish Highlands producing the worst kind of Calvinism and things like this. Chesterton doesn't like Calvinism. But anyway, so all that to say there is, there is something to be said for the most extreme or most aesthetic forms of Christianity tend to come out of where the Egyptian desert. Right. The, the, the, you know, like Siberia. The, the, the far reaches of, you know, the European continent, like Ireland and so on and so forth. Like, not. It's not to say that. And by the way, France has been in the news a lot lately, you guys can't say I didn't warn you, but it's not to say that France or Gaul doesn't have its own share of wonderful, amazing saints like St. Genevieve of Paris, who was, who was such a great saint, by the way."}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":1944.32,"end":1946.72,"speaker":"Jonathan Pageau","text":"We don't have a lot of extreme Christianity in southern France."}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":1947.12,"end":2055.73,"speaker":"Richard Rohlin","text":"Yeah, well, that's, that's what I'm trying to say. That's what I'm trying to say. Like, like, you know, with, with notable exceptions like St. Genevieve of Paris, who was such a famous saint in her day, by the way, that Saint Simeon the stylite, like, preached. Oh, wow. Yeah. And in fact, if you go to St. Genevieve's Chapel there in Paris, now, of course, most of her relics were destroyed by the French Revolution, but they have. There's actually an icon of Saint Simeon at her. At her grave there in Paris, Saint Simeon the stylite. So that's a good one. If you're thinking about, I need to work in a good French saint into God's dog. By the way, she was a contemporary of Saint Simeon, so there you go. Anyway. But yeah, that's what I'm really trying to say is, like, there's not a lot of famous aesthetics in southern France. And in fact, when you do have like a famous ascetic somewhere in, for instance, Italy, they make a big deal about it. That's the whole reason St. Gregory the Deologist, you know, St. Gregory the Great, Pope of Rome. It's the whole reason he wrote the dialogues is because he's like, no, no, Italians have had famous saints as well. It's the whole reason anybody remembers St. Benedict is because St. Gregory was like, no, no, no. We actually. Great Italian aesthetic. Look, we can do it too, because. Because, you know, Italy is just like a pleasant place. Like, it's. Pleasant places tend to just sort of produce. Yeah. Pleasant people. I don't know how else to say it, but. But these extreme places. These extreme places do tend to produce kind of more extreme variants of Christianity. And I don't know if you have an answer for, like, what is the connection. Why the connection between, like, the more imaginative, poetic, in a certain sense, you could even say literal forms of Christianity and. And then the very, like, strict aesthetic rigor. I don't know if you have anything for that, but it's something that bothered me and it seems to bother everybody else who studies this."}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":2056.29,"end":2120.2,"speaker":"Jonathan Pageau","text":"Well, there's definitely probably a relationship between the strictness of the Christianity and the miraculous. That I think is something that's not that surprising, you know, because. Because deprivation brings about miracles. I know this is one of the things that will be difficult for a secular person to understand, but anybody who's experienced it will know that in the moments when you have nothing, there is a far better possibility that you'll experience a miracle because you basically are completely dependent on the grace of God. You know, that the secondary causes that you usually trust are not available to you. And so there might be some of that. That's. That's happening. And then. But as for the. So in some ways you would say that we. Maybe we see it imaginative, but maybe that's not the way that they see it. You know, it's more like for them, the. The rigor is equal to the miraculous because, you know."}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":2120.2,"end":2121.64,"speaker":"Richard Rohlin","text":"Because how else would it happen?"}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":2122.04,"end":2122.72,"speaker":"Jonathan Pageau","text":"Exactly."}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":2122.72,"end":2135.6,"speaker":"Richard Rohlin","text":"Yeah. Yeah. So. Well, you could say also, like, maybe just like extreme people are going to have extreme experiences, something like this. It's like, yeah, there might also be."}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":2135.6,"end":2169.84,"speaker":"Jonathan Pageau","text":"Something about also the saints, if they live a very ascetic and rigorous life, that they also had more revelations and more kind of mystical experiences that would be difficult to translate and maybe would also translate themselves into stories that seem pretty wild to us at the outset. Just like when you read the Book of Revelation, you know, the way that it's described is. Is really. It's, you know, it's. It's very exploded to the. To the. To the Mind of just someone reading it at the first level. And so that might also be. Be something that. That was happening to these saints, man."}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":2169.84,"end":2189.58,"speaker":"Richard Rohlin","text":"Can you imagine not growing up with the Bible? And then you read something like the Epistle of James or something like, oh, this seems pretty reasonable. And then you flip the page and it's revelation. You're like, what is happening right now? Like, coming into that, like, totally unarmed, totally unequipped. Oh, my God. Yeah, yeah, yeah. That'd be crazy."}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":2189.74,"end":2193.02,"speaker":"Jonathan Pageau","text":"So there might be some of that in the story. It's like the fact that. Why the stories are so."}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":2194.54,"end":2196.22,"speaker":"Richard Rohlin","text":"Yeah, I think that's even like the."}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":2196.22,"end":2206.3,"speaker":"Jonathan Pageau","text":"Way that they're remembered. You know, I mean, we have the same issue. I mean, not issue, but like, we have. We have saint stories, like our most. Like if you think of the story of Saint Mary of Egypt, for example."}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":2207.03,"end":2207.15,"speaker":"Richard Rohlin","text":"Right."}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":2207.15,"end":2216.87,"speaker":"Jonathan Pageau","text":"It's like that story the way that it's remembered. Right. It's remembered by the ascetics for quite a while before it's ever written down."}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":2216.95,"end":2217.43,"speaker":"Richard Rohlin","text":"That's right."}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":2217.43,"end":2236.83,"speaker":"Jonathan Pageau","text":"So there's something about the manner in which the ascetics remember it and how she becomes. And St. Jose math become these shining kind of bright lights in the story itself. And so the fact that, like you said, Ireland is so isolated in the fact that they have these kind of oral traditions, there's probably a refining process which also makes these stories more."}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":2236.99,"end":2251.63,"speaker":"Richard Rohlin","text":"And even the fact that we read St. Mary of Egypt's life liturgically, like in a service during Lent, you know, twice. You know, once or twice a year, depending on your parish practice. But. But that the. The way that most of us encounter that story is orally."}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":2252.03,"end":2252.91,"speaker":"Jonathan Pageau","text":"Yeah, right."}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":2252.91,"end":2451.18,"speaker":"Richard Rohlin","text":"Yeah, yeah. So this kind of leads us to part two of this video, which is to talk about one of the more extreme things which came out of Ireland, and this is the popular medieval belief in purgatory. Now, I've chosen my words carefully, theology nerds. I have. I didn't say the dogma of purgatory or the doctrine of purgatory, said the popular medieval belief of. About purgatory. So we'll talk about this some more when we get into our purgatorial class on Dante's purgatorial. For those of you sign up for it. Literally, as soon as I announced that I had people coming at me on the Internet like, oh, you're orthodox. You shouldn't even be talking about purgatory. Blah, blah, blah. So I want to sort of say a couple of little preparatory notes here. The first is that for those of us who come from strongly Protestant backgrounds, as you and I do, there's probably no teaching of the Roman Catholic Church, except for maybe the veneration of the Mother of God, which is more, you could say, triggering, in a sense, in the doctrine of purgatory. Right. We have this mythological moment, you know, the disputation between Johan Tetzel and Martin Luther. And it's one of the. This is, you know, according to our mythology, this is one of the major flashpoints of the Reformation. And there are also certain medieval expressions of this doctrine which were rejected by the Orthodox church, notably by St Mark of Ephesus, who, for the Orthodox Church, is considered to be like one of the pillars of the faith. So what I want to say, first of all, is that if you're somebody who has a really strong reaction to the word purgatory, especially as a modern person, especially if you're either a modern Roman Catholic or a modern Protestant, probably everything that you imagine purgatory is is wrong according to the 12th century, which is what I'm going to be talking about now. So if I describe things to you from the popular medieval experience of purgatory in the 12th century, and you're like, no, that's not right at all. That's not what the Baltimore Catechism says, or something like that. I know, I know. I'm not coming at anybody, okay? But this is what I'm really interested in is the world of the Middle Ages and the idea of. And, in fact, I'm going to be sort of defending why this was like, a reasonable thing for them to believe, even though it's not something that I personally believe, it's not something my church teaches. But what I want to do is proceed from the assumption that our ancestors are not completely fools, that there are reasonable, you know, that there are reasons. Right. That it was reasonable for them to believe this in light of kind of what they'd received and what they experienced. So one of the things that kind of comes out of this period of the Irish penitentials, which assign. And these start sort of being written in the 6th century, and they basically assign very strict discipline, very strict penances for different kinds of sins. And I could go into the specifics of this. It wouldn't maybe even be helpful to do so because it would probably scandalize some people. But I'll give you an example, though."}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":2451.18,"end":2452.34,"speaker":"Jonathan Pageau","text":"Yeah, at least one example."}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":2452.64,"end":2667.34,"speaker":"Richard Rohlin","text":"Well, I'll give you an example of something that's not even a penance. Yeah. Okay. And this is that. And what in many Irish monasteries in the 6th century, the common practice was. And this is not lay people, this is monks. When somebody is tonsured as a monk, they're not even given communion the first Easter after their tonsure. Wow. They receive communion only in the body the second Easter after their tonsure, and they don't even receive communion in the blood until the third Easter after their tonsure. So if this is the level of rigor and strictness that is being applied to monastics, you can well imagine what it was like to be a layperson in this context. I mean, to be totally honest, most of us would probably wither and die. This is very strict, a very, very strict form of Christianity. It's not at all loosey goosey. It is definitely not hippie Christianity. This is why I get a little annoyed. Somebody once told me that Celtic Christianity is like something of a wax nose. That is, people just shape it to be whatever they want it to be. But I get really annoyed with sort of like these new Age, like, Celtics. Yeah, the new age come out and so on. And it's like, listen, you think anything you're doing, they would have the remotest patience for, like, these were. These were serious people and say that to, to like, judge them or say, I know better than they do because I know for a fact that I couldn't hack being a Christian in 6th century Ireland. Right. I just don't have it in me. I'm, I'm too comfortable, I'm too easygoing, you know, and, and, but there, these are people who really loved rigor and who saw rigor as, as like a proof of sanctity. And so all this to say the, the penitential tradition eventually results in kind of the popularizing of the idea of purgatory. Now, what I want to say is that first of all, there's a long history in Judy, and I'm. I'm going to just throw this out here as a prefatory comment. You can come at me in the comments, but I'm not going to argue with anybody. Okay, so there's a long history in Judaism and in Christianity of two ideas. The first is that when people die, they may undergo a period of purification. That is to say that it's like, like not instant from this life to heaven or hell, but that sometimes there is an intermediary period. Now, maybe this period is 40 days, maybe it's however long. But this is. This is commonly believed in Judaism at the time that the New Testament is written. Okay. And there are hints of this Even things like Lazarus's resurrection. The second is the idea that the prayers of the living are in some way efficacious to the souls of the dead. Now, this was something that was practiced in ancient Judaism. It's something that was practiced in Christianity all the way up to the Protestant Reformation. You can argue about whether or not it's biblical, whether or not you want to do it, whether or not it makes you feel weird, whether or not it's necromancy or whatever. But the thing that I'm trying to say is that these are two sort of universal assumptions in the ancient world. Right. And there are sort of things that, from an orthodox perspective, there's no question about this. Right. This is something that all ancient Christian traditions agree about."}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":2668.06,"end":2684.17,"speaker":"Jonathan Pageau","text":"But the thing, I mean, but it is a thing in orthodox tradition, which in my impression of it is that it's definitely not fixed. Like, you know, because you see people publish these big books about what happens after death, and then everybody's like, yeah."}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":2684.17,"end":2711.42,"speaker":"Richard Rohlin","text":"Maybe, you know, I, I mean, the, the big question to me is always like, what do you actually do? Right. If somebody dies, how do you, how do you treat that person when they die? Well, if somebody dies and you, you, you know, like prayers for the passage of the soul and then third day prayers and four and, you know, 40th day prayers and annual remembrances and things like this, then, then, you know, what are you saying? You're saying that we think this is doing something because we know that God loves us."}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":2711.58,"end":2712.14,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":2712.3,"end":2796.83,"speaker":"Richard Rohlin","text":"And it doesn't want anybody to perish. And beyond that, you know, like, who can really say, like, where this person is right now? If by the time that we say somebody is a saint, it sort of means that we're like, we, we're pretty sure we should stop praying for them and they should start praying for us now. Right. That's really, that's really all we're kind of saying. And I think there's, there's been a shift. I mean, again, I'm not a Roman Catholic, and I, I'm really cherry of misrepresenting people, you know, and so I don't want to misrepresent like, modern Roman Catholic teaching about this. And I, I, but I, the impression I've gotten from talking to Roman Catholics is this, like, things have sort of moved in a direction that's more similar to that. But anyway, I don't know so much about that. I'm going to talk right now about 12th century Catholicism, which is something I know a lot about. So by the 12th century, this idea of, like, a purgative interlude, or this idea of like, purification after death. Right. Which is basically just the idea that whatever state your soul is in when you die, well, it doesn't change immediately when you die. Like, there might still be some purification necessary. Well, this has developed into the concept of a third state, and in many cases a physical location, which is one of the things Saint Mark of Ephesus specifically rejected, by the way. And modern Roman Catholics will say, we don't teach. It's a physical location. All right, that's great. I'm just Talking about the 12th century right now. So."}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":2799.07,"end":2806.03,"speaker":"Jonathan Pageau","text":"Let me just ask this question, though. Like, so in the 12th century, did they also believe in the physical location for hell?"}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":2808.2,"end":2810.36,"speaker":"Richard Rohlin","text":"In popular imagination, definitely."}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":2810.84,"end":2813.64,"speaker":"Jonathan Pageau","text":"Well, that's fine. Popular imagination, you know, is."}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":2814.04,"end":2940.06,"speaker":"Richard Rohlin","text":"I mean, I mean, sort of like nailing down. Nailing down, like, what are. What's Is there? Okay, so here's the thing. In the 12th century, there's not really such a thing as, like, unofficial teaching. Right, Right. I mean, you do have bishops, you do have the Pope, who, like, does, like, say things, you know, but, but like, the, the, the. The situation now where you can be like, oh, no, I can go to a website and look up the official teaching of the Catholic on the subject. That situation does not exist in the 12th century. Yeah, in the 12th century, the official position of the Catholic Church is whatever your parish priest says it is. Right. Because how else would you know? Right. And this is really important because basically what happens is by the 12th century, the concept of purgatory is developed across the medieval west to be this idea of a third state, to be the idea of a physical location, usually with physical fire and other torments. Right. And this is definitely the way that it was thought of in the popular imagination. And these various torments, they're sometimes generalized as fire, but actually they're much more specific than that, and they're much more graphic than that in sort of popular and even visionary literature of the time. And the official position at the time was that these torments are purgatory, purgative rather than punitive. That is the point of the torments is to purify you rather than punish you. But that does not really make them any less grim. So late medieval, and to sort of understand how this sort of developed, you would say that late medieval preachers and moralists really fear. I mean, it's the problem you always face anytime you have a, A, A nominally Christian society. Actually, the Puritans dealt with this in New England as well. It's not specific to Catholicism. It's a problem anytime you have a society where, you know, it's. It's stopped being like the. The church versus the world. And it's actually just become like, everything is. Everybody's at least nominally in the church now. Yeah. Then, like, how do you keep people from coasting?"}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":2940.14,"end":2940.7,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":2940.78,"end":3152.93,"speaker":"Richard Rohlin","text":"Right. Because 80% of people, no matter what your religion is, will always coast. So it's like, how do we keep people from coasting? And so there were people who were. Would sometimes, like, live a very indifferent spirit life, spiritually speaking, but then they would leave these huge legacies. Right. Basically, in their will, they'd give a bunch of money to a church or to build a new church or to say so many masses or to put up a new root screen or something like this. So basically, it would sort of, like, the idea is, well, maybe that'll kind of like, even things out a little bit. And Protestants will say, this is a problem with Catholicism. Catholics said, this is a problem. Right. This is not how it's supposed to be. You're supposed to live a life of faithfulness from your baptism until your death. And so a lot of people sort of maybe thought at this time of purgatory as being kind of like the soft option over and against hell. It's like, well, I wasn't good enough to be a saint, but at least I'm not going to hell. I'm going to the third place. And then eventually, once I spend enough time there, whatever, it's like a little, you know, quarantine or whatever, then I get to go to heaven. And so a lot of medieval preachers really saw this kind of. This idea of incomplete repentance as being actually not genuine at all. And so the focus of most medieval purgatorial literature is on trying to make people avoid it as much as you want to avoid hell. And the way that they do this is by describing the miseries of purgatory. Not to just curdle the blood and oppress the spirit, but to stir the living to action. And so to get you to live a life of mortification, to get you to live a life of penance, almsgiving, good works, and to do these things in a time of prosperity rather than, as you could say, to use a nice Baptist praise rather than as fire insurance. Yeah, yeah, Right. So this results in medieval descriptions of purgatory being pretty extreme. I'll read you one. It's not from Ireland, but it is from the north. This is from Bridget of Sweden, who is a medieval Catholic visionary saint, has a lot of the more kind of extreme. Like, I had a vision, and the Virgin Mary told me, if you pray these three prayers, then you'll be delivered from X, Y, and Z. You know, those kind of like, very formulate visions. And again, I'm not trying to rag on anybody here, but some of this. Some of. Some of Bridget's revelations and things like this are, like, really out there. So this is her description of. And this is actually only a part of. I picked the part that I thought would be not get your video demonetized. So then methought that there was a band bound around his head so tight and painfully that the forehead and the top of the ears had met together. The eyes were hanging out on the cheeks, the ears, as though they had been burnt off with fire. The brain burst out at the nostrils and ears. The tongue hung out and the teeth were broken together. The bones and the arms were broken and woven as a rope. The skin was pulled off the head and bound around the neck. The breast and the womb were thrown together. In Middle English, this is. They were toslangen together, which is my favorite way to say things. It's Middle English. And the ribs were broken that one might see the heart and bowels. The shoulders were broken and hung down to the sides. And the bones were drawn out as though they were a thread of cloth. This is like, the least graphic part of her description of purgatory."}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":3153.01,"end":3154.89,"speaker":"Jonathan Pageau","text":"Of purgatory, not of."}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":3154.89,"end":3200.88,"speaker":"Richard Rohlin","text":"This is a place where saved people go. This is a thing to remember. Everybody in purgatory is already saved. They're just being sort of prepared for heaven. But this is how she's describing it. Like, it's really. It's really graphic stuff. To put it bluntly, you could say that accounts of purgatory in the Middle Ages are actually. More often. They're more graphic. Graphic than we would depict hell today. Like, again, we just don't have the stomach to hang with these people. Like, again, if I say all these things, I'm not saying it to mock. I'm not saying it to even point out. Be like, oh, no, I'm the Christian that has it figured out. Not all these medieval people. I'm not that guy at all. I readily recognize that I could not keep up with these people. Right."}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":3202.72,"end":3204.24,"speaker":"Jonathan Pageau","text":"That's some pretty intense stuff."}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":3204.57,"end":3297.42,"speaker":"Richard Rohlin","text":"Yeah, it's intense stuff. And historian Eamon Duffy, who's written a lot of great stuff about, like, sort of Paris life in the Middle Ages, he says that These depictions are, to quote him more often, in fact, circumstantial treatises on the nature of avoidance of the deadly sins which were their cause. So the thing you're really supposed to see with these depictions of purgatory, so the person that I just described, this is from Brigid's vision. And this is not Bridget, Saint Bridget of Kildare. This is Bridget of Sweden. This is the vision of a soul that's guilty of lies and pride, by the way. So just little things, you know, just little things like lies and pride. But the point is, you're supposed to. It's really supposed to sort of help you see what the sin is, because most medieval Christians didn't think of themselves as going to hell, Right? Hell is for, you know, the infidel, the reprobate, you know, like, for. It's for, like, you know, people who, like, totally reject God. That doesn't actually describe most people in the Middle Ages. And, and. And so this description of purgatory, right, it's meant to sort of motivate those people to not coast, to not kind of like, sit on their hands and, you know, have a great deathbed conversion experience and whatever else, but actually to get up now and do the work of being a Christian. So as I mentioned, though, there's an Irish connection in all of this. So the idea of purgatory, like, there's the idea of a time of purification after death, again, has been there since the beginning of Christianity because it's also there in Jude, in, you know, predates us in Judaism."}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":3297.42,"end":3323.81,"speaker":"Jonathan Pageau","text":"Yeah, maybe not. I want to say something about this just because, you know, it's really important, like you said, to be able to understand the stakes of the notion of this time of purgation. And it has to do with the fact that this ontological reality of being saved, that is that the notion for traditional Christians and for Orthodox today, you are what you are. So it's like, that's right."}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":3324.13,"end":3324.85,"speaker":"Richard Rohlin","text":"You. You."}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":3324.85,"end":3414.93,"speaker":"Jonathan Pageau","text":"It's not the idea that, okay, so I'm. I'm going to die, and then all of a sudden I'm going to become something else. And I'm going to totally. Now all of a sudden, I'm going to be in the glorious presence of God. You know, it's like, no, if I. Even if I die, whatever state I'm in and whatever reality that I. My being is in, that is who I am. And therefore, that is what will continue on after life. And so people, I think, reasonably could see that. Well, how could I, let's say, as Someone who knows that I'm still dealing with sin, still dealing with all these things. How could this person who I'm told is not going to go to hell? Because I do believe, you know, I, you know, I do love God. I love my neighbor to some extent. Like I, I, I, I, I trust in that, in that, in that connection. How, what, what happens to me because I know that I won't be like saint, like St. Paul, like, I won't be like the great, the great mystics. And so how do I account for that? And what does that mean for the, for my, for my, the continuation of my being? So it's not like you said, it's not, there's something really reasonable and it really kind of down to earth in trying to figure out what are these, what, what does this intermediary state look like? Because the other solution to it is that, oh, so it's a mediocre intermediate means that I'm just going to basically be me in this state of kind of semi, whatever, sainthood for eternity. Like, that's it, that's, that might be the other possibility."}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":3415.33,"end":3418.05,"speaker":"Richard Rohlin","text":"And what I want to say is nobody should want that."}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":3418.45,"end":3419.17,"speaker":"Jonathan Pageau","text":"Exactly."}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":3419.17,"end":3431.23,"speaker":"Richard Rohlin","text":"Like, you should not get. If you get up in the morning and you look in the mirror and you're like, this is the person I want to be for all eternity, something is very wrong. Something's wrong with you. Because even very holy people don't think that way."}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":3431.23,"end":3431.67,"speaker":"Jonathan Pageau","text":"That's right."}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":3431.67,"end":3764.03,"speaker":"Richard Rohlin","text":"Yeah, exactly. All right, so, so yeah, all this to say like this. So, so that is there from the beginning of the Christian faith and experience, what sort of develops in the Middle Ages and is really popularized, really comes out of Ireland, comes out of this penal tradition is this idea of purgatory as a specific location with specific torments for specific sins. Okay, so, and this is related to the visionary tradition of Christianity and ancient Judaism, where of depicting Hell in this way that you get in the Book of Enoch, even in the Book of Revelation to some extent, and also in like third ESDRAs and so on. But this, this idea of sort of purgatory is like a third location that's maybe like adjacent to Hell, but not quite, you know, hell, but it still has kind of this. Different kinds of sins are dealt with in different kinds of places or different kinds of ways. This is tied to this, you know, very much tied to this Irish penal tradition, and it's very much tied to a very important location called the purgatory of St. Patrick. So this is on an island. It's located on Station island in Loughdair. And it's a. So there basically an island on a lake in the middle of Ireland in what's currently Northern Ireland. And there's a. There's actually. There's a church there. And there's several versions of this, of the. Several accounts of the story. And basically the story goes something like St. Patrick, the salmon of heaven, in case I didn't mention that. It's my favorite epithet for him. So I just like to say it every time. Patrick, the salmon of heaven. That's how he's always introduced in, like, Irish stories when. When St. Patrick was dealing with. You could say, like, some doubt about his. His role or the. You know, whether or not even any of this is kind of working. And so he's shown. He's taken to this island in the middle of the lake, and he's shown an entrance into purgatory so that he can see kind of like, you know, basically, it's a visionary experience, like most visionary experiences in. In the Christian tradition. It's something that's intended to strengthen the prophet's faith, right, that he's going through a period of doubt. And so he's shown a foretaste of the next life, the torment of sinners, the state of purgatory, and then the bliss of the righteous. And then this develops into a bunch of other stories, the most famous of which is the tale of the Knight Owen, which is sometimes which in the. Or the vision of Sir Owen, which in the 12th century circulated as the Tractatis de Purgatorio Sancti Patrici Patricki, which is. Which was translated into almost every medieval language. There's a Middle English version of it. There's also, like a Hungarian version of it, Right. Translated into basically every medieval language it was. Which means that this is popular reading. This is what lay people are reading. This is like a work of devotion. It's not just for clerics or. And it is fundamentally, I have to say, not a theological. But there's not a. Not a dogmatic text. It's not a theological text. Right. What it is is an imaginative text, and it tells the story of Sir Owen, who is a sinful knight who decides to be purged of his sins by entering into St. Patrick's Purgatory, which is this terrestrial entrance into purgatory. And by the way, his bishop explicitly tells him, don't do this. You won't be able to hack it. You won't be able to survive. And he decides to do it anyway. And it's very notable that in all of these kind of medieval depictions, popular medieval depictions of purgatory, you get to purgatory by going down. Right. Purgatory is part of the underworld. This will be important when we come to Dante in a minute. Purgatory is, I think, as Eamon Duffy describes it, it's an outpatient department of Hell. Basically, it's full of demons who are there to tempt and torment you. And in fact, according to some medieval writers, the only difference between Hell and Purgatory is the duration of the torments. Torment in Hell lasts forever. Torment in purgatory just last until you're purified. But that's the only difference. Everything else is the same. That's according to, like, a lot of medieval writers. So after being given some instructions by monks who maybe also might be angels, it's a little unclear. In the story, Sir Owen descends into Purgatory, which turns out to be this sort of desolate wasteland in which there is no kind of comfort but hunger and thirst and cold. No trees grow here, only cold wind blows here. And then there are these fields. And each one of the fields punishes a different kind of sin or purifies people from a different kind of sin, if you want to think about it this way. So the field of the slothful is strewn with the bodies of men and women who are dismembered and mutilated, lying face down, begging for mercy. It's really graphic. This is the very first sort of image you get in the poem. These are the slothful who basically, in their wounded state, they're unable to help themselves. There's the field of the gluttonous, which is men and women lying face up, pinned with glowing hot nails through their feet and hands and head. They're being sat upon by huge dragons and toads and snakes. There's the field of the lustful, which are basically people being torn out by demons wielding hooks. By the way, this is where they try to get Owen. The demons try to get him because this is one of the sins he struggled with. There's the field of the thieves. What's that?"}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":3764.11,"end":3765.31,"speaker":"Jonathan Pageau","text":"He's a knight, you know."}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":3765.31,"end":3869.97,"speaker":"Richard Rohlin","text":"Yeah, he's a knight. I mean, it's. I mean, that's. The other subtext for this, is that it's very much. It's very clear, at least in the Middle English rendering of the story, that Sir Owen is a. He's like a knight in the courtly tradition, like a sort of an Arthurian knight. Right. And that's. You Know very clear that he. So he struggles with nightly sins. He doesn't struggle with sloth and gluttony because those aren't cool sins, but he struggles with. He struggles with lust. And he also struggles with, I think, covetousness, you know, which is, which is itself like an expression of lust. There's the feel of the lustful people who are torn out by demons wielding hooks. The field of the thieves, where these people are hanging by burning iron hooks from their feet, neck and belly, they're lying on burning gridirons, etc. There's the field of backbiters, gossipers and liars. These are people who. And also, by the way, people who falsely swear on relics, which is a very particular kind of middle aged sin, actually. I say that. But nowadays we still like made people swear on a Bible. Yeah, yeah. In court. Where do you guys think that comes from? In the Middle Ages people used to swear on relics or on the Gospel book, right? And we still make people swear in a Bible because. And there is this sort of like, you know, sense that, oh, well, now I have to really be honest, actually, you should be honest all the time. But the idea that you're bringing in something holy right now makes the oath like more binding a certain way. So people who falsely swear in relics, and these people are in other people who have sinned or deceived with their tongue. They're hanging by their tongues by like burning hooks, like through their tongues, just hanging by their tongues, you know. And there's the field of the covetous. These are people who are bound hooks to a great wheel."}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":3869.97,"end":3871.89,"speaker":"Jonathan Pageau","text":"And basically a lot of hooks."}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":3872.29,"end":3938.78,"speaker":"Richard Rohlin","text":"There are a lot of hooks in this. There are a lot of hooks in this poem. You could even call them plot hooks. There's the. In the field of the covetous, they're bound by hooks to these great wheels and the wheels are spinning, so they're like constantly being crushed by the wheel as it spins over and over again. But then the wheels are also being struck by lightning, which constantly like burns up the souls to powder. I don't know. And the demons try to get Owen again here. And then finally he comes to like this blood red mountain on which there are men and women standing and there's the stinking river flowing under it. And Owen is thrown into the river and he's taken to the next location of torment, which is this hall where users and other kinds of people who sin with money are basically tormented by being immersed in pits of molten precious metals. And as you do and. And then after this, you know, the demons make one last attempt to drag him down into the pit of Hell. And the idea is that, you know, beneath the stinking river, there's an entrance to Hell. So, like, hell and purgatory are adjacent places."}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":3938.78,"end":3941.82,"speaker":"Jonathan Pageau","text":"Yeah, yeah. And the demons are trying to pull him into Hell."}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":3941.9,"end":4143.95,"speaker":"Richard Rohlin","text":"Yeah. So there's like this danger that he's in purgatory, but he could be pulled down to hell if he doesn't fight. And so throughout the poem, Sir Owen survives the various torments of the demons by calling upon the name of Jesus Christ and by calling on the Virgin Mary. And eventually he calls upon Christ, who widens the bridge across the river far enough for him to cross. And then he enters, leaving purgatory, enters the earthly Paradise. Again, this will be important as we read Dante. He enters the earthly paradise, which is where he both recovers from the pains of purgatory. But he's also granted a vision of heaven, like of the heavenly paradise. And the earthly paradise is at once both the Garden of Eden, but also kind of like the Celtic residence of the Blessed. It's kind of both of those things at the same time. And Owen is given this, like, manna, like food of paradise, and then he's returned to the world. This time he actually has to return through Purgatory, but this time, as he comes back through, the demons just run away from him, and there he lives out the rest of his life. And at the end of the poem, there's an explanation from these two archbishops that he meets there in the earthly paradise of basically how purgatory works and the way, including the ways that those living on earth can lessen the pains of their relative suffering there by praying and doing good works on their behalf. And so, along with another very similar Irish tale that also involves a knight kind of going through a vision of the underworld, the Tractatus was widely circulated in medieval Western Europe. Dante would certainly have read it. And the really interesting thing about Dante's depiction of Purgatory is how radically different it is from every medieval depiction that came before him. For Dante, purgatory is not an antechamber of Hell, or it's not an outpatient clinic for Hell, but it's the antechamber of Heaven. And for Dante, purgatory is an ascent, not a descent. For Dante, it's about purification, it's not about torment. And so Dante does all these things that actually really rehabilitates Purgatory in the popular consciousness. And, of course, a bunch of things come along later the Reformation, Tetzel, all that stuff. Not going to really get into that so much in the class. I would just say that, you know, even Roman Catholics at the time really rejected a lot of what Tetzel was saying. But, but, you know, anyway, the rest is history. So the thing that I really wanted to accomplish was to talk about this one specific vision of Celtic Christianity. And as an example of the ways that like the asceticism, the, you know, those kind of the penal tradition that came out of Ireland had a very strong effect in medieval Western culture. And, and was. Was really not what a lot of people typically associate with like Ireland or Celtic Christianity today. But it was very imaginative, miraculous, wondrous, etc. But it was also extremely ascetic. Extremely ascetic, extremely focused on, you know, your job really as a Christian in this tradition is to focus on your sin and to ask God to help deliver you from it. Because even purgatory is not a place where you want to stay. So."}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":4144.51,"end":4154.35,"speaker":"Jonathan Pageau","text":"All right, so we, So I want to, I want to really, I want to really push this. I want to really try to give the best defense I have for purgatory."}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":4154.51,"end":4171.93,"speaker":"Richard Rohlin","text":"Let's go. You know, and the reason I joked earlier, by the way, that this video would make nobody happy because like, it's going to tick off the Protestants, all the Catholics, you guys are getting purgatory wrong. And then also, like ortho bros are going to be angry that we hear trying to defend it as a reasonable proposition. But I'm with you."}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":4171.93,"end":4192.85,"speaker":"Jonathan Pageau","text":"So, like, the reason why I want to do this is mostly because, you know, I, I really, But I do, I do believe, I believe that these realities are realities that we deal with now. I don't believe in the idea that when we talk about the afterlife, that we're only talking about what happens to after you die."}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":4193.19,"end":4193.59,"speaker":"Richard Rohlin","text":"That's right."}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":4193.59,"end":4204.63,"speaker":"Jonathan Pageau","text":"The afterlife is revealing to us, is in some ways the truest pattern of reality. Because in some ways it's an unlimited version of things that we deal with now, which is why that the descriptions."}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":4204.87,"end":4207.19,"speaker":"Richard Rohlin","text":"It'S like looking at the final state of everything, right?"}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":4207.19,"end":4207.67,"speaker":"Jonathan Pageau","text":"Exactly."}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":4208.79,"end":4211.47,"speaker":"Richard Rohlin","text":"That's why it's last things. Right? Yeah."}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":4211.47,"end":4410.63,"speaker":"Jonathan Pageau","text":"So that's the way that I, that's the way that I understand and that's why I try to help. I hope that it can help us actually understand the things that we're going through now. And so the, the, the reality of sin, okay, is that it makes you suffer. Okay. That's the reality of sin. Because what it does if you think of the. The easiest ones are, for example, like, let's say, carnal desires. Whichever ones you imagine like those carnal desires, they make you suffer because they make you desire something. And in the, in the, The. The grasping for it, right? And the kind of pulling it towards you, you know what it does is it throws you back into a cycle of suffering because it then opens up the space of that desire again. And then you're kind of in this weird loop where you desire it, when you have it. It's, it's. It lasts a fleeting second and then it throws you back into that. That kind of cycle of despondency and desire, right? So obviously an addict is the easiest way to understand it because it's so, it's so. It's such an extreme version of it. Now when that happens, that you have two choices in dealing with the suffering that sin causes in your life. And one is torment and the other is purgation. Those are the two possibilities you have, which is. That is actually the reason you could say why sin causes suffering. Because the suffering is an opportunity for repentance every time. So, like, every time you lie and then the lie causes pain and suffering and chaos in your life, whether it breaks your relationships, whether it destroys your credibility, whether it does all these things that lying does. Now you have two pot. You have two choices in front of you. One is you're basically going to just suffer and be tormented by the results of your sin, or that if that suffering will be an opportunity for repentance and transformation of the person. So it's really important to understand this because a lot of people, they're like, well, what is this horrible idea that people are being tortured in per. In. In purgatory, and why does it causes purgation? Well, you can experience that every day of your life, every time you sin, because like I said, those two choices are there in front of you. So I. To me, it's not a surprise that based on our experience of sin and an experience of how it brings death to us, right? How it causes things to break down, it causes chaos and conflicts and all these things in our life that people would. Would notice that when that happens, there are two possibilities, right? One is to use it as a springboard towards transformation. So that's why. That's like. I'm not saying. I'm not trying to defend the doctrine of. But I'm trying to help people understand why people would come to that conclusion. It's not just like they're a bunch of sadomasochists or they, they just, like, they had this idea that you have to punish yourself because you're, because you've sinned. All that kind of stuff. That's not what it's about."}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":4410.95,"end":4418.63,"speaker":"Richard Rohlin","text":"And by the way, most of that kind of thing happened not in the Middle Ages, that happened in the Renaissance and like the Counter Reformation, but anyway. Anyway."}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":4418.63,"end":4419.91,"speaker":"Jonathan Pageau","text":"What, what, what kind of thing?"}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":4419.99,"end":4426.15,"speaker":"Richard Rohlin","text":"Oh, just like, like, like really extreme forms of, of like, self flagellation."}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":4426.15,"end":4426.99,"speaker":"Jonathan Pageau","text":"Of self flagellation?"}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":4426.99,"end":4445.96,"speaker":"Richard Rohlin","text":"Yeah, yeah. Not, not really a medieval thing. I mean, people can, if you want to know, like, the orthodox kind of response to all of this. You can read St. Mark of Ephesus. The thing that he mainly seems to have rejected is the idea of like a definite third location with literal fire. Right. That's sort of the things also, like."}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":4445.96,"end":4464.54,"speaker":"Jonathan Pageau","text":"I don't even know what that means. Like, I don't know. Well, like, with that. Because even, like, even if the, if the Catholics had this idea of like a, a location where you're physically suffering, I don't even know what that means. Who's. What suffering. Your body is in the tomb. So I don't know what a literal, I don't know what that means."}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":4465.02,"end":4546.83,"speaker":"Richard Rohlin","text":"But I, I think that, I think that, yeah, like I said, I, it's not something I'm usually interested in arguing with, like, Catholics about because I think we mostly agree, honestly, about the, the, the, the idea that. Yeah, some kind of, you know, I sure hope, you know, if I were to die today, you know, I sure hope that there would be purification. I hope. I, you know, I, I, I. There's. There's a person I need to be, and there's a person I am right now, and, and I hope that I'll be able to continue to kind of grow into that. And, you know, like, I, I would, I hope for all those things. Yeah. But the things that I would. The thing that I would want to say, though, is to, to what you just said. If you think back for a moment about what I said about the ancient imagination, but the Irish imagination in particular, which is very, this is not quite. Right. Okay, but just go with me. Like, hyper literal. Yeah. Right. In the way that it's very literally focused on kind of this literal experience of the things that we would call supernatural. Right. You can see how they'd get to a point where it's saying, oh, when I experience sin like this in my life right now, that's like, you know, there's this, this toad sitting on me. Right. There's this, there's this, you know, demon like, separation between, even for them, like."}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":4546.83,"end":4569.24,"speaker":"Jonathan Pageau","text":"The, the, the, the experiences that we would consider, we'd call like anxiety or you know, all these things that they're, that they're so real that they, that they become, and they become embodied. Like the, the, the, let's say the width between in the analogy is so thin. Like for us it's really thick, but for them it's so thin that there's no other way to say it."}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":4569.24,"end":4741.77,"speaker":"Richard Rohlin","text":"And part of the reason it's so thick for us is because we've done so much to take various anxieties and psychoses and everything else and sort of say, oh, this is just a biological problem or it's a chemistry problem or it's like this other, you know, this, that and the other thing. And it may be some combination of all of those things, but it's, but there is a spiritual component to these things and we've sort of like relegated the, that to the background. Right. And so it makes us difficult to think about this until something happens in your life and you have like a genuine encounter with the demonic. Right. Which, which is, which is the thing that people have. And I think usually when that happens, there's, there's some kind of clarity that goes in. But that, that person who has that kind of encounter is also the person who, who tends to be like, going to be like the most hyper rigorous Christian that, you know. Right. And to kind of go back to what we're saying, like part of that is just the fact that, that everything is so deeply real to them. Yeah, right. That there's no, there's no, you know, there's no space for kind of like ambiguance, ambiguity. Sorry. So, yeah, so anyway, all this to say, all this to say Dante's going to do something really unique with Purgatory, which is to actually reveal it to be exactly what Jonathan just said it was. Which is not just this, here's the thing that you better avoid when you die, but rather to show it as this is the experience of the Christian life lived now, which is a life as sanctification, life as purgation from your sins. Because we're moving to paradise. This life is all we've been given with any certainty. Like, we don't know. Like, you know, especially from an orthodox standpoint, we certainly don't know, like with absolute certainty, you know, what the timeline is after you die. Right. We just don't know. But this life is what's been given to us with absolute certainty. This is what's been given to us for repentance. And so what we need to do is to begin to. Is to begin to actually do what Sir Owen did, actually, which is to enter purgatory voluntarily, like, to begin the process of. Of purification now. And Dante kind of lays out a beautiful roadmap for that in Purgatorio. It's why it's my favorite book of the comedy to teach, and it's why I think it's, in many ways, like, all the juicy stuff is in Inferno, you know, because, like, it's really fun to look at these sinners getting their, you know, what's coming to them or whatever. But Purgatorio is, in many ways, it's the most practical because it's. It really hits us right where we're at right now. So, August 27th, folks, please, please, please come and join us for the class. You won't regret it. It'll be five amazing weeks of really getting deep into the question of what does it mean to be purified? And I think you'll enjoy it."}
{"episode_id":"SW - #355 - 2024-09-03 - Richard Rohlin - Universal History - The Surprising Irish Origin of Purgatory","start":4742.65,"end":4760.09,"speaker":"Jonathan Pageau","text":"All right, we'll see you there, everybody. If you enjoy these videos and podcasts, please go to the symbolicworld.com website and see how you can support what we're doing. There are multiple subscriber tiers with perks. There are apparel and books to purchase, so go to the symbolicworld.com and thank you for your support."}
