{"episode_id":"SW - #370 - 2024-12-24 - The Restoration of Notre Dame - Did They Get It Right -","start":0.16,"end":63.45,"speaker":"Laura Diaz","text":"Tucson, the weight is over Mediweight loss. They're officially open on North Oracle Road. That's right. No more counting down the days. You can walk in right now and start your journey to a healthier you. Hey, it's Laura Diaz from iheartradio and you can trust me. This isn't just another weight loss clinic. I know that because it's where I lost weight safely with real medical support. GLP1 medications. You can see them everywhere online right now. But the truth is your health shouldn't be a DIY project ordering these meds without the professional guidance. It can lead to dangerous mistakes, wrong doses, no oversight, and serious risks at mediweight loss. I got the same medication but with a customized plan, weekly check ins, and a licensed physician guiding me every step of the way. And the cost? The same as those risky online options. Tucson, your moment is here. If you're ready to take control, feel better and lose weight the right way, mediweight loss is ready for you. Walk in, get started and see real results. Call or visit mediweightloss.com to learn more and book your free consultation today. That's mediweightloss.com so for the subscriber only."}
{"episode_id":"SW - #370 - 2024-12-24 - The Restoration of Notre Dame - Did They Get It Right -","start":63.45,"end":491.75,"speaker":"Jonathan Pageau","text":"Video for the month of November, I decided to make a commentary on some aspects of the restoration of Notre Dame Cathedral. And once in a while we make these videos public because as you might know, you know, the fact that people subscribe to the symbolic world and, you know, participate financially is what makes us go. We're not a big enough channel to, you know, make money with advertisement. And I also don't want to advertise products myself on the channel. So because of that, people joining the symbolic world and participating is what helps us keep going. And every month people get an extra video and also a Q and A that you can participate in and some discounts on the courses and all the stuff that we do. And so for your consideration, the subscriber only video for the month of November. This is Jonathan Petro. Welcome to the symbolic world. Hello everyone. For our November Patreon video, we're putting it out a little late this month. I thought that we could look at the restoration of Notre Dame. You know, when the fire of Notre Dame happened, it was a very strange moment for me. I don't completely understand why. I'm not usually a highly sentimental person, but when I heard about the fire of Notre Dame and when I saw the images, I just started crying. I just started crying rather strangely and uncontrollably and I sometimes I Wondered later, I wondered if it was because I could see that this was a watershed moment, that in some ways this was symbolic of what is happening in Europe, what is happening to Europe's Christianity. And so, you know, and then a lot of the weird. We don't know if it's gaslighting or the fear that of course the fire would be blamed on strangers of different faiths. You know, there was a lot of weird communication about the fire and about what happened. And so, you know, that seems to have not been completely answered, at least. I see. Maybe I'm wrong, but it seems like it hasn't been completely answered. But despite that, after a big, what seemed to be a very scary discussion about what the church would look like in its restored versions, you know, from turning it into a kind of, you know, LED screened, you know, modern museum looking building, finally it seems like cooler heads prevailed and they rebuilt the church very traditionally, kind of restored it to its former glory, except for a few things. And that's what I'd like to talk to you about. As you see in the image portrayed below, there is this very strange thing here. This, of course, is the altar for the church. And it stands out very strangely, you know, right there in front of the high altar as this kind of strange, modern looking piece. And so I thought it could be an opportunity to look a little bit at what happens when a lot of the modernists try to reinterpret these kinds of symbols. And sometimes I don't think it is on purpose, but there is a kind of revolutionary intuition which plays itself out in the work themselves. And if we're not careful, then we are often making things. No. That are the opposite of what they represent. And so this seems, in my opinion, to be the case. And so a lot of people maybe are watching this, maybe don't know a bit about altars. I want to talk a little bit about altars and what they look like and what they. What they are, what they represent. And then we'll consider this particular altar the way that it was designed to see, you know, what exactly could it be? Could it mean, like, what is it trying to. To show? All right, and so one of the things that happened in the Middle Ages is that the. The older altars, which in the Orthodox Church we still have these older altars, which are kind of rectangular or square and are in the holy place of the church, in the sanctuary. And this, of course, is the ancient practice of the altars. The earliest altars that we have in the Christian churches had this form they are, of course, described in a way that is very similar to the way that the altars were described in the Old Testament. You know, all the altars that are described in the Old Testament are square. And there's a reason why they're square. They're. They're square because they represent the earth, which is going to sound weird for a lot of people, you know, because not the earth, of course, as the planet floating in the heavens, but the earth and the experience of the earth, which is something like static, stable extension, right? So four directions extending in four. In four directions. That's why the Bible and many ancient people talked about the corners of the Earth, the idea that the Earth is extension. It's also particularity. If you think about the difference between a circle and a square. You can see, of course, that a circle is one. It doesn't have corners. It doesn't have four. It has one. Whereas it. The Earth has four. It has four corners. And the four corners. It's very practical. Symbolism is very practical. It's very practical because actually, if you want something to be stable and hold on the ground, you give it four. Just like an animal has four legs in order for it to stand properly on the ground, just like a chariot would have four wheels for it to be stable on the ground. And, you know, that is why a car has four wheels. All of these reasons are very based in general experience, but they are also based on this experience of the Earth as the stable place, as the place, you know, on which we stand. And it's represented at a square. This square, of course, then will take its. You know, there will be extensions of this square in many places, whether it be buildings themselves, whether it be the tabernacle itself, which is a rectangle. You know, of course, the square is the perfect rectangle. You know, in some ways it's the perfect extension, but it's also, you know, completely fine for altars and for these types of structures to be rectangle in the sense that they are just have this stability on the earth and kind of represent this extension."}
{"episode_id":"SW - #370 - 2024-12-24 - The Restoration of Notre Dame - Did They Get It Right -","start":491.99,"end":551.56,"speaker":"Laura Diaz","text":"Now, Tucson, the weight is over. Medi weight loss. They're officially open on North Oracle Road. That's right. No more counting down the days. You can watch walk in right now and start your journey to a healthier you. Hey, it's Laura Diaz from iHeartRadio. And you can trust me, this isn't just another weight loss clinic. I know that because it's where I lost weight safely with real medical support. GLP1 medications. You can see them everywhere. Online right now. But the truth is, your health shouldn't be a DIY project ordering these meds without the professional guidance. It can lead to dangerous mistakes, wrong doses, no oversight, and serious risks. At mediweightloss, I got the same medication, but with a customized plan, weekly check ins, and a licensed physician guiding me every step of the way. And the cost? The same as those risky online options. Tucson, your moment is here. If you're ready to take control, feel better, and lose weight the right way, mediweightloss is ready for you. Walk in, get started and see real results. Call or visit mediweightloss.com to learn more and book your free consultation today."}
{"episode_id":"SW - #370 - 2024-12-24 - The Restoration of Notre Dame - Did They Get It Right -","start":551.56,"end":1451.5,"speaker":"Jonathan Pageau","text":"That's mediweightloss.com the symbolism of this was reiterated in different ways in the ancient church because very old churches often have what we call a ciborium. And so a ciborium is a shape, is a kind of canopy that is above the altar. So you can see here some rather old ciboriums where the altar is placed, of course, in again in the sanctuary. And then above the altar you have a little architectural structure that will usually include either a dome, so you can see the dome here on top, which is like a microcosm of the entire church. So the entire church has a dome at the top. And then it's square and it has four pillars that hold it on the ground. And then the altar is beneath here and has this square sense. Now you can do this in many different ways, right? Look at here, for example, how now the four pillars are integrated into the altar itself here. Now you have four pillars that move into a canopy. This canopy can be also represented in many ways. You can have here an actual dome at the very top, which is a microcosm of the heaven above. And then the earth below being held together into four pillars. You can have it in this way, which is you have a dome on the inside, which now is more like representing in some ways the church. If you have the experience of the church inside. If you looked at this space here, you know, you have that same experience. It's square, sorry, you can't see the top of it. And then there's the apse on the inside. So you have this, this, this, this frame and then you have the circle and the inside which represent the heavens. And if you're not sure that they represent the heavens, there's a nice reason why you would put stars up there because it does represent the heavens. You know, just like the domes represent the heaven. And then with the earth Below, you know, and so this is, of course, a little microcosm of the entire world. All of it makes sense, you know, and there are many types of practices. It's not like there's just one way to do it. There's variety and way to do it. But that variety, you know, nonetheless has a kind of coherence to it, which gets represented in many ways, in many iterations. Look at here, like, let me give you a little example, right? So I didn't even notice this when I started the video, but look at how in this particular church, which is a church in Cleveland, Archangel Michael Orchestra, maybe someone watching the video is from this church. Look at how they did the little altar, the little tabernacle. So look at how the little tabernacle is in some ways a little microcosm of what we're talking about. So it's square, right? And then it has a little dome at the top, a little point at the top. It goes pointy. Some of the ciboria that are here, sometimes they'll have a little roof at the top, like a little pointed roof. And so whether it's round, whether it's pointed, you know, whether, you know, all of these things, you know, are variations on the basic understanding and the basic theme of a microcosm of heaven and earth and the altar representing the stability. Now, of course, there's a difference between the altars in the Old Testament and the altars in the New Testament. And the difference is that we don't burn things on them and we don't keep. Kill things on it. And therefore. And we also prepare. How can I say we. We don't prepare, but let's say we offer the food there, you know, and it's bread and wine. And the table also represents the table that Christ used during the Last Supper. So it's, it's. It's the kind of this joining of the symbolism of the altar with the symbolism of the table for the Last Supper. And then again, the symbolism is all joined together, and the coherence is just intuitive. Like, it's not like anybody has thought about. I mean, yes, maybe, but it's not like it's not like this. Everybody knew about. About thinking about it this way. It was just. It's. It's so intuitive and it's so right to do it this way that it just makes sense, you know, that obviously a table is also square. If you want to eat on a table, you want the table to be solid. And so most tables will have four legs in order for them to be solid on the ground, there are alternatives. But most of the tables in the world that you'll encounter will have that shape because it's practical, but then also it's symbolic because it has this structure of the earth as the stable ground. Okay. Now, in the European Middle Ages, they developed these altars that we call high altars. And the high altars now were a little different from the. From the. From the ancient altars. They had the altar up against the wall of the back of the church, as you can see here, you know, and so instead of now having a rectangle in the middle of the holy place, they kind of put it up against the wall. It really did emphasize, in some ways the sacrificial aspect of the Mass, you know, whereas in the Orthodox Church, there's obviously the sacrificial element, but there's also this kind of communion. So if you have a church where people are concelebrating, you'll see, when you look, you'll see all the priests kind of gather around the table in order to partake in the. The meal. And here we have more of an emphasis on. On the sacrificial aspect. And so the church, the. The altar gets placed against the back of the wall, and we develop what we call a rerodos, which is this backing of the. Of the altar with images that represent, you know, some of the Christian symbolism. Some of these are absolutely magnificent and beautiful. Like, this is very, very beautiful image. If you look at it, it's an apocalyptic image. So you see Christ in the heavens, and then you see the altar with the Lamb here at the bottom. I'm pretty sure that's what I'm seeing. I hope that's what I'm seeing. I'm not inducing you into error, but I think that's what it is because you also have the Lamb up here. So this beautiful imagery. And the imagery, of course, usually will continue to have this image of the ciborium, but in the railroados, it's not 100% again, but it's just natural that the rarer dose will have a pointed shape usually, or will have, you know, a middle spire that will go up higher. There'll be like a little microcosm again of the architecture of the church, but now in the altar space, because in some ways, you know, this. The church functions at these, as these embedded microcosms within themselves. And so we developed the symbolism now, as people know, during Vatican ii, they. Because they changed the direction of the worship. They had the priest facing the people. They reintroduced the older form of the altar, and then did it in a weird way. They reintroduced the older form of the altar, but then now had the priest standing behind the altar looking at the looking west in order to kind of be interact with the people more, etc. Etc. And so the. I don't have a picture of. Well, actually, I don't have a picture of a modern Catholic. Catholic altar, but the modern Catholic altars, actually, no, I do here. And so here. No, no, this is. Sorry, folks, I'm messing you up here. And so. Yeah, well, the modern Catholic altars look more like these. They have the altar here and there's a space behind very much like in the Orthodox Church, but instead of the priest standing towards the east, this priest is standing behind the altar and looking west. Now, let's come to this. So why does this make us uneasy? Now, if you've been paying attention from the beginning of the video, you'll already understand why it makes you easy uneasy. Now, if I'm going to give them the benefit of the doubt, I will say that one of the things they were hoping to do was to create a kind of symbolism of a ship. Maybe you don't see it from the top, but it's actually a rectangle. It's not round, it's not a circle. It's like a rounded rectangle that goes down like this. So if I was going to give them the benefit of the doubt, I would say that they're trying to represent a ship, you know, and maybe, I don't know, but one of the things for sure is that this is completely. Can I say this? This makes no sense. Like, it just makes no sense very, very intuitively, which is that if you see something around on the ground, your intuition is that this thing is. Is going to fall over. This thing is unstable, obviously, because it's round at the bottom. It's a wheel. This is not something that is stable and is held down, you know. And so because of modern, our modern capacity to make these things and because we have the technical skill to do it, I'm sure this altar is not going to fall over. It's probably held in quite nicely underneath. But the experience of the altar is that it is something like a wheel. It's something that is going to turn, it's something that's going to fall. It is instability itself, because that's what a wheel is. A wheel is change, you know, that's not very hard to understand. A wheel is change. And so when you see that, you know, and then the fact that it is also done in an absolutely minimalist, modern style well, emphasizes, again, this real aspect of it, which is that it is change, it is progress, it is modernity. It is all those things. And it is obviously more that than it is an altar, because it also completely stands out, which is that it doesn't try even to integrate into the space. It has no. This object has no desire to be related to all the other furnishings that are in this building and all the statues and the images. It wants to stand out. It wants to be something that you notice as being completely, completely different from everything else. And therefore, at every single level, the style of it, the way it's the. You know, the. The execution of it and its shape all point to the same thing, which is instability, change, you know, transformation, all of the. These aspects, which is not an image of the earth that the altar is. Because you think about how what an altar is. An altar is the place where you gather the things from earth and you offer them up so that they receive the blessing from heaven. And that's why the altar is square. You know, in the Yom Kippur sacrifice, I think it's. In that particular sacrifice, you know, it's very important. The corners of the altar are extremely important. They actually have horns, like these horns at the corners of the altar. And the priest will put blood on the corners. Because you're trying to kind of bless the extension of the earth, right? The fullness of the multiplicity that are stable, multiplicity at the edge of the earth. This altar is fluid. This altar is change. It's like, you know, all of it just is completely. Completely coherent, but coherent in the way that progressivism and modernism is, which is fluidity, change, transformation, progress, all of that. And so, you know, the weird thing, too, is that, you know, it's like. It's hard not to feel like this is some. Also, to some extent, a little bit of a spiteful revenge, you know, a little bit of a spiteful revenge from the people or by the people that maybe would have hoped that this church would have been restored in a modern way, would have been restored with the modern idea and not just returned to its former appearance. You know, I'm speculating here. Obviously. I don't know if this was explicitly the intention, but at least the sense of it is something like, oh, we'll restore your church the way it was, but we'll get the altar, we'll get the holiest place, you know, and we'll have it and we'll claim it. You've Lost folks. Like, this is it. This is the future of the church. It is change and fluidity and all of that stuff, you know, which this altar clearly represents, you know, and so. And, you know, in terms of the idea, like I said, the most generous interpretation I could make of this is that they're trying to make it look something like a boat, something like a ship. But that. That just isn't right. You know, it's. By the way, it's interesting because even the ark, if you read the description of the Ark of Noah, it's actually described kind of. Kind of a square, which is fascinating. It's described as a rectangle, which is fascinating. But also, you know, the church, the nave, the church, the place where all the people gather together is already called a ship. And, you know, it's like that's. It's not round, you know, it is square because it's also the earth at the same time. It's not just this. Anyways, I think you understand what it is that I'm trying to help you see. And so. And so even just the experience. So it's like, think about people who walk into the church, you know, what is their. What is going to be their experience? Their experience is going to be, look at all this, look at all this. Wow, wow, wow. And what. Oh, what. Oh, oh, I see. What's that like?"}
{"episode_id":"SW - #370 - 2024-12-24 - The Restoration of Notre Dame - Did They Get It Right -","start":1451.58,"end":1451.98,"speaker":"Laura Diaz","text":"What."}
{"episode_id":"SW - #370 - 2024-12-24 - The Restoration of Notre Dame - Did They Get It Right -","start":1452.54,"end":1549.15,"speaker":"Jonathan Pageau","text":"Why does that look so different from everything else? And that is embedded at every single level of the execution of this object. And so, anyways, I just wanted to give you a little meditation so you can kind of understand how the strategy of, let's say, modernism, it doesn't mean that things can't be modern, but it is this modernistic, revolutionary approach to visual spaces, to architecture, that create the type of uneasiness that we feel when we see an object like this, you know, plop down in a Gothic. In a Gothic interior with a bit of baroque. With a bit of baroque excess in some of the statues. So. So, yeah, so I don't like it. I have to say that I do not like it. But I'm nonetheless grateful that they didn't do this to the whole church, even though they did get the altar. And I am looking forward to be back in Notre Dame. I was in Notre Dame. I was in Paris last year and with my kids for the first time, was able to bring my kids there. And I was quite sad that we could not go into the church. And so I hope next time I go to be able to visit. And so, everybody, thank you for your attention. Thank you for your support and talk to you very, very soon. Bye Bye. If you enjoy these videos and podcasts, please go to the symbolicworld.com website and see how you can support what we're doing. There are multiple subscriber tiers with perks. There are apparel and books to purchase. So go to the symbolicworld.com and thank you for your support."}
{"episode_id":"SW - #370 - 2024-12-24 - The Restoration of Notre Dame - Did They Get It Right -","start":1549.79,"end":1610.82,"speaker":"Laura Diaz","text":"Tucson the Weight is Over Mediweight Loss they're officially open on North Oracle Road. That's right, no more counting down the days. You can walk in right now and start your journey to a healthier you. Hey, it's Laura Diaz from iheartradio and you can trust me. This isn't just another weight loss clinic. I I know that because it's where I lost weight safely with real medical support. GLP1 medications. You can see them everywhere online right now. But the truth is, your health shouldn't be a DIY project ordering these meds without the professional guidance. It can lead to dangerous mistakes, wrong doses, no oversight, and serious risks. At mediweightloss, I got the same medication but with a customized plan, weekly check ins, and a licensed physician guiding me every step of the way. And the cost? The same as those risky online options. Tucson, your moment is here. If you're ready to take control, feel better and lose weight the right way, mediweight loss is ready for you. Walk in, get started and see real results. Call or visit mediweightloss. Com to learn more and book your free consultation today. That's mediweightloss. Com."}
