{"episode_id":"SW - #314 - 2023-11-16 - Dr Martin Shaw - The New Odyssey","start":0.72,"end":60.39,"speaker":"Martin Shaw","text":"And you and I sat surrounded by broken glass, smoking these cigars and drinking Guinness. Do you remember at the top of Grafton Street? And the thing you said, and I agreed with you, said, you know, myth and story is just the best way to talk about almost everything. It's the indigenous way to talk about everything. It's the classical way to talk about everything. It's the Arthurian way, it's the Irish way, it's the Russian way, it's the aboriginal way. It's what we've always done. It's. There's a very old notion I'm interested in, which is human beings get made. It's actually a process. And if you don't have connection to stories, rather like a cloak, then you are prone to enormous floods of anxiety as you get older, as you experience the duress of life. Despite all the gadgetry, if we don't have this very ancient technology called a story close to hand, we were unequipped in some way."}
{"episode_id":"SW - #314 - 2023-11-16 - Dr Martin Shaw - The New Odyssey","start":71.99,"end":113.52,"speaker":"Jonathan Pageau","text":"This is Jonathan Peugeot. Welcome to the Symbolic World. So, hello, everyone. I am overjoyed to be with Martin Shaw again. He is. Martin Shaw has been on my channel before. We've done some events in Ireland and in England. He is a mythographer professor at Stanford, wonderful writer, amazing storyteller, and he is going to be one of the headline speakers for the Symbolic World Summit. So I'm really excited to be able to continue our exchanges. And so, Martin, thanks for coming on."}
{"episode_id":"SW - #314 - 2023-11-16 - Dr Martin Shaw - The New Odyssey","start":114.42,"end":118.98,"speaker":"Martin Shaw","text":"Jonathan, delighted to be here and very much looking forward to Florida in February."}
{"episode_id":"SW - #314 - 2023-11-16 - Dr Martin Shaw - The New Odyssey","start":120.1,"end":148.18,"speaker":"Jonathan Pageau","text":"And so, Martin, you are a storyteller in ways that is difficult for modern people to understand. So this is something that I also at first didn't totally grasp. And in meeting you, I started to understand it, which is that you are one of the few people I don't know left in the world. Not many people that tell stories over sometimes days, you know, like hours and then sometimes days. And you are getting ready now to give a version of the Odyssey?"}
{"episode_id":"SW - #314 - 2023-11-16 - Dr Martin Shaw - The New Odyssey","start":148.58,"end":223.27,"speaker":"Martin Shaw","text":"Yeah, that's true, Jonathan. I'm going to be telling the truncated version from Friday night through to Sunday afternoon, really, without a breath. That's the synopsis. That's the synopsis. So I'll report back to you how that went. I haven't told it since before lockdown. So stories from a bardic perspective, they are irascible, animate beings and they require a kind of courtship. If you're going to tell them, they're not just repertoire, they're not just going to show up. And so I found that for the first couple of weeks. The Odyssey simply didn't want to be remembered by me. It gone into a huff. It had gone to the back of Polyphemus Cave and wouldn't come out. So you just have to sit there with a story and show fidelity to it until finally it says, okay, let's try this out. But as you will know, through our time together, I don't tell stories in this kind of recital manner. It's very much imagining out loud. So that interest in spontaneity, that interest in trafficking in wild thoughts, that was kind of what got me into this in the first place."}
{"episode_id":"SW - #314 - 2023-11-16 - Dr Martin Shaw - The New Odyssey","start":224.55,"end":238.53,"speaker":"Jonathan Pageau","text":"But so there's a kind of a. I guess there's a mix between getting the basic. Let's take the basic structure of the story, right? You know, you know, you have the element that you can't transgress that, and then weaving through that with. With a kind of improvisation."}
{"episode_id":"SW - #314 - 2023-11-16 - Dr Martin Shaw - The New Odyssey","start":239.17,"end":311.81,"speaker":"Martin Shaw","text":"Think of it like a recipe that's been passed down through a family. And no one is meant to mess with the recipe. And for the first hundred times you cook it, you cook it exactly as your aunt told you to do. But On Cook Up 101, you discover smoked paprika. And you don't know if you're arguing about smoke, paprika or not, but you can add that little thing. It's to do with what they call the sense and the matter of stories. The matter of the story is what you just described. It's the A to B to C. But the sense of the story is the genius in it. And it's why three people could turn up and tell the Handless Maiden, but there'd be one telling that you would energetically. You'd lean. You'd lean to them rather than all three. It's not a sort of generic handout. Storytellers are odd figures who have usually been hurt by the world early on. And to make sense of a cosmos where most mythology is lying in pieces around our ankles, Stories are sense making devices. You know, they're codes of a fashion. Hmm."}
{"episode_id":"SW - #314 - 2023-11-16 - Dr Martin Shaw - The New Odyssey","start":311.81,"end":339.24,"speaker":"Jonathan Pageau","text":"Well, the Odyssey. I know when I told the ancient stories to my kids, the Odyssey was the one that just stuck to them. My daughter, when she was 11 years old, or maybe even, I think around, maybe Even younger, like 10, 11, she memorized the ABC of the Odyssey. She knew all the sections. She didn't know. I mean, she didn't memorize the story, but she, she could tell you what all the narrative elements were. And she, she did it one time at a campfire where she just kind of enumerated the new."}
{"episode_id":"SW - #314 - 2023-11-16 - Dr Martin Shaw - The New Odyssey","start":339.24,"end":339.6,"speaker":"Martin Shaw","text":"The."}
{"episode_id":"SW - #314 - 2023-11-16 - Dr Martin Shaw - The New Odyssey","start":339.6,"end":353.28,"speaker":"Jonathan Pageau","text":"The. The narrative elements, at least of the story. And so I was really surprised at just how much it stuck. And so now, and you're rereading it and sitting with it, what insights have you come out. Have come out of that. That time?"}
{"episode_id":"SW - #314 - 2023-11-16 - Dr Martin Shaw - The New Odyssey","start":353.76,"end":473.56,"speaker":"Martin Shaw","text":"Well, there's a strong one. If you were a Mediterranean warrior from 3,000 years ago, you lived in what I would call a chaos culture. Not chaos, but cleos. Now, cleos means imperishable glory. It means your reputation that lives on once you're gone and you remember, to a Mediterranean warrior, that's not heaven you're going to. It's this far more ambivalent underworld. So you want your reputation to exist longer than you. But here's the rub about clios. Chaos is entirely dependent on. On external validation. You can't give yourself clayos your sense of. In an oblige. It doesn't matter. It doesn't really matter. There is no you in the way that modern people think about it. It is all about how other people look at you. So as I come to telling it again, I realize we're living in another age of chaos. And our screens, which are the temples that we now generally serve in, and our mirrors, which we are entranced in, like Narcissus, we've replaced what I. We've replaced shelter with comfort, religious shelter to spiritual comfort. We have a kind of a la carte attitude towards, you know, cosmological, spiritual, religious issues, and we just pick and choose what we want. So that's been the strange thing, and it often happens with a story. There's a reason why the Odyssey has now been remembered. An active act of remembering for 2,800 years. Something like that. It's because the Odyssey is happening every day. The issues that are going on in it are hardly perennials. They don't go away. So the chaos thing has been big for me. Mm."}
{"episode_id":"SW - #314 - 2023-11-16 - Dr Martin Shaw - The New Odyssey","start":474.36,"end":476.56,"speaker":"Jonathan Pageau","text":"And so when you say that we."}
{"episode_id":"SW - #314 - 2023-11-16 - Dr Martin Shaw - The New Odyssey","start":476.56,"end":476.84,"speaker":"Martin Shaw","text":"That."}
{"episode_id":"SW - #314 - 2023-11-16 - Dr Martin Shaw - The New Odyssey","start":476.84,"end":496.8,"speaker":"Jonathan Pageau","text":"That we live in this new age of chaos, you mean in terms of, let's say, the likes and the. The. The kind of this. This kind of outer approbation of our. Of our. Of our existence. Let's say, like, we need to. We need to be seen by the world. We need to show ourselves on Instagram and to have that kind of. Is that. Is that what you mean? Yeah, yeah."}
{"episode_id":"SW - #314 - 2023-11-16 - Dr Martin Shaw - The New Odyssey","start":496.8,"end":572.51,"speaker":"Martin Shaw","text":"It's a kind of anti John of the Cross. It's an anti still small voice. These days, if we even get in touch with our still small voice, we may be getting fake news. From our own psyche because we. Because we don't tell stories anymore. We don't actually do it in the jaw, what they call the Mead hall of the jaw. Then stories remain as. There's a poet called Friedrich Holderland, and he said, gods, be careful. You have become decorations in their poems. And the reason it's good to tell stories orally is the stories stop becoming decorative or witty. They bring their troubles right to your door, and they start to do the work that can only be told when you actually involve it. So kudos to your daughter. Kudos to my daughter, who, when she was about 8, knew all of Wolfram von Eschenbach's Parsifal. And I implore everybody. I'm so thrilled with what's going on with Symbolic World and this whole network that's happening. YouTube has become a really interesting place. My. My one petition would be that when people study your story with you, they go away in small groups and tell it to each other."}
{"episode_id":"SW - #314 - 2023-11-16 - Dr Martin Shaw - The New Odyssey","start":572.51,"end":573.59,"speaker":"Jonathan Pageau","text":"Just try it out."}
{"episode_id":"SW - #314 - 2023-11-16 - Dr Martin Shaw - The New Odyssey","start":573.59,"end":576.71,"speaker":"Martin Shaw","text":"Take a risk. Maybe there are myth tellers amongst you."}
{"episode_id":"SW - #314 - 2023-11-16 - Dr Martin Shaw - The New Odyssey","start":577.11,"end":583.11,"speaker":"Jonathan Pageau","text":"That's an interesting idea. We're doing now a kind of intense reading of Beowulf with Richard Rowland."}
{"episode_id":"SW - #314 - 2023-11-16 - Dr Martin Shaw - The New Odyssey","start":584.07,"end":584.43,"speaker":"Martin Shaw","text":"And it's."}
{"episode_id":"SW - #314 - 2023-11-16 - Dr Martin Shaw - The New Odyssey","start":584.43,"end":612.11,"speaker":"Jonathan Pageau","text":"And it's really insightful because it's something like a Christian reading of Babel, trying to help people see the Christian cosmology that a lot of the scholars actually can't see because they don't know the Book of Enoch and all these weird traditions in Christianity. But it's a good idea to then maybe take that and be able. And. And then retell Beowulf. I. I used to do it too. I actually memorized the elements of Beowulf and would tell it, like, at the campfire. We'd have this storytelling at the campfire, try to kind of get into the story."}
{"episode_id":"SW - #314 - 2023-11-16 - Dr Martin Shaw - The New Odyssey","start":612.91,"end":647.72,"speaker":"Martin Shaw","text":"Yeah. By the way, I'm very interested that you and Richard. And thank you for introducing me to Richard's work. The man has a mind as big as a prairie. He's fantastic. And the two of you together. Wow. From next week on Substack all the way to Christmas, I am telling the Icelandic saga of King Kraki, which. Which is the dark twin of Bewolf. It's. It's darker than Bewolf. Okay. Just as a. Just as a. Just in case people were wondering what paganism really looked like."}
{"episode_id":"SW - #314 - 2023-11-16 - Dr Martin Shaw - The New Odyssey","start":649.96,"end":661.16,"speaker":"Jonathan Pageau","text":"Evo. There you go. And so that's. But that's an insight that you. Just before we started recording, you mentioned something about that. You said that you feel like the world is becoming pagan again. But with some differences."}
{"episode_id":"SW - #314 - 2023-11-16 - Dr Martin Shaw - The New Odyssey","start":661.32,"end":741.19,"speaker":"Martin Shaw","text":"I think the world is turning. The world has to turn pagan because atheism is simply too depressing. And I think the argument of rationality and. Rationality and irrationality, that's been a big religious argument over the last hundred years. I think to some degree, we're past that now. I think people are aware we all serve some kind of temple. And wherever we put our attention for any length of time, if we look at it in a certain way, we afford it enough significance, it becomes holy to us. That's what happens. But I think we are becoming pagan but without. Without the influence of the Olympians, without the wisdom of those, you know, those beings that direct and inform those stories. So I'm not advocating for it, but Cleos is a pagan response to the world. Chaos is a pagan response to the world. Imperishable glory is what was going on in Greek and Roman myth. Therefore, I see through, you know, being a father and having a teenage daughter, what is coming at her in endlessly through social media is an attempt to create just that kind of thing."}
{"episode_id":"SW - #314 - 2023-11-16 - Dr Martin Shaw - The New Odyssey","start":741.43,"end":788.26,"speaker":"Jonathan Pageau","text":"Yeah. One of the things that I've been thinking about in terms of the Odyssey, you know, I. I've been thinking that it is very appropriate to this time now, because the Odyssey is this desire to return home. You know, the. The sense of being adrift, being kind of, you know, moving around without. Without having an anchor and. And, you know, encountering all these strange principalities and the strange woman and all of this. All of this stuff. But then with this desire to kind of return home to. To the hearth. And so it feels like it's an appropriate. It's an appropriate story to tell today because we all seem to feel that we have this. We feel alienated. We feel like we don't have a place to stand and that we don't even know where to look, at least for now, where to look to find that home again."}
{"episode_id":"SW - #314 - 2023-11-16 - Dr Martin Shaw - The New Odyssey","start":788.74,"end":815.81,"speaker":"Martin Shaw","text":"Yeah. Now, you and I, coming from an orthodox background, would have the same take on that probably that C.S. lewis did, which is. You're really. That. Nostos. That's the word. The yearning that Odysseus has for Ithaca is nostos. In Welsh, it's called Hiraeth. It's this. It's homecoming. But it's more than homecoming. Lewis sensed it when he used to experience what he and Tolkien called Northernness."}
{"episode_id":"SW - #314 - 2023-11-16 - Dr Martin Shaw - The New Odyssey","start":816.13,"end":817.33,"speaker":"Jonathan Pageau","text":"It's a feeling."}
{"episode_id":"SW - #314 - 2023-11-16 - Dr Martin Shaw - The New Odyssey","start":817.89,"end":974.24,"speaker":"Martin Shaw","text":"It's a feeling the Jungians would call anima possession, but that's a grotesque phrase, so forget I ever said it. Anima possession. But the point of it is, yeah, from an orthodox perspective, from a Christian perspective, that is the divine world starting to radiate through this one and call to you. But it's interesting because you will know before. The other great text from Homer is the Iliad. Now the Iliad is not a story of Nostos, it is a story of war. It's a story of a great conflict in the great hero of that era, Achilles. And Achilles has the choice of. Because his mother is a goddess, he knows things about his life he should not know. And one of the things he knows is he has a choice. Do I want a small life filled with chaos or do I want a long life but absolutely obscure. And he goes down the James Dean, Jimi Hendrix dead at 28 Route, you know, but, but I'm fascinated by this because in. Now, the, the first time we met, we ended up talking about the Odyssey and mid conversation with you, I had a thought that I will now repeat because it's significance to me. I think in the Odyssey we hear an echo of the arrival of Christ, a foreshadowing. And the reason why is it's when Odysseus goes to the underworld and he bumps into Achilles, who does not have good words for him, but he asks Achilles, how's this chaos working out for you down here in the dark? And Achilles says, sooner be a slave to a poor man than king of the underworld. Now that is an anti kleos move. And as far as I can tell, the Beatitudes, the Sermon on the Mount, the sheer weird aikido countercultural moves of Christ turn all of that on its head. You're hearing what, 1800 years or something? 800, really. I suppose with Homer, before Christ, you're hearing the end of one age and the beginning of another. What's so mind blowing for me is because, you know, Copernican was on a trade route, so it's possible that, you know, can you imagine the Jewish boy is hearing some of these stories not as the Odyssey, but he might have heard fragments of them. I'm not saying they influenced him, it's just a mind boggling thought."}
{"episode_id":"SW - #314 - 2023-11-16 - Dr Martin Shaw - The New Odyssey","start":974.32,"end":1014.87,"speaker":"Jonathan Pageau","text":"Yeah. To think that it would be part of the same kind of storytelling world I've also seen in Odysseus. When Odysseus returns home and he, he dresses as a, as a beggar, basically, as a, as a beggar. And then he. What he wants, it seems like he wants his son to recognize him through. He wants the people that he loves to recognize and possibly through the, the disguise or or he's using the disguise to get back into to the house. There's something about that also about Christ, who, who comes as. Who is this king who's hiding in the. The lowest, the lowest image, you could say. I don't know if you've ever thought about that."}
{"episode_id":"SW - #314 - 2023-11-16 - Dr Martin Shaw - The New Odyssey","start":1015.27,"end":1086.82,"speaker":"Martin Shaw","text":"Yeah, more so recently than before. You know, the last time I told this story, I was a screaming pagan romantic. So a few things have changed in the last five years. One thing I'd say though is all of the trouble that Odysseus gets into is because of when he blinds the cyclops. The cyclops says to him, who did this? And Odysseus can't bear leaving without announcing his achievement. And when he says that, the cyclops, his father Poseidon says, right, I've got a zip code for Odysseus. Now he's done. And again, in a reversal of Kleis, the only way Odysseus can return to Ithaca, he leaves as somebody and he returns as nobody. And it's only through that shift does he finally display that wonderful word Metis. His particular wit, his particular cunning to get through being contact with his son Telemachus, speak to Penelope and then all the mayhem that then goes on. But that Christ connection is really interesting."}
{"episode_id":"SW - #314 - 2023-11-16 - Dr Martin Shaw - The New Odyssey","start":1087.14,"end":1147.32,"speaker":"Jonathan Pageau","text":"Yeah, well, I mean, it's interesting in the sense, but obviously Christ didn't have that other part. And you can see that in, you can see that in Christ, you see the opposite, which is. It's interesting because Christ hides his divinity during the story. He actually, he always says, heals people and says, don't tell anyone, you know, you know, don't tell anyone what I did. This weird. This. And it is only as he gets closer to his crucifixion, and it's in the moment when he's basically been beaten, you know, he's been tortured, he's bloody, and he's standing there in front of the, the judges, in front of the, the Synhedran. And then he says, you know, like, I'm. That I'm the son of man, basically. It's like. And you know, the, the high priest rips his vestment. But it's like, in that, it's, it's almost like a very different than the story of Odysseus, which is that first he hides it and when he reveals it, it's in the worst possible moment. It's like, it's in the moment where you're a prisoner and you've been completely humiliated and now you say, I am the son of a son of man, it's, it's a wild, it's a wild reversal."}
{"episode_id":"SW - #314 - 2023-11-16 - Dr Martin Shaw - The New Odyssey","start":1147.96,"end":1196.07,"speaker":"Martin Shaw","text":"Yes. And it's why as a mythologist, I just avoided my, my root system. I avoided Christ for 50 years because he was nonsensical to me. It's not difficult for me to fall into a kind of biological resonance with the great heroes of the earliest stories, but Christ is a much more thin skinned, pressurized kind of individual. Do you know, it's funny because I'm a storyteller, whenever Christ says don't tell anybody in my mind, in a fairy tale, whenever you say don't do that, it means do that. Now, I don't think that's what he meant, but I always smile at those moments because there's nothing more that will be quickly disclosed."}
{"episode_id":"SW - #314 - 2023-11-16 - Dr Martin Shaw - The New Odyssey","start":1196.95,"end":1229.25,"speaker":"Jonathan Pageau","text":"You know, that's a, that's an interesting point to think about. Like, it could be part of the, the, some of the deep ironies that Christ manifest. Just, you know, like they're, they, they appear especially in the crucifixion, but there are these deep, deep ironies in his story where, you know, he, he, he's humiliated but treated like a king at the same time. So it's, it's possible that when he says that, he's, it's almost like he's saying, you know, here's a seed, you know, keep it, keep it safe. And then it grows and it starts to grow and it starts to, you."}
{"episode_id":"SW - #314 - 2023-11-16 - Dr Martin Shaw - The New Odyssey","start":1229.25,"end":1259.15,"speaker":"Martin Shaw","text":"Know, I mean, this is, this is very much your bread and butter, you know, your, your bread and beer in terms of what you love. But the, the shock of coming to the Bible profoundly in middle age and recognizing it's this kind of echo chamber where everything is talking to everything else all the time and nothing is wasted. There's not a line in the book I can find that is wasted. Now. There are things I struggle with constantly."}
{"episode_id":"SW - #314 - 2023-11-16 - Dr Martin Shaw - The New Odyssey","start":1260.18,"end":1299.93,"speaker":"Jonathan Pageau","text":"I think you're supposed to, I, I think that there's something about scripture which makes it, that there are some stories. It's like you, you can see exactly what you said. You can see all of these things connecting and you can notice that there's this giant web of references that are, that are going backwards and forwards. And so you, you trust it. But then you come to some bit where, you know, in the book of Judges, the man who cuts his, his, his, his mistress into pieces and sends it off to the tribe. And it's like there are some bits that are so crazy and, and you know that this probably is hiding a very deep meaning because everything else is. But you can't. You can't catch it. You know, it's painful."}
{"episode_id":"SW - #314 - 2023-11-16 - Dr Martin Shaw - The New Odyssey","start":1300.41,"end":1451.31,"speaker":"Martin Shaw","text":"No. And I think as modern people, we are wired to like or dislike characters. We like strong signals about who's good, who's bad, what's going on. And then the Bible has these stories where supposedly good people suddenly do very strange things. You know, David is one of them. I'm telling this story, the Saga of King, right through the autumn, this deep Icelandic tale. There's no comedy value, none, in fact, in the sagas, if there's too much comedy in, you can be sure that that is a continental influence. That's not how the schools would have told it. But there's this one character called Halty the Magnanimous, who lives in a bone pile. He's the only guy who remotely approachable. The rest of them are just berserkers. And then just as you're starting to like him, he bites his girlfriend's nose off in an argument and continues talking to her, crunching up her nose and saying, well, you know, I think this is, I think this is it for me and you. I'm just not feeling it anymore and he's not. And my heart sunk at that moment because I thought Halty the Magnanimous was all I had. You know, he was my only moment of warmth in this, this, this thing. And so the Bible can be like that for me. And the, the way, you know, I, I, I find it an act of will sometimes to remember the Bible. It's as if the stories, they sort of test you. They almost want you to forget them. They want you to remember them. I'm just improvising this as I'm saying that to learn a story from the Bible is like when I'm in Divine Liturgy and Father Porphorius serves me that bit of bread soaked in wine that looks all, all to the world like a piece of meat. You know, all to the world like a piece of meat. And I'm suddenly in this kind of living iconography, you know, unchanged. It's amazing. I don't. Do you experience this at liturgy? I eat the bread, this tiny bit of bread, and I am no longer hungry. I notice this again and again. I'm always hungry. Obviously, I've been fasting since Vespers, and I get in there and I eat and I eat this tiny thing. But because of what it is subsumed in, it has this miraculous effect."}
{"episode_id":"SW - #314 - 2023-11-16 - Dr Martin Shaw - The New Odyssey","start":1452.91,"end":1458.35,"speaker":"Jonathan Pageau","text":"In the story of the saints. You have crazy stories of saints that live only from the Eucharist."}
{"episode_id":"SW - #314 - 2023-11-16 - Dr Martin Shaw - The New Odyssey","start":1458.77,"end":1458.97,"speaker":"Martin Shaw","text":"Wow."}
{"episode_id":"SW - #314 - 2023-11-16 - Dr Martin Shaw - The New Odyssey","start":1458.97,"end":1537.22,"speaker":"Jonathan Pageau","text":"I didn't tell you that's all they eat. Yeah, there's some wild stories. Sometimes it's like once a year or something. Like some really crazy story about eating the Eucharist once a year and surviving all through. But there's what you said about the scripture. There's something about the scripture stories which it's also because they've been so glossed that sometimes we kind of see them through the gloss, which is not bad because the raw stories are sometimes a little too much to deal with. But you can actually read all the Bible stories from multiple points of view. Very much like you could read the Iliad and, you know, sympathize with the Trojans and so you could try to read the story. So I, you know, read the story of Abraham and realize, and read as if Abraham is not, not a hero at all. And you'll see that the, the story will tell itself and it'll make sense and you can do the opposite. So there's this weird thing about the story and it's very algebraic. That's why it's difficult to remember. Because a lot of the more ancient types of epics, they have descriptions and they'll. There'll be like these poetic types of, you know, description of emotion. There's none of that in the Bible. The Bible is just like, this happened, this happened, this happened, this happened. You know, and so it's more difficult to. But once you see the pattern, you realize how powerful it is. It just takes more at least for our minds to pierce them."}
{"episode_id":"SW - #314 - 2023-11-16 - Dr Martin Shaw - The New Odyssey","start":1537.78,"end":1611.15,"speaker":"Martin Shaw","text":"Yes. And you have to be careful because once, if you are a chapter and verse Christian and you have so sort of calcified your imagination to the point where that is the only legitimate way those stories can be told or even chanted in our tradition, not even told. God forbid the intonation of your own voice and expression could come into it. You know, this is Martin Luther territory. So that has been a struggle for me is how far in, I mean, the great way in recently has been. I've been telling and will be continuing to tell the story of Joseph in Egypt as an underworld descent story. Joseph in the underworld. I've been telling the story of Job as the opening of what I call the Wonder Eye, where actually I think, although we think we're loaded up with questions for God, of course in that story, in the end, God doesn't answer any of Job's questions, but he does say, come have a look behind the veil for five minutes and then let's see. Then let's see how chatty you are. So I'm finding my way into it. I'm thinking a lot about the story of Samson at the moment and others."}
{"episode_id":"SW - #314 - 2023-11-16 - Dr Martin Shaw - The New Odyssey","start":1611.47,"end":1657.03,"speaker":"Jonathan Pageau","text":"Oh, man. This good story of Samson is. It is. Some of. I think one of the church fathers said that the story of Samson is the closest story to Christ in the Old Testament. And that's a. That's a. But you have to just see it through the right lens, which is Samson is trying to join with the stranger. That's what Samson is trying to do. And so he's this weird character that is moving towards. He's trying to join the margin and the center, right? He takes the door and brings it up to the top of the hill. That's basically what Samson is trying to do. But he keeps messing it up, right? He finds. He finds honey in the dead line. That's what Samson is. Right? But it's like. But at the same time, he. He can't hold it together. And then he has to. He has to kill himself."}
{"episode_id":"SW - #314 - 2023-11-16 - Dr Martin Shaw - The New Odyssey","start":1658.23,"end":1821.01,"speaker":"Martin Shaw","text":"That's the honey in the lion. Just as the sheer unintellectual power of that image. There's got to be a Christian group called Lion's Honey or something. It just begs for it, but it's. It's. I mean, I. I came into stories and I came into myth when I would have been in my early 20s. I'd loved them when I was younger, but I ended up living in a tent for four years. I don't know if we've ever talked about this. I ended up. It became important to me in the late 90s, when I would have been in my mid-20s, to see if there were any real pockets of British wilderness left. So I took off in a black tent without a phone or a computer, and effectively to the outside world, to some degree, disappeared for four years. And I just wanted to be absolutely undomesticated. I wanted to find what. There's an Irish philosopher, John Moriarty, calls it your bush soul. And so when I went through that experience, I found the best way to talk about it without the use of I statements was these old stories. You and I, we were once in. You and I once went walking in Dublin late at night, and every single person we passed was hurling bottles around that. You remember, they're just. Yeah, yeah, smashing. The whole. The whole town was in what you call Seamus. He says, we are approaching jubilation. They hadn't got to jubilation, but they were approaching it. And you and I sat surrounded by broken glass, smoking these cigars and drinking Guinness. Do you Remember at the top of Grafton Street? And the thing you said, and I agreed with you, said, you know, myth and story is just the best way to talk about almost everything. It's the indigenous way to talk about everything. It's the classical way to talk about everything. It's the Arthurian way, it's the Irish way, it's the Russian way, it's the aboriginal way. It's what we've always done in the. There's. There's a very old notion I'm interested in, which is we don't. Human beings get made. It's actually a process. And if you don't have connection to stories, rather like a cloak, then you are prone to enormous floods of anxiety as you get older, as you experience the duress of life. Despite all the gadgetry, if we don't have this very ancient technology called the story close to hand, we were unequipped in some way."}
{"episode_id":"SW - #314 - 2023-11-16 - Dr Martin Shaw - The New Odyssey","start":1821.01,"end":1869.71,"speaker":"Jonathan Pageau","text":"Yeah, I think that there's something. So if you think of something like an ethical code, for example, Right. A series of. That's fine, we need those. You know, they're important. But a story is like a tuning fork. You know, it, what, it kind of vibrates and you start to vibrate with it. And you can actually be transformed without understanding anything, without knowing why it's happening, without. Without having any rational explanation for why it is. You're being transformed because, because you're actually, you're identifying with the characters. You're, you're, or you're, or you're not identifying with the characters. And that's putting you in a space where you're basically. It's more like music, you know, you're more vibrating with the, with the pattern. And then at some point, without knowing it, you find that you're perspective has been transformed."}
{"episode_id":"SW - #314 - 2023-11-16 - Dr Martin Shaw - The New Odyssey","start":1870.11,"end":1961.97,"speaker":"Martin Shaw","text":"Yeah. And now what's going to. On that thought, what's going to happen in a few hours in my life is I'm going to get 70 people responding. Getting tuned at different polyphonic parts of the story of Odysseus. Not just one part, but many. It's a little bit like watching someone having acupuncture and they go, I'm not feeling much here. Don't feel anything there. Don't. Oh my God. That, that's. That's where it is. That's where the trouble is. Now, the thing that turns a myth from a reenactment fair or a seance into something that's actually happening in the room now, a living myth is exactly that. Proximity to wonder, that proximity to the Story doing its chthonic work on you before you've had someone allegorize it to death or tell you what it means. One of the things that I liked about the Exodus series that you did with Jordan and our mutual friend James Orr and others is that I was impressed at how much pandemonium, intellectual pandemonium, was going on. I was so pleased that that hadn't all been cut out and we just had the bits where you were all concurring and agree, nodding sagely. It was kind of messy. Yeah. And that really is its saving grace. We, you and I and maybe Jordan and a few. We should do one on. On the Odyssey."}
{"episode_id":"SW - #314 - 2023-11-16 - Dr Martin Shaw - The New Odyssey","start":1962.21,"end":1962.93,"speaker":"Jonathan Pageau","text":"Oh, yeah."}
{"episode_id":"SW - #314 - 2023-11-16 - Dr Martin Shaw - The New Odyssey","start":1962.93,"end":1973.65,"speaker":"Martin Shaw","text":"Just putting it out there, you know, of enormous. If you want to understand how we in the west tick. You cannot get there without stories like the Odyssey."}
{"episode_id":"SW - #314 - 2023-11-16 - Dr Martin Shaw - The New Odyssey","start":1973.73,"end":1981.01,"speaker":"Jonathan Pageau","text":"Yeah, that's a great idea to do a reading of the Odyssey and to kind of get. Go through the. The images. I would love to do that. We should definitely organize it."}
{"episode_id":"SW - #314 - 2023-11-16 - Dr Martin Shaw - The New Odyssey","start":1981.42,"end":1982.78,"speaker":"Martin Shaw","text":"Tell me about the conference."}
{"episode_id":"SW - #314 - 2023-11-16 - Dr Martin Shaw - The New Odyssey","start":1983.34,"end":1986.54,"speaker":"Jonathan Pageau","text":"So, okay, so that I'm speaking this."}
{"episode_id":"SW - #314 - 2023-11-16 - Dr Martin Shaw - The New Odyssey","start":1986.54,"end":1989.1,"speaker":"Martin Shaw","text":"I don't know what the. I know what the time, what it."}
{"episode_id":"SW - #314 - 2023-11-16 - Dr Martin Shaw - The New Odyssey","start":1989.1,"end":2114.95,"speaker":"Jonathan Pageau","text":"Means, you know, and so I've been doing this now for what, seven years, I guess since 2016. Slowly building up, let's say, helping, hopefully helping people see the world differently. I would say that's the thing that I've been doing, you know, also in line with some of the things my brother has been doing as well. And now what I'm. What I've noticed is that there are people that have been able to transform their thinking, and it's impressive to what extent they have been. And I was surprised because for. For a large part of my life, I felt like I was a freak that was a freak that thought in a very strange way and that nobody could understand. And now all of a sudden, there are these people that are. That are thinking this way. It's transforming their. Their. Their thinking. So the idea is to meet in person. Really. It's to. To instead of just doing this online thing, to actually come into the same space, you know, to. To. To meet each other and also to participate in. There'll be different streams. There'll be. There'll be a artistic stream, so artists will have a chance to meet each other, exchange about their work, look at how they can, you know, use this kind of mythical thinking in their work. There'll be one which is more like the home. How to include these. This way of living in your home. Symbolic living, symbolic thinking in your home life. And then there'll be obviously the universal history path, which is, you know, people moving closer to how to reinterpret history in a way that, that connects it with myth and then, you know, realizing that myth is the driving power of history. To be honest, that without the myth behind the history, you know, we don't care about these stories like the, the, the boring historical things have no, no spark if they're not anchored in something that is transcendent or something that you, that you can care about. That's why all the ancient people would connect their story to Troy and to, and to the Bible. It's like they, they had to connect to the ancient mythic path. So basically we're going to be there, there'll be some music, you know, and then obviously there'll be, there'll be you speaking, we'll be, have discussions. There'll be father Stephen DeYoung who I don't know if you've heard some of his."}
{"episode_id":"SW - #314 - 2023-11-16 - Dr Martin Shaw - The New Odyssey","start":2115.03,"end":2115.99,"speaker":"Martin Shaw","text":"Yeah, he's amazing."}
{"episode_id":"SW - #314 - 2023-11-16 - Dr Martin Shaw - The New Odyssey","start":2116.7,"end":2126.26,"speaker":"Jonathan Pageau","text":"So I just feel like even just having the three of us together is going to be pretty explosive. But then having all the people there, it's going to be great. Well, it is."}
{"episode_id":"SW - #314 - 2023-11-16 - Dr Martin Shaw - The New Odyssey","start":2126.26,"end":2132.46,"speaker":"Martin Shaw","text":"And I've also seen, you know, you've got Vespa, Stampa, you've got Nicholas, you got, you know, Kotar, Richard, rolling."}
{"episode_id":"SW - #314 - 2023-11-16 - Dr Martin Shaw - The New Odyssey","start":2132.54,"end":2133.34,"speaker":"Jonathan Pageau","text":"Neil the Great."}
{"episode_id":"SW - #314 - 2023-11-16 - Dr Martin Shaw - The New Odyssey","start":2133.42,"end":2141.22,"speaker":"Martin Shaw","text":"Like, I mean this is, this is, I go, you know, I buy a ticket for this. I'd be in the audience if I wasn't on the stage for sure, man. Yeah."}
{"episode_id":"SW - #314 - 2023-11-16 - Dr Martin Shaw - The New Odyssey","start":2141.22,"end":2173.71,"speaker":"Jonathan Pageau","text":"So I'm really looking forward to it. And, and in some ways, you know, I think that this, you know, rediscovering this ancient way of thinking and, and, and living, that's the key to the future. It's, it's not easy to connect it to the modern world. Sometimes it's, it's difficult to know how to deal with the technological world and kind of want to go back into this mythical world. But we have to work through it, right? We have to, we have to find a way to connect them together or else, or else we're going to lose ourselves."}
{"episode_id":"SW - #314 - 2023-11-16 - Dr Martin Shaw - The New Odyssey","start":2174.03,"end":2273.53,"speaker":"Martin Shaw","text":"So we are. And I think, you know, of course from a distance everything looks different from a distance. You know, when I try and explain to my friends that I'm an Eastern Orthodox Christian, a Russian Orthodox Christian, right now, that's not a popular look in Europe, I can assure you. But from the, it looks like one thing from the outside just looks like these odd shapes, bauble onions and strange looking things and everybody's standing up and what's going on. But you get in there, you get inside, and it's nothing to do with a long time ago. That's one of the great secrets of myth. Myth, when it is functioning efficiently, is not really to do with a long time ago. Those stories do not get remembered. The stories that get remembered are the ones the day that was not like the day before, and when you didn't have endless iPads or even literacy, you had to decide, what am I going to choose to remember? It was a conscious act of will. And as you were saying a few minutes ago, stories like the tuning fork, they do something to you. I'm very interested in the notion of noblesse oblige, which really translates as if you are noble, you have to act noble. And to act noble, you really need to be around stories that externally show you through symbolic images what that looks like. And without consuming that, it's very hard to stay focused on it."}
{"episode_id":"SW - #314 - 2023-11-16 - Dr Martin Shaw - The New Odyssey","start":2274.57,"end":2301.26,"speaker":"Jonathan Pageau","text":"And so you've been. You've been on a path like a massive transformation, you know, in your own personal life then obviously, also, even, I imagine, even your readers, there's been change in that world, like who. Who is. Who's coming to the workshops, all of that. And so I'm. I'm curious to see, you know, your. The change of your perspective and how it has changed your vision of storytelling. Do you feel like the way that you see stories or that you engage with stories that change in the past few years?"}
{"episode_id":"SW - #314 - 2023-11-16 - Dr Martin Shaw - The New Odyssey","start":2301.74,"end":2560.44,"speaker":"Martin Shaw","text":"Yeah, and I think I can sum it up pretty quickly, actually. I would say, and I'm moving between a sort of a mythic and a religious perspective, and there's almost no difference in the. In the world that I live in. Myth showed me everything I needed to know about the conditions of living. Different gods and goddesses show you the betrayals, the healings, the strange nuances to it all. It shows you the playing field. It's phenomenal. How to live it was the missing element for me, and that, I have to say, is the Christian narrative. It's the Christian story because it's so. It actually turns a lot of the myths before it kind of on its head because of this last, you'll be first anti chaos kind of thing going on, this huge, enormous consciousness where we're not just venerating trees and bends in the river and all the thousands and millions of little elohims and messengers that are moving around us. We're making a claim that we're in contact with the being that is infused in that, but also completely outside of it as well, that was just kind of too big for me. But in the absence of that, my life I suppose up until, you know, up until a few years ago had the familiar kind of chaotic fault lines of not having that essential kind of binding agent that is Yeshua. So a lot, a lot has changed. It's not as if my life hasn't been nourished and informed and blessed beyond measure by these stories. But the reality is, and this is hard, this lot of Christians don't like me saying what I'm about to say. The reality is, you know, I, I'm with Augustine, all truth is God's truth. And I think that a lot of these stories, there could be some story way up from the Inuit and, and they, and I respect this, they may not want to see it in this way. But from my point of view, many myths and stories are filled with pinpricks and hints of this great story. And so I feel that I was on a kind of drip feed for a really long time. And the thing that my heart was swooning for over and over in these stories was something that I could never depend in defend in public, but was actually this sort of terrifying revelation that actually it was the, it was the, you know, the Aslan of my youth wishing to announce itself. I went on a vigil for 101 days. I went out into a Dartmoor forest and at the end of it I had a profoundly eviscerating, beautiful, unimaginable, almost encounter with Christ, but in the one place I never expected to meet him. I went out there thinking, well, by the time I finish this I'll probably be married to the wild in some way. And I came back married to Christ and I realized that both of these weddings are facing each other. It's a strange thing to say as someone. I'm not a classicist, we're talking about the Odyssey. I'm not a classicist. In England, if you're a classicist that's kind of connected to a class system, really connected to a certain level of school that you would have gone to. I didn't go to schools like that, but I have a real experience, understanding and many decades long involvement with indigenous and shamanic stories. Oddly, they're much, much closer to Christ figures than ones that you get in the West. They understand very well the idea of the suffering healer. They understand very well the one that you're not looking at is the one that is actually kind of binding and through an act of love and sacrifice, bringing new life to the tribe."}
{"episode_id":"SW - #314 - 2023-11-16 - Dr Martin Shaw - The New Odyssey","start":2561.24,"end":2561.64,"speaker":"Jonathan Pageau","text":"So."}
{"episode_id":"SW - #314 - 2023-11-16 - Dr Martin Shaw - The New Odyssey","start":2563.8,"end":2661.59,"speaker":"Martin Shaw","text":"I was aware of these things. But now, of course, I see the. For example, I see, you know, the crucifixion as the supreme poetic event of human experience. But it was as if I was just not allowed to see it until I was almost 50. It was like this. And then God said, and now. Now. And for the last two years, my Jobian wonder eye has been opened. But for some reason, he wanted me to get all this other stuff in me, too. And so I'm in this thrilling and unexpected. You know, what midlife is like. You can feel like you've seen all the movies worth possibly seeing. So to be in this new world where I'm meeting. I like what Paul Vanderklee is doing. You know, he's a very interesting man with all his sort of cross associations. You see, I come. My dad is a preacher. My brother is a pastor. I'm very familiar with all of this. But at the same time, because of orthodoxy, I've been opened up to. I grew up in church. All the action was in the pulpit. Now the action's in the liturgy. You know, the pulpit is the only moment. It's the. The sermon is the only moment where you can sit down. He's like, yeah, yeah, okay, sit down. This is just me for five minutes, and everybody, you know, stand. Awai wisdom. And we're off. You know, so I. I kind of know where I am, but I also don't know where I am, which is a wonderful place to be."}
{"episode_id":"SW - #314 - 2023-11-16 - Dr Martin Shaw - The New Odyssey","start":2662.07,"end":2724,"speaker":"Jonathan Pageau","text":"And I think that what you said, you know, the idea that in some ways you had to pack all this other. All this other stuff in you. I think in some ways, you know, this might. Will seem a little. Maybe I'm pushing it and whatever. Whatever people think. But that. It seems like to me, that's the role that I perceive that you can have right now in this moment, which is, you know, you use the word. The word rewilding Christianity. There are different ways to say it, but there is something in the other myth which. In these shamanic stories, in the. These ancient myths, which can. Can help us see the story of the Bible afresh again. Because in some ways, it's giving you tax and it's giving you ways into it that a lot of people have glossed over through their kind of systematic theology. You know, like, this is. This leads to this, lead to this, and Jesus died for your sins, and if you believe in him, you go to heaven. You know, that kind of stuff where it's like you've actually stopped looking at the. At the crazy things that Jesus does and the crazy things that. That are in those stories."}
{"episode_id":"SW - #314 - 2023-11-16 - Dr Martin Shaw - The New Odyssey","start":2724.64,"end":2744.42,"speaker":"Martin Shaw","text":"You, you will be aware. And I think we have to kind of, certainly in this country, in England, we have to doff our caps to Tom Holland, the writer in his book Dominion. Tom was the first guy that was saying, actually, despite the propaganda, England and the west in general is profoundly Christianized."}
{"episode_id":"SW - #314 - 2023-11-16 - Dr Martin Shaw - The New Odyssey","start":2744.66,"end":2744.94,"speaker":"Jonathan Pageau","text":"Now."}
{"episode_id":"SW - #314 - 2023-11-16 - Dr Martin Shaw - The New Odyssey","start":2744.94,"end":2843.07,"speaker":"Martin Shaw","text":"I go along with that for a while. But the problem is we are Christianized civically and culturally. We're not spiritually anymore. We're not. This is not a Christian culture. And so the cross isn't quite. We got that bit, but we haven't got that bit. So I love the fact that he, yourself, Paul Kings, north, lots of others are talking about the fact that we have. We can't be taking our cues from a culture that doesn't give a. About us anymore because we just get more and more thinned out, diluted, apologetic. We're sort of, you know, don't look at me, don't look at me. You know, whereas actually people, I meet people all over the world looking for a deeper life. And the more we take our cues nervously from a culture that at best has amnesia, if not active hostility to these stories, the better. But we need to retell them, not. Not anesthetize them or put in little cues to make them politically correct. Forget that. We just need them in their pure genius, raw form to do their work, to let God do his work. You know, I think something's happening. I have to say it. I think something's happening. I've never born in the early 70s. I've never seen a moment quite as pregnant as this one. I've never known so many people talking about things like this think you're right."}
{"episode_id":"SW - #314 - 2023-11-16 - Dr Martin Shaw - The New Odyssey","start":2843.07,"end":2912.77,"speaker":"Jonathan Pageau","text":"You know, I think that the way that I see it is something like a. Like an arc. You know, it's like we're actually. There's a contraction of Christianity, but in that contraction, the people that care about it have to do it so deliberately that it cannot be accidental anymore. It can't just be something we're surfing. It just can't be. So we have to look into it deeply. We have to. We. We don't have a choice. And so because of it, it creates this weird little. This, this, this, this smaller but brighter group of people that are. Can see each other and are, you know, I'm amazed, like you said, like, you know, if you had asked me to predict Paul King's north and Martin Shaw, you know, five, six years ago, I could not have predicted it. But then when I see. When I see that coming over the horizon, I'm like, yes, that. That. That's. That's it. Like. And I can see that. Like you said, I can see things coming together. And so it's exciting. I mean, what. What other life would you want to lead? It's exciting to be. To be in a world that is semi hostile to you, but then being surrounded by a round table of amazing nights. It's like, what else would I want?"}
{"episode_id":"SW - #314 - 2023-11-16 - Dr Martin Shaw - The New Odyssey","start":2913.33,"end":2918.13,"speaker":"Martin Shaw","text":"Yeah. Yeah. I think. I think we're all in agreement that Church needs to be Camelot again."}
{"episode_id":"SW - #314 - 2023-11-16 - Dr Martin Shaw - The New Odyssey","start":2918.53,"end":2919.57,"speaker":"Jonathan Pageau","text":"You know, I think, really."}
{"episode_id":"SW - #314 - 2023-11-16 - Dr Martin Shaw - The New Odyssey","start":2920.21,"end":2970.7,"speaker":"Martin Shaw","text":"And if people don't think we're in a moment of tremendous peril, they are simply not paying attention. They're not paying attention. All the ingredients you want for a phenomenal myth are occurring in real time right now. You don't need to be nostalgic. You didn't miss out. There was no other golden age of myth that was more engaging than this. This is the moment. And so find your place at the table. And I say that to everybody. There'll be some kid right now watching us on a phone doing some shift, you know, his third shift at McDonald's. We're talking to you. You know, we're talking to you. Locate. Locate that noblesse oblige in you and see what kind of trouble you can get into, you know, that's amazing, Martin."}
{"episode_id":"SW - #314 - 2023-11-16 - Dr Martin Shaw - The New Odyssey","start":2970.7,"end":2975.7,"speaker":"Jonathan Pageau","text":"I think that that is the best place to. To. To finish our conversation on. Thank you for everything you do."}
{"episode_id":"SW - #314 - 2023-11-16 - Dr Martin Shaw - The New Odyssey","start":2975.7,"end":2978.02,"speaker":"Martin Shaw","text":"Our pleasure. I can't wait to be with you again."}
{"episode_id":"SW - #314 - 2023-11-16 - Dr Martin Shaw - The New Odyssey","start":2978.36,"end":3008.44,"speaker":"Jonathan Pageau","text":"It's going to be amazing. I can't wait to. I can't wait for all of us to be at the Symbolic World and people take your cue, you know, get your tickets. I'm going to do my plug and come meet us at the Symbolic World at the end of February. We are all excited to see you there, so thanks. If you enjoy these videos and podcasts, please go to the symbolicworld.com website and see how you can support what we're doing. There are multiple subscriber tiers with perks. There are apparel and books to purchase, so go to the symbolicworld.com and thank you for your support."}
