{"episode_id":"SW - #216 - 2022-02-02 - Styxhexenhammer666 - Christianity VS Esotericism","start":12.08,"end":92.87,"speaker":"Jonathan Pageau","text":"This is Jonathan Pedro. Welcome to the symbolic world. For me, this is mostly a conversation. Like, I don't, I don't. I'm not a. If you go on my channel, you won't find debates. It's mostly about exploring ideas and exploring. And I think that there's an interesting bridge for people in the west that are interested in esotericism in general with just really mainstream orthodox theology, where it's more integrated. In the west, there seems to have been a schism somewhere in the late Middle Ages where the elites kind of went up towards these esoteric groups and esoteric societies. And then the Catholic Church was kind of was kind of left down there. And then finally it ended up being a hostile relationship between the two sides. But I feel like in the east there's a more integrated version. And so I talk about symbolism, I talk about mystery. I thought we talk about all these things about, you know, becoming God, the deification of man. And I have no problem with my hierarchy at all. Like, I have no, there's no. I have no pushback because it's basically just the common thing. So I don't know if you know a little bit about Eastern Christianity."}
{"episode_id":"SW - #216 - 2022-02-02 - Styxhexenhammer666 - Christianity VS Esotericism","start":93.19,"end":172.6,"speaker":"Styxhexenhammer666","text":"I've studied a little bit about it, but not quite so much. I think Catholicism is more accessible with regards to their traditions. And a lot of literature that I've encountered, the orthodox thing is, as far as being a major force in maybe the English speaking world, I think is more recent, generally speaking. Most of my forte, though, a lot of it really deals with the occult writ large in the sense of folklore, superstition, things like that. Like, as far as esotericism of any brand, it really focuses more on that. I have more of an appreciation for the. What we would conceive of as the vulgar, actually more of an interest in that folk charms and rituals, including some Christian mysticism. It was often in the works that I've actually edited. A lot of it is at the very least a facade, an overlapping of Christendom and Praise Jesus over what would otherwise be considered as heretical magic, actually as well. And that's quite common. This is even in hermetic works. This is in works that are even certainly the alchemical works. A lot of them are chemical preparations, but they're basically coded. And they talk about angels and spirits and different divine ideas and figures sort of as a facade to hide the chemical recipe. And also a lot of the works masquerade as chemical recipes, but they're really spiritual polemics. I find that fascinating."}
{"episode_id":"SW - #216 - 2022-02-02 - Styxhexenhammer666 - Christianity VS Esotericism","start":173.32,"end":178.25,"speaker":"Jonathan Pageau","text":"And so you're Most interested in the application, like the. The magic part, let's say."}
{"episode_id":"SW - #216 - 2022-02-02 - Styxhexenhammer666 - Christianity VS Esotericism","start":178.33,"end":212.38,"speaker":"Styxhexenhammer666","text":"Yeah. And folklore in general, religious history. I just got done editing a work on the Babylonian and Syrian customs. Not just the occult side of it, although it was, especially in Babylon, intertwined with everything, but even their weights and measures. It was funny, in Babylon, when they study their cuneiform tablets, they find a lot of personal correspondence. A lot of. It's actually kind of funny. It's like between lovers or between neighbors, legal suits. Then Assyria takes over, and it's almost entirely military and diplomatic in nature. And I find that aspect of the human experience to be fascinating."}
{"episode_id":"SW - #216 - 2022-02-02 - Styxhexenhammer666 - Christianity VS Esotericism","start":212.62,"end":232.3,"speaker":"Jonathan Pageau","text":"And so I guess, like, my question would be to you, what do you think happened in the west that created. That created these kind of schisms, let's say, in terms of esotericism, but also in terms of even the definition of magic as it came to be in the early modern era?"}
{"episode_id":"SW - #216 - 2022-02-02 - Styxhexenhammer666 - Christianity VS Esotericism","start":232.77,"end":276.77,"speaker":"Styxhexenhammer666","text":"I think it's intertwined a lot with civics and deals with more secular authorities, too. There was an interesting schism, actually, between the Catholic and Protestant groups in terms of the burning times, in terms of persecuting people for folk magic or herbalism or whatever. The Catholics had a caveat. Well, if you can establish that it's just white magic, you're just healing people. You're not causing abortions and you're not doing black magic. They weren't burned at the stake or drowned or anything in the Protestant tradition, a la King James. Demonology, of course, which you probably read. They didn't care if you. If you were doing any folk magic. And it wasn't explicitly canonical, explicitly uber Christian. You were a witch anyway, and would get killed for that."}
{"episode_id":"SW - #216 - 2022-02-02 - Styxhexenhammer666 - Christianity VS Esotericism","start":277.01,"end":292.07,"speaker":"Jonathan Pageau","text":"Yeah. And so do you think it has also to do with the kind of burgeoning of scientism that happened at that time? Because a lot of people tend to. This is one of the things I always face is people tell me, you know, the medieval witch burnings. I'm like, medieval witch burnings? Like, which burnings are early modern?"}
{"episode_id":"SW - #216 - 2022-02-02 - Styxhexenhammer666 - Christianity VS Esotericism","start":292.39,"end":294.95,"speaker":"Styxhexenhammer666","text":"All the way Renaissance era."}
{"episode_id":"SW - #216 - 2022-02-02 - Styxhexenhammer666 - Christianity VS Esotericism","start":294.95,"end":325.11,"speaker":"Jonathan Pageau","text":"Yeah. And so there's like, there's this. There's this birth of the scientific mind which wants to categorize things in terms of. Just in terms of technical and in terms of quantity, quantitative things. And so they face these practices which are different, let's say, and that are more related to spiritual influence, you could say, or influence of the person that is performing the remedy, and they don't know what to do with it. So it's like it doesn't Fit in this kind of like enlightenment version of Christianity."}
{"episode_id":"SW - #216 - 2022-02-02 - Styxhexenhammer666 - Christianity VS Esotericism","start":325.19,"end":380.96,"speaker":"Styxhexenhammer666","text":"Yeah. The really weird part is that the Middle Ages were less persecutory in some ways than the Renaissance. And everyone says, well, things got better during the Renaissance. Everything was science and technology, clockwork mainly. And actually in the Middle Ages there was less of that. I edited another work recently on medieval medicine. And one of the main things discussed is in the Renaissance you have sort of a reversion to the more antiquated notion that sickness was invariably spiritual in nature. Whereas in the Middle Ages there was at least some attempt to say, well, yes, I believe in demons, and demons of sickness are definitely causing problems. But also, you know, you've got these humors and it's not necessarily a demon. Maybe you just ate the wrong food. They didn't have germ theory, but they had a basic concept of the transmissibility of disease. And it almost disappears actually, later on. It's almost strange how there was a retrogression in medicine."}
{"episode_id":"SW - #216 - 2022-02-02 - Styxhexenhammer666 - Christianity VS Esotericism","start":380.96,"end":412.62,"speaker":"Jonathan Pageau","text":"There's also an interesting. One of the interesting things that I discovered was that obviously in the Roman times there was a kind of witch burning that was popular. And then Charlemagne actually was one of the people that banned the burning of witches. He said, you know, like this. The witches don't exist, basically, is what he was saying. Like this is just like, you know, this. I bother people with this. And then it came back, like you said, towards the late Middle Ages and ultimately, especially during the Renaissance and kind of in this. These weird kind of witch scares and werewolf scares that happened at that time."}
{"episode_id":"SW - #216 - 2022-02-02 - Styxhexenhammer666 - Christianity VS Esotericism","start":412.62,"end":476.1,"speaker":"Styxhexenhammer666","text":"Oh, yeah, werewolves is another funny thing. Yeah, the Babylonians used to do that. They used to have specifically, like medicine men, you could call them. They were intertwined with the priesthood, actually, that would dispense little spells and give people like little items to put next to their door to keep witches away. Led by Lilitu, actually, their sort of a queen of the damned, if you will, that informs Lilith later on in Judeo Christian tradition. And it's actually funny because they imagine that this horde of demons went out at night along with the transients and pickpockets and prostitutes, actually. And they were sort of all lumped together and they would get paid to have protective spells and incantations against them. It's funny because in the Middle Ages you see less of that. I've edited grimoires and most of them, they're not from the Middle Ages, they're from the Renaissance or even the Enlightenment. And there is where you get some of the classical sort of takes on witchcraft. Miasmas and stuff, like burning a wolf skull with herbs in it at the edge of the village to keep the plague away and things like that. Even though the Black Death predates that by many centuries."}
{"episode_id":"SW - #216 - 2022-02-02 - Styxhexenhammer666 - Christianity VS Esotericism","start":477.06,"end":530.18,"speaker":"Jonathan Pageau","text":"One of the things that I'm curious about, because I talked about this with a professor of Byzantine studies and I was trying to understand because a lot of the texts that informed the Renaissance magic, some of them obviously came from, you know, from, from Spain, but many of them came from Constantinople. As Constantinople was kind of taken by the Muslims, a lot of the scholars left Constantinople for the, for the west, for like the Corpus Hermeticum was preserved in Constantinople basically. But there, it doesn't seem, it didn't seem to have the same effect. And so I was. We were trying to figure out, like in Constantinople, towards the end, there were all these Neoplatonists, there were the, the, the Hermeticists, you know, and they were all there. But it didn't create this schism which we see happening in the west as modernism kind of sets itself up."}
{"episode_id":"SW - #216 - 2022-02-02 - Styxhexenhammer666 - Christianity VS Esotericism","start":530.26,"end":545.53,"speaker":"Styxhexenhammer666","text":"It could have been like a neo Roman appreciation for the compilation of knowledge sort of thing. Like just having the material there was considered comfy and enlightening, just having access to it maybe more than an actual sub movement, maybe."}
{"episode_id":"SW - #216 - 2022-02-02 - Styxhexenhammer666 - Christianity VS Esotericism","start":546.25,"end":594.2,"speaker":"Jonathan Pageau","text":"But I think there were people that were practicing and reading it. It just wasn't. It didn't create a kind of social disruption as it did as it moved into Italy, let's say. And you see Boccaccio and all these people kind of taking it up anyway. So to me that it's curious, like I'm trying to figure. I'm a Western person, right? And so I'm always trying to figure out what is it that happened in the West? So that you come to the 18th century, 19th century and you have these, like, Freemasonic, these Freemasons and these Rosicrucians or whatever. And then you have popular culture and what, like, what broke? Like how is it that these things became so separated? And so I don't know if you have, if you're interested more in folk religion, maybe you don't have insight on that, but if you do, I'd love to hear it."}
{"episode_id":"SW - #216 - 2022-02-02 - Styxhexenhammer666 - Christianity VS Esotericism","start":594.44,"end":635.27,"speaker":"Styxhexenhammer666","text":"Not so much insight. But maybe the disruption was greater because those greater powers, including the Ottomans and other groups, held things together more than the smaller interwaring states that comprised Western Europe for a lot of that period. Maybe because, I mean, if they're constantly changing land, one day you're flying one flag, the next day you're flying another. You're going to have more authoritarian civics, you're going to have kings that are more strong arm as opposed to having a greater expanse and you have sub governors and stuff and there's maybe more tolerance. It's funny, the Ottomans were butcherous and insane in many ways but religious tolerance arguably was higher under the Ottoman Empire at most points than it was in the West."}
{"episode_id":"SW - #216 - 2022-02-02 - Styxhexenhammer666 - Christianity VS Esotericism","start":635.75,"end":648.51,"speaker":"Jonathan Pageau","text":"Well yeah, just because they also were like in the same way that the west kind of tolerated Jews then the Muslims tolerated Jews and Christians. It was like what comes after tolerates the thing that they're replacing for."}
{"episode_id":"SW - #216 - 2022-02-02 - Styxhexenhammer666 - Christianity VS Esotericism","start":648.51,"end":654.31,"speaker":"Styxhexenhammer666","text":"Yeah, I think, I think Jews mainly in the, in the plague times I think mainly migrated to Poland if I remember correctly."}
{"episode_id":"SW - #216 - 2022-02-02 - Styxhexenhammer666 - Christianity VS Esotericism","start":654.55,"end":678.37,"speaker":"Jonathan Pageau","text":"Yeah, I mean There's a huge DS4 there for sure. Definitely. And so another question that I had of you is how does it translate today? Like because you study all these books and everything and you call yourself a pagan, like how does it translate into the modern world? Like how do you practice these things? Like do you have like, is there like animal sacrifices? Like all the stuff that like the ancient teachers."}
{"episode_id":"SW - #216 - 2022-02-02 - Styxhexenhammer666 - Christianity VS Esotericism","start":678.37,"end":743.23,"speaker":"Styxhexenhammer666","text":"No, that's mainly a Jewish and Islamic tradition more than it is genuinely pagan. When we see mention of mass animal sacrifices, a lot of them they come from like the Mesopotamian, Bahamian pagan cultures and things like that or ancient Greece. Most people I don't think do that. Fortune telling, that's really just a takeoff of fortune telling. I think there's been a co development, a co evolution of the practice of divination. Especially because it used to be you needed to buy the oxen slaughter at read its entrails or you needed to offer two goats to the priest or do something that was expensive and or possibly dangerous and it was simplified over time to become more user friendly. You can call that a devolution in the sense that it's no longer the authentic original tradition. But if we were to live a world today where you had maybe like Sumerian style animal sacrifice then the price of beef would be a little bit higher than just under Biden nomics. Yeah, we killed all of our cows every single year. We always knew what the future would hold. And the future held that we wouldn't have hamburgers anymore. Then American culture would collapse."}
{"episode_id":"SW - #216 - 2022-02-02 - Styxhexenhammer666 - Christianity VS Esotericism","start":743.55,"end":747.39,"speaker":"Jonathan Pageau","text":"And so how does it translate? Like I'm curious to know like how it translates."}
{"episode_id":"SW - #216 - 2022-02-02 - Styxhexenhammer666 - Christianity VS Esotericism","start":747.63,"end":834.49,"speaker":"Styxhexenhammer666","text":"Well with my editing and my study mostly it's more on the academic side to tell the truth. My own personal practice I rely upon. I believe in dream interpretation in the loose sense. Although there are a million different methods to Interpret it. This is something that's common, I think pretty much to every religion. There are Christians that dabble in that. Even if they say, well yeah, I'm interpreting the dream, but God gave me insight or something, it's a mystic experience. It's in Judaism, certainly in Islam, it's in Hinduism, et cetera that I believe in basic oracle usage. Again, it's a fortune telling methodology. You can use a random number generator for that for what it's worth. But mainly it's an academic interest initially. I don't know if I've mentioned this to you before, but my editing started simply because I saw that there was a huge amount of literature available about the occult in general. All subtopics in the occult on Amazon. But people were taking PDF scans of initial documents. Great for primary source work, but a lot of them, they're dog eared, they're missing pages, there's grammatical mistakes, there's writing in some of these things and they're charging 20$30 for them. I'm sitting there as a poor person. I'm like now I'd love to read these books in an actual print copy, but I can't even afford more than one or two of them. And, and I said, I said about getting the original digital scans and completely re editing them to make them in a modern format and lowered the price sometimes."}
{"episode_id":"SW - #216 - 2022-02-02 - Styxhexenhammer666 - Christianity VS Esotericism","start":834.49,"end":835.65,"speaker":"Jonathan Pageau","text":"Yeah, the prices are pretty low."}
{"episode_id":"SW - #216 - 2022-02-02 - Styxhexenhammer666 - Christianity VS Esotericism","start":836.05,"end":870.03,"speaker":"Styxhexenhammer666","text":"Yeah, yeah, by three or four times. And what I wanted to do is say this is literature that's valuable in some cases. There may be only two or three paper copies of these works. I've stumbled across mention of works that are apparently extinct. There's supposedly a fortune teller from the early 1800s that was ascribed to Thomas Jefferson. I've seen it mentioned in a couple of other works. I've never run across any information on a copy. And I'm also a bibliophile. I love physical books so I don't want them to go extinct and I might as well make a living off of it in the meantime."}
{"episode_id":"SW - #216 - 2022-02-02 - Styxhexenhammer666 - Christianity VS Esotericism","start":870.59,"end":874.19,"speaker":"Jonathan Pageau","text":"Is that your main source of living is the book editing?"}
{"episode_id":"SW - #216 - 2022-02-02 - Styxhexenhammer666 - Christianity VS Esotericism","start":874.67,"end":879.15,"speaker":"Styxhexenhammer666","text":"Yeah, I make more off of the book editing than I do on donations and things like that."}
{"episode_id":"SW - #216 - 2022-02-02 - Styxhexenhammer666 - Christianity VS Esotericism","start":879.55,"end":880.43,"speaker":"Jonathan Pageau","text":"And YouTube stuff."}
{"episode_id":"SW - #216 - 2022-02-02 - Styxhexenhammer666 - Christianity VS Esotericism","start":880.43,"end":881.31,"speaker":"Styxhexenhammer666","text":"Yeah, yeah."}
{"episode_id":"SW - #216 - 2022-02-02 - Styxhexenhammer666 - Christianity VS Esotericism","start":881.55,"end":887.07,"speaker":"Jonathan Pageau","text":"And so what, like what value do you think it brings us these books, like as modern people?"}
{"episode_id":"SW - #216 - 2022-02-02 - Styxhexenhammer666 - Christianity VS Esotericism","start":887.55,"end":928.17,"speaker":"Styxhexenhammer666","text":"Well, if someone's interested academically, they can study it. If someone's interested in certain paths or ideas within the occult, they can actually utilize them. I mean I keep them in their original format. Occasionally I redact sections. Like a lot of these works had Lengthy lists of advertisements at the end, especially the herbal works, for, like, this miracle tonic. This will make your hair grow back. And, you know, stuff like that. And it's just, like, only occasionally do I include any of that. Sometimes the index would be miss paged, so I'll take that out. Otherwise, I keep them intact. And the idea is that people can study from them, people can use them. Maybe they just want it. You know, in some cases, someone's a fan of mine. They just want something that I edited. So make it available."}
{"episode_id":"SW - #216 - 2022-02-02 - Styxhexenhammer666 - Christianity VS Esotericism","start":928.89,"end":946.42,"speaker":"Jonathan Pageau","text":"I mean, I think I'm kind of pushing you in the sense that. So, you know, obviously, everything's in crisis. I think that you probably noticed that for several years that there's a crisis in the West. You could say there's a crisis of meaning, There's a crisis of identity. There's a crisis in education. There's a crisis. Just constant."}
{"episode_id":"SW - #216 - 2022-02-02 - Styxhexenhammer666 - Christianity VS Esotericism","start":946.58,"end":948.06,"speaker":"Styxhexenhammer666","text":"There's a problem with commies."}
{"episode_id":"SW - #216 - 2022-02-02 - Styxhexenhammer666 - Christianity VS Esotericism","start":948.06,"end":984.43,"speaker":"Jonathan Pageau","text":"Yeah, yeah, exactly. And so I think that. I guess where I'm going to is like, one of the crises is a spiritual crisis. You could call it. Like, there's a. There's a. And it manifests itself in the. In all kinds of stuff. Whether it's. It's these weird kind of literalist evangelicals. Whether it is the breakdown into, like, New Age, mushy. Whatever stuff that is out there. Crystals and all this kind of crystals are fun. They opened a sorcery school, like, two streets from me. And it's like a witchcraft school."}
{"episode_id":"SW - #216 - 2022-02-02 - Styxhexenhammer666 - Christianity VS Esotericism","start":984.43,"end":986.71,"speaker":"Styxhexenhammer666","text":"It's obviously so Wiccans, in other words."}
{"episode_id":"SW - #216 - 2022-02-02 - Styxhexenhammer666 - Christianity VS Esotericism","start":986.71,"end":988.07,"speaker":"Jonathan Pageau","text":"I don't know what they are."}
{"episode_id":"SW - #216 - 2022-02-02 - Styxhexenhammer666 - Christianity VS Esotericism","start":988.31,"end":1011.17,"speaker":"Styxhexenhammer666","text":"They probably go out back. They probably go out back and dance topless twice a year. And then they take some mushrooms and play with their amethyst. By the way, inauthentic religion like that, it can be cringy, but it's harmless. And there are some people out there still think Wiccans worship the devil. You gotta read a book on Hedgwicker sometime. Basically, they just want to grow and drink tea all day."}
{"episode_id":"SW - #216 - 2022-02-02 - Styxhexenhammer666 - Christianity VS Esotericism","start":1011.41,"end":1017.25,"speaker":"Jonathan Pageau","text":"Yeah. I mean, it's like. It's like a weird. It's like a weird modern union kind of reimagination."}
{"episode_id":"SW - #216 - 2022-02-02 - Styxhexenhammer666 - Christianity VS Esotericism","start":1017.81,"end":1019.41,"speaker":"Styxhexenhammer666","text":"Environmentalists, hippies."}
{"episode_id":"SW - #216 - 2022-02-02 - Styxhexenhammer666 - Christianity VS Esotericism","start":1019.65,"end":1021.49,"speaker":"Jonathan Pageau","text":"Yeah, environmental and feminists."}
{"episode_id":"SW - #216 - 2022-02-02 - Styxhexenhammer666 - Christianity VS Esotericism","start":1022.29,"end":1027.1,"speaker":"Styxhexenhammer666","text":"And the founder, by the way, 100 years ago, Gardner, all he wanted to do was see naked priestesses."}
{"episode_id":"SW - #216 - 2022-02-02 - Styxhexenhammer666 - Christianity VS Esotericism","start":1027.98,"end":1030.74,"speaker":"Jonathan Pageau","text":"Yeah. I'm not surprised. That's what we hide it."}
{"episode_id":"SW - #216 - 2022-02-02 - Styxhexenhammer666 - Christianity VS Esotericism","start":1030.74,"end":1030.98,"speaker":"Styxhexenhammer666","text":"So."}
{"episode_id":"SW - #216 - 2022-02-02 - Styxhexenhammer666 - Christianity VS Esotericism","start":1030.98,"end":1058.8,"speaker":"Jonathan Pageau","text":"So the idea is, like, there's this crisis. And so. So when I look at, like. Let's say when I look at the popularity of Gnosticism right now and the popularity of all these, all these kind of resurgence of all these weird texts and all this weird stuff. I see it as part of the breakdown, like, I see it as a scattering of, of stuff where everything is kind of breaking down and, and fragmenting into, into different, into different kind of idiosyncratic."}
{"episode_id":"SW - #216 - 2022-02-02 - Styxhexenhammer666 - Christianity VS Esotericism","start":1059.12,"end":1062.64,"speaker":"Styxhexenhammer666","text":"You mean like the availability of like occult literature and stuff like that or."}
{"episode_id":"SW - #216 - 2022-02-02 - Styxhexenhammer666 - Christianity VS Esotericism","start":1062.72,"end":1086.42,"speaker":"Jonathan Pageau","text":"Well, not the availability, just the fact that Joe, whatever, like Joe next to next door, you know, is talking to me about Kabbalah as if, like as if this has anything to do. Like as if. And then he. And then he mixes it with aliens and then he mixes it with like all this kind of modern stuff and you're like, it just seems like it's porridge. Like a huge."}
{"episode_id":"SW - #216 - 2022-02-02 - Styxhexenhammer666 - Christianity VS Esotericism","start":1087.86,"end":1119.68,"speaker":"Styxhexenhammer666","text":"Yeah, but that's already happened. Anyway. All the religious practices of today pretty much are a bric, a brac, because of the cosmopolitan nature of post colonial trade and travel. I would say arguably the one other than the orthodoxy, which is more puristic in that sense. Another one. And I actually thought to mention this to you because I was thinking back to when we were having our debate, actually there is one other mystically inclined religion that hasn't changed form. At least you know, the scriptures and stuff are still there. You can practice it authentically. Hinduism."}
{"episode_id":"SW - #216 - 2022-02-02 - Styxhexenhammer666 - Christianity VS Esotericism","start":1120.64,"end":1132,"speaker":"Jonathan Pageau","text":"Yeah. It's just hard because to be a Hindu you have to be in a, in a caste. So it's like it's hard to become a Hindu. I know people that become Hindus and it just feels like it's bogus to me."}
{"episode_id":"SW - #216 - 2022-02-02 - Styxhexenhammer666 - Christianity VS Esotericism","start":1132.24,"end":1145.72,"speaker":"Styxhexenhammer666","text":"Yeah, I would actually debate that point too. The caste system initially doesn't really have to do with birth into a specific situation by parentage. It has to do with being judged on one's traits thereafter. Like once."}
{"episode_id":"SW - #216 - 2022-02-02 - Styxhexenhammer666 - Christianity VS Esotericism","start":1145.72,"end":1149.4,"speaker":"Jonathan Pageau","text":"Yeah, but who would attribute you to a caste? Like how? Who would decide."}
{"episode_id":"SW - #216 - 2022-02-02 - Styxhexenhammer666 - Christianity VS Esotericism","start":1149.4,"end":1183.04,"speaker":"Styxhexenhammer666","text":"Well, it's canonical. The way in which that's done. It depends on what you're geared towards, your personality and so forth. If you, if you actually go through not just the Bhagavad Gita, but all their other various texts, that part actually is still authentic. That's more the Indian state. And I think what happened is that the people at the top who tended to be Brahman said, hey, we've got a good thing going. We'll just make it about who your parents were. We'll have all of this fortune and stuff, will be the Rajah forever. And then again, that's a civic denigration of what was originally a more spiritually minded thing."}
{"episode_id":"SW - #216 - 2022-02-02 - Styxhexenhammer666 - Christianity VS Esotericism","start":1183.44,"end":1212.68,"speaker":"Jonathan Pageau","text":"Yeah. Have you ever thought about the relationship between the Varna and like the basic caste system and the medieval caste system? It's almost identical. In the medieval world, they had those that pray, those that fight and those that work. So it was three. It was a three tiered system. And it wasn't also necessarily completely based on births, obviously, because the priestly caste wasn't a. It's not a caste that was. That could be transmitted because the priest."}
{"episode_id":"SW - #216 - 2022-02-02 - Styxhexenhammer666 - Christianity VS Esotericism","start":1212.76,"end":1258.44,"speaker":"Styxhexenhammer666","text":"That's almost similar to Plato's description of how to describe to people why there are differences between cultural groups. Like saying, oh, well, you know, people were formed out of different metals. And so the ruler, he's the ruler because he was made out of gold when he was born. You're a merchant because you're made out of copper, you're a soldier because you're made out of iron. And you, you're homeless because you were made out of the dirt under my shoe. And it's funny because actually Julius Caesar in the Roman days reforms this. Initially the Roman columns were very much like the Greek hoplite and were taken from the ranks of the nobility. And Caesar said, well, we need more men because we got all these barbarians we gotta kill. And then he started going out to, like the farmlands and finding the big brawny dudes that were working all day anyway and drafting them. Making them centurions and stuff."}
{"episode_id":"SW - #216 - 2022-02-02 - Styxhexenhammer666 - Christianity VS Esotericism","start":1258.44,"end":1330.62,"speaker":"Jonathan Pageau","text":"Yeah. Turning them into soldiers. Yeah. I mean, Caesar was obviously much more pragmatic, more revolutionary than we sometimes want to see him as, let's say. But so my question is like, what do you see as some of the solutions to the crisis meeting? And so, and I'll be totally honest with you, like, to me, spending many years thinking and looking and everything, I see that Christianity for the west, that's it. Everything else that's presenting itself is presenting itself as a destructuring agent. It's presenting itself as something that is increasing the breakdown. And that the solution that I grabbed onto was to restore the mystical, not myself, but to go back into the mystical possibilities of Christianity, like dive back into the early church fathers and the, you know, the ladder towards heaven. All of these, these types of descriptions of mystical transformation, rather than kind of go into all this stuff that was boiling up. And so obviously that's not the solution you grabbed onto. So my question is, what do you see as like a spiritual path for the west or a spiritual possibility?"}
{"episode_id":"SW - #216 - 2022-02-02 - Styxhexenhammer666 - Christianity VS Esotericism","start":1331.34,"end":1492.94,"speaker":"Styxhexenhammer666","text":"I think that it's about the individual and that it's cosmopolitan in nature. I don't see that As a breakdown of anything other than an order that wasn't initial to the United States, certainly. And elements of the west, because those were promulgated by something. You could roughly say it was an amalgamation of Christian lore, but in the deistic sense, generally secular authority, the civic structure. And then elements of maybe the more enlightened pagan groups that had already been studied, especially in Greece, Rome and to an extent Egypt. And those things, those ideas amalgamated together. They did in the Middle Ages as well as we've already gone over, and they formed a backbone to society that was much stronger. It really isn't in the United States, for example, until the 1830s, 1840s, that you get a resurgence of two of these forces trying to break that, that sort of backbone. You get the rationalists, the secular side of things like, well, God is dead, you know, screw, you shouldn't have this religion stuff, it's boring. And then you get the hyper fire and brimstone, especially Protestant groups in the U.S. i know the Orthodoxy doesn't engage in that quite so much, but among the Protestants it was a big thing. I would say also Christianity is also already schismed. We have the Protestants and they've subschismed into a million groups. You've got Catholics, you got the Orthodoxy, you got like the newer groups like Mormons, which are arguably vaguely Christian in some ways, Jehovah's Witnesses and then other groups. And then you have, and we spoke about this too, the absorption of foreign matter into various forms of Christendom, forming New Age movements, Scientology, arguably to an extent, a thousand cults, mostly based in the LA area because California is a cult. But I don't see this as a problem because sort of diversity of thought on the secular level was already there and was a good thing. I think that people by and large should simply study as many spiritual systems as possible and arrive at their own conclusions. But in order for that to happen, they have to have self awareness and they have to have rational critical thinking. The problem is that mainstream religion is the only thing that's going to work for the masses, because the masses don't have the time or the intelligence or the inclination to study these things for them. I've been approached by people asking me for spiritual advice and what I tell them is if you want to put a lot of effort into it, delve into everything, just go ahead, study. It's all there. You can get it for free digitally because of the wonder of the Internet. If you're not inclined in that direction, shop around for a mainstream religion. And just make sure not to follow any cult leaders."}
{"episode_id":"SW - #216 - 2022-02-02 - Styxhexenhammer666 - Christianity VS Esotericism","start":1494.14,"end":1507.62,"speaker":"Jonathan Pageau","text":"Exactly. But. So what do you think is the vector of. Like, what's the vector of unity? Like, what stops. What stops the US or what stops the west from just being invaded from the outside? Like, what makes us something?"}
{"episode_id":"SW - #216 - 2022-02-02 - Styxhexenhammer666 - Christianity VS Esotericism","start":1508.02,"end":1511.14,"speaker":"Styxhexenhammer666","text":"You mean in what sense? Invaded? Ideologically, physically?"}
{"episode_id":"SW - #216 - 2022-02-02 - Styxhexenhammer666 - Christianity VS Esotericism","start":1511.54,"end":1516.1,"speaker":"Jonathan Pageau","text":"Both, either, whatever. Like that. You vanish as something. Like you just become, well, physically."}
{"episode_id":"SW - #216 - 2022-02-02 - Styxhexenhammer666 - Christianity VS Esotericism","start":1516.18,"end":1581.37,"speaker":"Styxhexenhammer666","text":"It's your military capability and your will to guard your borders. The former we've got down pat. The latter is a work in progress or regress at the moment under Beijing, Biden's administration and others. Trudeau up there is a little bit divisive himself, I'd say. A lot of the divisiveness, though, is the misuse of spiritual systems by civic forces. That is, governments have understood now that if they divide people, it's easier to control them and abuse them and take more of their money. And religion's a great vector for that. At this point. I think race and artificial identity, like the lgbtqa, XYZ thing, are the main things, but religion is still alluded to, even in the United States. Think about it this way. Joe Biden reigns over a party that harps about secularism, but every time that he's confronted, he talks about how deeply Catholic he is. He still pays that same lip service to a tradition that he's not really religiously part of. He's compelled to do so, but not by religious force. He's not doing it because he's like, well, my God is the true God. He's doing it because he wants to be elected. He's doing."}
{"episode_id":"SW - #216 - 2022-02-02 - Styxhexenhammer666 - Christianity VS Esotericism","start":1581.37,"end":1646.1,"speaker":"Jonathan Pageau","text":"Yeah, he wrote his Machiavellian. Yeah, he knows that the prince has to be nominally religious in order for the people to like him. Like, he. He read his Renaissance politics. He knows what's going on. But like, when we talked about. When we talked about the. Let's say the Hindu system, you know, the original Hindu system would have been the notion that the spiritual element is the highest right, and so the priestly caste is the highest caste, and it doesn't have military might. So that's what legitimizes the power of the state, is that you have a spiritual power that doesn't have. That is only supposed to be turned upwards towards the highest things. They don't have political. They're not supposed to have political and military power. So the military finds their justification for their military power in this spiritual tradition. Now, the problem is that if you make religion relative to all the individuals, then the only thing left to justify the Only thing left that's ultimately going to bring about civic unity with something like brute power. Because it's not always."}
{"episode_id":"SW - #216 - 2022-02-02 - Styxhexenhammer666 - Christianity VS Esotericism","start":1646.82,"end":1704.93,"speaker":"Styxhexenhammer666","text":"But that's the truth of the way that it always has been. The priestly class has always relied upon the consent of the militaries and the governments anyway, unless they're twain, unless you have an outright theocracy in which they're the ones doing the governing and the religion's a side hustle. What I would say is it's effectively the illusion of, of a benevolent, detached priestly class. And that actually is a problem. It's not the breakdown of traditions or anything like that because of the availability of different spiritual systems, because those spiritual systems were never actually in control. The leaders, typically, they would walk the walk and talk the talk, but only to a very short extent. They would say praise like us leaders. They'll say praise Jesus, get the evangelicals to vote for them. Then you look at their voting record, you compare it to any proper interpretation of Christian canon and it tells an entirely different story. Yeah, and that's the way that it always is."}
{"episode_id":"SW - #216 - 2022-02-02 - Styxhexenhammer666 - Christianity VS Esotericism","start":1705.17,"end":1816.92,"speaker":"Jonathan Pageau","text":"What I mean is that. So let's say, let's, let's look at the difference, you know, between, let's say the Syrian empire and, you know, the worst event of Christian. The Christian colonialism. And so the Syrian empire just came in. Brutus brutally killed and raped and took and did whatever the hell it wanted and justified it by its strength only. That is, there was no need to say, there was no need to pretend like, no need to say, like, you know, to at least put out an image of being nice and just. And let's say having the Christian values and then doing something else in the back. What you see in Christianity is that people will project at least the Christian values and then in secret do the bad things, try to get away with the bad things. But what's leading is still an ideal, like, even if it's not completely followed upon. So that's what I mean by the idea that the invisible, like the spiritual world, leads the physical world. And so even if, let's say the Roman popes were all lectures and whatever, they still had to hold a certain ideal. And the aristocracy had an ideal which was, let's say the chivalrous ideal is something that you don't find the idea of the night that helps the weak is something that is just not there in Roman times. And it's just not there in dramatic. In dramatic. Unless you think that that's not the ideal that should be held. The idea of like the strong helping the weak, let's say. But that's a. That's something that holds. That's what I mean when I say that the spiritual has to be above the. The civic authorities, even if in practice the leaders don't necessarily follow it."}
{"episode_id":"SW - #216 - 2022-02-02 - Styxhexenhammer666 - Christianity VS Esotericism","start":1817.16,"end":1950.41,"speaker":"Styxhexenhammer666","text":"Yeah, but then that becomes a problem because it becomes useful fodder for propaganda. If you've congealed the society and there aren't those differences of opinion, that difference in thought about spiritual topics and stuff, there won't be as much debate to potentially shine upon those leaders who aren't even acting. They're not acting for a God or anything. They're acting in their own self interest or in what they conceive of as the nation's interest and they'll justify it. It's sort of like the debate we have right now about COVID Now, I won't get too, too deeply into it because of course this is going to go on YouTube. So we have to choose our words carefully. Yeah, exactly, because Susan Wojcicki is our deity here. But look at the public response. It's presented with a facade of this is for your own good. This is for keeping people safe, helping society and stuff. But the things that are actually done don't comport in all essences to that actual goal. The Patriot act is a great example. I constantly default to. Even the label Patriot act had nothing to do with patriotism. It was presented as a way to keep people safe, but it was really a way to spy on people. It's a misrepresentation. The problem is that when you have that congealing of society where the super majority of people follow one ideology, that ideology will inevitably prevent potential actual reformists who are outside of it from becoming leaders. That's problem number one. Problem number two, allow charlatans who are simply charismatic within that grouping to take power and to use it and for their own benefit. It's sort of like what Stalin did. Stalin works his way up the rungs of the Communist Party, deviates entirely from what we could consider, at least at the very outset, to be an attempt at reform. Because people were suffering under czarism and then goes on to kill 20 million people. Well, it's all for your own good. I'm going to take these kulaks, move them off their land. It's for. They shouldn't have that land. They stole it or something. We're gonna take a bunch of ethnic Russians moving to Ukraine and ship the Ukrainians to the middle of Siberia. Why? Well, it's because we need to break these people apart to move closer to a communist collective. All of these things were presented under the ideology that was professed to be good things. And instead they caused untold suffering, famine and pain for many, many people."}
{"episode_id":"SW - #216 - 2022-02-02 - Styxhexenhammer666 - Christianity VS Esotericism","start":1950.65,"end":1980.82,"speaker":"Jonathan Pageau","text":"Yeah, but there is a difference between ideology and traditional religion. That is, let's say, if you ask what's the ideology of Christianity, it's not a practical ideology per se. Right. It's a, it's a, it's a notion that. It's an idea of worship of the highest good and then that brings about certain virtues and certain values and then thereafter the ideology."}
{"episode_id":"SW - #216 - 2022-02-02 - Styxhexenhammer666 - Christianity VS Esotericism","start":1980.98,"end":2001.88,"speaker":"Styxhexenhammer666","text":"The only difference is that you're claiming a divine origin for what is, can only be construed of as a human ideology because it involves humans involved in that behavior. It's still an ideology. It's just, it claims, it doesn't claim the ideology is promulgated by force or by a collective will. It claims that it's enforced by a deity that's up in space somewhere."}
{"episode_id":"SW - #216 - 2022-02-02 - Styxhexenhammer666 - Christianity VS Esotericism","start":2002.12,"end":2003.64,"speaker":"Jonathan Pageau","text":"Up in space somewhere?"}
{"episode_id":"SW - #216 - 2022-02-02 - Styxhexenhammer666 - Christianity VS Esotericism","start":2004.6,"end":2006.44,"speaker":"Styxhexenhammer666","text":"No, that's what the medieval minds thought."}
{"episode_id":"SW - #216 - 2022-02-02 - Styxhexenhammer666 - Christianity VS Esotericism","start":2006.84,"end":2038.18,"speaker":"Jonathan Pageau","text":"Yeah, well, they didn't think it. I don't think they think it the way you thought you think they did. You know, when you read Dante, he, he mocks people who think that the, that the, that the, let's say that the spiritual beings actually inhabit the heavenly spheres. He says, no, it's a, a condescension of divine language for our understanding. Like the spiritual beings don't actually inhabit the heavenly spheres. It's, it's like, it's, it's basically a system of analogy that helps you see the higher realities that are invisible realities."}
{"episode_id":"SW - #216 - 2022-02-02 - Styxhexenhammer666 - Christianity VS Esotericism","start":2038.34,"end":2046.18,"speaker":"Styxhexenhammer666","text":"And so believe in the all encompassing God, then it would be in the heavenly spheres, but it would also be inter, intertwined with everything else. So."}
{"episode_id":"SW - #216 - 2022-02-02 - Styxhexenhammer666 - Christianity VS Esotericism","start":2046.42,"end":2047.14,"speaker":"Jonathan Pageau","text":"Yeah, definitely."}
{"episode_id":"SW - #216 - 2022-02-02 - Styxhexenhammer666 - Christianity VS Esotericism","start":2047.14,"end":2050.66,"speaker":"Styxhexenhammer666","text":"And that's, that's sort of like the force. Maybe we should all just become Jedis."}
{"episode_id":"SW - #216 - 2022-02-02 - Styxhexenhammer666 - Christianity VS Esotericism","start":2051.68,"end":2076.88,"speaker":"Jonathan Pageau","text":"Yeah, that would be super practical. But in terms of what you're saying, that's the way, especially in the orthodox tradition, that the way it's understood that is God is both absolutely transcendent and absolutely imminent at the same time, because he is that which holds the world together, let's say the bonding, you could say that the world holds together through the divine love is the best way to understand it. And that everything."}
{"episode_id":"SW - #216 - 2022-02-02 - Styxhexenhammer666 - Christianity VS Esotericism","start":2076.96,"end":2112.1,"speaker":"Styxhexenhammer666","text":"I would, yeah, I would say if you believe, if you believe in the total interpenetrating, imminent God, that also, and this is actually in the Bible, it creates good and evil and is sort of passive and all encompassing, then I would say the best thing to do is not worry too much about schisms and civic things anyway because ultimately it's just, you know, this amorphous beings will and doesn't matter so much. And it would be mostly a statement of individuality on that end anyway because you would simply be professing your faith, doing your thing and living according to what you believe is holy and godly."}
{"episode_id":"SW - #216 - 2022-02-02 - Styxhexenhammer666 - Christianity VS Esotericism","start":2112.18,"end":2155.09,"speaker":"Jonathan Pageau","text":"But there's a way in which we have to, like not only we have to, but human beings manifest like communal bodies. Like we have to join together, you know, we join together in communal versions of what we are. It is, you are like, you are an amalgamation of stuff. Right. You know, and so, and that has to hold together or else you're schizophrenic. Like if you let the parts of you rule you too much, then you're, you're, you're diseased. And so we do the same. Like we come together and then we create, let's say higher versions of what we are like where we participate in communities and bodies. And that, that has to, that can't only be to brought down to the individual level, can it?"}
{"episode_id":"SW - #216 - 2022-02-02 - Styxhexenhammer666 - Christianity VS Esotericism","start":2155.49,"end":2221.66,"speaker":"Styxhexenhammer666","text":"Well, it can if the individuals, I argue from a pragmatic perspective and say if the individuals understand critical thinking, the individuality aspect is prime. The civic and religious aspects are more decentralized and the civic aspect, legal one, is less important. If you argue the transcendent nature of a deity, the all encompassing nature, the good and the evil, the light and the dark, the everything and nothing at the same time sort of imminence argument, then I would say it doesn't really matter if the world ultimately goes to hell. Your soul is safe. Ultimately everything that happens is part of that divine will or lack of will anyway, and it doesn't really matter. And then I would also, I would also argue a proper construing of, you know, the words of Jesus in the New Testament would beg to differ as well and essentially become completely passive towards all civic affairs and is almost quasi separatist in nature, allowing people to form, if they share your religious views, those communities on the outskirts and if they're persecuted, they're all the better for it and are martyrs."}
{"episode_id":"SW - #216 - 2022-02-02 - Styxhexenhammer666 - Christianity VS Esotericism","start":2221.82,"end":2255.51,"speaker":"Jonathan Pageau","text":"Yeah, but there's a way in which I think what you're saying is that. How can I say this? If God is the all, imbibes all things, then we participate in the world. That is, it doesn't make, it doesn't become this kind of laissez faire thing where everybody, so let's say in St. Paul, there's this idea that we are that through bonds of love, then we create, let's say, something like the body of God in the world. That is, we are the ones who make the world something which holds together rather than something that breaks apart."}
{"episode_id":"SW - #216 - 2022-02-02 - Styxhexenhammer666 - Christianity VS Esotericism","start":2257.03,"end":2304.65,"speaker":"Styxhexenhammer666","text":"But why would that be important in the civic sense? Ultimately, you would be spending your time, let's say, that you've got a societal reform on your mind. You make videos about it, you march, do activism or whatever. Would that not technically be time that you're taking away from doing what the explicit command was, which is to go give things to the poor and help the widows and stuff, and you're trying to help society at large. That society, if you follow the example of your Christ, effectively is nullified. There was no real attempt to reform society. It was individuals that were being interacted with. The only interaction in the collective sense of node, is going in with a scourge and attacking a bunch of bankers, which also is something we can openly, explicitly support that again, because this will be on YouTube, but it is an interesting story."}
{"episode_id":"SW - #216 - 2022-02-02 - Styxhexenhammer666 - Christianity VS Esotericism","start":2304.97,"end":2390.89,"speaker":"Jonathan Pageau","text":"Yeah, but there. There is the idea that Christ gave. The idea of communion is not something which just limits people to the. To. If you read the chapter, the chapter in St. John, the Gospel of St. John, he keeps talking about unity. He keeps talking about, like, you know, be one as your Father in heaven, as I, and one with my Father. All of this idea of, like, a bond of unity and love. And so you're right that it's not something which is political per se. And I think that that's also why the Christian ideal is more something like the saint or the monk or the martyr. But then out of that will flow certain societies that his societies will flow out of that it doesn't create. How can I say this? So it really is in the sense that I was talking about this hierarchy of being that you have the Brahmin and those that fight and et cetera. So if you recognize the monks and the saints as the highest and they're the ones who do the things you're saying, because not everybody's going to end up doing that. The world kind of lays itself out in normal hierarchies. Like, it just kind of flows out. But if the top of your hierarchy is someone who gave everything for the poor, if the top of your hierarchy is someone who gave everything for others, then there's a good chance that some of that will flow down into the world as. And so I agree that, like, the civic part is definitely not the top. Like, it's not the highest aspect, but it can flow out of it."}
{"episode_id":"SW - #216 - 2022-02-02 - Styxhexenhammer666 - Christianity VS Esotericism","start":2390.89,"end":2401.82,"speaker":"Styxhexenhammer666","text":"But then the dysfunction of the world would be properly more ascribed to the sickness of organized religion than anything else, because it's already there. Maybe in a degraded form. Form. But what allowed it to degrade?"}
{"episode_id":"SW - #216 - 2022-02-02 - Styxhexenhammer666 - Christianity VS Esotericism","start":2401.9,"end":2402.5,"speaker":"Jonathan Pageau","text":"What allowed?"}
{"episode_id":"SW - #216 - 2022-02-02 - Styxhexenhammer666 - Christianity VS Esotericism","start":2402.5,"end":2402.9,"speaker":"Styxhexenhammer666","text":"What do you mean?"}
{"episode_id":"SW - #216 - 2022-02-02 - Styxhexenhammer666 - Christianity VS Esotericism","start":2402.9,"end":2403.82,"speaker":"Jonathan Pageau","text":"What allowed what to degrade?"}
{"episode_id":"SW - #216 - 2022-02-02 - Styxhexenhammer666 - Christianity VS Esotericism","start":2405.02,"end":2420.3,"speaker":"Styxhexenhammer666","text":"If the civic is to be subjugated entirely to the religious, the religious is held up at the height which until the last half century, generally it was in most countries anyway, and things are degrading. Wouldn't it have to start at the top? At the root of the problem would be the religious leaders."}
{"episode_id":"SW - #216 - 2022-02-02 - Styxhexenhammer666 - Christianity VS Esotericism","start":2420.38,"end":2423.66,"speaker":"Jonathan Pageau","text":"No, you're right. You're absolutely right. And that's why if you read."}
{"episode_id":"SW - #216 - 2022-02-02 - Styxhexenhammer666 - Christianity VS Esotericism","start":2424.54,"end":2443.08,"speaker":"Styxhexenhammer666","text":"So then if the Lord allows them to be degraded, and it's certainly not just the case in Christianity, it's the case in any religious or spiritual. Spiritual movement, including among most pagan movements. Then why entrust them with greater power or try to organize society on their basis? If they're already sick, you'd need an entire revolution."}
{"episode_id":"SW - #216 - 2022-02-02 - Styxhexenhammer666 - Christianity VS Esotericism","start":2443.56,"end":2534.71,"speaker":"Jonathan Pageau","text":"No, but that's why in this traditions you always have two strains. You'll have a saint's strain and then you'll have an official strain. And the real strain is the saints strain. That is, the saints don't have to be bishops or priests. They can. They don't have to be popes. They are recognized. They are recognized by the church, by the. By the people, by the bond of love as being representing the ideal. And they're the ones that really give us the way to go. Then you have the hierarchy, let's say the actual civic, like the. Let's say the official version of the hierarchy, where you have priests and bishops and everything. And those are needed and useful, but ultimately those are. They. They have to bow to the saints, right? They have to worship, they have to venerate the saints, because the saints are the one. Are not part of that hierarchy, you know, and the hierarchy is supposed to flow out of it. It degenerates. I agree. Of course it does. Like any human system, it ends up degenerating. But it has in it the possibility of keeping those ideals up there. Like the ideals are clearly marked and you know, like what you're. What you're following. Whereas like in a. Like. That's why I. If you look at what's going on in the U.S. i feel like that's the main issue is that there is nothing, there's no spiritual example that is keeping us together, right? What is keep. What is making us something like what is making the United States? Something. Memory of its founding maybe."}
{"episode_id":"SW - #216 - 2022-02-02 - Styxhexenhammer666 - Christianity VS Esotericism","start":2534.95,"end":2561.58,"speaker":"Styxhexenhammer666","text":"Yeah. The civic example of its founding was based upon certain spiritual precepts, not all of which were Christian. That part definitely. The saints of Christendom would play a huge role, not in the religious sense, but in what you're saying, the metaphoric sense. Though again, though, pagan ideology was intertwined and also secular ideology that had been delivered through things that are logic, philosophy in the more secular sense. Although again, that's intertwined with religion mostly."}
{"episode_id":"SW - #216 - 2022-02-02 - Styxhexenhammer666 - Christianity VS Esotericism","start":2561.74,"end":2568.55,"speaker":"Jonathan Pageau","text":"And things now we're seeing, but we're seeing exactly that. We're seeing a kind of taking down of the saints of United States history."}
{"episode_id":"SW - #216 - 2022-02-02 - Styxhexenhammer666 - Christianity VS Esotericism","start":2568.55,"end":2571.27,"speaker":"Styxhexenhammer666","text":"Oh yeah, there's a reason why they want to remove Thomas Jefferson."}
{"episode_id":"SW - #216 - 2022-02-02 - Styxhexenhammer666 - Christianity VS Esotericism","start":2571.43,"end":2590.03,"speaker":"Jonathan Pageau","text":"And so what, what, like, what do we. Like that's. I guess that's the idea is like, how do we deal with this? Like, how do you deal with. I mean, we have the same problem. Look, I'll be honest with you. Like I have the same problem in Christianity. You're seeing the same thing happen, right. The Pope of Rome right now, like is, is, is, is acting against the pedophile."}
{"episode_id":"SW - #216 - 2022-02-02 - Styxhexenhammer666 - Christianity VS Esotericism","start":2590.03,"end":2590.47,"speaker":"Styxhexenhammer666","text":"Yeah."}
{"episode_id":"SW - #216 - 2022-02-02 - Styxhexenhammer666 - Christianity VS Esotericism","start":2590.79,"end":2594.63,"speaker":"Jonathan Pageau","text":"Against the very foundations of a lot of the foundations of his own."}
{"episode_id":"SW - #216 - 2022-02-02 - Styxhexenhammer666 - Christianity VS Esotericism","start":2595.37,"end":2637.65,"speaker":"Styxhexenhammer666","text":"I've got a solution. And it actually kind of is the Christian prescription for it, at least in the sense of Jesus teachings, which is decentralization. Don't rely on public education, it won't teach your kid critical thinking, homeschool your kid, or at the very least get tutors, grow your own food, get to know your neighbors, form your local communities, create syndicates, decentralize your income, do everything that you can to be self sufficient and starve the machine. Because the real problem is globalism. Is that the problem, the biggest problem is it goes beyond just the United States. It's an international phenomenon at this point. One of the issues though, that's actually an advantage in one way because you can tell people of different religions, look, it doesn't matter which God you're worshiping, you're still gonna be a slave too. So we need to cut it out."}
{"episode_id":"SW - #216 - 2022-02-02 - Styxhexenhammer666 - Christianity VS Esotericism","start":2637.73,"end":2652.97,"speaker":"Jonathan Pageau","text":"But it's one of the problems with decentralization is that in the process of decentralization it makes you weaker because you're fragmented. And so you end up being a bunch of fragmented bits facing this massive machine. And I'm saying this like I'm not trying to get you or anything."}
{"episode_id":"SW - #216 - 2022-02-02 - Styxhexenhammer666 - Christianity VS Esotericism","start":2655.21,"end":2681.57,"speaker":"Styxhexenhammer666","text":"Think about it as a puzzle. So you get a puzzle of 500 pieces and you only take two or three out. Puzzle's bigger. But now let's say that most of the pieces are absent. That puzzle is not so formidable anymore. It looks like Swiss cheese. That's the way to do it. You need enough decentralization and I would say pseudo decentralization in the communications era, because these groups can coordinate with one another even at great distances, even across the entire world. They communicate with a lunar colony if."}
{"episode_id":"SW - #216 - 2022-02-02 - Styxhexenhammer666 - Christianity VS Esotericism","start":2681.57,"end":2687.25,"speaker":"Jonathan Pageau","text":"They wanted to, these decentralized groups. But what unites them together? I guess hatred of the system."}
{"episode_id":"SW - #216 - 2022-02-02 - Styxhexenhammer666 - Christianity VS Esotericism","start":2687.65,"end":2729.58,"speaker":"Styxhexenhammer666","text":"Yeah, the fact that they want individualism. They want an end to the abuse and tyranny of this. Of the world system as it is, which really, it only benefits a handful of crooks at the top. And none of these, none of those people are religious. Some people blame religion. They'll say, like, well, it's these, these greedy Christians running this country, these greedy sheiks, Islamists running another one, the Jews, Hindu caste or something. No, these people don't believe in any God. If they. If they believed in the concept of judgment or hell or purgatory or karma or reincarnation, they wouldn't act the way they do because they'd be terrified all the time, I don't think. They're not necessarily atheistic, but they've just. They're completely clouded by self interest. They don't even think spiritual thoughts. They're completely apathetic towards them."}
{"episode_id":"SW - #216 - 2022-02-02 - Styxhexenhammer666 - Christianity VS Esotericism","start":2729.58,"end":2732.18,"speaker":"Jonathan Pageau","text":"Yeah, they worship Mammon, basically, is what."}
{"episode_id":"SW - #216 - 2022-02-02 - Styxhexenhammer666 - Christianity VS Esotericism","start":2732.89,"end":2735.45,"speaker":"Styxhexenhammer666","text":"They wouldn't even worship Mammon. It'd require too much effort."}
{"episode_id":"SW - #216 - 2022-02-02 - Styxhexenhammer666 - Christianity VS Esotericism","start":2736.81,"end":2738.73,"speaker":"Jonathan Pageau","text":"They just care about, I have to."}
{"episode_id":"SW - #216 - 2022-02-02 - Styxhexenhammer666 - Christianity VS Esotericism","start":2738.73,"end":2747.05,"speaker":"Styxhexenhammer666","text":"Walk up these 50 steps just to throw the baby on the altar. What the fuck? Too much exercise. I'll have my secretary do it."}
{"episode_id":"SW - #216 - 2022-02-02 - Styxhexenhammer666 - Christianity VS Esotericism","start":2747.05,"end":2792.77,"speaker":"Jonathan Pageau","text":"Yeah, there you go. And so look, I mean, I think. I think we've gone quite a while, I guess maybe like my last question for you would be something like, in the past, let's say 10 years or the past time that you've been on YouTube, I've noticed that, strangely enough, you do have a lot of Christian people that follow what you're doing. And, you know, you also moved, it seems, from this kind of Satanist, kind of a, you know, secular Satanist type position to now a more. What seems to me like a more nuanced position. And so I'm curious to see if you. If there are some aspects in these last few years of Christianity that you reconciled yourself with, if you still think that it's really useless."}
{"episode_id":"SW - #216 - 2022-02-02 - Styxhexenhammer666 - Christianity VS Esotericism","start":2793.01,"end":2902.89,"speaker":"Styxhexenhammer666","text":"Oh, well, the majority of the more modern works that I edit, they were written by Christians, more or less religious in form. I just did a work on mystic Christianity, actually. Only about a week ago. I have an appreciation for anything that I believe falls under the umbrella of the occult. Any mystic tradition, Christianity, Kabbalah, mystic Islamic, Sufism, those all fall under that umbrella as well. I don't. In the past I had more of a problem with organized religion and took it out on the religion itself. And in time what I realized is while it's really greedy leaders, I mean they could also be greedy secular leaders. It really depends on the interpretation more of the religion. What I would say is the fire and brimstone aspect of some groups of Christendom I oppose. I think that it's crazy, but then it's no different than the fire and brimstone style groups that you find in any hyper zealous community. It's the same in all religions. There are pagans like that. There are pagans that probably, probably would revert to human sacrifices if they were legally capable of doing it and getting away with actual devil worship cults out there that do crazy shit too. One thing that I would like to point out for the benefit of your audience this is going on your channel is I am not a Satanist. Some people believe that I still am. That was 10 years ago and that was a transformative atheistic step to clearing my mind out before I indulged in all religions and I could look at them with a clear lens. It was sort of like a wiping of the lens for me. Even the term pagan though, at this point I don't know is fully appropriate for me due to practice. It's really occultism. Yeah, it's a, it's a search for what is hidden or what is not known more than anything else. I'm just on the road with everybody else. I just don't think there is an end destination. Maybe I find one someday, but I'm not looking for it. I'm just looking for the different paths and enjoying myself on the way."}
{"episode_id":"SW - #216 - 2022-02-02 - Styxhexenhammer666 - Christianity VS Esotericism","start":2903.2,"end":2938.2,"speaker":"Jonathan Pageau","text":"Well, I would say then I would still. I would recommend that you look into Hesychazm, like the Christian, the Eastern mystical practice, which is, which is completely. It's very similar to, to other mystical practices, but in that it's not secret. That is, it is, it is integrated into, into the church. There's a, there's a compiled book called the Philokalia, which is a kind of compilation of all these mystical texts which talk about the mystical practice, breathing techniques, you know, attention to the heart, posture and then repetitive prayer. All of these things that you find."}
{"episode_id":"SW - #216 - 2022-02-02 - Styxhexenhammer666 - Christianity VS Esotericism","start":2938.52,"end":2941.8,"speaker":"Styxhexenhammer666","text":"So it's like yoga. So see, it is like Hinduism I."}
{"episode_id":"SW - #216 - 2022-02-02 - Styxhexenhammer666 - Christianity VS Esotericism","start":2941.8,"end":2953.8,"speaker":"Jonathan Pageau","text":"Mean, it's obviously, it's not. It's not. It's not the same, but it is definitely a spiritual practice, which looks more like Eastern practices than it does the kind of emotional, you know, gospel worship."}
{"episode_id":"SW - #216 - 2022-02-02 - Styxhexenhammer666 - Christianity VS Esotericism","start":2954.04,"end":2957.32,"speaker":"Styxhexenhammer666","text":"You'll have to link. You'll have to link me to that book where I can get it."}
{"episode_id":"SW - #216 - 2022-02-02 - Styxhexenhammer666 - Christianity VS Esotericism","start":2957.72,"end":3012.5,"speaker":"Jonathan Pageau","text":"I'll definitely. And I still. I think I mentioned it on our last talk. I would suggest you read my brother's book. His name is Mathieu Pajeau. He wrote a book called the Language of Creation and he actually watches your content. So he was excited when I told him that I was going to talk to you. But I think that he can bridge also some ideas in terms of like, let's say, the esotericism and a way of understanding it in a way that isn't hostile to. That's one of my biggest problem, I think, with the occult is that the man in which he became hostile to normal religious practice, you could say, like, where you had this elite that were practicing these things and then the people. It's actually, in a way that you phrase it yourself, it's like for the masses, this stuff, and then for the. Really the elites, this stuff. And it's that separation which I find difficult."}
{"episode_id":"SW - #216 - 2022-02-02 - Styxhexenhammer666 - Christianity VS Esotericism","start":3012.74,"end":3049.25,"speaker":"Styxhexenhammer666","text":"Well, the positive side of that was an attempt to bring the masses upward and make everyone sort of aware of that occult nest. The theosophists were big for this social reform and so forth, some of which actually took off and were promulgated, including prohibition. Sorry for that one. Say this theosophists. Unfortunately, there are some occultists that are just completely elitist, though, and they don't think anyone can learn unless they've been given the mark of Solomon or something like that. Like, they have to be, like, marked at birth, specially with special star signs or something in order to learn magic. And I'm like, I don't think so."}
{"episode_id":"SW - #216 - 2022-02-02 - Styxhexenhammer666 - Christianity VS Esotericism","start":3049.57,"end":3058.77,"speaker":"Jonathan Pageau","text":"All right, well, anyway, thanks for the conversation. I appreciated it and we'll see how people react to this conversation. If you want, we could always pursue it."}
{"episode_id":"SW - #216 - 2022-02-02 - Styxhexenhammer666 - Christianity VS Esotericism","start":3059.25,"end":3060.13,"speaker":"Styxhexenhammer666","text":"Yeah, it was great."}
{"episode_id":"SW - #216 - 2022-02-02 - Styxhexenhammer666 - Christianity VS Esotericism","start":3060.37,"end":3061.89,"speaker":"Jonathan Pageau","text":"All right, cool. Nice to talk to you."}
{"episode_id":"SW - #216 - 2022-02-02 - Styxhexenhammer666 - Christianity VS Esotericism","start":3062.05,"end":3063.17,"speaker":"Styxhexenhammer666","text":"We'll say peace out."}
{"episode_id":"SW - #216 - 2022-02-02 - Styxhexenhammer666 - Christianity VS Esotericism","start":3063.41,"end":3126.77,"speaker":"Jonathan Pageau","text":"All right, bye. Bye. I hope you enjoyed this episode of the Symbolic World. The Symbolic World is based on a series of videos that you can find on my YouTube channel, Jonathan Pageau's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism, that is. It's quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by, of course, leaving a review on itunes. Everybody knows that's the best way to get the podcast out there, to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon the Pajo videos as well, and on subscribestar, all those links you can find on my website or in the show description. So thank you and I will see you soon."}
