{"episode_id":"SW - #017 - 2018-09-26 - Patterns And Meaning In Music - With Samuel Andreyev","start":0.48,"end":110.58,"speaker":"Jonathan Pageau","text":"I'd like to welcome you to episode 17 of the Symbolic World podcast. In this episode, I will be playing for you a discussion that I had with the composer Samuel Andreea. I wanted also to mention that I will not be putting up any of the videos taken from YouTube that deal with movie interpretations because they're so dependent on the visuals that I will not have them on this audio podcast only. So if you want to see some of my video interpretations, some of the interpretations, Interpretations I've done of different movies, you'll have to go to my YouTube channel from which all of these podcasts are taken in the first place. So enjoy my discussion with Samuel. This is Jonathan Peugeot. Welcome to the Symbolic World. So, hello, everybody. I would like to present to you Samuel Andreea. Samuel is a composer. He's originally from Canada, but he lives in France right now. And so he's been someone I've been following on YouTube and that I met through Jordan Peterson as well, and has a very good perception of music, a good way of analyzing music. And for me, music is something that I understand very intuitively. I struggle to be able to analyze it. So I'm very curious to find out more about how the patterns in music can connect to the other patterns of manifestations, such as in stories and in images and in our lives. So, Samuel, I'll give you a chance to maybe introduce yourself a little bit, tell us about your background and what you're doing right now."}
{"episode_id":"SW - #017 - 2018-09-26 - Patterns And Meaning In Music - With Samuel Andreyev","start":111.51,"end":340.05,"speaker":"Samuel Andreyev","text":"Okay, so, well, first of all, thank you for the invitation. I'm absolutely thrilled to be on your channel because I have been watching your videos and I've been following what you've been doing for a while, and I find what you're doing is actually extremely fascinating. So I'm really happy to get a chance to talk to you. So just to present myself briefly. Yeah, I'm Canadian, originally. I was born near Toronto, and I moved to France when I was 22 years old. And I've been living here pretty much my entire adult life at this point. And I came here actually because I wanted to. Among other things, I wanted to study at the Paris Conservatory, which is a very good, very good school. It's got a very good composition program. And it was a place that I always was very compelled by the idea of studying at, let's put it that way. So I did that, and I studied very, very intensively in France for, I guess, about eight years. I studied composition and music analysis, oboe, music theory. I studied orchestration, acoustics, electroacoustics. I had a very, very Complete education. And also in parallel, that whole time I was pursuing my practice as a composer. So I guess one thing I should say, because I kind of jumped ahead there, was that when I was still living in Toronto, I was already active as a composer and as a musician. And so that's something that I always did in parallel to my studies. And so by the time I graduated from the Paris Conservatory, I was already involved in quite a lot of different projects. Making CDs, doing orchestral pieces, and writing chamber music and that sort of thing. So I guess, generally speaking, you could say that my practice stems out of the European. The sort of mainly European tradition of art music. I say art music, for lack of a better term. There is really no ideal term to describe this sort of music. I suppose I don't like the implication that other sorts of music are somehow not art, that that carries with it. But that seems to be at least the term that's used in common parlance. So I'll stay with that for now. And I'm profoundly obsessed with understanding the musical phenomenon as deeply as I can, because it's something that is almost inexhaustibly complex, and it's. It's absolutely astounding. One of the more important experiences I had when I was a student was the analysis courses that I took. And one of the things that really struck me about that was that, first of all, no matter what way you look at analysis, no matter what country you're studying in or what approach you're taking, there really aren't a lot of objective tools for describing music. So that's one initial challenge, is that you can have two people looking at the same piece of music. And they are both very accomplished professionals with a very good amount of technical baggage. And they won't necessarily describe the piece in the same manner. So the way that you approach the piece will be different, depending on what analytical tool you bring to bear upon the work. So I found that extremely interesting. And then I started to consider all of the different functions that music has had in different human societies throughout time and try to understand what they might have in common and if there might be certain archetypal uses or forms of music that are atemporal, that exist across the centuries and across cultures. And so those are some of the questions that I've been thinking about a lot lately."}
{"episode_id":"SW - #017 - 2018-09-26 - Patterns And Meaning In Music - With Samuel Andreyev","start":340.93,"end":410.33,"speaker":"Jonathan Pageau","text":"Well, I mean, the last thing you said, I think is very interesting, and I've been curious, because when you look at music, when I approach music, when I listen to music, the thing that really strikes me Is, on one hand, it seems like in terms of pattern, it's probably the purest form of art. Because it seems like it. I mean, it is abstract compared to all the other types of art because it doesn't refer directly to anything else. Of course, it does suggest things, especially within a culture and within. When it's embedded in a culture. But the abstraction of it makes me. Makes me see like there is something there. Seems like there's some. I mean, it seems like music is a human universal. It seems like it's an expression which. Which. Which manifests pattern in almost a pure way. But for some reason, I. I can't totally analyze them. And so I would be curious with what you said, the last thing you said. I'm curious to hear maybe what do you feel are some of the. The universals, let's say, that carry through music, through the ages and through cultures."}
{"episode_id":"SW - #017 - 2018-09-26 - Patterns And Meaning In Music - With Samuel Andreyev","start":410.97,"end":449.22,"speaker":"Samuel Andreyev","text":"Okay, so there's a lot to talk about there. So the first thing I would say is regarding the notion of abstraction in music. That's in itself a subject that I find extremely fascinating. Because, yes, it's certainly true that music has a strong abstract component. And we think of certain composers or certain styles of music as being more abstract than others, which is also an interesting thing because it implies that there are different levels of abstraction. And that some musics might be somehow more concrete or more manifest or more immediate somehow in terms of what their expression. And other musics might be somehow less immediate."}
{"episode_id":"SW - #017 - 2018-09-26 - Patterns And Meaning In Music - With Samuel Andreyev","start":450.26,"end":474.75,"speaker":"Jonathan Pageau","text":"Would the human voice maybe be the ground that makes us feel that some music is more grounded, let's say, because it seems like, at least in the human experience, the voice, the tonalities of speaking and the tonalities in the human voice are our most immediate, the most immediate place where we attribute meaning and sound together or attribute value to sound, let's say."}
{"episode_id":"SW - #017 - 2018-09-26 - Patterns And Meaning In Music - With Samuel Andreyev","start":474.99,"end":567.27,"speaker":"Samuel Andreyev","text":"I think that's certainly a big part of it. And I think part of the idea of this notion of abstraction in music comes from the fact that the idea that you would sit down and listen to a piece of music as a purely aesthetic experience in company with a few. A few hundred other people in a concert hall is extraordinarily recent in terms of. In terms of human civilization. I mean, this is, what, 200 years old maybe, this idea of the concert per se. In other words, a cultural experience that's detached from any immediate function. I suppose I would put it that way. So almost all music that you can really think of until extremely recently had basically one of two functions. One was dance, and the other was the expression of some kind of devotion or some form of ritual or ceremony. So the idea that you would sit down and listen to a piano sonata, for example, and that this would be a sort of aesthetic experience in an. In and of itself. Without having it be embedded in something relating to a. What would you call it? An overarching cultural practice that. That. That englobes the culture that you're in. This is very, very recent. So I think that's probably where the idea of abstraction comes from. If you're not dancing and you're not singing, then what is it exactly? What is the nature of the experience you're having?"}
{"episode_id":"SW - #017 - 2018-09-26 - Patterns And Meaning In Music - With Samuel Andreyev","start":567.98,"end":608.88,"speaker":"Jonathan Pageau","text":"But even the experience of dancing is a very strange experience. I mean, even dancing itself, it's difficult to find a practical use, let's say. I mean, a building holds the rain away. Images remind you of past events, remind you of things that are not present. They're a reminder of things that aren't present at the moment. And so other arts, you can kind of right away see what the ground did. But even dancing itself, there's something very almost dangerous about dancing. There's something mysterious. Exactly. Because we don't exactly know what's happening when we're dancing."}
{"episode_id":"SW - #017 - 2018-09-26 - Patterns And Meaning In Music - With Samuel Andreyev","start":609.36,"end":625.36,"speaker":"Samuel Andreyev","text":"One thing about dancing is it allows you to have a collective experience. So I think it has a very important social aspect. Right. It allows people to have a collective experience in which they abandon their individual identity. And are subsumed in a mass of something. Something greater."}
{"episode_id":"SW - #017 - 2018-09-26 - Patterns And Meaning In Music - With Samuel Andreyev","start":625.76,"end":631.68,"speaker":"Jonathan Pageau","text":"Right. So that's why it's so similar, in a way, it is so connected to ritual in that sense. Because ritual also has that function often."}
{"episode_id":"SW - #017 - 2018-09-26 - Patterns And Meaning In Music - With Samuel Andreyev","start":632,"end":707,"speaker":"Samuel Andreyev","text":"Absolutely. Go ahead. Absolutely. So that must be, in some manner, an extraordinarily important thing to have within a society. Something that allows people to come together in that. In that sort of very powerful manner. So that's one thing. And it also allows you to transcend, I think, on one level the limitations, especially the temporal limitations that we are inevitably subject to in the earthly realm. Right. So I think dance allows you to connect with that in a certain manner in a way that's extraordinarily powerful. So that would be one thing. So to move a little bit further in the history of music. So you talked also about the sort of abstraction of music. One other way of thinking about it is that it might not be so much that it's abstract as that. It's actually immaterial in the sense that. What is music? Well, first of all, it's not a commodity. It's not a physical object. It's not Something that you can buy and sell. It's not something that you can move from one place to another. It's made of air, literally. And it's made of airwaves being propagated by something that's setting them into motion."}
{"episode_id":"SW - #017 - 2018-09-26 - Patterns And Meaning In Music - With Samuel Andreyev","start":707.56,"end":744.74,"speaker":"Jonathan Pageau","text":"Yeah. We could say it's actually literally spiritual. It's literally made of air. It's literally the closest thing maybe that we have to air. And we see that in the Old Testament. We have this sense that to hear something, like, to hear God is a. Is a spiritual experience, whereas to see God is impossible. But to hear God is possible because there's this relationship between voice and spirit, air, breath, and the notion of what's immaterial and what is related to the intellect, let's say, what's related to the higher spheres of being. So, yeah, that's interesting to think about. Of course."}
{"episode_id":"SW - #017 - 2018-09-26 - Patterns And Meaning In Music - With Samuel Andreyev","start":745.54,"end":758.88,"speaker":"Samuel Andreyev","text":"Yeah. I mean, obviously that's not all it is. Right. Because it's embedded within a culture and it has meanings and it's. It has a function and so on. But it is a very interesting phenomenon from that point of view."}
{"episode_id":"SW - #017 - 2018-09-26 - Patterns And Meaning In Music - With Samuel Andreyev","start":761.12,"end":820.64,"speaker":"Jonathan Pageau","text":"Yeah. So I think my big question then, I mean, regarding the things you said about the universal aspects of our. The universal aspects of music, let's say the notion of creating a unitive experience within a people, also maybe directing that experience towards something that's transcendent in the sense of worship, but also grounding in their body. I mean, the idea of dance or even procession, like, it wouldn't have to be dance in a. More in the way we think of it today in a club or anything, but the notion of processing, let's say, in a circle or something of that manner. And so would that type of music, the music that is geared towards those unitive goals or those purposes of bringing things together, would the form of the music reflect the purpose of the music? Like, would the way you pattern the music have a link between. Between how it's structured and how it brings people together and does all the things we mentioned?"}
{"episode_id":"SW - #017 - 2018-09-26 - Patterns And Meaning In Music - With Samuel Andreyev","start":820.96,"end":861.39,"speaker":"Samuel Andreyev","text":"Oh, yes, absolutely. In a very profound way. So I can give you a couple of examples of that. If you. If you listen to Southern Indian music, Carnatic music, you'll notice that the pieces are often extremely long and they have very little in the way of contrast in them. So in other words, you'll have approximately the same. What would you say, Quality from beginning to end. Now, within that span of time, of course, you'll have different people taking solos and the relationship between the performers will change. But you don't have this sort of narrative structure that you get in a lot of Western music, particularly the past few hundred years."}
{"episode_id":"SW - #017 - 2018-09-26 - Patterns And Meaning In Music - With Samuel Andreyev","start":861.63,"end":862.03,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #017 - 2018-09-26 - Patterns And Meaning In Music - With Samuel Andreyev","start":862.03,"end":873.55,"speaker":"Samuel Andreyev","text":"So. Or at least if there is a narrative structure, maybe I don't understand it because I'm not. I'm not within that culture. But the way it sounds to me anyway, as an outsider is that it's more contemplative in nature."}
{"episode_id":"SW - #017 - 2018-09-26 - Patterns And Meaning In Music - With Samuel Andreyev","start":873.95,"end":874.35,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #017 - 2018-09-26 - Patterns And Meaning In Music - With Samuel Andreyev","start":874.51,"end":959.54,"speaker":"Samuel Andreyev","text":"I think. I think you have. You have musics that are essentially contemplative that. That. That can help you to enter into perhaps a different state of consciousness or that can slow time down for you in a certain manner or just allow you to sink into this experience in a very profound way. And there are other musics that function much more analogously to, for example, a movie or a story, where they're actually explicitly narrative in a certain sense. In other words, you start in place A and then you end up in place B. And there's a sort of displacement that happens. And then once you've ended up in place B, it creates a certain form of nostalgia because you're no longer where you started. And that creates a tension. And then you have to resolve that tension somehow. And there's all sorts of ways you can do that. But it seems to me that the types of music that function in that manner are essentially narrative. But not all music is narrative. I mean, there are all sorts of different. Just like there are all sorts of different types of discourse. Right. You have. There's four classical types of discourse. You have argumentation, narration, description and exposition. And you have. You have similar phenomena in music as well. Where there are. There are types of music that are basically, you know, very static in nature, and they could go on for four hours and it wouldn't make a difference. You know, they could be two hours long or four hours long, and the nature of the music wouldn't change."}
{"episode_id":"SW - #017 - 2018-09-26 - Patterns And Meaning In Music - With Samuel Andreyev","start":960.1,"end":1019.1,"speaker":"Jonathan Pageau","text":"Yeah, yeah. So that type of music because. Because of its kind of permanence, the permanence that underlies it, also would bring someone to kind of enter into that permanent somehow or to feel drawn into, like, a contemplative spirit. I mean, the music that I know a bit more, that I've been more exposed to, is Byzantine music, of course, just because of my whole story. And so in that music, there's something of. That seems to be something of that. Because they have this drone that is just this one sound, this kind of bass sound. And then on top of it, and you almost have this wave that's kind of going on top of this, just one sound. And it also. It doesn't seem to have a narrative in it. It doesn't seem to have a. It's almost as if it could start anywhere, it could end anywhere. I mean, there are melodies in there, you know, but they're not as explicit, let's say, as what we would hear in a pop song."}
{"episode_id":"SW - #017 - 2018-09-26 - Patterns And Meaning In Music - With Samuel Andreyev","start":1019.1,"end":1054.29,"speaker":"Samuel Andreyev","text":"Right, Right, Yeah. I mean, I can't get too specific about things like Byzantine music for a couple of reasons. One of them is that I'm not. I'm not an expert in the subject. And the other is that I think that things like that. And you can get CDs of people interpreting ancient Greek music, for example, and things like this. The problem is the farther you go back. If you go back. If you go back before the 14th century, and even then you're sort of pushing it. But if you go back farther than that, it gets to be extremely difficult to know really what it sounded like and how it was play it exactly, because it's really based on conjecture."}
{"episode_id":"SW - #017 - 2018-09-26 - Patterns And Meaning In Music - With Samuel Andreyev","start":1054.77,"end":1055.17,"speaker":"Jonathan Pageau","text":"Because."}
{"episode_id":"SW - #017 - 2018-09-26 - Patterns And Meaning In Music - With Samuel Andreyev","start":1057.57,"end":1185.22,"speaker":"Samuel Andreyev","text":"The idea of music being something that you can encode in some kind of written notation that is stable and that can be restituted hundreds of years later and so on, is really fairly recent. So with things that predate the formation of a relatively stable type of music notation, it's very difficult to know exactly how it was played. Now, you can make a very good educated guess, and you can base your research on extant instruments and things like this and paintings. And maybe if there's a written document or a treatise or something like that, then you can derive things from that. But it's hard to be too much more specific than that. But in terms of the development of Western polyphony and Western art music, one thing that I think is extremely interesting is that the very earliest music, as far as we can tell, was chanting. It was monotic chanting, and the chanting was simply. Well, it had a couple of functions, but I think the most important one was that it aided memorization of sacred texts. So you have that, and then everyone is singing the same thing in unison. And gradually over time, we start introducing a second voice or a second part. And initially you had something called organum, which is where the two parts are the same interval apart the whole time, and they're just moving in parallel motion. And so different intervals are permitted. In organum. It was very strict initially, and it was controlled by the church. And there was a lot of rules about what you couldn't, could and couldn't do. And gradually it got more and more complex. So there is a. There is a very interesting directional tendency in Western music towards ever greater complexity and richness of polyphony. And I think that one thing you can say about, about the Western art music tradition that I think makes it distinct from others, not better, but distinct, is the development of counterpoint, which is really something that is really very highly developed in the West."}
{"episode_id":"SW - #017 - 2018-09-26 - Patterns And Meaning In Music - With Samuel Andreyev","start":1185.54,"end":1185.9,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #017 - 2018-09-26 - Patterns And Meaning In Music - With Samuel Andreyev","start":1185.9,"end":1244.48,"speaker":"Samuel Andreyev","text":"Because if you look at different musical cultures, they tend to focus on different things. And so, for example, in sub Saharan African music, you have extraordinarily complex rhythmic polyphonies. And in the Indian music that I described earlier, you have extraordinarily sophisticated approach to melody. I mean, absolutely incredible. They have a very large number of different scales, all of which use different intonations. They're very, very complex. But in Indian music of that sort, you basically don't have polyphony, you basically don't have harmony for that matter. You have a drone and you have a melodic line. Western music is extraordinarily simple compared to those other musics from the point of both melody and rhythm, but it has developed counterpoint and this sort of contrapuntal polyphonic idea that seems to be its particularity, which I find actually quite interesting."}
{"episode_id":"SW - #017 - 2018-09-26 - Patterns And Meaning In Music - With Samuel Andreyev","start":1245.2,"end":1275.3,"speaker":"Jonathan Pageau","text":"Right. And would you see a relationship between, let's say, the development of counterpoint and the development of these, let's say, these two tensions in music that play off each other. And I mean, for me, it's hard not to see that there's a relationship between the development of Western thought as well and the age of reason and the scientific development bring about this kind of dialectic way of thinking and of seeing the world. So I don't know if you feel like there's a relationship between those two things."}
{"episode_id":"SW - #017 - 2018-09-26 - Patterns And Meaning In Music - With Samuel Andreyev","start":1276.26,"end":1350.03,"speaker":"Samuel Andreyev","text":"Yeah, I think there definitely is. I mean, the very nature of counterpoint and polyphony is dialectical. So the idea is you have, in order to have a meaningful counterpoint, you need to have an idea A and an idea B and they need to be contrasted from each other in some manner. And so that's not enough to make a dialectic though. Right. In order to have a dialectic, you need to have A and B interact in some manner and change each other. Right. Otherwise you simply have a duality or an opposition. Right. That is in fact the direction that Western music went, went into. So. And it gets more and more pronounced over time. So things like, especially in the classical period, where it gets extremely codified and that corresponds with the age of Enlightenment and you get this idea of an extremely well laid out form in which you literally do have idea A and idea B and they're Presented first separately, one after the other. And then you have a development section in which the two ideas sort of are played off of each other and co. Mingle and change each other. And then at the end, you have a synthesis. So you couldn't have a more sort of explicit demonstration of enlightenment ideals, I think, in that sort of music."}
{"episode_id":"SW - #017 - 2018-09-26 - Patterns And Meaning In Music - With Samuel Andreyev","start":1351.79,"end":1402.48,"speaker":"Jonathan Pageau","text":"That's really interesting and I'm curious about. Yeah, I'm curious about. We talked about this idea of how the form, let's say, of music, and you talked about the universals, let's say, of music. And so one of the things that I'm noticing as I look around and I listen to music today and I listen to modern composers and I listen to just pop music or whatever, I mean, it feels like there aren't. There aren't a lot of things that are trying to think about that unitive experience, let's say, there. Rather, it seems to have been a breakup and a fragmentation of musical styles and of musical intentions. And for me, it's hard not to see that as mirroring a little bit of the kind of frenetic world in which we live. And so I was wondering if you have a few things to say about that. That idea."}
{"episode_id":"SW - #017 - 2018-09-26 - Patterns And Meaning In Music - With Samuel Andreyev","start":1402.96,"end":1609.38,"speaker":"Samuel Andreyev","text":"It's a very interesting thing. And the thing I would say about it is that there certainly is a progression and a change over time. If you look at Western music, it's very clear there are different stylistic periods that are relatively easy to identify, even though, obviously it's always difficult to slot composers into categories because history isn't that simple. And things are always a lot more nuanced than the sort of labels that are created after the fact by historians and musicologists and so on. But nevertheless, there is a demonstrable technical progress. And what I mean by technical progress is that over time we became able to do more things and to do them relatively well. Now, that's not to say, incidentally, that earlier music is in some manner crude or. Or less profound or less meaningful or less accomplished, that's not the case. But the. The scope of what we are able to do has. Has continued to get bigger. So. And also the scope of what is allowed to be done and what of things that could conceivably have some form of cultural meaning or value has gotten larger as well. So that's. That's an interesting thing. And that process happened relatively slowly, I would say, over the course of maybe 600 years. And then, you know, with the. With the Industrial Revolution and Moving into the 20th century, it sped up exponentially and that's certainly related to the rise of technology and to the profound impact that it's had on everybody's lives. But it's also had another interesting effect, a sort of byproduct which is not commonly enough discussed or understood, I think, which is the fact that until relatively recently, the music that would be of most concern to you would be the music that was in your immediate environment and that was being practiced in your. In your day. And so a composer like Mozart, for example, had very little interest in listening to, for example, I don't know, 16th century Franco Flemish music. It just wouldn't have occurred to him. It just wasn't in his. In his milieu at all. He had an interest in and an understanding of Bach for sure. But, I mean, even Bach is relatively close to Mozart. They're separated BY what, about 50 years or something like this. So, you know, that's about as far as it went. So you would be, above all concerned with the music of your time and of the different stylistic practices that were dominant wherever you happen to live. And with technology, and especially with recording technology, all of that goes out the window. So it becomes possible to make permanent documents of anything that anyone in the world can listen to at any time, whenever they want. And so a composer today can go on the Internet and listen to a recording of almost anything you can possibly think of. So what does that. Where does that leave you? Because you're not. You're not living in the center of your culture, surrounded only by the artifacts of that culture. You're living in a chaos of potentially unlimited access to the totality of human cultural production."}
{"episode_id":"SW - #017 - 2018-09-26 - Patterns And Meaning In Music - With Samuel Andreyev","start":1612.26,"end":1639.03,"speaker":"Jonathan Pageau","text":"Yeah, yeah, I can see how that would be. Well, I can see how that would affect the way in which we perceive music and also the way, I guess, imagine how a composer has to face. Can't ignore this reality, let's say, and has to somehow manage it or deal with it or embrace it somehow. So maybe you can tell us about what your strategy has been to kind of navigating through this ocean of possibility."}
{"episode_id":"SW - #017 - 2018-09-26 - Patterns And Meaning In Music - With Samuel Andreyev","start":1640.07,"end":1664.15,"speaker":"Samuel Andreyev","text":"Well, okay, so the first thing I'd say about that is that not everything will manifest itself to you as being either interesting or meaningful. In fact, the vast majority of it won't. And then the other thing is that even though theoretically I can listen to anything I want to, in practice, I don't. Right. In practice, I tend to listen to the things that are closest to me and that have the most."}
{"episode_id":"SW - #017 - 2018-09-26 - Patterns And Meaning In Music - With Samuel Andreyev","start":1664.15,"end":1677.16,"speaker":"Jonathan Pageau","text":"Even in terms of sonority, like in terms of what you grew up listening to or that that has formed your ear. Right. You can't. You can't become Chinese all of a sudden and hear the way a Chinese person hears. It's not going to happen."}
{"episode_id":"SW - #017 - 2018-09-26 - Patterns And Meaning In Music - With Samuel Andreyev","start":1677.56,"end":1693,"speaker":"Samuel Andreyev","text":"Absolutely, absolutely. So there is. There is a cohesion to cultural identity that's stronger than I think we realize. And we do have certain habits of listening that are relatively universally practiced in the West, I would say."}
{"episode_id":"SW - #017 - 2018-09-26 - Patterns And Meaning In Music - With Samuel Andreyev","start":1693.24,"end":1693.72,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #017 - 2018-09-26 - Patterns And Meaning In Music - With Samuel Andreyev","start":1693.72,"end":1745.59,"speaker":"Samuel Andreyev","text":"And I think that there are. Nevertheless, despite the apparent chaos of different styles being practiced today, I think that some of these styles have actually more in common than we might think. And then the other thing is, people are strongly conditioned by what we call taste. Now, taste is actually not a very precise or a very meaningful term as far as I'm concerned. I'm not actually altogether sure what it means exactly. It tends to mean the things that people sort of cultivate an interest in and enjoy listening to. But I think it might actually go a little bit deeper than that. I think that music is just an incredibly fascinating phenomenon because you can't really access the profound inner core of a piece of music in a certain sense. I'm not even sure that the composer who creates it can do that."}
{"episode_id":"SW - #017 - 2018-09-26 - Patterns And Meaning In Music - With Samuel Andreyev","start":1745.99,"end":1746.39,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #017 - 2018-09-26 - Patterns And Meaning In Music - With Samuel Andreyev","start":1746.55,"end":1791.77,"speaker":"Samuel Andreyev","text":"You know, so the piece actually exists, and this is something I talked about with Jordan Peterson in the discussion we did on YouTube. The piece actually exists somewhere between the listener and the piece itself. In other words, the meaning of the piece is not located entirely in the piece itself. It's somewhere in between, which is a very interesting thing. So you have a certain set of perceptual filters on and a certain perception that governs what will manifest itself to you as being meaningful and interesting. And I'm not sure how much you can really do about that. You know, you can cultivate openness and you can cultivate a sense of curiosity and so on, but there may be limits to that."}
{"episode_id":"SW - #017 - 2018-09-26 - Patterns And Meaning In Music - With Samuel Andreyev","start":1792.41,"end":1792.89,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #017 - 2018-09-26 - Patterns And Meaning In Music - With Samuel Andreyev","start":1792.89,"end":1793.37,"speaker":"Samuel Andreyev","text":"You know."}
{"episode_id":"SW - #017 - 2018-09-26 - Patterns And Meaning In Music - With Samuel Andreyev","start":1793.37,"end":1793.77,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #017 - 2018-09-26 - Patterns And Meaning In Music - With Samuel Andreyev","start":1793.77,"end":1802.97,"speaker":"Samuel Andreyev","text":"You might just be incapable, literally incapable of perceiving the meaning in something, because your perceptual faculties are not set up that way. You simply won't see it."}
{"episode_id":"SW - #017 - 2018-09-26 - Patterns And Meaning In Music - With Samuel Andreyev","start":1803.53,"end":1874.08,"speaker":"Jonathan Pageau","text":"Right. Well, I mean, I think if you take the languages as a. As an analogy to that, I mean, you can. If I listen, I always use this example, like, because I know French and English, so if I hear some Spanish, I'll understand something of it. If I hear some German, I'll understand something of it. If I hear Russian, I won't understand the words, but I can follow the tonalities. I can understand the intentions. But when I hear Mandarin, I hear. I understand nothing. I just hear noise because I just. It's so far away from my perceptual capacity that it just. It just. I don't hear it. I just. I just. I can't see the structure in it. Like, I can't hear the structure that's there in those sounds. So I imagine it's this. It's similar for music as well. I mean, I know that, for example, for myself, when I listen. When I listen to modern composers, I really struggle to listen, to hear any structure. I really do end up hearing structure, what seems to me like a cacophony of chaotic sounds. Now, I've spoken to music theorists, and I'm sure maybe you'll tell me the same is that. No, there is usually structure in all the pieces that you hear. Although for me, anyways, for myself, it's very difficult to hear it."}
{"episode_id":"SW - #017 - 2018-09-26 - Patterns And Meaning In Music - With Samuel Andreyev","start":1874.88,"end":1891.75,"speaker":"Samuel Andreyev","text":"Yeah. Okay, so that's a really important point. So let's talk about that. I want to go back a bit and talk about Bach for a few minutes because I'm really preoccupied with Bach. I think he's. Well, I don't even need to say anything about how important he is, because it's kind of obvious."}
{"episode_id":"SW - #017 - 2018-09-26 - Patterns And Meaning In Music - With Samuel Andreyev","start":1891.75,"end":1907.11,"speaker":"Jonathan Pageau","text":"But it's just the only fact that if you ask anybody on the street what they think classical music is, they're probably thinking of Bach. They have a piece by Bach in their mind. Or maybe, you know, maybe Mozart, but probably Bach."}
{"episode_id":"SW - #017 - 2018-09-26 - Patterns And Meaning In Music - With Samuel Andreyev","start":1907.67,"end":1940.03,"speaker":"Samuel Andreyev","text":"I think Bach is absolutely central. And one interesting thing, I think, is that the general public, if you can use such a term, because I don't even know that there is such a thing as the. The general public. There's actually a mass of individuals that all have astonishingly varied listening habits, actually. But I would say that the vast majority of his production is not very well known. You know, what we actually listen to by bach is maybe 5% or less of his production. And he spent, you know, the bulk of his career writing essentially, liturgical music."}
{"episode_id":"SW - #017 - 2018-09-26 - Patterns And Meaning In Music - With Samuel Andreyev","start":1940.51,"end":1940.99,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #017 - 2018-09-26 - Patterns And Meaning In Music - With Samuel Andreyev","start":1941.31,"end":2009.08,"speaker":"Samuel Andreyev","text":"And it's astonishingly amazing music. And the bulk of that, actually, he wrote in the 1720s when he was living in Leipzig. So the reason I brought up Bach is that if you were attending the church that he was the cantor of in the 1720s in Leipzig, then the songs that he was basing his compositions on, because he would always close with a chorale, and the chorales were composed by Luther. Right. So those would have been familiar to everybody in his congregation. They would have been. I don't know if you can say they were the popular music of his day. Exactly, but they were certainly. They were commonly understood and known, and their significance was immediately understood, the texts were immediately understood, and so on. And that would be woven into every aspect of the composition. And in addition to that, Bach used all sorts of stylistic and rhetorical devices that were also commonly understood by everybody who would have been attending those services at the time."}
{"episode_id":"SW - #017 - 2018-09-26 - Patterns And Meaning In Music - With Samuel Andreyev","start":2009.64,"end":2011.64,"speaker":"Jonathan Pageau","text":"You mean in the text or in the music itself?"}
{"episode_id":"SW - #017 - 2018-09-26 - Patterns And Meaning In Music - With Samuel Andreyev","start":2012.12,"end":2017.17,"speaker":"Samuel Andreyev","text":"Oh, both. But I suppose I'm referring more to the music. So in other words."}
{"episode_id":"SW - #017 - 2018-09-26 - Patterns And Meaning In Music - With Samuel Andreyev","start":2017.33,"end":2026.05,"speaker":"Jonathan Pageau","text":"So I don't know what that would mean, a rhetorical. What would be a rhetorical style in music? I don't know what that refer. I know what rhetoric is in speech, but what would that be in music?"}
{"episode_id":"SW - #017 - 2018-09-26 - Patterns And Meaning In Music - With Samuel Andreyev","start":2026.85,"end":2053.03,"speaker":"Samuel Andreyev","text":"Well, I think that it's difficult to speak of a symbol, per se in music, because there's very little in music that is stable enough and simple and direct enough to have the value of a symbol. But you can speak of rhetoric, and rhetoric is basically a device that you use or a figure that you use in a piece of music that has a certain function that is. That is commonly understood. It means something specific."}
{"episode_id":"SW - #017 - 2018-09-26 - Patterns And Meaning In Music - With Samuel Andreyev","start":2053.75,"end":2054.19,"speaker":"Jonathan Pageau","text":"Okay."}
{"episode_id":"SW - #017 - 2018-09-26 - Patterns And Meaning In Music - With Samuel Andreyev","start":2054.19,"end":2061.35,"speaker":"Samuel Andreyev","text":"It points to something. Let's put it that way. So it's. It's a way of saying something that has. That carries with it a certain meaning. So."}
{"episode_id":"SW - #017 - 2018-09-26 - Patterns And Meaning In Music - With Samuel Andreyev","start":2061.43,"end":2087.46,"speaker":"Jonathan Pageau","text":"So we would have those in. In you. In movies soundtracks, for example, because it seems like there's some tropes in movie soundtracks. You know, if someone's, you know, running up a hill, it seems like it's just always similar music. And if someone's falling down, then it's another kind of music. And if it's dark and dreary, then. So we have all these tropes that we immediately can associate with images. So is that the type of thing you're talking about in terms of rhetorical structures?"}
{"episode_id":"SW - #017 - 2018-09-26 - Patterns And Meaning In Music - With Samuel Andreyev","start":2087.46,"end":2258.06,"speaker":"Samuel Andreyev","text":"Let's say that's it. That's it. Exactly. So if Bach's setting a cantata and the text is hot tears were streaming down his cheeks, there would be a certain type of music that went with that. And you'd have something very chromatic and very complicated to go along with it to indicate suffering. There are devices that Bach uses that symbolize separation from God, and there are rhetorical devices that symbolize a proximity to the earth, preoccupation with earthly matters. And there are cantatas that literally move from one to the other, and there's a dialectic between the two. And in something as simple as a chorale. So where Bach is taking a popular hymn tune composed by Luther and setting it in four parts, something as simple as that, it'll be actually Loaded with all sorts of very sophisticated references to what's going on in the text, but sort of illustrating it musically. And if we're listening to it today without knowing anything, without understanding German, without knowing anything of the period, without knowing anything about the stylistic and rhetorical devices that were being used in that music at the time. Now, I'm not saying that we won't be able to enjoy it, because obviously that's not true, but I would say that a very significant percentage of what is actually significant in that music will completely go beyond that listener, because they're not embedded in that culture, simply because you're not. It's not 1722, and you're not in Leipzig, right? So now you can cultivate a knowledge of those things, and you can. You can. You can listen more carefully and you can read the texts and you can read a little bit about the period, and you can certainly come to understand it. And it's not, you know, it's not. It's. It's not even that challenging to understand, I would say, if you. If you put the. The time and the effort in. But. But you do need to approach it in that manner as though you are looking at something that you might not intuitively be able to access. Whereas the music, the popular music of today, is interesting because it's made in order to be instantly understandable by everybody. And that can function because we are embedded in that culture and when we're surrounded by it, and so we don't have to think, we don't have to interpret those. Those things. With something like Bach and his music is often referred to as being universal in some manner, which is an interesting claim. I'm not sure, actually, that it is universal to the extent that you do actually need to make an effort to go back and understand the period a little bit if you want to extract out a larger amount of the meaning and the significance that that is contained within the music."}
{"episode_id":"SW - #017 - 2018-09-26 - Patterns And Meaning In Music - With Samuel Andreyev","start":2258.46,"end":2390.18,"speaker":"Jonathan Pageau","text":"One of my kind of basic theories about art has been that we talked about this dialectic. One of my theories has been that the dialectic of art has increased, let's say, from the Renaissance, but more and more, faster and faster, let's say, into the modern age. And the dialectic, you can see it in the art with these opposing movements that come to fight each other, and then one wins over the other. And there's this speeding up until, let's say, until World War I, at least. But one of the aspects of the dialect that I've seen is also in this notion of the high Art and the low art, let's say, because there seems to be, at least now, today, there seems to be a total rip apart between what you would call, let's say art music and what we commonly call pop music. The. You know, the. Let's say, if you. If you take in the time of Bach or in the Middle Ages, the basic cultural music would have been the liturgy, let's say that would have been the thing that would have been a musical language that would have united, you know, let's say all of society, from the king to the peasant. And then after that, then maybe you would have had, you know, folk music and dance music for the masses. And then maybe, you know, you might have had more elite music or. Or more complex music for the elites. But there was still that place where things kind of got together. And one of my theories has been that there is no longer that place where the meeting happens. And so we have extremely elitist music that a very select few people listen to. And then you have this kind of very drudgy pop music that is in a way very accessible, but is also kind of like beating shovels of sugar. Like it doesn't. Has no sustenance. And maybe I'd like you to comment on that, but also comment on the fact that one of the things I've seen on your YouTube channel, which is interesting, is that you seem to want. One of the things you seem to want to do is to find places of contact between those two worlds and to show how maybe some bridges can exist between those two worlds. So that's a really complex question. So I'll let you go from there."}
{"episode_id":"SW - #017 - 2018-09-26 - Patterns And Meaning In Music - With Samuel Andreyev","start":2390.42,"end":2454.35,"speaker":"Samuel Andreyev","text":"That's a desperately important problem, I think, and it's something that we can't survive very much longer without finding some kind of an approach to. So I think there's one thing that I'd like to say about that, which is that we often confuse the terms popular and the term commercial. It's not the same thing. Right. So commercial art and commercial culture is not the same thing as popular art and popular culture. And so in other words, you can have a piece of art that is grounded in some form of vernacular expression, but that is not mass marketed, and that is not intended to be mass marketed. Right. And that is, in fact, only really appreciated by a relatively small number of people. And then you can have mass market art and massively. What would you say? Art that sort of massively saturates the culture that isn't necessarily grounded in anything particularly vernacular or popular."}
{"episode_id":"SW - #017 - 2018-09-26 - Patterns And Meaning In Music - With Samuel Andreyev","start":2454.91,"end":2462.59,"speaker":"Jonathan Pageau","text":"Right. Okay, so maybe give me an example of the second one. Because the second. The first one. Yeah, I understand. Second one is vaguer to me."}
{"episode_id":"SW - #017 - 2018-09-26 - Patterns And Meaning In Music - With Samuel Andreyev","start":2464.11,"end":2487.48,"speaker":"Samuel Andreyev","text":"Well, let's see. I suppose it really depends on where you draw the line. In terms of what constitutes massive saturation. But I think that you could take something like a lot of art that was produced in the interwar period and also in the. After the Second World War. So take surrealism, for example. It's a very interesting thing. It actually had a profound impact on popular culture."}
{"episode_id":"SW - #017 - 2018-09-26 - Patterns And Meaning In Music - With Samuel Andreyev","start":2487.72,"end":2488.12,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #017 - 2018-09-26 - Patterns And Meaning In Music - With Samuel Andreyev","start":2489.4,"end":2504.92,"speaker":"Samuel Andreyev","text":"That's not a vernacular art by any means. But you had Salvador Dali, you know, working with Walt Disney at one point. I mean, it was so. And I think that the ideas that were contained within surrealism. Certainly had a massive effect on the popular culture."}
{"episode_id":"SW - #017 - 2018-09-26 - Patterns And Meaning In Music - With Samuel Andreyev","start":2504.92,"end":2520.4,"speaker":"Jonathan Pageau","text":"Yeah, I think surrealism definitely won the fight between the different movements at the beginning of the century. Surrealism definitely won. Even until today, the way people perceive art. They think that something that is creative is something that is like a Salvador Dali painting, basically."}
{"episode_id":"SW - #017 - 2018-09-26 - Patterns And Meaning In Music - With Samuel Andreyev","start":2520.64,"end":2611,"speaker":"Samuel Andreyev","text":"Right, right, right, exactly. Yeah. So I believe profoundly that art needs to be grounded in some form of vernacular express. I think that's. I think that's absolutely essential. And the farther that you get from that, I think that it tends to. It wilts and it loses meaning and it loses power. So when I say vernacular, I mean. I mean the everyday. I mean things that are just in our immediate environment. That doesn't mean writing pop music necessarily, but it means something that is immediately manifest in our everyday lives. And I do believe that very strongly. But it's not, unfortunately, as straightforward as that as I would like it to be, for all sorts of reasons. I mean, the one thing that I think is. Is making it extremely challenging is the fact that you can't really. You can't really have vernacular art on a global scale, if you see what I mean. Because vernacular practices tend to be locally based. And they tend to be located within, you know, populations of people that are small enough that there is some kind of possible interaction between them. And I think that as societies get more and more complex and more globalized. And you have people traveling all over the place and instantaneous transmission of information. It's not clear to me exactly how you could create a vernacular art in that sort of environment. Although it's not impossible. I'd be interested to know your thoughts on that, actually."}
{"episode_id":"SW - #017 - 2018-09-26 - Patterns And Meaning In Music - With Samuel Andreyev","start":2611.4,"end":2763.04,"speaker":"Jonathan Pageau","text":"Well, I mean, I think that in terms of stories. I think that in terms of stories and in terms of image, it seems like there are universals that kind of cross through the different patterns, let's say. And so, for me, it's hard, like I said, to talk about music. But for sure, in stories, when you back away and you look at fairy tales and you look at, let's say, myths, and then you look at stories in the Bible, you really find these patterns that cross through. And so I think that can become the base of even an art that exists today. And the same thing in an image, let's say, because the image can be an image of the cosmos. And so let's say really basic things that we don't think about today, but the fact that the ground is down and the sky is above and, you know, someone lying down has a certain connotation. And someone standing up has a certain connotation with their head closer to heaven and their feet on the ground. Because it's not obvious that in your everyday life when you're going through your house, that you have that kind of clear analogy, let's say, between a person standing against the background and that being a kind of vertical against heaven and earth. But in an image, let's say, in a traditional image, you'll see that. You'll see that as much in an icon as you'll see it in a Buddhist image, or you'll see it in an Indian painting or a Persian miniature. And so there are these patterns that can exist, but like you said, they're grounded in the vernacular in the sense that they're grounded in the kind of universal extra experience of being a human being. So that's. Maybe that's how. Why, like I kind of proposed at the beginning, this idea of the voice as being a stabilizer, let's say, or like a ground that we all can. We hear. Because when I listen, like, when I listen to some. To contemporary composers, for sure, like, if I listen to Stockhausen, I hear such a range of sounds that are so extreme that I really feel like I'm being ripped pulled apart because. And I think. I don't know if that's true, but I think it's because they're so far away from the human voice that I. That I don't recognize myself in them. But I'm not sure that's what it is because it's very intuitive. So maybe. Yeah, you can say some things about that."}
{"episode_id":"SW - #017 - 2018-09-26 - Patterns And Meaning In Music - With Samuel Andreyev","start":2764.24,"end":3049.79,"speaker":"Samuel Andreyev","text":"Yeah. Well, we talked earlier about some of the different rhetorical devices that. That are used in Bach, and I was referring to the cantatas when I was talking about that. But an interesting thing is that if you look at his instrumental works, you find approximately the same level of referentiality and rhetorical devices and sort of implicit meaning in things. So it's actually very difficult to find anything that isn't. It's very difficult to find anything neutral in that music. That doesn't have some kind of implicit meaning implicit in it. And so if you take a fugue, for example. And the fugues are always held to be, in some manner, the most sort of abstract of the musical genres, I suppose, because. Well, actually, I don't know actually why that is. Perhaps it's because a fugue isn't a particularly directional form. And it's a contrapuntal form. And you have four different voices that are engaging in a dialogue of some kind. But even in something like a fugue, if you take, you know, one that was written by Bach, he uses dance figures in them. You know, the art of the fugue is supposed to be the apex of musical complexity and abstraction. But it's all based on dance rhythms. And if you pull them apart, even, you know, even farther, you find that there are all sorts of little gestures that refer to. Certainly the idea of an ascending line. Is the idea of moving closer towards the heavens. There's no question that there are things that refer to phenomena of stability and mobility and foreignness and being at home and so on and so forth. And so I was reflecting on this, and I was reflecting on, certainly the situation of contemporary music. And trying to understand these things for myself in terms of where we might be today. And to what extent these sorts of devices might still be able to carry meaning today. And that led me to focus on the question of what music, in fact is. And that turns out to not be a terribly easy question to answer, right? Because there's always going to be someone somewhere who's going to say, that's not music, or whatever. But I think that in terms of what tends to have the most meaning for the broadest number of people. There are certain things about music that, it seems to me are irreducible, regardless of culture, regardless of time period, regardless of whatever. So the first thing is that fundamentally, I believe music is about movement. So that can be concrete movement in the form of a dance. Or it can be highly abstract movement. But you have to have the idea of displacement, of we're here and now we're going here. There has to be some form of movement. And obviously, movement can only exist within the dimension of time. So you have movement which happens in time. And the vehicle for that displacement is sound. And that's about it. And I can't get too much more specific than that without shutting out entire avenues of musical inquiry. But I think that this idea of movement somehow being the core of the musical experience, really interesting. Why would that be so important? You know, what is it about that that drives people to states of ecstasy or to complete obsession? Because that's ultimately. I think that's really what it is. So different types of music, different genres of music affect different types of movement. So some of them are very regular and pattern oriented and predictable in the sense that there's a recursion of a limited number of figures. So baroque music is highly repetitive from a rhythmic point of view. I think that's one of the reasons why it's so popular right now in the west. And it has been actually since the 1970s, which was sort of also the dawn of disco. So that's kind of an interesting coincidence. But baroque music has a very strongly rhythmic aspect to it. And it's based on this of motor like rhythm that's very regular in a certain sense. And there are other types of music that. That use movements that are much less predictable. There's still types of movement, but they're not necessarily pattern based. Or rather the patterns might be so complex that you can't perceive them. You can't, you can't. Well, let's say you can't perceive them directly. It doesn't mean that. Because you can, you can perceive something obliquely. Right. So you, in other words, you. You encounter a surface quality of something that was generated by a structure that you are not able to perceive."}
{"episode_id":"SW - #017 - 2018-09-26 - Patterns And Meaning In Music - With Samuel Andreyev","start":3050.19,"end":3050.75,"speaker":"Jonathan Pageau","text":"Mm."}
{"episode_id":"SW - #017 - 2018-09-26 - Patterns And Meaning In Music - With Samuel Andreyev","start":3050.99,"end":3055.79,"speaker":"Samuel Andreyev","text":"So the structure is still operating on your perception. You just can't put a name to it."}
{"episode_id":"SW - #017 - 2018-09-26 - Patterns And Meaning In Music - With Samuel Andreyev","start":3056.11,"end":3056.59,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #017 - 2018-09-26 - Patterns And Meaning In Music - With Samuel Andreyev","start":3056.75,"end":3057.15,"speaker":"Samuel Andreyev","text":"So."}
{"episode_id":"SW - #017 - 2018-09-26 - Patterns And Meaning In Music - With Samuel Andreyev","start":3058.03,"end":3263.11,"speaker":"Jonathan Pageau","text":"Well, one of the things that I've been. Maybe I can bring in a little bit of the. My dealing with contemporary art. And because I think a lot of the questions that you're asking and that are being asked in music were questions that are there in contemporary art because the sky's the limit. Anything can happen, anything can be done. And then all these different movements kind of split apart and things go in all their directions. And then the question of what is art? Is asked again and again and again. What is painting? Is painting dead? All these questions. And it seems like for me, when we talked about the notion of grounding in vernacular, I think that my kind of solution in life has been to find this ground in the sense that it might be easier for me because I'm making objects. And so for me to make an object which will have a function, like an actual practical function in someone's life. To me, has been kind of the discovery of how to solve, let's say, the big question of art. Because I don't have to ask that question. I make an icon. You know, it's as if I'm making a chair. It's like, why are you making a chair? I'm making a chair so someone can sit in it. It's very clear. And I fulfill a real need that a person has. Now, of course, making icons is different from making chairs because in the icon there is this whole language of pattern and of image and of color, which reaches into the highly abstract and the very spiritual. And so the solution of kind of going back into, let's say, the pre Renaissance world, going back into the medieval mindset, has been for me to find this solution where there's a ground. The icon is attached to a tradition, to a culture. Someone puts it in their house, they live with it, they pray before it, and so it participates in the light. But at the same time, I can play the same. I can ask myself the aesthetic questions and the questions of form and of composition that someone would have asked themselves in a painting. But I never have to ask myself, like, what is art? I don't care what art is. I know what I'm doing. I'm making this image for this person or for this church to participate in their life and in their liturgy. And so, I mean, some people might say that it's a cop out. It's possible, but at least for myself, it's been like this grounding of the art form. And at the same time, we're reaching towards the transcendent. And so. Yeah, so maybe you can offer some thoughts about that in terms of. Because I know some composers personally that have kind of taken that route. Like, I'm in part of the journal that I edit, we have one of our contributors. His name is Ivan Moody, Father Ivan Moody. He's a composer who lives in Portugal, and he both makes contemporary music, but also creates liturgical music for churches. And so he has that kind of grounding in liturgical music and then uses liturgical music as a base to explore, maybe more concert type music, but always comes back to his kind of. And the fact that he is actually a priest grounds his life and his actions in that world. So, yeah, so I'll let you give your thoughts on that."}
{"episode_id":"SW - #017 - 2018-09-26 - Patterns And Meaning In Music - With Samuel Andreyev","start":3263.83,"end":3527.11,"speaker":"Samuel Andreyev","text":"Okay, so a couple of things. The first is you talked about the situation of contemporary artists in the sense that anything goes, and there is such a wealth of different practices that are not only permitted, but also that have some kind of critical discourse. Around them, so that there's kind of a. There's a kind of a pre existing slot that they can kind of fit their work into. And it's just a matter of choosing what particular slot you want to aim for, I think. And I suppose that's true to a certain, to a certain extent, but I would say that it's very difficult to manufacture the quality of meaningfulness. And I think that if that is not somehow strongly present in your work, and if that's not the quality that you're, that you're aiming for somehow, then you can, you know, do all of the stylistic investigations that you want to, but you'll be producing essentially a meaningless object. And the thing about meaningless objects is it's very easy to produce them and they have basically little, little value, right? They might, they might have a temporary transactional value in the sense that they might fit into something that is perceived as having a cultural value in a given time, but that value might not be very long lasting. So one of the things that I'm always having to get back to when I talk to people about contemporary music, and certainly I've made this point a few times in my YouTube channel, is that the vast majority of it is things that I would not want to hear twice, and some of it I wouldn't even want to hear once. So I'm sympathetic with listeners who have that question when they come to it. And I think that that's partly just a question of perspective, I think. So if you were living in the 1740s, for example, and just attending any random concert of broke music, the odds would be very low that you would. You would chance upon a timeless masterpiece, right? You would, you would probably be hearing the work of a third rate composer played rather badly. That's what you would. That that would be the average experience that you would be having, if indeed you were even lucky enough to be in a position to be able to hear music at all. So the question of perspective, I think is crucially important because when we look upon the art of previous times, obviously there's been an entire critical apparatus that's been brought to bear upon that art, and we've sifted through it and we've decided as a species, as a population, this is something that has enough significance that we actually want to spend our precious time looking at it, interpreting it and preserving it across, across multiple generations. And the fact that that ever happens, I think is almost miraculous. You know, the fact that you have objects that are thousands of years old that are preserved in museums that. That people actually take the time to interpret and understand and preserve. It's amazing. I think that that says something extraordinary about. About human nature, actually. But so that's a process that takes a very long time to come about. And so when we think about Byzantine art or classical art or whatever, or Romantic art, we're seeing it through the lens of today and through the lens of everything that's been done to it and also through the filter of all the art that's been lost forever and that we'll never get to see and the objects that sometimes, for completely coincidental reasons, although obviously not always, have been handed down to us. So we're seeing fragments of a past and we're reconstituting it and we're trying to understand it from the vantage point of today. And when you approach contemporary art and contemporary music and contemporary culture, you don't have that perspective. You are in a sea of noise. It's potentially unlimitless, unlimited. Right. So there must be. I'll hazard a guess that there are 20,000 active composers in France alone today. Imagine each of them makes 10 pieces a year. You know, you can. It's. You can't keep up with it. And even if you could, you wouldn't want to."}
{"episode_id":"SW - #017 - 2018-09-26 - Patterns And Meaning In Music - With Samuel Andreyev","start":3527.35,"end":3527.75,"speaker":"Jonathan Pageau","text":"No."}
{"episode_id":"SW - #017 - 2018-09-26 - Patterns And Meaning In Music - With Samuel Andreyev","start":3527.75,"end":3582.33,"speaker":"Samuel Andreyev","text":"You know, so it's very difficult for somebody who's speaking in general terms about contemporary music and is sort of trying to wade through it without already having some kind of idea in place about what's being done and what some of the categories of investigation are and what some of the different types of music are that have been done. Because the odds are you're going to be confronted with all sorts of music that maybe isn't going to be remembered 10 years from now or 50 years from now, and that may have fulfilled a local function, you know, in the career of one artist, where they needed to write a commission or something or they needed to whatever, write a piece for whatever reason. And. And that's the piece that you're left with. And maybe it's. Maybe it's a terrible piece. Maybe it's no good, you know."}
{"episode_id":"SW - #017 - 2018-09-26 - Patterns And Meaning In Music - With Samuel Andreyev","start":3582.33,"end":3582.77,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #017 - 2018-09-26 - Patterns And Meaning In Music - With Samuel Andreyev","start":3582.93,"end":3620.35,"speaker":"Samuel Andreyev","text":"So we don't. We haven't. We haven't experienced that filtering process, that extracting out of the gold from the garbage. And so the listener who's just going to any random sort of contemporary music concert who doesn't have a very broad understanding, I would say, of what some of the. What would you call it, the streams are within that music that would allow you maybe to make more rapid distinctions between what is Good and what isn't good and so on is going to have a really hard time. There's no question. There's no question."}
{"episode_id":"SW - #017 - 2018-09-26 - Patterns And Meaning In Music - With Samuel Andreyev","start":3623.15,"end":3762.29,"speaker":"Jonathan Pageau","text":"One of the things, like maybe one of the differences, it seems also one of the differences that let's say in the past or even in the time of Bach, a piece of music, let's say Bach is writing music. I don't know in terms of Bach, but I know that even maybe before that, art would be commissioned in the sense that someone would ask an artist to make something for a specific purpose. And so you create a piece of music for this event, or you create a poem for this event, like the idea of the knight who asks a poet to write about the battle or something like that. And so let's say the. Even if. Even if the piece itself doesn't survive or doesn't move into history at the point at the time when it was made, it had a participative role in society. Like it. It created a moment for this unitive experience to exist, let's say, whether it's bringing the court together or let's say, I mean, obviously the liturgy seems to me like the most obvious, you know, simple example of that. And so I think, like, my questions keep kind of coming back to the same thing, but it's like, are there places today, are there spaces today where that type of bringing together can happen, let's say. I mean, I gave the example of. I would say, like the example of the music that we hear in movies seems to be one of the places where we experience music. Let's say when you go to the cinema and you experience music as a group, at least you're hundreds of people kind of, you're participating in a story. And it's not people who are there to listen to music. They're not there to listen to music. They're there for a kind of wider experience. But it's still an entertainment. It's entertainment. It's not productive in the sense of, let's say, writing a piece for the coronation of the king or for someone's bar mitzvah or something like that. It's not. It doesn't have that saying. So maybe, I don't know, you feel like there are places today where that unitive possibility still exists."}
{"episode_id":"SW - #017 - 2018-09-26 - Patterns And Meaning In Music - With Samuel Andreyev","start":3762.61,"end":3811.25,"speaker":"Samuel Andreyev","text":"I think it depends on the size of the group. I think that's a really important consideration, because in the 18th century, for example, there would have been what, maybe 100 people maximum at a service like that, and that would have been it. And then those pieces wouldn't have been played necessarily outside of that circle, they wouldn't have been widely circulated. So there were, there were a small number of composers in the, in the Baroque period who had something approaching commercial success where their works were actually published and reproduced and you could buy them and you could play them at home and so on. But that's really something that happens a little bit later in music history for the most part. So the vast majority of this music would have been played once, maybe twice, and then put away and that's it. So. But it was part of it."}
{"episode_id":"SW - #017 - 2018-09-26 - Patterns And Meaning In Music - With Samuel Andreyev","start":3811.25,"end":3835.98,"speaker":"Jonathan Pageau","text":"It seems like we're heading to that same direction with your thousands of composers in France. Like how many times can their pieces be played? Because it. There's a limited amount of space and time for those. I'm sure a lot of them never actually do get played. Right. Because seems like that's not. It seems like that's impossible that it would unless it's done electronically. But for actually musicians to come and play these pieces, it seems like there's not enough concert halls in the, in the, in the country to do it."}
{"episode_id":"SW - #017 - 2018-09-26 - Patterns And Meaning In Music - With Samuel Andreyev","start":3836.14,"end":3893.63,"speaker":"Samuel Andreyev","text":"Oh, for sure, yeah. The vast majority of them are people that nobody's ever going to hear about outside of a very small circle of maybe the composer and their friends and maybe a few people outside of that. But yeah. So the question of the group size is an interesting one because if you use movie music as an example, so that movies are not always, but can be a form of mass culture. Right. In the sense that you have millions of people watching the same movie. So that's. That's an extraordinarily recent phenomenon. The idea that you could produce anything that millions of people would see almost instant, instantaneously after it, after it appears. Right. So using that as the yardstick for what art should do, I think. I'm not implying that you're doing that, but some people do do that. Actually. There are composers who feel frustrated because they know that, for example, a John Williams has an audience in the tens of millions."}
{"episode_id":"SW - #017 - 2018-09-26 - Patterns And Meaning In Music - With Samuel Andreyev","start":3894.43,"end":3894.83,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #017 - 2018-09-26 - Patterns And Meaning In Music - With Samuel Andreyev","start":3896.03,"end":3930.67,"speaker":"Samuel Andreyev","text":"And then they measure themselves against him. And of course there's no contest. There's no way any contemporary composer is going to have anything like that degree of cultural penetration. So of course, if you use that as your yardstick, then you're going to come up short and it's going to appear that what you're doing is hopelessly. I was going to say Rengar. Hopelessly futile and just irrelevant by comparison."}
{"episode_id":"SW - #017 - 2018-09-26 - Patterns And Meaning In Music - With Samuel Andreyev","start":3932.27,"end":4026.26,"speaker":"Jonathan Pageau","text":"I think I'm mostly groping for places where art, not just music, but art in general, can play an anchoring purpose. Because, you know, the ancient word art, like ars in Latin and in Greek techne, actually meant to bring things together. And so the notion was, you know, the artisan or the artist gathers the materia prima and then brings it together so that it becomes like the incarnation of an idea, let's say. But I tend to want to see that in a larger context in the sense that that's also what I think, at least traditionally, what art, the role that art played in a society, that it was there to gather people and to gather communities into a unitive experience or a unitive identity, or also a unitive turning towards the transcendent. So I think that that's really what I'm groping for is to try to see is that possible today? Are there places where, where that can happen? It's also because of my own looking at the world and seeing what seems to me like the utter fragmentation of our culture and the polarization also of the political discourse and the polarization of different segments of society. And so I'm just looking for places where we can, where we as artists can participate in somehow creating community or creating stable ground for people to stand on."}
{"episode_id":"SW - #017 - 2018-09-26 - Patterns And Meaning In Music - With Samuel Andreyev","start":4026.74,"end":4082.75,"speaker":"Samuel Andreyev","text":"Yeah, yeah. I mean, I think that's an open question. I keep coming back to the same point though, which is that it depends really on the size of the community. Because what you're talking about, the idea of bringing people together, you can certainly do that in a smaller scale community. And I think that can work very well and it can give cohesion to the group and it can, can. It can produce something that is of, let's say, obvious utility and meaning to everybody. I think that that's possible on a large scale, on a global scale, which is what a lot of commercially industrially produced art can do. And not all types of art can achieve that level of distribution. It's just not, is not technically feasible, it's not financially feasible. And then you're going to be competing with corporations that have the means to put things in everybody's face and so on."}
{"episode_id":"SW - #017 - 2018-09-26 - Patterns And Meaning In Music - With Samuel Andreyev","start":4083.47,"end":4110.95,"speaker":"Jonathan Pageau","text":"And also a lot of the art that is globally perceived, globally, doesn't necessarily have the purpose of creating unitive experience. On the contrary, maybe the jingle of a product will be the music that it plays over and over in my mind. But its purpose, it's directed towards getting me to desire their product. It's not there to create a unit of experience between people."}
{"episode_id":"SW - #017 - 2018-09-26 - Patterns And Meaning In Music - With Samuel Andreyev","start":4111.27,"end":4156.4,"speaker":"Samuel Andreyev","text":"Right, right, right, exactly. So the other thing that I would say is my perspective might be slightly different on that because I live in Alsace. And Alsace is a very interesting region of France. It's the smallest region of France, and it's rather cohesive. And you can go in pretty much any random village in Alsace, and you'll see the same type of architecture, you'll see the same type of decorative arts, you'll hear the same accent. You'll have. You know, there's an extraordinary cohesion to this society, which is also a kind of an island into itself because, you know, to the east you have. You have the Rhine, and that separates us from Germany. I shouldn't say us, because I'm not Alsatian, but. But I live among, I guess, almost."}
{"episode_id":"SW - #017 - 2018-09-26 - Patterns And Meaning In Music - With Samuel Andreyev","start":4156.8,"end":4157.6,"speaker":"Jonathan Pageau","text":"Almost now."}
{"episode_id":"SW - #017 - 2018-09-26 - Patterns And Meaning In Music - With Samuel Andreyev","start":4158.72,"end":4175.76,"speaker":"Samuel Andreyev","text":"And then. And then to the west you have the Vosges, which sort of separates you from the rest of France. And so it's. It's really this little island of people, and they have their own dialect. And so I don't have the sense, living here that I live in a completely fragmented society that has no center. It doesn't really feel like you need."}
{"episode_id":"SW - #017 - 2018-09-26 - Patterns And Meaning In Music - With Samuel Andreyev","start":4175.76,"end":4177.04,"speaker":"Jonathan Pageau","text":"To come back to Toronto, maybe."}
{"episode_id":"SW - #017 - 2018-09-26 - Patterns And Meaning In Music - With Samuel Andreyev","start":4177.2,"end":4202.57,"speaker":"Samuel Andreyev","text":"Yeah, right. Yeah, in Toronto. In Toronto, I do have that experience. So it's very, very different. But my point is there are parts of the world that I think you could say are highly cohesive, but it's not the case in North America. It's a very strange condition, for sure. And I don't know."}
{"episode_id":"SW - #017 - 2018-09-26 - Patterns And Meaning In Music - With Samuel Andreyev","start":4203.37,"end":4233.98,"speaker":"Jonathan Pageau","text":"And so let's say. Let's take Alsace as an example, since that's where your. You're living and that's. Where do you see, let's say, in terms of music, are there styles of music or composers or people who are in the music world that you feel have been able to kind of tap into Alsace and have been able to create modes of representation or modes of music that are able to create that sense of community or of a unitive experience?"}
{"episode_id":"SW - #017 - 2018-09-26 - Patterns And Meaning In Music - With Samuel Andreyev","start":4235.32,"end":4300.31,"speaker":"Samuel Andreyev","text":"Yeah. I have to say, musically, not so much. No, I haven't really had that experience so much. Although one thing you can say about Alsace is partly because of the German influence. Germans are very good at collective music making. That's actually something that's very, very strong in their culture. And, you know, music, and classical music in particular is just an everyday thing that you do in your home. In Germany, they have a very, very strong culture with that, which isn't so strong in France for the most part, except in Alsace, where you do have that to a certain degree. And that's something that I really do appreciate. There's a great deal of music here, but I wouldn't say that it ties in with the specific local culture in a particularly obvious way. I don't think it does that. I am very interested in folk musics and music that has some kind of a vernacular attachment to the locale. Like, for example, I recently went to Liechtenstein on vacation, which is this beautiful little Alpine state between Switzerland and Austria. And they still do yodeling and they've got alphorns."}
{"episode_id":"SW - #017 - 2018-09-26 - Patterns And Meaning In Music - With Samuel Andreyev","start":4300.39,"end":4300.79,"speaker":"Jonathan Pageau","text":"Wow."}
{"episode_id":"SW - #017 - 2018-09-26 - Patterns And Meaning In Music - With Samuel Andreyev","start":4300.79,"end":4315.15,"speaker":"Samuel Andreyev","text":"And it's so cool. And I'm sure that the kids of these people are just like, mortified beyond belief that their parents are doing this kind of stuff, but, you know, wearing their traditional costumes and so on. But I just think it's the most beautiful thing I've ever seen."}
{"episode_id":"SW - #017 - 2018-09-26 - Patterns And Meaning In Music - With Samuel Andreyev","start":4315.15,"end":4316.12,"speaker":"Jonathan Pageau","text":"Like, wow."}
{"episode_id":"SW - #017 - 2018-09-26 - Patterns And Meaning In Music - With Samuel Andreyev","start":4316.12,"end":4342.16,"speaker":"Samuel Andreyev","text":"Like, it's. It's. It's the reason that that music exists. It's. It's directly tied into the landscape and these wide open spaces and these echoing valleys and so on. And. Yeah, you know, so it's. It's. It's not some. It's not some abstract, arbitrary thing where you're. You're doing something in a certain style because it appeals to you. It's. It's. It's embedded in the very landscape itself that you live within."}
{"episode_id":"SW - #017 - 2018-09-26 - Patterns And Meaning In Music - With Samuel Andreyev","start":4343.91,"end":4438.97,"speaker":"Jonathan Pageau","text":"Well, one of the things that I've heard people, especially my friends that are from Europe and who spend a lot of time in Europe, is that in the countries where they still celebrate, let's say, certain festivals, where they still have. They'll celebrate St. John the Baptist Day, they'll have the bonfires and they'll do St. Nicholas Day, or they'll have those types of celebrations. Seems like where they still have the parades in the street and they still have the costumes and all that, then the folk music is still living because it's really still part of the culture. Like here in Quebec, we have a kind of folk music, but it has become a museum exhibit, let's say, right? We don't have the festivals anymore. We don't have the parades. We just have this folk music. And so we can. You'll have a band that will come and. And they'll do folk music for you. But it won't be as if you're having a New Year's Eve party and your uncle just takes his fiddle out and starts to fiddle and do a rigaudon, as we called it. And so it seems like art. And it almost seems as if people see folk music as something that necessarily has to be dead in the past and something that our ancestors did, rather than something that is part of life. Whereas I have My cousin lives in Switzerland, and he said they still do St. Nicholas, and they still have all the parade and the costumes and these crazy traditions that only these little towns know about. And there the folk music is still living, it seems."}
{"episode_id":"SW - #017 - 2018-09-26 - Patterns And Meaning In Music - With Samuel Andreyev","start":4438.97,"end":4554.98,"speaker":"Samuel Andreyev","text":"Yeah. Oh, absolutely, absolutely. Well, here's an interesting point to consider with regards to that. So one of the contemporary. Well, not contemporary, but one of the modern composers that I like quite a lot is a guy named Morton Feldman. And I've done a. One of the first videos I did, actually was an analysis of one of his pieces. So he was a New Yorker, and He died in 1987, actually. But so he was. He had this really thick, strong New York accent. He was sort of an outrageous guy. And he wrote this very sort of quiet soft music that spoke very, sort of minimalistic and very slow moving and so on. And it was perceived by a lot of people at the time as being rather esoteric and rather strange music. But he had a circle of people around him that completely understood what he was trying to do and really appreciated it and enjoyed it and supported him and performed his music and were enthusiastic about it and wrote about it and talked about it and so on and so forth. And so his response to people who. Who would say to him, you know, your music's getting pretty far out there, he'd say, well, I'm actually writing folk music. I'm writing New York folk music, you know. So in other words, in the circle of which he was the center or in this sort of cultural world that he moved in, this was a kind of vernacular art, you know, so that's. That's kind of an interesting thing. So if you look at it that way, then I suppose you could say that everybody who's not, you know, in that circle or is not familiar with that style of music or is not a friend of the composer or so what. Or whatever, you could. You could say, well, they're being excluded. But you could also say, well, this is. This is his environment. That's. That's the culture that he's living and moving within. And within the boundaries of that culture. You know, he's absolutely central. It's just that it's. It's. It's a. It's a certain culture, you know, it has."}
{"episode_id":"SW - #017 - 2018-09-26 - Patterns And Meaning In Music - With Samuel Andreyev","start":4555.14,"end":4606.96,"speaker":"Jonathan Pageau","text":"That's really interesting because when you. As you're speaking about that, I realized that it seems like that's probably why also, teenagers graft themselves onto a type of music and then create their identity and their group around music. And so you have goths and punks and Whatever hip hop people, and they take on, let's say, almost a uniform, and they kind of become that style. Maybe not so much today, but at least when I was growing up, you had punks and goths and. And people would just take a style of music and create an identity around it. And so it seems like that's an interesting. I hadn't even thought about that. How music, even pop music, can be part of this notion of creating these small identities, even if they are somewhat fragmented and limited, but still it drives people towards this unitive experience. So that's something I had not thought about."}
{"episode_id":"SW - #017 - 2018-09-26 - Patterns And Meaning In Music - With Samuel Andreyev","start":4607.12,"end":4630.71,"speaker":"Samuel Andreyev","text":"Well, I think it's a profound human need to feel that. That you are a part of a community, a larger community, something larger than your individual unit or even your family unit. I think that's just a profound and possibly an eternal human need. And art is one of the means by which we can have that sort of experience. So I think that's something that's extraordinarily important."}
{"episode_id":"SW - #017 - 2018-09-26 - Patterns And Meaning In Music - With Samuel Andreyev","start":4634.15,"end":4654.17,"speaker":"Jonathan Pageau","text":"And so maybe because we've been going for a while now, I'm thinking my last question for you will be, how do you see the future of music? I mean, what do you see coming about? Let's say it's hard because I know we're living in a kind of chaotic time. Or maybe I would say, what do you hope for the future of music? Maybe that's a better question."}
{"episode_id":"SW - #017 - 2018-09-26 - Patterns And Meaning In Music - With Samuel Andreyev","start":4655.37,"end":4854.15,"speaker":"Samuel Andreyev","text":"What do I hope for the future of music? Well, I would hope that for one thing that the. Well, that's, you know, that's actually a very difficult question. That's a very, very difficult question. Because I suppose that one thing that my own hopes have been tied up with is that I personally will get better at making music. Let's put it that way. My hope. It's very difficult for me to have aspirations for music in general outside of my own practice. Right. Because it's too big and it's too complicated and chaotic. I would say that my hope is that I will improve as a musician and that I will be able to make work, works that will last longer than I do, and that in some manner that will have the ability to speak to a lot of different people, regardless of their background. That's the aspiration that I have for myself now. Obviously that's a very selfish sort of aspiration. As far as music itself, I don't think music needs my hopes in particular, because there's no indication that music is a permanent feature of humanity, as far as I can determine, not going away. It's not going away anytime soon. And I find it actually quite heartening that. See, I know a lot of people who come from rather difficult circumstances and who somehow managed to scrape together the money to go to music school or to take some lessons or to travel to a different place, to go to a conservatory or something and made tremendous personal sacrifices in order to do that. And in some cases, I mean, you have to give up everything. You know, I know a lot of people who've left their country and they're not going back. And it's in order to pursue a life in music in a way that they wouldn't be able to do where they're from. So it's like you leave your family, you leave your country, you leave everything that's close to you in order to pursue this. So you have to think hard about why somebody would do that when you could just stay at home and do something else. So obviously, you know, clearly music has a kind of extraordinary intensity and a pull and a force to it that is capable of obsessing people. And I don't. I don't see that. That obsession waning anytime soon, let's put it that way. And I suppose I hope that music will continue to. Let's put it this way. I want it to remain grounded in an awareness of history. I think that's extraordinarily important. One thing that I can say is that there is a somewhat concerning trend that I've seen amongst younger composers where they don't have much of an understanding of art history or. Or of the history of music or anything really, beyond maybe a very narrow range of repertoire that they might be familiar with. My hope is that music can be grounded in practices of the past because you can't start from nothing. It's impossible. What you can do is you think you're starting from nothing, but what you're actually doing is you're unconsciously imitating things but not doing it very well. Yeah, right."}
{"episode_id":"SW - #017 - 2018-09-26 - Patterns And Meaning In Music - With Samuel Andreyev","start":4854.39,"end":4856.15,"speaker":"Jonathan Pageau","text":"So better be aware then."}
{"episode_id":"SW - #017 - 2018-09-26 - Patterns And Meaning In Music - With Samuel Andreyev","start":4856.31,"end":4961.84,"speaker":"Samuel Andreyev","text":"Right, right. So it's much better to be aware of what's being done, have a very developed, profound historical consciousness, I think, and to use that grounding to then. To then explore, that's what I would hope for. Because in order to keep traditions alive, I'm actually very preoccupied by the notion of tradition. And a few people on YouTube have described me as an avant garde composer and so on, which is a label I actually don't like and I don't particularly identify with because I'm intensely preoccupied with the repertoire that exists already. But what I believe is that if you love that repertoire deeply, the way to keep it alive is to add something to it and to do something that it hasn't already done, perhaps because reality is infinitely complex and our perception is infinitely complex. And the number of things that you can perceive and the number of different types of meaning that can manifest to you, I believe is unlimited. And I get up every day and come to my desk and I hear things that just make me want to fall out of my chair. They're so exciting and beautiful and strange and new and interesting. And I hope that experience for everybody. And I hope that we can move forward with a sense of understanding the past of music and the immense cultural treasures that are uniquely ours. That we can. That we can, you know, that we can have, that we can value, and then to move beyond them also and explore new territory. That's what I hope for."}
{"episode_id":"SW - #017 - 2018-09-26 - Patterns And Meaning In Music - With Samuel Andreyev","start":4962.8,"end":4996.2,"speaker":"Jonathan Pageau","text":"All right, well, we'll put the link to your YouTube channel in the description so people will be able to hear some of your compositions and also hear you speak on both, let's say, high art composers, but also you analyze some popular music and so people can explore more of your capacity to analyze music. And so well, it really helped me to think in directions that I hadn't thought about. So I think that, at least for myself, our conversation has been good and productive for me to move forward in my understanding of music. So thanks a lot."}
{"episode_id":"SW - #017 - 2018-09-26 - Patterns And Meaning In Music - With Samuel Andreyev","start":4996.36,"end":4998.28,"speaker":"Samuel Andreyev","text":"Yeah, thank you so much. I really enjoyed it."}
{"episode_id":"SW - #017 - 2018-09-26 - Patterns And Meaning In Music - With Samuel Andreyev","start":4998.68,"end":5016.87,"speaker":"Jonathan Pageau","text":"All right, if you enjoyed this content and our exploration of symbolism, get involved. I'd love to read your comments in the comments section below. Please go ahead and share this on social media to all your friends and also please consider supporting us financially on Patreon. You'll find the link to the Patreon page in the description below."}
