{"episode_id":"SW - #147 - 2021-03-12 - The Dark Knight - How to Be a Hero in an Upside Down World","start":0.72,"end":189.5,"speaker":"Jonathan Pageau","text":"In the movie the Dark Knight by Christopher Nolan, there are many powerfully constructed scenes which are almost mini stories in themselves. As the movie reaches its crescendo, there is a scene where it appears that the Joker's clowns have taken doctors as hostages. Of course, being a Joker ploy, the situation hides a trick and an inversion. The way Batman deals with this situation can help us understand what what it means to be a hero in an upside down world. This is Jonathan Peugeot. Welcome to the symbolic world. The trick being played in the scene is indeed the setup of an upside down threat. Although appearing as aggressors and instigators of chaos, it is in fact the clowns who are taken hostage, gagged under their mask, while the doctors, representatives of goodness, order and healing, are the kidnappers, hoping to ambush the police as they attempt to restore order. The scene Batman has, in an insight that the others don't have. He can see the truth hiding behind appearances. He can perceive that the world is upside down. This is, of course, shown by him having glowing eyes with light representing the insight which he has over the police. So Batman realizes that this situation makes obeying those in authority impossible for the time being. So not only does he disobey the police, but he actively attacks them. He prevents them from harming the clowns, who are in fact, victims in disguise. So by attacking police, he's not only protecting the hostages, but he's actually protecting the police themselves, though we have no way of knowing that at the moment. So without knowing it, the police are in danger of compromising themselves by killing innocent victims. And they're also in danger of being ambushed and killed by by the kidnappers, who are dressed as doctors. But from the perspective of the police, Batman is helping the kidnappers, and so they soon turn their hostility towards him as well. By all appearances, Batman is now their enemy, though secretly he is helping them in many ways. This is one of the best examples that I can call to mind of what I mean when I use the term double inversion and how an upside down world can only be restored to normality by a second inversion. Batman makes himself an enemy of a corrupted order in order to restore a proper one. But for a moment, the moment of transition, this is evident only to Batman Now. This type of social game with the clowns and doctor orchestrated by the Joker is in fact what motivates him. What the Joker wants is to make a point."}
{"episode_id":"SW - #147 - 2021-03-12 - The Dark Knight - How to Be a Hero in an Upside Down World","start":189.74,"end":195.02,"speaker":"Batman","text":"It's not about money, it's about sounding a message."}
{"episode_id":"SW - #147 - 2021-03-12 - The Dark Knight - How to Be a Hero in an Upside Down World","start":195.42,"end":204.62,"speaker":"Jonathan Pageau","text":"He wants to expose the corruption and chaos of the world to Expose the darkness and show that it is in fact the darkness which rules over the."}
{"episode_id":"SW - #147 - 2021-03-12 - The Dark Knight - How to Be a Hero in an Upside Down World","start":204.62,"end":210.94,"speaker":"Batman","text":"Light, upset the established order, and everything becomes chaos."}
{"episode_id":"SW - #147 - 2021-03-12 - The Dark Knight - How to Be a Hero in an Upside Down World","start":211.58,"end":223.82,"speaker":"Jonathan Pageau","text":"The appearance of order and hierarchy are illusions in his vision, a deceptive veneer that can be scratched away to reveal the abyss which truly motivates reality. As he says, when the chips are."}
{"episode_id":"SW - #147 - 2021-03-12 - The Dark Knight - How to Be a Hero in an Upside Down World","start":223.82,"end":230.1,"speaker":"Batman","text":"Down, these civilized people, they'll eat each other."}
{"episode_id":"SW - #147 - 2021-03-12 - The Dark Knight - How to Be a Hero in an Upside Down World","start":230.42,"end":353.93,"speaker":"Jonathan Pageau","text":"He's an evangelical nihilist. That's why he wants to turn Harvey Dent. This is the point of the standoff at the ferry, and it's also the point right here. By duping Batman and the police into killing innocent people. Now, this whole situation is a very dangerous one ethically. I mean, how many people have you met who feel that they have ample reason to break the rules or to act against authority? And how many times has you yourself felt that same self righteousness within yourself? I mean, doesn't every rebel, criminal, tax evader, every an insurgent feel like he has good reason for breaking the rules and acting against the authority? So what makes Batman's action different from the action of some other mere rebel? So the first argument that comes is the most obvious one. He's doing this for others to help the hostages. So this is a good start, but it lacks something. I'm sure Stalin and Robespierre all believed they were acting for the good of others, or better still, the good of even those against whom their actions were immediately directed. Because just like Robespierre, Batman is acting for the good of the police who he is actively attacking. So another angle which can help us understand is that Batman, unlike Stalin or Robespierre, is not trying to gain power for himself or some ideology that he represents. His actions are not meant to make him the mayor or the chief of police. And so it's not a revolution in that sense. He's also not trying to promote some ideology at the expense of those being attacked. But through all of this, it is in my last and most important argument, which lies the secret. What Batman is doing leads to an act of self sacrifice. After attacking the police and becoming their target, he doesn't try to defend himself. In fact, he takes the blame on himself and. And not only for his own sins, but he even tries to carry the sins of Harvey Dent, though ultimately he can't."}
{"episode_id":"SW - #147 - 2021-03-12 - The Dark Knight - How to Be a Hero in an Upside Down World","start":354.89,"end":359.21,"speaker":"Batman","text":"I killed those people. That's what I can be. No, no, you can't."}
{"episode_id":"SW - #147 - 2021-03-12 - The Dark Knight - How to Be a Hero in an Upside Down World","start":359.21,"end":359.81,"speaker":"Jonathan Pageau","text":"You're not."}
{"episode_id":"SW - #147 - 2021-03-12 - The Dark Knight - How to Be a Hero in an Upside Down World","start":359.81,"end":361.61,"speaker":"Batman","text":"I'm whatever Gotham needs me to be."}
{"episode_id":"SW - #147 - 2021-03-12 - The Dark Knight - How to Be a Hero in an Upside Down World","start":362.01,"end":719.1,"speaker":"Jonathan Pageau","text":"So even though he's innocent, Batman submits to the current authority and says that he must be hunted and that the Dogs must be set on him. He carries the consequences of his actions and doesn't attempt to be vindicated. He shows no self righteousness, though you know he would have had every right to call on his innocence to those attacking him. This is what justifies Batman's rebellion. So it's these three elements coming together. Number one, acting to help others. Number two, not acting to gain power for oneself or some ideology. And number three, willing to sacrifice oneself and accept the consequences of our actions. This story shows a surprising parallel with another, more famous anecdote. It's the story of Christ clearing the temple from money changers and animals. So this story has often been used to portray Christ as a kind of revolutionary, but in fact we will see that it is not at all the case that Christ is balancing out all these elements that I mentioned of how to act in an upside down world. So Christ is facing a corrupt structure. The purpose of the temple, which has the highest purpose that one can imagine, has been diverted. A place meant to be the house of God, a place of purity, of hierarchy, and ultimately the center of Jewish society and identity, has been given over to greed and corruption. So we find moral compromise. The but also money changing itself shouldn't happen in the temple. This is a little more complicated to understand. But money changing is the opposite of purity. Money changing is something like the interchangeability of identity, a place of flux where one identity moves into another, where identity is reduced to quantity and where what is inside and what is strange move into each other very easily. So money changing should happen in a market or near the wall of a city, but certainly it has no room in a space meant for hierarchy and purity. The money changer story is also dealing with animality. This idea that animals, the garments of skin, shouldn't be our prime concern on an individual level. The animal part of us should be kept out of the heart, we could say, which is why the story has often been an image of the taming of the strange thoughts and the passions from the inner sanctum of the bodily temple. So Christ purifies the temple, cleans it of impurity, animality and immorality. He is doing this to heal the temple. Just like he cast out demons in the possessed man or disease in the sick. So he's acting to help Israel, and therefore he fulfills the first aspect of the hero in the upside down world that I mentioned. And he's acting to help others. But in doing this, he's also acting in opposition to the corrupt leadership of the temple and possibly the Roman authority. As well, in fact, they think that Christ is doing this in order to claim some authority for himself to become king. But Christ says he's acting in the name of the Father and not for his own glory. He's also not trying to instinct Tutu, install something new. He just wants to restore the proper order that should already have been there. He's acting against the present lower authority in order to restore some higher authority which those currently in power are blind to. And this is also what Batman is doing in the hostage situation. But let's be honest, it's also the claim of many of reformers, many revolutionaries and, and insurgents. Almost all people who take power and oppose current structures claim to do so, to restore a higher, more ancient or pure version of authority, though secretly they also want to claim power for themselves. And so the question of the second rule of not wanting to gain power for oneself or some ideology, is answered by the third, willing to sacrifice oneself and accept the consequences of our actions. The cleansing of the temple is the event which sets in motion the crucifixion of Christ. But when he is arrested, when he is judged by a corrupt system, when he is condemned to die, he does not protest, he does not call upon his followers to fight, and does not attempt to usurp the current structure. He was willing to act against the authorities, to do what was right when these authorities were wrong. But he also accepted the consequence and did not cause a political revolution. By acting this way, Christ was in fact planting a seed. A seed which would grow in secret and would flourish to overturn and transform the Roman Empire, not from without, like an invasion or a revolution, but from within, like a transformation of the heart and the growing of a mighty tree. And this is not just some moralization that I'm trying to do, but is in fact revealing the very structure of reality. We have seen what the revolutions of the modern world have brought about when one sets oneself up in power through revolution and makes you vulnerable to others to do the same to you. And so this leads to succeeding breakdowns and tyrannies which the culture of demand and protest inevitably bring about. So this mode of action, the one exemplified by Christ, and maybe more imperfectly by Batman as well, is the only one which can ultimately produce true transformation. So this lesson is a hard one to accept, nearly impossible, but I think it is nonetheless something to ponder as the world becomes increasingly mad, increasingly corrupt and upside down, and we all wonder what to do as we watch it break apart around us."}
{"episode_id":"SW - #147 - 2021-03-12 - The Dark Knight - How to Be a Hero in an Upside Down World","start":720.96,"end":785.77,"speaker":"Jonathan Pageau","text":"I hope you enjoyed this episode of the Symbolic World. The Symbolic World is edited by Justin Ward and it is based on a series of videos that you can find on my YouTube channel, Jonathan Pedro's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description and so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course leaving a review on itunes. Everybody knows that's the best way to get the podcast out there to get it heard. And if you want to get involved you can also support the podcast financially going to www.thesymbolicworld.com support or else on Patreon Pajot videos as well and on SubscribeStar all those links you can find on my website or in the show description. So thank you and I will see you soon."}
