{"episode_id":"SW - #335 - 2024-04-13 - Justin Brierley - The Next Great Renewal","start":0.16,"end":43.79,"speaker":"Justin Brierley","text":"I mean, and the interesting thing is, you know, I wrote the book, it got published in September 2023, but even since publication, there's been fascinating new examples of this. So Ayan Hercially, who I'm sure you're aware of the story of, who basically wrote that, that viral article for Unheard as a former New Atheist herself who had come from a very, you know, come out of a very fundamentalist Muslim background in the past, just saying, it turns out atheism cannot sustain meaningful life. And I, I've decided to embrace Christianity. And that's just such an interesting example of, I think, the, the thesis of the book kind of happening in real time because it feels like something's changing. You know, secular intelligent thinkers are giving Christianity another look, and I, I find that quite exciting."}
{"episode_id":"SW - #335 - 2024-04-13 - Justin Brierley - The Next Great Renewal","start":55.71,"end":102.72,"speaker":"Jonathan Pageau","text":"This is Jonathan. Welcome to the symbolic world. So, hello everyone. I am very happy to be here with Justin Brierly. Most of you will know his work. You know, for many years he was the host of Unbelievable, and he is now working on a new podcast coming out of a book called the Surprising Rebirth of the Belief in God. And, and it is completely in line with all the things that we've been doing. He's talking to everybody that is around this resurgence of the belief in God, the end of the New Atheist, the, the, the surprising characters that are converting to Christianity or coming close to Christianity. And so, Justin, it's really great to have you with me."}
{"episode_id":"SW - #335 - 2024-04-13 - Justin Brierley - The Next Great Renewal","start":102.72,"end":109.32,"speaker":"Justin Brierley","text":"Oh, thank you. It's an absolute pleasure to be on the show, Jonathan, as a, as a regular listener myself, so, so thanks for having me."}
{"episode_id":"SW - #335 - 2024-04-13 - Justin Brierley - The Next Great Renewal","start":110.53,"end":117.77,"speaker":"Jonathan Pageau","text":"So tell me a bit about this, this, this new project. I mean, it's not that new. It's been going on now for more than a year, I think, or maybe."}
{"episode_id":"SW - #335 - 2024-04-13 - Justin Brierley - The Next Great Renewal","start":117.77,"end":170.11,"speaker":"Justin Brierley","text":"Yeah, well, the, the book itself was published last September, so it's, it is fairly new. And the most recent thing, though is, is a new podcast documentary series that is really based on the book and, and that's been going for just a few months. And that's really a much deeper dive in a way because I get to talk to all kinds of people, feature all kinds of voices, weave it all together with some narration and music and, and really tell the story really of, of calling the Surprising Rebirth of Belief in God. And the subtitle of the book and the podcast is why New Atheism Grew Old and Secular Thinkers Are Considering Christianity Again. And in many ways it's. It, it does come out though, of those, you know, many years, you know, over a decade and a half, hosting Conversations between Christians and atheists on. Unbelievable. And the way that I saw those conversations changing in the last several years and, and that was really what, what prompted the genesis of the book and, and then the podcast."}
{"episode_id":"SW - #335 - 2024-04-13 - Justin Brierley - The Next Great Renewal","start":170.93,"end":187.33,"speaker":"Jonathan Pageau","text":"So tell me a bit about that because, I mean, it's true that in some ways you would be the perfect person to notice the transformation. So maybe help us see what it is that you started to notice and maybe about when you started to see it and what, what was different in the way that the, the atheists and the Christians were engaging with you."}
{"episode_id":"SW - #335 - 2024-04-13 - Justin Brierley - The Next Great Renewal","start":187.33,"end":351.89,"speaker":"Justin Brierley","text":"Yeah, well, I started hosting these conversations on this, this unbelievable show around 2005. This was before we started podcasting. It was just a radio show to begin with, but once we started podcasting, we started to, you know, pick up a lot of listeners, not just Christians, but also non Christians, atheists who were tuning in for these discussions between atheists and Christians that I was hosting. And, and really it was around the time that new atheism was building up ahead of Steam. So it was just around the time Richard Dawkins was publishing the God Delusion. You had a real growth of that kind of online atheist scene in the uk. Not long after we had the atheist Bus campaign where we had buses rolling around London saying, there's probably no God, now stop worrying and enjoy your life. So there was, there was a real kind of dynamic sense in which, you know, this very specific, quite dogmatic form of non belief was presenting itself. And, and that was reflected in the conversations we had. You know, so, so it was often these new atheist type characters who would be coming on opposite Christian apologists to debate the existence of God and whether Christianity was evil and can we trust the Bible? And so, so that was, that was great. Really interesting. I really, you know, cut my teeth in Christian apologetics in those early years and was able to sort of, you know, kind of put together my own sense of how to understand Christianity at an intellectual level at least. But I did notice especially kind of from the sort of, I guess from about 2015 onwards, there just was a kind of noticeable shift in, well, firstly the number of non Christians atheists coming on who were actually disassociating themselves from new atheism, saying, I'm, I'm not a Richard Dawkins kind of atheist. Because, because I think there was almost a sense that it had become a bit shrill and dogmatic and almost quasi religious in itself. And, and also just many more secular folk that I was featuring on the show who were actually a lot more open to the value of Christianity weren't dismissing it as readily as the New Atheists were. And they started to bump into people like Douglas Murray, for instance, who, you know, arguably was very much part of the New Atheist set when he sort of lost his faith in his early 20s. He was, you know, going for lunch regularly with Christopher Hitchens and that sort of thing. But actually, in latter years, I think basically realized I'm, I'm basically bred of Christian stock. I, I don't believe in God necessarily. I'm not a Christian, but he calls himself a Christian atheist. And, and I just started to see more and more people like that coming through who were just recognizing that, that fundamentally atheism cannot provide all the answers for life and that actually we still owe an enormous debt to the cultural and spiritual and moral value that the Christian Christianity has granted the west, essentially."}
{"episode_id":"SW - #335 - 2024-04-13 - Justin Brierley - The Next Great Renewal","start":353.01,"end":402.12,"speaker":"Jonathan Pageau","text":"Wow. And so in 2015, that sounds. That sounds about right to me. And so it's like, you know, it's something that seems to be happening to the culture. And have you seen also the New Atheists also go into certain directions? Because one of the things I've noticed is how the New Atheist, because in some ways there was a weird secret desire for something more that they ended up becoming more and more ideological in their approach, like even more politically motivated, you know, being influenced by, by certain ideologies. I don't know if it's something that you notice happening, like at, at some point when the atheists were no longer just attacking Christianity, when they actually had to now propose a social world, like they had to propose something that we can, we can start to see something else up here. I don't know."}
{"episode_id":"SW - #335 - 2024-04-13 - Justin Brierley - The Next Great Renewal","start":402.28,"end":605.06,"speaker":"Justin Brierley","text":"I totally did. I mean, I was kind of an interested bystander for, for a lot of this, but because of my world did intersect with New Atheism quite, quite frequently, I was often sort of seeing some of these dramas unfold in the New Atheist community. So in, in the book and the podcast, I do go into some detail about the way that internally there was a lot of argument, debate, and a kind of unraveling really, of the movement because of it. So you. It was around, I think, 2011, really, that, that. I think there was this particular moment called, that came to be called Elevator Gate, which really set the tone for the way in which New Atheism would start to unravel. And this was a. An atheist conference happening in Dublin in Ireland. And one of the speakers, Rebecca Watson, who was a sort of online atheist commentator under the name Skeptic, was talking at this conference about the problem that, than the atheist movement had with women, that it was misogynistic, patriarchal, there was a lot of sexism in this kind of very male, white dominated movement. And well, she then had sort of late night drinks with some of the other speakers, which included Richard Dawkins. And on her way to her hotel room, you know, early hours of the morning, she basically got propositioned by one of the attendees of the conference in the, in the elevator. So she wrote about this later on her blog and said, this is the problem with, you know, the atheist movement. Exactly what I was already describing and getting propositioned and so on. Well, that might have been the end of it, except that Richard Dawkins himself weighed in on this, sort of, by posting a very highly sarcastic kind of response blog to Rebecca Watson called Dear Muslima, in which he, you know, very sarcastically compared her, her troubles to a Muslim woman, you know, who's getting her hands cut off, you know, for disobeying her husband or something like that, and just said, you know, but pity your poor American sister who have to put up with people asking them for coffee in an elevator. Well, this just poured gasoline on the whole thing. And suddenly I, I do honestly see elevator gate as the point at which the movement kind of split basically between those on the kind of Rebecca Watson side who, who were very interested in atheism, not just being about a denial of God, but about being for something. So it, it was at this point that people started saying, we need an atheism, plus we need a movement that is also about social justice and feminism and LGBT rights and so on. And then you had the Richard Dawkins kind of crowd who, you know, went very, you know, were not into that at all and said, we just want science and reason and common sense and, you know, an oasis of free thinking. And so the movement really split. And I, I would say it was, it was almost like the culture wars kind of came early in that sense for new atheism. That, that was the thing that, that broke the movement apart. And the kind of arguments that these atheist figures started having within the movement, like, completely dwarfed any arguments they were having with their Christian counterparts because it ended up with a not, you know, atheist conferences being canceled because people weren't prepared to share a stage any longer. So I watched all this from the sidelines and it was just an interesting reminder that, that, yeah, movements kind of come and go and this one very much foundered as soon as it tried to do something more than just be this denial of God. Once it tried to build anything more than that. Suddenly the whole thing just, just fell apart very quickly."}
{"episode_id":"SW - #335 - 2024-04-13 - Justin Brierley - The Next Great Renewal","start":605.7,"end":651.94,"speaker":"Jonathan Pageau","text":"Yeah. And you see it, it's still, it still exists in the online world. Well, you have these people that have made a career as atheists, but you know, it's like they just make video after video after video about how religion is stupid. And you think, okay, like, this is interesting. I mean, it's interesting that that's it. Like, that's your, that's your thing, that's your stick, that's fine. But there's a manner in which, like you said, as soon as you try to propose a mode of unity, then all of a sudden you're in trouble. And if you, and if you're not careful, then you're surprised, you know, with like, what is it? Matt Dillahunty talking about women with penises. And you're like, what happened? How did we get from like Richard Dawkins, biologist, scientist, to basically, you know, all categories are now exploded and we're in a, we're in a weird postmodern."}
{"episode_id":"SW - #335 - 2024-04-13 - Justin Brierley - The Next Great Renewal","start":652.28,"end":714.02,"speaker":"Justin Brierley","text":"And, and I, I think that the interesting thing about it is for me it's, it's kind of meant that the cultural ground has all shifted in the process because people who were formerly happy bedfellows like Dillahunty and Dawkins now are not on speaking terms any longer. You know, Dawkins got, you know, his, his Humanist of the Year award rescinded by the American Humanist association because he's been quite, you know, outspoken on transgender and so on, you know, and, and so you find then this weird sort of changing where actually suddenly secular atheists, kind of more conservative minded folk kind of then seem to sort of form alliances with Christians who maybe are kind of sympathetic to those issues. And you find that the secular atheists who are kind of more on the woke side, kind of suddenly they're kind of more in keeping with their kind of other woke brethren. So it's, it's, it's a kind of, you know, it felt like the, the game changed quite a bit once the culture wars came and just kind of messed up everyone's categories and they real. We're not sure we actually agree with each other on, on anything after all."}
{"episode_id":"SW - #335 - 2024-04-13 - Justin Brierley - The Next Great Renewal","start":714.98,"end":738.07,"speaker":"Jonathan Pageau","text":"And so what it, what to you is the most like when you hear these characters that talk about their, their return to Christianity or they're coming close to Christianity, you know, what is, what is the thing that's most salient to you that, that pops out as, you know, this is what's going on in these transformations because they're happening all at the same time. So it's like, it's not just an individual thing, it's a, there's something happening in the culture."}
{"episode_id":"SW - #335 - 2024-04-13 - Justin Brierley - The Next Great Renewal","start":738.07,"end":879.18,"speaker":"Justin Brierley","text":"Yeah, that's right. I, I think, I think there's, there's a few different things going on. I think one kind of innocent, small part of it, and I think it was just symptomatic in some ways the new Atheist movement kind of coming and rising and falling is, is that generally there is this, you know, meaning crisis in our culture, which, which you and many others have, have pointed out. And, and it's, it's on the basis of the fact that people have lost a story essentially to live in. And the story that materialist secularism offered just ended has just not proved capable of building a flourishing, meaningful life for people. And so what I see is a lot of these secular thinkers now sort of realizing that the atheist project is kind of dead on its feet. And so they're basically just saying, well look, let's, let's look around and see what's here. And oh, hey, it turns out the Christian story has actually provided people that sense of meaning, purpose and identity for millennia and they're just willing to give it a second look in all honesty. And, and it's almost like they had, it's almost like they had to go through some of these folk, I think, a kind of teenage atheist phase almost before they kind of came out on the other side realizing, ah, there are other ways to understand the world than just this kind of very one dimensional, flat science explains everything kind of mode of thinking. And so, yeah, I do draw out the stories of a number of those people, some of whom have kind of cross the line to Christian faith, others who seem to be teetering on the brink of it, others who seem to be just kind of acknowledging its value. But maybe I don't know what it's going to take ultimately for them to kind of cross the line themselves. I mean, and, and the interesting thing is, you know, I wrote the book, it got published in September 2023, but even since publication there's been fascinating new examples of this. So Ayan Hiali, who, I'm sure you're aware of the story of who, you know, basically wrote that, that viral article for Unheard as a former new atheist herself who had come from a very, you know, come out of a very fundamentalist Muslim background in the past, just saying, it turns out atheism cannot sustain a meaningful life. And I, I've decided to embrace Christianity and that's just such an interesting example of, I think, the thesis of the book kind of happening in real time because it feels like something's changing. You know, secular intelligent thinkers are giving Christianity another look. And I find that quite exciting."}
{"episode_id":"SW - #335 - 2024-04-13 - Justin Brierley - The Next Great Renewal","start":879.9,"end":959.91,"speaker":"Jonathan Pageau","text":"Yeah. One of the things that I've noticed is, you know, this is basically experience in my own world, which is the Orthodox Church, you know, in North America. But we are seeing waves of converts. I mean, you know, parishes, some are doubling, tripling, like just massive amounts of, of conversions. But the conversions, they have a certain characteristic which is their intellectual conversions, you know, and it's not, it's not as much the, the, the, the kind of usual, I'm not usual, but the, the story of someone who maybe hit rock bottom, who's been having all these problems and turned to God, you know, and found God in, in their struggle and in their, their suffering. But it's really people that are, you know, university graduated, you know, that are professionals that are, that are thinking, that are reading, that are extremely, that are quite intelligent who are actually dealing with the meaning crisis and that are looking to find meaning. And so that's, to me is very interesting. I don't know if that's something that you've noticed as well in these, in this movement that it doesn't look like early Christianity was slaves and poor people and women and people that had no recourse, basically finding the God of love in this possibility of Christ. And now right now it seems like it's actually an elite that's converting."}
{"episode_id":"SW - #335 - 2024-04-13 - Justin Brierley - The Next Great Renewal","start":960.22,"end":1127.65,"speaker":"Justin Brierley","text":"Yes. Yeah, I think, I think there is something in that. I mean, and another aspect of this is, is arguably that, that it's quite a male dominated sort of, sort of demographic. Now again, I, I think, I think that kind of ties into the fact that, you know, when you look out at the average audience for the people turning up for, for say a Jordan Peterson lecture, it is highly male and it probably is the same David Graphic you've just described. Who are you find a. Converting to Eastern Orthodoxy? And, and there's, I think it's something to do with that, that the idea that people are just coming to the end of their resources. I think Christianity has always appealed in a sense to those who, who obviously find themselves in that place, destitute, you know, dried out and everything else. And in a sense that's always been where Christianity has found its first fruits, if you like, of people who are, who are just desperate for something and they find it in Christ. But I think that the more intellectual sort of ones who've sort of for a good while been able to live on their own resources and kind of assume that they had life figured out at some level, or at least, you know, if they watched enough, read enough God delusion books, they could, they could kind of convince themselves that that life had basically been explained. I just think sometimes it takes something like us collapsing into the tribal culture wars that we're currently facing, or the threat of Putin invading a democratic country, or the rise of AI and everything suddenly, like these kind of tipping point events suddenly I think, kind of remind people A, of their mortality and B, that we haven't got it all figured out. And there's just a sense in which I see a lot. The chickens are coming home to roost, if you like, in the postmodern west and all the Enlightenment stuff that's happened. And it just feels like this is the moment when now it's, as you say, those elites who are suddenly realizing, I don't have this figured out. I, I, I'm, I am, you know, basically depressed. Even though I've got more technology than I could ever dreamed of and more material prosperity than any of my forebears ever had, and yet I'm more unhappy than any of them. It, there's just something about this moment. And again, the male thing, I don't know what your thoughts are on that, Jonathan, but I, I'm just wondering whether that's something to do with the fact that as we've lost that story particularly, it's hit men in a way where they've lost something of their identity, that there's an identity crisis thing going on here. And, and for whatever reason, suddenly when it's presented well, the Christian story suddenly gives people a sense of identity that, that they were probably looking for all along."}
{"episode_id":"SW - #335 - 2024-04-13 - Justin Brierley - The Next Great Renewal","start":1128.45,"end":1201.63,"speaker":"Jonathan Pageau","text":"I think that, I think that's right. I think that, you know, this is annoying to, this is annoying to the secular listener, but there is a way in which the, the man in especially in our cultures is the vector of identity. Right? There's a reason why women would take the name of their husbands there. You know, there's, there's a reason in which the, the idea of the St. Paul presents, the idea of the head and the body, these types of images that is represented in the Christian tradition. And so when there's an attack on identity in general and on vectors of identity, then men will definitely suffer. And we can see that. And there has been a kind of organized attack on masculinity, you know, for the past several decades, you know, the Homer Simpson idiot father and etc. Etc. Like this constant attack on masculinity. And so it seems also that in some ways men are the most difficult position in that regard. In the regard the question of story and identity and purpose and stuff. And so I think you're right that in some ways Christianity, you, you can see a lot of people convert. There isn't just Christianity that's h. That's coming towards us. Right. There's a lot of neopaganism, there's a lot of, of Jim Bro, you know."}
{"episode_id":"SW - #335 - 2024-04-13 - Justin Brierley - The Next Great Renewal","start":1201.63,"end":1281.63,"speaker":"Justin Brierley","text":"Kind of, I mean there's, there's the Andrew Tate school of masculinity that, that's kind of in, in competition with the kind of the biblical kind of form of, of that. So it's, yeah, absolutely. There's, there's other possible routes that this could go and that, that, that is the great danger. And one of, one of the sort of, one of the metaphors I use in the book is, you know, you know, when GK Chesterton said when people, you know, stop believing in God, they don't thereafter believe in nothing, they have the capacity to believe in anything. And I think, and I think if there is something coming back on the tide, you know, if, if, you know, Matthew Arnold's famous Dover beach tide has gone out of faith, if it is coming back in again. Some people have said, well, how do you know it's going to be Christianity that comes back in again? There could be all kinds of other things. And we're obviously seeing that because the religious inclinations never go away. That search for meaning and purpose has to get filled by something. So I guess I'm, I'm sort of, I'm optimistic that it's going to, that ultimately even the Andrew Tate school of, you know, religion will ultimately fail because it, it isn't, it's always going to be a, a weak heresy or parody of, of the Christian thing. But that's, that's, that's in a sense that's me saying that as a Christian, you know, that's something I, I kind of take on faith because I do believe this there's something bigger than us that's, that's ultimately, you know, going on here."}
{"episode_id":"SW - #335 - 2024-04-13 - Justin Brierley - The Next Great Renewal","start":1282.27,"end":1345.47,"speaker":"Jonathan Pageau","text":"Yeah, but I think also that Christ has revealed something about reality that once it's been revealed cannot be taken back. So once you, once you see the, the, the notion that self sacrificial love is the, is the source of our relationship, that it's the source of healthy relationships, the source of, of, of even hierarchies in in the world that that's actually how proper hierarchies functioned is through self sacrificial love. You can't really take that back and you can try, but it, it ends up being, like you said, a kind of caricature. There's something Antichrist about the reaction to it. There's no way, there's no way to really fully escape now from that story. You know, that's one of the reasons why I try to help people understand, I try to help people understand that it's like you're in the Christian story, folks. You can't, you can't avoid it anymore. If you try to get out of it, you own, the only thing you can do is become Antichrist. And, and it's not like a moral thing that I'm not trying to guilt you into anything. I'm just saying it's just how, it's just how it is. Once you, there are some things that once, you know, you can't unknow anymore."}
{"episode_id":"SW - #335 - 2024-04-13 - Justin Brierley - The Next Great Renewal","start":1345.47,"end":1347.91,"speaker":"Justin Brierley","text":"It's like the genie is out of the bottle. You can't."}
{"episode_id":"SW - #335 - 2024-04-13 - Justin Brierley - The Next Great Renewal","start":1348.31,"end":1348.87,"speaker":"Jonathan Pageau","text":"Exactly."}
{"episode_id":"SW - #335 - 2024-04-13 - Justin Brierley - The Next Great Renewal","start":1348.87,"end":1350.71,"speaker":"Justin Brierley","text":"Yeah, yeah, yeah."}
{"episode_id":"SW - #335 - 2024-04-13 - Justin Brierley - The Next Great Renewal","start":1350.71,"end":1367.67,"speaker":"Jonathan Pageau","text":"And that's that. I think that's true about, about, about Christianity. And so what do you see coming down the, the line? Like what do you see? I mean, I don't want you to, don't want, if you don't feel comfortable saying it but you know, because now there's this thing going on like this, this movement that's happening. How do you see it developing?"}
{"episode_id":"SW - #335 - 2024-04-13 - Justin Brierley - The Next Great Renewal","start":1368.15,"end":1627.25,"speaker":"Justin Brierley","text":"Yeah, it's really interesting. I'm not a good prophet of these things and all I'm really pointing out is what I see happening right now. Yeah, just, just this really interesting conversation that started again with people taking Christianity seriously and kind of the door being open for, you know, a quite significant number of people by the likes of Jordan Peterson and even, you know, Tom Holland, who, you know, I, I think is one of the, the, the best unsung evangelists the UK has right now. Most of the people I meet at the moment who have serious, taking Christianity seriously again, they've, they've basically been reading Tom Holland's Dominion, you know, and understanding that they are basically products of the Christian story at a fundamental level. So I, I find that all very exciting. Now where is it going? I mean, my hope and prayer is that we might be seeing, you know, the next great revival. I mean that doesn't mean that it's going to be a revival that looks like previous revivals and, but it's going to be whatever needs to happen in our moment. I think, having said that, it could get worse before it gets better because, you know, we all know where certainly the, the statistics on church attendance and religiosity and so on are in the West. So I'm not saying that suddenly we're going to be seeing, you know, the pews all filled and churches bursting at the seams, but I do feel like there's a. There's a kind of winnowing happening of the church itself at the moment. There's kind of a lot of models that were kind of superficial or not fit for purpose are sort of having to be broken down. And I think that all is part of the process is there's. There's almost like there's always been, I think, this kind of birth and redeath, sorry, death and rebirth of the church in various generations. And I just wonder whether we're going through that now. And you've seen it obviously in some of the scandals in parts of the Catholic Church, but equally in the, you know, in my area, they're sort of more evangelical sort of church where you've had lots of celebrity pastor scandals and certain ways of doing church which are obviously toxic are not kind of actually giving life and, and doing, you know, bringing people God in the way that they're meant to. And so, so I, I feel like there's. There's that going on on the one hand, but there's also this kind of bubbling up of something quite exciting on the other hand and, and that I want to sort of just ask the church to, yeah, absolutely be realistic about the bad stuff, but also to maybe have some hope and get excited about the good stuff and ask, well, what can we do to nurture that and to kind of learn the lessons that we need to learn to make sure that we shepherd this movement in a way that, that, that's helpful. As I say, it could go off in bad directions. You know, there's always the danger that it turns into some kind of quasi Christian nationalism or something like that. You know, there's all kinds of things that will come in and, and try to vie, I think, for. For what is actually the true work of the Spirit that I think is. Is going on at some. Some deeper level in, in the lives of these people and the people who are seeking meaning. So that's all just to say, I don't know exactly where it's going, but I just have a sense that the wind is blowing and it feels like something's changed in the atmosphere quite significantly. And that actually that, that if the church. If we Christians can sort of just lean into that and start to answer the questions people are actually asking right now, that would be a really good start. I spent, you know, most of my career kind of doing that. Traditional apologetics, you know, his five reasons to believe in God and four, four reasons to believe the resurrection. I just feel like now is possibly the moment to actually step a little back from that. Not saying that's not important sometimes, but to just help people understand why they would want this to be true in the first place and that, that, that's kind of where we're at, I think, in our culture. People suddenly realizing I want something to be true and, and kind of helping them to realize. And then maybe, you know, later on you can show them that in fact it is true with, with some of that traditional apologetics. But it's like at the moment, it feels like people are just at that point of, of realizing that they want there to be a bigger world than, than the one they've actually been presented with."}
{"episode_id":"SW - #335 - 2024-04-13 - Justin Brierley - The Next Great Renewal","start":1628.05,"end":1636.13,"speaker":"Jonathan Pageau","text":"And so do you see yourself, like, your approach to apologetics? Do you see that it, that it has changed in the past few years, like the way that you're talking to people?"}
{"episode_id":"SW - #335 - 2024-04-13 - Justin Brierley - The Next Great Renewal","start":1636.37,"end":1740.85,"speaker":"Justin Brierley","text":"I think it has, in all honesty, because as I say, you know, the first half of my career sort of hosting these shows was really kind of in that bread and butter sort of science versus faith, you know, can we, you know, five, five arguments for God kind of stuff. And as I say, it was all good, kind of intellectually kind of rigorous stuff that, that helped me to kind of get a handle on that. But I, I quickly realized that there's relatively few people ultimately who actually step into something on the basis of that. It might be an important part of the process, but there's always, at the end of the day, there's an imaginative element to this where people have to kind of, I don't know, their mind has to be renewed in some way, where their imagination kind of gets baptized as much as their, their intellect kind of gets convinced. And, and I've never met someone, in all honesty, if I just look at it in the cold light of day, who just had some intellectual conversion. There's always a sort of spiritual, imaginative component going on. And I know it's kind of too cliched almost to say, but C. S Lewis was obviously a brilliant exponent of doing this because he did that traditional apologetics through mere Christianity and the problem of pain and that kind of thing. But, but I think where he was at his most fruitful where he resonated the most with people was when he wrote the Narnia stories and things like that, where he created a world that people wanted to be true. And, and then he said to them, well, what if this world does in fact exist? What if you're actually living in this world? And, and for me, that's, that's a very powerful, you know, way into the Christian faith. And I think that we need to sort of recapture some of that in the way we, we approach people today."}
{"episode_id":"SW - #335 - 2024-04-13 - Justin Brierley - The Next Great Renewal","start":1744.45,"end":1774.8,"speaker":"Jonathan Pageau","text":"Yeah, I, I obviously, I totally agree with you in some ways. You know, that's why I've been focusing my attention on storytelling quite a bit recently, you know, to, to, to help people as much as possible. See that. And so have you seen, I'm curious what you see the role of artists being in, in this because, you know, it's the, the, the world of apologetics is usually a world, like you said, of scientists, of kind of theologian, often very systematic thinkers. And so how do you see artists playing a role in what you're describing?"}
{"episode_id":"SW - #335 - 2024-04-13 - Justin Brierley - The Next Great Renewal","start":1776.83,"end":2021.62,"speaker":"Justin Brierley","text":"I, I think that what I would love to see is, is artists. And I'm again not the first person to say this, but, but artists stop. Who are Christians stopping. Doing quote unquote, Christian art that is basically just a knockoff of secular art, but with Jesus in the, in the frame kind of thing. I just think we need to do great art. Because at any time you do great art, true art, you are representing Christ at some level and, and to that extent, yeah, I, I just want folk who, who do find themselves, who do call themselves Christian to just do their art as well as they can and to, to sort of, yeah, just, just to put it out in the public sphere and, and to, I mean, one of the things I, you know, what's been fascinating is doing this new documentary podcast series, the Surprising Rebirth of Belief in God. I ended up, for various reasons, moving on from hosting the unbelievable show about a year ago. And it was kind of, to some extent, it wasn't a move I'd completely planned out, but it did give me suddenly an opportunity to do something very different. And I thought, I've got this book coming out. And I just. This thought dropped into my soul. You know what? Now that I've got some time and space, I would love to do a really good documentary podcast series based on the book. I just felt like there was a story to be told here. And, and so, you know, in God's providence, I sort of had this time and space to, to kind of work on Something that I would never have been able to work on, you know, in my previous role. And, and I poured a lot of time and effort into sort of trying to create something that's not just information, but is actually a bit more of an experience. It's that it's, it brings something across not just through the people and the voices, but through the music and the kind of the way it's woven together in something that is a little bit more artistic. Now I'm not saying it's some Oscar worthy, you know, production, but it's what I've, what I've noticed releasing that is that the response has been really quite different to the kind of these more sort of just kind of brains on legs debates that, you know, that I hosted for many years. It's, it's kind of like people suddenly feel able to engage with it at a different level because they feel like they're entering into a story. So, so many of the people who've got back to me, whether they're Christian or non Christian, have said, yeah, I feel like this, this resonates with me. I feel like this is telling my story. I, I kind of, you know, had all those memories of the new atheist phase and I've kind of, you know, moved on in my thinking. And, and it's just like it, it just reminded me that, that there's something about doing something in a storytelling mode, in an artistic mode, in an imaginative mode that just does connect with people on a different level. And I'd, I'm kind of really enjoying that if I'm honest. I, and I feel like that's where I, Christians need to try and almost like sometimes we need to put down the kind of the manual on, you know, five ways to convert someone in five minutes and, and just sort of start, start again. Say let's just create something people will enjoy, people will appreciate, people will love and then see what God does with that. Because I think that's what art is ultimately. If it's used in a really didactic, top down, sort of overanalyzed way, it stops being art. And people kind of know that they're being preached to and know that they're being sort of sold something. And yeah, and that's. That for me is, is where Christians who want to be artists should start to, to focus themselves, stop trying to kind of do the thing, you know, do the thing, you know, anticipate what this art is going to do to someone and just do the art, you know, and, and it will speak for itself in that way."}
{"episode_id":"SW - #335 - 2024-04-13 - Justin Brierley - The Next Great Renewal","start":2022.49,"end":2088.11,"speaker":"Jonathan Pageau","text":"Yeah, there's an, it's an interesting moment right now because for many years Christians were caught in that world where they basically made propaganda. You know, especially in the highly produced world of music or of, of movies and television, you know, they just basically made Christian propaganda. But now we're at an interesting time when Hollywood itself has become propaganda. And so it's actually opening a very interesting space for Christians and religious people to do like CS Lewis and Tolkien did, which is basically tell stories that have the right world view, that have the right perspective. That is a complete perspective. Right. That isn't just a kind of, and I'm seeing that like you interviewed Martin Shaw and Paul Kings North, a few, few artist types, and I can see that they get that right away. Right Possibility of using the, the, the poetry of Christ as a means to affect the world. Not through argument and through kind of convincing, but just like you said, following in, entering into a story."}
{"episode_id":"SW - #335 - 2024-04-13 - Justin Brierley - The Next Great Renewal","start":2088.59,"end":2146.07,"speaker":"Justin Brierley","text":"And, and I think it's why in a funny way, you know, these prophets from outside the church, like Peterson and Holland and others have, have actually been so effective actually drawing people towards Christianity. It's because they're not going at it as kind of, you know, three point evangelists. They're, they're just opening it up and saying, here's a story and isn't it interesting? And what would happen if, you know, you, you started to step into it? They're not, you know, they don't have a plan, I think, to convert people, but people are being converted and it, it's. Because it's, it's this much more sort of natural, holistic way of doing things where, where, where people, I mean, the thing about, especially, you know, Jordan Peterson that I, I find with him is the reason I think he connects with people is because they genuinely feel like he, he, he cares about them, like he cares about their soul, basically."}
{"episode_id":"SW - #335 - 2024-04-13 - Justin Brierley - The Next Great Renewal","start":2146.39,"end":2146.83,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #335 - 2024-04-13 - Justin Brierley - The Next Great Renewal","start":2146.83,"end":2193.6,"speaker":"Justin Brierley","text":"And, and when he, you know, you know, breaks down in tears on stage, it's, it's not manufactured. It's a kind of, it's a kind of a re. A real reality that kind of breaks through the intellectual firewall that I think you get actually with a lot of other public thinkers and things. And, and I just think there's something about that, there's, there's something about the, that's very attractive to people, I think. And, and you can't manufacture it. You know, you can't then say, you know, to the evangelist, well, you need to do the Jordan Peterson thing and start crying on stage because that's the way to get them in. It's, it's just got to be real, you know, and that's, and so whether it's art, whether it's, you know, Jordan Peterson on the stage, people connect with, with real stuff. And that's where I think we have to go in that sense."}
{"episode_id":"SW - #335 - 2024-04-13 - Justin Brierley - The Next Great Renewal","start":2194.4,"end":2221.06,"speaker":"Jonathan Pageau","text":"Yeah, that, I think that that's right. I mean since we're talking about Jordan, I am curious to, because you kind of were there at the outset. I remember you interviewed Jordan quite early in his, you know, skyrocket to, to, to fame. And I'm wondering how you see Jordan's role in this transformation, especially the new atheist transformation. If you see, if you feel like he's played some role in, in changing the way people perceive religion."}
{"episode_id":"SW - #335 - 2024-04-13 - Justin Brierley - The Next Great Renewal","start":2221.06,"end":2470.11,"speaker":"Justin Brierley","text":"I mean, you could probably answer this question far better than I could in all honesty, Jonathan. But, but the, I mean the reality is, yeah, I, I, I remember in 2017, that was when I first started to, to hear the name Jordan Peterson being banded around and people saying hey, you should get this guy really interesting, you know, Canadian psychologist on your show, Justin. He's, he's having these, these amazing sellouts lectures on the Bible. And I always thought, oh, that sounds interesting. And you know, and I heard he, you know, was making some waves as well around the C16 bill and all that. But I finally kind of got my opportunity actually in, in early 2018, I was starting a series of shows from Unbelievable called the Big Conversation and I, Peterson was just about to release 12 rules for life and he happened to come over to the UK for a kind of almost pretty release sort of mini tour. And I remember sort of getting in touch with the publicist at the time saying I'd love to book, you know, Dr. Peterson onto my show. I'm gonna hopefully bring you on with a sort of atheist psychologist to debate meaning and God and that kind of thing. And she said yeah, that should be fine, yeah, we've got room in a schedule. So, so that was fine. And, and I just remember a series of emails from her as, as the time drew near where she said, oh this, this man's far more popular than I was expecting him to be. And could we just whittle down your time a bit because I need to take him over to the BBC afterwards. And, and, and it was, it was interesting because I, even then I could see something was going on and they had sort of, you know, around the time he came over they booked, kind of hastily booked sort of a, a thousand seater auditorium and it sold out. You know, in hours. And so they booked a second one and that sold out. And, and this was before the book was even properly released. And, and then the book came out. And funnily enough, just a day or two after I recorded my show with Peterson, he had that. He recorded that viral interview with Kathy Newman, you may remember, where, you know, they, they kind of debate the gender pay gap and that kind of thing. So then it just exploded and everyone was suddenly seen talking about Jordan Peterson. So I was kind of sitting on this show that I just recorded as well, but I, I wasn't going to be releasing mine for a few months, you know, because we weren't going to start this series yet. But when, when we did, obviously it, it caught fire and, you know, brought, you know, I, I can, I can thank, honestly, Jordan for, for the fact that our YouTube channel kind of got going at that point because, because of that video. But it's. I guess what I noticed, you know, a more fundamental level was that, yeah, this was a classic example of a completely different conversation because I brought him on with this atheist psychologist, Susan Blackmore, to debate the question of whether we can make sense of life without God. And, you know, I didn't, in that sense bring Jordan on as a Christian guest. So it was kind of an unusual show in that way. I'd normally have a Christian opposite, you know, an atheist or something like that. But, but he could have, if you had just been casually listening, you could easily thought he was a Christian sort of guest because he was defending the idea of, you know, the fact that the only way we can talk of, of value as humans is that we're made in the image of God. And, you know, and, and it was just the most fascinating thing. And, and I, as soon as that show went out, suddenly I had a huge influx of new listeners, people getting in touch. A very good friend now actually called called Dean in Australia, who, you know, stumbled across the unbelievable show because of having Peterson on and, and just people who are basically agnostics but really interested and just looking for something. And I just realized there's this whole sort of. Outside these kind of quite nerdy Christian atheist apologetics debates, there's actually this whole demographic who are just basically looking for something. And they've kind of looked into the Sam Harris and the Dawkins way of it, and it just hasn't quite worked. And suddenly Jordan Peterson comes along and, I don't know, it just opens a door for them. It's like, for whatever reason, he speaks language that they can understand, they can kind of get their heads around faith and religion in a new way. And suddenly it's like a door opens for them and, and as I say, a good number of them I think are walking through that door."}
{"episode_id":"SW - #335 - 2024-04-13 - Justin Brierley - The Next Great Renewal","start":2472.11,"end":2494.49,"speaker":"Jonathan Pageau","text":"Yeah, that's that I, when I, I remember watching that interview and also thinking he's bringing people on a, in a place that they're not used to. He's saying things that people are not used to hearing and kind of crashing some of the argument. The normal that people have, remember, even argued with her about the, the idea that memes then affect genes."}
{"episode_id":"SW - #335 - 2024-04-13 - Justin Brierley - The Next Great Renewal","start":2494.81,"end":2495.21,"speaker":"Justin Brierley","text":"Right."}
{"episode_id":"SW - #335 - 2024-04-13 - Justin Brierley - The Next Great Renewal","start":2495.29,"end":2551.38,"speaker":"Jonathan Pageau","text":"Trying to say that it's like if there's this idea that memes, that memes are just a, A, you know, an emergent property. But he was, he said then the meme affects the development of the gene through the way that humans act. And, and it's like I could see her, like she had never thought about that in her entire life. And I thought, oh. And it's weird because it's an argument that Jordan used that he hasn't even touched after that. And I thought that's the type of argument that can help people understand the idea that, at least understand that top down meaning is real, that that constraint from above is something that you can't avoid even in your, even in your biological kind of evolutionary way. And that that way of arguing is a way to help secular people understand that, that, that when we talk about, you know, idea meaning coming down from heaven or names coming down from heaven, that it happens even in the biological sphere. So anyways, I remember that interview. I remember loving that there is some."}
{"episode_id":"SW - #335 - 2024-04-13 - Justin Brierley - The Next Great Renewal","start":2551.38,"end":2663.09,"speaker":"Justin Brierley","text":"I mean, it was only a short interview in all honesty. You know, we, we had about 50 minutes and. But we packed an awful lot in and, and I just, yeah, there were some absolutely stunning moments in that one. I mean, the one, the one I particularly remember is, is Jordan Beatson essentially saying to Susan Blackmore, well, I don't really think you're an atheist. And she kind of got somewhat offended by this, you know, what do you mean? I don't believe in God. And, and he basically did his thing of saying, well, no, you, you do have something that he's God to you. It's that, you know, and, and, and obviously she kind of, you know, went back and forth on him on that. But it was interesting because it did introduce me, I think, to the first time to, to this, this quite nuanced kind of way in which Peterson and, and yourself to some extent kind of talk about God because again, as he has been on many interviews, he wasn't too willing to be drawn on exactly what he means by God, but, but he was willing to say, we all have something that functions as God in our life. And, and again, I saw. I, I just think that whole conversation has been quite interesting. I think it's sometimes confusing for people because they are. It's like, you know, I wish I could just get a straight answer on this, but I think what I've, I'm. I guess even I am beginning to learn is that so many, so often that conversation is, is already being held in sort of rationalistic, naturalistic terms. You know, when you say, just define God for me, and then, then we'll, we'll decide whether he exists or not kind of thing. Yeah, exactly. And, and I just think Jordan is just one of those people who says, I'm not going to play the game that way. Okay. That's because I'm immediately going to fall into your trap, basically. And, and I, I just found that quite refreshing that he was kind of. I don't think he was being evasive in that sense. He was just not willing to sort of fall into that specific debate, which, you know, how that's going to go kind of thing. So."}
{"episode_id":"SW - #335 - 2024-04-13 - Justin Brierley - The Next Great Renewal","start":2663.09,"end":2752.55,"speaker":"Jonathan Pageau","text":"Yeah, yeah. A lot of people make fun of Jordan because of that, that these moments where he says, well, what do you mean by God? What do you mean by believe? What do you mean? And, and I think that I understand why they make fun of him, but I think that they're. He's basically trying to say, when you're talking about the source of reality, when you're talking, when you're, when you're, that's the conversation you're having. You're saying, what is the source of meaning? What is the source of reality? What is the source of all things? Then if you try to use a language that reduces that to proposition, then you're already in the wrong sphere. And so you have the problem of. You have the, you have the problem of, again, falling into a trap, which is, like you said, if I, if I try to define God like I try to define the species of a dog, then the Christian is lost at the outset. And the truth is that in our own Christian tradition there is an apophatic idea. There is an idea that God is not totally definable, that God cannot be completely captured by meaning. And it's not a way of evading. It's a way of saying the source of all things cannot be captured by things. That's just how it's Actually just a kind of normal argument for the same reason that. How can I say this? Like, you'll never get to the Big Bang, even in the science, because you can't get to the origin in the system. The origin. The origin is behind. Yeah, the, the system of something. Anyways, that's a difficult argument for people to understand, but I think that there's something about Jordan who intuitively."}
{"episode_id":"SW - #335 - 2024-04-13 - Justin Brierley - The Next Great Renewal","start":2752.87,"end":2753.35,"speaker":"Justin Brierley","text":"Yeah."}
{"episode_id":"SW - #335 - 2024-04-13 - Justin Brierley - The Next Great Renewal","start":2753.35,"end":2753.91,"speaker":"Jonathan Pageau","text":"Wants to."}
{"episode_id":"SW - #335 - 2024-04-13 - Justin Brierley - The Next Great Renewal","start":2753.99,"end":2821.17,"speaker":"Justin Brierley","text":"And, and I think, And I think, you know, there's always that danger in my world that we want everything kind of buttoned down and kind of explained and neatly sort of systematically kind of done. And I think in that sense, Peterson sort of has sort of frustrated both Christians and atheists at that level because he's not willing to be put in those boxes in that way. But I found that. But in, in an interesting way that's part of his appeal, I think, for many people is that he's sort of not kind of using the typical language of, of either side. And so he's, he's kind of. That's why I think it opens it up for people in a strange way because it's, it's, it's a bit more expansive and they feel like, I. This isn't the kind of. The thing I heard in Sunday school and. But it's not that. It's not kind of, you know, the Dawkins lecture either, that I was at. So I, Yeah, I just think there's something going on there that, that means that it's. Yeah. Sometimes hard to pin down in the way. Because people like to have things very black and white, but at the same time, it's kind of opening up the possibilities for people in other ways, you."}
{"episode_id":"SW - #335 - 2024-04-13 - Justin Brierley - The Next Great Renewal","start":2821.17,"end":2843.13,"speaker":"Jonathan Pageau","text":"Know, and so in your new. In this new project, in this new documentary series, what are the things that have surprised you? Because you kind of had a perception and the right perception that something's happening in culture. And so we need to investigate this and understand it. But what are the. Some of the things that, that you didn't expect to see Navy?"}
{"episode_id":"SW - #335 - 2024-04-13 - Justin Brierley - The Next Great Renewal","start":2843.69,"end":3095.81,"speaker":"Justin Brierley","text":"I, I think some of it is. Is the people, you know, that I encounter who have become Christians. And some of them are really surprising stories. You know, you, you know Paul Kings north quite well, and, and again, he's someone who was himself completely shocked, surprised by the fact that he became a Christian because it was, that was not the thing that he was expecting would provide the answers. You know, he thought he knew what Christianity was. You know, there's that, that sense in which I think you can almost become, inoculated to Christianity if you've kind of received a small shot of it, you know, at some point and thinking that you've had the real thing and then you discover later that ah, no, it turns out the real thing was, was something altogether different and bigger. And, and he, you know, went through, you know, sort of teenage atheist phase. He kind of then spent a long time sort of in Buddhism, felt like he still needed to worship something though. There was that kind of deep sense that the world was enchanted and, and nature that she loved so much. And so he tried Wicca, you know, for a while and you know, was out in the woods kind of doing nature religion and worship. But again, in a very sort of really interesting series of events in his own life where at one point his, his wife, out of the blue, again not a Christian, told him he was going to become a Christian and then he was having dreams about Jesus and he was suddenly having all these correspondences from people he hadn't realized were Christians in his life. And, and it just, there was just like he says, it was almost like he got dragged out of Wicca and into Eastern Orthodoxy in fact, in the end. So it's, I just find that really interesting because again you've got someone who's a highly intelligent, you know, person, 21st century modern person, but who, who suddenly finds that this, the stories they've been looking for, for a kind of a story to make sense of life and suddenly the last story they expected to do it was the one that did it. And I just, I'm finding kind of increasing examples of that again, in a funny way that, that sort of story of Iron Heri and I'm only mentioning kind of the big well known ones here. There's, there's lots and lots of other smaller, less well known stories I could mention. But, but again, I just find it so interesting that suddenly, you know, in, in this moment she comes out and says actually I'm not an atheist anymore. I, and she doesn't, she doesn't kind of give a, you know, credo statement of belief exactly in Christianity. But what she does say is atheism isn't enough and I need what, whatever it is that this person Jesus represents, that's what I'm looking for in my life. And again, I just find I would that you could have knocked me over with a feather when, when she dropped that article because I was like, what this is, this is a bit like St. Paul on the road to Damascus here. This was a proper new atheist one that, you know, she shared the stages with Harris and Dawkins. So if it could happen to her, it could happen to anyone, you know. And so, so these, I do find these genuine, surprising. I feel like something's changed in the atmosphere that, that it's possible for those kinds of stories to suddenly be happening. So that's probably the bit I find most exciting, most surprising. I think, in a way, there's lots of other surprising elements to it. You know, as I said, the way that the ground has shifted so completely, so that I see kind of unusual bedfellows now with some of the atheist interlocutors who are now sharing stages with Christians who are, you know, buddying up and, and kind of collaborating in various ways. So many interesting conversations that you're having with, with people that you might not have ever thought to have, you would be having, you know, 10 years ago. Because I think there's been a kind of convergence of lots of things. And, and so I'm. I don't know how that's all going to shake out, and it's not all necessarily going to be positive and people are going to go off in different directions with this, but I do just find that. That the whole thing is sort of getting shaken up, stirred around, and I feel like, you know, again, this is my. Me speaking as a Christian that, that God's doing something, you know, in. In the process of all that. And, and I, I just. Yeah, quite excited about it."}
{"episode_id":"SW - #335 - 2024-04-13 - Justin Brierley - The Next Great Renewal","start":3098.29,"end":3132.63,"speaker":"Jonathan Pageau","text":"Well, everybody, you check out Justin's book, the Surprising Rebirth of the Belief in God, and his, his documentary series, Re Enchanting. Like I said at the outset, it's really interesting. He's talking to all the people that. Similar people that we're talking to. There is, you know, he's in the. The. He's perceived some of the similar things that everybody who's watching this has seen, that there's something happening. There's a deep shift in culture, and definitely there is a return of the sacred and the possibility of seeing Christ freshly again. And so, Justin, thanks so much for all the work you do."}
{"episode_id":"SW - #335 - 2024-04-13 - Justin Brierley - The Next Great Renewal","start":3132.63,"end":3150.86,"speaker":"Justin Brierley","text":"Oh, you're so welcome, Jonathan. It's been absolutely privileged to be on. Just, just one slight sort of correction there, which is the, The Re. Enchanting podcast is a slightly different thing to the Surprising Rebirth of Belief in God podcast, but we're using quite a lot of material from that in the documentary series, so they're very much connected in many ways."}
{"episode_id":"SW - #335 - 2024-04-13 - Justin Brierley - The Next Great Renewal","start":3150.86,"end":3153.1,"speaker":"Jonathan Pageau","text":"Where's the best place people can find what you're working?"}
{"episode_id":"SW - #335 - 2024-04-13 - Justin Brierley - The Next Great Renewal","start":3153.1,"end":3168.69,"speaker":"Justin Brierley","text":"Yeah. Justinbrierley.com is my website so you can sign up to the newsletter, do all the usual things there, but you'll get links to the podcast, to the book, and to Reenchanting as well if you want to follow some of the conversations we have on that other podcast. But yeah, Justinbrierley. Com all right."}
{"episode_id":"SW - #335 - 2024-04-13 - Justin Brierley - The Next Great Renewal","start":3168.69,"end":3169.41,"speaker":"Jonathan Pageau","text":"Thanks, Justin."}
{"episode_id":"SW - #335 - 2024-04-13 - Justin Brierley - The Next Great Renewal","start":3169.57,"end":3170.53,"speaker":"Justin Brierley","text":"Thank you so much."}
