{"episode_id":"SW - #086 - 2020-01-04 - The Meaning of Vampires","start":0.64,"end":26.32,"speaker":"Jonathan Pageau","text":"The idea of blood sucking creatures has been around for quite a while and is there in most cultures. But what I want to look at in terms of the vampire is looking mostly at how it has developed in the modern time, especially from the time of Bram Stoker. It seems like the vampire has taken up a particular niche in the world of monsters. And I think it's a niche that it's important to understand at the moment."}
{"episode_id":"SW - #086 - 2020-01-04 - The Meaning of Vampires","start":39.52,"end":42.96,"speaker":"Jonathan Pageau","text":"This is Jonathan Peugeot. Welcome to the symbolic world."}
{"episode_id":"SW - #086 - 2020-01-04 - The Meaning of Vampires","start":53.19,"end":164.78,"speaker":"Jonathan Pageau","text":"Now, the notion of vampires has been around for a very long time. The idea of things coming, people coming back from the dead to, to take other people's blood, you in the, let's say, in the older versions of the vampire, it's mostly the imagery of a parasite or, you know, of something which is coming from the outside, which is coming from below, you know, like, like an insect or a mosquito that is feeding off the living. And so it is really this parasite. A way to understand it is how, let's say on a more psychological level is to understand something like someone who dies and what they left as a legacy is going to continue to gnaw at you for one reason or another, is going to continue to act as a parasite on your life, despite the fact that it is, that person is gone. And so the, you know, despite the person's death, something about what they left behind is going to keep gnawing at you. And I'm sure we could find many examples of that. But the way that the vampire has taken form in the modern time, especially since the time of Bram Stoker, a little bit just with the basic idea of Count Dracula and the notion of a monarch, the idea of an aristocrat who becomes this vampire who sells his soul to the devil or does something similar and then becomes this creature of the night, trades off, you know, the idea of having power and unlimited life for a life of living death and sucking the blood of others. And so the interesting aspect of this vampire is that it really becomes the image of a monstrous version of the hierarchy, a monstrous version of aristocracy. And it's not surprising that it would."}
{"episode_id":"SW - #086 - 2020-01-04 - The Meaning of Vampires","start":164.78,"end":166.86,"speaker":"Jonathan Pageau","text":"Appear in the time that it appeared."}
{"episode_id":"SW - #086 - 2020-01-04 - The Meaning of Vampires","start":167.02,"end":540.89,"speaker":"Jonathan Pageau","text":"In a moment where narratives about the aristocracy, narratives about hierarchy themselves were like, let's say, revolutionary or were, you know, you could see the development of, of Marxism coming about, the development of, you know, we had. The French Revolution was already gone. All of these, you know, the Russian Revolution, all this idea that somehow aristocrats or any, anything that is a hierarchy is bad was setting itself up. So it's not surprising that the image of the vampire, the way it appears to us would appear around that time. But at the same time, of course, it shows a political slant that the world has taken. But nonetheless, if you look at the image, it can help us understand the danger of hierarchy or the negative side of something which is above. And the way that it shows it is in a normal relationship between, in a normal hierarchy, what is above does in fact feed on what is below. And that is of course, something which might disturb you, but it just, you know, it just happens. You, you, if you, if you, let's say you are an entrepreneur and you're building something, you hire a bunch of people and you are going to feed on their energy in order to accomplish what you want. You know, if you have people under you in the army or in any business, you are feeding from them their food for your project in order to accomplish your goal. So that in itself is not necessarily weird. What is dangerous is when the effort only goes one way, because usually what happens is there's an exchange. You, the people below in the hierarchy will offer support, will offer sustenance, will be like the food for the project or the moving towards the goal that this structure has in mind. And what's coming from above will give back value, will give back identity, will give back in terms of a political sphere, will give back protections that will come from above. And so, you know, the role of an aristocrat is of course to protect his, the people on his land. He's supposed to protect them from invaders, protect them from, from anything that could happen to the land, but also even provide medical help, provide often education, basic education to the people that were working for him. And so that is the normal exchange. You can all, you can always see the normal exchange in a hierarchy as the idea that there's love coming from above and there's a kind of submission or a kind of pliableness coming from below, where you submit to the purpose of this higher thing and care comes from above. So that is the normal version. But in the idea of the vampire, what you have is, you have, what is this aristocratic figure which will seduce, but then will only feed and will not give back, will not produce, will only take. And so you can understand it in the, of course, in the vision of the revolutionaries that that's what the aristocracy was doing, was only taking from below. And you can see it in the Marxist, you know, idea of what the rich do, is that all they do, they, they feed from below and they don't give enough back. And so the Vampire exemplifies that, becomes a, an image of that. And it can help you understand, you know, even in your own experience, in the way that you act in the world, how you need to be attentive to, to the things which are below. And it's not just it, you can see it in yourself as well. You can imagine it like this. You can imagine it as. You have your purposes, your goals, your, your intentions. And then you have your possibilities, your body, your time, your resources. And if you're not careful, you can act as a vampire upon yourself. That is, you can suck the life out of yourself, you can work yourself to death, you can work yourself into a kind of zombie state. If you've ever seen those old movies of people that have been bitten by vampires, you know, they're kind of wide eyed and they're not totally there. They're kind of half, they're half dead themselves. And so you can do that to yourself where you are taking from your body and you're not giving back. And everybody has had that experience. So you can understand it because everybody has had times where they're not sleeping enough, they're not eating enough, they're not doing what they need to do in order to give back to their possibilities, but rather they are just trying to suck themselves dry. And so that is what I think the vampire today represents. And in a way it's almost as if it's the opposite of something like the zombie where in the case of the zombie, you have these monsters coming from below that are eating the brain, you know, so you have the body eating the brain. And in the terms of the, the vampire, you have something like the br which is eating the body, you have the top which is devouring what is underneath and trying to sustain itself by only taking. And that of course doesn't work in the long term. And you can keep adding to your body for a while. You know, you can take caffeine, you can take cocaine, you can take cocaine. You can do all kinds of things to kind of try to add to your body. And in order to be able to suck it dry, you can see the same in terms of the aristocrat or the leader who is devouring his people. They can add people, they can try to just keep sucking the blood from different people, but at some point that will give them a kind of unnatural long life. But at some point it is inevitable that that will fall apart and that will break down. And so in a way what it ends up being is if there are sins of the passions you could call them. And they are sins of."}
{"episode_id":"SW - #086 - 2020-01-04 - The Meaning of Vampires","start":542.09,"end":543.09,"speaker":"Jonathan Pageau","text":"Sins of the mind."}
{"episode_id":"SW - #086 - 2020-01-04 - The Meaning of Vampires","start":543.09,"end":577.44,"speaker":"Jonathan Pageau","text":"You could call them. The vampire seems to manifest mostly the sins of the mind or the sins of the elite. It's pride really. And it's really this idea that I am so important that I can suck all these people dry and it's justified to because of my own self importance. So that fits with the idea of the aristocrat or the idea of a leader which would be full of himself and would not see themselves rather as having to care and to help those that are below them. And one of the, let's say one."}
{"episode_id":"SW - #086 - 2020-01-04 - The Meaning of Vampires","start":577.44,"end":580.2,"speaker":"Jonathan Pageau","text":"Of the interesting aspects which still remains."}
{"episode_id":"SW - #086 - 2020-01-04 - The Meaning of Vampires","start":580.2,"end":585.56,"speaker":"Jonathan Pageau","text":"From the older legends that can help you understand the problem that I'm trying."}
{"episode_id":"SW - #086 - 2020-01-04 - The Meaning of Vampires","start":585.56,"end":587.04,"speaker":"Jonathan Pageau","text":"To show you is this idea that."}
{"episode_id":"SW - #086 - 2020-01-04 - The Meaning of Vampires","start":587.04,"end":785.17,"speaker":"Jonathan Pageau","text":"Vampires can't stop, stop themselves from counting. They're, you know, these legends that if you want to get rid of a vampire, you should throw some rice on the ground or something and then the vampire will have to count out every single piece of rice that they can't stop themselves from doing that. And in that image you can see this idea like the sin of the mind, the sin to, through counting, through, through, through math, to be able to account for everything. And so to the sin of the vampire is actually not to let, let's say the lower things be, but has to account for all of them. And so in that manner you could imagine the vampire as being something like a false light, something like a false hierarchy, a mockery of a hierarchy. And that is why they, you know, that is why they don't have a reflection. They're kind of this false light, this false aristocrat. And I think that's also to a certain extent. So it's like a dark hierarchy. You could imagine it that way. And so that seems also to be the reason why the way to get rid of the vampire is through sunlight, through exposing, you know, exposing the sins of the, of the father. You could say something like that to be. To show the evils of the aristocracy, to expose their vices and to do all that, something which we've seen in history, of course, quite a bit. You know how people in elite circles tend to think that they, that everything is permitted to them, that they think that because they are above other people in terms of social hierarchy, that somehow the rules of the world don't apply to them. And so a way to get rid of the vampires is of course to shine a light on them and to show them for what they truly are. And in that sense it's also the true Hierarchy or the true law, which ends up showing itself when you shine a light on it. And that also seems to make sense in terms of the. The basic idea of the cross. Why the cross would also would also frighten them in terms of this hierarchy of sacrifice that we find in Christianity, which is exactly the opposite of what they are putting out there. And so the one thing that I'm not sure about, and maybe you guys can help me out in the comment section, is in my, let's say basic idea, it seems like everything is kind of coherent, kind of makes sense. But the one thing that I'm struggling with is garlic. Why is it that garlic frightens vampires? And I'm sure there's something I'm missing, some aspect of, of. Of the. Of garlic. The only thing I can kind of think of is that maybe it has to do with a kind of purification. So you know, garlic as an astringent, garlic as this kind of really pure thing, kind of like light shining on something like that. But here I really feel like I'm speculating. So I'll leave it up to you guys and hopefully if, if you gu. You say something that I find convincing in the comments, I will pin the comment and give my own response. So thanks everybody for your support and I will see you soon."}
{"episode_id":"SW - #086 - 2020-01-04 - The Meaning of Vampires","start":786.45,"end":851.42,"speaker":"Jonathan Pageau","text":"I hope you enjoyed this episode of the Symbolic World. The Symbolic World is edited by Justin Ward and it is based on a series of videos that you can find on my YouTube channel, Jonathan Pageau's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course leaving a review on itunes. Everybody knows that's the best way to, to get the podcast out there, to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon Pageau Videos as well and on SubscribeStar, all those links you can find on my website or in the show description. So thank you and I will see you soon."}
