{"episode_id":"SW - #158 - 2021-05-15 - Paul Kingsnorth - Environmentalism, the Tower of Babel and the Disintegration of Culture","start":12.56,"end":67.03,"speaker":"Jonathan Pageau","text":"This is Jonathan Peugeot. Welcome to the symbolic world. So, hello, everybody. I am sitting here with Paul Kingsnorth. Paul Kingsnorth is a writer from the uk. He has written several novels, also several other books. And he's been kind of put on my horizon by. Several people have been telling me that I need to pay attention to him, Rod Dreher and then several priests, actually, and many artists that are around me. And so I'm actually reading one of his novels now, the novel Beast. But I thought it would be a good opportunity for you to meet him and to talk a little bit about his journey and his vision of where we are in the world and how we can be, how we can play a positive role in where the world is going. And so, Paul, thank you for coming. I really appreciate you giving me the time here."}
{"episode_id":"SW - #158 - 2021-05-15 - Paul Kingsnorth - Environmentalism, the Tower of Babel and the Disintegration of Culture","start":67.59,"end":69.67,"speaker":"Paul Kingsnorth","text":"Well, thanks for inviting me on. It's great to meet you."}
{"episode_id":"SW - #158 - 2021-05-15 - Paul Kingsnorth - Environmentalism, the Tower of Babel and the Disintegration of Culture","start":69.83,"end":95.42,"speaker":"Jonathan Pageau","text":"Yeah, wonderful. So right now I'm starting your novel. I have to admit that I'm not very far into it, so I'm not completely aware. I've read a little bit, a few of your articles and a bit of your vision of how artists can participate in this. So maybe you can tell us a little bit about your own journey in terms of how you see, how you've seen the world and what that's where that's brought you. And then we can talk about some vision of the future, let's say."}
{"episode_id":"SW - #158 - 2021-05-15 - Paul Kingsnorth - Environmentalism, the Tower of Babel and the Disintegration of Culture","start":95.9,"end":96.5,"speaker":"Justin Ward","text":"Yeah, sure."}
{"episode_id":"SW - #158 - 2021-05-15 - Paul Kingsnorth - Environmentalism, the Tower of Babel and the Disintegration of Culture","start":96.5,"end":279.86,"speaker":"Paul Kingsnorth","text":"I mean, it's. Yes, it's kind of strange and winding journey, like for a lot of us, I imagine. I mean, I've. I've been a writer for about 25 years now in various forms. Always wanted to be one, but I was also. I was also an environmental activist for a long time. And that came. That really developed out of what I can. I can really only describe it as a spiritual connection to nature. I know that sounds terribly vague, but I've always had a sort of religious or sense of religious or spiritual sensibility in terms of connection with places and love of the natural world. I had that since I was a child. And that sort of turned itself into environmental activism. When I was a student, I spent a lot of time campaigning to protect forests and campaigning to protect landscapes and a lot of direct action, a lot of political activism, climate change and all the rest of it. And the more you look into that, the more you start to realize that there's a deep disconnection between people and places, between people and nature. And that actually that. That's, to me, a spiritual concern as much as anything. Else. And that was one of the things that led me in the end to sort of, I suppose, part ways with the mainstream green movement, which is highly technocratic, very political, very much sees the environmental crisis globally as a sort of technical problem or a political problem to be solved with machinery or carbon counting or political agreements. Whereas to me it's a problem of relationship, a real major global and particularly Western problem with the way that we're living in terms of the rest of nature or creation, however you want to put it. And certainly in recent years, we're starting to see a big cultural disintegration in the West. We're starting to see major ecological disintegration everywhere in terms of climate change and mass extinction and all sorts of other horrors that we hear about all the time. And the more I look at this, the more I've been putting it all together in my writing, in fiction and nonfiction, the more I've seen it as a. As a kind of interlinked cultural and ecological crisis, which is ultimately a root, I think, a spiritual crisis. It's about us being completely out of relationship with, with life, actually with the rest of human life. The way that we live with each other, but also the, the non human life. And that, that's just, that's a spiritual question. That's about how we're living with, with creation and with each other. So really I've been on a journey from activism to kind of post activism, I suppose, if you like. And now, now a kind of very openly, I suppose, religious or spiritual aspect to that, where I think, okay, what's, what's the big picture here? What's really going on? What's the brokenness at the heart of this? Because something is very broken. And I think we can all feel that. And particularly since 2020, it's just been kind of accelerating at light speed. I think we can all feel something really big is going on and it isn't nice and we don't quite know how to put it down, but all sorts of things are falling apart. And that's a difficult thing to live through. But it's also the way I try to look at it is also the beginning of something else. You know, something else is coming along here. And what is it? Is the question that I suppose interests me now."}
{"episode_id":"SW - #158 - 2021-05-15 - Paul Kingsnorth - Environmentalism, the Tower of Babel and the Disintegration of Culture","start":280.1,"end":410.29,"speaker":"Jonathan Pageau","text":"Yeah, one of the things that has been interesting to me watching the environmental question has been how the discourse has often been radicalized in the sense that I always have this sense that the modern world is really a deincarnation, that Christianity, it's As if Christianity had a kind of synthetic worldview, let's say, that became quite strong in the Middle Ages. And then in the Renaissance and Enlightenment things started to split and we didn't see the fruits of that at first, but now we're really seeing the fruits. And you know, I've always actually had a tenuous relationship with the environmental kind of activism because what I saw in it was something of an extreme kind of coming out. And this, the, the idea, even the idea of like nature as a value in itself, like the idea of nature, the idea of the wild, you could say, because there's something of the place that you talk about which, which, which brings human consciousness to the fore, right? The idea of a place in the sense that we recognize this as a, have, having respect or reverence for a place means that it, it, it's like the garden is the best image of that where there is a human element in the sense of a human recognition of a boundary and, and then this natural interaction within the space. Whereas what I've noticed in a lot of the environmental rhetoric is this kind of fetishization of the wild, let's say, and a hatred almost of almost an anti human quality in it. And I don't think it's there everywhere. Maybe it's there mostly in those that make the most noise and so we kind of hear it more. And so because of that I've always been tenuous about it. I, I appreciate the desire because I see the insanity of Western culture, like I can notice the insanity of consumerism and this complete, treating the world like Heidegger talked about, right? The idea of the world as the standing reserve is just this stuff that we can use to further our own agenda. And so I'm curious about your vision of that because I haven't seen, at least me, I haven't seen a lot of people that are able to kind of find that balance in a cosmological sense, almost like in a, in a symbolic sense."}
{"episode_id":"SW - #158 - 2021-05-15 - Paul Kingsnorth - Environmentalism, the Tower of Babel and the Disintegration of Culture","start":410.69,"end":628.18,"speaker":"Paul Kingsnorth","text":"Well, it's interesting, isn't it? I mean the, the, I mean, look, I wrote a manifesto called uncivilization, right? So I've been quite, quite deep in this. But look, I mean the people are in, in the radical green movement especially people are desperate to protect the wild because we're destroying it so fast. So if you look at it in terms of balance, there's always a balance between the wild world, which is the world that basically isn't under the control or domination of humans, mainly modern and human civilization. Now I tend to think that in A traditional society in a pre modern society. In other words, there's a reasonable balance between the human and the non human world. And you don't have a kind of environmental conversation because you don't need one, because you're not destroying everything, you're in some reasonable balance with it. You know, you don't have to romanticize nature, but you don't demonize it either. And you don't just treat it as a resource. I mean, I live in rural island. There's a great long tradition of folk culture here, just as there is in England where I come from, which has a wary respect for nature and which treats it well. And you have to do that because it's a living web, what we've done. And I think, I don't think this is a problem of western culture so much as it's about modernity because it started here, but it's global now, where we have basically desold everything that isn't human. Right. And increasingly dissolved other humans as well. But we treat the world as a resource because we treat, we treat the whole of life as a machine and we treat most of non human life, and indeed much human life as a kind of resource to be fed into that machine and turned into profit at the other side. So that's a question of. That's as I say, this is a spiritual matter because it's a question of respect for creation, which includes humans. And if you don't respect that, if you create a giant machine that eats everything effectively and destroys everything and tries to turn it into plastic junk that we don't even need, then you're going to get a huge reaction in terms of people who want to defend the wild from humans. And what happens a lot is that people get human civilization, the worst aspects of modernity, confused with human beings. And they say humans are the problem, humans aren't the problem, but the way that modern humans are living is the problem. And that's a problem in any number of ways, not just in terms of. I mean, I see the destruction of the natural world, the wild world, as a symptom of the bigger crisis. And that sort of disintegration of aspects of our culture at the moment is a symptom of the same crisis. I think. I mean, you mentioned the garden. I think it's very interesting that I think a lot about the notion of Eden and the Fall. You know, the sort of primal story of Christianity is that we begin in communion in a garden with everything else that's alive and with God who's So close to us that we can see him walking around, okay, and there we are. Everything is there. All life is there. And we chose to leave that because we chose power and knowledge and desire, if you like, individual self will over communion. So we've spent the whole of history trying to get back again, you know, or attempting to rebuild our own garden here on Earth, which is effectively the point we're coming to now. After so many centuries of trying to build our own godless world with us at the center of it, this is what we've come to. And the destruction of the fact that you can change the climate of a whole planet by playing God. To me, that's a spiritual matter, you know. So the question is then not, you know, what technology should we use instead of this one, the question is, what happened? That's the result of eating the apple, if you like. So what do we do now? What do we do now? That's a spiritual matter. That's a. That's got to have a spiritual answer to it."}
{"episode_id":"SW - #158 - 2021-05-15 - Paul Kingsnorth - Environmentalism, the Tower of Babel and the Disintegration of Culture","start":628.5,"end":743.43,"speaker":"Jonathan Pageau","text":"There's an interesting image because you can see if you look at the story of the Fall, you can notice how technology is an answer to the Fall, and it comes from Cain's lineage. Kane is the first one to build a city. And then you can see this pendulum swing between what you could call the wild and civilization. The biggest example is, of course, the flood, which is, let's say, this coming in of the wild to take revenge, let's say, on. On excess of order. And then right away after the flood, what is the first thing they want to do is they want to build a tower. They build a tower. So it's like, if ever a flood comes again, you know, we'll be safe. And so you see this kind of pendulum moving back and forth between these two extremes. And the powerful imagery of the New Jerusalem is actually a balance that people wouldn't think that that's how the balance should be, but it's a powerful balance because in the center of the city is the tree and the water of life, and then on the margin is the wall of the city. And so we tend to think the opposite. We tend to think that it's like the city in the center and then the trees in the wild on the outside. But the image that is brought about in the New Jerusalem is rather of this kind of pristine reality in the center. And then the wall is there to kind of protect, almost protect that pristine reality rather than the opposite, let's say. And. But it's pristine, but it's also More of a garden than it is just of the. Let's say, of the wild, the way that we understand it. Because in the. In the last image, it also says that the. That there's no ocean, which is actually a crazy image, that. That image is hard to totally understand. When it says in Revelation that there's no ocean left, you're thinking, there's no ocean, no chaos at all. Like, I don't totally get it, but. But that's the final images of this. Let's say there's flowing water, but not this kind of chaotic water, let's say. I don't know if you ever noticed that this interesting final image of how the garden and the city come together in the."}
{"episode_id":"SW - #158 - 2021-05-15 - Paul Kingsnorth - Environmentalism, the Tower of Babel and the Disintegration of Culture","start":743.51,"end":760.56,"speaker":"Paul Kingsnorth","text":"No, no, I hadn't thought of that, actually. No. But I mean, I think, yeah, the Tower of Babel is another one of those great stories I puzzled over for ages and thought, this is very strange stories of what's going on here. But, yeah, this is. Everyone gets together and says, if we build this high enough, we'll get up. We'll get back to God where we should be. Yeah."}
{"episode_id":"SW - #158 - 2021-05-15 - Paul Kingsnorth - Environmentalism, the Tower of Babel and the Disintegration of Culture","start":760.56,"end":814.26,"speaker":"Jonathan Pageau","text":"And it's also the one thing that's kind of implicit in the story is that it's getting back to God, but it's also avoiding the flood, because they just came out of a flood. And so they're saying, if we build up high enough, you know, we'll reach to God and then we'll also be safe if there are these. These waters. Because there's a tradition that says that the Garden of Eden was never like. In Senefer the Syrian, there's a tradition that talked about how the Garden of Eden was never flooded and that the. The water of the flood came up to the gates of the garden and never entered. So this image of this reality which is above the chaos and kind of holds. And the man says, no, I'm going to build that. I'm going to build a mountain. I'm going to build a thing that's going to avoid any problem. And right now, if you understand, when we look at the control measures of COVID that are being set into place, you get a sense that there's something of that where people think that they're going to create a world where there's no danger, where there's no risk."}
{"episode_id":"SW - #158 - 2021-05-15 - Paul Kingsnorth - Environmentalism, the Tower of Babel and the Disintegration of Culture","start":814.82,"end":963.47,"speaker":"Paul Kingsnorth","text":"This is the machine, isn't it? Surely. Right. This is. This is the fall. This is what you do when you eat the apple, right? You say, I'm not going to trust God, which is the same thing as trusting nature, actually. Because that's the creation. I'm not going to trust God. I'm not going to be in the garden, I'm not going to live within the natural law. I'm going to take control of everything and I'm going to build a world which is better. What that means is a world that's better for people. Okay? So it doesn't matter if we kill everything else to do that. And it doesn't matter if we end up actually putting ourselves into a kind of slave state where we have no freedom either, because at least we're in control. So it's this desperate grasping for too much order and then, then the pendulum swings and then comes the chaos, which is the climate change, which is the extinction, which is the cultural disintegration. Because that's what happens if you try power without wisdom. And that's, I just, you know, this is this constant I'm finding. You know, it's interesting to me when I look at the New Testament, when I look at the gospels and I think the ultimate image of Jerusalem there is an image of murderous power, right? I mean the over civilization of Jerusalem. It's when Jesus goes to Jerusalem that he's tortured and brutalized and killed. Most of the time he's wandering around in small cities. He's hanging around by the lake, cooking fish on the shore. He's, you know, he's, he's in the small towns, he's in the villages, he's going barefoot. It's when he goes to the city and tries to take the message to the heart of empire that he ends up crucified. That's what the power does. You know, it's like the city as an image of this great controlling kind of Moloch, this Babylon if you like. There's always a balance. And if it gets out of balance, we talk about chaos and order. If the balance gets out, this is what you do. And it seems to me that modernity obviously takes God out of the picture. And that means it takes humility out of the picture. And if you remove obviously anything that's above you, then you become the center of the picture. So humans are at the center of the modern story. So why not just make the world in our image? And we know where this ends up. This ends up in Silicon Valley, this ends up in transhumanism. This ends up with let's upload our minds and live forever and let's remake everything in the world from the nano level downwards so that it suits modern human beings, which is the kind of the project at the moment, and yeah, absolutely, with COVID has kind of accelerated this race towards the great controlling machine. And it is like very much like the temptation of the snake, you know, it's very much like the devil's offer. It's like, well, you can. Look, you get all this power, but obviously you lose all of your freedom and you destroy the rest of nature. But never mind, because at least you can behave like gods. Yeah."}
{"episode_id":"SW - #158 - 2021-05-15 - Paul Kingsnorth - Environmentalism, the Tower of Babel and the Disintegration of Culture","start":963.47,"end":1003.81,"speaker":"Jonathan Pageau","text":"And there's. There's. The images that you brought about of Jerusalem is so powerful because we know that Jerusalem also got destroyed. And some. One of the warnings that Christ is telling them, and they don't know, but they. They don't understand, but he's telling them, like, it's coming, there's something coming. You don't see it, but there's a. There's something on the horizon. It's almost like there's a play on the story of Jonah in Christ's story, because Jonah goes to the city, warns the city, and they repent. And he says even that the animals repent, which is really fascinating. And so he says that they repent and then God preserves the city, whereas Christ is basically telling them, you need to repent. They don't. And then Jerusalem is actually destroyed."}
{"episode_id":"SW - #158 - 2021-05-15 - Paul Kingsnorth - Environmentalism, the Tower of Babel and the Disintegration of Culture","start":1004.77,"end":1008.66,"speaker":"Paul Kingsnorth","text":"Yeah. God is not mocked. Actions have consequences, you know."}
{"episode_id":"SW - #158 - 2021-05-15 - Paul Kingsnorth - Environmentalism, the Tower of Babel and the Disintegration of Culture","start":1009.54,"end":1042.08,"speaker":"Jonathan Pageau","text":"And so tell me a little bit, because I know that your journey ultimately did lead you to Christianity, to Orthodoxy. And so I'm curious to know a little bit about your process, about how you. Because for a lot of. Although I think that you sense and I sense that this is a move that's happening. Like, there's an interesting zeitgeist right now. There's a capacity of people to move towards Christianity and to understand it. That maybe wasn't there even 20 years ago. But I'd like you maybe to hear kind of in your words how this. How this led. How you were led to this."}
{"episode_id":"SW - #158 - 2021-05-15 - Paul Kingsnorth - Environmentalism, the Tower of Babel and the Disintegration of Culture","start":1042.56,"end":1390.71,"speaker":"Paul Kingsnorth","text":"Yeah, well, I was led to it because I didn't want to go there at all. I did not want to be a Christian. I just point this out. I didn't like Christianity and I didn't like Christians, and I didn't want to be a Christian. So, you know, God's got a sense of humor. He definitely has got a sense of humor. I mean, look, I was a kind of eco pagan. Right. When you're an environmentalist, you know, you're in love with nature and you want to. If you realize this is a spiritual matter and so many people do, you end up wanting some sort of container for that. And so people look for that, but there isn't one in the modern world. I mean, you know, there were all sorts of old nature religions around, but we haven't got them anymore in the West. There's no way of connecting with the divine through nature in any serious way. So you try all sorts of things. And I tried all sorts of things. I mean, I was actually a Zen Buddhist for a while. That's a slightly different. Different tack. But I started about 10 years ago looking for a path and I practiced Zen. And Zen is. Zen is a very good path. It's a disciplined, serious old path. But. But there was something missing from it which turned out to be God, which is what I was looking for. And then I was into. Yeah, I was exploring all sorts of mythical paths. I was a Wiccan for a while, which was interesting and quite fun. But again, you have a sense that this is a modern thing that's been constructed out of old bits, some of which work and some of which don't, but it isn't. There's no theology to it. There's no seriousness to it. There's something, isn't there? And this is, you know, the state of the modern world is, I think, why so many Orthodox people especially get into reading Father Seraphim Rose, you know, because he's like the patron saint of lost. Western people go through everything before they find Christianity. I mean, he was. He was doing everything. He was studying Chinese, he was practicing every faith, because this is what we do in the west, because we haven't. We feel we have nowhere to go. And the reason for that is that the Western church for so long was tied up with power. It was tied up with the institutions that actually were crushing people and were destroying the earth. And there's the old Christian story about dominating and subduing earth, which everybody believes is what the faith is about. And so, rightly or wrongly, everybody has a very negative attitude to Christianity, and especially established Christianity, because it seems to be tied up with the system that's crushing everything. You know, it's tied up with the civilization that everyone in the west has been rebelling against since at least the 1960s. So you don't look there and, you know, I didn't look there. I thought, well, obviously Christianity's got nothing for me. So that's. I went to enough assemblies at school where I had to listen to Vickers lecturing me about the Gospels and had no idea what they were talking about. And it's just. So. I didn't expect to be A Christian. But I had. I mean, I had a number of things happen to me over the last 18 months. I had dreams, I had visions, I had weird things, weird stuff happening. I mean, I was. I was literally dragged. You know, this is. Jesus is quite good at this, isn't it? He turns up and drags you in. He shepherds you in, he says, look, come on, wake up, mate, get a grip. This is where you're supposed to be going. So I was sort of. A lot of things happened to me. I suddenly had Christians coming at me left, right and center, emailing me and talking to me about my books, and for no reason at all. And it was just. In the end, I couldn't ignore it. And I thought this must be real because I don't want it to happen. So, you know, I started exploring it, talking to people and praying and learning what it was all about and looking for a church. And the more I read about Christianity, especially mystical Christianity, but also especially about Eastern Christianity, the. I thought, this isn't the story. I thought it was. You know, I thought Christianity was a bunch of moral lessons. I thought it was a bunch of things you were supposed to do so that you went to heaven instead of hell and you had to be good and do certain things. And. And I thought, well, why would I need a guy from 2000 years ago to tell me that? And I don't believe it anyway. But the more I realized what was actually going on, the more I realized that this is a mystical path. It's a path to God. It's a path of stripping back and renunciation. And the more I found Orthodoxy. I had a couple of friends who turned out to be Orthodox Christians, which I hadn't even really known before. And then I started reading the Desert Fathers and I started reading that, you know, the Philokalia. And I thought, wow, this is really. This is powerful stuff. This beats anything that the Buddhists have got to offer, you know, or at least it's actually very similar in some ways in terms of the depth of the mystery. And I thought, yeah, this, this church thing that I thought I knew about, it's not what. Not what I thought it was, and here's a powerful path. And then of course, you start reading the Gospels and you think that there is. I can't think of anything that's more radical actually, than the teaching of Christ. And, you know, once you start to separate that out from many hideous things people have done with it over the centuries, you think, well, this is. This is just as relevant as it Ever was. And we're completely failing to do this. This is radical humility. And if we had practiced this, we wouldn't be in this situation. You know, we wouldn't be here. So the sort of. And then I was. I was reading the Irish philosopher John Moriarty. He's a very interesting man who kind of combined his love of the Irish landscape and myth with his Christianity. He rejected Christianity as well. He ran off to Canada, actually became an academic, and then came back home. And I was reading his autobiography, and he has a line in there, and he says, the story of Christianity is the story and a story of man's rebellion against God. And I thought, wow, I'd never seen it like that. And it kind of all clicked into place when I read that. I thought, that's exactly what this is, isn't it? We're rebelling against God. We put ourselves at the center of the picture. We've eaten the whole world and now we're eating ourselves because we're still in that rebellion. So what would trying to get back to God look like? And when you realize that actually what Christ is teaching you is the way back, you know, but you do have to carry a cross. So it's not much fun. It's not. It's not an easy. It's not an easy path that you can add to your consumer package. But I thought, this is real. And then I thought, what am I going to do with that information? So here I am."}
{"episode_id":"SW - #158 - 2021-05-15 - Paul Kingsnorth - Environmentalism, the Tower of Babel and the Disintegration of Culture","start":1391.59,"end":1517.25,"speaker":"Jonathan Pageau","text":"Yeah, but I think your path is really reflecting so many of us that say, that found traditional Christianity, ancient Christianity. Reading. It's actually a positive thing right now in the sense that with the new atheists and with kind of really, let's say, superficial Western Christianity, there's a surprise element that is possible. Like if you read St. Gregory of Nyssa, if, like you said, you read the Philokalia, people don't expect that. They've never heard about any of this. And so it's almost like open up the curtain at the end and just revealing this mystery that people didn't think was there. So there's something exciting about that as well. One of the things that I've been working on with a lot of people and I think you might find this interesting, is also going really going back into the legendary aspects of Christianity and just going. Not avoiding anything you were talking about in Ireland and people who were able to unite the ancient Irish thinking and this mythical thinking with Christianity. And I think that this is something that is really, it's worth our time and our Effort, because it's one of the solutions. It's one of the things that's going to re. Enchant the world. There's a reason why people love Star wars and Tolkien and Harry Potter and all of these things, because they're finding something in there which is really true and which is really invigorating and gives a sense of life. And Christianity had so much of that, and it was kind of stripped away by rationalists and modernists to a point where Christianity itself was stripped away and rediscovering these ancient stories, you know, also, even though, like the whole medieval synthesis of the Trojan, Trojan legend with Christianity and Alexander the Great with Christianity and this kind of ambiguous universal story that was flexible, it wasn't like a system, but it was this flexible web of references that could be drawn out and brought up and we could make. Participate in our story, let's say."}
{"episode_id":"SW - #158 - 2021-05-15 - Paul Kingsnorth - Environmentalism, the Tower of Babel and the Disintegration of Culture","start":1517.57,"end":1618.17,"speaker":"Paul Kingsnorth","text":"Yeah, I mean, I think it's. What's so interesting about your work is that you're trying to find the symbolic pattern, you know, the picture of reality that Christianity is actually teaching us, which is not something I ever thought about. I didn't think Christianity had that. Like I said, I thought it was just a list of moral rules. You know, over the last 10 years, I've been reading a lot of mythology. I have friends who are mythologists. I work with. I work with myths quite a lot. And it's so obviously clear that humans need a mythic picture of the world. We have a mythic mind. We need to see these patterns in reality. And if, you know, Christianity is either true or it isn't. And if it is, then it should be able to paint that picture for us and that picture should be able to interweave into our landscape and into every area of our lives. It's not. It's, you know, if Christianity is a thing which is imposed from somewhere on you, then it's a tyranny and it isn't real. And it has behaved like that sometimes, but actually, at the root of it, that's not what it is. And it can. You know, it's so fascinating. In Ireland, almost every few miles in Ireland, there will still be a holy well, and the holy well will have a statue of Mary over it. It's never very, very few statues of Christ, actually. It's usually Mary. It's a feminine presence in this water. There's still a great holy mountain crop, Patrick, that people do a pilgrimage up to every year. It's. It's very much Christianity here has been in the Landscape for so long, you know, for a thousand years or more. And it still is, actually. Even though much of the country is kind of walking away from. From the church, it's still somehow mystically in the place. You know, that's how it should be. There's a pattern of. As I say, there's a pattern of reality that ought to be able to link us back to the kind of the big symbolic world, but also the ground under our feet as well."}
{"episode_id":"SW - #158 - 2021-05-15 - Paul Kingsnorth - Environmentalism, the Tower of Babel and the Disintegration of Culture","start":1619.37,"end":1645.31,"speaker":"Jonathan Pageau","text":"There's a way. There's a way in which Christianity kind of seeped in so deep in terms of worldview for a while that people took it maybe for granted and thought as they were starting to strip away its elements, you know, thought that the world would still. That. That the compass would still remain straight even if we started to strip that away. And then as it gets stripped away, suddenly things start to get shaky and fragile and we start to notice how things are falling apart."}
{"episode_id":"SW - #158 - 2021-05-15 - Paul Kingsnorth - Environmentalism, the Tower of Babel and the Disintegration of Culture","start":1645.55,"end":1650.67,"speaker":"Paul Kingsnorth","text":"Yeah. And I think that's exactly where we are in the west at the moment. I think this is the final crumbling of Christendom."}
{"episode_id":"SW - #158 - 2021-05-15 - Paul Kingsnorth - Environmentalism, the Tower of Babel and the Disintegration of Culture","start":1650.9,"end":1651.14,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #158 - 2021-05-15 - Paul Kingsnorth - Environmentalism, the Tower of Babel and the Disintegration of Culture","start":1651.14,"end":1690.28,"speaker":"Paul Kingsnorth","text":"Because a culture can't survive without the divine at its center. It's not possible, whether it's Christian or otherwise. If you have not got a divine center to your culture, you're going to collapse into nihilism, which I think is what we're doing. I don't know if you have this in Canada. We had this phenomenon in Britain for a while called atheist churches. Do you have these? Yeah, I mean, it's. I find them very funny, but, you know, it's. It's just. It's just. It's telling that people still need that structure. They need a symbolic structure which is created to take them to God. They just take God out. Yeah. They still go, you know, because people can't actually manage. We can't manage without some sense of that great symbol of God at the center of things."}
{"episode_id":"SW - #158 - 2021-05-15 - Paul Kingsnorth - Environmentalism, the Tower of Babel and the Disintegration of Culture","start":1690.44,"end":1705.56,"speaker":"Jonathan Pageau","text":"Yeah. The funnier ones are like these kind of fact is Jedi Orders. And also there's a us called Harry Potter and the Sacred Text where people will like gather in these churches and they'll read Harry Potter almost liturgically and then have these conflict."}
{"episode_id":"SW - #158 - 2021-05-15 - Paul Kingsnorth - Environmentalism, the Tower of Babel and the Disintegration of Culture","start":1705.67,"end":1707.19,"speaker":"Paul Kingsnorth","text":"That's a new one. I haven't heard that. Right."}
{"episode_id":"SW - #158 - 2021-05-15 - Paul Kingsnorth - Environmentalism, the Tower of Babel and the Disintegration of Culture","start":1708.31,"end":1768.96,"speaker":"Jonathan Pageau","text":"I mean, cosplay is a great example of how much people need religion. It's this desire to be in a story and to participate and to have a mythical structure. But there's something like this is. Maybe what I'm seeing is that there's a mystery even in the death of Christianity, almost As if it was something that was meant to happen. You know, Christ seemed to have pointed us to that and prepared us for that. And it's almost as if, just as Christ dying planted a seed, a cosmic seed that would. Would grow into what would go into Christendom. It's almost as if Christianity dying is doing something similar. Because as Christianity is dying, there's this distance which is created, and all of a sudden we can see the Christian story appear in places we couldn't see it before. You know. You know, I kind of joke about every single Hollywood movie is basically has a. All these Hollywood action movies has a resurrection scene. You need a resurrection scene or else you're not gonna make, you know, more than 100 million with your movie. And so. But that's a."}
{"episode_id":"SW - #158 - 2021-05-15 - Paul Kingsnorth - Environmentalism, the Tower of Babel and the Disintegration of Culture","start":1768.96,"end":1769.32,"speaker":"Paul Kingsnorth","text":"That's a."}
{"episode_id":"SW - #158 - 2021-05-15 - Paul Kingsnorth - Environmentalism, the Tower of Babel and the Disintegration of Culture","start":1769.32,"end":1797.29,"speaker":"Jonathan Pageau","text":"It's like it's a Christian story. Or even the idea of self sacrifice all of a sudden. We thought self sacrifice was an obvious trope, but it's not. Look at, look at ancient Greek myth. You don't. You barely find that. That trope. There's a. Maybe little. Little hints of it, but it's not a major story. Whereas the notion that the hero sacrifices himself for others is a Christian story. And so as Christianity retreats, we can see it. Can see it there, and we can see how it's actually going to become more fragile as we. As we retreat from that."}
{"episode_id":"SW - #158 - 2021-05-15 - Paul Kingsnorth - Environmentalism, the Tower of Babel and the Disintegration of Culture","start":1797.77,"end":1893.28,"speaker":"Paul Kingsnorth","text":"Yeah, I think David Bentley Hart said something about that, one of his pieces that I read recently that, you know, as Christendom dies back, you can see Christ more clearly. Which I think is a good way of putting it, because, you know, also a lot of Christendom did not actually represent Christ at all. You know, a lot of it actually became so tied up with power that it became a culture which wasn't necessarily following the teachings of Christ at all. So once that's gone, we can stand up and go, okay, well, yeah, now we can see what the teachings are, so we can decide if we want to follow them or not. And we can also see that we can also see the story more clearly, perhaps when it doesn't. Well, yeah, like you say, when we've lost it, when we've lost the structures that were built around that story, however imperfectly, we all. We can see the story, but we can also start to feel very lost having lost it. Which might be a reason why so many people are suddenly, including me, finding themselves brought into Christianity. Not for cultural reasons. It's not a political decision or anything like that, but something's calling something's going on because it isn't possible. It isn't possible to live for very long without that sacred heart at the heart of your culture and at the heart of you as well. It's not, you know, I think you have the luxury of rejecting religion if you're in a culture which kind of holds it up. But if you're in a culture that has nothing, if you're in a culture that has replaced any sense of the divine, any sense of the sacred, with basically consumerism and individualism, then rejecting religion is suddenly not a fun piece of rebellion anymore. You know, it's like, oh, shit, I think I've just realized what that thing was for that we destroyed."}
{"episode_id":"SW - #158 - 2021-05-15 - Paul Kingsnorth - Environmentalism, the Tower of Babel and the Disintegration of Culture","start":1893.68,"end":1912.33,"speaker":"Jonathan Pageau","text":"Yeah, well, it's funny because the atheists promised us replacement, right? They promised us some, some great cultural replacement for the Christian story and these, these great acts of participation in this. But that's not what we got. What we got is porn and fast food. Like, we didn't get. We didn't get, you know, a great."}
{"episode_id":"SW - #158 - 2021-05-15 - Paul Kingsnorth - Environmentalism, the Tower of Babel and the Disintegration of Culture","start":1912.41,"end":1913.45,"speaker":"Paul Kingsnorth","text":"We got Star Wars."}
{"episode_id":"SW - #158 - 2021-05-15 - Paul Kingsnorth - Environmentalism, the Tower of Babel and the Disintegration of Culture","start":1913.61,"end":1928.8,"speaker":"Jonathan Pageau","text":"We don't get Star Trek. Yeah, we don't get Star Trek. Like this wonderful rational culture of people who, who explore with Christian virtues the, the galaxy. It's like that's not what's going on. Getting something much, much darker and much, much stranger."}
{"episode_id":"SW - #158 - 2021-05-15 - Paul Kingsnorth - Environmentalism, the Tower of Babel and the Disintegration of Culture","start":1929.28,"end":1979.24,"speaker":"Paul Kingsnorth","text":"Well, the other thing is that liberalism doesn't seem to work without Christianity either. I mean, I think that's the big story of the moment, that liberalism was the thing that was supposed to replace Christianity. But as you say, and you know, Tom Holland was very good on this in his book Dominion. He was, he was, he did a very good exploration of how liberalism is basically a reboot of Christianity. And it works when you have a society that still broadly has Christian values. But if they've gone, you could buy by liberalism because there's no reason anyone would believe this stuff because we suddenly realize that we're all creating our own values and there's absolutely no reason we should all agree with each other. And so there's no center, you know, and any society with no center is not a society. And I've seen you, you've talked about that at length. I know, but this is where we are. So people are starting to look around and say, well, shit, what was at the center? What's going on here? There's suddenly, there's a whirling chaos. What have we, what have we missed out on?"}
{"episode_id":"SW - #158 - 2021-05-15 - Paul Kingsnorth - Environmentalism, the Tower of Babel and the Disintegration of Culture","start":1979.6,"end":2075.08,"speaker":"Jonathan Pageau","text":"Yeah, exactly. And the desire to replace that. There is a desire to replace it with this kind of new woke culture. But It's a dangerous game because it has a very powerful scapegoat mechanism that doesn't have a solution to it. And so people who are kind of going down that road will find themselves. They're going to find themselves like Puritans, flogging themselves constantly, like this kind of self deprecation and this, like you think you see these, these struggle sessions, like Chinese struggle sessions that you see. People are kind of posting about them because they're noticing that this is where we're going in terms of a culture. And so it's one. It's. What's strange is to realize all of a sudden that we're on the edge of culture. It's like I'm noticing, like I'm seeing the type of person that I would, that I would have recognized before as being the punks or these kind of edge of culture people who can see where it's going and are making the first adopters, I guess they call them, that I'm seeing, I'm noticing that they're becoming Christians, or becoming at least more traditional Christians, liturgical Christians, because liturgy, they intuitively understand that there's something about the world which is magical and that there has to be a ritual form to it. There has to be something. There has to be this form that is binding reality together. Sometimes it's not explicitly understood, it's sometimes more intuitive. And then they can see liturgical life and ritual life as part of that. So I don't know if that's something that you've thought about yourself."}
{"episode_id":"SW - #158 - 2021-05-15 - Paul Kingsnorth - Environmentalism, the Tower of Babel and the Disintegration of Culture","start":2075.4,"end":2160.31,"speaker":"Paul Kingsnorth","text":"Yeah, no, a lot, actually. I mean, that's the other thing I discovered with Orthodoxy, is that the liturgy is so powerful, the central ritual is so powerful. And again, Western Christianity didn't have any rituals in it, or at least it does, obviously, but not that I'd ever seen as being very significant. Because the Reformation changes the role of a church from being a center for ritual to being a sort of center for moral teaching. You take out the ritual, I mean, you still probably do the Eucharist and stuff. But it's a bit by the by, really. What you're getting is a lecture. And that's what I always thought Christianity was, that it's a lecturer who tells you what Jesus wants you to do. As soon as you experience a ritual, then you think, oh, my goodness me, this is what it's supposed to be about. God's in the room. You know, this is what's supposed to be happening here. And again, a lot of the work I've done with mythologists and reading of myths from cultures around the world. The culture can't survive without central rituals. And they're always rituals which are designed to take people to the divine in some way beyond ourselves. And we haven't got that. And even our Christianity hasn't had that for a long time in Protestant countries anyway. And so that's a major loss. And it's one of these things that people don't even know they've lost. You know, I grew up with not knowing I'd lost this. It's a bit like initiation ceremonies. That's another thing traditional cultures have. You know, you'd be initiated from childhood to adulthood. In a serious culture, we don't have that. And so we're perpetually in arrested development. You know, all the adults are behaving like children."}
{"episode_id":"SW - #158 - 2021-05-15 - Paul Kingsnorth - Environmentalism, the Tower of Babel and the Disintegration of Culture","start":2160.47,"end":2160.95,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #158 - 2021-05-15 - Paul Kingsnorth - Environmentalism, the Tower of Babel and the Disintegration of Culture","start":2161.11,"end":2224.98,"speaker":"Paul Kingsnorth","text":"Aspiration of a 75 year old is to still look like a 30 year old. That's, you know, because we haven't been initiated though. We don't know we're missing that either. And you know, you mentioned that the sort of woke culture thing. I often think that social justice is like, you say it's like, it's like the Sermon on the Mount, but without love or forgiveness or God. So it's like all the stuff that you actually need to leaven that strict moral message that you get from Christ is taken out. And once you have a kind of moral teaching without love or any higher purpose, you have a tyranny potentially. But at the heart of it is people trying to make something that they think they need because they don't know what they've lost. Yeah. And it's there. So there's so many lost people. You know, we've all been there, floundering about, thinking something, something is really missing. There's a massive void here. Yeah. But we have no idea how to fill it. And I think that's where we are. And, but like you say, there's. That's a lesson that's given to us. It's probably a lesson we need to learn. So that's that. That's probably the question, isn't it? How do we learn that lesson and what do we draw from it? Yeah."}
{"episode_id":"SW - #158 - 2021-05-15 - Paul Kingsnorth - Environmentalism, the Tower of Babel and the Disintegration of Culture","start":2224.98,"end":2340.94,"speaker":"Jonathan Pageau","text":"And how can we. Because I think a lot of people are going to learn that lesson one way or another. You know, one of the things we saw in 2020 is a return of a liturgical action. You know, all the George Floyd protests, the fact that they were worldwide, which is just, I mean, it's just insane to think that something like that caused such a worldwide worldwide phenomena. But it was really. Because it was a religious action. You know, it was based on a. On a sacrifice which was experiment, which was experienced as a catharsis by people and this kind of flowing out of religious feeling and then going out into the street and processing and chanting and kneeling and doing all these religious gestures. And so it's coming back. Religion is coming back. There's nothing we can do to stop it. Right now all the new atheists, they're wrong. They're wrong about how reality works. And it's playing out. And the question is, how is it going to play out? Because the sacred has a very. The sacred, or the desire for the sacred has a very dark tendency. You know, and if you read. I was really. I've been talking about the Baki for some reason many times recently. But, you know, if you think of the. This kind of. This image of the sacred out of control which you see in the Baki where there's this ripping apart, right, this sporagmos of the, of the, of the, of the people, this is something which is right on our horizon. If, if there isn't, if there isn't this balance which Christ brought. Because, because that aspect of, of the sacred is there in the Christian ritual as well. You know, the communion is scandalous. Communion has something of the human sacrifice in it, but it's taken up into something more, right? It's taken up. It's not let out into its extreme where it becomes a form of, of insane scapegoating or this kind of destruction of, you know, this ripping apart of the king or whatever it is that goes on in these, in this religious tendency we have. It's brought into something higher."}
{"episode_id":"SW - #158 - 2021-05-15 - Paul Kingsnorth - Environmentalism, the Tower of Babel and the Disintegration of Culture","start":2342.38,"end":2448.5,"speaker":"Paul Kingsnorth","text":"Yeah, I mean, I think religious, you know, we all know what religious fanaticism looks like. It's like a dark tendency in all of us, like you say. I think, I think in watching another of your films recently, and you said religion is inevitable, and I thought that was. That really stuck with me because I thought, yeah, that's exactly right. Religion is inevitable. So it can take any number of shapes. And some of those shapes could be hideous, right? You could be the Aztecs cutting the hearts out of children and throwing them down pyramids, or you can indeed be, you know, Christians burning witches. So there's any number of shapes that, that fanaticism can take. And if it isn't tempered by the fact that you're supposed to carry across, and if it isn't tempered by the fact that you have to love your enemies even when they hate you, right, you're so. You are mandated to love the people you hate, basically. And you'd better make an effort to do that because, you know, and you've got to forgive people 70 times, seven times, and all of this stuff, which none of us wants to do. And it's really hard, but that's. It's got to be a reason that Christ is endlessly telling us that and also endlessly telling us how. How problematic wealth is. And you know St. Paul's great, great quote about how God uses the meek to humble the strong, you know, he is the weak to teach the powerful. And the fact that Christ spends all his time with the poor and the meek and the dirty and all the people who are shunned, he never spends any time with the powerful at all until right at the end. And then when Pilate asks him what truth is, he won't tell him. He just says, my kingdom is not of this world. It's got nothing to do with you. You know, if you want to know what truth is, you better take your shoes off and follow me, because I'm not going to explain it to you here. No. And that if you don't. Yeah. If you haven't leavened it with that sacrifice of yourself and not other people, that's the key thing. You've got to sacrifice yourself and not the bad guys out there. Because we all hate the bad guys out there. And they're never asked. It's always."}
{"episode_id":"SW - #158 - 2021-05-15 - Paul Kingsnorth - Environmentalism, the Tower of Babel and the Disintegration of Culture","start":2449.94,"end":2563.88,"speaker":"Jonathan Pageau","text":"That's really. That's the solution that Christ offers. It seems to us like a simple solution because we've been. We've had it for 2,000 years. We think it's obvious, but it's. This is. This was like the key to all of reality. Like the key of self sacrifice that Christ gave us is basically the key to reality, of how to temper all the elements to bring them all together. Because there is a. There is this. There is this need for this. This perception we have that something has to be sacrificed. And you know, and then if you're able to really understand that ultimately that's you, then. Then you're able to. To fulfill all the elements of reality into one, into one thing. But like you said, it's so hard. Like, who followed. The thing about Christ is that it's this interesting situation where on the one hand his teaching is impossible, it's just completely impossible with the things he says are impossible and nonetheless they act as the source of reality. And then you could say that it all flows out of Christ and no one really is able to completely Follow what Christ says because it's an impossible standard, but it acts as this barrier, as this ideal that is a true ideal that we can follow. And so the self sacrifice for some people won't be this ultimate sacrifice, but it will maybe just be like instead of drinking the money I get from my salary, I'm going to give it to my kids, right? I'm going to actually buy food for my kids. Can be as stupid, as small as that. But then it's part of that notion of self sacrifice which kind of feeds into the world and creates. Basically everything good about Western society is based on that. It's based on the idea that we understand that the things we have, we need to put them to the service of others. Even if it's as little as that, it still participates in this ultimate sacrifice which we should be aiming towards, let's say."}
{"episode_id":"SW - #158 - 2021-05-15 - Paul Kingsnorth - Environmentalism, the Tower of Babel and the Disintegration of Culture","start":2563.88,"end":2587.36,"speaker":"Paul Kingsnorth","text":"Yeah, so everything good about Western society comes from that teaching. So if you take that out, you just get everything that's bad about Western society. Right. You get all the colonialism and the Coca Cola and, and the self righteousness, but you don't have what's actually at the heart of it. What I find so interesting about reading the Gospels as well is how honest they are about the fact that virtually everybody who's following Christ also just walks away. You know, they're always going, what are you talking about?"}
{"episode_id":"SW - #158 - 2021-05-15 - Paul Kingsnorth - Environmentalism, the Tower of Babel and the Disintegration of Culture","start":2587.36,"end":2589.52,"speaker":"Jonathan Pageau","text":"They don't understand. Yeah, don't get it."}
{"episode_id":"SW - #158 - 2021-05-15 - Paul Kingsnorth - Environmentalism, the Tower of Babel and the Disintegration of Culture","start":2590.08,"end":2601.72,"speaker":"Paul Kingsnorth","text":"And they were saying, well, how can anyone do that, you know, what do you mean, give all your money away? What do you mean walk away from your parents? What are you talking about? And even at the Last Supper where he says, you know, here's my body and here's my blood. Like most of them just say, oh, that's disgusting."}
{"episode_id":"SW - #158 - 2021-05-15 - Paul Kingsnorth - Environmentalism, the Tower of Babel and the Disintegration of Culture","start":2601.72,"end":2629.2,"speaker":"Jonathan Pageau","text":"And then they all leave that scene in the Gospel of John where he's actually in the crowd and he says, if those who do not drink my blood and eat my flesh have no part in the kingdom. And I think I saw a movie version of it where they actually portray that scene. He's standing in a crowd and he's telling people that. And you think, if I had been there, I would have wanted to stone him too. He's saying something completely. There's no limit to what he's saying."}
{"episode_id":"SW - #158 - 2021-05-15 - Paul Kingsnorth - Environmentalism, the Tower of Babel and the Disintegration of Culture","start":2630.29,"end":2717.15,"speaker":"Paul Kingsnorth","text":"And that's the, you know, that's the, that is the story. But it's. If you haven't got. And that, that's obviously also the reason why in the early centuries people thought Christianity was so weird or disgusting. You know, this God is ludicrous. What sort of a God gets himself killed? You know, the gods are supposed to be heroes. What do you mean? This God is a weak guy from some tiny little town, gets himself killed for no reason. You know, that's what's. What's heroic about that. But that's the. That turns the world on its head, that turns everything upside down. I mean, firstly, God comes to earth, walks in human form, and what do we do? We kill him, right? That's typically human, isn't it? We laugh at him, we ignore him, we don't believe him, and then we kill him. And then we realize afterwards what we've done. But the story is that everything that you thought was real, it's not real, you know, and Christ says, you know, you know what the Gentiles do? They get power by lording it over everybody else, but we get power by serving people. And that does turn the old world on its head. It's a radical notion. And as you say, all of us regularly, daily fail to obviously actually do it. But even small gestures towards it, if everybody is doing that and if everybody has that as the sacred image, that's why the cross fascinates me so much. That's the sacred image. That's God dying up there because we killed him. But he chose to do that because that's what we need to do as well. That's the story. That's the whole story there. That sacrifice defeats death. And that sacrifice shows us how to live. So what are you going to do with that?"}
{"episode_id":"SW - #158 - 2021-05-15 - Paul Kingsnorth - Environmentalism, the Tower of Babel and the Disintegration of Culture","start":2717.15,"end":2841.42,"speaker":"Jonathan Pageau","text":"You know, exactly once. But it's interesting because once you pierce, like when you start to pierce the mystery, like once you start to actually have a glimpse of what Christ is doing and seeing why it had the effect that it did, you actually start to realize that reality actually works that way. Like the idea that sacrifice was the core of how the world worked. It's something that has been there for thousands of years. It always been there. Like sacrifice has always been the source of reality, let's say, out of which communities would flow. The altar would always be the most sacred space in the ancient pagan temples because there was something understanding about something. And it's almost like as if it was a puzzle being played out. Like there was this puzzle being set in the world and people were getting parts of it and parts of it and parts of it. And then suddenly you see this image of the sacrifice of Christ as the self sacrifice and this idea that Christ did it in submission to the Father, but then giving himself to those who were his body. And you realize, wait a minute, that's how things work. Like the greatest thing you can do as, let's say, the elements of a country. Like, if you want a country to stay united together, you have to sacrifice yourself to the higher ideals of that country, or else. And then you give your strength, your body, you give your strength to those that are around you, those that are below you. And that's actually how a country works. If we don't do that, then we're not going to be able to be bound together. You can imagine a father is the same. The father has to give himself to that which is holding the family together and then give his strength and his and his actions down to his children and to his wife. And so it's like, wait a minute, that's actually how reality works. Like, Christ is actually revealing to us a mystery that has been kind of hidden from the beginning and has been kind of. The people have been trying to figure out and trying to embody ritually. And then Christ offers you this solution, and then we don't want to do."}
{"episode_id":"SW - #158 - 2021-05-15 - Paul Kingsnorth - Environmentalism, the Tower of Babel and the Disintegration of Culture","start":2841.42,"end":2939.31,"speaker":"Paul Kingsnorth","text":"It because it's painful and because it involves denying yourself. I mean, that's the message, right? If you want to follow me, you deny yourself and you pick up your cross, and nobody wants to deny yourself. And in this culture, if it is culture that we have in the west now, we glorify the self. The self is everything. The ego is everything. We're narcissists. We want stuff. If we don't have. I mean, this is the whole. The entire capitalist economy is built on fulfilling the whims of the self, right? You have a need, probably one that's created for you by an advertising company. The need is then met by selling you some crap that will be thrown into the sea. And that's the self. If you deny yourself, none of that matters. If you deny yourself, you're living a small and simple and humble life, which is also the solution to this ecological crisis. Because if we were living small and simple and humble and selfless lives, we wouldn't have one, right? Because any community that actually does that, as you say, a community, a country, a family, they all work by everybody having to at least to some degree deny themselves. And also, that's how you live well with the rest of creation. You deny yourself. You don't destroy the forest for toilet roll because you understand that the forest is, you know, has a right to be there too, and you have to live in some harmony with it for your own sake as well as for the sake of Everything else. So you take what you need, but you don't take any more, you know, because you're not, you're not in it for yourself. And it's such a, it's. So, as you say, nope, none of us wants to do that. But we're also in a society now which is predicated on glorifying the self rather than denying it. So it's harder than it's ever, ever been. We even talk about that as a realistic thing to want to do. It's seen as just weird. You know, you're a weird marginal figure if you want to even think about denying the self now. Yeah."}
{"episode_id":"SW - #158 - 2021-05-15 - Paul Kingsnorth - Environmentalism, the Tower of Babel and the Disintegration of Culture","start":2939.31,"end":3020.38,"speaker":"Jonathan Pageau","text":"But every time you do it and it gets fascinating because you can see the fruits, like I keep joking about that, but how 50 years ago or even in the 60s, we couldn't see the fruits of the project, we couldn't see it, but now we have the fruits. And so you can notice that, let's say if you're a father and you deny yourself and you give yourself to God and then your body and your strength to your children and your attention to your children, then you're going to actually find yourself because your family is going to function. And in that self denial, you're going to find love and joy that you didn't think was possible. Whereas if you try to just preserve yourself and you live for your own passions and your own desires, then you're going to find yourself in a shattered family, in a, in a divorce court, you know, fighting over the, who gets the kids and you end up in this world of absolute chaos, being ripped apart by reality. And all of this because you, all you wanted to do is hold on to your own desires and your own, and your own whims. So it actually ends up being, it's like, it's not just like deny yourself and you know, you know, the whole world's going to be better. It's actually deny yourself and your life's going to be better too. Like, no joke, it's not just. Even if you, you enter into suffering, that suffering will bring you a sense of meaning and purpose and communion that you didn't have when you were just thinking about how to get your. Get off or to get your own little pleasures."}
{"episode_id":"SW - #158 - 2021-05-15 - Paul Kingsnorth - Environmentalism, the Tower of Babel and the Disintegration of Culture","start":3020.62,"end":3158.27,"speaker":"Paul Kingsnorth","text":"Yeah, quite. I mean, there's that's. And there's a connection there between the Zen Buddhism I used to practice in Christianity. Because the method, you know, the theology isn't the same, the central claim isn't the same, but actually the notion of the necessity of denying the self and Detachment that that's the way to ease your suffering is precisely the same, actually. You know, if you're attached to all of this stuff, you're going to lead yourself into hell and you're going to lead the world into hell as well. But as I say, the whole of the modern economy that we have now, the whole world that we've built in the west and increasingly elsewhere, it can't allow that worldview to be real. It has to tell us the story that glorifying ourself will make us happy. But as you say, the evidence is in. It's been a 60 year or 70 year or 100 year trial period in which we just break everything down and economically and culturally and socially, we just kind of go for broke and take what we want. And mysteriously enough, it doesn't work. You know, there might be a reason why every society up until this point in history had a kind of a structure and a sense of the divine and a need to make sacrifice to others. Yeah. So we've got a, we've kind of got a painful path back, I think, and we won't go back to the same place. But actually the teaching, if the teaching is there and we're following it, it's going to take us somewhere where we, you know, we're going to be presented with, we're being presented with ruins. That's what's happened. Everything is being ruined. We're changing the climate, we're driving species into extinction, our culture is disintegrating. We, like you say, we've got rates of suicide and depression that are through the roof. We've got family breakdown, we've got all of this stuff. Most people aren't really happy with it. You can get a lot of instant gratification in absolutely every way you want. But by the time you're 30, that's getting pretty boring, if not before. So what have you got? What have you got? And the more people that can see this and the more accelerated it gets, the more people are going to realize that there's an eternal truth that you have to go looking for. And like you say, I think a load of people are. I mean, they've been doing that for a long time, but I think now there's a kind of real acceleration in something in that turn back to, oh, hang on. If we look at it from the right angle, this message was there all along. We just didn't really see it. So then you've got to work out what to do with that, which is kind of why I'm still doing probably a lifetime's work."}
{"episode_id":"SW - #158 - 2021-05-15 - Paul Kingsnorth - Environmentalism, the Tower of Babel and the Disintegration of Culture","start":3158.51,"end":3185.72,"speaker":"Jonathan Pageau","text":"Yeah. Listen, I really appreciate our conversation, and I appreciate to know that you're on this path with us. I would say when I say us, I mean, I can really notice there's this strange movement about and there's this. Things are moving and things are changing. And so I'm happy to see you on the path with all of us, and I hope to find reasons to collaborate very soon."}
{"episode_id":"SW - #158 - 2021-05-15 - Paul Kingsnorth - Environmentalism, the Tower of Babel and the Disintegration of Culture","start":3186.2,"end":3188.12,"speaker":"Paul Kingsnorth","text":"Well, that would be great. I've appreciated it."}
{"episode_id":"SW - #158 - 2021-05-15 - Paul Kingsnorth - Environmentalism, the Tower of Babel and the Disintegration of Culture","start":3188.76,"end":3198.68,"speaker":"Jonathan Pageau","text":"And then I'll definitely finish reading your novel and maybe move on to others and we can have another discussion which will be actually more focused on what you've written. So that might be fun as well."}
{"episode_id":"SW - #158 - 2021-05-15 - Paul Kingsnorth - Environmentalism, the Tower of Babel and the Disintegration of Culture","start":3198.84,"end":3201.8,"speaker":"Paul Kingsnorth","text":"Well, there's a lot of options there. Yeah. See if you can get to the end of it first."}
{"episode_id":"SW - #158 - 2021-05-15 - Paul Kingsnorth - Environmentalism, the Tower of Babel and the Disintegration of Culture","start":3202.17,"end":3203.45,"speaker":"Jonathan Pageau","text":"All right, we'll do that."}
{"episode_id":"SW - #158 - 2021-05-15 - Paul Kingsnorth - Environmentalism, the Tower of Babel and the Disintegration of Culture","start":3203.77,"end":3204.13,"speaker":"Paul Kingsnorth","text":"All right."}
{"episode_id":"SW - #158 - 2021-05-15 - Paul Kingsnorth - Environmentalism, the Tower of Babel and the Disintegration of Culture","start":3204.13,"end":3204.97,"speaker":"Jonathan Pageau","text":"Thanks for coming along."}
{"episode_id":"SW - #158 - 2021-05-15 - Paul Kingsnorth - Environmentalism, the Tower of Babel and the Disintegration of Culture","start":3205.13,"end":3206.09,"speaker":"Paul Kingsnorth","text":"Okay, take care."}
{"episode_id":"SW - #158 - 2021-05-15 - Paul Kingsnorth - Environmentalism, the Tower of Babel and the Disintegration of Culture","start":3206.09,"end":3206.45,"speaker":"Jonathan Pageau","text":"All right."}
{"episode_id":"SW - #158 - 2021-05-15 - Paul Kingsnorth - Environmentalism, the Tower of Babel and the Disintegration of Culture","start":3206.45,"end":3206.97,"speaker":"Paul Kingsnorth","text":"Bye. Bye."}
{"episode_id":"SW - #158 - 2021-05-15 - Paul Kingsnorth - Environmentalism, the Tower of Babel and the Disintegration of Culture","start":3207.69,"end":3272.56,"speaker":"Justin Ward","text":"I hope you enjoyed this episode of the Symbolic World. The Symbolic World is edited by Justin Ward, and it is based on a series of videos that you can find on my YouTube channel, Jonathan Pageau's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by, of course, leaving a review on itunes. Everybody knows that's the best way to get the podcast out there, to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon Pajot Videos as well, and on subscribestar. All those links you can find on my website or in the show description. So thank you and I will see you soon."}
