{"episode_id":"SW - #256 - 2022-10-11 - Strange Times Call For Strange Storytelling","start":0.24,"end":36.94,"speaker":"Nicholas Kotar","text":"Yes, people are discontented with the bad storytelling, but it doesn't necessarily mean that if you give them good stories, they're going to live good lives. The proof in the pudding is that if you listen to all these people, people like the Critical Drinker and his ilk, that have been critiquing the new Lord of the Rings series even before they managed to see it, their reference point or their relationship with the show is almost one of religious awe. For them, the experience of the story has become akin to a religious experience. And so when it's wrong, they react to it not as frustrated artists, but as people who walked into a heretical church."}
{"episode_id":"SW - #256 - 2022-10-11 - Strange Times Call For Strange Storytelling","start":37.1,"end":37.5,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #256 - 2022-10-11 - Strange Times Call For Strange Storytelling","start":37.66,"end":50.78,"speaker":"Nicholas Kotar","text":"And I'm saying this not to make fun of them. I understand what's going on, I think. And it's a function of where we are in this civilization. It's a function of the decadence of Western Christendom in the level that it is."}
{"episode_id":"SW - #256 - 2022-10-11 - Strange Times Call For Strange Storytelling","start":61.96,"end":101.8,"speaker":"Jonathan Pageau","text":"This is Jonathan Peugeot. Welcome to the symbolic world. So, hello everyone. I'm really excited to be back with Nicholas Kotar. For those who follow the channel, you've seen him a few times having discussions about all kinds of things. He is a writer himself. He just published a novella called the Son of the Deathless in his Raven Son series. But we're also going to talk about this particular culture moment of what kind of stories we can tell in the strange times that we are living. So, Nicholas, first of all, congratulations on the new book."}
{"episode_id":"SW - #256 - 2022-10-11 - Strange Times Call For Strange Storytelling","start":102.04,"end":111.48,"speaker":"Nicholas Kotar","text":"Thank you. The pandemic killed storytelling for me, or at least the act of storytelling. So this is the first thing I've written in. First long thing I've written in almost two years."}
{"episode_id":"SW - #256 - 2022-10-11 - Strange Times Call For Strange Storytelling","start":111.64,"end":128.74,"speaker":"Jonathan Pageau","text":"Yeah, well, the idea. People seem to think that they said, you're locked into your house, this is a good time to do, but not always because was such an oppressive. We're in such an oppressive state. It's not easy to get those creative juices flowing, let's say."}
{"episode_id":"SW - #256 - 2022-10-11 - Strange Times Call For Strange Storytelling","start":128.98,"end":150.02,"speaker":"Nicholas Kotar","text":"No, I mean, creative juices don't come out of a vacuum. They come out of. Out of a craft, a ritual, when the ritual is destroyed because everything about your life is no longer ritualized and you're stuck in this massive. I mean, it's the doom, right? It's just around you all the time and you can't hide from it and that's not conducive. So, no, yeah, it didn't help."}
{"episode_id":"SW - #256 - 2022-10-11 - Strange Times Call For Strange Storytelling","start":150.4,"end":160.48,"speaker":"Jonathan Pageau","text":"And so, yeah, tell us, first of all, maybe tell us a little bit about what the premise of this new novella is, and then we'll move into our strange time and Strange storytelling, sure."}
{"episode_id":"SW - #256 - 2022-10-11 - Strange Times Call For Strange Storytelling","start":161.36,"end":276.14,"speaker":"Nicholas Kotar","text":"The story. I think we're going to be talking about this, I think a lot, but it came at me in a very weird way. I used to think that we created our own stories. I used to think that it was a matter of kind of sitting down and assembling certain pieces of things together, you know, reading Russian fairy tales, coming up with a concept from that kind of weirdly meshing things, and then allowing the story to come out of the structure. Not that necessarily, I'm an outliner or anything like this, but stories used to come out from. From a fairly regimented and structured kind of approach to writing for me. But right around Covid time, this probably would have been. It's already more than two years ago now. I was. I took a course with our mutual friend Paul Kingsnorth, which. Which was called Rewilding your words. I didn't know what it was going to happen, but I knew that it was something that I needed to experience just because Paul was such a compelling figure. And I was really curious to see what would happen. And I came in with one idea of what I would do. I thought, okay, this is going to help me write more. Beautiful setting. Like, it's going to allow me to make my writing more pretty, basically. And what it did instead was break me in pieces. The course is wonderful. Jonathan, you and I are members of. Are both teachers in a new program that we talked about on a different podcast, St. Basil School of Writing. Paul's joined us there, but he's teaching a version of that, of this course for St. Basil School. And so I'm really excited to see how that's going to work, because what he effectively does is it doesn't teach you anything about how to structure or craft your writing. He teaches you how to. How to be in tune with the natural world around you in ways that will then allow for a story to emerge that's almost a kind of duet between you and the world that you live in. So he speaks a lot about allowing the setting, the place to be a character in and of itself. He writes that way. You've read the Wake, I think, although you read Beast."}
{"episode_id":"SW - #256 - 2022-10-11 - Strange Times Call For Strange Storytelling","start":276.3,"end":277.1,"speaker":"Jonathan Pageau","text":"Beast, yeah."}
{"episode_id":"SW - #256 - 2022-10-11 - Strange Times Call For Strange Storytelling","start":277.26,"end":356.41,"speaker":"Nicholas Kotar","text":"Yeah. The setting there is. I mean, the Beast is the setting in a lot of ways. And although the creature does show up in the end, it's a kind of incarnation, you know, of. Of the. Of the land that he is having this spiritual battle with. So he has this very strong sense in his own writing of that. And what it did for me is it opened up an entirely new and different way of accessing what Tolkien would call the cauldron of story, that kind of common source that everybody takes their stories from, but in a way that isn't structured, in a way that isn't planned, in a way that is very surprising and very odd. And it fit for me at that moment because as the world was crumbling around me, a lot of people went the opposite way. Right. They went to just super regimented kind of lifestyles. And sometimes that came out in. In the tenor of the way that they talked about it. Right. You have to find structure and you side yourself. You try to write regiment everything around you, try to find the reason why these things are happening. You become rational, you become hyper rationalistic in either one direction or the other. Right. We've seen. We've seen both extremes during the pandemic. That is not good for story. It's. It doesn't. I mean, you could write stories out of that. And in fact, many of the stories that we're watching right now on Disney and all the other streams are coming from exactly that thing. I don't want to do that. I had no desire to do that."}
{"episode_id":"SW - #256 - 2022-10-11 - Strange Times Call For Strange Storytelling","start":356.49,"end":367.05,"speaker":"Jonathan Pageau","text":"Yeah, those stories end up looking like utilitarian or propaganda. They tend to be focused on a kind of really clear purpose, let's say, in terms of the story. Yeah, definitely."}
{"episode_id":"SW - #256 - 2022-10-11 - Strange Times Call For Strange Storytelling","start":367.29,"end":417.82,"speaker":"Nicholas Kotar","text":"Well, I mean, purpose driven or theme driven. Storytelling is something that everybody does. Right. So it's not necessarily a bad thing. But when your purpose overwhelms the story. I noticed it for the first time, actually, when I saw WandaVision. There were a few scenes in there when the writers stopped writing a story and they started to write a lecture. And it was really annoying. It took me out of the story completely and it shouldn't have because that was such a experimental and weird kind of story that WandaVision was, or at least it was trying to be. I don't think it ultimately succeeded. I don't think it was very good. But one of the things that went against it was that they didn't lean into the weirdness. The weirdness became window dressing for a very conventional story that, you know, if I haven't watched Doctor Strange, but I've read about it, and I know that you were exactly right in your predictions about this being simply nothing more than self crowning. Like a kind of."}
{"episode_id":"SW - #256 - 2022-10-11 - Strange Times Call For Strange Storytelling","start":417.82,"end":419.9,"speaker":"Jonathan Pageau","text":"Yeah, it's really bad apogee."}
{"episode_id":"SW - #256 - 2022-10-11 - Strange Times Call For Strange Storytelling","start":419.9,"end":420.3,"speaker":"Nicholas Kotar","text":"Yeah."}
{"episode_id":"SW - #256 - 2022-10-11 - Strange Times Call For Strange Storytelling","start":420.3,"end":440.82,"speaker":"Jonathan Pageau","text":"But it's interesting to notice how the. Let's say, because I grew up in a process kind of evangelical world and I wrote three plays that were within that context and had some evangelistic purposes, like, that's not all they were, but they definitely needed to have that inside the play."}
{"episode_id":"SW - #256 - 2022-10-11 - Strange Times Call For Strange Storytelling","start":441.14,"end":441.54,"speaker":"Nicholas Kotar","text":"Right."}
{"episode_id":"SW - #256 - 2022-10-11 - Strange Times Call For Strange Storytelling","start":441.54,"end":472.51,"speaker":"Jonathan Pageau","text":"And every time I remember, like, I remember writing them and real and. And writing it and realizing, oh, I need to have that moment, like, moment in the play. And I cringe every time I. Every time I think of it. And now when I watch. That's why I find it so difficult to watch Christian movies. I had such a deep. A deep experience with that because I wrote three of those myself, and I produced them, and we toured and we did all that. And so it's like, when I see it, I'm like, oh, this is so painful. But I never thought that I would see it in the Hollywood movies as much as I'm seeing it now, so."}
{"episode_id":"SW - #256 - 2022-10-11 - Strange Times Call For Strange Storytelling","start":473.07,"end":574.32,"speaker":"Nicholas Kotar","text":"Because it's. Because it's bad screenwriting, and everybody knows it's bad screenwriting, but there's something going on in Hollywood. I don't know if we want to talk about this too much, but it's becoming clear more and more. And this is something that came out in Barry Weiss's podcast or may have been her substack, but she talked about how. And I'm not. I'm not quoting this, so if I'm getting it wrong, I do apologize. But she basically was quoting an insider who said that after the George Floyd riots, there was a mandate from heaven. Yeah, A mandate from not heaven that said, get rid of all the old guys and make sure you diversify your core. Now, the issue is, the problem is. And this insider was very open about it, and I think. I don't know if it's a he or she. I believe he was anonymous, made it clear that the pool of possible screenwriters is small as it is, because the life of a screenwriter in Hollywood is absolutely miserable. You get paid almost nothing, and you're working for these big shots that basically force you to do stuff and then put their own writing on top of yours. They put their own name on your writing. Right. And that's something that you accept if you want to live that life. But there's not a lot of people that do. And of those that are already there, there's not that great of a percentage of. Of a diverse population. So in sort of shoehorning in the mandate, what's happening is not that these people can't tell good stories. It's that they haven't had the training, and they're put in positions of, you know, leader of writing room, and they're trying to tell good stories. But they haven't been trained in the absolute basics of storytelling. So they're defaulting to what they're seeing in the New York Times and in the cultural conversation, which is a top down speaking wagging. Yeah, but that, I mean that kills, that kills the immersion in story within as soon as it happens. And it doesn't matter what side you're on."}
{"episode_id":"SW - #256 - 2022-10-11 - Strange Times Call For Strange Storytelling","start":574.32,"end":574.72,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #256 - 2022-10-11 - Strange Times Call For Strange Storytelling","start":574.72,"end":577.56,"speaker":"Nicholas Kotar","text":"Even if you agree with it, you're not in the story anymore. You've just been pulled out."}
{"episode_id":"SW - #256 - 2022-10-11 - Strange Times Call For Strange Storytelling","start":577.56,"end":595.02,"speaker":"Jonathan Pageau","text":"Definitely. So it brings us to our major point which is in this strange topsy turvy times when even those, let's say that those that would portray even themselves as being the margin are now becoming moralist and finger wagging. Like what kind of story can we tell and how can we tell this story?"}
{"episode_id":"SW - #256 - 2022-10-11 - Strange Times Call For Strange Storytelling","start":595.1,"end":817.42,"speaker":"Nicholas Kotar","text":"Well, that was, that was my thought, you know, and of course as soon as I had that thought, I had to abandon the thought because if I start thinking like that, then the story I'm going to tell is not going to be story forward, but it's going to be theme forward. So if I'm thinking I need to tell a story that's going to embrace the margins, that's it. I've lost the game. Right. So this is, this is weird dance. And you know this. You're a creative, you understand and especially a creative within, within a, you know, within the tradition bound craft such as iconography, there's always a dance between what you want to do and what the tradition tells you to do and what you hope you're able to do in terms of your personal input, but also you want to add something just you, that's also a dance with the tradition. It's weird, it's a very strange, it's very different to that moment when the premise becomes available to you, especially after Paul's core. Yeah. So of course was to. Was to be able to write the kind of premise that would be able to embrace the, the margin, that would be able to nudge people in that I want them to think and feel, but without preaching to them. And I tried to write it, but from a, from a place where I was, where I had a very clear idea of what I wanted to happen. Right. And it was a disaster. It really didn't work. I wrote a few scenes of this thing. I had an idea of who the main character was, I had an idea of who's. What his motivations were going to be and I wrote it, it was flowing beautifully and I put it aside for a bit. Stuff happened, life, et cetera. And I got back to it and I started to read it, and I hated. I hated it with a burning passion. It was like, this is the worst thing I have ever written. And I've been writing for years now. This is. This has not happened. So I tried to remember Paul Kingsnorth's lessons. I tried to let go of the story. I tried to let go of what I wanted the story to be. I still had a sense of who the character was. I had a sense of what the setting was, the timing within the larger world that I ride in. And it took me going out into nature, literally, and being in the fresh air and not thinking, not listening to podcasts, not talking to anybody, but just being in the world. Not the mechanical world of the city, but out there, because I live, you know, in cow country. So it took. It took me being out there for suddenly this thing to hit me and go, boom. This is where you have to go. And it wasn't me. You know, I don't know what it was. And I'm not the kind of person to say God spoke to me. And therefore. And then I sat down and I wrote this thing. And it was. It was a cooperation between me and God. No, I'm not going to say that. But whatever that voice was, it was there and it was outside of myself. And then began the song. And from then on out, it. It just wrote. It just wrote itself. And it's different from the other stuff I wrote in a lot of ways. It's a different voice, it's a different kind of. It's a different kind of character. It's a different kind of approach to storytelling. And I think, I hope it's. Basically, I embraced my fairy tale telling instincts. So instead of trying to tell an epic fantasy according to the epic fantastical rule book, and there is a rulebook of epic fantasy, there are steps that you have to follow. There are things you have to do. Otherwise, the reason I'm like, this is an epic fantasy, I'll never read this again. So I threw that out and I said, no, I'm telling a fairy tale. And I'm not retelling a fairy tale. I'm telling a new one, which is what people used to do all the time. And it used to be the center thing, right? It was the center of town. It was where the fireplace was, is where every. Everybody gathered in the evenings of the village. This used to be the activity of the center. And now the center is downtown. Now the center is Facebook. Now the center is whatever political insanity we're living through at the moment, the center is the thing that has gone utterly bonkers. So in going back to an older form of storytelling, I hope, oddly enough, I'm now, I think, I hope, embracing the storytelling tropes and techniques of the margin."}
{"episode_id":"SW - #256 - 2022-10-11 - Strange Times Call For Strange Storytelling","start":817.66,"end":819.74,"speaker":"Jonathan Pageau","text":"Which means what for you? What do you think that means?"}
{"episode_id":"SW - #256 - 2022-10-11 - Strange Times Call For Strange Storytelling","start":820.3,"end":852.67,"speaker":"Nicholas Kotar","text":"Well, it started. It starts off with the process of writing itself in allowing the story to not be entirely limited by the tropes of what people expect it to be. So it's a difficult thing to balance the entertainment factor of a story because everybody wants to have a certain repeated pattern, of course, with the freshness, the newness of a story that has never been told before, but that has to have. They have to be both. You can't have a story that's so unique and so new, that has that, you know, that's never been told, that nobody can relate to. That's, you know, Marcel Duchamp. That's. That's."}
{"episode_id":"SW - #256 - 2022-10-11 - Strange Times Call For Strange Storytelling","start":853.23,"end":853.83,"speaker":"Jonathan Pageau","text":"Yeah, yeah."}
{"episode_id":"SW - #256 - 2022-10-11 - Strange Times Call For Strange Storytelling","start":853.83,"end":989.11,"speaker":"Nicholas Kotar","text":"Eternal music. That's all. That's all the stuff that we've been. We had to go through for the past 50, 100 years. Right. So you have to figure out how to do that. But it also means. I think it means telling stories that are weird, telling stories that are bizarre, using imagery that doesn't necessarily have immediate associations in people's minds, choosing characters that are fools, choosing characters that are children, and allowing the setting of the world itself that you're writing to become a character and to dictate what happens. So this is really weird, and it's very hard to do because a setting isn't a character, has no motivations, it's a thing. But there are stories out there and they're very interesting things, like Alice in Wonderland, like the Gorman Goss trilogy by Mervyn Peake, like Lord of the Rings, where the setting itself is actually a character, it determines what the human characters do within the story to a large extent. And it's not simply because there's mountains here and there's a river there that you have to cross. It's that the place itself has its own spirit. And that spirit will determine, determine how the characters react as they walk through it. That's not something you see in a lot of modern storytelling because it's dangerous. You don't know what's going to happen. And you have to be, as a storyteller, you have to be more connected to the natural world to be able to do that realistically. Because if you're a writer who sits in a garret all day and has Never walked outside and has never had the experience of touching a tree and feeling what the bark of a tree actually feels like. Has never seen the changing seasons on the same road year and year out. And how the, how the trees change in their color, how they change in their shape, and how just being in the same spot, walking the same path every day for 365 days means that every single day is different. This kind of rootedness, this kind of being in place produces very strong storytelling in good storytellers. I'm not including myself in the list yet. Eventually, hopefully. But it's what I'm aiming for and it's what I was trying to begin. And it's what Paul Kingsnort does so well. It's what Tolkien did so well. He was a rooted man. He was a man who was stuck in place. Right. He didn't travel a lot, but he was very at one with his. With his natural world. Not this, you know, jet setting, crazy world that we live in where you go on a plane every time you go on vacation, where you. Sorry, Jonathan, I know that you're. You're about to enter into that world yourself, traveling."}
{"episode_id":"SW - #256 - 2022-10-11 - Strange Times Call For Strange Storytelling","start":989.59,"end":1013.22,"speaker":"Jonathan Pageau","text":"So you sent me, you sent me a quote by Martin Shah, who, for those who don't know Martin Shah, he's a mythologist, storyteller from Ireland. He's been kind of appearing in this little corner, I guess, of the Internet because he's had some. He's a friend of Paul Kingsnorth, and he's had some intimations of Christianity and orthodoxy, something which he thought he never would have. I'm going to talk to him in the next few months. I'm not sure what, what day exactly."}
{"episode_id":"SW - #256 - 2022-10-11 - Strange Times Call For Strange Storytelling","start":1013.22,"end":1013.82,"speaker":"Nicholas Kotar","text":"But it's going to happen."}
{"episode_id":"SW - #256 - 2022-10-11 - Strange Times Call For Strange Storytelling","start":1013.82,"end":1034.8,"speaker":"Jonathan Pageau","text":"So you sent me this quote by him, and you said, when the center is in crisis, it is to the edges that we must attend. And so I thought that sounded a lot like. When I say something like, watch the pools, you know, that that carnival in the end will flip back into, will bring back a kind of normal world. But what is it that you think that this can do for us at this moment?"}
{"episode_id":"SW - #256 - 2022-10-11 - Strange Times Call For Strange Storytelling","start":1035.04,"end":1111.96,"speaker":"Nicholas Kotar","text":"Well, I think we are storytelling creatures. We know that. We talk about it a lot. And you and I have talked about this repeatedly. And I think we've become even a little bit too complacent in the idea that stories will change the world. We simply have to tell a good story. I don't think that's true as much as I thought before. And that's because we have a very educated and A very cultured people. Now, there are a lot of people that have access to high education and they're used to the kind of good storytelling that we're not seeing right now on television. And that's why you're seeing so much discontent in so many quarters about the level of quality. But there's a. Yes, people are discontented with the bad storytelling, but it doesn't necessarily mean that if you give them good stories, they're going to live good lives. The proof in the pudding is that if you listen to all these people, people like the critical drinker and his ilk that have been critiquing the new Lord of the Rings series even before they managed to see it, their reference point or their relationship with the show is almost one of religious awe. For them, the experience of this story has become akin to a religious experience. And so when it's wrong, they react to it not as frustrated artists, but as people who walked into a heretical church."}
{"episode_id":"SW - #256 - 2022-10-11 - Strange Times Call For Strange Storytelling","start":1112.04,"end":1112.44,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #256 - 2022-10-11 - Strange Times Call For Strange Storytelling","start":1112.52,"end":1117.64,"speaker":"Nicholas Kotar","text":"Don't. Don't recognize the exclamations or recognize the exclamations as being heretical."}
{"episode_id":"SW - #256 - 2022-10-11 - Strange Times Call For Strange Storytelling","start":1118.44,"end":1131.64,"speaker":"Jonathan Pageau","text":"No, that's a really good analogy. It seems for sure that people that are freaking out about this new Lord of the Rings series are really acting as if there is a heresy in front of them and it has to be denounced. It has to be expunged. You know, it has to be."}
{"episode_id":"SW - #256 - 2022-10-11 - Strange Times Call For Strange Storytelling","start":1131.96,"end":1248.75,"speaker":"Nicholas Kotar","text":"And you don't have to watch the thing. It's enough to know a few facts. It's enough to listen to the, to the, to the actors talk about the thing. It's enough to listen to the show runners talk about the thing, to be able to have all the necessary information that you need to battle the heresy. Because they're apologists, they're not storytellers. Well, some of them are, but. And I'm saying this not to make fun of them, I understand what's going on, I think, and it's a function of where we are in this civilization. It's a function of the decadence of Western Christendom in the level that it is at the historical moment that it is. So that means that if we simply, I think if we simply revert to a kind of hero's journey, archetypal story over and over and over again, like we've talked about, like Star wars, then the best that we can hope for is the kind of cultural dominance through merchandising and larping that Star wars has managed to exert over the world. And if you, you know, if obviously most people know that this is the case. If you don't read the book How Star Wars Conquered the Universe. It's a fascinating history of the, of the lore and, and, and what happened. It just gives you an idea of just how much this has a religious character for people who, you know, the kinds of people that built from scratch stormtrooper suits or the Darth Vader suit. Not thinking for a moment, of course, that Darth Vader is supposed to be the figure of evil, because it's not about that. So I don't think it's enough to have this kind of a watered down hero's journey thing anymore. Although we do need to have the kinds of fairy tale structures that Tolkien talks about in his essay on fairy stories, the structures that lead to the Yu catastrophe, the sudden flip at the end. The way that we get there has to be weird now. It has to be odd, it has to be unexpected, it has to be bizarre purposely. Right. And in Russia, you see this, by the way, in modern literature. So Russia, because of the Soviet Union and because of the predominance of social realism, things like this, the way that the writers responded to it was by writing absurdist, what's the technical term? Like super absurdist. Magical realism."}
{"episode_id":"SW - #256 - 2022-10-11 - Strange Times Call For Strange Storytelling","start":1248.75,"end":1250.79,"speaker":"Jonathan Pageau","text":"Yeah, like Master Margarita."}
{"episode_id":"SW - #256 - 2022-10-11 - Strange Times Call For Strange Storytelling","start":1250.79,"end":1331.58,"speaker":"Nicholas Kotar","text":"Like Master Margarita, exactly. That's the first one. But then it went even crazier with people like Victor Pelev, who's a very well known, very well known author internationally and is a consistent bestseller in Russia and writes absolutely insane, nihilistic, crazy, flipped bizarreness. And people drink eat it up in Russia. They love it because. Because they understand that he is a fool and he's very wise. So our job now is very difficult because we could go that route. We could go the route of the absolute negator. Master Margarita did that very well. But in order to do that, he had to rewrite the history of the gospel in a way that negated Christ's divinity. That was the only way he was going to be able to tell that story in a way that would work. So you have this incredible novel that has a very problematic moral heart to it. It's all about nihilism in a lot of ways as a response to this kind of good versus evil inverted thing that the Soviet Union was pushing down everybody else's throats. So we can't go there. It's dangerous. Right, Because. Because if we're honest about what we have to do as storytellers, we have these, we have our listeners, souls in our, in our hands. Right. Cupped in our hands. If you're A good writer. As soon as you've plunged the. The reader into your world, you're responsible for what happens to that person in that world. It's scary."}
{"episode_id":"SW - #256 - 2022-10-11 - Strange Times Call For Strange Storytelling","start":1331.74,"end":1332.22,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #256 - 2022-10-11 - Strange Times Call For Strange Storytelling","start":1332.22,"end":1375.31,"speaker":"Nicholas Kotar","text":"But it's. It's true. So you have to unsettle them. You have to go to dark places. You have to mess up their very comfortable presuppositions about what the world is. But you also have to do it in a way that reinforces the pattern, the pattern of reality as you talk about all the time. That's an incredibly hard thing to do technically as storytellers. And that's the challenge that's ahead of us. And that's what Martin Shaw is doing in talking about that quote specifically. He writes really bizarre, weird stuff that's very French and very kind of on the verge of paganism. Christianity inspired by the ancient myths, but also speaking them in a language that's understandable. And if you allow yourself to enter into it, it can be really very interesting and very transformative in a lot of ways."}
{"episode_id":"SW - #256 - 2022-10-11 - Strange Times Call For Strange Storytelling","start":1376.03,"end":1382.03,"speaker":"Jonathan Pageau","text":"And so who do you see as being. Do you see Laurus as being an example of that, for example? Right."}
{"episode_id":"SW - #256 - 2022-10-11 - Strange Times Call For Strange Storytelling","start":1382.03,"end":1432.1,"speaker":"Nicholas Kotar","text":"Yeah. Laurus is funny because on the one hand, it's a very conventional narrative. It follows all the beats of the saints. Saint life of a particular kind of saint life. But if you're paying attention and if you're reading it carefully, especially if you're reading it in Russian, the translation is good. But it doesn't. It doesn't do absolute justice, as no translation, of course, can. I can say that I'm a translator. There are some profoundly shocking moments in Loras. There's some really awful things that happen in Loras. The death of his wife and child, you know, the inciting incident that leads to his becoming a saint. They're described in details that nobody should ever describe when talking about women and children. Really horrifying stuff. So that's one thing. Then there's also, like. He pushes the limits of what we consider to be saintly. Yeah. When you have the pugnacious fools for Christ, you know, duking it out while walking on water."}
{"episode_id":"SW - #256 - 2022-10-11 - Strange Times Call For Strange Storytelling","start":1432.1,"end":1434.82,"speaker":"Jonathan Pageau","text":"Walking on water. Yeah, man, that stuff is crazy."}
{"episode_id":"SW - #256 - 2022-10-11 - Strange Times Call For Strange Storytelling","start":1434.9,"end":1438.54,"speaker":"Nicholas Kotar","text":"I mean, a lot of people are like this. You can't have this. This isn't. This isn't right."}
{"episode_id":"SW - #256 - 2022-10-11 - Strange Times Call For Strange Storytelling","start":1438.54,"end":1455.76,"speaker":"Jonathan Pageau","text":"But if you heard also the verge on masochism, which he brings his character to you, sometimes you're wondering, like, is this just a kind of strange masochism, like a kind of nihilistic masochism, or is this an actual negation of self? Like when he lets himself get stung by all the mosquitoes and stuff and you're like, what? You know, really?"}
{"episode_id":"SW - #256 - 2022-10-11 - Strange Times Call For Strange Storytelling","start":1456.16,"end":1460.44,"speaker":"Nicholas Kotar","text":"Yes. And. Well, actually that I think you may have taken that from, from an actual life of one of the Russian saints."}
{"episode_id":"SW - #256 - 2022-10-11 - Strange Times Call For Strange Storytelling","start":1460.44,"end":1460.88,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #256 - 2022-10-11 - Strange Times Call For Strange Storytelling","start":1461.44,"end":1463.68,"speaker":"Nicholas Kotar","text":"So that, that has, that has happened."}
{"episode_id":"SW - #256 - 2022-10-11 - Strange Times Call For Strange Storytelling","start":1463.92,"end":1542.39,"speaker":"Jonathan Pageau","text":"But even like that's the thing about the lives of the saints too is that when you read them, there is some of that in there. Right. We, we tend to iron out the lives of the saints or the medieval legends. We've kind of made them nice and clean. Even the fairy tales, we made them nice and clean. A lot of the versions of the fairy tales that we have now have taken out all the strangeness that was there just a few centuries ago. And that's been. One of my ideas is to how can we bring back the strangeness or some of the things that are that seem off color to, to contemporary morality or sensibilities, but use it in a way that is revelatory rather than just a kind of scandal for scandal or shocking. Right, Shocking. Like I've been thinking about like the Rapunzel for example, but in the original Rapunzel stories, Rapunzel gets pregnant in the tower. We expunged that completely from all the versions that we tell our kids. But I kept thinking without that it actually is weakening what the story is about. And the idea of the man who forgets the mother of his children, you know, in his fall, and then has to hear her voice again in order to recognize her, I'm like, no, we need to put that back in. Like, is there a way to put it back in even in a story for kids, especially in a moment where kids are no longer like naive, innocent and innocent the way that we wish."}
{"episode_id":"SW - #256 - 2022-10-11 - Strange Times Call For Strange Storytelling","start":1542.39,"end":1547.11,"speaker":"Nicholas Kotar","text":"They were because they're way you say no longer. But I'm not sure if they ever were. If they ever were."}
{"episode_id":"SW - #256 - 2022-10-11 - Strange Times Call For Strange Storytelling","start":1547.11,"end":1573.33,"speaker":"Jonathan Pageau","text":"Exactly. Yeah. So is there a way to put that in your childhood, to put it back in which would reveal a higher aspect of the story rather than just be for shock? But that's this, that's edgy. Like for kids it's not that hard because you won't go as far. But for adults it's a. How can I say this? Like it's a. It can be really tricky because there, well, so much, so much of the modern fiction is like, is shock. A lot of it has a lot of shock for shock value for sure."}
{"episode_id":"SW - #256 - 2022-10-11 - Strange Times Call For Strange Storytelling","start":1573.65,"end":1602.98,"speaker":"Nicholas Kotar","text":"So those of you who are watching on YouTube will see that we've suddenly and magically changed our appearance and there's a Reason for that we had technical difficulties because we were about to say something so incredible astounding that nobody out there wanted it to happen. Um, in actual fact, I was running out of ideas. And it was a really good thing that that happened because then I had to go back and. And, yeah, and read up on a little bit of jog Derrida and stuff like that. And."}
{"episode_id":"SW - #256 - 2022-10-11 - Strange Times Call For Strange Storytelling","start":1604.74,"end":1609.38,"speaker":"Jonathan Pageau","text":"It'S like post structuralism, a little evening of post structuralist theory, you know."}
{"episode_id":"SW - #256 - 2022-10-11 - Strange Times Call For Strange Storytelling","start":1609.38,"end":1689.95,"speaker":"Nicholas Kotar","text":"You know, just a little bit of difference in my life, you know, There you go. Exactly what I need. No, but in all seriousness, it was probably a good thing because I was. As we talked. As we talked about before, I do like to allow my thoughts to kind of wander when I'm out there running around in the wild, which I do fairly a lot of, because I trained for a certain kind of sport called adventure racing, which we will not talk about today. But anyway, I was thinking about yesterday, the idea of how modernity fractures us and how. What the value of shock is to let fractured people realize they're fractured. And this is where we. This is where we ended last time, where we were talking about how with the kinds of stories that we're. That we're being subjected to, the kind of stories that we're surrounded by, it's very. It's difficult to avoid, as a. As a writer, as a maker, as a creator, to use. It's difficult to avoid using shock just to get people out of a very comfortable, buffered state that they exist in. Because the reality is that everybody is really seriously fractured as. As a result of modernity. And until we realize that we are that fractured, there really can't be any sort of integration or wholeness that can happen within the single person, much less the larger society, which was, of course, made so obvious by the pandemic. And it's. I think it's a mistake to think that the pandemic caused it. The pandemic just made it obvious."}
{"episode_id":"SW - #256 - 2022-10-11 - Strange Times Call For Strange Storytelling","start":1690.19,"end":1691.63,"speaker":"Jonathan Pageau","text":"Yeah, just accentuated."}
{"episode_id":"SW - #256 - 2022-10-11 - Strange Times Call For Strange Storytelling","start":1691.63,"end":1937.46,"speaker":"Nicholas Kotar","text":"It revealed something that was there. Yeah, it accentuated, but it also revealed how deep that fracturing went. And I think it's important also to emphasize that that fracturing really is within each individual person. It's not just a matter of some people being revealed to have very dangerous ideologies that now must all be expunged. Right. It's not that everybody was an ant, was a fascist, and now the fascists have to be removed. No, it's. All of us are broken. All of us are fractured. And that's a function of the culture of modernity. And I was listening to this podcast yesterday, and this will connect back to how the margins work with storytelling in a second. But the. This was really interesting conversation between two makers. And one of them suggested that there's the connection between fragmentation or fracturing that's happening around us, and the need for the search for identity is not accidental. Because identity, he was saying, in its root, the word identity is connected to oneness. It's connected to unity. So I was. It's been. This is a thought that's been percolating in my head, and I haven't been able to fully articulate it yet. And maybe you can help me do that. Maybe we can do that for the rest of what's happening today. But it's really striking to me that as literacy declines, as people's engagement with old stories declines, as people become inundated more and more in the kind of commercialized visual culture that we have, identity seems to slip away more and more from people, and they. And they grasp for it a lot stronger. So if you're considering, for example, this really bizarre and strange and terrifying thing that's happening, especially with young girls, where there were so many of them are now reaching out and searching for an identity that is other because they feel uncomfortable with the fracturing within them, what if part of the problem is that they're has never has not been enough of a integration through story that has been available to people in traditional cultures? Because the traditional culture has always embraced the journey to the toward the other through a search of identity by crossing the line between the center and the margin, by going from the village into the forest. But if there is no common tradition of storytelling, and if the stories that we do tell that are a proxy for that common tradition, traditional storytelling, are the new Marvel or the new Star wars, then where are you or all of us going to find that internal integration if it's not being offered in story? The only other option for some people is surgery. I mean, this is a thought that I'm grasping for, and I haven't been able fully to articulate it yet, but I think there might be something to it. I think there might be something to the fact that maybe we just need a better unifying story. That is shocking because we need to have that moment of shock initially for the person to realize that their internal world is incredibly fractured. And if I can extend that a little bit, what really disturbs me is that amongst people who do not like the idea of a unifying story or a common storytelling Tradition people generally tend to be more on. More in the liberal scale of things. It is almost anathema to suggest that there is such a thing as taste, that there is such a thing as good storytelling versus bad storytelling. All they can do is say, I have my preferences, you have yours, and don't you dare suggest to me that my preferences are in some way inferior to yours. It's just a matter of taste, but not taste in the. In the larger, organic, objective sense of taste being determined by tastemakers being determined by. By cultural norms. Right. It's a kind of personal thing that is, in effect, especially in the. In extreme cases, a kind of following of your passions. So why. This is why you have people who read 300 books a year that all of them have the same theme. They all. They're all basically the same plot structure. They're the same character, the same type of characters, the same tropes. They just keep reinforcing, and most of them are trash. Keeps reinforcing the same fuzzy, warm, buffered feeling that separates you from the knowledge of your own internal fragmentation. So. I don't know. I don't know."}
{"episode_id":"SW - #256 - 2022-10-11 - Strange Times Call For Strange Storytelling","start":1938.02,"end":2001.36,"speaker":"Jonathan Pageau","text":"Well, I think that. Oh. So I think that your intuition about identity is definitely right. That's for sure. That's for sure. And the way to understand it, the best way to understand what's going on is to understand how, let's say, how sin works in us or how our passions work with us. And so one of the things that happened. So let's say we could. You could say as Christians, we could say something like, our identity is full to the extent that we participate in the body of Christ, to the extent that we are little Christs, that Christ in us, like all the ways that St. Paul talks about, like that is the fullness of our identity. And so in a way, it is. It's the fullness of you, but it's also transpersonal. That is, it pulls you out of your idiosyncratic, you know, self. And so then you have within you, you. You have these poles and these thoughts and these. These passions that they. They capture you. And when they capture you, they actually try to make you think that that's all you are."}
{"episode_id":"SW - #256 - 2022-10-11 - Strange Times Call For Strange Storytelling","start":2001.84,"end":2002.2,"speaker":"Nicholas Kotar","text":"Yeah."}
{"episode_id":"SW - #256 - 2022-10-11 - Strange Times Call For Strange Storytelling","start":2002.2,"end":2065.47,"speaker":"Jonathan Pageau","text":"You know, especially in the moment when you're. When you're, let's say, taken by the Passion, it's like the Passion takes over and that's what you are. And so if you understand that at a. And the. Those passions and those idiosyncratic patterns, they have a. They have an appearance and they have a mythological Appearance, right? They actually have an appearance in storytelling, an appearance in art, you know, and it's the demons. It's like the mixture. It's the dark shadows. In the Eastern tradition, these dark kind of shadows, or in the Western tradition, it's these hybrid monsters that come to torture you, right? This. All this. This is. This is a. It's like. It's like. It's not completely objective, like a scientific fact, but it has a universality to it, which. Which is. Which is pervasive. And so what we're seeing is. That's what we're seeing. Like, we're seeing those little identities take over people, and that's why they look the way they look. There is no. Yeah, there's no hiding anymore. It's like the."}
{"episode_id":"SW - #256 - 2022-10-11 - Strange Times Call For Strange Storytelling","start":2065.55,"end":2165.26,"speaker":"Nicholas Kotar","text":"Right, right. And that's what. That's why the hybridization is happening, especially in Western people. Like the Western people are. Are clamoring for that hybridization because they think in that mixing of things is going to be some sort of full expression of the self, of the. Of the internal integrity of the self, which is. So if you look at it from the side and don't and try to just be dispassionate about it, it's total madness. Total madness. But, okay, so this. This then extends. So this. I have another thought about that, because that's what you're talking about then, is a kind of full immersion in a dangerous other, while without realizing it, that you're doing it because you think you're searching for the self, but actually what you're doing is letting in another. And that other will then subsume you. It'll possess you, right? And this can happen in stories too. Now, so this is what's so interesting about the old storytelling tropes, right? The old storytelling styles is that they allow you to fully inhabit in a safe space, the idea of being the Other. Because that's what reading is, right? If you're reading and you're reading, you are in the mind and behind the eyes of a character that isn't you. That is a different sex, there's a different skin color, that's a different social status. You are fully inhabiting, as much as that's possible, that person's experience. And you're allowing that person's experience to. To inform your own. So you're simultaneously learning more about yourself. You're becoming more integrated in yourself. But you're also doing that by setting interesting and useful boundaries between you and the other while also having an experience of the other that allows for a Very into integrating type thing. So it's. You are self, but you're also other without losing self."}
{"episode_id":"SW - #256 - 2022-10-11 - Strange Times Call For Strange Storytelling","start":2165.5,"end":2205.81,"speaker":"Jonathan Pageau","text":"Right, well, that's because. Yeah, well, that's because the space of imagination has a certain quality to it. It's not this, let's say the imaginary space is. The fantastical space is not the same as the space with which you identify. Just so. So I think that that's. That's hard for people. It might seem like an obvious thing to say, but it is, it is real. So like, let's say storytelling, it's not the only function it can have. But like you said, it can have an exploratory function. But that exploratory function is one which is. Which is recognizing that I'm entering into a fantastical space, which is not my."}
{"episode_id":"SW - #256 - 2022-10-11 - Strange Times Call For Strange Storytelling","start":2205.81,"end":2206.69,"speaker":"Nicholas Kotar","text":"Space, which is not me."}
{"episode_id":"SW - #256 - 2022-10-11 - Strange Times Call For Strange Storytelling","start":2206.69,"end":2328.34,"speaker":"Jonathan Pageau","text":"Whereas what one of the things that's going on in terms of the. So that's one aspect of storytelling. It's not the only one. There is an aspect of storytelling which is also my story. Like, you know, the Trojan War is not a fantastical storytelling, right? It's my story. It's the story that I remember that I engaged liturgically and participate in. That's the same with the gospel stories or the same with, you know, the liturgical year as the story that we participate in and engage with. But the more fantastical type stories, the ones that are, like you said, where you take the role of another, let's say they have a function. But I think that what's going on, and that's one of the reasons why Star wars is becoming a religion, is that we've made it upside down. We've made this weird upside down relationship where we want to be some anime, like anime character. We want to be Luke Skywalker or we want to live in these imaginary worlds. And we hate our own story like we hate our own history, we hate our own legends. And so you can see, I mean, it really is an image of the end. Like it is an image of this upside down place where now everything is. And then that upside down place has many iterations, many forms. It can look like that strangeness of cosplay, but it can also look like you said, which is the fetishization of strangeness and a desire to take all strangeness into myself, become an. Become a hybrid animal, you know, fetishize, you know, and now we're seeing more like the race changing, where people are, want to be another race or, you know, it's like all of these types of behaviors can demonstrate the problem. The Problem. The confusion or even the inversion between the idea of a. Of a story which is remembering my. My con. My connection, and a story which is this exploratory, dreamlike experience of, you know, of. Yeah. Fighting monsters and doing all that."}
{"episode_id":"SW - #256 - 2022-10-11 - Strange Times Call For Strange Storytelling","start":2328.34,"end":2330.14,"speaker":"Nicholas Kotar","text":"It's an inversion of hierarchy again."}
{"episode_id":"SW - #256 - 2022-10-11 - Strange Times Call For Strange Storytelling","start":2330.38,"end":2341.7,"speaker":"Jonathan Pageau","text":"Oh, yeah, for sure. There's no doubt about that. It is. That it's like a weird upside down place that we're standing in. But I think there are ways. So I think there are ways to be there."}
{"episode_id":"SW - #256 - 2022-10-11 - Strange Times Call For Strange Storytelling","start":2341.7,"end":2341.98,"speaker":"Nicholas Kotar","text":"Right."}
{"episode_id":"SW - #256 - 2022-10-11 - Strange Times Call For Strange Storytelling","start":2342.66,"end":2370.37,"speaker":"Jonathan Pageau","text":"There are ways to flip it, I think. And I think that that's the space that we're in and that it's an exciting space actually to be in, which is, you know, can we tell the fantastical stories in a way that will surprise us back into our own story? Or can we tell our story in a way that will be slightly fantastical, but to shock us back into it? You know, I think that that's definitely possible right now."}
{"episode_id":"SW - #256 - 2022-10-11 - Strange Times Call For Strange Storytelling","start":2370.77,"end":2408,"speaker":"Nicholas Kotar","text":"Well, it seems to be the best time for it. I mean, I've talked before about how fantasy as a storytelling, as a storytelling mechanism is just better right now because people have become saturated with the storytelling approaches of realistic fiction and because in 20th century. In the 20th century, realistic fiction has become little more than a my story. That is nothing. That is almost nothing more than a constant regurgitation of internal fragmentation. And who would want to read that? So, yeah, very small group of people who are. Who very much, you know, appreciate that internal regurgitation, because that's all they do all day."}
{"episode_id":"SW - #256 - 2022-10-11 - Strange Times Call For Strange Storytelling","start":2408,"end":2408.32,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #256 - 2022-10-11 - Strange Times Call For Strange Storytelling","start":2408.32,"end":2411.8,"speaker":"Nicholas Kotar","text":"But, you know, for the rest of us, let's find something a little bit different."}
{"episode_id":"SW - #256 - 2022-10-11 - Strange Times Call For Strange Storytelling","start":2412.84,"end":2474.67,"speaker":"Jonathan Pageau","text":"Yeah. And so I think that, like, if you follow the line, let's say between someone. If you follow the line also between, like the realistic fiction, if you look at the 19th century romantic and the early 20th century realists, and then you move into the surprise of Lewis and Tolkien and the Inklings and this kind of weird. The surprise, it was already there. Like, it is a continuation of the Romantics to a certain extent. But it's an interesting idea. Like, I really like the idea that Tolkien and C.S. lewis were kind of writing the Old Testament for us, like an Old Testament for. For. For today, which is that how can we now make that next step? And I. There are probably several solutions. Like the one that I decided, that we decided, my brother and I was to tell a fantastical version of our story in a way that is. Is in some way scandalous because it's like it's changing the character that's doing all this, but it's hopefully pointing you back towards your own real legendarium, like, to our own true legendarium, which, you."}
{"episode_id":"SW - #256 - 2022-10-11 - Strange Times Call For Strange Storytelling","start":2474.67,"end":2614.15,"speaker":"Nicholas Kotar","text":"Know, in order to be able to engage with that legendary, you have to come to love it again. And that's. That's the. That's the trick and the trouble here. And unfortunately, it is. It is a critical moment for that, because as I'm. As I'm looking at attempted expressions of this, such as the new Rings of Power show, which I've only started to watch there, this internal conflict is between loving your old legendarium and telling it in a fresh way, or rewriting the old legendarium to fit the better than new paradigm. That conflict is very strong in that show, and it's very interesting to see it pan out. And part of it is just stupid storytelling choices, but part of it is this insistence. And, okay, so I'm probably getting in trouble for raising this in the first place. But the idea of diverse casting is you can argue about this and you can talk about this actually much longer than people are willing to do, because most people either come into one of two extreme camps. One, you're a racist. Two, you're a woke garbage person. And neither the twain shall meet, ever. But there have been very interesting examples of diverse casting in films that I like very much. In the 90s, there was a wonderful Shakespeare adaptation called Much Ado About Nothing by Kenneth Branagh that used colorblind casting. And as a kid, initially, my first impression of a black guy and Keanu Reeves being blood brothers was like, huh? But like, within the first five minutes of it passing, I'm like, okay, this is. I don't care because the actors are so good. But of course, this is Shakespeare, and it's been adapted so many different times in so many different ways that there's a lot of space for it to be adapted in new and interesting ways. So that's one possible way of looking at it. The problem is, though, of course, that the reason that most of the pro people for diverse Casting are talking about this is the following. You have this vast swath of young people who have a certain skin color and they read Tolkien and they see Tolkien on the screen, and they cannot associate themselves with the characters on the screen or on the page. Therefore, we must change the skin color of some of the main characters so that these poor children are able to associate with those imagined characters and inhabit this fantastical space. Which is a proposition that is extremely flawed."}
{"episode_id":"SW - #256 - 2022-10-11 - Strange Times Call For Strange Storytelling","start":2614.71,"end":2624.79,"speaker":"Jonathan Pageau","text":"Because it's ridiculous. Well, because it's a fantastical world, like it's not right. I mean, it's not real. Like, I mean, yeah. Oh, man."}
{"episode_id":"SW - #256 - 2022-10-11 - Strange Times Call For Strange Storytelling","start":2625.35,"end":2655.12,"speaker":"Nicholas Kotar","text":"My point is that it removes from the table the possibility that one can have an experience of an other that is integrative and that doesn't remove the experience of the self. So that's something that I find problematic. I'll. I'll leave it there because it is a very thorny issue. But my point is that you're right. This is a very interesting moment because this show could have been something that started to reintegrate people on a large scale. I think that the Peter Jackson movies started to do it, even though they took a few wrong turns in some of the interpretation. But look at, look at."}
{"episode_id":"SW - #256 - 2022-10-11 - Strange Times Call For Strange Storytelling","start":2655.12,"end":2669.06,"speaker":"Jonathan Pageau","text":"Gimme. Give you an example of someone who actually did that right now. And it's funny because it's not our led. It's. It's the. It's the guy that keeps haunting me. So. So Neil. Neil Gaiman wrote a version of the Northern Gods legends."}
{"episode_id":"SW - #256 - 2022-10-11 - Strange Times Call For Strange Storytelling","start":2669.06,"end":2669.58,"speaker":"Nicholas Kotar","text":"Yeah."}
{"episode_id":"SW - #256 - 2022-10-11 - Strange Times Call For Strange Storytelling","start":2669.82,"end":2708.87,"speaker":"Jonathan Pageau","text":"And it's perfect. It's super well told. It's very respectful of the story. It's basically a retelling of these legends in a way that is celebratory, that. That has a kind of bombastic feel to it. You know, it has this energy to it. And the. Of course, the only reason why he could do that is because it's not Christian, it's Northern and it's pagan, and therefore it's okay to do that. But I mean, the technique and the style and the possibility there for us to take, like, we could do that for some of the. A lot. Let's say a lot. Think of all the wild stories from the Golden Legend or from Russian geography."}
{"episode_id":"SW - #256 - 2022-10-11 - Strange Times Call For Strange Storytelling","start":2708.87,"end":2709.67,"speaker":"Nicholas Kotar","text":"Russian fairy tales."}
{"episode_id":"SW - #256 - 2022-10-11 - Strange Times Call For Strange Storytelling","start":2709.75,"end":2740.5,"speaker":"Jonathan Pageau","text":"Nobody knows. Yeah, or the Russian fairy tales. Nobody knows these stories. And they could be retold in ways that would surprise everybody. The Middle Ages is actually an amazing source because. Because it's the Dark Ages, nobody knows the stories. Like, nobody knows the legends of Alexander. Nobody knows some of a lot of these Arthurian romances. Like, I made a video on this Arthurian romance called Silence, you know, which is so fascinating. I mean, like, Merlin is in it. Is this like, crazy man who laughs the whole time."}
{"episode_id":"SW - #256 - 2022-10-11 - Strange Times Call For Strange Storytelling","start":2740.58,"end":2753.08,"speaker":"Nicholas Kotar","text":"Oh, my God. Crazy. Merlin is the greatest character ever. I love crazy. It's like. It's like he shows up in the really ancient Welsh legends. The guy was nuts. He was off his rocker. Crazy and like, so interesting. Yeah."}
{"episode_id":"SW - #256 - 2022-10-11 - Strange Times Call For Strange Storytelling","start":2753.08,"end":2776.09,"speaker":"Jonathan Pageau","text":"Like a wild end of the forest. And so it's like that version of Merlin could be retold could be told in a way that could be super fascinating for people to discover. But there's, that's just one example. There are many, many other examples. And so it seems like it's, I really do feel like it's a, it could be an exciting moment. And also because let's say when the people in Hollywood, you know, redo the Green knight."}
{"episode_id":"SW - #256 - 2022-10-11 - Strange Times Call For Strange Storytelling","start":2776.25,"end":2776.65,"speaker":"Nicholas Kotar","text":"Yeah."}
{"episode_id":"SW - #256 - 2022-10-11 - Strange Times Call For Strange Storytelling","start":2776.65,"end":2787.13,"speaker":"Jonathan Pageau","text":"They fail. Like, I don't know what to tell you. They fail because they're, they're, they're crippled with their, their desire to inject their message into it. And so because of it, they, they don't do a good job."}
{"episode_id":"SW - #256 - 2022-10-11 - Strange Times Call For Strange Storytelling","start":2787.37,"end":2888.3,"speaker":"Nicholas Kotar","text":"Well, yeah, because, well, it's not just their desire to inject their message. It's these people. Like the director of the Green. I have a lot of respect for him. He's a very interesting person and I think he's trying to do something well. So the problem is that these people honestly believe that meaning can only be made by the self without a reference point to an objective standard. And this, this calls, this harks back to that graphic artists that you talk to, the famous guy from Ben Hatke, his absolute resistance to considering the possibility of there being a best story ever told. Because then it means that my story, the one I have to make for myself, the meaning making mechanism that I have, will be somehow, will be somehow impoverished because there's something greater than me. Instead of seeing it as a possibility to align yourself as much as humanly possible to, to an infinitely beautiful model, it becomes a limiting factor because meaning must be made only within. But you know what? It's happening already. It's happening, it's happening on the edges, on the margins. You know, the aforementioned Martin Shaw did a collaboration with a now recently deceased poet named Tony Hoagland called Cinder Biter. Which by the way, if you have, if you people haven't read it, you have to. It's a retelling of ancient Celtic folktales in modern poetic form. Obviously this is marginal stuff. Not a lot of people are going to read it, but it's life changing poetry, it really is. And if you can force yourself to get through it, it's really incredible. Paul Kingsnorth stories are also marginal, but that's what they're doing. They're engaging with deep, very profound, real, objective realities that form that can have the possibility of forming our internal reality. Who else? I had somebody else that I was."}
{"episode_id":"SW - #256 - 2022-10-11 - Strange Times Call For Strange Storytelling","start":2888.3,"end":2936.2,"speaker":"Jonathan Pageau","text":"Well, I mean, when I read, when I read Beast, I was, I was astounded because I, you know, when I was younger, I was Also, I was one of those people that read a lot of modern literature, and when I read Beast, I was like, this is like Tolkien and Beckett. Like, how did Tolkien and Beckett come together? It's like smash. And I thought this is a real interesting possibility. Like, to take James Joyce, like, for example, there's things in James Joyce which are astoundingly powerful. And there's some things in James Joyce with which are just like unbearably horrible. Like, you know, and so there are some, like the desire in modernism to unite form and meaning, even in the grammar and in the manner in like the structure. Like, that's something which can be taken and can be, can be used for very, very powerful means. Because that's what you have."}
{"episode_id":"SW - #256 - 2022-10-11 - Strange Times Call For Strange Storytelling","start":2936.2,"end":3083.11,"speaker":"Nicholas Kotar","text":"Well, that's what T.S. eliot did so well. That's what T.S. eliot did so well in all of his poetry, right? So if you. But again, you need that shock, right? You need to be shocked into it. Because if you just come into it without, without being prepared, it wash over you. It's too difficult. It's too. It's too structurally vast. It's complicated. So. Okay, well, I just remembered another one that's doing it. So. Richard Powers is a Pulitzer Prize winning author. He wrote a book called the Overstory. Now, he used to be a guy who lived in tech. And I listened to an interview with him between him and Ezra Klein, who's somebody that's very much on the left and somebody that I listened to as a palate cleanser for me to remember why I think the way I do, just to remember how the other side. Oh, Lord. Okay, anyway, so Richard Powers is a guy who used to sit at table with the Silicon Valley tech people who used to honestly, in all earnestness, talk about just hold on a little more. And immortality is within our grasp, whether it's biological or it's informational. I mean, these are actual serious conversations that these people are having. So, like cryogenically freezing my brain, etc. That sort of of thing, right? The sort of thing that CS Lewis described so beautifully in that hideous strength, you know, and that, by the way, a lot of people are recognizing that this Kevin Kelly kind of technology has its own will thing is actually just an entry point for demonic powers. But Richard Powers was in this and he's. He finally kind of snapped out of it. And the reason he snapped out of it is because he recognized that my personal meaning making mechanism, as he expressed it, my way of making meaning, and he's somebody who's capable of doing it a Writer, somebody who's extremely well read, educated, living in a very culturally rich place, the Bay Area of San Francisco in California, surrounded by the best, the brightest people in the world. And his meaning making mechanism broke down. He was unable to make it anymore. And where did he find it in, as he calls it, the more than human world? He went out into nature and he found in their presences that were greater than he. In his mind. Of course, that's, you know, what he's actually feeling, I dare say, is an inkling of natural revelation. It's the same thing that Paul Kingsnorth felt when he was a Wiccan priest. The same thing that Martin Shaw is now feeling when, you know, as he, as he says, Jesus wrestled me to the ground and wouldn't let me get up. The mossy face Jesus that he encountered in the wild. So what happens on the edges, what happens on the margins is indicative of what's going to be mainstream in 10, 15, 20 years. If that's the case, then let's get going and let's start writing to that space because soon it's going to be everywhere."}
{"episode_id":"SW - #256 - 2022-10-11 - Strange Times Call For Strange Storytelling","start":3083.43,"end":3126.47,"speaker":"Jonathan Pageau","text":"Yeah, no, I think for people that are watching, if you're an artist, if you're a writer, this is an exciting time, you know, and the exciting. As we watch, even as we watch the AI art, you know, appear, as we watch the AI writing, which will probably. It's probably being used by some people without us knowing, but it's probably. It's all there, you know, as we're, as we're watching, watching as we're watching this, I think that it feels like as something is being exhausted, there's definitely something else that is being born and we can get an inkling of that in the things that Nicholas is bringing up. So, yeah, so it's an exciting time. Artists get to it. There are better stories and we need to tell them and there are better images. We need to make them."}
{"episode_id":"SW - #256 - 2022-10-11 - Strange Times Call For Strange Storytelling","start":3126.63,"end":3196.43,"speaker":"Nicholas Kotar","text":"Yeah, but for us artists, it's not as easy as just simply sitting down and doing the thing. Like there's things we have to do with ourselves that will make it possible for us to tell those stories. It's not simply, okay, now I have to do this. I'm going to sit down and I'm going to create this thing. We have to form ourselves. We have to. There are certain things that we have to do very intensely to our imaginations and to our internal fragmented selves, because we are fragmented too. We have to work on that internal wholeness, both a spiritual sense, but also in an artistic sense. You know, we need to. We need to have occasional fasts from visual culture. We need to, like, stop watching stuff all the time on our phones and on our, like, seriously. Yeah, because we're saturated. There's no space in which we can. We can allow for, you know, the richness of our imagination, which is so good at connecting things outside of what it sees. We need to, like, fill ourselves with beauty in all different forms. You know, if you're a writer, go listen to some music, Right? If you're. If you're a visual artist, go read something that's outside of your normal palette. Right? Immerse yourself in beauty and all different kinds of things, but also limit. Limit how much you are. You are infusing your eyes with the garbage because there's so much out there."}
{"episode_id":"SW - #256 - 2022-10-11 - Strange Times Call For Strange Storytelling","start":3196.51,"end":3202.91,"speaker":"Jonathan Pageau","text":"Yeah. All right, Nicholas, so. So tell people where they can find your stuff, where they can find your novels. You're also doing podcasts."}
{"episode_id":"SW - #256 - 2022-10-11 - Strange Times Call For Strange Storytelling","start":3203.79,"end":3235.97,"speaker":"Nicholas Kotar","text":"Yeah, let them know I'm doing too much. Yes, it's true. I should apply my. What I just said to myself and cut out half the things I do just. Just to allow space for. For internal wholeness. But, you know, I'm working on it. Yeah. Everything. You can find everything on my website, nicholaskotard.com including the new novella that we talked about, which is free. It's not for sale anywhere. This is an experimental thing I'm doing. I'm giving it out in e book format for free to anyone who signs up to my newsletter, which you can do on the front page of my website. So go and get it."}
{"episode_id":"SW - #256 - 2022-10-11 - Strange Times Call For Strange Storytelling","start":3235.97,"end":3267.85,"speaker":"Jonathan Pageau","text":"So go check it out. And for those who don't know, Nicholas and I are also. We've also started working together more explicitly. And so we're working towards the Snow White story that I've mentioned a few times. And in the hopes of maybe moving towards some really great fairy tales in the future, Nicholas is also an expert on fairy tales. He has a wonderful podcast on Russian fairy tales that you can check out from his website as well. And so there's going to be a lot of exciting stuff in the future. You'll hear more from Nicholas and myself on all that very soon. So thanks, everybody."}
