{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":0.32,"end":36.06,"speaker":"Jonathan Pageau","text":"Hello, everybody. We are back with Richard Rowland for another universal history moment. And this time we're going to go a little more. A lot of people been asking, what are you going to talk about? American stuff, American history, because I understand most of us are in North America. And so Richard proposed that we look a little bit at the symbolism behind Groundhog Day. This is Jonathan Peugeot. Welcome to the symbolic world."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":46.22,"end":56.06,"speaker":"Richard Rohlin","text":"So we're recording this. It's January 28th, the feast day of Saint Ephrem the Syrian, by the way, who we're not going to really talk about today. But it is his feast day, and if you watch this channel, then you've."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":56.06,"end":57.58,"speaker":"Jonathan Pageau","text":"Probably, you know, St. Ephraim is important."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":57.58,"end":103.02,"speaker":"Richard Rohlin","text":"Yeah, you know, he's important. So it's January 28th, so this video will probably land sometime shortly after. After Groundhog Day, February 2nd. And this is a topic and a holiday that I've been fascinated by for a really long time. And so I thought this would be a fun way to talk about universal history. We are going to get back to talking about the Grail a little bit more and maybe some other Arthurian stuff in future videos. But I think that this is maybe an important thing to talk about because it shows a way that there is a remnant, like a ruin of a very important aspect of medieval universal history still present in our culture today in kind of this goofy way. And so I thought it would be kind of fun for people."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":103.34,"end":106.86,"speaker":"Jonathan Pageau","text":"I'm super excited because I know nothing about the origin of Groundhog Day."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":106.86,"end":137.32,"speaker":"Richard Rohlin","text":"There's a Bill Murray movie that is, of course, pretty famous, which we will talk about a little bit, because I think it's. And this is not. Before we started recording, I said that some book was like the greatest book ever, and I was being a little facetious. This is not being a little facetious. I think that Groundhog Day with Bill Murray is one of best movies ever made. And I have reasons for that, which I'm not going to really necessarily get so much into today. But as we talk about the symbolism of Groundhog Day, you're going to be able to understand the Bill Murray movie maybe a lot better. So let's get to it. All right, so tell."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":137.56,"end":139.96,"speaker":"Jonathan Pageau","text":"Because Europeans won't know what Groundhog Day. You have to start with that."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":140.04,"end":142.64,"speaker":"Richard Rohlin","text":"Oh, but Europeans are supposed to know what Groundhog Day."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":142.64,"end":144.72,"speaker":"Jonathan Pageau","text":"Oh, okay. But I. Okay, all right. Go for it."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":144.72,"end":290.42,"speaker":"Richard Rohlin","text":"Okay, but let me. Let me. I'll just explain what Groundhog Day is and how we observe it here, here in the US Of A. Although they actually also do it in certain places in Canada and certain places. It originally comes from Germany, so it originally comes from Western Europe. And there's actually even a version of it in Ireland, which is celebrated not on February 2, but on February 1, which is the feast day of Saint Bridget of Kildare. So here's what it looks like. In the United States, there's this weird tradition, what appears to be like, kind of like a weird folk tradition that nobody really remembers the origins of, and that is that on February the second, for some arbitrary reason, on February 2nd, a groundhog. In other words, a marmot. This is. It's like a. It's like a really giant, fat ground squirrel. I don't know how to describe it. If you haven't seen one, just go Google that or something. In fact, I was once staying in at the Ozark Heritage center in Arkansas. We went there with our family, and they just had groundhogs everywhere, and they were extremely friendly. But basically, it's like, if you can imagine a squirrel without a tail or just a tiny little tail that's as big as most dogs. They're. Yeah. They live underground, but they'll come out. Especially, like, if they're used to people to come out and you can feed them and stuff. And they're. It's. It's scary, though, because, like, they're big. They're big. Yeah, they're big. So the idea is. And this is celebrated particularly at one particular place in Pennsylvania, so we have this very famous groundhog, Pucksutawney Phil. Right. And so the myth, or the kind of the folklore is that if the groundhog comes out of his hole. So the idea is he's been in hibernation for the last six weeks or so for winter. So if he comes out of his hole and he sees his shadow, then he'll get scared by it, run back into his hole, and go back into another six weeks of hibernation. And that's how you know that there's going to be six more weeks of winter. If he comes out of his hole and he doesn't see his shadow, then it's supposed to be an early spring that year. And so that's the folklore. And of course, in practice, there's always. He always sees his shadow. There's always six more weeks of winter, because basically, we're materialists. And so we make the groundhog conform to when we say winter is over, rather than making winter being over conformed to when the groundhog says it's going to be over. Right."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":290.42,"end":292.14,"speaker":"Jonathan Pageau","text":"So he always sees his shadow, basically."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":292.14,"end":352.03,"speaker":"Richard Rohlin","text":"He always sees the shadow. Yeah. And so that's the thing. And in the United States, there will always be like a little news story on February the second, affirming whether or not Pixutawney Phil sees his shadow, right. And then has to go back in the hole. So there's a really famous Bill Murray movie which you mentioned, that was made kind of based around this concept. And so in this case, you have this guy, a newscaster, a reporter named Phil, played by Bill Murray. And he's kind of like most of Bill Murray's characters, very kind of world weary, very acerbic, kind of actually an awful person. But because he's. But always with this sort of brilliance where they don't tell you he's an awful person. They just let you pick it up in all these little ways and you start to realize, man, this guy's pretty terrible, right? And basically funny because he's terrible, but funny because he's terrible, right? And so basically this. This character, this newscaster Phil, he goes to sleep. So. So he has to go out and."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":352.51,"end":354.07,"speaker":"Jonathan Pageau","text":"And it's on Groundhog Day."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":354.07,"end":393.29,"speaker":"Richard Rohlin","text":"On Groundhog Day. So go on a Groundhog Day and do this fake, you know, do this fake news story about the groundhog seeing his shadow. And it's. It's stupid. It's made up. He hates it. He's really upset about it. He treats all of the people like his producer and his came and treats them all really terribly, and then wakes up the next morning and finds out that he has to repeat the entire day. And he has to repeat the entire day over and over and over again until basically he gets it right. And in this case, getting it right means he learns to be a much more selfless individual. And he learns to. And then. And then he wins the love, too. He wins this. Yeah, well, he learns to. Hey, this is important."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":393.29,"end":393.93,"speaker":"Jonathan Pageau","text":"It's very important."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":394.09,"end":394.61,"speaker":"Richard Rohlin","text":"Very important."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":394.61,"end":396.01,"speaker":"Jonathan Pageau","text":"Sounds tacky, but it's very important."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":396.09,"end":540.77,"speaker":"Richard Rohlin","text":"Yeah, it sounds like it's corny or something like that, but it's really important. Important to understanding the story is that he learns to love and then be loved by this. This woman in his life who had been treating pretty badly up to that point. So, I mean, that's. It's a great, fun movie, and most people have probably seen it. And if not, like, if you're just, like, really young and you didn't grow up watching that movie, then you should go watch it, because I think you'd be surprised how good it is. So I want to talk about why is this a thing like. Of all the most arbitrary things, I used to joke that February just really got the short end of the stick as far as months ago, because it already has fewer days. And then it just has a bunch of seemingly arbitrary made up stuff going on in it. Like Groundhog Day. It's like, what's this about? Well, Groundhog Day is actually the one remaining remnant within American popular culture of actually a very important holy day in the history of Western Europe and the history of Eastern Europe as well, just within the Christian tradition. And that's a feast day. In the Orthodox Church, we call it the meeting of the Lord in the temple. In the Western tradition, it's sometimes referred to as the purification of the Blessed Virgin Mary. Or more colloquially, in the old English tradition, it's called Candlemas. Right. The reason it's called Candlemas is because this is the day in the Christian tradition when you traditionally, you get a whole bunch of candles. You either make them or you buy them, and then you bring them to the church. And you bring them to the church for a couple of reasons. One is to give them. In the Middle Ages, you would. You would give. So they actually had these. These groups of laypeople that would come together in a guild. They were called Candlemas guilds. And what they would do is they would either make or buy a lot of really, really big candles. And then every year on Candlemas, they would donate the majority of these candles to the parish. And it was how the parish, I mean, candles were pretty expensive in the Middle Ages. Illumination. Sometimes they were called illumination guilds, like illuminating things, especially, most importantly, illuminating the host at the moment of the elevation so that people could see it, especially if it's kind of dark outside, there's no electric lighting. Things like this. This is a really important function. So it was a way for lay people to serve the community."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":541.62,"end":544.3,"speaker":"Jonathan Pageau","text":"They would give the candles so that the church would have candles for the year, basically."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":544.3,"end":645.97,"speaker":"Richard Rohlin","text":"Right, right. But then also they would get their own candles blessed. And so that. So that you would get a holy candle and you could take this holy candle home. And if there was sickness in the house or there were other reasons to suspect demonic activity, and I don't say that at all cynically, in fact, I have. Hold on. I still have a handful of my own holy candles left over from last. Last year. So if there's sickness in the house or some other like, hint of demonic activity, you light the holy candle to drive out the darkness and to drive out the demonic influences. So that's why it's very often referred to as Candlemas. So the event that this feast celebrates in the life of Christ is, of course, Mary and Joseph coming to the temple, bringing the Christ child, presenting an offering of two young turtle doves. And as they're doing this, they're met by these two figures who kind of represent the. You could say, like the last of the old guard of the righteous remnant of the Old Testament. So one of them is the Elder Simeon. And there's this whole tradition about the elders, the Elder Simeon, that he's actually several hundred years old doesn't say this in the Bible. What it says in the Bible is that he is. That the Lord had promised him that he would. He was. It just says he's of a great age. Of a great age. And that the Lord had promised him that he would not die until he had seen the Lord's Christ, until he'd seen the Messiah. But there's a tradition about him that says that he's extremely old, you know, several. Several hundred years old, and that, in fact, he's one of the original translators of the Septuagint."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":645.97,"end":646.85,"speaker":"Jonathan Pageau","text":"Oh, interesting."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":647.17,"end":696.14,"speaker":"Richard Rohlin","text":"So there's this. Maybe the best way to understand that is simply to say that he's got this explicit tie to the Old Testament. Right. So that he's. He's one of those 70 elders who translated the Septuagint into Greek. So he's. He's got this explicit tie to the Old Testament. So he's. He's, you could say, like the last guard. The last. I know that technically speaking, like John the Baptist is sort of the last Old Testament prophet. Right. But you could see Simeon as. As also kind of filling that role to a certain extent. Right. He's the. He's the archetypical last Elder of Israel. Right. That the. At this point in time, the faithful people of God in Israel have been. You know, it's just a very few. It's a very small remnant. And of that small remnant, Simeon is kind of, you know, the type of all of them."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":696.14,"end":703.7,"speaker":"Jonathan Pageau","text":"Yeah. And he also, if he's the translator of the Septuagint, that he also represents something like the last breath of the Old."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":703.78,"end":704.34,"speaker":"Richard Rohlin","text":"Yes."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":704.5,"end":714.81,"speaker":"Jonathan Pageau","text":"Old Testament. And that will be illuminated by the candle. Right. Will be illuminated by Christ and will be revealed. Like it'll be revealed for what it is or for what its purpose is."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":714.81,"end":809.52,"speaker":"Richard Rohlin","text":"Yeah. So that. There's that. And, of course, what does he pray? He says, mine eyes have seen your salvation. Right. A light to be revealed to the Gentiles and the glory of your people, Israel. So the idea is that you have something that was the light, was the glory of Israel, which could be the Torah, right. Could be the law, the Old Testament, the Hebrew Scriptures. And then it's revealed to the Gentiles, revealed to the nations. Sometimes it's translated, but it's really Gentiles. Right. The light dawning on the Gentiles. Right. And so it's this, this. This light moving out of a place of darkness and obscurity into kind of a more open place. Right. And attached to this, there is the symbolism of. Attached to this is the prophecy which Saint Simeon makes about to the Mother of God about her own sorrow at the foot of the cross. He says that this child has. Has been, you know, brought into this space, brought into the world for the rising and falling of many in Israel and for a sign that will be spoken against. Of course, the sign that will be spoken against is the crucifixion. And then he says, but a sword will pierce your own heart also. Right. And so he's talking about the sword piercing the heart of the Mother of God at the moment of the crucifixion, her anguish. And this is like the predominant perspective that we get in Orthodox Holy Week is mostly from the. The perspective of the Mother of God watching her son in the lead up to the Passion, watching her son on the cross. Yeah. And so all of this is. Is under. Is really important to understand what's going on in this holiday. And I swear it is in fact connected to Groundhog Day."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":810.48,"end":867.34,"speaker":"Jonathan Pageau","text":"Well, for sure. Like already, the idea of the perpetual, if you think, understand theophany, because often we think of theophany as the baptism of Christ. But theophany in its more original symbolism had to do with light that. To do with the revelation of the divine Logos, of the light shining onto the world, which made sense after the birth of Christ, which is the solstice at the darkest day, where the sun is hidden, where the light still looks like it's going down. You don't know yet that it's coming back, that it's actually. It's moving up, right. It's moving into its revelation. And so to think of. Of theophany, epiphany as the first glimmers of that light and the beginning of the showing of what has happened, you know, on Christmas morning, moving in now to Simeon, recognizing and saying now the light. He even uses the image of the light which will be assigned. So, I mean, it's very powerful."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":867.42,"end":1017.96,"speaker":"Richard Rohlin","text":"Yeah. So we'll come back to the. The light and the darkness here in just a second because that's really important to this. I do want to point out though, that there's also this particular feast has these. This really explicit. If you look at the iconography for this feast, it's very explicitly tied up with the idea of the temple, of the sanctuary, of the holy place, and of the reception of the Eucharist. And so if you look at an icon of the feast, what you'll typically see is the Mother of God handing the Christ child to Simeon. But Simeon has his hands covered with his robe. Right. And if you look at something like an icon of the communion of the apostles or something like that, you'll see the same kind of thing in an icon. You never see people taking communion with their bare hands. Right. They've always got their hands covered with, usually with like their outer garment or the robe or something like that to receive the Eucharist. Right. And then behind them, in the icons of this feast, behind them there's always this very curious looking structure. It's got four pillars and then a dome, usually a dome or kind of a roof over the top of those pillars. And then very often there's a curtain that can be drawn around them. Yeah. And so in the Tabernacle of Moses, right, obviously the whole thing is a tent, but then when Solomon builds his temple, in the Temple of Solomon, there was this pillared curtain, right? So like a tent inside of the temple, basically enclosing the Holy of Holies, Right. The place where the Ark of God was supposed to rest. And in the ark you're supposed to have the, you know, obviously you're supposed to have the tables of the Law and the Ten Commandments, or the tables of the Law and the Manna and so on. Right. Well, obviously, as we've talked about in this series, at some point the ark went missing. And so at some point these things are missing from the holy place, the most holy place in the temple. And they're certainly not present in the second Temple. Right. By the time of Christ. Right. There's no ark in the temple, which is why the parallel feast to this feast, you could say the four feasts together have. I'm going to try to do a piece on this for the symbolic world block. So maybe it's already written, I just need to finish it up. But in the winter feast of the church, you have this chiastic structure where you have, starting with the entrance of the Theotokos and the temple and then going to Christmas and Theophany or epiphany, and then finishing Right. At the presentation of the Lord in the temple. Right, yeah. So it's a really nice structure. And so at the parallel feast of this one, the entrance of the Theotokos in the temple, that's a big deal because it's the first time the ark has actually come to the second temple. But anyway, that's a different video, different discussion."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":1017.96,"end":1023.24,"speaker":"Jonathan Pageau","text":"Yeah. And so now you have like the glory descending on the ark, basically, like one of that type of imagery."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":1023.48,"end":1046.66,"speaker":"Richard Rohlin","text":"So this structure, this four pillar structure with the dome on top of this is a jiborum. And as you know, in early Christian architecture, when Christians started being able to build their own church buildings before the iconostas really developed. Right. Before that really existed, what you had was this giborum. This is this canopy with a curtain that could be closed at certain points during the liturgy over the holy table."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":1047.06,"end":1081.67,"speaker":"Jonathan Pageau","text":"Which, by the way, the chiborum, you can see it still if you look at images of the communion of the apostles, usually Christ is under a chiboro. And in the Ethiopian church, most of their altars have chiborum, like the ones that I've seen, they still use that structure. Coptic churches still use that often as well. And there's even a little bit of a tendency now in the modern Orthodox churches to reintroduce it into the practice. I saw at Chiborom, there's one in South Carolina at a Greek church that."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":1081.67,"end":1356.12,"speaker":"Richard Rohlin","text":"I went to, where I saw there are some very old Greek churches, like in Greece that still have them, and even some very old Western churches and like the Netherlands that still have them. Yeah, yeah. So when you see a chiborum in an icon, Right, which, as you just pointed out, anytime someone is being given communion in an icon, there's always a chiborum in there somewhere. Right. So this is a way, it's doing two things. One is, it's. It's this explicit tie from the Jewish temple to the Christian temple. Right. But then also it's this. It's a sort of a shorthand to tell you something eucharistic is, is happening and kind of the meaning of this feast. Right. And so you have Simeon here standing in front of the chiborum, and a lot of times on the, on the altar, under the chiborum, you'll see a gospel book, which is of course an anachronism from a. Like, a purely like, boring sense of understanding things. Right. But for us, we, we see it as what's supposed to be in the most holy place. That isn't. Is the tables of the law, right? But the tables of the law in the Christian church are replaced by. We don't have a Torah scroll in the altar. We have. We have the Gospels, right? So there's this, you know, kind of all this. All this great symbolism, which again, is part of that thing of, like the hidden glory of Israel now becoming the light for the Gentiles, right? And so you've got Simeon in the attitude of someone receiving communion standing behind, in front of this structure, which is all about the reception of the Eucharist, all about communion, right? And he's receiving the Christ child. And if you look at the hymns of the Orthodox church around this feast, like the festal Manaon, they talk about this idea of the Eucharistic symbolism that's going on here. It's really explicit in the hymns. But then they also tie it back to another meeting of the Lord in the temple, right? Which is in Isaiah, chapter six. So in Isaiah chapter six, you have a prophet who goes to the temple and he meets with God. And in this story, what you have is a prophet who's waiting at the temple because God isn't there. But then God shows up to the temple, right? And so it's kind of this inversion of the Isaiah 6 story. And. And so there's one of the hymns. One of the hymns says something like, the seraphim, who is Mary, right? So in that. In that story, in Isaiah, chapter six, right, Isaiah has this vision of God, and he sees him and he says, woe is me, I'm undone. I'm a man of unclean lips. I live in the midst of the people of unclean lips. For mine eyes have seen the King, the Lord of hosts, right? And so a seraphim takes one of the. Takes a pair of tongs, takes one of the coals from off the heaven, the altar, and comes and touches it to his lips. And when he touches it to his lips, he says, see, this is, you know, your sin is taken away, your lip, you've been purged, you've been cleansed, right? And so the. The hymns around this feast in the Maneon, they. They take that symbolism and it talks about the seraphim who is Mary, brings the burning coal that is the Christ child, right, and gives it to the prophet Simeon, right? And at that point he's able to say, now let your servant depart in peace. In other words, I'm ready to die now. And in the Middle Ages, this is very closely associated with the idea this might seem weird to us now, except for those of us, you know, who are maybe more traditional Christians. But even then, like, if you're a convert, it's hard to think about things this way. But in the Middle Ages, one of the main things that people prayed for, almost the only thing that people prayed for if you were very poor, was that you would. You would have enough anticipation of your death that you would be able to make one final confession and receive communion before you died. Right. They called it like you're traveling money, in other words, that you would be able to receive the Eucharist one last time before you make the journey to the next life. And so they saw Candlemas as being sort of an example of this, that he receives Christ one last time before he crosses the river into death. Yeah. And so. So there's. There's a bunch of really cool, beautiful Eucharistic symbolism in here. And of course, in the Orthodox Church, when priests take communion, right, when they give themselves or when they take communion, they say, see, this has touched my lips, my sins purged. Right. So they say those words from Isaiah when they receive communion. So there's this really beautiful, like, kind of triangulation between the feast of the meeting of the Lord of the temple and the meeting of the Lord in Isaiah, chapter six, and then the reception of communion in the ancient church. So I just wanted to point all that stuff out because it really helps us understand the symbolism of this feast and kind of what this feast is about. Right? This feast, it's about illumination, it's about fire, it's about the hidden glory. Right. Kind of being."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":1356.2,"end":1357.08,"speaker":"Jonathan Pageau","text":"And it's about light."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":1357.56,"end":1358.28,"speaker":"Richard Rohlin","text":"Right? It's about light."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":1359.56,"end":1360.68,"speaker":"Jonathan Pageau","text":"It is definitely about."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":1361,"end":1361.32,"speaker":"Richard Rohlin","text":"Yeah."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":1361.32,"end":1364.2,"speaker":"Jonathan Pageau","text":"About the light manifesting itself more and more."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":1364.2,"end":1413.69,"speaker":"Richard Rohlin","text":"But it's not just about light manifesting itself, because it's always light that comes with. Because there's also an element of it that is actually about a prediction of darkness. Right. Because because of Resinian, he has this beautiful moment of light, and then he says he's going to be a sign that is spoken against. He's talking about the Passion. Yeah. And he says a sword is going to pierce your own heart also. So it's. It's this. It's also the promise of darkness, is the promise of a wound, but ultimately it's the promise of Pasca. Right. Which is. Which is the preeminent Christian festival of light breaking out of the world. Right. Coming out of the darkness. So why February the second? Right. Well, obviously, February the second is 40 days after December 25th. So it's it's 40 days after Christmas, and so it's the 40 days of the Virgin Mary's purification. However, February the second."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":1413.69,"end":1417.41,"speaker":"Jonathan Pageau","text":"I mean, you people don't know anything about this. Like, you have to just say, okay."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":1417.41,"end":1419.99,"speaker":"Richard Rohlin","text":"Yeah, sorry, yeah, go ahead."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":1420.15,"end":1431.75,"speaker":"Jonathan Pageau","text":"That women would have to. Would have to purify themselves after a certain amount of time that they. They had to do that regarding their menstruation, but they also had to do it regarding. After giving birth to a child."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":1431.83,"end":1513.47,"speaker":"Richard Rohlin","text":"So according to the law of Moses, 40 days after giving birth to the. To a child, women were supposed to present themselves at the. The temple of God or the tabernacle. The temple of God, and bring an offering for their purification, either, you know, like a young lamb, or if you were poor, then you could bring, like, two turtle doves or two young pigeons. I think. I think I've read from one historian that, like, at the time of Christ, people only ever brought the two birds. But anyway, and so you're supposed to bring an offering. And it's basically, you could say it's. We probably don't want to get in this too much, but you could just say, like in the Old Testament and the Mosaic Law, there are certain things that bring you very close to life, like the beginning of life or very close to death. And it's like, those things are too holy. And so if you're exposed to them or if you participate in them in some way, then there has to be this reintegration of you into kind of the normal liturgical community, like the normal community of the people of Israel. Right. And so that's what this is about, right? Birth being extremely close to, like, the beginning of life, but also very close to. To death. Yeah, yeah. Both of those things at the same time. And so a woman at the end of. And we still do this in the Orthodox Church today. We there. There's, you know, the ceremony of churching for a woman and her child, which we're going to be doing here in just a couple of weeks."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":1513.55,"end":1514.03,"speaker":"Jonathan Pageau","text":"Nice."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":1514.19,"end":1596.61,"speaker":"Richard Rohlin","text":"Because we just had a. Just had a baby a few weeks. Thank you. Thank you. Yeah. And so. So all of this. And again, like, you can even understand that purification, right? It's something that's. That's hidden. So, like, a woman, after she has a child, she's supposed to be hidden, sequestered from the community of the people of God. Right. Almost. Because she's, like. She's, like, too special. She's, like, too holy. She can't. She can't yet integrate into the. Into the Life of the community. Right. And then at the end of that time, that hidden glory is now revealed into, like, a more public kind of a light. However, the traditional date for Good Friday is, of course, March 25, which at one point in time was the spring equinox. I know that the solstices and equinoxes, they move around a little bit, but at one particular point in time, that was the traditional date of both Good Friday and The Annunciation is March 25. Lots of people out there might want to, like, argue about this stuff. All I can say is, I don't care. I don't care. Yeah, this is. This is. These are the traditional dates. That's all that needs to be said about it. So what you have to realize is that this situates the meeting of the lord, which is 40 days after, you know, this situates the meeting of the Lord or Candlemas, as being halfway between the winter solstice and the spring equinox."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":1596.69,"end":1597.09,"speaker":"Jonathan Pageau","text":"Nice."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":1597.09,"end":1612.26,"speaker":"Richard Rohlin","text":"Yeah. So to me, this is. This sort of reveals or sort of brings out one of the most important facets of universal history. Okay. And this is why this is justly a universal history video. Not just Richard talking about, you know, feasts that he likes. Right."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":1612.26,"end":1613.22,"speaker":"Jonathan Pageau","text":"And Groundhog Day."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":1613.22,"end":1784.13,"speaker":"Richard Rohlin","text":"And Groundhog Day. Because one of the most important elements of universal history is the way. Is understanding the way that the Christian story maps onto, and it fulfills the sort of old agricultural cycle of the year, which is present. It's not just pagan. Is present in both paganism and Judaism. Both paganism and Judaism have this old. This agricultural cycle that, by the way, predates the law of Moses when. When God starts telling the children of Israel, here are the feasts of the agricultural cycle. That wasn't the first time that they'd ever heard of them or celebrated them. Right. He's just telling them, here's how you celebrate these in a way that shows that you're my people. Right. But everyone basically has these feasts and more or less with certain variations. Pretty much every culture in the world that lives within the same kind of climate and climate cycle has the feast right around the same points in time. Okay. So what universal history does. You know, one thing that we've talked about is the way that universal history shows how a group of people try to tie themselves into the Christian and the Roman story. Right. But another thing that universal history does, that's kind of part of this, in this broader, expansive way that I'm using the term, is it shows how does my daily life tie into that story. Sometimes people will make a big deal about the fact that, for instance, in Celtic paganism, they had these sort of quarters of the year, and these were the days that fell exactly between each solstice and equinox, Right. There's one on this date in Ireland, it was celebrated on February 1, which happens to also be the feast day of St Bridget of Kildare, who's actually the patron saint of my new daughter. So there you go. It's all connected. And so people will make a big deal about this and they'll be like, oh, this is just like, see, it's just a Christianizing of this older pagan thing. And again to that, I have to say one, I don't care. You guys can be complaining. We'll baptize Shark Week. I'm sure you've seen that meme. It's like, listen, if you guys keep. If you guys keep complaining about this stuff, we're going to make sure our week, a Christian holiday, like to deal with it. But, but I mean, in another sense, you have to realize that this is the. This is the way that things work, right? This is the way that. That reality manifests. And this is the way that we know each other and the world that we live in. And it's the way that we know God. Right? Is the way that these things manifest themselves in time and the cycles, the recurring cycles of the seasons which were made by God. Right. And so it's kind of like, preposterous to think. And this is why I just. I get heartburn from these people who are like, oh, well, this. You know, a long time ago when I was a pastor of a church, there was a big fracas because we. We had a Christmas tree up in, like, the. The foyer. The foyer, you know, which is what Baptists call the narthex, you know?"}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":1784.13,"end":1784.53,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":1784.69,"end":1898.96,"speaker":"Richard Rohlin","text":"And some people are like, oh, well. And, you know, like, Chris, you know, that's a pagan holiday. And they sent me like, this DVD series, you know, like, you know, you gotta take the Christmas pig, right? I know you know what I'm talking about, right? But the reason that stuff gives me heartburn is because it's like, you know, you think God doesn't own the days of the year? Like, he made the year, he made the agricultural cycle, he made the solstices and the equinox, you know, like, he made these things. And so why would he not, when he manifests himself in the world, right? When he becomes incarnate, he becomes incarnate, taking on human nature in this full, complete, total way. But he also, like, becomes incarnate at a particular point in time at a particular place in history. But what the. What the whole sort of Christian year shows is the way in which that particularity. You say again, like the. The glory of the people, Israel becomes a light to the nations. Right. And so. And so Christ doesn't just fill up the 33 years that he's walking around on planet Earth, but actually fills up all of time with himself. Right. So there's no other way that this stuff could manifest. Right. This is a feature, it's not a bug in. Understanding the relationship of the times of the year to the life of Christ via the Christian liturgical year is vital. It's absolutely vital to the reading of medieval literature. Just to take as a for instance, Arthurian literature, every great Arthurian story happens at a particular Christian feast day. Sometimes it's Pentecost, sometimes it's Christmas. Sir Gawain and the Green Knight happens on the feast. Not of Christmas, one of my many. I mean, it happens during Christmastide, but doesn't happen on Christmas Day, which is one of my many beefs with a recent film. It happens on the feast of the circumcision of the Lord, which was very popular in England at the time that that poem was written."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":1899.19,"end":1908.15,"speaker":"Jonathan Pageau","text":"And also, it's like, don't you. You cut something, a monster in two, and you don't understand that there's a relationship between the circumcision and that."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":1908.23,"end":1908.59,"speaker":"Richard Rohlin","text":"Yeah."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":1908.59,"end":1911.67,"speaker":"Jonathan Pageau","text":"And that it's like you're missing out on some of the story of what?"}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":1911.75,"end":1939.19,"speaker":"Richard Rohlin","text":"And I don't want to. I don't want to. Like, I don't want to sound impious about this. Okay. But first of all, you have to understand, in the Middle Ages, people thought this was a pretty good joke. Right. There's a beheading happens on the feast of the circumcision of the Lord. Like, like, people. People were aware. Right. But also, like, if you don't understand. If you don't understand that that story begins on the feast of the circumcision, you won't actually understand anything about the story. Right. Which is like, what to do with the remainder."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":1939.43,"end":1939.99,"speaker":"Jonathan Pageau","text":"Exactly."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":1939.99,"end":1941.03,"speaker":"Richard Rohlin","text":"That's what the whole story is about."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":1941.11,"end":1948.15,"speaker":"Jonathan Pageau","text":"What the whole story is about. I mean, it's about, you know, like, the sash and everything is always about. It's all about that."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":1948.15,"end":2152.29,"speaker":"Richard Rohlin","text":"It's so and so. Yeah. And so if you don't understand this stuff, then you won't be able to read medieval literature. Right. And kind of know what it's about. So to me, like, if you want to understand something like medieval universal history, one of the most important things you need to do is say, well, how did, how did a certain group of people, how did they celebrate this feast? What did they do for Christmas? What did they do for Easter? What did they do for. If you want to understand, like who they really were and what they thought about themselves, it's not just how did they write themselves into the larger narrative on this really meta cultural level, but how did they see themselves as being a part of that story in their day to day life? For instance, Candlemas England. Huge deal. Huge deal. And in fact, if you lived in a town that was large enough to do this, most Candlemas celebrations were celebrated by a sort of mystery play slash procession before Mass. So you'd get one of the women of the town to dress up like the Virgin Mary, which of course for them meant you should dress her as beautifully as you could afford to do, right? Because they weren't interested in the fact that, okay, yes, obviously Mary and Joseph were quite poor. You know, for them it was, it was, you know, this is. They're trying to show her as who she is, right? She's the Queen of heaven, she's the Mother of God, right? So we want to show that in the way that we dress her. So they would dress her up. You'd have an older man in the town playing Joseph. She would be carrying like a little doll, right? And then you'd have a whole procession, right, A whole procession with everyone bringing, again, bearing candles. Everybody would light their candles and they bear them together in this big procession to the parish church. And then they'd have like an older man meet you at the door of the parish church and you'd come in and what would you do? You'd celebrate Mass and of course receive the Eucharist, right? So there's this whole, you know, there was like this very, it was very festal. There are whole carols. Like we know about Christmas carols, right? But there actually used to be carols for everything. And Christmas carols are the only things that have really survived. Because Christmas, for most people, like living in the west, most evangelicals is kind of the last surviving vestige of the Christian year. Like, even more so than Easter. Yeah, you're right. Yeah, even more so than Easter. Like, I know that, you know, at the churches where I served, Christmas is a much bigger deal than Easter, right? And that's when, you know, even a Baptist church, like, they'll break out the Nativity scene. They'll put some graven images right up there in front of the pulpit for everyone to look at for the entire month of December. You know, it's. It's kind of. But it's just like when Christmas hits, that's when our nostalgia really kicks in for not just for like, how did my family celebrate? But also like a wider cultural nostalgia. It kind of kicks in. And we do things and we sing these really old songs. Those are oldest hymns in any given Protestant hymnal are always going to be your Christmas carols. Right. That go back, you know, as early as the 15th, 16th century. Right before the Reformation. Right. And it's just like when we hit Christmas, a certain nostalgia kicks in. But there used to be carols for everything. And there are beautiful, interesting, fascinating carols, even candle mass carols, Candlemas carols, even some written by puritans in, like, Colonial Williamsburg. Wow. In fact, can I just read you a couple? Is that okay? Do we have time?"}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":2152.29,"end":2153.33,"speaker":"Jonathan Pageau","text":"Sure. It's up to you."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":2153.97,"end":2169.81,"speaker":"Richard Rohlin","text":"All right, so one thing that to know about Candlemas, so this is like a little kind of a superstition around Candlemas is that Candlemas is actually when you're supposed to take your Christmas decorations down, Right. So you put them up on Christmas Eve, you take them down on Candlemas."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":2169.81,"end":2172.65,"speaker":"Jonathan Pageau","text":"I thought you put. We took them down on Epiphany."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":2172.65,"end":2174.93,"speaker":"Richard Rohlin","text":"Yeah. Well, let me just read you this."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":2175.01,"end":2177.97,"speaker":"Jonathan Pageau","text":"All right. There's a little bit of a conflict there."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":2177.97,"end":2196.82,"speaker":"Richard Rohlin","text":"All right, so this one, this one is a poem from Colonial Williamsburg. Okay. When New Year's Day is passed and gone, Christmas is with some people, done. So some people stop celebrating Christmas on New Year's Day. Right. But further, some will it extend. And at 12th day their Christmas end, which is what you go."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":2196.82,"end":2197.22,"speaker":"Jonathan Pageau","text":"That's me."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":2197.22,"end":2222.61,"speaker":"Richard Rohlin","text":"Yes. At candle. And some people stretch it further, yet at Candlemas, they finish it. The gentry carry it further still and finish it just when they will. They keep good wine and eat good cheer and keep their Christmas all the year. There you go. So some people. Some people are always partying, Right. And I do have neighbors who keep their Christmas lights up just all year long. And I don't know what's going on there, but they seem like."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":2222.61,"end":2227.81,"speaker":"Jonathan Pageau","text":"But we tend to keep the Christmas lights outside. People tend to keep them towards. Until the end of."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":2228.21,"end":2229.89,"speaker":"Richard Rohlin","text":"Of winter. Yeah, yeah, yeah."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":2229.89,"end":2232.13,"speaker":"Jonathan Pageau","text":"But the inside. The inside decorations go down."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":2232.61,"end":2240.73,"speaker":"Richard Rohlin","text":"Yeah. Christmas lights, like, aren't quite the. They're not quite as good as a holy candle, but in our. In our modern age, they're pretty darn Close."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":2240.73,"end":2241.57,"speaker":"Jonathan Pageau","text":"They're pretty close."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":2241.73,"end":2315.72,"speaker":"Richard Rohlin","text":"That's right. They're pretty close. Yeah. I'm a big fan of, like, please just, like, make your yards go crazy on Christmas. I think that's great. But I'll read this other one. This is real quick. This, like, this is like a late 1500s. This is a candleless carol. It's called down with the Rosemary. And so. And you can find, like, people singing on YouTube, but it goes like this. Down with the rosemary and so down with the bays and mistletoe down with the holly ivy all wherewith you dressed the Christmas hall so that the superstitious find no one least branch there left behind for look how many leaves there be neglected there Maids trust to me so many goblins you shall see. So it's like for every, like, for every, like, leaf of Christmas decoration you leave out, you're going to have that in your goblins after Candlemas, right? So, yeah, so it's. So it's, it's. And that's kind of like a silly little rhyme. But you can again, see there's something about the day going back to Simeon's prophecy, right? It's this revelation of light, but it's also, there's some kind of a prediction of the monstrous of something, something that's going to happen. So all of this is, I think, pretty important to understanding. So where did we get Groundhog Day from?"}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":2315.72,"end":2317.76,"speaker":"Jonathan Pageau","text":"All right, let's go Groundhog Day now."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":2318,"end":2384.1,"speaker":"Richard Rohlin","text":"So Groundhog Day in various places in Europe, this day, February 2nd, probably because of some. Well, for all the reasons that we just talked about, right? You're halfway between the winter solstice and the spring equinox, right? All this stuff became a day of what you could call what's sometimes called weather lore or weathermancy, right? So it's basically like trying to predict the weather. How good of a spring, like, how good of a spring are we going to have? When can we start planting, like, all this different stuff, right? It's all tied up, tied up on this stuff. And so what happened is that in pretty much all Western European traditions, they started using the weather on Candlemas Day, which, again, hits at this midpoint, but is significant for these other spiritual reasons and for them. Like in the Middle Ages, if you were like, well, there's like a meteorological reason and then a spiritual reason. And if you tried to tell somebody in the Middle Ages that those were just, like, separate things that didn't have anything to do with each other, nobody would. They'd look at you like you're a crazy person. Right."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":2384.1,"end":2384.94,"speaker":"Jonathan Pageau","text":"And they'd be right."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":2385.1,"end":2424.57,"speaker":"Richard Rohlin","text":"Yeah, they'd be right. So they use the Candlemas weather to predict the beginning of spring. And usually in Germany, the, the, the animal in question was actually a badger. And so in fact, in Nova Scotia, which is up in Canadia or so I'm told, it's called Dachs Day. With docks being like the, the, the German word for a badger. Yeah. Okay. So not, not Groundhog Day, but Dachs Day sometimes. Also though it's a fox or a bear for our purposes, it can basically be any hibernating animal, like anything that goes to sleep in the winter and then wakes up in the spring."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":2424.73,"end":2430.09,"speaker":"Jonathan Pageau","text":"Interesting for the bear. How would they get the bear to come out during hibernation? Sounds a little trickier."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":2430.25,"end":2442.17,"speaker":"Richard Rohlin","text":"Well, that's where they tended to use badgers. An angry badger is still a handful, let's say, but not quite to the level that an angry bear is. That's right."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":2442.44,"end":2443.24,"speaker":"Jonathan Pageau","text":"Grumpy angry."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":2443.64,"end":2485.12,"speaker":"Richard Rohlin","text":"So when the Pennsylvania Dutch when they. There, these are like basically immigrants from German speaking areas of Europe and they migrated to this part of Pennsylvania where there were no badgers. But what did they have that hibernated in the winter? Groundhogs. Right. Marmots. Right. And so that's kind of the, that's kind of the origin of that. So basically what you have is there's this obscure weather lore practice that is. Well, it's not obscure, it's like pretty widely practiced, but it's on the fringe of the thing that the feast is about. And in the United States, we've totally forgotten the feast. Right, We've totally forgotten the feast. But everyone remembers the little minor weatherlore practice that's associated like Halloween."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":2485.12,"end":2488.48,"speaker":"Jonathan Pageau","text":"You know, it's the same as how Americans celebrate their holidays."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":2488.48,"end":2491.96,"speaker":"Richard Rohlin","text":"Christmas too. Yeah. Like we take the fringe thing and."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":2491.96,"end":2497.78,"speaker":"Jonathan Pageau","text":"We the grift the gift giving. That's the feast. You take the monsters coming out, that's the fees. And now the."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":2497.78,"end":2498.14,"speaker":"Richard Rohlin","text":"Right."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":2498.14,"end":2499.62,"speaker":"Jonathan Pageau","text":"Now the badgers."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":2500.26,"end":2598.8,"speaker":"Richard Rohlin","text":"Yeah. And so we take the thing that's sort of like the fringe part of the celebration of the holiday, which, there's nothing wrong with that. In its place it's fine. But then that's the. We take that thing, we put it in the center. It becomes the most essential thing. Right. But I do want to talk real quick now, now that we kind of understand like the background and kind of this, you know, the spiritual and the medieval map of, of this feast to talk about what it means for the groundhog to see its shadow and to go back into hibernation. Right. So the whole idea of seeing its shadow is that it's clear and sunny on the day. Right. You're in the middle of winter right now. Right. So six weeks into winter, you got six more weeks of winter coming. So if it's the middle of winter and in this particular climate, like northern European climate, and it's bright and sunny and kind of a warm day, such that this animal, which is coming out of death, right. It's coming out of sleep, is coming out of the earth, comes up out of death, it sees the light, but you could say it, like, sees the light too soon. And so it turns around and goes back, right. Back into. Back into death. Right. There's almost something that seems to me to be here about kind of the dangers of. You could call it like, the danger of premature enlightenment or the danger of unearned wisdom. Right. In a way, it's almost related to, like, you know, the parable of the sower goes out to sow the seed, and some of the. Some of the seed falls on rocky ground and it springs up really quick, and then the sun comes out and it withers and dies because it. It had sprung up so fast in the shallow earth that it wasn't able to put any roots down. And so."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":2599.92,"end":2606.93,"speaker":"Jonathan Pageau","text":"Or what about. I'm surprised that you see it that way. Like, I would tend to see it as something like light casts a shadow."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":2606.93,"end":2607.53,"speaker":"Richard Rohlin","text":"Right, right."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":2607.53,"end":2621.45,"speaker":"Jonathan Pageau","text":"And so you have this sense that when. When light arrives, it both reveals the light, but it also reveals the darkness. So that's why Simeon says this is for the rise and fall of many. Right. In. In Israel."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":2621.53,"end":2621.89,"speaker":"Richard Rohlin","text":"Right."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":2621.89,"end":2622.89,"speaker":"Jonathan Pageau","text":"So the badger. The."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":2622.89,"end":2623.21,"speaker":"Richard Rohlin","text":"The."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":2623.37,"end":2651.68,"speaker":"Jonathan Pageau","text":"The badger comes out, and the question is, which way is it going to go? Is it going to go towards the light or is it going to go towards the darkness? So if it sees the darkness, then it goes back into darkness, and if it sees the light, then it comes out into the light. So you could see the moment of revelation as a kind of. It's always like a double revelation, which is why. That's how Christ presents it as, you know, as exactly what Simeon says, as something which reveals both the glory and the scandal."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":2651.84,"end":2652.32,"speaker":"Richard Rohlin","text":"Yeah."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":2652.48,"end":2664.67,"speaker":"Jonathan Pageau","text":"All things will be revealed. And so you actually see the sins of everybody, and you also see the goodness in the world. So that seems to be something like that, which is. That would be the way I would interpret it."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":2664.67,"end":2746.16,"speaker":"Richard Rohlin","text":"No, I think you're right, and I don't see this. Let me try to reframe what I'm Saying a little bit, right? Because. So man is microcosm, right? That's the most important medieval idea, Right. If you want to understand anything about how they thought about the world in the Middle Ages or medieval literature, you got to be able to understand what does it mean for man to be a microcosm of the cosmos. Right. Like a little cosmos. So on a cosmic scale, the ultimate day of revelation is the Last Judgment. Right. When we know the fire of God, the light of God, reveals light and darkness, but then also in some kind of a. In some kind of a way, in like a participatory way, that day is pascha. Right? Right. That's the day when we say, let God arise and let his enemies be scattered. Right. That's the day of his uprising. That's the day when he scatters the enemies of God up and he invites those who are his into the light. Right. And then on a personal level, you could say that that moment, this is what Saint Maximus the Confessor says. He says that the moment of the dismissal of the catechumens in the Divine Liturgy corresponds to. Participates in the moment of the Last Judgment. That's the moment where you sort of cast out. You send out the people who are not ready for the light, and then those that are now, they get to come receive it. How do they receive it? Is in the Eucharist, which is kind of what this. This feast, the mystery of this feast is about."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":2746.8,"end":2771.63,"speaker":"Jonathan Pageau","text":"That's an interesting idea. Like, it's also, it seems related also to the idea of Adam and Eve, because you could also. You could see it that way. Like Adam and Eve, they eat the fruit of the knowledge of good and evil, and then they move, let's say, towards the Tree of Life, and that light exposes their shadow. In their case, like, they see their shadow, they. They're. They're ashamed of that which is reveals. You could say. Yeah, and then they turn back into their hole and try to hide themselves."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":2772.11,"end":2779.75,"speaker":"Richard Rohlin","text":"So, yeah, that's. That's exactly it. Like, that's. That's exactly it. So I. I kind of see those things. Like, I don't think. I don't think these takes are, like, contradictory."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":2779.75,"end":2780.35,"speaker":"Jonathan Pageau","text":"No, they're not."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":2780.35,"end":2790.19,"speaker":"Richard Rohlin","text":"You're right. Yeah. Because you could say it's something like. Something like trying to take communion too soon. Like, if you were a catechumen and you went up and you. You tried to take communion, like, it."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":2790.19,"end":2791.14,"speaker":"Jonathan Pageau","text":"Would be to your judgment."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":2791.29,"end":2792.49,"speaker":"Richard Rohlin","text":"Right? It'd be to your judgment."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":2793.13,"end":2803.85,"speaker":"Jonathan Pageau","text":"I've seen priests say, like, I'm not like, if a non Orthodox person comes up, he says, yeah, I'm not going to give you communion. Not because of me, because of you. I want to protect you from fire, basically."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":2804.09,"end":2857.38,"speaker":"Richard Rohlin","text":"Right? Yeah. So this is also, I think, very closely associated with the idea of Lent. So the way to kind of think about Lent, right, is, you know, because we start Lent literally with the Last Judgment, right? Yeah. You know, that's, you know, meat fair Sunday, right. It's a Sunday of the Last Judgment. So we begin Lent actually with the Last Judgment. So it's exposing, here's who you are and here's who you aren't. Right. And for most of us, that's just not a great experience. Like, most of us, if we're really honest with ourselves and we listen to the Gospel on the Sunday of the Last Judgment, and we start to say, well, I haven't fed Christ, I haven't clothed Him, I haven't visited him in prison, you know, et cetera. Right. So then what do you do? You go back. You kind of go back into death, right. And so your life becomes more austere. The true services become more solemn and even, you know, darker."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":2857.38,"end":2865.58,"speaker":"Jonathan Pageau","text":"Like you see the six weeks of the. Of the. The badger or the. The marmot as Lent, basically, it's six weeks long."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":2865.66,"end":2875.18,"speaker":"Richard Rohlin","text":"Okay, so in Groundhog Day, the film. Right. I've often heard people basically say, the movie is about purgatory. Yeah, right. Which is not wrong."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":2875.18,"end":2877.38,"speaker":"Jonathan Pageau","text":"But, yeah, same and similar."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":2877.94,"end":2910.29,"speaker":"Richard Rohlin","text":"So here's what's interesting. There have been a lot of film theories. You can go out there and find how many days did he do? Like, how many times did you do Groundhog Day? Right. Over and over again. You can find like how many times, you know, and some people say, well, to. To learn all the information that he learned, it had to have been like 10,000 years or something, you know, something insane. Okay. Yeah. Taking that stuff aside, the original script, in the notes, the director had it be like a thousand years. But in the final script, the one that actually got filmed in the director's notes for the film, he has it as a 40 day period."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":2910.69,"end":2911.17,"speaker":"Jonathan Pageau","text":"Nice."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":2911.89,"end":2949.03,"speaker":"Richard Rohlin","text":"So it's 40 days of what? Of basically learning how to repent. That's what Groundhog day is. It's 40 days of learning how to repent. Not repentance as just saying, oh, I'm sorry, my bad. Right. That's not repentance. What is repentance? It's. It's turning around. It's a change of mind, it's a change of heart. And that's basically what Phil, in that movie, who is the groundhog, right? He is the groundhog, right? In fact, at one point, he kidnaps the actual groundhog and, like, they drive off a cliff together. Because he's just, like, wants to end all of this, right? But what is he doing? He's going back down into the earth with the groundhog. Right? And so for."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":2949.11,"end":2964.79,"speaker":"Jonathan Pageau","text":"That's what. That's what happens when he wake up in the morning and the day is repeated. It's that the groundhog hasn't. Hasn't moved on the ground. God's gone back into his cave and stay in that cave until the sun. The sun is really ready. He's ready to see the sun, like you said."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":2964.79,"end":2995.43,"speaker":"Richard Rohlin","text":"Yeah, yeah. And so it's. And so when he's able to actually see the light and not be scared by his own shadow, right? And, you know, you could go a whole direction with just talking about the shadow. Right? But when he's. When he's able to not be terrified by his own shadow, in other words, his sin, right? This. This false personality, it's not really true to himself, you know, it's just like the armor that he's built up against the world around him, that's when he's able to enter into this loving relationship. And that's what. That's Pasca. Right. That's what breaks the spell. That's when he gets out. Right."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":2995.43,"end":2995.91,"speaker":"Jonathan Pageau","text":"Nice."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":2996.31,"end":2998.39,"speaker":"Richard Rohlin","text":"So, anyway, I think that's amazing."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":2999.27,"end":3005.75,"speaker":"Jonathan Pageau","text":"It's so. Once we see it, it's actually so obvious, right? There's a relationship between. Between all these things."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":3006.16,"end":3006.36,"speaker":"Richard Rohlin","text":"Yeah."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":3006.36,"end":3028.56,"speaker":"Jonathan Pageau","text":"But I never have thought about Groundhog Day ever in my life, even though I enjoyed the movie. But I didn't. I watched it so long ago that I wasn't thinking about symbolism at that. At that time. So I didn't think about how it could be related to. To Lent and to Pasca and to the idea of, you know, like, let's say, purging your. Your passions in order to be ready to. To emerge, let's say."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":3028.8,"end":3031.8,"speaker":"Richard Rohlin","text":"That's wonderful. Yeah. So that's. That's all I have."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":3031.8,"end":3032.56,"speaker":"Jonathan Pageau","text":"It's Groundhog Day."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":3032.56,"end":3032.84,"speaker":"Richard Rohlin","text":"Yeah."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":3032.84,"end":3034.73,"speaker":"Jonathan Pageau","text":"So Groundhog Day. Great stuff."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":3034.89,"end":3137.99,"speaker":"Richard Rohlin","text":"So this is a. Like I said, I hope that people understand. Maybe it's just as the last thing. I hope people sort of can start to see the connection between this and the broader idea of universal history. Right. Is that you have to think of history as being in. You could think of it as like a series of fractals or wheels within wheels. Or however you want to talk about it, right? Of you've got. Here's the story of history, right? This is. This is what Vladaloskin in, like, Laris gets this so beautifully, right? He understands this so well. Is history is not a. It's not just a line, right? It's not a complete circle. It's more like a spiral, right? But the way that you live that spiral out is in the cycle of the Christian year, right? As you're moving towards the end of history. And people get hung up about, okay, well, when is that? When is the end of history? Well, the short answer, this is also in Loris, okay? The short answer is the end of history is when you die, right? Like, don't worry about, like, when is, you know, the. The Last judgment or the Rapture. Like, don't worry about whenever that is supposed to happen. The thing that you know is going to happen is that you're going to die, right? And for you, that is. That is the last judgment, right? And so, yeah, so to understand the way that you actually participate in that cycle, in that spiral, you could say is by attaching yourself to the Christian year, which has left many little remnants, like little ruins in the world around us today. Things like Groundhog Day, right? When Groundhog Day comes around this year, instead of saying, oh, what a stupid thing, I guess. I guess we have six more weeks of winter because a rodent in the ground in Pennsylvania says we do, you know, go to church, get a holy candle, light it, keep out the darkness, right? And wait for the light of Pascha."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":3137.99,"end":3160.32,"speaker":"Jonathan Pageau","text":"Well, thanks for that. You know, this is great. And so don't worry, everybody, we will. We will back with more universal history. We're going to go back into some Arthur and move on to the millions of things we could talk about in terms of universe history. So, Richard, thanks again. This was a nice surprise for me. And thanks everybody for paying attention and we'll talk to you very soon."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":3160.32,"end":3176.54,"speaker":"Richard Rohlin","text":"Hey, Symbolic world, gang. I just wanted to take a quick moment to tack on to this video about universal history and the symbolism of Groundhog Day to actually mention to you something that's going to be happening in the North Texas area."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":3177.18,"end":3179.26,"speaker":"Richard Rohlin","text":"So if you are able to get."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":3179.26,"end":3257.6,"speaker":"Richard Rohlin","text":"Yourself down there, towards the end of the month of February 2022, we are hosting an Orthodox arts festival. So this is the festival, Orthodox Christian Art. It's being hosted by St. Constantine and how Antiochian Orthodox Church in Carrollton, Texas. So it's the north part of Dallas. It's February 18th through the 20th check out Orthodox Arts Festival DFW.com we'll put a link in the description of this YouTube video. Again, that's Orthodox Arts Festival DFW.com and you can get all the information that you need to have about how to get tickets and what the schedule is going to be. We've got a ton of great speakers. We've got a keynote address on the role of the arts in Orthodox theology by Peter Butanov. Currently he teaches theology, spirituality and the Arts at St. Vladimir's Orthodox Seminary. He just actually finished co editing an amazing book on Arvo Part and he also has a podcast called Luminous Conversations on Sacred Arts which has all kinds of stuff, all kinds of really, really interesting stuff you guys would enjoy there. Also on Saturday there's going to be presentations, workshops and demonstrations by local Orthodox artists and also people who like to."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":3257.6,"end":3258.96,"speaker":"Richard Rohlin","text":"Talk about these things. Like me."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":3259.04,"end":3262,"speaker":"Richard Rohlin","text":"I'm going to be giving a talk on literature and the sacramental imagination."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":3262.48,"end":3263.76,"speaker":"Richard Rohlin","text":"There's going to be a bunch of."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":3263.76,"end":3289.13,"speaker":"Richard Rohlin","text":"Other really great people there, including some symbolic world folks, Josh Sturgill from the Eight Day Institute, he'll be there. He'll be talking Deacon and Anthony Stokes going to be talking about beauty and the liturgy, the role of quality music in our worship and some other great talks on writing on architecture in the Orthodox tradition, on reading on how to actually like look at and study icons. It's going to be a lot of great stuff. There's going to be, there are going."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":3289.13,"end":3290.29,"speaker":"Richard Rohlin","text":"To be some films that will be."}
{"episode_id":"SW - #217 - 2022-02-04 - Richard Rohlin - Universal History - The Deep Symbolism of Groundhog Day","start":3290.29,"end":3310.38,"speaker":"Richard Rohlin","text":"Shown there as well and some workshops, some hands on stuff and demonstrations and that will all end with Pan Orthodox Vespers at 5pm on Saturday. So anyway, it's going to be a great event and I look forward to seeing you there. If you're looking for me, I'm the tall Orthodox guy with a beard."}
