{"episode_id":"SW - #093 - 2020-03-07 - The Entire Cosmos in the Parable of the Sower","start":0.4,"end":1935.48,"speaker":"Jonathan Pageau","text":"The parable of the Sower is probably one of Christ's most known parables. Everybody has heard that story. But there's something very interesting about this parable because it is, in a way, a meta parable. It is not only a parable that talks about a specific example of life, but it is a parable which can help you understand parables themselves and can help you understand meaning making in general. Basically, the parable of the Sower is just like so many other things that Christ says is hiding within it the very pattern of how reality unfolds. So we're going to look at the parable of the Sower and see if we can try to bring out some of these aspects which connect to the types of things that I'm talking about in terms of symbolism and how we encounter the world. This is Jonathan. Jonathan Peugeot. Welcome to the symbolic world. Now, the parable of the Sower is in all three of the Synoptic gospels. And so I've chosen to use the version in the Gospel of St. Mark, St. Mark, chapter 4:1 25, because there's a little detail in that version that I want to emphasize specifically. So I'm going to read the text to you, and then we're going to go over some of the elements that Christ talks about. And I'm going to try to show you, you know, how the parable that Christ is giving can be applied to our very perception of reality and how it is, in a way, very much a meta parable. And so, and he began to teach by the sea. And a great multitude was gathered to him, so that he got into the boat and sat in it on the sea, and and the whole multitude was on the land facing the sea. Then he taught them many things by parables and said to them in his teaching, listen, Behold, a sower went out to sow. And it happened as he sowed, that some seed fell by the wayside, and the birds of the air came and devoured it. Some fell on the stony ground where it did not have much earth, and immediately it sprang up because it had no depth of earth. When the sun was up, it was scorched, and because it had no root, it withered away. And some seed fell among thorns, and the thorns grew up and choked it, and it yielded no crop. But other seed fell on ground, on good ground, and yielded a crop that sprang up, increased, and produced some 30 fold, some 60, and some 100. And he said to them, he who has ears to hear, let him hear. But when he was alone, those around him with the 12 asked him about the parable. And he said to them, to you it has been given to know the mystery of the kingdom of God. But to those who are outside, all things come in parables, so that seeing they may see and not perceive, and hearing they may hear and not understand, lest they should turn and their sins be forgiven them. And he said to them, do you not understand this parable? How then will you understand all the parables? The sower sows the Word. And these are the ones by the wayside where the Word is sown. When they hear, Satan comes immediately and takes away the Word that was sown in their hearts. These likewise are the ones sown on stony ground who, when they hear the Word immediately receive it with gladness. And they have no root in themselves, and so endure only for a time afterward. When tribulation or persecution arises for the Word's sake, immediately they stumble. Now these are the ones sown among the thorns. They are the ones who hear the Word and. And the cares of this world, the deceitfulness of riches and desires for other things entering in. Choke the Word and it becomes unfruitful. But these are the ones sown on good ground. Those who hear the Word accept it and bear fruit some 30 fold, some 60, and some a hundred. Now, there is a lot to unpack. In this parable. Christ is basically painting a cosmic image of how the world works. But the first thing we need to pay attention to is a little detail, which is actually only in this version of the parable. And it is how Christ tells his disciples, do you not understand this parable? How then will you understand all the parables? And this is the little key that I wanted to point you to. Christ is saying that this parable is, in a way, a meta parable. It is a parable about parables. It's a parable. It's not just about parables, but it's a parable about meaning making itself or meaning making, not in an abstract way, not just in a kind of abstract understanding, but meaning in the sense of. It's a parable of how meaning, how abstract things, how ideas, how concepts, essences. You know, I'm using different words because it, you know, all of the invisible things connect with the visible world and how there's this incarnational principle and how it lays itself out in the world. That is what Christ is talking about. And he's using human person as the anchor for his example. And it's, of course, the best way to talk about it. He's Talking at the level of the human person hearing something, and then his heart acting as the place where this meeting of meaning and possibility meets. You know, how heaven and earth meet in the person's heart. And as that happens, then we see whether or not this seed which falls into the ground will give fruit. Now, when you hear about seed, it's very important to understand that the relationship between seed and heaven. First of all, seeds, you know, they come, they fall from above, and they fall onto the ground. Not only that, but seeds are also this. They're the pattern of a tree. You know, if you look at a seed, you just have this little dot, but in the little dot is contained the pattern of the tree. The tree. It's an image of a bodiless principle. Of course, a seed has physical body, but it has so little body that it becomes an image of this part point, this center, you know, the. The essence of something. So every time you read in the scripture, especially in Christ's explanations, when he talks about a seed, that's what he's talking about. Something which is not. Not hasn't yet borne fruit, which is contained, which is just the idea or just the concept or, or, you know, or just the center without the margin, without the laying out of everything else. Okay? That's when. And so the heart itself is the point of place. You could say the heart itself can be the seed, but the heart is usually mostly the throne or the place where the seed will hit, you know, so the heart becomes like the ark of the covenant, with the glory of God coming down and landing on the ark, and then the glory of God shining out into the world. It's important to understand that. That this is this relationship. Because if you look at right after the par, this parable, Christ uses the image of the light, which should not be hidden under a bushel, which should not be hidden under a bucket, which would shine forth into the world. And so that he. He is relating by adding that parable, this image after the parable of the seed which is in the ground, he's connecting those two together. And it's helping us to understand that the. The. The light which shines out, or the. This idea of the glory which comes down on the ark and then shines out on the world, the seed which falls in the ground and then produces fruit, all of these are images of the same thing. So we have to look at what are the different examples that Christ gives in order to help you see what are the possibilities of this relationship. That is, when there is something abstract and There is a, a body or there's something underneath which is going to be the potential out of which this abstract thing is taking its, its. Its capacity to exist in the world. What are the possibilities of these connecting? So he talks first of all about this idea that the Sower went out to sow. And so you can understand that at different levels of reality, you can understand it as of course, ultimately as God, you know, spreading out the essences of things that the, the, the, you know, that God speaking the world into existence, he's spreading out these seeds out into, over the ground. And so imagine now go back into Genesis. Think of God speaking the world into existence. These words that come out of God's mouth are these essences are the, the names of things, okay? And so a seed is, can be related to the idea of a name. That is, it contains within itself the pointing to something, you know, that which gathers all these potentiality into one thing. If I point to a chair and I'm like, chair, all the that is is manifesting the unity of the thing I'm pointing to, okay? So the essences that are, that are coming down, you see that like I said in Genesis, when God creates the world, that is what is related to this se that is spreading out the seeds, spreading out the logi, spreading out the, the essences. And so some of the seeds fall on the wayside. You have to understand that they fall on the side of a path and the birds of the air come and devour it. Now Christ in his example, he says that that is the someone who, you know, the word comes to him. And when they hear it, Satan immediately comes and takes the word away, the word that's sown in their hearts. And so he, the word comes, but right away Satan takes it away. There's no room for it. There's no place for it. And so the idea that it falls next to the wayside, of course, in practice it makes sense that, yeah, if you sow, if you put seeds on the wayside, because the earth is already completely, you know, tapped down, and because it's being used as a path, then there's no place for the, for the roots to take shape. But that is also part of its meaning, which is that we. When something, when there's already a path, when there's already a meaning, it is extremely difficult to sow a seed into something which already has a meaning. Now, of course, everything that I'm saying doesn't take away from the personal aspect of this parable. And I think it's Very important to insist on that, that you know. Of course this does refer to hearing the good word of God about your life and, and you know, and acting on it. Of course it refers to that, but it can also refer to anything which is you. If you're, you know, I don't know, if you're walking and you're going to the store to get some milk, and that's your purpose, and you have this purpose that you're doing. And then as you're going there, someone will call you on your phone and say, you know, would you come over and do this? And you already have this path that you're on. You already have something that you're doing. I'm using that example. But it could be anything. It could be that you're working and you're working on your computer and your child comes to you and your child says, dad, can you come and do this for me? And you're on a path, and so you already have a logos, you already have a meaning, you haven't already have a direction. And so there's no room for that idea to come and take root because you already, you're already doing something. In order, in order for you to be able to attend to this new seed which is coming down upon you, you have to plow your earth. You would have to deconstruct, break down what you're doing in order to be able to reorient your attention towards what is coming. This new seed, this new idea is, you know, and so you can see that in all kinds of manner that a. There are some ideas that just cannot take root in certain societies, for example, because they, because they already have a way of doing things and a way of being that there just isn't any room for these new ideas to take shape because they're just not, they don't fit into the past. And so it's neither good nor bad. You know, sometimes it can be good, sometimes it can be bad. But it's mostly the idea that, as if there's already a path, there's no room for new ideas on that path. The bird comes down and this bird in this case is Satan. And Satan picks up the seed and carries it up. So what is that, what is that referring to? I mean, obviously we can understand it in our personal lives, but you know, how can we understand it in terms of a pattern that can be applied to many other things is here. You have to understand Satan as a kind of dark principality, understand it as a principality which is above you. But in this case is negative and is preventing the seed from landing in. In the ground. But it doesn't necessarily have to be dark. When you see the idea of birds in the. In the Old Testament or in the Bible, in a lot of stories, usually the birds are these principalities that come down. Sometimes the birds are the principalities that sing in the trees. You know, you understand it as the pattern, you know, the music of the spheres, for example. And so you have this image of the birds up in the trees that are singing and are manifesting the patterns to us. But you can also have the idea of the bird that comes down as a raptor and comes and picks things up, right, and comes and picks things up. And then the principalities appear more negatively and as something which will separate heaven and earth. And here in this case is, is. Is an example where the principality will come and pick the. The idea and prevent it from from manifesting itself in the world. Now there are some examples. I can give you an example, a really stupid example of this happening. One example is flying cars, right? Flying cars. Flying cars have been. The idea of flying cars have been around for 100 years. And the idea is there, it's always there. But because of the way the world is set up, that principality is not landing, it's constantly being picked up and held up in the invisible sphere. And though it's still. It exists as this imaginary idea, it exists as this imaginary thing, but it's never landing in the world and finding body. And so this is. There are plenty of ideas like that that actually can't. That can't land. And some of them shouldn't land. You know, for example, the whole problem of utopia is a problem, is a problem of ideal that are so high that in a way they shouldn't actually land in the ground because they would create monsters. So some of it's. Like I said, these ideas are neither negative nor positive, but. But there are some principles that get carried up or held up high. And so, and so they don't land and they're held up by the fact that they. They're more on the side of the principality and they don't actually. They don't actually have room to have body. But that can also be negative. It can also be that if a dark principality is holding on to something, if there's a very. If there's a dark purpose for our society, if we're held by our. The demons, for example, if you're held by the passion of. Of hunger, then a good idea, a good discipline, something that could Help you. That could help you get out of this principality is going to struggle to land in your world. And the. And Satan, the. Of the opposer, the divider, is going to pick that up and try to keep it up in the fantasy world, keep it up into the idea. So you can keep dreaming about the day that you're going to diet or the day that you're going to develop this discipline, but it's never. Satan is constantly picking it up and not letting it land into the. Your actual body. The second example that Christ gives is the seed which falls on stony ground and doesn't have much earth. And this seed will grow up really quickly, but then as soon as the sun rises, the sun will scorch the plants and then they will wither immediately. Now, of course, everybody can imagine this, this type of experience. We've all had this experience where, you know, you, you make a New Year's resolution and you're like, yeah, I'm gonna do this. And within a few weeks, it's gone. Because it doesn't. It didn't have. You already have so many things to do. You already have all these other. You're. It's related to the idea of being on the path. It's a little bit off the path, you could say, but you already have all these meanings in your life. All these things that are good or bad, just all these purposes that you have that trying to change them or add something might flower up really quickly and then go away. This particular example is extremely. A good example that we see all the time now. Our whole world seems to be made out of this stony ground with shallow earth. Is, of course, fashion. Fashion is exactly this. And so an idea drops in and you know, for. For a year, everybody is wearing whatever everybody's wearing, you know, you know, those super tight pants that everybody was wearing, like baggy, baggy bottoms. It's like, okay, that's gonna, you know, when you see it, that this idea is this extreme idea that is very shallow, that doesn't. That isn't anchored profoundly into even our fashion, our long fashion tradition in the West. And so it lands. And then you know that it's going to last for a season and it's going to be gone because it is very shallow in its kind of extreme growing up. It's very shallow. Fashion is probably really the best way to understand that. The same thing happens with, you know, extreme musical fashions. All of these things that come and they're gone, flash in the pan, they disappear because they, they are not anchored profoundly in our culture, you can see this, for example, a very strong version of this was in all the fad diets that came, extreme fad diets that came around and are still kind of coming around. They just. They just. They just come and go. They appear and they disappear because they are too different from the usual purpose. And so the idea of the sun coming up and shining down on the plants and scorching them, that. That is the deeper pattern. That is, whatever deeper pattern is there. As soon as that deeper pattern appears, then it's going to wither up, this superficial pattern that's appearing just on the surface. And so, for example, I was talking about fashion. There are some deeper patterns which seem to have set themselves up in our society. That the idea of wearing a suit and a tie, let's say, and then all of a sudden there'll be some extreme thing that's going to appear wearing really, really, really gaudy ties or wearing really, really thin ties maybe, or really, really thick ties. And so when you see those appear, you know that when the deeper pattern starts to shine again, that extreme version of it, that. That kind of peripheral, superficial excess of it is just going to vanish. And the pattern is going to end up being. Being more regular. And so the, The. The suit and the tie is gonna continue, but the. These kind of extreme versions, which appear on a very shallow level, are going to vanish under the weight of the basic pattern. Okay, so that is just an example to understand it. But like I said, there are plenty of examples in all areas of your life where this thing, this type of behavior will. Will appear, and you need to be attentive to it. Now, the third example is the. The story of the thorns. And so the idea that the seed is planted, but that these thorny bushes come out and choke out the plant that's growing. And Christ talks about how it's the distractions of the world. It's our passions, it's, you know, it's. It's the. The desire for riches. And so here, instead of having this idea of a dark principality, let's say that will. That will pull up and prevent it from incarnating. It's mostly now from the outside, you have this encroachment of things from the outside that are devouring and preventing the body, you know, taking up so much room that they're preventing the. The body from actually taking shape. And so everybody has had. Everybody's had that example being distracted by all kinds of things, whether it's, you know, you have a discipline, there's something that you want to bring down into your life, but you end up just playing video games or watching movies or whatever it is. There's these distractions from the outside that kind of suck up your strength, suck up the potential, and prevent the seed from growing. And, of course, the thorns are the perfect example. Now, if you look at the whole thing, if you look at this whole image, it's very fascinating because it actually has a powerful hierarchy in the way that Christ describes all these different examples. And so I always tell you about how the hierarchy, the basic hierarchy of the Garden of Eden is not necessarily positive or negative. It's just the structure of reality. And so here Christ describes this reality. He starts by describing this idea of a path which could be understood as also a mountain, like a purpose or a reason. So he has this. This idea of a path and a purpose, you know, a road. Then he also talks about stony ground or a stone which is above the ground. So it's. You also have this idea of the mountain as a path or as a purpose. And then also the problem, the idea of something which is a little higher up, like a. Like a stony ground that's not completely down. And then he goes to the thorns which are in the story of the Garden of Eden on the outside and are, you know, the. The same thing in the story of the Garden of Eden. They're just the. The passions and the distractions and the opposition of the outside. And so he's actually tracing the same image as you find in the garden. And it's. It's funny, it's interesting, because in this version, it's. It's. Some of. It's neither good nor bad. That is, if your path. If your mountain is a bad mountain, then. Then you won't be able to have this renewal of having a new plant in new plowed ground. And then he talks about the negative aspect of the path, the negative aspect of the idea of being a little higher up on the stones, and then the negative aspect of the thorns themselves on the outside. So he talks about all the negative aspects of all these things. And then he finally talks about the good earth. And the good earth is the one in which all the negative principalities, all the negative things have been plowed, have been broken down. And so you are in a kind of virginal state where you're ready to receive this new seed and to be able to have new fruit. You know, baptism is an example of the. This process of. Of breaking down all the negative principalities, all the negative patterns in your life in order to be ready to now start again and have a new pattern, let's say. And so there's also a really fascinating aspect to this parable, which is that Christ talks about how this is really the parable of parables, and he links it to his disciples themselves. And so what he's suggesting is that his disciples are the ones who have been plowed already, they have been baptized, they have been following Christ. And so they are the ones who are this good earth. And that's why Christ talks about, you know, if you have the ears to hear, if you have the eyes to see, that is, if you are capable, if you are prepared to see these patterns, then you will be able to see them. But if you're not, then you will be closed off. You will be kept on the outside. And so he's applying the. The parable to his disciples. The, the fact that Christ then secretly tells them the meaning of the parable is the parable itself. These are interrelated. He's trying to explain how the work of preparing the soil is something that the disciples have encountered. And so now they are capable of hearing the true meaning of the parable. And so the fact that Christ explains the parable just to his disciples is actually part of the parable. And so he's saying, you who have been prepared, you, my disciples, you who have now entered into the heart, have entered into the mystery, are now capable of perceiving the meaning of the parable, are able to perceive the patterns in something which to people on the outside just appears like just a story that doesn't have any profound meaning. And so it's really something that some of you that have been following my videos for a long time, I know that you've experienced that as well, and I know that I've experienced the same thing, which is that before we develop, you know, a capacity to perceive the patterns, certain stories just go right over our heads. We watch a movie, we read a story, we look at, we read the gospel story and we just see what's on the surface. And once we start to now engage with the world and prepare our hearts and try to break down the propaganda patterns that sadly, we've received as children, or the very superficial, materialist, atheistic patterns that we've received as children, then all of a sudden we can see the light shine through the stories. We can see the light shine through the parable, through the parables of all of reality. And ultimately, it's fascinating because Christ, after the parable of the sower, Christ talks about how you know, you are the light of the world and you have to shine in the darkness. And you would think that, you know, it's fascinating because right before he talks about how those on the outside will not understand, it's only those on the inside that will understand, only those that have been prepared, only those that have been. So it actually looks like a contradiction on the right. Right after he says, those that are outside will be cut off, you know, to those who have. That's where Christ says, to those who have more, more will be given. To those who have little, it'll be taken away from them. You know, this idea that the outside is cut off, that the outside, because it's not prepared, because it's not in the heart, in the mystery, it can't receive the patterns. But then he says, you have to shine out in the darkness, but you really have to put those two realities together in order to understand Christ's full message. It's often the, that if you just take one aspect of what Christ is saying, you're usually missing out on the bigger patterns. He tends to talk in aporia. He tends to say something and then say almost the exact opposite just a few verses later. The greatest classical example is when he tells St. Peter that, you know, you are Peter and on this stone I'm going to build my church. And like one verse or two verses later, he says to St. Peter and get behind me, Satan. And so you, you really have to be able to get to, to see Christ's message in its, its ensemble or else you're going to miss out. And so he has, you know, when I talk about the, the, the left hand and the right hand, this kind of, this kind of pattern of bringing into the center and then the pattern of moving out towards the periphery. This is what Christ is doing here. He is gathering his disciples into the heart. He's gathering his disciples into the mystery. And he is revealing to them. He's prepared them. He's. They've gone through baptism. They've been, they've been there. The dark principalities that were holding them are being broken down and so they can receive the glory of God, you know, down on their, in their hearts. Imagine the glory of God coming down on the, on the Ark of the Covenant. But once that's happened, then we have the radiation out towards the outside. And so he's like, he's saying, I am gathering you into this mystery. I'm going to give you the pattern, the secret, the pattern of reality. But then once that's happened, then you will radiate out to the outside. And so he is tracing once again the very pattern of reality, of the glory coming down on the temple. And, and then the temple acting as a, let's say, a beacon for the world of the presence of God coming down into the altar of the church, into the chalice of communion, and then the communicants taking this mystery, the highest mystery, and then going out into the world and remembering God and being lights in the world outside. So Christ is tracing, always, always tracing the pattern of reality. And it's really important to, when you're reading scripture, always remember that we've been so ruined, our perception of Scripture has been so ruined that we always need to remind ourselves that every time Christ says something, he is, he is speaking at the level of the one who created the world. And you, you, if you expect anything less of Christ, you're going to miss out on the things that he's saying. And even, you know, I'm trying to understand this and explain this, but I know that I'm missing out on a huge, a huge aspect of what the Scripture contains because, you know, in two months I'm going to read this passage again and it's. And then some lights are going to go on and I'm going to realize just how much I missed in all these condensed phrases that Christ uses. So I hope this has been useful to help you understand a little aspect of the power that is contained in everything that Christ says. And hopefully it'll give you some food for thought. And I will get back to you very soon with a new video."}
{"episode_id":"SW - #093 - 2020-03-07 - The Entire Cosmos in the Parable of the Sower","start":1937,"end":2001.94,"speaker":"Jonathan Pageau","text":"I hope you enjoyed this episode of the Symbolic World. The Symbolic World is edited by Justin Ward and it is based on a series of videos that you can find on my YouTube channel, Jonathan Pageau's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course, leaving a review on itunes. Everybody knows that's the best way to, to get the podcast out there, to get it heard. And if you want to get involved, you can also support the podcast financially. Going to www.thesymbolicworld.com support or else on Patreon Pageau videos as well and on SubscribeStar, all those links you can find on my website or in the show description. So thank you and I will see you soon."}
