{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":0.56,"end":41.21,"speaker":"Richard Rohlin","text":"So the big idea that I wanted to sort of pitch is that there's only one Pentecost, and that this Pentecost happens at one point in, like an eternal moment. And Noah and Abraham and Moses and the apostles all participate in that day of Pentecost. But so did the people at the Tower of Babel. Yeah, so do the people of the Tower of Babel, and that if you participate in it correctly, then it will unify and also multiply. And if you don't give it your focus, if you don't give it your attention correctly, then you're going to be divided and you're going to be scattered."}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":52.82,"end":76.5,"speaker":"Jonathan Pageau","text":"This is Jonathan Pedro. Welcome to the Symbolic world. So, hello, everyone. I am back with Richard Rowland for Universal History. This is the first episode we're recording after the Symbolic World Summit, if I remember."}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":76.5,"end":78.55,"speaker":"Richard Rohlin","text":"That's right, that's right, yeah."}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":78.55,"end":99.83,"speaker":"Jonathan Pageau","text":"And so what we want to do is go back into the Tower of Babel story because Richard has some amazing reveals about that story and how it connects, you know, to the. To the Old Testament. I mean, how it connects to Pentecost in crazy ways that, that, yeah, it just blew me away when I found them out. So I. So I think that we definitely need to go back into that. So, Richard, take us, Take us away."}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":100.15,"end":232.74,"speaker":"Richard Rohlin","text":"Yeah, so I'm going to kind of give away the farm now. There were some things that I was teasing a little bit in the last hour of Babel video that we did, and I said, you've got to come to the summit to get the rest of it. And of course, lots of people couldn't come to the summit. So the good news is I'm going to. I'm going to basically kind of give you guys what, you know, what was missing. Because actually at the summit, I still couldn't say everything that I wanted to say because. Because just wasn't time. And I was trying to be respectful of the other speakers and not take their time because that's like the unforgivable sin as a presenter is, is going over your time. So going to talk a little bit. There will be like a little bit of repeat, because what I want to do is to just. Just frame things up a little bit. So there'll be a little bit of a repeat here, but we can, we can go. But that'll. That'll be all right. So we talked last time about the Book of Jubilees, and the Book of Jubilees is really important to the Christian tradition. Actually, it doesn't matter if the Book of Jubilees is not in your Bible. It doesn't even matter if at some point the reading of the book of Jubilees was maybe banned in your church sometime a long time ago. There are a lot of things. Well, that did. I don't think that happened with Jubilees. I know it happened with Enoch in the. In the west, but. But the book of Jubilees just has a lot of information that you probably take for granted as a Christian that's. But it's actually stuff that's not explicitly in the Scriptures. If you've ever had the idea that the devil and other demonic spirits are fallen angels, the idea that the sons of God mentioned in Genesis are fallen angels, or the idea that the sons of God mentioned in Genesis are descendants of Seth, Actually, both of those ideas come from this whole body of literature that includes Jubilees. Even the idea that righteous people go to a place called heaven or paradise, and wicked people go to a place called hell, and that there are rewards and punishments that are proportional to your righteousness or your wickedness. These are things that are not explicitly in the Old Testament, spelled out in the Old Testament. Unless you have third ESDRAs in your Old Testament, which some of us do. In which case, then you're gold. But anyway. Yeah, so some of us."}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":232.74,"end":235.66,"speaker":"Jonathan Pageau","text":"I love when you say some of us. Like, who is the US that has third?"}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":235.9,"end":237.82,"speaker":"Richard Rohlin","text":"Just the Russian Orthodox Church."}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":238.06,"end":239.82,"speaker":"Jonathan Pageau","text":"Really? I didn't even know that."}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":241.1,"end":247.7,"speaker":"Richard Rohlin","text":"If you're in that sort of, like, Slavic Russian Orthodox tradition, then you can make the case that third ESDRAs is actually in your Old Testament."}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":247.7,"end":248.54,"speaker":"Jonathan Pageau","text":"Well, luckily we are."}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":248.54,"end":252.46,"speaker":"Richard Rohlin","text":"So we are. That's right. Third Esdras, by the way, getting us."}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":252.46,"end":254.62,"speaker":"Jonathan Pageau","text":"Ready for Dante, by the way, that is."}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":254.62,"end":439.49,"speaker":"Richard Rohlin","text":"Yeah. Third Esdras. As I mentioned in yesterday in the retrospective that we did for the summit, somebody asked a really fun question about Apocrypha in the retrospective, and I said, you know, my favorite apocryphal book, although actually it's in my Old Testament, is third Esdras. And it's. It's actually one of the important foundational texts for understanding the Divine Comedy, which I think is something most people don't know. So if you like this sort of thing we'll be doing, we'll be starting our first class on the Divine Comedy. It'll be five weeks. It'll be just on the Inferno, and then we'll come back in a few months and do Purgatorio and then Paradisio, and it's starting Orthodox bright week. So that's the week of I'm just going to go ahead and tell people because I think you'll be able to order the class soon. It's going to be the week of the 5th. So that'll be Thursday the 9th, May 9th. Thursday, May 9th is when our first class will be. So, anyway, okay, so all of these things that people assume to be true about the Scriptures and how we read the Scriptures come from Jubilees and from these other works, generally referred to as the Apocrypha. And so with that, with that kind of being said, I want to look at specifically the idea of feasting and sacrifice in the Book of Jubilees real quick. So one of the main themes of the Book of Jubilees is the idea that the Old Testament liturgical calendar, I.e. the Feasts of the law, are ontological realities. The way the Book of Jubilees puts it, is that these feasts have been celebrated in heaven since the creation of the world. And this includes things like the observance of the Sabbath and then also the great feast of the Mosaic covenant. Now, obviously, you can see the establishment of the Sabbath in the Genesis story, right? But Jubilees sort of takes this idea farther. So Jubilees is kind of what you could call like a midrash or like a commentary, really, like an expansion of Genesis. Sometimes that's called, like, lesser Genesis for that reason. And so it takes this idea a little bit further, and it says that along with the observance of the Sabbath, that the great feast of the Mosaic covenant, which, importantly, Genesis predates the giving of the Mosaic covenant. Right. So the great feast of the Mosaic covenant actually predate the covenant. Now, what's the implication of that, by the way, for Christians? Well, is that you keep celebrating these feasts, like, even if you're not part of the Mosaic covenant, you would keep celebrating these feasts. More on that in a minute. And the reason that they're ontological realities is because they basically, like, reflect. How do I say this? You could say that these feasts reflect certain heaven, real heavenly realities that are kind of baked into the world at its creation. So participating in these days of rest and feasting, like the Sabbath, the day of atonement, first fruits, tabernacles, the hidden significance of the eighth day, and of course, Pascha or Passover, which is the last. Those are the feasts that are introduced in Jubilees."}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":440.45,"end":457,"speaker":"Jonathan Pageau","text":"Wait, so in Jubilees, there's already an introduction of the eighth day idea? Because I know it's in rabbinical texts. People have told me that that in rabbinical commentary, there are places where it says when the Messiah comes, we will no longer celebrate on the sixth day, but on the seventh day. And I was like, what? That's wild."}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":457.32,"end":495.33,"speaker":"Richard Rohlin","text":"This is in this. This happens in Jacob's visions that he has around the birth of Benjamin and the death of Rachel in Jubilees. Yeah, yeah. So this is. That's. That. That. That is in there. Wow. That. Yeah. So all of this stuff is kind of there in Jubilees. And as we're going to talk about in a minute, this becomes very important for the formation of the Christian liturgical year. So the idea is that by participating in these things, it's a way to join human life and activity that is bounded by time to eternal realities. Right. So that, you know, you could say, somebody might say, so that God's will is done on earth as it is in heaven. Right. Someone might say."}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":495.57,"end":496.85,"speaker":"Jonathan Pageau","text":"Someone might say that."}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":497.33,"end":731.12,"speaker":"Richard Rohlin","text":"So much. Much of this reflects. And the community. Community that wrote the book of Jubilees, or that at least copied and preserved it, was a community that's very concerned with calendars, the festal cycle, all these different kinds of things. Father Stephen DeYoung has a great book on the Apocrypha. It's just called Apocrypha. And he's got, you know, if you want to get the historical background, who wrote these things and who preserved them. By the way, almost all these texts were preserved almost exclusively in Christian monasteries. So that's how we still have them. So other than the Sabbath, the first fruit, the first feast to be instituted in Jubilees is the Feast of the First Fruits. And this is known variously in the Old Testament in the Jewish tradition of Shavuot, which is the Feast of Weeks. It's also called the Festival of Reaping and also simply called Pentecost, although it's not usually called Pentecost in Jubilees, because Pentecost refers to the fact that it's the 50th day after Pascha or Paso, which hasn't actually been instituted yet. Like, humanity is given Pentecost before they're given Passover in the. In the narrative in Jubilees. So. But. Yeah, but. But I'll probably call it Pentecost most mostly. Or the Feast of the First Fruits. Yeah. So we shouldn't be surprised to find that this feast has a certain primacy of place in Jubilees. And this is because the law is given to Moses on the Feast of the First Fruits. So when Moses goes up the mountain and he receives the law from God, that is happening on Pentecost. And so the thing that Pentecost is you could say is primarily a. It is a celebration of the giving of the law of God, which is actually a revelation of who God is, and then the making of a covenant between God and man, or the making or the renewal of a covenant between God and man. So that's what Pentecost is. That's the. We'll talk about maybe the shape of more of the shape of the feast in a minute, but that's the event. So Jubilees has a frame narrative. And the frame narrative is that the angel of the Presence, who is Jesus, by the way, we know this because Jesus quotes himself in Jubilees in the. In the gospel according to St. Matthew. And by the way, Jesus and various apostles quote and reference even St. Stephen in his. In his sermon before they stoned him to death. Right. St Stephen, the proto martyr, he. He makes several references to things in Genesis that aren't in Genesis, but they're in Jubilees. Wow. So he's either quoting from Jubilees or he's quoting from some similar. A related tradition. Right. So the frame narrative is that the angel of the presence is giving the law to Moses, which is an event that happens on Pentecost. And so therefore, Pentecost is the most important feast throughout the book of Genesis. Jubilees. It's even more important than Pascha, which isn't actually introduced until the very end. So what we're told is that the very first Pentecost, the very first feast of first fruits, happens in the aftermath of the great flood, when Noah offers up his offering to the Lord. Now, as you would expect if you know the story in Genesis, Noah's offering pleases the Lord, and God makes a covenant with Noah. And the covenant is not to destroy the earth again, but one of the things that people forget, or not with a flood, anyway. One of the things that people forget, though, is that God also, when he made the covenant, he also gave certain laws. Yeah, that's true. Usually called, like the Noah kite laws. Yeah. Don't eat the meat with blood. Yes. And actually certain laws that don't affect. Certain laws that affect animals. By the way, one of the things that happens is God puts the fear of mankind into animals. That's why animals run away from you usually when you're in the forest. Right. And things like that. Like, so. So. So there's a. There's a change in the state of what creation is. Right. That happens at the giving of this law and of this covenant. Yeah."}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":731.12,"end":748.08,"speaker":"Jonathan Pageau","text":"And many people, like, by the way, even today Jews, understand that that law, in some ways precedes the law of Moses because it is the standard by which all of humans are judged. And so all the non Jews are not judged by Moses law, but are judged by Noah's law."}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":748.34,"end":768.98,"speaker":"Richard Rohlin","text":"That's right. And you still have this understanding in for instance, the very first church council, the first council of Jerusalem in the Book of Acts. That's what they said. Basically they take the Noahide laws and they apply those to Gentile converts to say for gentiles coming into the church, you have to live by these laws, but you don't have to keep the Torah."}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":770.26,"end":774.58,"speaker":"Jonathan Pageau","text":"I forget they explicitly say which laws those are. And they're exactly the laws that."}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":775,"end":1063.51,"speaker":"Richard Rohlin","text":"Yes, yes, yeah, it's don't eat things, strangled, abstain from fornication, all that stuff. Because basically all of that stuff goes along with idolatry. That's kind of the subtext there is that. Is that even fornication in the ancient world. Like there were just random prostitutes in towns in the ancient world. Of course. But most prostitution in the ancient world is, is connected to the cults of certain deities. Right. So even, even fornication and things like this, I mean, even if you're like committing adultery or something, you would still say that there's like a God involved and that it's like Eros or something. So, so the, the things that we're specifically supposed to abstain from, as they understood it in the Book of Acts, are things that have to do with idolatry. And that's also a tradition that comes from jubilee. So I'll just kind of go over the, the account of the giving of the. The noachite laws as, as it is in the book of Jubilees, we're told that humanity can eat all animals, which the implication by the way, is that' doing before, but that they can never eat meat with the blood in it. So nothing strangled. And in Jubilees, this is connected to specific instructions about worship and sacrifice. Mankind should offer worship to God and seek his forgiveness each morning and evening. So this is the establishment of the cycle of the morning and evening offerings, the morning and evening sacrifice, which is something that we still basically maintain in the church with the services of matins and vespers, and then also that mankind should keep the festival of the first fruits each year. So this is the third thing. And now we'll note something that's been sort of added to what you find in Genesis. So it says, and he gave to Noah and his sons a sign that there should not again be a flood on the earth. He set his bow in the cloud for a sign of the eternal covenant that there should be. By the way, bow means like literally his weapon. That's what a rainbow is. I super hate all the people are like, it's actually a circle and that's to make you think of a wedding ring. And, and, and like this is, this is a common explanation for the rainbow. It's like, well, nobody knew what that meant until we got in airplanes and then we flew above the world and we saw that from, from the air, rainbows are circles and therefore it's a wedding ring. And that's why the wedding ring is the sign of the covenant. And like, whatever. This is a thing you hear at Protestant weddings sometimes, by the way. Anyway, super annoys me. It's his bow because it's his bow. It's his weapon. It's the weapon with which he destroyed the world. Right? That's, that's what a bow is. Anyway, this is very common, like ancient Eastern Semitic language. So he set his bow in the cloud for a sign of the eternal covenant that there should not again be a flood on the earth to destroy it all the days of the earth. For this reason, it is ordained and written on the heavenly tables. So that this idea of the heavenly tables is language that Jubilees comes back to again and again. And it's the idea that there's a heavenly Torah or there's a heavenly law. And that's what everything is referencing back to. And that's basically, you could say that's the thing by which the world consists is by that, by, by the heavenly law. And the earthly law, like the, the Torah that's given to Moses is, is like the earthly manifestation or representation of that, but the real one is, is this divine law. So it's ordained and written on the heavenly tables that they should celebrate the feast of weeks in this month once a year to renew the covenant every year. And this whole festival was celebrated in heaven from the day of creation until the days of. Of Noah, 26 Jubilees and five weeks of the year. And Noah and his sons observed it for seven jubilees and one week of years until the day of Noah's death. And from the day of Noah's death, his sons did away with it until the days of Abraham. This is an important detail. And they ate blood. And as we're going to see here in a minute, eating blood is connected to idol worship. But Abraham observed it, and Isaac and Jacob and his children observed it. Up to thy days, that is Moses's days. And in thy Days the children of Israel forgot it until you celebrated anew on this mountain. So remember that the context here is the giving of the law at Sinai. And do thou command the children of Israel to observe this festival in all the generations for a commandment unto them. One day in the year is the. In this month they shall celebrate the festival, for it is the feast of weeks and the feast of first fruits. This feast is twofold and of a double nature, according to what is written and engraven concerning it celebrated. So these laws are written or engraven upon the heavenly tables of the law. And by keeping them, what God promises, he goes on to promise Noah, is that if you keep these laws, so don't eat things strangled, which is related to idolatry, worship God twice a day, morning and evening, and keep the festival of Pentecost every year. If you do these things, then God promises that humanity will continue to cohere, that they will be safe from the ravages of chaos as exemplified by the flood. And there's a really interesting reference here, by the way, to the double nature of the feast."}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":1063.67,"end":1065.59,"speaker":"Jonathan Pageau","text":"Yeah, what is that? What are they referring to?"}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":1065.98,"end":1155.08,"speaker":"Richard Rohlin","text":"Not everybody agrees on this. It might refer to the two occasions of the giving of the law and the covenants, right after passing through the flood and then after passing through the Red Sea. But it might also refer to the fact that it has a heavenly and an earthly nature, that the. Say that every ancient agricultural society has a feast of first fruits. That's just something that everybody has. But it's like a joining of that part of the earthly cycle to a heavenly reality. And by the way, this is not a problem. Whenever somebody, like, looks at a Christian feast or a Jewish feast and they're like, oh, this is just a leftover from some fertility religion or whatever, like, God made the world and the cycle of the seasons is. Is what it is like. Yeah, it's. It's not. It's. It's so silly to think that. That. That the relationship between the natural cycle and heavenly realities should be arbitrary. In fact, no Christian has ever really thought that. And when I say this, I mean, like, we have had arguments and even schisms over calendars. And I know that the calendar thing is something that sometimes people are like, oh, that's just stupid. Whatever. And I'm not trying to start a calendar argument so that nobody, Nobody come at me. You know, I'm on whatever calendar my bishop is on. But, yeah, there you go. The idea that a calendar doesn't matter, that it's Arbitrary and not really important. This is not really a Christian idea. So anyway. All right, so. So the."}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":1155.08,"end":1172.44,"speaker":"Jonathan Pageau","text":"Yeah, my question is too, like the double aspect of the, of the feast. You know, one of the things I'm seeing with these, with the notion of Pentecost is that it seems to be a feast that is. That is about the manner in which heaven and earth touch each other. Right, that's like this."}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":1172.44,"end":1173.64,"speaker":"Richard Rohlin","text":"That's exactly what it's about."}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":1173.88,"end":1219.02,"speaker":"Jonathan Pageau","text":"And so when heaven and earth touch each other, then you. And it makes sense with the idea also of first fruit, which is the idea that you see, if you think about it in terms of agriculture as well. Right. So you see the effect of the seed, the first effect of the seed that has come from heaven in the world. And that would be the equivalent of the law, because the law is a fruit. It's not. It's a fruit of the connection of heaven and earth. It's not the actual connection. It's like the fruit of that. And so you could imagine the same with all the. The laws or all the manifestations of that covenant. And so in that sense, already you can kind of see that sometimes, you know, some, you know, when Jesus talks about how, you know, you. The wheats and the tares grow together."}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":1219.26,"end":1219.9,"speaker":"Richard Rohlin","text":"Yes, right."}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":1219.9,"end":1228.02,"speaker":"Jonathan Pageau","text":"That there's. That there is also an aspect of the fruits or the first fruits that can be maybe negative. Anyways, all right, continue on and we'll see."}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":1228.02,"end":1358.49,"speaker":"Richard Rohlin","text":"No, that's good. That's good. That. Yes. So the angel of the Presence then goes on to give us certain details in Jubilees about the history of the feast after Noah. Noah kept it, and also the related laws of daily worship, not eating meat with the blood in it, et cetera. And it's forgotten after his death. And this leads to the scattering of the nations at Babel. Abraham. Abraham is then the first person to start keeping it again, and also his sons Isaac and Jacob keep it. And this is all in Jubilees, we get actually accounts of when did Abraham keep Pentecost, for instance? We'll. We'll come to that in a second. But their descendants also forget it, and that leads to their captivity in Jacob. Right. So if you don't keep the feast, then you're scattered or you go into captivity. And structurally, this will set up for. Set us up for the next episode in the Genesis material that we find in Jubilees. And that's the Tower of Babel. So in between the account of the aftermath of the flood and that of the Tower of Babel in Jubilees, we get several important details which really help kind of fill in the gaps of Genesis, which is the whole. Again, this is the whole point of Jubilees and help us understand the tower's significance. So first we get the account of Noah's drunkenness, which is also there. Which is also there in Genesis, obviously. Now, the account of Noah's drunkenness is very important to the pattern of the feast of Pentecost. I'll talk about this maybe more in a minute. But. But every time that Pentecost is celebrated in the scriptures, you'll have somebody receives the law from God and they come down to the people, and then there's some strange episode of drunkenness that happens for Noah. It's. It's. He gets drunk, right. And then his son takes advantage in whatever. Whatever that means, whatever way we want to understand. Well, there's. There's. There's a couple of things that it means. It. I think there's a strong case. Father Stephen DeYoung has written about this, but I noticed the same thing, too. Like, there's a strong case to mean that it. There's a strong case to be made that it means that he had incestuous relations with his mother while Noah was drunk. Because that's what. If you look at the phrase uncovering your father's nakedness. Yeah. Everywhere else in the Old Testament. That's what it means."}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":1358.49,"end":1359.17,"speaker":"Jonathan Pageau","text":"That's what it means."}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":1359.49,"end":1370.63,"speaker":"Richard Rohlin","text":"And then that makes that. That makes Canaan, then this, you know, like a product of incest, which explains why the curse comes on him instead of on him. Anyway, anyway, yeah, we talk."}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":1370.63,"end":1372.59,"speaker":"Jonathan Pageau","text":"We have a video about that with Father Stephen. So."}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":1372.59,"end":1495.8,"speaker":"Richard Rohlin","text":"Yes, I know, I know, I know, I know. So, yeah, I just. Yeah, people go back and watch that if. If you want to. But. Yeah. Pleasant stuff. So. But. But another example. Another example is, of course, the apostles, right. When the apostles are at Pentecost, they're. Well, actually, we'll talk about the apostle in a second. But another easy example is when Moses comes down, you know, at. At Pentecost, right. He's received the law, he comes down the mountain, and the people. The people are, you know, engaging in, like, a giant drunken orgy, right? So there's this weird thing of, like, drunkenness happening at the end of Pentecost, which I think is. Which I think is interesting. So we. We have that and the curse of Ham, and then right after that, we have Noah's sons divide the earth among themselves by lots of. And this basically foreshadows the table of nations in Genesis, which Is, as we've talked about many times, is a vital passage to understanding the whole idea of medieval universal history. So after this happens, Noah makes a kind of a final testament in which he restates the Noah Kaid laws and then shares his fears for what is going to happen to his sons and their sons after his death. You know, as far as they're going to stop keeping the laws and that all of these things are going to happen. Of course that's what happens. Yeah. And then what we're told is that unclean spirits, so demons and the offspring of demons, led by Mastema, who is also Satan or the devil, like, he's got kind of different names throughout Jubilees, but they're used interchangeably. They torment humanity and they start to lead humans astray after the flood. And so this. This sets up another very important idea in the New Testament is that on the prayers of Noah, these demons are imprisoned in the underworld. All of them, except for 1/10, who are allowed to continue to roam the earth and test mankind. This is an idea which Saint Peter will refer to when he talks about. Talks about the ones chained in Tartarus. Right. This is the one. This is like the whole idea when. When, you know, Jesus, you know, comes to the demons that are inhabiting, you."}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":1495.8,"end":1498.04,"speaker":"Jonathan Pageau","text":"Know, come to torment us before our time."}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":1498.04,"end":1562.82,"speaker":"Richard Rohlin","text":"Yeah. That the time is the end of. Is the day of the Lord. Right. Which they think is the end of the world, but the day of the Lord is actually. That's when God comes to you. Right. So. So I mean, that's the subtext there, is it actually is their time. But yeah. So anyway, all of this, once again, see Father Stephen DeYoung's published works. But so they're allowed to continue to roam the earth and test mankind, including by afflicting them with, like, various diseases. And so we are told that Noah is then given a series of books, and he's actually given them according to a related tradition. He's given them by the archangel Raphael, who's the sort of the patron angel of, like, healing, that he's. He's given a series of books with the knowledge of the medicines and seductions of the demons and how to combat them, interestingly, with herbs from the earth. This is such an interesting idea to me because it's like you can already see the idea of the garments of skin or. Or like the. The old word for this is pharmakon, Right. The thing that, like, it's death, but also you can use it to. To. To ward off death. Right. That's what was where we get our word pharmaceutical from."}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":1564.42,"end":1609.41,"speaker":"Jonathan Pageau","text":"It's also interesting to think that in some ways it's the redemption of the, you know, of the, of the Book of Enoch story, because in some ways those things were revealed to humans by the demons. And so the Archangel Gabriel has to in some ways reveal them with their solution, you know, and so it's like, it's the, it's this completion of the pattern of how civilization. And, and this is also makes sense because that's what Noah is. That's what, that's who Noah is. Noah is the one who takes techne, who takes these revelations from this, the sons of God that became civilization, became technology and weapons, and he makes the ark out of it, you know, and that's why Noah is often said to be married to Tubal, Cain's sister."}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":1609.49,"end":1609.81,"speaker":"Richard Rohlin","text":"Right."}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":1609.81,"end":1630.01,"speaker":"Jonathan Pageau","text":"Because he integrates. He's able to use this aspect of the world, kind of turn it. And so the idea that in Jubilees that Gabriel would reveal Raphael, but Yes, I'm sorry, sorry, sorry that Raphael would reveal this again to Noah, you know, the more pharmakon aspect of it, which was part of the Ethio, the, the Enoch tradition, it makes a lot of sense."}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":1630.17,"end":1812.15,"speaker":"Richard Rohlin","text":"Well, and, and the fun thing is that Raphael does this again in Tobit. Right? So, so the Book of Tobit, which is actually is in your Old Testament for the majority of Christians that. That have lived, you won't have. If you're a Protestant, then it'll be an apocrypha. But most Christians at most times have had the Book of Tobit in the Old Testament. And patristic commentaries on Tobit, by the way, are awesome. Very, very fun. The Venerable Bede, an Anglo Saxon. Anglo Saxon monk and writer, theologian, etc. He has a wonderful commentary in Tobit. But anyway, in the Book of Tobit, this is exactly what the Archangel Raphael does, is he comes to Tobit and actually helps him, helps him overcome the wiles of the demons by doing things that. Part of the reason that Luther didn't like Tobit is because he felt like it was too magical. Like there's too many things, too many things that are like magic as, like, oh, you're gonna go catch the certain fish and do the certain thing with it, and then you'll make some incense, and the incense will drive the demon away and things like this. And, and you know, when they're trying to like, purge all the superstition, you know, from the world or whatever, like, Tobit has to go. But, but, but but this is. This is. This is kind of like. I mean, that's the thing that Raphael does. That's what Raphael does. Like, he's a healer, but he's more than just a healer. He shows the. Basically shows the way that the demon works and then gives you a way to. To counteract it. So. Yeah. So. And then we're told that in the days of Peleg, the city, the Tower of Babel, or really the City of Babel is built. And it's not simply a tower, it's a city and a tower. And Father Stephen DeYoung, I made a point about this at the Summit Father Stephen DeYoung got onto me, is like, well, obviously, there's a city around it. I will just continue to maintain that most people don't always. Don't necessarily connect the. The tower with the city. Really? Like. Well, when I was a kid, we knew there was some kind of connection between Babel and Babylon. Obviously, they're the same thing, but we knew there was some kind of connection between the two. But I think that I was always told that the Tower of Babel was built first, and then later people came along to the ruins and they built the city of Babylon or something like this. Something like this. But the tower was always just like, even go look at artistic depictions of it. Sometimes it's shown with a city, but most of the time it's shown alone, just like a big tower standing out in a field or whatever, which makes no sense if you think about it for, like, three seconds. But a surprising number of people, myself included, grew up with, like, that mental image. And so I think it's worth mentioning. So. So we're told in Jubilees that it takes 43 years to build. We get its dimensions. These are details we don't get in Genesis, of course. And we're told that it's, you know, again, not simply a tower. It's a city and a tower. The city is in a square or rectangle. And so the. The idea of the city being a perfect square. So it's not a round wall. It's a perfect square. This. This is actually very important to understanding, you know, the Apocalypse."}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":1812.15,"end":1812.79,"speaker":"Jonathan Pageau","text":"That's right."}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":1813.67,"end":1946.48,"speaker":"Richard Rohlin","text":"And the descent of the new Jerusalem. But. And the Lord says. And in Genesis, the Lord says, now nothing will. Like, nothing will be impossible for them or something like that. But in Jubilees, it's, like, a little clearer. It says, the Lord says, now nothing will escape them. Which I think communicates very well the totalizing nature of the spirit of Babel. Right. And then he confuses the tongues. So after the confusion of the tongues, a great wind comes and casts the tower down. And the mention of the wind which destroyed the tower references this very old Jewish tradition, which, by the way, is also found in the Sibylline oracles and also in Josephus, in Josephus account of the fall of the Tower of Babel. So this is something everybody in the ancient world believed about the Tower of Babel is that it had been destroyed by a great wind, although that's not a detail in Genesis. And this passage is bracketed by two passages concerning Mastema and evil spirits, one of which I mentioned just a moment ago. And these passages make it very clear that the context in which we are meant to understand the building of the Tower of Babel is that of idolatry. So it says the sons of Noah began to war on each other, to take captive and to slay each other and to shed the blood of men on earth, and to eat blood and to build strong cities and walls and towers. And individuals began to exalt themselves above the nation. Boy, that's not a fun thing to think about. And to found the beginnings of kingdoms and to go to war with people against people, and nation against nation, and city against city, and all began to do evil and to acquire arms and to teach their sons war. And they began to capture cities and to sell male and female slaves. And Ur, the son of Khed built the city of Ur of the Chaldees and called its name after his own name and the name of his father. And they made for themselves molten images, and they worshiped each idol, the molten image which they made for themselves. And they began to make graven images and unclean simulacra, which is not. I don't want to know what they mean by that. And malignant spirits assisted and seduced them into committing transgression and uncleanness. And the Prince Mastema exerted himself to do all of this. And he sent forth other spirits, those which were put under his hand to do all manner of wrong and sin and all manner of transgression, to corrupt and destroy and to shed blood on the earth. And it goes on. It's a really bad time."}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":1946.48,"end":1949.89,"speaker":"Jonathan Pageau","text":"So. So basically. So now he's talking about the foundation of Ur."}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":1950.45,"end":1953.49,"speaker":"Richard Rohlin","text":"Yeah, so. So that. So Ur is built after Babel falls."}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":1953.49,"end":1954.13,"speaker":"Jonathan Pageau","text":"After Babel."}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":1954.13,"end":2125.24,"speaker":"Richard Rohlin","text":"Okay, yeah. But basically, the point of these two episodes before and after the Tower of Babel is to show that the idea of building a city in a tower is connected to the idea of of idolatry. Right. That. That's what it's for. So this general state of affairs continues until Abraham. And Abraham is pious and as the is the first man since the death of Noah to reject idolatry and to worship the one. True is what we're told in Jubilees. So as a result of his piety, by the way, there are other traditions that actually have Abraham like contemporary with Nimrod and like he's there at the fall of the Tower of Babylon. That stuff is really fun. But anyway, that's not necessarily in Jubilees. The timeline's like a little foggy. Yeah. So as a result of his piety and his efforts in defying the work of Mastema, destroying his father's idols, so on and so forth, God sends an angel to open Abraham's mouth and ears so that he can understand Hebrew. And Hebrew is the knowledge which has been forgotten since the fall of the Tower of Babel. It actually says that the word, the language of Hebrew has been lost since the fall. So if you're reading that in like, in a post Augustinian context, you would be like, oh, since, since Abraham. Sorry, since Adam. Since Adam and Eve. Like, but it probably means the fall of the tower. That's the most recent fall that's been been talked about. And that's where, you know, confused tongues are confused and everything else. And, and the, the fall in Eden was not like before Augustine. It's not the defining fall for everybody, certainly not for ancient Jews. There's various ones. So. So he's given the, the knowledge of Hebrew and this allows him to read the books of his father Terah. Now we don't know exactly know what these books are. They seem to have been passed down from Noah. So maybe these are the books that Raphael gave him. But they recount the true history and the nature of the world up to that time. And it is from these books that Abraham learns the law of God. And all of this is many generations before the same law is going to be given again to Moses on Sinai. So all this culminates In Jubilees chapter 15, when Abraham sacrifices at the feast of the first fruits and offers a sacrifice to God. God accepts Abraham's sacrifice and this is the occasion of the first giving of the Abrahamic covenant. So this is the next covenant that we meet in Genesis. And everybody knows the story. Abraham cuts all the animals in half and then like God comes between them like a smoking lamp and a burning furnace and all this stuff. But in Jubilees that happens very explicitly at Pentecost. So Noah celebrates Pentecost and God makes a covenant with him. Abraham celebrates Pentecost, and God makes a covenant with him. And all of this is being told to us when Moses is celebrating Pentecost and God is making a covenant with him."}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":2125.56,"end":2130.16,"speaker":"Jonathan Pageau","text":"Is there. Is there in Abraham, Is there a case of drunkenness after that or something?"}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":2130.16,"end":2136.92,"speaker":"Richard Rohlin","text":"I was just wondering that. I can. Oh, there is something, and I can't remember what it is. Now, hold on."}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":2138.28,"end":2140.52,"speaker":"Jonathan Pageau","text":"What's the story right after the. Right after the."}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":2140.52,"end":2146.15,"speaker":"Richard Rohlin","text":"Oh, so in. In Jubilees, it is Sarah's laughter, huh?"}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":2146.39,"end":2147.99,"speaker":"Jonathan Pageau","text":"That comes after the."}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":2148.39,"end":2158.31,"speaker":"Richard Rohlin","text":"Yeah. And. And I think this is sort of like to counteract the drunkenness, right? It's the institution of circumcision. So that's."}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":2158.39,"end":2158.79,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":2158.87,"end":2160.55,"speaker":"Richard Rohlin","text":"So right after that."}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":2160.71,"end":2164.23,"speaker":"Jonathan Pageau","text":"Okay, so right after the. What's first? The laughter first?"}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":2164.79,"end":2268.97,"speaker":"Richard Rohlin","text":"Yeah, it's circumcision first. Oh, the other fun detail that you get in Jubilees, and this is something that I think Father Stephen DeYoung has talked about, is we're told right after the institution of circumcision that all of the nations have been given to demons to rule, which itself is a kind of disorder. It says the laws for all the generations forever. And there's no circumcision of the days, and no omission of one day out of the eight days. For is an eternal ordinance ordained and written on the heavenly tables. Everyone that is born, the flesh of whose foreskin is not circumcised on the eighth day, belongeth not to the children of the covenant which the Lord made with Abraham, but to the children of destruction. And it goes on. It says, says, for the angels of the Presence and all the angels of sanctification have been created from the day of their creation. And before the angels of the presence and angel of sanctification, he hath sanctified Israel. So actually, Israel has been set apart even before the angels were made, so that they should be with him and with his holy angels. And do thou command the children of Israel, and let them observe the signs of this covenant for the generation as an eternal ordinance. And they will not be rooted out of the land. For the command is ordained for a covenant. So this is still the giving of law. And there's a by the way, it says, for Ishmael and his sons, and the brothers. And his brothers, and Esau, the Lord did not cause to approach him. And he chose them not because they were the children of Abraham, because he knew them. And he chose Israel to be his people. And then it goes on and yeah, we get Sarah's. We get the. The announcement of the prediction of the birth of Isaac and Sarah's laughter and the angelic visitation, like all of that stuff, and then the destruction of Sodom and Gomorrah. It all comes right in that sequence, which is the same sequence you get in Genesis. I think finding the drunkenness parallel here is maybe a little difficult. Yeah, it might be difficult, but. Yeah, I'll think about that a little bit."}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":2268.97,"end":2269.93,"speaker":"Jonathan Pageau","text":"We have to think about it."}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":2270.09,"end":2271.69,"speaker":"Richard Rohlin","text":"Symbolism happening for sure."}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":2271.69,"end":2282.09,"speaker":"Jonathan Pageau","text":"The laughter is a kind of counter reaction to the revelation. Right. It's like this lack of control that's at the. You know, that's. So give."}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":2282.09,"end":2288.65,"speaker":"Richard Rohlin","text":"Give Sarah. By the way, people like, you know, that's. What else would you do? Like, I think that."}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":2289.69,"end":2301.53,"speaker":"Jonathan Pageau","text":"No, we often have to put ourselves in position of these characters. Like, some of the reactions even that God will punish are completely reasonable. Like the ark falling over and someone going to. To like, stop it. It's like, what would you do? I would do that, you know?"}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":2302.49,"end":2376.43,"speaker":"Richard Rohlin","text":"Yeah, yeah, I think that's like Sarah's. Sarah's laughter, like, is one of those things. Like, it's not a haha, that was funny laughter. It's a. What else do you do but laugh? Like in the face of somebody of God telling you this when you're in your 90s, like, what else do you do? But anyway, okay, so we'll think about that a little bit more. I think that there probably is something there. I mean, like, all the Sodom and Gomorrah stuff happens right after that. Yeah, so that's something that. Something I got to think about now. At this point, I have to confess to everybody that I buried the lead. So this is the big secret. I apologize for all the repeated material, but I wanted to set this up. So this is the big secret that we didn't share in the last video. Here I must once again mention that the author of Jubilees is hyper attentive, like obsessively attentive to calendars. He always tells you the day, or at least the week in which significant events are occurring. And if you pay very close attention, you will find that God descends to confuse the tongues and scatter the nations from Shinar in the fourth week, which is how Jubilees usually introduces the feast of Pentecost. In other words, for instance, Jubilees, chapter 15, the context of Babel is thus a bad. It's a celebration of Pentecost. That's what's happening at Babel."}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":2376.99,"end":2379.31,"speaker":"Jonathan Pageau","text":"They're celebrating when the tower is destroyed."}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":2379.39,"end":2379.87,"speaker":"Richard Rohlin","text":"Yeah."}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":2380.35,"end":2381.55,"speaker":"Jonathan Pageau","text":"Celebration of Pentecost."}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":2381.63,"end":2518.22,"speaker":"Richard Rohlin","text":"They're celebrating Pentecost, but it is a act of false celebration, of idolatrous worship. And the Lord descends. What happens at Pentecost? God descends like Earth meets heaven, right? So God descends as he did with Noah and with Abraham. But this time it's not to make a covenant or give God's law, but it is rather to bring confusion and scattering, which is the promised consequence of idolatry. So jubilees relates to us this tradition which contrasts the worship and the giving of the covenant to two righteous men, Noah and Abraham. And actually later, Isaac also celebrates jubilees, Pentecost and jubilees to idolatry and therefore confusion and dispersion. It contrasts the generation of Babel against the people, like the people of God. And so these are, we could say, three different events in linear history. But remember that Pentecost has been celebrated in heaven since the world was created. This is what we're told. Well, that means Pentecost is always being celebrated in heaven, right? Like, it's always, like it's a, it's a, it's a reality there that our experience of linear time is, is connects to through the act of celebration, right? And this is, this is a really important way. I mean, I, I, the, the symbolism of, of, of feast and celebration. And I know it's heaven meeting Earth. Like, you can just say that or what. But like, if you really think about, like, what is happening when you celebrate something, I feel like that's the whole, like, to me, that's the whole enchilada. Like, if you could just understand, like, what's going on with celebration, then you'd understand everything in the Bible and also everything about the world. Like, it's, I just, like, I get stuck on it so much because it's. Celebration is the act of celebration is the way by which we connect to higher or lower realities, right? And it's, it's really, it's the way that, you know, you, you gave this great keynote at the summit talking about how human attention, right, through the, the figure of the Son of Man, right, is the thing by which the world orders itself. But celebration is the primary action that gives attention. Like, that's the primary way you give something attention is by giving it a celebration."}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":2518.94,"end":2553.17,"speaker":"Jonathan Pageau","text":"So we need to really. This is, to me, this, this idea that Pentecost and the idea of the first fruits and also the notion that this has to do with multiplication, like, that's actually what. Because you, let's say we look at theophany for Example, like our celebration of theophany. Theophany is also a joining of heaven and earth. Right. The Spirit comes down on the waters, the earth is gathered up together. You know, there's definitely a relationship between the two. But the idea that. That Pentecost would be related to the multiple, to multiplication."}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":2553.87,"end":2554.99,"speaker":"Richard Rohlin","text":"Yeah. Is."}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":2554.99,"end":2563.31,"speaker":"Jonathan Pageau","text":"Makes a lot of sense. It also makes a lot of sense of this weird covenant that Abraham does. It's the weirdest thing in the world."}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":2563.71,"end":2564.11,"speaker":"Richard Rohlin","text":"How."}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":2564.19,"end":2573.23,"speaker":"Jonathan Pageau","text":"Why in the world? Like, I've never understood it. Why would you cut things in half? Like, why are you cutting these bulls in half and then you're walking through the middle."}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":2573.31,"end":2587.97,"speaker":"Richard Rohlin","text":"There's no good explanation for that outside of this, by the way. People will again, like, covenant theology is like a big deal in, like, reform circles that it came from. And people would always be like, yeah, the word covenant comes from the word cutting. Because you have to like, kill something to make covenant or, you know, something like this. But it's like you have to kill."}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":2587.97,"end":2592.69,"speaker":"Jonathan Pageau","text":"It and you have to split it in half. And then, like. And then walk. God reveals himself."}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":2592.69,"end":2597.05,"speaker":"Richard Rohlin","text":"Like, listen, weddings would be a lot gorier did it this way. Yeah."}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":2597.69,"end":2648.58,"speaker":"Jonathan Pageau","text":"But this makes a lot of. It makes a lot of sense of it in the sense of, you know, first of all, this idea that God manifests himself amidst the cutting, like amidst the separation. Right. It makes sense of the separation of the waters in the. In Genesis 1. But then it also makes sense of the idea that, you know, if you think about how creation works, there's two aspects of it. One is unity, one is unifying, and one is separating. That's how the world works. In order for any identity to exist, two aspects have to. To be true. You have to separate it from other things, and you have to unify to itself. And so the idea. The idea of that is what the Logos does, or that is what the influence of heaven does, is that it unifies and it separates. And. And what's interesting about the Pentecost image is that it seems to be God revealing himself in the separation."}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":2649.14,"end":2649.42,"speaker":"Richard Rohlin","text":"Right."}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":2649.42,"end":2662.18,"speaker":"Jonathan Pageau","text":"In the multiplication. Right. So it's like think about its first fruit. So, you know, the seed comes down, all these fruits appear, and then God manifests itself in this multiplying. But if. But if it's not celebrated, then it's just separation."}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":2662.74,"end":2663.54,"speaker":"Richard Rohlin","text":"Yeah, Right."}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":2663.54,"end":2700.13,"speaker":"Jonathan Pageau","text":"So if it's not. If it. If it's not celebrated properly, then the influence of heaven becomes scattering. It's like it. It will it. The scattering without the unifying. And you can think about it like Everything makes sense. Like think about the judgment of God too. You know, that's what, that, that's what happens when the, you know, the idea of the goats going away, scattering away, or the idea of the burning of the chaff. This idea that in some ways, you know, when heaven and earth, when God manifests himself, that's what happens. Unity and separation. But if it's not proper, then it, then it ends up being, I mean, and that end up being."}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":2700.13,"end":2762.51,"speaker":"Richard Rohlin","text":"Separating that unity and diversity, those two things together is, that's, that is the Trinity, right? And in this point I think that I can say non heretically always, like I'm nervous about speaking about the Trinity in public because you're going to do like an accidental heresy, but that this is an essential aspect of, of divinity. This is what God is, right? Is these two things together, like unity, but really it's a community, like community, right. A communion of love. And that this is an essential thing to the way that God is. And when he reveals that aspect of himself, if you don't celebrate it or you try to instead focus on yourself and celebrate yourself, there's this sort of self reflexivity to idolatry, I think. And if you try to like sort of celebrate yourself or focus on yourself, even that, that, that chilling sentence people put the exalted, the individual over the nation. Right? That even that kind of an idea. Right? That's."}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":2762.59,"end":2767.23,"speaker":"Jonathan Pageau","text":"Oh, then yeah, by the way, Richard, I think. Okay, so it's not Sarah's laughter."}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":2768.11,"end":2768.83,"speaker":"Richard Rohlin","text":"What is it?"}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":2768.83,"end":2770.83,"speaker":"Jonathan Pageau","text":"It's lots drunkenness. It has to be."}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":2770.83,"end":2772.67,"speaker":"Richard Rohlin","text":"I'm so stupid. Of course it is."}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":2772.67,"end":2777.69,"speaker":"Jonathan Pageau","text":"It has to be. Lots drunkenness and his incest with his daughters. Like that's right downstream."}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":2777.77,"end":2781.45,"speaker":"Richard Rohlin","text":"Oh my gosh, I'm very dumb. That is, that's correct. That's. That's right."}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":2781.45,"end":2786.57,"speaker":"Jonathan Pageau","text":"Well, I'm dumb too because it's so obvious and you. And it's like, it's so obvious. I'm like, just let it run, Jonathan."}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":2787.21,"end":2787.77,"speaker":"Richard Rohlin","text":"There you go."}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":2787.77,"end":2789.45,"speaker":"Jonathan Pageau","text":"At some point it's like, of course."}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":2789.61,"end":2809.31,"speaker":"Richard Rohlin","text":"I mean that's. And, and what does that lead to? That leads to the, the, the, even the, the sort of. The scattering of this, of the seed. Because like Lot's a righteous man and he's part of, you know. But then it creates Moab and it creates Ammon, like these two, like, like long, long term ancestral enemies of Israel. Right. It's crazy. Yeah. Okay, that's. There we go."}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":2810.03,"end":2812.07,"speaker":"Jonathan Pageau","text":"All right, so now we need, so we need to bring it."}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":2812.07,"end":2949.35,"speaker":"Richard Rohlin","text":"That's the second. That's also, like the second incest connection with Pentecost, too, if you take that one interpretation of what Ham did. Yeah. Anyway. Okay. Super weird. All right. Yeah. So to kind of, like, bring this down. So the. The basic idea. I think we talked a lot in our last video, and we're kind of running through our time here, so I'm not going to restate all of this, but we talked a lot in our last video about the account of Pentecost in Acts, chapter two, and paralleling it to these accounts of Pentecost in the Old Testament, actually to the Tower of Babel, which is something in the Orthodox Church. We literally have, you know, hymns of old. The tongues were confounded because of the audacity in the building of the tower, but now the tongues are made wise for the sake of the glory of divine knowledge. Right. And so even by the way, like, the way that all of this interacts with language is also something. And the connection and jubilees of language and law and those two things together, this is something I'm still trying to think about. So I mentioned last time that there's this early tradition that you can still find recorded in the writings of many of Oriental Orthodox communities, that the day of Pentecost is the occasion, actually, of the first Divine Liturgy. So in the Divine Liturgy, we have a part called the Epiclesis, which is the calling down of the Holy Spirit upon the gifts. In the Divine Liturgy of Saint John Chrysostom, for instance, we say, send down your Holy Spirit upon us, and upon these gifts here set forth. Right. And so if you think about it, like, what are the apostles gathered together to do? Well, they're all still basically pious Jews. Right. Christ always kept Pentecost. We know this from the Gospels. So they're gathered together in the upper room to celebrate Pentecost together. So they're keeping this sort of ancient law that's written on the tables of Heaven, and they're celebrating Pentecost together, and they call down the Holy Spirit. And what happens? This wind descends on them, and the wind unifies, it multiplies, but it also scatters. Remember that there are people there who think the apostles are drunk. Yeah. Now, and this is a weird thing, because if you pay very close attention, you will find that the apostles are not. For instance, it's not an example of. Of glossolalia. They're not just, like, babbling, like, you know, like Pentecostals or something, not trying to throw anybody any shade. But that's not what's happening in the."}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":2949.35,"end":2951.47,"speaker":"Jonathan Pageau","text":"Book of acts people hear in their own language."}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":2951.47,"end":2955.19,"speaker":"Richard Rohlin","text":"People hear them in their own language. But some people hear drunkenness."}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":2955.27,"end":2955.83,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":2956.07,"end":3511.59,"speaker":"Richard Rohlin","text":"And that is a weird thing, but it only makes sense if you kind of have this understanding, because some people hear drunkenness. Why? Because they're not keeping the feast. Yeah, right. They're not. They don't have their attention oriented correctly. So what they hear and they experience it as drunkenness and scattering to say, these guys are drunk. What do you. What do you guys listen? Like, they're just babbling, right. And. And in that sense, it's like a funny. Almost like kind of a funny pun on the whole Tower of Babel thing. Right. That word that means confusion and has come in our. In our language now to mean a particular kind of linguistic confusion. So the big idea that I wanted to sort of pitch is that there's only one Pentecost, and that this Pentecost happens at one point in, like, an eternal moment. And Noah and Abraham and Moses and the apostles all participate in that day of Pentecost. But so did the people at the Tower of Babel. Yeah, so did the people of the Tower of Babel. And that if you participated it correctly, then it will unify and also multiply. And if you don't give it your focus, if you don't give it your attention correctly, then you're going to be divided and you're going to be scattered. So we've been making these universal history videos for about two. A little over two years now. I think we, you know, by my last count, probably had, like, 23 videos in the series. Maybe this will be number 24. They've been genuinely generally popular, very well received. I've gotten such an outpouring of. Of appreciation from people, which I'm very grateful for. But I do get some funny questions. And sometimes these funny questions are just people, like, missing the whole point of the video. And sometimes it's people, like, trying to educate me about their favorite forms of, like, heterodox esoterica. Like, have you tried, you know, tarot? Or have you tried, like, psychedelics or whatever? It's like, no, no, no, thank you. But one of the most common questions that I get from people, like normal people is what do you mean by universal history where the emphasis is on the second word? Right. And the word history, like, in its early sense from Greek, means like inquiry, or knowledge gained from inquiry. And so we still preserve this in the sense of terms like the Natural History Museum and so forth. By the time the word makes its way into old English by Latin via Latin. It's picked up sense of being the account, the description, the written account of past events, a story or a narrative. And by the 12th century, when it's being used in the Middle Ages, it means something like the account of events as relevant to a group of people or people in general. So the story of your people mattered because it was your story, because participation in that story makes you a part of your people. And if you forget yourself, you cut yourself off from reality. And this is what happens at the Tower of Babel is that people forget Noah, they forget the laws that were given to Noah, they forget the covenant of God, but they're really forgetting themselves. They're forgetting what it means to be human. And so taken in this sense, universal history is a history of everything and everyone. It's a history of who we are, how we got to be where we are, and how the laws and the customs and the rituals and traditions of our people give us meaning and allow us to continue to cohere so that we could be long in the land. And every work of Jewish and Christian history, from the first writings of the books of Moses until modern times, has seen it necessary to begin at Genesis, because Genesis has the answer to these questions. So the Anglo Saxon Chronicle, a work which is mostly concerned with events in the 8th and 9th centuries in England, begins with the Incarnation, but also takes pains to trace Alfred back to Noah. So later on, our 19th century German friends will try to move history closer to the sciences, to make it a Wissenschaft. And there was, as one of the fathers of modern source based historiography put it, history should be concerned with what really happened, but that this is only knowable through what he called genuine and original documents. And so this attitude towards history, so what that meant was you couldn't actually trust ancient historians. Like you have to ignore them and you have to go for like other things. And this attitude toward history is, it's not unlike the obsession with like the idea of like the original articles in biblical textual criticism which has, has driven many people away from the faith, quite frankly, since, since we don't have any such articles. So this is how this all relates to Pentecost, taken in the medieval sense. Jubilees is this work of history. This is why I'm so interested in it. We'll probably do more videos about it. It's a work of universal history because it shows the way in which the basic patterns of religious life, which are feasting and fasting, Sabbaths and holy days, are the very shape of Reality itself. That's the whole point of the book of Jubilees. And by conforming our lives to these patterns, we exist and cohere. We remember ourselves, and we host angels. Like, if I could tell, tell on myself a little bit, when I was a Protestant, there was like one year and I was on staff at the church, so I'm telling on myself, there was one year when people just sort of forgot that Easter was next week. And so it was rolling around and we're like, oh, crap, Easter is next week. We didn't plan anything. And. And somebody said, well, let's just push it out a month, because there's no reason we might have actually been on. On old calendar Easter that year. I don't know. But. But they were like, well, let's just put it out, push it out a month. It doesn't really matter when we celebrate it, right? If you live this way, your life and your society, your culture will be scattered and overtaken by a roiling chaos of competing principalities, because all of these lower principalities are basically fighting over a vacant throne. And I think that we see that the account of Pentecost in Acts alone is enough to kind of convincingly show, for instance, the way that histories like Jubilees are seen by the ancient Jews, by the apostles, by the early church. And there are a lot of other examples of that that I haven't mentioned. But when I first kind of conceived of this talk, I was just thinking, let's just do neat extra biblical traditions about Genesis, and I'll just talk about that at the summit. But as I started digging into Jubilees more closely and the more closely I looked at the traditions around the Tower of Babel, I realized that this is really a perfect case study for the whole idea of universal history. Right. This is why we're doing this project. It's my deep belief that the time of Scripture is the time of our own lives, that we're not fundamentally different people from the human beings who first attempted to build Babylon. The great. Right. So the question that I'm asked most frequently by listeners is, how do you integrate all this universal history stuff into your daily life? Like, what should I do? And the suggestions that people sometimes come up with worry me a little. Sometimes it seems like everybody's reflex is to, like, make up some own little rituals or practices to give their lives meaning. And I just want to say, like, don't do that. That's what I want to just tell people is don't try to roll your own. Okay? Instead, start by doing What God commanded. Noah, according to the book of jubilees, every human being that has ever lived is commanded to pray each morning and evening together with your family or with other people, if you can. If you need help figuring out what to pray, I have suggestions. Keep yourself clean from idolatry and keep the feast of Pentecost. And I mean really keep it. Be present in church on the day of Pentecost, participate in the sacrifice of the people of God. And of course, as St. Peter ends his, his great Pentecost sermon, repent and be baptized. Right? That's how he ends it actually. Like, I like, I like how even St. Peter ends with go to church. So, yeah, so that's. And, but he says, he says that when he says repent and be baptized, forgiveness of sins, he says, this promise is for you and for your children. And this idea of the promise being for you and for your children, even in there, there's this idea that thing we're doing in religion, in Christianity, or really any other religion for that matter, isn't just like, here's a nice individual choice that I am making on behalf of myself, but rather I am joining myself and also the people who come after me to a community, to a story, right? And therefore the promise. And what's another word for promise? Well, it's covenant. Right is for you and for your children. And so Peter is showing them the way. Here's how. Now, if you want to participate in the covenant, right, God's law coming and being written as it was prophesied in the Old Testament, not on tables of stone, but on our hearts. If you want to be a part of that, you have to join that covenant and, and, and come in, you know, come in as a family, into the family, so to speak. So anyway, that's, that's just a, some of, that's rehashing some of that stuff that I ran out of time to stay at the summit. So, but I think the big, the."}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":3511.59,"end":3587.45,"speaker":"Jonathan Pageau","text":"Big interesting reveal, at least for people interested in the, the idea that Pentecost is the anti. Babel, right? We hear that in church and when you see the story in scripture, you, you can see it, but it's very odd. It's kind of, you get a sense of what it is, but then the best way to understand it is that Pentecost is really the full revelation of that pattern because it has both, you know, the unifying and the multiplying, right? In extreme, in an extreme way. Because the multiplying is, is an aspect of unifying, right? So as the people hear in their own tongue, as there's this celebration of diversity, right, in the right way, which is that the Logos can man themselves all the way into your own culture, which is what we keep saying in terms of what universal history is, is that that all true cultures, all true stories can be connected to the universal one, right? To the story of the Logos manifesting in the world without completely losing its quality. Right? Because that's also what Christianity is. And so in the story of Pentecost, you really get, in some ways the full revelation of what universal history is. And, you know, this image of the."}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":3587.45,"end":3611.27,"speaker":"Richard Rohlin","text":"Wind, sorry, the wind. I mean, it's the wind. The same wind is the same wind. The wind that knocks over the tower is also the wind that fills the Holy. That the apostle is the Holy Spirit. Like in both cases. Like, I mean, I'm sorry, I interrupted you, but just like the idea that of, like God manifesting as wind, by the way, is something that really bothers me, like, in a good way. But like, it's like."}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":3612.71,"end":3633.59,"speaker":"Jonathan Pageau","text":"Well, you know, it's so funny because the, the people, People, they're. That they're so hung up, like, as soon as when you start to see it. A good example, you know, if you, you know, during the liturgy, if there are several priests in the altar, they'll take the. I forget what the name of the cloth is, right? And then they'll do this over the."}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":3634.31,"end":3636.19,"speaker":"Richard Rohlin","text":"It's called hair. Yeah, yeah."}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":3636.19,"end":3650.71,"speaker":"Jonathan Pageau","text":"And so I remember a priest once saying, oh, we have proof that maybe this is just to chase away the flies. And I'm like, really? To chase away the flies? Well, actually, maybe it is to chase away the flies, but that doesn't. That doesn't prevent it from being."}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":3650.71,"end":3652.23,"speaker":"Richard Rohlin","text":"Not at all exactly what it is."}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":3652.23,"end":3655.39,"speaker":"Jonathan Pageau","text":"Which is the descent of wind onto the thing."}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":3655.39,"end":3659.75,"speaker":"Richard Rohlin","text":"Even, even the action of chasing away flies, by the way, is deeply symbolic action. Like."}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":3660.15,"end":3668.15,"speaker":"Jonathan Pageau","text":"Yeah, it's exactly like this. You want the things that don't belong to scatter, and you want the wind to come and unify that which is there inside."}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":3669.11,"end":3670.79,"speaker":"Richard Rohlin","text":"And by the way, do you know why it's called the air?"}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":3671.83,"end":3672.95,"speaker":"Jonathan Pageau","text":"No, what do you mean?"}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":3673.35,"end":3684.79,"speaker":"Richard Rohlin","text":"Well, I'm trying to remember if. If that the particular thing they're moving is there. I think the air is actually the veil that you put over the. The. Some priest out there will correct me on this. I think the air is actually the. You know what? I have a theory about this, but I'm going to stop talking."}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":3684.79,"end":3685.19,"speaker":"Jonathan Pageau","text":"Okay?"}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":3686.23,"end":3690.19,"speaker":"Richard Rohlin","text":"I've got words confused in my head and I don't want to embarrass anybody. So."}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":3690.19,"end":3701.49,"speaker":"Jonathan Pageau","text":"But, but for sure, what you can see is that, you know, even in the story, in the Gospel, when Jesus actually blow the disciples, like, he just. He just blows on them, you know, all of these things. Which, which."}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":3701.49,"end":3737.25,"speaker":"Richard Rohlin","text":"Oh, no, it is the air. It is the air. Okay, what is the air? It's. It's called the air. A E, R, A, E, R. That's what the cloth is called. And it's. But it's. I mean, the word means, like air. It means. It means the atmosphere. And if you. The. There's that prothesis ritual, like the, the liturgy before the liturgy, the little thing that the priest and the deacon do to get the gifts ready, prepared. And if you pay attention to the service, they're actually like. It's like. It's the. It's the recreation of the world in Genesis, but it's also the crucifixion and both of those things are happening. So the air is like. That's the. That's the atmosphere."}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":3737.25,"end":3740.57,"speaker":"Jonathan Pageau","text":"That's the air descending dome. The dome of heaven that's placed."}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":3740.57,"end":3771.01,"speaker":"Richard Rohlin","text":"Yeah. So anyway, that's always been super cool to me because, like, when Saint Maximus the confessor says something like, you know, when Christ was on the cross, he was creating the world or like finishing the creation of the world. Right. Like, you actually see that in the prosthesis ritual itself. Like, it's. It's like that's just baked in. And I'm sure nobody did that on purpose, so to speak. Like, it's just like this is what we do. But anyway. Yeah, so. So. But. Yeah, the. The. But the air, like the, the wind descending the air descending the spirit. I mean, that's what the word spirit is. Right."}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":3771.25,"end":3777.33,"speaker":"Jonathan Pageau","text":"We don't. And we don't have to. You know, once you understand that these things are not separated, that."}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":3777.33,"end":3778.5,"speaker":"Richard Rohlin","text":"Yeah. That the."}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":3778.5,"end":3813.14,"speaker":"Jonathan Pageau","text":"The use of the physical. Let's say, manifestation of the deep pattern is not a superstition. Right. It is the uniting of heaven and earth. And so of course, blowing on something is not sufficient. Like, I could. If I blow on. In. If I blow on the. On a cup just out of. In my room, it does not make it the Eucharist. But in the proper context, within the proper meaning structure, you know, in the proper hierarchy, then this physical act becomes the vehicle for the higher pattern, necessarily because that's actually how the world functions."}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":3813.78,"end":3833.04,"speaker":"Richard Rohlin","text":"Just two more instances of air and blowing. Right. So Christ, when he comes to the apostles, when he appears to them after his resurrection, says that he breathes on them and says, receive the Holy Spirit. And of course, the fullness of that doesn't come till Pentecost, which is a weird thing, by the way. Yeah, no, I don't really understand why."}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":3833.04,"end":3869.1,"speaker":"Jonathan Pageau","text":"But it's also to show that, look, folks, the Spirit that the disciples receive from heaven is already the Spirit that makes the world exist. It's like there is a newness to it, but there's also a deep continuity. It's not like this thing that all of a sudden happens. And it is, in some ways, something both new but also a repetition of something that has always been true. So I don't want to say that. Can I say this? I don't want to diminish the reception of the Holy Spirit after baptism, but it is activating something which is true about being human."}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":3869.58,"end":3903.85,"speaker":"Richard Rohlin","text":"So there's an important difference between something being new and something being novel. Like, novel is like, oh, I've never seen this before. Something being new is in the sense of it hasn't decayed, right? You know, like. So it's like you can have something that's. That's. That's new in the sense of. Of its. Like the. We sing in, like, the Paschal canon. Come, let us drink the new vintage, right? This is the new vintage. This is the new wine, right? But it. But it's not like Posca or Passover wasn't around before, right? But this is the. This is the better vintage, right?"}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":3903.85,"end":3907.25,"speaker":"Jonathan Pageau","text":"You know, and it's not like Adam wasn't literally created that way."}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":3907.25,"end":3908.33,"speaker":"Richard Rohlin","text":"Like, exactly."}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":3908.33,"end":3916.71,"speaker":"Jonathan Pageau","text":"It was created by this Holy Spirit, the same Spirit on Pentecost, the one you receive after baptism, going into Adam. And that's actually how humans are made."}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":3917.19,"end":4095.68,"speaker":"Richard Rohlin","text":"So. And that brings me to the other example, which is when we make a catechumen in the Orthodox Church, okay? The priest reads exorcism prayers. And by the way, those exorcism prayers kick all kinds of butt. They're so cool. He reads exorcism prayers and he comes over to the catechumen, and we'll actually do this. Even if it's a baby or an adult or whatever will come over and he'll breathe three times in the face, over the face and breast of the. Of the person who's being received in the shape of a cross. And that breathing is especially with connection to baptism, right? There is a sense of, like God breathing a spirit into Adam, right? But it's also. It's also like a scattering, right? Because it comes with the exorcism. Right. It comes with the exorcism. The whole point of that breath. It does. Like, I don't. Like, there's. There, There's. There's probably like a more intellectual way to explain this. But. Yeah, like, you're just like. It's a. It's a. It's a wind that scatters the demons. Right. It blows the demons out. Like. And, And. And there's something about the. In the context of the. Right. That's being performed in the context of the person who's doing. Who is a priest, who's. Who's, you know, been ordained for the purpose, et cetera. Like. But. But it's. It's just. I mean, that is. To me, that's one of my favorite. That's one of my favorite rights because it's so earthy and, and you get to spit on the devil. And I know that some people are like, oh, the spitting on the devil thing, that probably came later. And, and. And whatever. Like, I don't care. I like it. But anyway, the, The. The, like, there's no way to like, explain this stuff to, to like, a modern person without them, like, feeling like it's superstitious. But more and more, I think people are. Are coming back around to being able to understand the world in this way. And it's, It's. It's the like, for. For a child or for a saint, it's very easy to understand what's he doing? He's blowing the demons away. Right. And then if you ask a stupid person like me, then you. What's he doing? Oh, well, it's like the bread and. And, you know, like, it's symbolism and stuff like this. Like, I have to. I have to, like, couched on all these things. But then, like, basically, you know, it's. But it's both of those things. It's the way. It's the way that the wind works. Right. Great name for like a 70s, like, I don't know, like, Celtic band. Anyway, the. The way that the wind works. It's the. It's the. It's the way that the wind works in terms of. It gives life, but then it also blows things away that shouldn't be there. So, yeah, going back again to like, keeping the flies off the gifts or whatever, which is, you know, this is one of the purposes of, like, the liturgical fans as well. Right. Well, that has nothing. That. That does not in any way negate, like, the symbolism of what's happening on a spiritual level. Like, that's the whole point. Yeah. Somebody's like, this was to get rid of the flies. I'm like, I know, I know, but, like, you know, there's literally a demon called Lord of the Flies. So, you know, you do what you want to with that. But anyway, so I'm rambling now, but."}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":4095.68,"end":4139.7,"speaker":"Jonathan Pageau","text":"No, but this is good. So I think. I think that, you know what, the point I wanted to make before we end is mostly to understand how this is what universal history is universal. It is about this idea, the Pentecost as being the possibility of both multiplicity and unity fully, you know, that everybody hearing the word in their own story, in their own Logos, in their own. The Logos hearing the Logos in their own, Their own lives and in their own traditions, all of this is possible. It doesn't mean that everything is good and that everything is captain. It's all good. That's not what it means, but it means that that possibility is there and that the connection between the two will reveal what is true and what is good about. About the story."}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":4139.78,"end":4178.99,"speaker":"Richard Rohlin","text":"So, yeah, yeah, all right. Everyone's beautiful. It's beautiful like that. And that's why, like, when I started looking, I was like, this is what. This is what we have to talk about, because it's the whole project. It's the whole thing that we've been trying to do, like, all contained in a single story. And I would just tell people, listen, you're going to celebrate Pentecost, actually, whether or not you want to. And the society that you live in is trying to build Babel, right? And you can see what's happening. You can see the scattering coming. So celebrate Pentecost. Be like Noah. Be like. And then, yeah, anyway, that's it."}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":4179.64,"end":4199.56,"speaker":"Jonathan Pageau","text":"All right, everyone. And so, yeah, this is. We're continuing on with universal history. Pay attention. We're coming back, so we'll see you very soon. And everyone pay attention, because as we hinted at earlier, Richard and I are going to go to hell very soon. Actually, we're going to go to hell after Pasca, which is a bit odd."}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":4199.56,"end":4204.4,"speaker":"Richard Rohlin","text":"Yeah, well, Lent was really busy, too busy going to hell in other ways."}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":4204.4,"end":4234.85,"speaker":"Jonathan Pageau","text":"In other ways, exactly. And so. And so we are going to do a first pass at Dante. We're going to go to do the Inferno, you know, we're going to do the Kantos. Go through the Kantos. We're going to give ourselves a lot of time now for each episode to listen to Richard's analysis. But then also I'll do some symbolic interpretation as well with questions. This is going to be a massive symbolic world feast. And so we're definitely looking forward to going to hell with all of you after Pascha."}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":4234.85,"end":4274.21,"speaker":"Richard Rohlin","text":"My favorite thing about Dante is that by the time you get through the comedy, you will have talked about everything. It is in many ways the sort of the apex of the whole universal history project of the Middle Ages. Because Dante leaves almost nothing on the table, he integrates something from everything that came before him, and so it's going to be incredible. I love the comedy, as most people do. I've taught through it several times, so I'm really looking forward to doing this with the Symbolic world community. So that's coming out May the. Sorry, did we already say the date? May 9th. So that's coming out May 9th. And you should be able to sign up for the class on Symbolic World soon. But I think there's already like a."}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":4274.21,"end":4288.13,"speaker":"Jonathan Pageau","text":"Place so you can go to symbolicworld.com and you will find a place where you can sign up so you get the news as soon as we open the class. And so there's already quite a few people in there, so we're excited to see how it comes. So everybody, talk to you soon."}
{"episode_id":"SW - #338 - 2024-05-01 - Richard Rohlin - Universal History - The End of Babel","start":4288.13,"end":4288.81,"speaker":"Richard Rohlin","text":"Bye. Bye."}
