{"episode_id":"SW - #165 - 2021-07-09 - Robert Breedlove - What is Money -","start":12.56,"end":62.15,"speaker":"Jonathan Pageau","text":"This is Jonathan Peugeot. Welcome to the symbolic world. Hello, everybody. I am here with Robert Breedlove. Robert was suggested to me on Twitter. I kind of asked the question who people thought I should talk to in terms of crypto, and his name came up on top. He is the host of the what is Money show that tries to explain this bitcoin to stuff. He has a pass in finance and in crypto and so it seems like he's the guy to go to. And he's already told me that he thinks that there are ways to think about this and to understand this in a symbolic way, with a symbolic lens. So I'm really looking forward to finally diving into bitcoin and crypto with him."}
{"episode_id":"SW - #165 - 2021-07-09 - Robert Breedlove - What is Money -","start":62.47,"end":63.99,"speaker":"Robert Breedlove","text":"Thanks, Jonathan. Glad to be here."}
{"episode_id":"SW - #165 - 2021-07-09 - Robert Breedlove - What is Money -","start":64.31,"end":170.92,"speaker":"Jonathan Pageau","text":"Oh, it's great to meet you. And I'm really looking forward because I have, like, let me just say at the outset, which is that I have a kind of a suspicion about bitcoin and I can't explain. I can't totally explain it. And it probably has to do with my experience, which I kind of related off camera before a little bit with you, which is that I was involved, I wasn't involved. Someone that I trust and that I respect set me up with, with a crypto account which was called Steam was like this attention coin. And, you know, then he kept telling me, you need to. You need to make sure you've got a. Whatever it's called, an account where you exchange it. Got a wallet account. And I didn't know what he was talking about, so I just kind of followed the steps, set this thing up on Quadringa and then I lost everything within a day because the CEO died. We're not even sure. Some people think he pretended to die. So all the money just vanished. And what's been interesting is actually I didn't really get involved in the proceeds of that, but I started getting emails from lawyers about disinterring the corpse and trying to figure out if it was really dead. It was really fascinating just to actually follow how mad and insane the whole discussion got. And I'm noticing all the craziness with dogecoin and just how mad it is in terms of almost like a meme coin, which is happening. So all of that is making me wonder what the heck is going on. And also I'm trying to grasp, to understand and try to be as open and as positive as possible to try to understand what is going on. So hopefully you, you can help to shed a light on what crypto is and what bitcoin Means in terms of symbolism. The big task that I'm putting on."}
{"episode_id":"SW - #165 - 2021-07-09 - Robert Breedlove - What is Money -","start":170.92,"end":173.6,"speaker":"Robert Breedlove","text":"Your plate there, Robert, no pressure at all."}
{"episode_id":"SW - #165 - 2021-07-09 - Robert Breedlove - What is Money -","start":173.68,"end":174.48,"speaker":"Jonathan Pageau","text":"No pressure."}
{"episode_id":"SW - #165 - 2021-07-09 - Robert Breedlove - What is Money -","start":175.04,"end":327.46,"speaker":"Robert Breedlove","text":"I think you're drawing attention to one of the main elements of this crypto asset space, which is we have Bitcoin and then we have everything else and everything else, especially right now, we're in a bull market. So Bitcoin is increasing in price. Everything else is correlated to Bitcoin. So it's increasing in price that creates a lot of noise and confusion. It draws in a lot of new people and capital and attention and you get this confluence of just false narratives, I guess you would say. So. The one you mentioned, Steam, that was intended to be a decentralized social media tool, I believe. And it's okay, it's a good theory, it's good on paper, but it doesn't have any market proven utility. So for instance, the last time we were in a bull market, it tends to run in four year cycles. So this was 2017, there were people just putting up a website, a white paper, a few pictures of advisors, and they would go and raise $30 million worth of Bitcoin and Ethereum in five minutes. It was the fastest and most rich capital raising environment probably in the history of humanity. You can literally just put up a website and raise a ton of money. So in this world, the way I like to distinguish between them is that we have Bitcoin, which is this innovation akin to the Internet itself in many ways. You can think of it as the latest layer in the Internet protocol suite. The Internet evolved in layers. Some of them you're familiar with, HTTP, tcp, ip, et cetera. Essentially it's a layered protocol for moving information without permission across space and time. But the one thing that it lacked was the ability to move value, economic value, across space and time without permission. That's what Bitcoin adds to the Internet. So bitcoin, it fits right on top of the Internet. It is part and parcel of it. All of these other coins, people call them altcoins. More pejoratively, people call them shitcoins. They are essentially copying the code of Bitcoin and trying to use it to either compete with Bitcoin directly as money or to disintermediate other marketplaces. So the line that I draw is I say Bitcoin is the Internet. All other altcoins are liquid venture capital subjected to little if any due diligence."}
{"episode_id":"SW - #165 - 2021-07-09 - Robert Breedlove - What is Money -","start":329.14,"end":376.73,"speaker":"Jonathan Pageau","text":"That's also part of the Internet, isn't it though? That's part of what the Internet also is. This There is an aspect of the Internet, there is the dark web, but not necessarily just the dark web, but just this kind of madness of, of information. Right. The idea that because everything is so decentralized, the lack of authority means that multiple narratives can fragment indefinitely. And because you don't have an authority structure, you don't know what's real and what's not. You don't have a way to legitimize something, even a business online. It's hard to know. How do you legitimize, you see someone selling something online, how do you legitimize this transaction? It's hard to know."}
{"episode_id":"SW - #165 - 2021-07-09 - Robert Breedlove - What is Money -","start":377.53,"end":464.79,"speaker":"Robert Breedlove","text":"Yeah, that's a great point. That information itself suffers from unlimited replicability, can be replicated at infinitum. So it's hard to find source of truth in the digital world. And that's another thing Bitcoin has done. It's established a proof of work money, which means it's a money premise on sacrifice. So it actually brings quite a qualities of physical reality like final settlement, which is very important to money into digital reality. You hear this term thrown around a lot, blockchain, crypto assets. It's the only market proven use case for blockchain is Bitcoin. Everything else is just again, venture capital. It's just an idea. And so I think it's very important to distinguish between the two and the other. The other bright line between them is that Bitcoin is the only money in the world that no one can control. You could say gold fit the bill. Historically, that's why gold was selected as money. It was an apolitical money that no one could artificially increase the supply of. So it was a reliable store of value. Bitcoin has now become that for digital space. Whereas all of the other altcoins are controlled by someone, whether it's a developer community, an executive board or anything else, they have not achieved this critical property of decentralization that's really important to the power structure of money."}
{"episode_id":"SW - #165 - 2021-07-09 - Robert Breedlove - What is Money -","start":466.07,"end":472.91,"speaker":"Jonathan Pageau","text":"So the idea is that bitcoin by its own process, it's controlled by its own reality, let's say."}
{"episode_id":"SW - #165 - 2021-07-09 - Robert Breedlove - What is Money -","start":472.91,"end":473.99,"speaker":"Robert Breedlove","text":"Or its own. That's right."}
{"episode_id":"SW - #165 - 2021-07-09 - Robert Breedlove - What is Money -","start":475.75,"end":484.58,"speaker":"Jonathan Pageau","text":"No one can clamp down and decide how many Bitcoin there are. It's part of the very process of Bitcoin to lay itself out on its own, let's say."}
{"episode_id":"SW - #165 - 2021-07-09 - Robert Breedlove - What is Money -","start":484.9,"end":620.72,"speaker":"Robert Breedlove","text":"Yeah, there's this path dependent emergence that Bitcoin's gone through where it was released as the first of its kind into the world. It was the first and only crypto asset. It was considered a joke Initially by most people, they just thought it was a joke, which gave it time to grow organically and gave its mining network and developer community time to grow organically, gave time for its rules to ossify. And now it's a trillion dollar market and for all intents and purposes, there's no way to stop it or disrupt it. The other thing that is important is that it's perfected the properties of money. So these other coins that are claiming to be better in one way or another, they don't actually address the five properties of money, which are divisibility, durability, recognizability, portability, scarcity. So Bitcoin has essentially taken all of the properties that make money good and perfected them. And so Satoshi, in doing that, he left no design space left for another crypto asset to come and disrupt Bitcoin. Just to talk back to your particular circumstances where you got knocked over on the exchange, that's another area of common misconception. People hear about all these exchanges getting hacked and all these scams and people launching these coins and disappearing with the money and they conflate all of that with Bitcoin. They think Bitcoin is getting hacked, they think Bitcoin is stealing their money. And it couldn't be further from the truth. Bitcoin is operated with perfect fidelity. Over 12 years, it's grown already to be the most secure computing network in human history. Never been hacked, there's never been any unexpected inflation, no double spending. But everything else in and around the space is the scammiest, dirtiest space in the world. So it's hard for people, I think, to disentangle the two. We have this world shattering innovation that's disruptive to gold. Gold's a tool we've been using for 5,000 years as money. There's a 12 year old digital disruptor emerging against gold, but it's surrounded in this cloud of scams and people trying to just get rich quick schemes. I guess people are peddling."}
{"episode_id":"SW - #165 - 2021-07-09 - Robert Breedlove - What is Money -","start":621.3,"end":634.66,"speaker":"Jonathan Pageau","text":"So what is so what? So when you say that it's never been hacked, it's never been, you know, what is it about the system which makes it that way? Like what is there which makes it impervious to these problems?"}
{"episode_id":"SW - #165 - 2021-07-09 - Robert Breedlove - What is Money -","start":634.98,"end":839.15,"speaker":"Robert Breedlove","text":"It's really, it's a beautiful composite of design and incentives. So on the design side, it's a very simplistic set of computer code really just designed to do two things, which is create a new block of transactions every 10 minutes and maintain a supply cap of 21 million. So it's the first asset in human history we know has an absolutely fixed supply. It's an incorruptible money. It's a money that no one can change. There's a bit of a rabbit hole there, but it's essentially the corruption of the money has been the chosen attack vector for all state powers throughout history. They always clip the coins, they always inflate the bills. It's free money. It's this temptation that no one has ever been able to resist. And for the first time in history. And gold was great at that historically, because no one could just artificially increase the supply of gold. But once we abstracted gold into paper currency, people started to manipulate gold as well. And central banking. Today, they own about 20% of the gold supply and corrupt the world by. By doing so. Bitcoin is this emergent, incorruptible monetary base layer for human organization. And it's something unlike we've ever seen. And the incentive side to it. And it takes a bit of time to get your head around it. But bitcoin essentially incentivizes everyone who interacts with it to operate in its favor. So if you're mining bitcoin, you're expending energy to secure the network, and you're being paid in Bitcoin. If you're buying or selling bitcoin, you have a money that is becoming increasingly scarce over time, so its supply is diminishing. So, for instance, in the past 12 months, we've been producing US dollars for 108 years. In the past 12 months, one out of every $3 in existence was produced in the past 12 months. So whereas the US dollar inflation rate is going absolutely parabolic, Bitcoin's doing the opposite. Bitcoin becomes harder to produce over time. So therefore, the dollar price of bitcoin becomes more expensive over time. The simple way I like to say it is that Bitcoin is an insurance policy on central banking. The more dollars that we print, the more valuable that insurance policy becomes. Mm. So that's what makes it interesting, is that Bitcoin has incorporated human nature or Darwinian self preservation as one of its core operating components. That it's actually incentivizing you to secure its network, incentivizing you to hold it, and incentivizing you to sell your dollars and buy it. So you can think of it as like this vortex of incentives that no one has figured out how to stop. And traditionally, when these networks, just using Facebook, Apple, Amazon, Netflix, Google as a proxy, when these Networks get above 100 billion in market cap. They're pretty much unstoppable. Bitcoin's already 10 times that size. Bitcoin's a trillion dollar market today. So it appears that it is one of the most significant innovations of our lives, possibly even bigger than the Internet itself."}
{"episode_id":"SW - #165 - 2021-07-09 - Robert Breedlove - What is Money -","start":839.83,"end":905.37,"speaker":"Jonathan Pageau","text":"All right, so one of the things that, because I've been thinking about this, trying to figure it out, because obviously I don't understand the technical aspects of it and I probably never will, which might be fine. One of the things that makes something valuable, like you name the five aspects of money, and what was surprised to me that I didn't hear in that is something like trust. Because trust is something which is beyond the system. And trust is responded like in a monetary system. In a traditional monetary system, trust is related to authority. That is, I trust in the money system because I recognize the authority. That's why there was a stamp of the king on the coin, is because the stamp of the king tells me that this is what it says it is and that this has value, let's say. And so one of the things that happened with Bitcoin in the past 20 years is that at some point it dropped to nearly nothing, right? There was a massive crash."}
{"episode_id":"SW - #165 - 2021-07-09 - Robert Breedlove - What is Money -","start":905.85,"end":911.61,"speaker":"Robert Breedlove","text":"I don't remember what year it's been, through four market cycles of giant run up and giant crash."}
{"episode_id":"SW - #165 - 2021-07-09 - Robert Breedlove - What is Money -","start":913.21,"end":945.99,"speaker":"Jonathan Pageau","text":"And so to me, that those extremes, although I can understand that they're maybe not as bad as those other cryptos that you talk about, like these kind of crap coins or whatever you call them, it seems like the fact that it doesn't have authority, that in a moment of panic then it can become nothing. It can go from everything to nothing. I don't know if that makes sense, that it doesn't have meaning. It doesn't have meaning. It doesn't participate in a web of meaning."}
{"episode_id":"SW - #165 - 2021-07-09 - Robert Breedlove - What is Money -","start":947.27,"end":1094.6,"speaker":"Robert Breedlove","text":"So the trust factor of money, I would argue it actually coalesces to those properties. So the very nature of value itself is value is the relevance of a thing to our goals. Whatever closes the gap between my wishes and their fulfillment is valuable to me. Anything that blocks that process is destructive to value. Anything that is irrelevant is just valueless. So value is this inherently subjective quality of existence, quality of being. And we look at the world through a lens of value. Things to us are either obstacles or tools getting us on our way or blocking us along that path. So historically, gold was the tool that best satisfied those properties of money. And that's why over an entire history of entrepreneurial experimentation, the free market selected gold as money. It was the most divisible, durable, recognizable, portable and scarce thing in the world. So we could say gold earned the trust of market participants without any authority being involved whatsoever. I mean, you could say the authority of God, perhaps. Gold was governed by the laws of chemistry and nature, such that its supply could not be artificially increased. It's essentially indestructible. So it had a very high stock to flow ratio, which is another way of saying it did not inflate quickly. Its supply increased about 2% year over year. So if you parked your wealth in gold, you knew you could trust, you had a lot of confidence that your wealth would only be inflated about 2% every year. No matter what anyone tried to do, no matter what law, government passed, or anything that happened in the sphere of politics and human affairs, nothing could change that. So it was a trusted base layer. So I don't think authority, and that would be my point there with gold, is that you don't need authority to establish trust. What you need is time and experimentation, right? What tool solves the aim for people? And the aim with money is to move your economic value or wealth across space and time. So what holds its value across time? That's what's first and foremost. And then secondly, what can be used to transact that value across space with other market actors?"}
{"episode_id":"SW - #165 - 2021-07-09 - Robert Breedlove - What is Money -","start":1096.68,"end":1102.59,"speaker":"Jonathan Pageau","text":"One of the things gold has that Bitcoin doesn't have is that you can use gold to make a crown."}
{"episode_id":"SW - #165 - 2021-07-09 - Robert Breedlove - What is Money -","start":1104.75,"end":1104.99,"speaker":"Robert Breedlove","text":"You."}
{"episode_id":"SW - #165 - 2021-07-09 - Robert Breedlove - What is Money -","start":1104.99,"end":1108.31,"speaker":"Jonathan Pageau","text":"Can use gold to make an altar, or you can use gold to make."}
{"episode_id":"SW - #165 - 2021-07-09 - Robert Breedlove - What is Money -","start":1108.31,"end":1112.67,"speaker":"Robert Breedlove","text":"A throne, which actually marginalizes its monetary."}
{"episode_id":"SW - #165 - 2021-07-09 - Robert Breedlove - What is Money -","start":1112.67,"end":1125.71,"speaker":"Jonathan Pageau","text":"Use case, I would say, because dedicated to something higher. That's one of the reasons why I'm saying that that's how it gets its authority. Because it's shiny and it gets dedicated up or it gets offered to God."}
{"episode_id":"SW - #165 - 2021-07-09 - Robert Breedlove - What is Money -","start":1125.71,"end":1201.9,"speaker":"Robert Breedlove","text":"You could say, so this is correct, this is how gold. So another way to understand money. And by the way, this is why the show is called the what is Money show, because this question has a million answers. Money, another definition of money is that it is the most exchangeable or tradable or liquid asset in a trade network. So if you go into a prison today, very often they use cigarettes as currency. That's just the most tradable asset that they have access to and it best satisfies those properties. So it is money in that trade network by definition. So gold emerges as the most tradable thing because it satisfies those properties. But it was only ever traded in the first place because it had industrial use. Making a crown, building an altar, jewelry Dental electronics, whatever this is. And still today, gold has a market cap of like $10 trillion. About 10 to 20% of that is its industrial use. So it's its use as non money. Anything gold can do that's non monetary. There's a demand for that. So we could say the entire configuration of demand for gold is part industrial or utility use and part monetary use. And in that lens."}
{"episode_id":"SW - #165 - 2021-07-09 - Robert Breedlove - What is Money -","start":1203.74,"end":1228.05,"speaker":"Jonathan Pageau","text":"It has a story use like a mythological reality. Like it's the head of the statue of Nebuchadnezzar. It's the, you know, it's the, the first age is the golden age. It's the, it has, it has a memory like in terms of, of humanity that we can't get rid of. Like people think, like I've heard people say things like if we all agree that gold wouldn't be worth anything, then it would. That it would stop. That's not how it works."}
{"episode_id":"SW - #165 - 2021-07-09 - Robert Breedlove - What is Money -","start":1228.29,"end":1228.61,"speaker":"Robert Breedlove","text":"Right."}
{"episode_id":"SW - #165 - 2021-07-09 - Robert Breedlove - What is Money -","start":1228.61,"end":1243.85,"speaker":"Jonathan Pageau","text":"Because that memory is deeply ingrained in, in all of our stories, from all the fairy tales, all our myths, all their stories have that say something like gold, silver and the other precious metals as part of a collective memory."}
{"episode_id":"SW - #165 - 2021-07-09 - Robert Breedlove - What is Money -","start":1243.85,"end":1294.82,"speaker":"Robert Breedlove","text":"You could say, yes, absolutely. They have been proven over time to serve this purpose. But with that process, you have a bivalent money. Money that's part used in industry and part used as money. And through that same lens, this is another reason why bitcoin is radically new. And I liked you talked about the virgin archetype in one of your podcasts recently, where the virgin is something that is purely dedicated to one purpose. It's untainted by any other purpose. It has one sole focus. Essentially. Bitcoin is the first virgin money. It's the only money that is. All of its market capitalization is for its monetary use. Case, you cannot make a crown out of bitcoin. You cannot make a throne or put it in your teeth or whatever."}
{"episode_id":"SW - #165 - 2021-07-09 - Robert Breedlove - What is Money -","start":1294.82,"end":1298.18,"speaker":"Jonathan Pageau","text":"Yeah, it's close to pure potential, you could say as close as possible."}
{"episode_id":"SW - #165 - 2021-07-09 - Robert Breedlove - What is Money -","start":1298.34,"end":1325.54,"speaker":"Robert Breedlove","text":"It's the most purified monetary technology that has ever existed. It's perfected all the properties of money and it has no alternative use case whatsoever. To get back to your point on coinage, coinage actually emerged initially as a private business function. So when people would trade with gold, you needed to weigh the gold, you needed to say it, you needed to make sure it was authentic."}
{"episode_id":"SW - #165 - 2021-07-09 - Robert Breedlove - What is Money -","start":1325.94,"end":1328.66,"speaker":"Jonathan Pageau","text":"Trust. Trust that it was real. The real thing."}
{"episode_id":"SW - #165 - 2021-07-09 - Robert Breedlove - What is Money -","start":1328.9,"end":1352.93,"speaker":"Robert Breedlove","text":"Exactly. You needed to make sure it wasn't lead coated in gold, et cetera. So every time you exchanged gold, you had to go through this time intensive process that increased transaction Cost and was a friction to free trade. Basically, in comes the coinage function where a private certifier would instead stamp these gold coins, saying, you can trust this stamp because you trust me."}
{"episode_id":"SW - #165 - 2021-07-09 - Robert Breedlove - What is Money -","start":1353.17,"end":1354.97,"speaker":"Jonathan Pageau","text":"You trust me so you can trust this stamp."}
{"episode_id":"SW - #165 - 2021-07-09 - Robert Breedlove - What is Money -","start":1354.97,"end":1422.37,"speaker":"Robert Breedlove","text":"That's right. You're replacing the reputation of the coinage issuer with the need to say the gold. And if it's ever incorrect, then you go after the coinage issuer. Well, that issuer became more and more centralized and controlled by the state over time in almost every society around the world. And that's why we always end up with these smug emperor or dead president faces on all of our money. They're trying to actually insert belief or trust in the state as being the bearer of that Commonwealth. But what they've actually done is just commandeer a free market function. And again, to look at Bitcoin through that lens, you run your own node. That's why you run your own node in Bitcoin, which means you're running your own independent history of Bitcoin with every transaction. So you don't need to trust anyone. You are your own central bank, if you will, or your own coinage issuer. You can verify with 100% certainty and 0% trust that the Bitcoin you are receiving is in fact, authentic Bitcoin. Yeah. And that's a game changer as well. Yeah."}
{"episode_id":"SW - #165 - 2021-07-09 - Robert Breedlove - What is Money -","start":1422.37,"end":1531.54,"speaker":"Jonathan Pageau","text":"And I think it's like, I get it. I understand, like, the image you use of the idea of the virgin and also the notion that money is, in a way, potentiality. Right. It's the dissolution of your goals. It's the dissolution of your goals, whether it's buying something, objects or services or whatever, into a potentiality that you can then redirect towards different things. That's what money seems to be, especially in the modern world. And so this is, to me, like, this is the key that I was trying to get to before, and you probably won't agree with me, but it seems like the fact that that's what it is means that it's either everything or nothing. That it's either. That it's either it will have, it will. Like you said, it'll reach massive amounts of value or it will be worth nothing because it doesn't participate, doesn't have a kind of gritty hierarchy in it, which is the goal. Like you said, the gold is not pure value in the sense of pure potential. It also can be used to make things. And so because of that, it's like, worst comes to worst, worst comes to worst. If I have an Iron bar, it has a value, but I can also use it to make a sword. I can use it to make something. If I have a stack of wood, it maybe will never be worth as much as bitcoin, but I can use it to make a cabin. Whereas if bitcoin, because it's just pure value, that seems to me at least to account for its huge up and down. But I mean, what do you think? Do you think that now that there won't be another down or it's just going to keep going up?"}
{"episode_id":"SW - #165 - 2021-07-09 - Robert Breedlove - What is Money -","start":1532.02,"end":1666.49,"speaker":"Robert Breedlove","text":"Well, so I guess first of all, to speak about the volatility, Bitcoin has been through four, as I mentioned earlier, four of these price cycles. So just a quick history, I guess from mid 2015 to late 2017, Bitcoin went from $200 to 20,000. So it did a 100x in two and a half years. It then came down 85% over the course of a year to 3,500. So now we're in another bull market. It's close to around 60,000. So it's up 20x off of that low, roughly. And we would expect this bull market to peak somewhere later this year. But this volatility is occurring, volatility itself. I've said that volatility is truth, so that we say the universe is pervaded by entropy. Everything's changing, everything's tending towards increasing disorder with these little pockets of order here and there. That is expressed as price volatility in the marketplace. Bitcoin is the fastest growing asset in human history. Today it's gone from $0 in economic value 12 years ago to $1 trillion in economic value today. That path could not possibly be linear. It's been driven by its having cycle. So every four years, the new supply issuance of bitcoin gets cut in half. And if you just hold prices, supply and demand. So if you're holding demand constant and you cut supply in half, what happens to price? Price gets a lot of upward pressure and it tends to overshoot. Right. Maybe its actual value, you could say, which is, say, let's define price as an appraisal of value. Say value is tracking some fundamental utility of bitcoin as money, whereas its price is just what it's trading for in the marketplace. So as its value increases over time, its price is overshooting and undershooting that value along the way. That is the volatility of bitcoin. And it does. The other thing to that point is this is true of all assets. This is not just bitcoin yeah, but."}
{"episode_id":"SW - #165 - 2021-07-09 - Robert Breedlove - What is Money -","start":1666.73,"end":1668.65,"speaker":"Jonathan Pageau","text":"Not to the levels that we're seeing."}
{"episode_id":"SW - #165 - 2021-07-09 - Robert Breedlove - What is Money -","start":1669.29,"end":1715.57,"speaker":"Robert Breedlove","text":"Amazon's more volatile, been more volatile than Bitcoin. In its early years, Amazon drew down 94% the dot com bust. It had double digit drawdowns every single year. The past 20 years it's up 45,000% off its lows. So volatility and market cap are inversely proportionate. And this also applies to Bitcoin. So the bigger Bitcoin is becoming, the less volatile it's becoming over time. But this narrative, by the way, is being pumped so hard by mainstream media. Bitcoin is a Ponzi scheme. Bitcoin is too volatile. It is blasting from every channel on mainstream media. But it's just, I would argue, these media channels that are controlled and serving the interest of central banking, propagandizing against a technology that is disruptive to their business model."}
{"episode_id":"SW - #165 - 2021-07-09 - Robert Breedlove - What is Money -","start":1715.99,"end":1903.91,"speaker":"Jonathan Pageau","text":"Yeah, so here's the question. So like, here are a few questions that I've got when I, when I, when I, like when I'm hearing what you're saying. And so there are two things that come to mind. One is so, so for example, one is the problem of the Internet and the problem of this, this potentiality. So one of the things that happens when something presents itself as a wild potentiality, you know, and the Internet is an example of that. Where the Internet presented itself at first and still a little bit now as infinite possibility, right? No borders, no authority, you know, total almost anarchy of discussion, anarchy of possibility. Anything can happen, anything is possible. And that was, that's kind of how it was presented to us right, in the late 90s. And now we could say the opposite of that. We could say the Internet is the system of control, the most total system of control that has ever been invented in human history. That social media, these systems that are out there are able to read your thoughts, are able to predict your movements, know everything that you're going to do, everything you're thinking, and are trying to direct that ideologically in ways that has never happened in the entire history of humanity. Right. And so what I'm trying to bring about is that the idea of like pure potentiality, what it calls for, it's almost like it's calling for a master. And so it's like if you, the real world is like a balance between potentiality and actuality. Like the real world is this kind of this ebb and flow, this like normal masculine, feminine, this, these, these, this kind of relationship between opposites. But when you present something which is like chaos, then it's it's like it's asking, it's not, it's creating a tantalizing thing for order to kind of clamp down upon. So it's kind of like a riot. A riot. What comes after a riot is police. And not just regular police, riot police that come with guns and with, with things that they usually don't use. Right. If anarchy breaks out, then more authority is put on it in order to clamp it down. And so you could say you don't like that, which, whatever, doesn't matter, it's still going to happen. Right. Because it's almost like it's part of the system. And so when I look at what's going on with crypto, it's weird, like my intuition and I may be wrong because I don't understand the technical part of it. But when I look at what's happening with crypto, I see, I intuit that there's also a movement towards a hyper controlled world currency that will be a totalizing currency and that if you don't use that currency, you won't actually be able to trade at all. And so it's not right now, it's not here, it's not totally there, but it's like there's an intuition that I have that I can see it on the horizon. Just like I could see in the Internet even 10 years ago. I could see that this is moving towards a system of control."}
{"episode_id":"SW - #165 - 2021-07-09 - Robert Breedlove - What is Money -","start":1905.51,"end":2176.58,"speaker":"Robert Breedlove","text":"Yeah. First, on the topic of free speech, the Internet promised to be this great democratizing force, giving all of us the ability to just exchange ideas freely, which in a lot of ways it's given us many tools to that effect. But it's also been monopolized. These platforms are controlled. We have the emergence of data monopolies, the Fang stocks, et cetera, that monetize our data and our attention. Bitcoin, there's a promise in Bitcoin and this hasn't completely emerged yet. But because Bitcoin is an immutable protocol on the Internet stack, there is the possibility now and we're already seeing it at higher layers in both what's called the Lightning Network, which is a layer on top of Bitcoin, and applications built on the Lightning Network, particularly one I'm thinking of called Sphinx Chat, that enable unstoppable free speech and social media tools. So you can actually anchor these tools into the Bitcoin blockchain such that they cannot be censored. Let's just say on the horizon is this glimmering hope of an uncensorable Internet built on top of bitcoin. So that's one great feature that's still kind of on the horizon, but possibly emerging. I would argue too that bitcoin, it actually introduces a disciplinary force to the chaos of the Internet. That's actually why proof of work was originally invented. It was invented to inhibit email spam. So instead of just spamming every email address in the world with countless solicitation or marketing or scam emails, this system of proof of work created a mechanism by which each one of those would cost you just a little bit, so that it would really disincentivize spam. So it would incentivize. It gives people that want to communicate via the Internet, it gives them skin in the game. There's a cost associated with their communication. So therefore their communications become more authentic and honest. So I think bitcoin can introduce that to the Internet by actually forcing, by making messages uncensorable, but also causing, allowing people to be able to gate what they receive and then also force people that want to communicate to pay up. Basically reduces spam. And then I would say that your intuition on the movement towards one world, totalitarian or authoritarian currency is very likely. I think that race has already begun between China, the US and the extension of the US which are the IMF and the World Bank. They are racing to have a countermeasure against Bitcoin because Bitcoin is perfect. I'll use perfect in quotation marks because nothing's perfect, but it's perfected the properties of money. It's disrupting gold and with it their institution of systemized time theft, which is the central bank. We hear about all this money in the world being printed. Very few of us understand that no new wealth is being created as a result of printing that money. We're just shifting the claims on capital from one set of hands to another. So it's systemized theft at scale. Central banking is at best a misguided institution, at worst, it's the greatest criminal enterprise in human history, yet no one's talking about it, no one understands it. It's above politics, by the way. Politics is the puppet show that central banks put on to distract us from the truth. And I would say that the countermeasure that they do take against Bitcoin, whether it's the IMF or the Fed Coin or whatever it may be, there's going to be a money that's forced upon us. They're going to cancel physical cash. They're going to say you have to turn in all Your physical cash to get us Fed coin. And that money will live inside a walled garden. And they can turn it off, and they can turn it on. They can choose what you spend it on. If they don't like what you're saying online, they could turn off your money completely, will move into this world of something much more like a China social credit score system, where if you're not playing friendly with the state's ideology, they will dial up or dial down your ability to use money, travel, everything. And in that world of this Orwellian world of total censorship and control, I think bitcoin is the only answer. It's a money that no one can control, no one can censor, no one can weaponize, right. To steal from others. So that's the big battle here. It's a battle between authoritarianism and the free market."}
{"episode_id":"SW - #165 - 2021-07-09 - Robert Breedlove - What is Money -","start":2177.46,"end":2265.74,"speaker":"Jonathan Pageau","text":"So the image of bitcoin and the image of crypto, I guess, is a. Like, it is, in a way, a stampless currency. Like, it doesn't have the stamp of authority. It really is this kind of. It's dark in the good and bad sense, right? In the sense that you can't know. If you have bitcoin and you have it, like you said, then you've got it. That's it. No one can take it from you unless they actually take the number, like your whatever, code or whatever. I don't know how it works, but whatever it is that they would physically steal from you, once you've got it, then you've got it. So because it's dark, it has a negative aspect in the sense that you don't know who owns the bitcoin, right? And so what happens in 10 years when all of a sudden we discover that the Chinese government and the central banks actually own 85% or 90% of Bitcoin? And we didn't know, but now we find out because we don't know who owns it. Couldn't the bitcoin itself, because it's those who own it who will have power. So what's being set up is like a secret elite of power that we don't know who it is. There's this massive amount of value that exists in the dark, and we don't know who has it. What happens when we discover that it's actually the same agents that we want to get away from that actually own the most of bitcoin?"}
{"episode_id":"SW - #165 - 2021-07-09 - Robert Breedlove - What is Money -","start":2267.1,"end":2271.82,"speaker":"Robert Breedlove","text":"I think it's pretty unlikely that they could ever own 85 to 95%."}
{"episode_id":"SW - #165 - 2021-07-09 - Robert Breedlove - What is Money -","start":2271.82,"end":2274.18,"speaker":"Jonathan Pageau","text":"I don't know. I'm just saying a number the only."}
{"episode_id":"SW - #165 - 2021-07-09 - Robert Breedlove - What is Money -","start":2274.18,"end":2402.4,"speaker":"Robert Breedlove","text":"Way they could do that is you'd have to monetize the central bank balance sheets into Bitcoin. So Bitcoin's market cap would be $100 trillion or more. So in that event, if you're holding Bitcoin, you're going to be wildly rich again. Although it's unlikely if that happened, it's still a better outcome for humanity, because the core premise here is that the integrity of the money supply and the integrity of society are inexorably linked. If the money supply can be violated and changed arbitrarily, then social cohesion can collapse. And the extreme example of that is just hyperinflation. Look what's going on in Venezuela today. Talk about having no meaning. The money literally has no meaning. It's in the gutters, it's in the streets. People are pushing around in a wheelbarrow trying to buy a loaf of bread. The money has been inflated into worthlessness. So it's this concept of unexpected inflation that is positively correlated to a breakdown in social cooperation. Bitcoin's the only money in history. This is again what it optimizes. For a hard cap of 21 million, it has 0% unexpected inflation. When you understand you get past the central bank euphemism that inflation is necessary for a healthy economy, you realize that it's just purely theft integrated into the money. This is the only way to optimize trust in a society. So we're moving from trust and authority to trust and self interest. That's what Bitcoin does. It's. You're trusting the self interest of every other market actor. And what else is there to trust in a Darwinian world other than self interest? You have to trust that everyone's going to operate in their own self interest, like the free market that paradoxically creates these selfless outcomes from individual pursuit of self interest. Bitcoin's the same. It's a free market money that I, by choosing to hold my Bitcoin and secure my wealth independently and verify my wealth independently, I'm actually voting against this system of time theft that the central bank represents and therefore voting for something more positive for humanity."}
{"episode_id":"SW - #165 - 2021-07-09 - Robert Breedlove - What is Money -","start":2402.56,"end":2504.72,"speaker":"Jonathan Pageau","text":"Yeah, how can I say this? It's like I understand it because I also think that the monetary system, the way it's been set up in modernity and the way that it's been created completely taken away from a standard and it's just total speculation. I think that's an insane thing. It's an insane thing that is leading us to catastrophe. But Nonetheless, the arbitrariness of bitcoin in the sense that. Okay, so let's say I don't like the fact that states rule over me and that the states have this power. But I would prefer that the state rule over me and have power than some shady person that I don't know who that person is and has massive amounts of bitcoin. Imagine a world where bitcoin replaces money. That means that all of a sudden these shadowy actors are going to start to appear as being the most powerful. And it's going to be purely arbitrary. It can be totally arbitrary. It's not going to be someone who built a network or built. I can hate Jeff Bezos all I want, but he built a real thing, like a company and he built this thing. I can hate the. I can hate the government of a country, but they run the roads and they run this system. Whereas this is what I was trying to bring up before. It's like in bitcoin, what you have is a shadowy elite that is hidden. We don't know who these people are. And if it replaces money, I'm not sure that would be the best outcome for humanity. Because all of a sudden they're going to start to appear. We don't see them now, but at some point they're going to start to show themselves when they become the most powerful people in the world."}
{"episode_id":"SW - #165 - 2021-07-09 - Robert Breedlove - What is Money -","start":2506.16,"end":2513.36,"speaker":"Robert Breedlove","text":"One thing there is. Who do you think runs the central banks today? There's already a shadow elite that runs. Yeah, you're right."}
{"episode_id":"SW - #165 - 2021-07-09 - Robert Breedlove - What is Money -","start":2513.84,"end":2514.96,"speaker":"Jonathan Pageau","text":"Trade one for another."}
{"episode_id":"SW - #165 - 2021-07-09 - Robert Breedlove - What is Money -","start":2515.28,"end":2625.33,"speaker":"Robert Breedlove","text":"Well, here's the key difference. The current shadowy elite control the rules that govern money. They want to steal more from everyone, print more money. They want to deauthorize people. It is a totalitarian regime. Whereas even if you gave those same individuals, if you just switched out their current system for a bitcoin system, they would no longer have control over the system. They can't change the rules of bitcoin. Bitcoin is a game with unbreakable and unchangeable rules. And therefore it incentivizes people to adopt long term peaceful cooperation as the optimal strategy. Because you can't steal from one another today. A great strategy to get wealthy today in the US is to get as close to the fiat currency printing press as possible. Get a buddy in politics or get some favorable regulation or get a bailout or get a PPP loan or whatever. It's a great way to get free money and steal from everyone else. None of that is possible on a bitcoin system. You can't Change it. You can't bail it out, you can't manipulate it in any way. So I would argue, and this is a tricky perspective shift, is that we actually have to look at the systems we're pouring ourselves into. I think our personalities and our characters are emergent properties of the incentive structures we are operating within. And right now we're operating within a flawed incentive structure which is like we can just print money and steal from everyone else that's forced to use the money. And this perverts morality, this perverts social cohesion and it leads to civilizational collapse. If you just look across history, every civilization there's ever been, they break the money and then they collapse the same pattern repeatedly. So we need a money that cannot be corrupted and bitcoin is the only thing that exists that can't be corrupted."}
{"episode_id":"SW - #165 - 2021-07-09 - Robert Breedlove - What is Money -","start":2626.21,"end":2695.97,"speaker":"Jonathan Pageau","text":"I mean, I need to think about it. I definitely need to think about it. I think that you've helped me at least understand what it is, understand what's going on, understand what it is. I think, how can I say this, I remain with the two questions, not the questions, but the two issues I have in terms of actual value and how actual value appears in terms of these extremes of price. And we'll see what's going to happen. Because like you said, I think the reason why I don't object to it completely, let's say bitcoin, is because I can see, like you said, how insane our authorities are acting, just how mad the system is right now and how it does in fact seem to be heading towards some kind of collapse which will be recuperated into a more totalitarian system. But I'm not sure in a real collapse, in a real collapse, would bitcoin continue to have value?"}
{"episode_id":"SW - #165 - 2021-07-09 - Robert Breedlove - What is Money -","start":2696.69,"end":2871.43,"speaker":"Robert Breedlove","text":"Well, it all depends on first of all, like we saw in March 2020, in the short run, everyone runs to dollars and treasuries still, that's still the safe haven asset in the world, or gold even. But after that shock, central banks respond by printing more money. So what we see with bitcoin. Bitcoin collapsed March 2020 down to $3,800. And now it's grown 20x roughly in the 14 months since. So again, it's all about this ratio of how many dollars, the rate of production of dollars, the ratio of that to the rate of production of bitcoin. That's what drives the price of bitcoin. So if we have these short term economic shocks, Bitcoin can suffer. But then on the backside of that, Bitcoin is going to expand a lot as we print more dollars. And just to answer the one last point of your question before was Bezos is a great example, an amazing entrepreneur. He's created so much additional productivity for the world. That's why he's rich. We can strip out some of the arbitrage, maybe where he skirted state taxes and a few of these things because he's operating with a digital network versus a physical network. But overall, that's what entrepreneurship is. It's people going out into the world, solving problems, selling those solutions into the marketplace. Everyone benefits as a result. We become more wealthy and more productive as a result. On a bitcoin standard, where I said earlier, there's a lot of strategies related to getting near the fiat currency spigot to get wealthy on a bitcoin standard, all you can do is be an entrepreneur. That's the only way you can earn money. You can invest intelligently or you can go out and solve problems for humanity. So I think we'll just unleash the power of human ingenuity on all the unsolved problems specifically related to the environment. And we didn't even get into energy, which is a whole nother, very interesting topic. With bitcoin, if we want to decarbonize the atmosphere, we have the technology for that today. The problem is that it's too energy intensive. Bitcoin mining is a perpetual bounty program for entrepreneurs to seek out cheaper and stranded energy sources. So we now have this global incentive to push energy costs lower. That will in turn make decarbonization more economically viable. And desalination, because water is another issue. But hey, if we can get desalination cheap enough, we can drink ocean water. So there's this whole again, this vortex of incentives that I refer to as bitcoin as I don't know what else to call it. It's this brand new game that's purely voluntary, purely transparent. And I would argue, I mean, I guess it's still out for debate, but I would argue it's purely a net benefit for humanity, like the trade offs that it makes optimize for individual sovereignty, individual optionality and individual freedom. And I think instilling those characteristics into market actors is what creates the best outcomes for all."}
{"episode_id":"SW - #165 - 2021-07-09 - Robert Breedlove - What is Money -","start":2871.67,"end":2905.73,"speaker":"Jonathan Pageau","text":"Yeah, look, I will definitely think about it. I appreciate your time and I would say people go into the comment section, I'm learning about this. And so I will definitely be paying more attention to the comment section seeing your thoughts about what Robert is talking about, your objections to my objections. And we're going to keep this discussion going. I'm going to keep thinking. And I probably will be talking about bitcoin a few more times to try to wrap my head around it as well. So thanks for your time, Robert. I really appreciate it."}
{"episode_id":"SW - #165 - 2021-07-09 - Robert Breedlove - What is Money -","start":2905.97,"end":2907.01,"speaker":"Robert Breedlove","text":"Yeah. Glad to be here."}
{"episode_id":"SW - #165 - 2021-07-09 - Robert Breedlove - What is Money -","start":2907.17,"end":2910.93,"speaker":"Jonathan Pageau","text":"And so where can we point people to in terms of seeing what you're working on?"}
{"episode_id":"SW - #165 - 2021-07-09 - Robert Breedlove - What is Money -","start":2911.17,"end":2946.32,"speaker":"Robert Breedlove","text":"Yeah, I'm on Twitter @ BreedLove22B R E D L O V E22 and then the YouTube. Sorry. The website for the podcast is WhatIsMoneyPodcast.com and it's also on YouTube and I encourage people. That's why, again, named it the what Is Money? Show. It's like, you don't have to trust me. I know I speak emphatically about this. I've been studying it for five years nonstop. I feel strongly about it. But trust yourself. Go out and ask the question, what is money? And I promise, if you follow that question deep enough, you're going to unveil a lot of very interesting truths about the world."}
{"episode_id":"SW - #165 - 2021-07-09 - Robert Breedlove - What is Money -","start":2946.72,"end":2967.29,"speaker":"Jonathan Pageau","text":"Yeah. Especially now. And I think it is definitely even in terms of symbolism, understanding what is money, what is credit, what is interest. All of these things are subjects that I. That I definitely want to put more attention into because they're crucial to understand and to see where we're going. So thanks again for your time, Robert."}
{"episode_id":"SW - #165 - 2021-07-09 - Robert Breedlove - What is Money -","start":2967.29,"end":2969.45,"speaker":"Robert Breedlove","text":"Yeah, thank you so much for having me. All right."}
{"episode_id":"SW - #165 - 2021-07-09 - Robert Breedlove - What is Money -","start":2970.25,"end":3035.25,"speaker":"Jonathan Pageau","text":"I hope you enjoyed this episode of the Symbolic World. The Symbolic World is edited by Justin Ward, and it is based on a series of videos that you can find on my YouTube channel, Jonathan Pageau's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by, of course, leaving a review on itunes. Everybody knows that's the best way to get the podcast out there, to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon Pajo videos as well and on subscribestar. All those links you can find on my website or in the show description. So thank you and I will see you soon."}
