{"episode_id":"SW - #061 - 2019-10-02 - The Thrill of Death","start":0.24,"end":109.67,"speaker":"Jonathan Pageau","text":"I'd like to welcome you to the Symbolic World podcast. On this episode, I'm playing for you a video I made called the Thrill of Death. And this video is related to my particular situation. Those who don't watch my videos maybe don't know that my house in the month of April was flooded. We had to leave in a catastrophe with the kids. And we've been moving around since. We moved three times in different places, places. It was mostly, you know, me reminiscing on those moments when I've come very close to catastrophe and the kind of thrill that it brings in your life, the kind of energy that it can provide, and so trying to understand why that is what it means and what is its relationship to things like martyrdom, also to extreme sports and all those kinds of things which don't seem related, but I think possibly are related. Ultimately, as you know, everything I'm doing here on the podcast and the videos that I'm making is all thanks to your generous support. So if you like what I'm doing, please consider going to www.thesymbolicworld.com support and there you will find ways that you can help out. For supporters, I offer early access to videos. I also, for certain tiers, people have the chance to ask questions in advance on the Q and A. There are also tiers where you can have private discussions with me. We also have monthly meetings. There are all kinds of little goodies. But ultimately I'm also, for all the supporters, even at the lowest tier, I'm making an extra video every month, which is an interpretation of a traditional story, a myth or a legend or something like that. So I've been having a lot of fun making those extra videos because ultimately that's what I really love, is interpreting stories. So enjoy."}
{"episode_id":"SW - #061 - 2019-10-02 - The Thrill of Death","start":122.71,"end":124.31,"speaker":"Jonathan Pageau","text":"This is Jonathan Peugeot."}
{"episode_id":"SW - #061 - 2019-10-02 - The Thrill of Death","start":124.79,"end":126.39,"speaker":"Jonathan Pageau","text":"Welcome to the symbolic world."}
{"episode_id":"SW - #061 - 2019-10-02 - The Thrill of Death","start":136.68,"end":1247.84,"speaker":"Jonathan Pageau","text":"Hello everybody. So I, I'm. I have to apologize, first of all, if some of these videos that I've been making, the recent ones have been very personal. I'm going through a lot of personal stuff. As some of you know, my family has been flooded. We're still in kind of absolute chaos right now. As you can see, I'm still, still my parents house for luckily I have wonderful parents. I'm still there for a little while. We were able to rent a house for my family until everything gets set up the, the government, as you, as some of you, if some of you haven't followed the story, there's a dike that broke in my town. About 2,000, like 6,000 people were evacuated 2,500 houses were flooded. And so it's absolute mayhem in the city. You know, my street looks like a post apocalyptic movie. And so we are able to strip everything, remove everything from our basement. You know, I lost my, all my books. You know, we lost everything that was in the basement. And so the government has said that they are going to rebuild the dike finally. And so they hesitated for a while. They're going to rebuild the dike, but the city told us to be very patient because they need to decide which areas of the city will now be considered, say, floodable area or uninhabitable area. And so they want us to wait before they rebuild because some people will be expropriated. So we don't know who that's going to be. We're far away from the water. But our, our house is one of the, is one of the lowest on the streets. And so we're not sure whether or not we will be one of the people who will be expropriated anyways. So that is the situation. We had amazing people help us. So many people have been helping us to clean up the house. My family, friends, even people who. I never met someone, Mike, I forget his name, Mike McDonald came from Montreal, I never met him, came by bus and he came to help us help our family. So it's been just, that has been amazing just being surrounded by people who've helped us. A lot of people have also sent us money through PayPal and, and several people have asked me to set up a GoFundMe campaign so that I did that today. I will put the link in the description for those who like to give through GoFundMe and kind of see, you know, the, the amount go up and get a sense of, of what kind of donations we're getting. So, so if you want to support us right now, I don't know what's going to happen. I have no idea. Everything is completely up in the air. I haven't worked in several weeks and so I, I, I'm grateful for any help right now because I don't know what's going to happen. So, but still next week I'm still going to be, I'm giving a talk there with Father Stephen Freeman and Daniel, I forget his last name. I'm sorry, Deacon Daniel. And so I will be there. So if you were planning to come to Seattle, don't worry, that's going to happen. I'm also going to be in Louisiana in a few weeks. That's also not going to be Canceled. And I'm also giving my carving workshop in the beginning of June. So all of that is going to happen. So if any of you have been wondering whether or not those will be canceled, none of those will be canceled. So. All right, so for the subject of this video, I decided I'm going to talk a little bit about what I would call the thrill of death. And so it's based, obviously right now it's based on my experience. It's based on kind of looking inside and realizing some of the emotions that are going through me and some of the experiences that are happening related to a lot of the symbols that I've talked about in terms of exploring the symbolism of periphery and the symbolism of this crazy, upside down, chaotic world. And so being kind of confronted with that directly, this flood, talk about the flood. And so being faced with the flood really brought about a lot of, obviously some despair, obviously some desolation, sadness, anguish, all that, of course. But I think the most surprising thing to me, which is why I want to talk about it, because it's surprising, is this weird thrill that also comes in these moments. It's not the first time that I felt this. It's also not the first time that my family and I have been in a situation which is similar to this one. Several years ago, in 2004, I think it was, my wife and I were in Congo and we were visiting the east of Congo. We were visiting the Great Lakes area. We had been to Bujumbura and we were visiting. We were in Bukavu, which is a city on the east, in the east of Congo. And while we were there, we were there for just one day, coming back from. Through Rwanda and Bujumbura, coming back towards Congo. While we were in Bukavu, there was a war that started. We were in a guest house and all of a sudden it started shooting. My wife, actually, it was insane because I was deathly ill. I don't know what I'd eaten in Bujumbura. Obviously, sometimes in Africa you eat stuff, you know, and you get food poisoning or you get, you know, a bug. And so I actually took a bus through Rwanda for. It was like an eight hour trip. And I had horrible. It was horrible. You know, every time the bus would stop, I would like run out into a field. Sorry for the disgusting details, guys, but I had. It was just horrible stomach stuff. So we get to Bukavu and I'm dead. You know, I'm lying in bed, just kind of. I just want to die from my stomach issues. And my wife says, I'm gonna go eat. So I'm like, yeah, you go eat. I'm not eating anything. She goes out into bukavu to eat. All of a sudden, I hear this, ta, ta, ta, ta, ta, ta, ta, ta, ta, ta, ta, ta. And obviously, having been in Congo already for a little while, I know right away what's going on, you know? But I'm so out of it. I'm just laying there for about two minutes. I'm just laying there, and I'm listening to the shooting increase, increase, increase. And then finally dawns on me, okay, something's going on. Like, they're shooting outside, and my wife is not here. So I like, you know, I put on my clothes, I get dressed, and I go out to the door. They don't want to let me out of the. The compound, but I'm like, I need to go see if I can find my wife. I think she's right up the street. So I get out of the building, I run up the hill, and there's my wife, like, coming to join me. And everybody's kind of running around in the city, and everybody's. There's a weird vibe going on. So we go back into the guest house, and all of a sudden, we become just locked in. And the shooting. The machine gun shooting turns into heavy machine guns turns into shelling. After a while, the ground is shaking, the building is shaking, and we are stuck in this guest house. And we got stuck until the evening. And then in the evening, they were able to negotiate a ceasefire. And I slept because I was so sick. I just slept all night. And the next morning, my wife got up, and I was like, I need to sleep. I need to sleep. And I just slept. Slept for hours. And the shooting started again. And for some reason, I was just able. I just slept through the shooting, and it was just shooting and shooting and shelling. And I slept for a few hours in the shooting. It just reminded me, you know, of that scene of Christ in the boat down in the bottom of the boat. Not that I'm like Christ, but just the scene of Christ in the bottom of the boat as the storm is going on. And he's sleeping in the bottom of the boat, or Jonah, you know, in the bottom of the boat, sleeping amidst this total, absolute chaos. And so I'm sleeping in the bottom. I sleep again in my room. And after a while, it's just too much. I get up and I get out. And it was so surreal because the shooting was so intense. The sound was so Intense. But inside the compound was this beautiful garden. So I took a picture, and in the picture, it's just this beautiful garden, and you can't hear the insanity that's going on outside. So we get stuck in this place, and we're trying to be evacuated, but they keep calling the UN to come get us, but the UN says it's too dangerous. They can't come get us at all. So finally. Because also, the head of the UN was Swedish, and we're at the Swedish guest house. So they had a personal connection with the head of the UN there. So finally they're able to convince the UN to come get us because the shooting has died down. They negotiated some kind of ceasefire. And so then I have to go. It's still shooting. I mean, it's still shooting pretty intensely. It's just maybe not shelling. I don't know why they decided that they could come, but there was a shooter right on the top of the wall of the compound. We don't know on which side the shooter was. But I decided I'm gonna go back to the room, go outside into. Outside into this outer compound and then walk through the garden and then go to our room, which was kind of like a motel situation with the door on the outside, to go into our room, get. Get our stuff so that we could be evacuated. And so I get out of the room. And then as I get out of the room, it starts shooting and shooting and shooting. And I'm going towards the room and there's bullets whizzing through the trees above my heads. Above my head. And I just remember that feeling. And this is the feeling that I'm telling you about. I just remember this absolute thrill, like this rush, this rush of strange energy, this rush of. It's hard to explain. I mean, I think. It's not that hard to explain. A lot of people. That's probably why a lot of people get into extreme sports and those types of situations where they put themselves really close to death and they can feel this rush. You know, I've done some rafting and that kind of sports where you can feel a little bit of that, you know, or you go on a roller coaster, that kind of stuff. But, you know, but this one. This experience was more existential because obviously my life was really in danger. And also, I don't know, there was just a deeper sense of this coming into contact with death and this thrill of facing death. So, anyway, so we get our stuff. And it's so strange because one of the things that I Brought out that we bought in Burundi. It was this basket. If you watch my videos before, in the last few videos I made, I actually put this basket behind me on the shelf because it. It became one of my most. It's one of my most precious objects. Just because of. Just because of what it represents. That moment of facing death and then, you know, escaping with this basket from Africa. Anyways, so. So finally we're in this. We're in the guest house again. And the UN says they're gonna come get us. But as they're coming, the shooting intensifies again. Once again. So when the UN arrives in front of the door, no one wants to leave except my wife and I, because the car wasn't bulletproof as well. So we just rush out the door, get into the car. They go down the hill, like, swerving. They're going down the street, swerving to avoid bullets, you know, stray bullets or whatever. I don't even know. I guess they know what they're doing. And we arrive at the UN compound. And in the UN Compound, the first thing we notice is that everybody is drunk. The workers, the people that are working there, all the expats that had been evacuated, everybody is drunk. And it was so surreal, you know, because you leave this guest house, you come to the un, you think you're coming to a safe place. But it was absolute mayhem. It was absolute chaos because all these refugees basically were piled into the UN compound. And so we didn't know where to go. We kind of. We slept in this massive room where there was hundreds of people, kind of slept under a table near the men's bathroom. And it was quite disgusting. You know, the smell. Obviously, there's hundreds of people, so the smell started to increase. So anyways, it was quite crazy. If you guys are interested in seeing a little bit of that. It turns out that while we were there in this compound with Congo, there was also a famous punk band that were there. And I didn't. I saw them from far away, but I didn't know who they were because I was growing up by then, didn't know about these famous punk band. It's a punk band called Sum 41. And they made a video about it. It's called Rot in Congo. So if you want to check that out, you can actually see. It's very strange to watch. Like, you can watch our experience during that time. You can see the compound. You can see all these. All these people, all this chaos. And anyways, so. And then after that, in the next few weeks after that, Time we finally were evacuated, and we were brought outside of the city into another city. And it was very interesting because we were just sitting there. We'd left this war zone, and within a few hours now we were in this calm hotel, and everything was calm, but both my wife and I could still hear massive shooting. We could still hear shooting and war trumpets and all this stuff, but there was nothing. There was no sound. I mean, it was just traumatism, I guess, but we could hear it as if it was there. Quite surreal experience. And then in the next few weeks after that, a lot of the expats left Congo. But our organization, we were working for, Mennonite Central Committee, they tend to evacuate people at, you know, really at the last moment. Like, they don't evacuate. Just evacuate. And so we ended up going back to Kinshasa, where we were living. But we stayed in Kinshasa as it devolved into riots. And we got stuck in our house for a week with all these riots going around our house. It was quite intense because we lived in local neighborhoods. We didn't live in, like, white enclaves. We lived in local Congolese neighborhoods. And at some point, this crowd came to our door, and they said they were coming because they heard that there were white people in this compound. It's so funny because this crowd came to the door angry because they blamed the UN for the war, and they blamed the international community for the war. And so they were just angry. So they came to the door and they're like, we hear there's white people here. And our neighbors, who were amazing. It was so funny because our neighbor said, no, no, no, they're Canadian. And that was enough to dispel the crowd of angry people. And so they dispelled this crowd. And then finally, we were pretty safe in our house. People came to visit us and brought us food and stuff. So we stayed there for about a week. And then we were. As soon as things died down, we got into our pickup truck and just, like, bolted to a compound, an American compound that we knew of, but all the Americans had pretty much gone. So we were kind of alone in this compound. It was just a very intense time. Several times in those very few weeks, I came, like, right face to face with the possibility of dying. After that, I was also once I was arrested by the police because there were no expats left. And so we became suspicious to the police. I was arrested, and I was like. A car came right up against my pickup truck and forced me to. To move off the road. These guys got into the back. And someone got into. The policeman got into the front. And then he started. He started saying, I'm a spy, you know, and all this. And then he. And I just thought he wanted my money, which ended up being the case. And so he said, I need to search your bag. So I said, okay, fine. You want to search my bag, that's fine. But I always kept my money in a Ziploc bag. So I pulled the Ziploc bag out, and I said, this is my money. I'm going to put my money in my pocket, and if you want to search my bag, you can search my bag. So I fold. I take the bag, put it in my pocket. The policeman searches the bag, but obviously he didn't want to search my bag. He wanted my money. So he says, I need to count the money. I need to count how much money you have. I was like, I'm not giving you my money. It's not happening. Obviously, now, by now, also, I was just sick and tired of this. Like, I didn't care anymore. And so he said, I need to search you. I need to count your money. And I said, no. So then he actually. I can't believe I did this. Actually, it's quite surreal. It really shows you this kind of thrill, this kind of weird thrill, this kind of weird rush when you come face to face with death. That can happen. The policeman goes to put his hand in my pocket to take the money out, and I slap his hand away, and I'm like, no, you're not gonna get my money. I said, if you want, you can go to my office, which was down the street. We can go inside, we can go there, and then we can talk. But here, I'm not doing anything. So the policeman takes his gun out, and I just start laughing. I mean, by now, you guys, if you know me, you've seen that I always laugh in the most inappropriate moments. And so I just start laughing at the police officer. And I'm like, are you gonna shoot me? You gonna shoot me here? Like, right here, downtown, in the middle of town? You're just gonna shoot me because you want my money? And I'm like, you're not getting anything from me. And I just. Anyways, like, I said, rush this. This weird rush of energy that you get. So I'm like, you're not getting anything. And so finally, the policeman backs down. And then it's weird because he becomes, like a. He turned into, like, this weird. Like a weird beggar. And he started to say, yeah, but, you know, we made all this effort. You should at least give us money for Cokes or for be. You're not getting anything from me. You just get out of my car. So finally, anyways, the policeman got out of my car. And that happened several times in those few weeks. I also got taken into by police with a guest that we had, and I had to negotiate his release. And all this happened in the span of about. I would say about two weeks. All of that. And I remember the. I remember what I'm telling you guys. I remember this rush, this, like, rush of this thrill of being face to face with. With danger, being face to face with death, being face to face with. With losing everything. Because it's almost as if it. It's almost as if it feels like it could be a liberation. Like it could be this weird liberation to kind of go off the edge."}
{"episode_id":"SW - #061 - 2019-10-02 - The Thrill of Death","start":1247.89,"end":1248.05,"speaker":"Jonathan Pageau","text":"And."}
{"episode_id":"SW - #061 - 2019-10-02 - The Thrill of Death","start":1248.28,"end":1312.83,"speaker":"Jonathan Pageau","text":"And I'm telling you this. I don't. I have to admit, like, I'm telling you. I'm telling you guys this. And even the symbolism, I don't. I don't totally understand it. I think I grasp it somewhat. I don't totally understand it, but I felt the same now. Felt the same during the time of the flood when we were. Things happened very fast. The police came and told us we have to leave now, and water was coming, so we had to, like, get in the car and leave as the water was rising up in our. In our house. And then we came back to our house, you know, in a lake, basically. Our house is flooded and everything is floating in the basement. And we don't know where we're gonna go. We don't know what we're gonna do, and everything is uncertain. And it's the same thing as we're stripping the basement and I'm, like, throwing my books out the window and I'm taking all my, you know, our kids drawings and taking them out the window and all our homeschool and all my kids, my son's room and everything. And just through the despair. I mean, there's despair, and obviously that. Everybody knows that there's despair, but there's this strange. This strange rush, this strange. This strange energy which comes. And I. And I. And I don't."}
{"episode_id":"SW - #061 - 2019-10-02 - The Thrill of Death","start":1313.31,"end":1313.67,"speaker":"Jonathan Pageau","text":"The."}
{"episode_id":"SW - #061 - 2019-10-02 - The Thrill of Death","start":1313.67,"end":1550.69,"speaker":"Jonathan Pageau","text":"The intuition that I have. Okay, this is. The intuition that I have is. I think that obviously this is not at the same level, but I think there's something about Christianity in that. There's something that can be flipped in that. And I. And. And I say that I'm being very careful when I say that because obviously I. I don't know, but when you read the testimonies of the martyrs, it seems like there's something in there where they ride that. They ride that experience in a holy manner, let's say. Like, for me, there's nothing holy about that experience that I had. There's nothing holy about those feelings. It's basically just a passion. It's a form of passion, really. But this idea that you could ride that rush or that thrill, you could write it in a manner which would flip it and make it into a kind of glorification, you know, and it feels, when you read some of the stories of the martyrs, of how they face death, and the death becomes almost a kind of ecstasy. I'm wondering about that. Like, I'm wondering if maybe that has something to do with this experience of coming face to face with death, coming face to face with the edge. And so, anyways, that's a little meditation. That's a little meditation I'm offering for you guys. Another thing I wanted to talk about before. I don't want to make this video too long, but another thing I wanted to talk about was one of the things I noticed in the. In my town as these heaps. These piles were coming up, is people started to put these weird mascots in front of their heaps of rubbish. There were few houses where it almost became like apotropaic imagery. Apotropaic imagery is the idea of putting monsters on the edge, you know, like putting gargoyles on the edge of churches or putting fearful creatures on the outside. And one house had this pile of rubbish, and right in front of the house, they had put up this little stand. And on the stand they had a mask of an evil clown, like a kind of Halloween mask of an evil clown. And I was like, oh, my goodness, this is so strangely appropriate, especially with all the honk, honk, clown world stuff that has been going on. So here is this clown, deadly clown mascot, you know, protecting or manifesting this heap of rubbish and chaos. There was also someone nearby who had put up this, like, weird doll, like this kind of monstrous doll that was up on the top of a water heater that had been taken out of the house. And so it's very fascinating to see that in this chaos, you know, you think about the people who took their trash out, it's not conscious, right? They didn't do it consciously, but for sure there was something happening, something about that mask which just made sense for them to put there in front of their pile, in front of their Heap. And I think that this is sometimes how symbolism happens. Like in all the possibilities, the one that you end up choosing is the one which is closest to reality, which is closest to what is happening, what is manifested. And so it almost has a ritual shape. Despite the fact that this is a common experience, this is not a thought out ritual or a thought out thing. And so I thought those are some of the strange experiences that I've been having that have been extremely interesting. So anyways, so I'm gonna end this video now, guys. Sorry that these videos are becoming very personal. But just remember, you know, remembering all these events in my life as my own life is still in kind of in shambles right now. So hopefully soon I'll come back to the normal videos and I'll be able to talk about symbolic things that aren't so close to me. So. All right, guys, so thanks for your attention. Thanks again for everybody that has been supporting us through prayer, through great messages of encouragement, and financially as well. And I will see you soon."}
{"episode_id":"SW - #061 - 2019-10-02 - The Thrill of Death","start":1551.97,"end":1616.89,"speaker":"Jonathan Pageau","text":"I hope you enjoyed this episode of the Symbolic World. The Symbolic World is edited by Justin Ward and it is based on a series of videos that you can can find on my YouTube channel, Jonathan Pageau's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course leaving a review on itunes. Everybody knows that's the best way to get the podcast out there, to get it heard. And if you want to get involved, you can also support the podcast financially. Going to www.thesymbolicworld.com support or else on Patreon Pageau videos as well and on SubscribeStar, all those links you can find on my website or in the show description. So thank you and I will see you soon."}
