{"episode_id":"SW - #357 - 2024-09-19 - What Is a Miracle -","start":0.56,"end":995.28,"speaker":"Jonathan Pageau","text":"One of the obstacles to religious belief in the modern world, especially in a, let's say, scientific, materialist, reductionist world, is of course, the question of miracles. People don't understand, you know, what are these miracles? Are they simply extraordinary things, supernatural events that happen? And because they're supernatural, they convince people of the truth, a certain faith or a certain belief, and therefore they can get people to believe in something in a manner that eschews the usual reasonable ways in which we evaluate whether something is true or not. That is, of course, the criticism of a lot of the new atheist types. And I thought it would be interesting to look at the question of miracles, of why it is that there are miracles in religion, why there are miracles in Christianity, what those miracles look like, what they mean, and what they possibly help us understand about how reality functions and how they are not, in fact, simply freak events that issue normal, reasonable patterns of being, but rather they are events that, let's say, shine a brighter light on the way in which reality functions and are even in some ways, the fact that they're so surprising and so extraordinary is because they show the pattern of reality in ways that are more than what we're used to seeing. They kind of compress reality into these hyper events, we could call them, that seem to contain more meaning in them, and so they're not just freak events. So we'll look at that and hopefully it will help people at least understand. I can't prove to you that miracles exist, and that's not the point, but the point is to at least help people understand why miracles are there and what they can help us understand. This is Jonathan Peugeot. Welcome to the Symbolic World. So before we start, if you appreciate what we're doing here at the Symbolic World, please go to the symbolicworld.com you can become a member of the Symbolic World and participate in a wonderful online community that is, through our website, that they have their own conversations and their own exchanges. But you can also become a paying member and support what we're doing. And paid members have access to Q and A every month, to an extra video, and also some discounts to, to courses and different things that we offer. And so if you enjoy what we're doing, please consider supporting us. All right, so the question of miracles. Now, the first thing that we need to get rid of is the idea that a miracle is simply some extraordinary thing that happens or some unexplainable thing that happens that is not what a miracle is. And so a miracle, you know, and so you can have unexplained things that happen that, that you don't know the causalities for. Of course, those types of things can happen to you all the time. You can also have things that happen in a very strange way. But usually what makes something a miracle is that it is a kind of strange thing that happens. Something which doesn't have a complete explanation for it, let's say, at least in the way it's described, but that usually it points towards meaning and that's the difference. So, you know, think about how if, let's say you're. You're walking, let's say in, in the middle of a forest, there's a cliff, and then a rock falls off the cliff and hits the ground. Now that's obviously not a miracle. That's something that happens. Now what would make it a miracle is I don't know if I'm walking through that road and I get attacked by thieves and the thieves are going to rob me, and then suddenly the rock falls, it hits the thief in the head, the thief passes out, and then I walk away from the event unscathed. Now that's closer to a miracle. And it's the same event that happened. But one of them, it's helping me towards a purpose, and the other, it's unexplained and the causality of the event don't seem related. And it's pointing me towards the purpose. And the other one is just something that happened. And so this is the way to understand miracles. Now in Scripture, I'm going to use the miracles of Christ because trying to just, you know, we could use all kinds of other types of miracles, but the miracles of Christ are particularly exemplary in this thing. And so the miracles of Christ are always pointing towards a restoration of purpose and, and a capacity to show more meaning in an event than what is usually normal for an event to happen. The simplest example of them is of course, the healing miracles. And so when Christ heals someone, what he's doing is he's restoring something to its purpose. Now, a purpose is something which is not in the factuality of an event, right? And so if you look at the facts of something, you cannot discern the purpose. Purpose has to do with life, purpose has to do with consciousness. Purpose has to do with intelligence. These are the mechanism by which we understand purpose. And the purposes are not in the reduction, the reduced factualities of an event. And so this is what I mean is that there's no scientific difference between a sick body and a healthy body. Both of them have cells, both of them Have a certain amount of cells are doing certain things, are causal to certain possibilities. And the idea that one is better than the other cannot be captured by simple analytic concerns of science. And, of course, calculating quantities and predicting, let's say, predicting phenomena by the capacity to appropriately quantify the phenomena and show its different mechanical causalities. There's no difference between a healthy body and a sick body. The difference, the gap between the healthy body and the sick body is perceived in the sense of purpose. We know what ideally a human being should be, and even that. And we have a sense, like we see certain humans that we admire. We see certain humans that are doing things that we care about and that we can see that we care about those things. And people that are able to do them, they are better people. Not in a moral sense, but they're closer to what we think a person should be. And that is the gap between a sick body and a healthy body. And so when someone gets sick, or when they're infirm, or when they lose a hand, or when something happens to them, when they're blind, when they can't hear whatever, we can see the gap between their situation and what they would like to be, or what most people see as being closer to the ideal of what it is to be human. And this is what the miracle does. The miracle reorients the body towards its purpose. It's able to take something which we can see, the gap between the purpose and the reality, and then bring it back towards purpose. And so this is what miracles always do. And in doing that, what it. What the miracle does is that it reveals that purpose. It makes something shine. Because in restoring it to its purpose, it's showing you what is the ideal, what is the reason for these things to exist. And this is, of course, like I said, what miracles are always doing. Now, the idea, the problem is that this miracle, you could say, is there all the time. It's there kind of hidden in the world all the time, which is that you cannot get the qualities, the higher qualities of something from its lower constituents. And so the lower constituents of a body, let's say you take, you take Again, we take. Let's use a sports team. I always. You. I always like that because it's very simple. You know, a sports team is doing a bunch of stuff, right? They're dribbling, they're passing the ball, they're doing all these things. And if there was, like an alien that came and looked at what they were doing, they couldn't discern just from the constituents of the Game, what the reason for the game is, what the purpose of the game is. The only way they would be able to do it is through analogy. And so what they would do is they would look at the constituents of the game and then they would. They would create an analogy to something that they already know its function. And so if I look at basketball, if I've never seen basketball before, I know what a sport is, and I know how sports function because I've seen baseball or football. And so I look at basketball and I see the things they're doing. They're running, they're bouncing things, they're throwing things, they're throwing them to each other. And I'm like, what the hell are they doing? And then finally I get an insight, and I think, oh, this is like this other being that I've already identified its high qualities. And in doing that, and maybe I compare it to, I see that it's similar to what they do during, let's say football or soccer or baseball. And then all of a sudden I say, oh, it's a sport, right? But the only way I can do that is by analogy to other higher identities. And then suddenly I get an insight into what it is that the sport is doing. That jump. That's a miracle, folks. That's what the miracle is. Now, the miracle in the most specific sense, the reason why they appear miraculous to us is because the person doing it is restoring the being to its purpose in a seemingly magical way. It's like all of a sudden this sick person becomes healthy, and then you see what it's like. But you could see that. So think about a sports game again. And the players, they're not. We do it all the time, by the way, this restoring towards purpose, you know, the players aren't playing really well, and then the coach comes down. I've mentioned this in another video, like a prophet comes into the game, into the team, and then through will, through influence, through meaning, through all the things that miracles are constituted in, right? The coach takes his wand out and hits it on the ground and said, you know, now you will focus again and you'll come back together towards the reason and brings people back into the reason for the sport and then reveals the meaning for the sport in doing that. And that is like a little miracle. It's a very small one, it's not a very big one, but it's a little miracle. All of a sudden, these players are now coming back together in a dance, in the proper dance, towards the purpose that brings them together in the first place, it's a kind of restoration. And so this. So a way to understand the structure is that when you don't see the purpose of things, it's something akin to death. It's something akin to death in the sense that you have a bunch of particles that aren't aligned or you don't know how they're aligned towards something, towards a purpose. So imagine now you have a dead body, and then you have a living body. The dead body has as many particles, has as many cells, has as many, all these things than the living body. Maybe those cells are dead. But what's the difference? Like, you have as much matter in a dead body than you do in a living body. And so the dead body has all this stuff. And so the difference between something that's dead relatively in the sense that you don't know what its purpose is, and then all of a sudden you see the purpose and. And it comes together. And all of a sudden now this mass of facts and this mass of stuff appears into the reason why it's together in the first place. And that is a kind of. You can think about that in the experience as a breath from heaven, right? The meaning descends onto the thing, and then all of a sudden you can see in your experience that it is one. But you can do that through will, too. It's not just seeing that it is one. You can actually make it one. And like I said, the coach, for example, that comes into the basketball team by his influence and his will, he says, be one. And then the players respond and they come together. And all of a sudden this dead team that was now everybody was fragmenting and moving in all their different directions is now joining together towards its purpose. All right? And so this type of little miracle happens all the time, constantly. You know, how can I say this? It's hard for people to realize it. Like, it's like that's what a marriage ceremony is, you know. And so you have two people that are kind of together. They, you know, you're not. It's not clear what they are. And so then you have a ceremony, and then someone comes and says, I declare you man and wife. You are now married. And so all of a sudden, the body appears, the purpose appears, and now they're aligned towards the reason why they're there in the first place. You know, there are so many of these types of examples that really, it is in some ways, like, you know, it's the capacity to gather things into a body. And so this is what the miracles are always doing. And so it can appear in different ways. It can appear as a kind of mastery of nature, because that's what you're doing when you're doing that, when you're a coach and you come down into the basketball team and you say through spiritual influence, through speaking, through the capacity to influence people's minds and to influence people's attention and to influence people, you're able to gather them into a body, and all of a sudden they become one. And in purpose, it's like, that's what magic is, folks. I don't know what to say. It's like that's really what the deepest aspect of the magic is, the way that C.S. lewis, for example, talks about the magic in the world. And so that can appear as a type of mastery of nature. And so nature is chaotic. Things don't function. And then you're able to bring them together. So, for example, Christ, he healing, you know, stopping the storm, or Christ walking on water, or all these things that are just weird and strange, what they're doing in the event of the thing is, they're manifesting at an even higher level this type of mastery of nature through being, through logos, through spiritual influence. It shows you how this. How this works. And so. And the reason why. The reason why they. These look strange. On August 27, we are going to start to ascend the mountain of purgatory, Richard and I, and continue on the second Dante class. So you can please go and sign up. You know, the first class was just an absolute blast, and everybody really enjoyed it. So we're hoping that everybody will continue on the track with us."}
{"episode_id":"SW - #357 - 2024-09-19 - What Is a Miracle -","start":995.95,"end":1095.15,"speaker":"Richard Rohlin","text":"And. Yes, so as Jonathan said, We're starting August 27th. You can get the course now at Symbolic World Courses. There are payment plans and everything there to make it convenient for you. It's going to be incredible. Purgatorio is actually my favorite book of the whole comedy to teach. It's the one that most people, when you're in school, you start, you read Inferno, and that's all you read. If you read Dante at all in high school or college, you probably only read Inferno. Purgatory is my favorite one to teach. It's the one that is kind of, you could say, in a certain sense, the most relevant to where many of us are in our Christian life. That is to say, Purgatorio is about the purification, right? It's about the process of becoming saints. And so whereas, you know, Inferno is like about sort of rejecting sin. And then paradise is about what is. What even is holiness. And paradise is the hardest one to teach. We are going to be doing it later this year. Paradise is the hardest one to teach though, because it's very hard to explain to somebody exactly what it means to be holy. But I think all of us can understand what it's like to try to become holy. So anyway, join us for Purgatorio. It's going to be really awesome. All the juicy stuff is in Inferno, you know, because like, it's really fun to look at these sinners getting their, you know, what's coming to them or whatever. But Purgatorio is in many ways it's the most practical because it's. It really hits us right where we're at right now. So, August 27th, folks, please, please, please come and join us for the class. You won't regret it. It'll be five amazing weeks of really getting deep into the question of what does it mean to be purified? And I think you'll enjoy it."}
{"episode_id":"SW - #357 - 2024-09-19 - What Is a Miracle -","start":1095.23,"end":1630.91,"speaker":"Jonathan Pageau","text":"So, all right, we'll see you there, everybody. The reason why they these look strange. The best way to understand it is to understand that they're like a missive from a higher aspect of reality. This sounds weird when I say it. It sounds kind of woo woo. There's nothing woo woo about it. That is the players that are chaotic and not functioning together, right? The only way that they can now come together into one is that they receive a purpose from heaven. They connect to a purpose from above them. And you can't find that purpose in the things they're doing, like I said. But if they perceive it and now they come together and they participate in it, now all of a sudden they become a unified body that is, that is manifesting the influence of that which is above them, which is the reason why they're there, the reason of the basketball game. Okay? Now there are higher levels of that. There are ways in which all of reality can come together into higher participations. That is this pattern of influence from above which coheres reality below is one which happens at every level of reality. It doesn't just happen at the level of the coach and the basketball players, it happens in the body of the basketball players. Because the basketball player has all these processes in his body that aren't related to playing basketball. But then all of a sudden the coach comes in and the coach says, be one as a team. And then the player is inspired and then he says to his body, he says, okay, now be one as a body. And now we're going to move towards the purpose that we're receiving from the coach. And so he does the same to his body as the coach does to the basketball team and is able to mobilize reality towards reason and purpose. You know, this is. And so the idea in a miracle that that happens at levels that are beyond that. This one, that there are ways in which reality can come together and participate and reveal the meaning of things in ways that are so surprising that they seem to break or to not account, or that the parts that constitute it don't account for the qualities of that which appears higher. And so it appears as a kind of glimmer. There's all these images that Christ uses to talk about this, which is that there are certain facts that aren't flat facts. There are certain facts that are actually a glimmer of that which is coming down from above, of the purpose that is coming down from above. And usually the. Those appear as kind of shining. You kind of see things come together and something is shining. He talks about the pearl in the field. There are different ways that Christ talks about it. And you know, how can I say this? And that's why when we see that, that's why we celebrate that, you know. And so, for example, like when we see someone being excellent at anything, we tend to find that amazing. Why? Because they are able to bring matter into purpose in a way that really does it, you know, does it in a way that reveals the purpose very strongly. And so it's like we have this sense of awe when we see someone do something with excellence. Well, that is possible at higher levels as well. And that is what we're seeing when we see a miracle. So Christ's miracles are always like that. They're always about revealing mastery of the cosmos, revealing the way in which reality comes together in order to celebrate that which is higher, even higher than what we can, that we tend to perceive. And the ultimate miracle is the resurrection. Why is it the resurrection? Because that's what all the miracles are. All the miracles are aspects of the resurrection. The resurrection is only the one that is in some ways the most condensed, most compressed, and reveals the most about reality. And why does it reveal the most about reality? Because that is exactly how we perceive unity in beings. We perceive unity in beings when we see multiple things that are dead, dead to the identity in the sense that we don't know why, or they don't seem to participate in some higher purpose. And then all of a sudden they do. Either we perceive that they do because we couldn't see it before, we're confused, or we're muddled or they align themselves towards purpose through will, through consciousness, through intelligence, through all these things in the way in which humans and life interacts with the world, right? There is a difference between something alive and something dead. And that's the difference. It's the capacity of multiplicity to join together in purpose into one unified body. And the resurrection is the image of that in a way that is so strong that it breaks all our normal. It breaks all our normal ways that we think things exist. And of course, and it should, it should, because just like the purpose of the basketball team coming down onto the players and bringing them together in this. In this body that makes us wonder and celebrate. And look at, you know, the, the, the, the pass, and all of a sudden the guy coming behind and he just passes it there, and there's. The guy's just all of a sudden there, and, you know, he jumps up and gives it to the other guy and then he puts it into the basket. And you're like, how did they do that? How did they even know where they were? And there's this sense of awe that all of a sudden all these players are like, coming together in this dance towards purpose. And it's like, take that and scale that up, right? Take that experience and scale that up. And that's what the miracle. That's what the miracle is. And the resurrection is the. The ultimate miracle because it reveals the very structure of reality. Reality in consciousness, reality in intelligence, reality in will, and the manner in which being constrains multiplicity into unities. And so, you know, and I know that, like, I'm not going to convince atheists about whether or not the resurrection happens, whether or not these miracles happened, but hopefully you can at least understand that it's not completely ridiculous, that it's not just a bunch of arbitrary things that we believe and that because they break the rules of nature, we believe them. It has to do with levels of emergence and qualities that show themselves in multiplicity in ways that cannot be accounted for in multiplicity. And it's just that it's happening at levels that are higher than what we're used to perceiving. And so that's my attempt at helping people at least understand it. Like I said, I know I'm not gonna convince everyone, but hopefully it's enough to help you at least think about it and think about the fact that, you know, this is not just ridiculous things that people believe in order to justify their belief. They're actually trying to pierce into the relationship between existence and this weird thing that we have as intelligent beings, which is intelligence, consciousness, you know, the idea of constraining reality through will and through and through those things and how that comes together. So thanks for your attention, everybody. I'm probably going to circle back towards this at some point, because I know it's a big issue, it's hard to talk about, but hopefully we can get closer and closer, and I can maybe use some examples of some miracles a little more precisely to help people see what it is that I'm talking about. So thanks for your attention, everyone, and talk to you very soon. Bye Bye. If you enjoy these videos and podcasts, please go to the symbolicworld.com website and see how you can support what we're doing. There are multiple subscriber tiers with perks. There are apparel and books to purchase. So go to thesymbolicworld.com and thank you for your support."}
