{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":0.16,"end":4.96,"speaker":"Jonathan Pageau","text":"You can't have those two at the same time. The actual reality is that it's neither of those."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":5.2,"end":5.92,"speaker":"Fr Andrew","text":"Yeah, that's right."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":5.92,"end":27.8,"speaker":"Jonathan Pageau","text":"It's neither of those. That it's Christianity. As Christianity took hold, it integrated the things it could integrate. It kind of let fall to the side the things that couldn't be integrated. And it ended up with a world that was based on the ancient pagan world in terms of a lot of the forms, but moving, using its meaning, pointed towards God and towards Christ, you know?"}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":27.8,"end":32.3,"speaker":"Fr Andrew","text":"Yeah, foreign."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":39.02,"end":98.33,"speaker":"Jonathan Pageau","text":"This is Jonathan Pedro. Welcome to the symbolic world. Hello, everyone. I am happy to be back with Father Andrew. It's been a while since we've had a discussion, and so we felt like this would be a great time to, to catch up with some of the things that we're doing. Father Andrew has been publishing a wonderful podcast called the Wolf on the Cross, which documents his visits to Lithuania and exploration of Lithuania as this, this amazing center where Orthodoxy thrived, where Catholicism is there. And that is actually what we're going to talk about. So Father Andrew had the idea of looking at how the church has dealt with the question of its encounter with other religious traditions, know, the, the opposition, the, the compromise, also bringing in all of these types of things. So I'm looking forward to our discussion. Father Andrew, thanks for, thanks for meeting with me again."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":98.65,"end":107.69,"speaker":"Fr Andrew","text":"Thank you very much for agreeing to talk to me. I, I think this is a really interesting topic that does not get a lot of press in our very polarized days."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":108.09,"end":117.54,"speaker":"Jonathan Pageau","text":"Yeah. And for you also, this whole adventure in Lithuania is also a very personal encounter. Like, it's a, It's a personal journey."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":117.54,"end":179.94,"speaker":"Fr Andrew","text":"Let'S say it is. I just came back a few weeks ago from my second visit there, and just to show how personal it is, one of the things I got to do in the second visit was I visited the small town that my great grandfather was from, where I had been before. But this time I actually got to go inside the Catholic Church. That is the one church in that town. Basically everybody in the town belongs to that church. The pastor of that church is the pastor of the town, which is hard for us who live in the west to imagine that. But he gave us a very long and beautiful tour. And one of the things I got to do while I was there is I actually got to touch the baptismal font that my great grandfather was baptized in 140 years ago. And I got to stand in the place where my great great grandparents were married 160 years ago, or however many it was. But, yeah, so it's extremely personal. And now I've made a number of. Of friends that are there that I talk with pretty much every day. And so, yeah, it is. It is something very, very close to my heart."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":180.1,"end":195.65,"speaker":"Jonathan Pageau","text":"So tell us a little bit about what, because I. I imagine that this provokes some insights and also some research into this question because Lithuania has been such a place of melding and, you know, things coming together. So tell me a little bit about what your insights about how the Church deals with."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":195.73,"end":422.06,"speaker":"Fr Andrew","text":"Yeah, so a lot of people don't know where Lithuania is even on the map. So if you're looking at Eastern Europe and then your eye kind of goes up towards the top, that's where it is, up towards the top, right on the Baltic Sea. Right across the Baltic Sea from Sweden. It's next to Belarus, it's next to Poland, it's next to Latvia, and a little piece next to Russia. So if you think about that on the map, that's actually a really important part of what we're talking about. When Christianity splits, you know, in the 11th century, give or take, eventually, you know, Eastern Europe becomes Orthodox later on, largely speaking, although there's already some. Some of that going on by the time the split happens. And if you look at where the border is between Orthodox east and Catholic west, it basically runs right there. That's exactly the place where the border is. Lithuania is interesting in that regard. Now, of course, it's Catholic now, but it was also the very last pagan nation in Europe. It did not become Christianized until the very end of the 14th century. And, yeah, so that's pretty recent, relatively speaking. And so the encounter of Christianity with paganism, I mean, most of us who are. Who know anything about church history, we think about the encounter of Christianity with paganism, but we think about it a thousand years before that. Right. So it's all very nicely in the past. It's all very nicely in the books. All of that has been worked through. You know, we don't really even see the lines that much, you know, unless someone's looking for them, especially trying to undermine Christianity, let's say. But with Lithuania, it's very much more recent, just a few hundred years in the past. And even when Catholicism becomes the national religion, there's pockets of paganism that exist for a while. And. And this is the thing that I really want to talk about today. There's a lot of indications of the way that Christians dealt with paganism and the way that Orthodox Christians dealt with being in what was a Catholic majority country. So when that Christianization began to happen in the late 14th century, Orthodox Christianity was already there. Catholicism was, of course, already there. So you get these two Christian traditions kind of competing in the same space for the hearts of pagans, but also simply living with them and being married to them and, you know, doing life with them. Right. So it forms a really interesting place to look at this question. But I, you know, before we get into that too deeply, I want to just actually talk a little bit about the backstory of Christianity with regards to dealing with other religions. Because if we don't know that, then what I'm going to talk about in Lithuania might seem weird. Uh, you know, it might seem surprising or, you know, let's. Let's sweep that under the rug kind of thing. But actually it's. It's normal. It's pretty normal, in fact. Right. So, you know, beginning with. With the Bible itself, just in the Old Testament, for instance, you get the encounter of the people of Israel with, with the pagan religions, the ancient Near East. Right. BAAL worship, of course, number one. Also, there's the worship of a God named Shemesh, who is a Canaanite sun God. And so here's the funny thing, like we all know about the sort of polemic against pagan religion in the Old Testament. You know, there's just all kinds of mocking of pagan gods and all this stuff that we, we love. You know, it's a lot of fun to read. We love the showdown on Mount Carmel between Elijah and the prophets of baal, you know, you know, with the fire from heaven and so forth. But also, what a lot of people don't know is that some of the BAAL imagery, like the fact that he's the rider on clouds that gets used for the son of man in Daniel and in the Gospels, when Christ ascends into heaven. Right."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":422.06,"end":441.86,"speaker":"Jonathan Pageau","text":"That's really important. It's important to notice that, that it's happening in the Old Testament, especially because people don't understand, for example, why we call the Theotokos the Queen of Heaven, because they see that as a title for ancient pagan goddesses. And it's like, yes, that's it. We took it. Like, I. Not just took it, but like, we showed you what the real Queen of Heaven is."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":441.86,"end":486.04,"speaker":"Fr Andrew","text":"Right, right. I mean, okay, so Shemesh is another good one. Right. So one of the hypotheses of Shemesh that was worshiped actually in Jerusalem, in pagan Jerusalem, you know, was called Shemesh, Tzedakah. And so Tzedakah or Tzedek it means justice or righteousness. And so it's the sun. Shemesh means sun, like the sun in the sky. Son of righteousness or Son of justice. Well, this gets used in Malachi to refer to the Son of righteousness who rises with healing in his wings. And then in the Orthodox Church, we use that same phrase, Son of righteousness, in our Nativity of Politikian to talk about Christ who gets worshiped by star worshipers who now go on to worship the real Son of Righteousness."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":486.12,"end":497.64,"speaker":"Jonathan Pageau","text":"Yeah, yeah, yeah. You know, the Troperion, the Christmas Trevarian is a great example of that. Exactly. Where we show how those that worship the stars are now worshiping the maker of the stars."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":497.72,"end":549.18,"speaker":"Fr Andrew","text":"Right, yeah. And we're doing it by taking their pagan language and applying it to Jesus. You know, so it's. It again, it's in Malachi, so it's in the Old Testament. So it's nothing new for Christians. It's in the Old Testament. Right. But the New Testament, of course, does this stuff, too. And there's a lot of examples we could point to. But. But particularly I like to look at St. Paul in the Areopagus, where right before that chapter, before that, it says he's really mad because he sees that Athens is full of idolatry. Right. So initially you get the sense of, oh, okay, so when he goes up to Areopagus and he's going to let him have it, he's going to be polemical Paul. Right. But of course, that's not what happens when he's on the Areopagus. Instead, he takes this altar to the unknown God and says, I'm here to proclaim this unknown God to you. I mean, that altar was a pagan altar that pagan sacrifices were offered on."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":549.9,"end":604.83,"speaker":"Jonathan Pageau","text":"I want to invite you all to the very first symbolic world Summit. Over three days, we will finally meet in real time, in real space. And everyone from this little corner of the Internet will be there to explore the theme of reclaiming the cosmic image. Of course, I will be speaking. There will also be Martin Shaw, who is an amazing mythographer, Father Steven DeYoung of Lord of Spirit fame. There will be Richard Roland from the Universal History series, Vesper Stamper, Nicholas Kotar, and Neil Degrade that you've all seen on my channel. Here and there. For entertainment, we have everyone's favorite apocalyptic band, the one and only Dirt Po Robins. This event will be the chance of a lifetime to capture and embrace our current moment. So join us from February 29 to March 2, 2024, in Tarpon Springs, Florida. Visit the SymbolicWorld.com summit for more information. I will see you there."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":608.11,"end":657.26,"speaker":"Fr Andrew","text":"That altar was a pagan altar that pagan sacrifices were offered on. Right. It was not some crypto Jewish altar or something like that. This is a pagan altar. But you know, even more interestingly, probably a little less obvious, he quotes from two pagan poets. So he quotes from Epimenides of Crete, who that line in him we live and move and have our being. He also quotes from Aratus who talks, who says, you know, and we also are his offspring. Well, both of these lines are about Zeus. Like this is Zeus poetry. And Paul is saying, yeah, I'll take that, you know, I'll apply that to the one true God. Right. So he's subsuming it into what he's doing. He doesn't look at it as being sort of hopelessly polluted."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":657.26,"end":735.27,"speaker":"Jonathan Pageau","text":"Yeah, this is so important. I mean, especially when you look at, I mean, the main objection obviously to Orthodoxy and to Catholicism, from Protestants are often these types of things where they look at the styles of worship or aspects of worship that they can see in the pagan world. They see it coming into Christianity and then they wonder, you know, does it mean that. Well, they don't wonder, they declare then that the worship is pagan. But this is something like, even in terms of the revelation of the tabernacle from God himself, you know, the structure of the tabernacle, is this the structure of every single pagan temple in. Oh yeah, in the world. A three tiered structure, you know, with like the most holy place where you would have that. Usually they would have the idol there that would be hidden and they would be revealed on certain uncertain. In certain feasts or whatever. But the structure itself is, is a universal structure. And so, and so it's the way to see it. It's like you could see it in a bunch of ways, which is that on the one hand the pagan traditions are actually twisting the true faith and now God is twisting it back towards what, towards its rightful direction. Or you could see it that God is able to cover over our sins. Right. He's like, okay, this is what you do. I'm going to take this, I'm going to make it, I'm going to turn it in its right direction. But either way, whether it's one or the other, you know, that seems to be what God is doing all the time, which is saving that which is lost."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":735.67,"end":781.5,"speaker":"Fr Andrew","text":"Yeah, I mean, it says in the Psalms, right, that the earth is Lord's and the fullness thereof. But sometimes people who have this idea of kind of religious cooties. They would say the earth is Lord's and the fullness thereof, except for these parts which are sort of hopelessly not his anymore. You know. Don't, don't touch that. Yeah. So this kind of thing continues. Right. So I gave just a couple of examples from the Old and New Testament. I could, we could talk for hours about just the Bible. But, but Christians continue doing this. So of course, as an iconographer, you know full well that the tradition of Byzantine iconography owes a lot to the tradition of Egyptian funereal art. Yeah, right. Like if you look at the, the art that was on that was related to Egyptian funerals. I mean again, these are pagans, these are demon worshipers. Yeah."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":782.38,"end":879.66,"speaker":"Jonathan Pageau","text":"Even the Roman. It's Roman. It's exactly. It has that Egyptian aspect to it. And then it also has a very strong Roman element. The way that Christ, his blessing hand. Like, would we say that Christ is blessing like this? That's a Roman sign of address. It's a, you can see the Roman emperors doing it in the first century on statues. And so, you know, this is. But it's funny because it would. The funniest thing about this, honestly, Father Andrew, is that the same person that can look at ancient pagan practices and see how Christianity transformed them towards the worship of God will like, without non apologetically have a rock band on stage in church. And like, and I realize that it's like, you know, using the language of the culture to, and transforming it. And it's not even transformed usually in terms of the rock band on the stage. But it's like the Christians actually did a very deliberate theological bringing in of these elements and transforming them. Like the way that Roman art, for example, moves from paganism to Christianity. You can see it happening. You can look at, you know, the essential elements being toned down. You know, the different, these different elements are being toned down. These are played up. You know, the use of the halo was used for the emperor, for example. So now we, we, we. It's a pagan sign that was there before. And so then we're like, no, we're going to reserve this only for the saints, only for Christ and his mother. And so you can see the transformation happening. But it's a, it's not just accidental. Like, it's not just like, it's not just like taking a rock band and putting it on stage in your church. It's a theological transformation of pagan things into the Christian."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":879.66,"end":984.55,"speaker":"Fr Andrew","text":"There's a creative engagement. Right. It's not just sort of adoption. There's an adaptation also happening. Yeah, I mean, there are some things that you could point to as being almost adoption, at least initially, and then the adaptation happens later. One really obvious example are Christian calendars. So the Julian calendar, I mean, it's not named for St Julius, you know, it's named for the divinized emperor. Exactly. It's literally named for what pagans would have regarded as a pagan God. Julius Caesar is a God, you know, from a Roman pagan point of view. And it's not just the Julian calendar. I mean, the Coptic calendar is based on Egyptian paganism, you know. Now we think of these as being calendars that belong to churches, but they didn't start their lives that way. And the churches did not say, let's start with something brand new. And what's funny is they didn't really take the Jewish calendar very much. I mean, there is. There are elements in the church calendar that are from the Jewish calendar, but the basic idea of a solar year, for instance, of 365 or so days, these are. These are pagan things. One of the probably more obvious ways that Christians dealt with paganism early on, and you see it in a lot of saints lives, is that pagan temples get turned into Christian churches. So the altars that were, you know, had had pagan sacrifices put on them become altars to God. Or sometimes what they'll do is they'll take the building, smash the altar, replace that and. But the structure is, you know, a pagan temple. Like lots of examples of that. The Parthenon in Athens, of course, was actually a Christian church longer than it was a pagan temple, but it was a pagan temple, you know, now it's a museum. But, you know, there's a number of."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":984.79,"end":991.27,"speaker":"Jonathan Pageau","text":"Well, the Pantheon in Rome is one of the most. Also the most shining, biggest example that's still at church now."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":991.43,"end":1048.92,"speaker":"Fr Andrew","text":"Yeah. Oh, yeah, yeah. So, I mean, there's. There's a gazillion examples of this, of pagan temples that become Christian churches. And even the basilica architecture itself was from pagan civil architecture. Yeah. You know, so it wasn't even for worship. It was, you know, although there's no such thing as secularism in the ancient world. So civil architecture is sacred architecture in the ancient world. Another one of my favorite examples, of course, is the classic treatise by Saint Basil the Great called the Address to Young Men on the Uses of Greek Literature. And essentially it's his take on how you read Homer and Hesiod and so forth. And he doesn't say, like, that's pagan, don't read it. But instead he actually says, this is the weird part. He says, you need to master this before you can read the Bible. Which, I mean, I don't preach that and I would never counsel anybody with that here in 2023. But I mean, it's a pretty provocative."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":1048.92,"end":1090.24,"speaker":"Jonathan Pageau","text":"Thing to say we do something like that, Father Andrew, which is that, you know, it's like I actually made the mistake with my kids at the outset to just like straight up read the Bible stories to them, which, which, which was probably not the wisest thing to do. And, and I realized that actually fairy tales are a good ramp into Bible stories. And so we usually do something like that with our kids, is that our kids know the fairy tales more than they'll know the Bible stories at the outset. And as they get older, you know, like 8, 9, 10 years old, then it's easier for them to kind of, to take in, especially those Old Testament stories that are rough at the outset. And so I think we do something similar with fairy tales that St. Basil talks about in terms of the ancient myths."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":1090.24,"end":1128.68,"speaker":"Fr Andrew","text":"Yeah. Another example of this, and this is one that's a little controversial, but I'm going to at least mention it. St. John of Damascus, he wrote a text called the Life of Saints Barlom and joestaph. And a lot of people say that this is essentially just an adaptation of the life of Gautama Buddha. Buddha. The Buddha. I don't know if that's true. I mean, I've never really studied this closely. It may be that he simply took that story and told his story in a way that's reminiscent of it. Who knows? I don't know. But it's, but, but there is a possibility that there's at least some kind of influence. And that's not even, you know, that's not the comfortable paganism."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":1129.24,"end":1131.32,"speaker":"Jonathan Pageau","text":"No, yeah, exactly. It's very far."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":1131.48,"end":1139.73,"speaker":"Fr Andrew","text":"Which is so funny. Like, it's funny. We think of demon worship by Greeks and Romans and Egyptians as like, we can deal with that. But Buddhism, like, whoa, whoa, whoa."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":1139.73,"end":1141.01,"speaker":"Jonathan Pageau","text":"What do we do with that stuff?"}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":1141.01,"end":1179.59,"speaker":"Fr Andrew","text":"Yeah, it's freaky. Again, controversial. I'm not saying that that's where he got it from. I, I, I don't know. But you can read about it on the Internet. Some other stuff that's probably a little bit more provocative but much harder to just whisk away. So within Germanic Christianity. So this is later, right, this, you know, Germanic peoples get Christianized later in church history, not until largely like the 8th, 9th century. And as you're moving on. Because it's moving north. Right. Yeah. So a fun example I like to point out to people is there is an object called the Frank's casket."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":1181.27,"end":1184.63,"speaker":"Jonathan Pageau","text":"Yeah, I saw it in the British Museum. It's amazing."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":1184.79,"end":1218.95,"speaker":"Fr Andrew","text":"Yes. Most of it is at the British Museum. There's one panel of it that's in France, although I think they have a copy of that panel at the British Museum. So you can see the sort of. The complete thing. Yeah. Frank's casket is really interesting. So it's made in 8th century Northumbria, so that's northern England. And it's generally believed to have been made by monks. Okay. And it was based on the size and shape, it's probably a reliquary. We're not certain, but. But probably a reliquary. Yeah. You know, and we. It's called a casket, but it's, it's, it's, you know, it's. It's this little box."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":1218.95,"end":1219.47,"speaker":"Jonathan Pageau","text":"Yeah, yeah."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":1219.47,"end":1272.34,"speaker":"Fr Andrew","text":"It's. Yeah, yeah. It's not like to hold a body, but it's the same shape. Yeah. As what we would put a body in. And that's deliberate because if you're going to put a, put the relics of a saint in something, you would want to put it in something that looks like a coffin, you know, at least that's what most of Christian history has done. Yeah. So if you look at the, the, the images on the Frank's casket, one of them is the three wise men, you know, approaching the Virgin holding Christ and they're offering their gifts. And you're thinking, okay, good, this is a good, strong Christian image, no problem. But then you start walking around the casket, you know, figuratively, of course, because again, it's just a little box on, on one side you've got Romulus and Remus, the founders of the pagan. Founders of pagan Rome, you know, in like northern England."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":1272.42,"end":1272.82,"speaker":"Jonathan Pageau","text":"Like."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":1273.46,"end":1273.86,"speaker":"Fr Andrew","text":"Right."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":1274.42,"end":1279.23,"speaker":"Jonathan Pageau","text":"It just shows you that universal history thing that we keep helping, getting people back to."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":1279.31,"end":1287.83,"speaker":"Fr Andrew","text":"And we should say, how many pagans are there in Northumbria in the 8th century? Probably none. It's probably all Christian."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":1287.83,"end":1288.59,"speaker":"Jonathan Pageau","text":"Yeah, exactly."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":1288.59,"end":1333.63,"speaker":"Fr Andrew","text":"Yeah. So there's a. Christians making this thing. There's at least one of the panels that people aren't sure exactly what it is. Another one is a battle that takes place in Jerusalem. And then the one, if you look at the panel that has the three wise men and the Virgin on it and the Lord, it's actually, there's a, it's a 50. 50 panel. So on one side you've got that. On the Other side you have Wayland the smith, who is this semi divinized Germanic smith, you know, divine smith figure, who makes magical weapons and that often gods get apprenticed to so they can become powerful. Like, it's, it's, it clearly. And so it's, it's this pagan image right next to a Christian image on the."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":1333.63,"end":1344.15,"speaker":"Jonathan Pageau","text":"But it's, it's, it's, it's interesting in the casket, because the Christian image is the image of the pagans coming to worship Christ. That's the, that's what the image is."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":1344.15,"end":1362.71,"speaker":"Fr Andrew","text":"Yes, it is. Yes, it is. You know, so it's interesting, you know, this Northern English thing. And so it's got this Germanic pagan image, but then it also has stuff from Roman history all together, because that's the cultural soup of Northern English Christianity in the 8th century."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":1362.71,"end":1390.55,"speaker":"Jonathan Pageau","text":"Yeah, but it's, it's, but it's. If you listen to some of the arguments that you've heard when you were younger like that you heard people say you could. You had these two arguments. One was Christianity is just syncretism, it's all just borrowing from pagans, whatever. And then the other one is Christianity destroyed all the ancient cults. They went in, they broke everything and they, they ruined the whole Christian world. It's like you can't have those two at the same time. The actual reality is that it's neither of those."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":1390.97,"end":1391.49,"speaker":"Fr Andrew","text":"Yeah, that's right."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":1391.49,"end":1413.45,"speaker":"Jonathan Pageau","text":"It's neither of those. And it's Christianity. As Christianity took hold, it integrated the things it could integrate, kind of let fall to the side the things that couldn't be integrated, and it ended up with a world that was based on the ancient pagan world in terms of a lot of the forms, but moving, using its meaning, pointed towards God and towards Christ, you know?"}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":1413.45,"end":1460.34,"speaker":"Fr Andrew","text":"Yeah, yeah. Another fun thing from that same period of Anglo Saxon Christianity. And I just have to mention this because I don't know if Richard's going to mention this in your Beowulf class you're doing with him, but this was something I came across as I was doing translation work on Beowulf. So there's a phrase that shows up in it which is in Old English, it's Alf Walda. Alf Walda. Right. And a lot of editors actually edit this to make it alwalda, to make it a single word, Alwalda. Now, that single word means all ruler. So it's like Pentocrator. Right. And this is referring to God. It's pretty clearly referring to God. But if you look at the actual manuscript, it's Two separate words, Alf and walda. So walda is ruler. Alf means elves."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":1460.58,"end":1461.38,"speaker":"Jonathan Pageau","text":"Oh, yeah."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":1462.02,"end":1577.72,"speaker":"Fr Andrew","text":"So it refers to God as the ruler of elves, which, you know, adjust the translation a little bit, you get lord of spirits. Right, that's right. So. So that's interesting. So that's clearly a Germanic pagan reference. You know, elves. Right. Elves are just kind of spirits in Germanic paganism. Yeah. But again, it's an 8th century Christian writing this. Yeah, yeah, Alfwalda. So, okay, a couple examples from Norse Christianity because I'm comfortable with the Germanic stuff. So in the 13th century, there's a church built in Norway called the Hillistad Stave Church. The church doesn't exist anymore, but its doorposts still do. And they're in a museum now, but they were on a couple of different churches. And if you look at the doorposts, they are carved wood. It's beautiful stuff. It's really, really astonishing. And it is the legend of Sigurd and Fafnir from the Volsinga saga, which again, is Germanic paganism. You've got Sigurd, who is this sort of semi divine figure. You've got Reginn, who is definitely a divine figure. You've got Fafnir, definitely a divine figure. Fafnir, of course, is a dragon. In the legend, you know, Sigurd goes down and kills Fafnir because Regan wants him to so they can get the enchanted gold. And then they decide to. They're gonna eat him. Because when you eat a dragon, it makes you. Gives you magical powers and he actually tastes some of the juices from the heart and it gives him the ability to understand the language of birds as it always does. But this was on the front of a church. Yeah. You know, I had someone tell me one time when I said, can you explain this to me? And they said, oh, well, that was probably to lure in pagans. So they. They would see this and they would come in and. And then they. And I'm like, okay, well, number one, let's imagine you're a pagan. Norse pagan. You see this and then you go in and it's clear that this building is dedicated to worshiping some other God. Like, is that really going to work on you? And number two, there are no pagans in 13th century Norway."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":1577.88,"end":1578.52,"speaker":"Jonathan Pageau","text":"Exactly."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":1578.68,"end":1581.24,"speaker":"Fr Andrew","text":"They're gone for hundreds of years."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":1581.48,"end":1583.32,"speaker":"Jonathan Pageau","text":"For. For several centuries."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":1583.4,"end":1613.53,"speaker":"Fr Andrew","text":"Hundreds of years, yeah. And. And another example, of course, from that time and place. Well, not that place, but close to that place, Iceland. You get the prose Edda, which is one of the major sources of Norse pagan mythology. Yeah. This is written by Snorri Sturlson, who is a Christian. Again, he's never met a pagan in his life because his great, great, great, great, great, great grandparents all got baptized, you know, so he. We don't have any sources of Norse paganism that aren't written by Christians."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":1613.61,"end":1671.57,"speaker":"Jonathan Pageau","text":"Yeah. And you see. I mean, and you can. If you look at the. The. The closer. Like, closer to the Mediterranean, you see the exact same thing happening, you know. You know, the fact that we have Boethius's text, which is a Christian text, written with so much pagan subtext, and all of these allusions to. To these. To these allegorical figures. The fact that you'll find in the Middle Ages, people still invoking, you know, these are just things that were part of Christianity. And. And to try. Yeah, to try to parse it one way or the other is. Is. Is. Is just the wrong way to go. And to. To say that Christianity is basically infiltrated or whatever. No, this was a conscious thing. When you get to Dante, you can see that when Dante wrote his poem, it didn't shock anyone. It's not like everybody was like, oh, no, look at him. He's, like, meeting all these. It's like he's mixing Christianity and paganism. It was just like, oh, wow. This is a great, you know, nice synthesis of what we pretty much think. And we've always thought, we've always believed for the last, you know, 800 years or whatever."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":1671.57,"end":1812.07,"speaker":"Fr Andrew","text":"Yeah, yeah. I mean, it's funny, like, you mentioned Boethius, right? So his constellation of philosophy, the big major text. When Alfred the Great does his translation into Old English of Boethius, he adds in bits about giants from biblical and Enoch texts to sort of expand out that. That stuff. So we just talk. Just think about the layers in that. Yeah, yeah, yeah. Okay, so I want to fast forward a little bit. Another example of Christian, you know, and relatively recent Christian engagement with paganism in Alaska. Very famous Athabascan spirit houses, which, you can see, they're not too far from Anchorage. If you ever visit Alaska, worth seeing. I mean, this is a pagan practice of building sort of little houses over graves for the spirits to live in for a while. And, you know, the saints, the orthodox saints who engaged with these people in the 18th century, let them keep that, but sort of reinterpreted it, you know, got them away from cremation, you know, but reinterpreted this. I mean, you can go see this. So if you go there and you see these spirit houses, they have three barred crosses on them. Yeah, you know, it's, it's really something. And then another thing I wanted to mention that probably would freak some people out, the, the, the numeral system that we use, we commonly call them Arabic numerals. Right. Which. Okay, that doesn't sound too threatening, but actually they are traditionally called Hindu Arabic numerals because they are Hindu in origin and also then really developed by Muslims. So in that, by using those numbers, we are using a, a system that was designed in many ways for numerology and all kinds of stuff like this every day. I mean, we're all doing this. So it's, it's a system that's a combination in some ways at least how it got to us of Islam and of course Hinduism, which is essentially a sort of pagan set of traditions. So that's, that's a lot of fun. Okay, so, okay, that's Christianity and paganism. There's lots of things more we could say about that. But I wanted to talk about historical. Now historical Christian, Orthodox Christian engagement with non Orthodox Christianity, other Christians. Right. Again, we know full well the polemics. We know full well the anathematizations of heretics. I affirm all of that. Right."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":1813.03,"end":1819.91,"speaker":"Jonathan Pageau","text":"But also with what's going on right now, it's a, it's a little tricky. All of it with the synod of synodality or whatever."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":1819.91,"end":1889.02,"speaker":"Fr Andrew","text":"I know, like, it's all in the air. God bless them. Yeah, yeah. So. So I affirm all that. I'm not a dissenter, I'm Orthodox. But also in our history, alongside that. So there is one, there's a feast of the martyrs of Najran, which I can't remember the date of that right now off the top of my head, and I didn't write it down. But the, one of the main figures in that, he's often called Saint Arethus. Now his Arabic name is actually Al Harith. So where is Najran? Najran is basically southwestern Arabian Peninsula. And they were Christians. And there was sort of a Judaizing king named Dun Nuwas who came in and wiped out almost all of them. I mean, there were some left after he did what he did. And so they are commemorated as martyrs on our calendar. Like if you're an Eastern Orthodox Christian of whatever variety, the martyrs of Najran are on your calendar, St. Arethus and so forth. So what kind of Christians were they in Najran? Were they Byzantines? Were they Greeks?"}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":1889.02,"end":1890.94,"speaker":"Jonathan Pageau","text":"Yeah, probably not, no."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":1891.98,"end":1939.04,"speaker":"Fr Andrew","text":"They were mostly what we would call Oriental Orthodox. But there was also a significant presence of the Assyrian Church of the east, the Nestorians. So they're on our calendar. These are actual saints that are on our calendar. And someone might say, well, you know, martyrdom. You know, martyrdom kind of cleans up some of. I mean, actually we have saints saying that the. The blood of martyrdom does not wash away the stain of heresy. And yet these are martyrs that are on our calendar. Yeah. Right. Another related figure from this time and place is he's called St. Caleb or St. Elizabon. He is the king of Aksum. So anyone who's been watching your show, your channel for a while knows where Aksum is."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":1939.04,"end":1941.96,"speaker":"Jonathan Pageau","text":"He's a saint on our calendar."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":1942.04,"end":1956.2,"speaker":"Fr Andrew","text":"Yeah. Oh, yeah. Really? Yeah, yeah. Because he's related as he's sort of a protector of these Najran Christians. Again, I mean, he's the king of Ethiopia or Ethiopian Kingdom, which makes him. And this is late enough that makes him what we would refer to as Oriental Orthodox."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":1956.2,"end":1956.6,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":1956.92,"end":1958.44,"speaker":"Fr Andrew","text":"Again, he's a saint on our calendar."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":1958.93,"end":1961.57,"speaker":"Jonathan Pageau","text":"I did not know that. This is amazing information, Father."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":1961.57,"end":1992.14,"speaker":"Fr Andrew","text":"Yeah, yeah, yeah. So another example I would give, you know, Saint Isaac of Syria. Not a martyr. Not a martyr. As far as we know, he dies in peace. Canonically, he belongs to what we would recognize as the Assyrian Church of the east than Nestorians. Now, I've never heard that there's anything in his theology or any of his writing that is an historian. Yeah. But his whole life was spent outside the canonical boundaries of, you know, what we would recognize as the Orthodox Church. Yeah."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":1992.22,"end":1993.94,"speaker":"Jonathan Pageau","text":"What would you do without St. Isaac, though?"}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":1993.94,"end":2009.38,"speaker":"Fr Andrew","text":"And his writing can't get rid of St. Isaac. Come on. Through his writings, he becomes a saint to the Orthodox Church. Right. Again, what do you do with that? I don't have a theory for this, by the way. Like, some sort of method by which you."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":2009.38,"end":2027.11,"speaker":"Jonathan Pageau","text":"Oh. But I think that's probably the best way to understand it, is that it's not a. It's not. There's the rule and then there's the messiness of the reality. Right. It's like there's the. There's the kind of organic recognition of holiness that the Church. That the Church does. And it's like, how did it happen? I don't know how it happened, but there it is."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":2027.11,"end":2027.71,"speaker":"Fr Andrew","text":"And it's."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":2027.95,"end":2032.91,"speaker":"Jonathan Pageau","text":"It's like, don't argue with St. Isaac, you know, I dare you to. It's like, he's a. He's such an amazing saint."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":2032.91,"end":2037.07,"speaker":"Fr Andrew","text":"Yeah. And it's been. I mean, it's been long enough. Like, there's no. There's no Going back on this."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":2037.23,"end":2038.11,"speaker":"Jonathan Pageau","text":"Yeah, yeah, exactly."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":2038.11,"end":2047.34,"speaker":"Fr Andrew","text":"Yeah. You can't kick him out, you know. Certainly. Yeah. Although there are examples where we did."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":2047.66,"end":2048.22,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":2048.86,"end":2060.86,"speaker":"Fr Andrew","text":"So one example. Not talked about a lot, but there was, and I can't remember which one it was now, but there was a metropolis in Greece that some centuries ago celebrated the feast of Thomas Aquinas."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":2062.14,"end":2062.54,"speaker":"Jonathan Pageau","text":"Really?"}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":2062.54,"end":2089.88,"speaker":"Fr Andrew","text":"I mean. Oh, yeah, yeah, yeah. In fact, I think there are recordings available of his hymns, Orthodox hymns for Thomas Aquinas. Now, is that still happening? No, it's not. But you know, he was another, another example of someone that through his writings. Because there's a whole like Orthodox history of engagement with the writings of Thomas Aquinas. Yeah, of course, through his writings, at least in one place for a while, he became celebrated as a saint."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":2089.96,"end":2090.44,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":2090.68,"end":2091.64,"speaker":"Fr Andrew","text":"It did not last."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":2092.6,"end":2107.8,"speaker":"Jonathan Pageau","text":"And I know there are some. Like, for example, there's a, a pilgrimage site, Our lady of Walsingham in England, that is recognized by the Orthodox and that the Orthodox go to on pilgrimages, but that is from after the schism."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":2107.8,"end":2110.28,"speaker":"Fr Andrew","text":"It's like. Yeah, it's got an Orthodox chapel there."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":2110.36,"end":2111.24,"speaker":"Jonathan Pageau","text":"Yeah, exactly."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":2111.8,"end":2160.99,"speaker":"Fr Andrew","text":"That I think is maintained by an Orthodox nun. So I want to give one final example before we start talking about Lithuania. But I just kind of wanted to set up these patterns that exist that exists everywhere in church history. There's thousands more we could probably talk about. So a writer named Lorenzo Scuppoli is a 16th century Roman Catholic priest and he wrote a book called Spiritual Combat. And it's about, I mean, it's, it's about what it says on the label. Yeah. So this, this, this work became very interesting to a lot of Orthodox Christians. And in the, a 18th century, Saint Nicodemus of the Holy Mountain, you know, the guy who puts together the rudder and the exomilucatarion, you know, and the Ortho."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":2160.99,"end":2163.11,"speaker":"Jonathan Pageau","text":"Orthodox, like the most Orthodox."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":2163.19,"end":2187.42,"speaker":"Fr Andrew","text":"Yes, yes. People look at him as like super hardcore, you know, anti everything I don't like. He takes this work and edits it a little and puts it out in Greek. I mean, again, this is about 16th century Catholic priest. Right. And then it gets further revised and published in Russian by Saint Theophan the Recluse."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":2187.42,"end":2187.82,"speaker":"Jonathan Pageau","text":"Wow."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":2188.14,"end":2233.62,"speaker":"Fr Andrew","text":"So Saint Theophan, you know, does even more with it. Right. So Saint Nicodemus just sort of edits a little bit. I'm not sure how extensive the edits were, but Saint Theophan's edits were much more extensive that I know. And then, you know, there's even a sort of set of volumes that were actually put up by Conciliar press a long, long time ago with titles like Victory in the Unseen, Warfare and sort of stuff like this. That was a sort of layman's version of this, you know, like taking it apart and looking at it and explaining it and so forth. Right. So this is a Catholic text that's made its way into the Orthodox Church and actually been handled and promulgated by saints. Yeah, by saints. You know, again, no one doubts the orthodoxy of Saint Nicodemus, but no one does. The orthodoxy of Saint Theop and the Recluse. These are significant saints of the, you know, relatively modern period."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":2234.82,"end":2268.05,"speaker":"Jonathan Pageau","text":"That's amazing. I mean, but I think, in some ways, to me, at least, what it does is it's. I think it. It's there to also keep us humble and to be careful, you know, to understand that God, we don't. We don't control. We have the cannons and we should live by them. But that also God is not in the box that we think he is. God does not. You know, it's like we need God and God does not need. You could say, does not need us. In the same way, let's say that God is manifesting himself where he pleases."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":2268.13,"end":2272.13,"speaker":"Fr Andrew","text":"That's right. That's right. Okay, so let's talk about Lithuania."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":2272.13,"end":2272.61,"speaker":"Jonathan Pageau","text":"All right."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":2273.49,"end":2361.92,"speaker":"Fr Andrew","text":"With all that background. Yeah. You know, everywhere you go there, pretty much every Catholic church, and I've even seen some of this in some of the Orthodox churches, although most of the Orthodox churches there are very Russian. But almost everywhere you go, you see the sun cross. Right. Again, it's what it says on the label. Right. It's a cross with a sun sort of imagery integrated into it. There's lots of versions of this. And sometimes you'll see a crescent moon at the bottom, which is interesting. Orthodox Christians seeing a crescent moon at the bottom of a cross, we largely might think of, okay, this is about conquest of Islam. But in the Baltic case, it's not. The Balts are not conquering Islam. It exists there, but only it's always been a minority, you know. Yeah. So it's the sun and moon, you know, and. And this cross was a pagan symbol. It was absolutely a pagan symbol. And now you see it on the top of almost every single church in Lithuania. You know, there are no Lithuanian pagans still around, although there are some neo pagans, but that's a newer thing. Yeah. So the Baltic, they're just larping anyways, God bless them. I think that is true. So. So one really interesting bit of material culture from pagan Lithuania is something. And I know I'm going to mispronounce this, but you probably don't have a lot. Actually, you do have some Lithuanian fans. Oh, you do? I met some of them when I went to Lithuania."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":2361.92,"end":2362.72,"speaker":"Jonathan Pageau","text":"That's hilarious."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":2362.72,"end":2374.09,"speaker":"Fr Andrew","text":"In fact, when I gave. I gave a year ago when I gave a talk at a church in Vilnius, of the first questions that someone asked me was, do you know Jonathan Page? It's like, well, he's Canadian. He's Canadian. Yeah."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":2374.57,"end":2377.13,"speaker":"Jonathan Pageau","text":"Well, that means I need to go to Lithuania. I've always wanted to go."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":2377.21,"end":2382.01,"speaker":"Fr Andrew","text":"Oh, you totally. If you go, I will go with you. All right. If you would accept me to go."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":2382.01,"end":2384.17,"speaker":"Jonathan Pageau","text":"As your fellow pilgrim, let's do it."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":2384.49,"end":2401.74,"speaker":"Fr Andrew","text":"I think you would find it a very interesting place to go. So, yeah, so there's a figure from Baltic paganism called the Dyrbis, and what that word means literally is God maker. So a God maker is a carver of religious images."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":2401.82,"end":2402.86,"speaker":"Jonathan Pageau","text":"Oh, there you go."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":2404.22,"end":2423.18,"speaker":"Fr Andrew","text":"So that's. That's what that is. And so back in the day, you know, this guy would have been essentially carving idols. Right? Idols, and also then used in actual pagan worship, but then also essentially pagan icons that are used for devotional purposes."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":2423.18,"end":2424.86,"speaker":"Jonathan Pageau","text":"Like house idols and things like that."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":2424.86,"end":2508.28,"speaker":"Fr Andrew","text":"Right, right. And so these are. These traditionally were placed up on top of wooden poles. And so this is called. I know I'm going to get this wrong, too. Which means chapel pillar now is sort of the idea. So you can see that word couplet is related. Part of that piece. Couplet is related to the word chapel. And so it would be a wooden pole and then on top of it you would have this carved statue and then there'd usually be a roof over top of it and then often the sun cross on top. Right. So this survives. But now if you find one of these things and they're actually all over Lithuania, like, you could just be driving along and just see one by the side of the road, often in the middle of nowhere. You know, if you see one now, you're not going to find dievas or perkunas. You know, who are these Baltic gods? You're not going to find them on the cottlestopus. You're going to see most often there's a figure called Rupin toyelis. So Rupanto Yeles is Christ, as he's going to his passion. So there's sort of two different poses. You'll see him like with his face in his hands like this, often called the Pensive Christ. Or you Sometimes see him standing and bound, you know his hands are bound. Yeah. So this is Rupin to Yellis, often called the Pensive Christ."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":2508.76,"end":2517.16,"speaker":"Jonathan Pageau","text":"That's the most Russian tradition of that too. Of like in some of the remote places of Russia they have this whole carving tradition with that figure. Very important."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":2517.56,"end":2569.35,"speaker":"Fr Andrew","text":"Where do you think they got it? Yeah, yeah, it's probably the same from there. It's from the Baltics and of course it spreads into. It's throughout the former Polish Lithuanian Commonwealth. So you've got it in Poland as well. They've got it in Belarus, they've got it in Ukraine. Yeah. Often then you'll see if you don't have Rupin Toyelas there, you'll see the Virgin Mary, you'll see lots of saints. Especially St. George is pretty popular. Also of course the Catholic saint Casimir who is the Catholic patron of Lithuania. Not an Orthodox saint but he's their big saint, he's buried there in their national cathedral. So related to that you'll also see again the same the carver, the wood carver called a Kris Dirbis which means cross maker."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":2569.35,"end":2570.07,"speaker":"Jonathan Pageau","text":"There you go."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":2571.11,"end":2593.4,"speaker":"Fr Andrew","text":"And you know the Lithuanian standing crosses are basically an extension of this dievdirbis practice. That's the name of the person, but I don't remember what the name of the practice itself is, but it's an extension of that. But it's. But obviously focusing on the cross itself. Right. And they can be incredibly ornate."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":2593.4,"end":2595.44,"speaker":"Jonathan Pageau","text":"Yeah. You know I just made one by the way."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":2595.92,"end":2596.56,"speaker":"Fr Andrew","text":"Oh really?"}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":2596.64,"end":2610.56,"speaker":"Jonathan Pageau","text":"Yes. 3 meter, like 9 foot across with a single mass that goes into the ground and, and it's three goes into three and there's Mother of God and St. John, the sun and the moon at the top and a little roof at the. At the top. Yeah, yeah. Massive project."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":2610.96,"end":2661.44,"speaker":"Fr Andrew","text":"Yeah, yeah. And so sometimes there will be little statues embedded right. At the, the point where the cross pieces meet. Usually Christ again, often, usually the rupuntoyelis, but it can be other figures sometimes too. And again you'll see these by the side of the road. They will be placed there sometimes in commemoration of an event or of people. A lot of pious people just put them in their yard like so you'll, there'll be this 10, 15 foot tall cross in the front yard, you know, and a lot of churches have them in the churchyard. Yeah. As well. So. And then of course the, the classic, you know, place where people might have seen these is the hill of crosses where there's hundreds of thousands of them and there's actually a legal limit on the Size of a cross you're allowed to place there, which is nine meters."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":2665.44,"end":2666.48,"speaker":"Jonathan Pageau","text":"That's amazing."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":2666.48,"end":2670.22,"speaker":"Fr Andrew","text":"So if you're gonna. If, when we go to Lithuania, decide you want to put across there, just."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":2670.22,"end":2683.98,"speaker":"Jonathan Pageau","text":"Be aware that that's less than 9 meters. I love it. It's hilarious because it's like in North America, you would expect it to be like five feet or something. Something like some ridiculous small thing. It's like. Well, there is a legal limit, but, you know, nine meters. Don't go beyond that."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":2683.98,"end":2736.26,"speaker":"Fr Andrew","text":"These things tower over you. I mean, it envelops you. It envelops you. Yeah. And, you know, this is. In many ways, this is a spiritual heart of this country. And it's not just Roman Catholics that go there, although obviously mostly Catholic. You can go there, and you can see Orthodox crosses there, and. And Protestants go there as well, you know, and often you see people writing on many of them. It's usually lists of names of people that they want to pray for. And most of the writing, of course, is in Lithuanian, but you can see many languages, many, many languages from all over the world, people that have made their pilgrimage, brought their cross there. So, I mean, it's largely regarded as a kind of a Catholic place of pilgrimage. But Orthodox Christians go there. I've been there twice now myself. I placed across there both times and brought, you know, two of my children with me. They placed across there with the names that they wanted to pray for on there. You know, what is the."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":2736.42,"end":2743.94,"speaker":"Jonathan Pageau","text":"This hill? What is the story about the hill? Like, why. Why do people go there? What's the. What's the legend or the story related?"}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":2744.74,"end":2874.57,"speaker":"Fr Andrew","text":"So there's a lot of. There's a lot of different origin stories for the Hill of Crosses, but the one that I think is the truest one. So the Hill of Crosses seems to have arisen during the Russian imperial period. That's the earliest references to it. So you're talking, like early 19th century, possibly. And there's a tradition that there was a man who had a daughter who was very, very ill. And so he was at her bedside every night, praying to God to please heal her. And then finally, after a long time of this, the Virgin Mary appears to him and says, take up your cross and bring it to the place that I'll show you. And so this man becomes a Chris Dirbis, and he fashions this wooden cross and he starts carrying it, you know, and it's. It's a long distance. And then finally she appears to him again and says, this is the place. And so now Lithuania has no mountains. So actually the word kunlas for mountain just means a hill. So they'll use the same word like they would use kolnas to refer to the mountains that we have here in North America. But they know full well that there's no comparison between them. So it's a hill and it's kind of a long hill, so it's spread out over a ways and has a couple of peaks to it. And so he places the cross in this hill and then he begins the walk back home. And then when he is reaching his. Where his home is, two people come running out of the house to, to greet him. One is his wife and one is his healed daughter who now can not only stand, but run, you know, and so, so then it, the tradition then grows that you, if you're going to go there, you bring across and it can be, I mean, people bring crosses that are like this, everything from this to, you know, nine meters smaller ones, people will hang from bigger ones. So you can find crosses that have like hundreds of crosses hanging from them, leaning up against them. I mean, it's just, it's just a mess of crosses, but a beautiful mess."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":2874.81,"end":2875.29,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":2875.85,"end":3048.25,"speaker":"Fr Andrew","text":"And then, you know, it gets, especially during the Soviet period, the Soviets, of course, hated this place. So they would bulldoze it down or light it on fire and they would wipe it all out. And then overnight it starts growing back because people just come and they place their cross and they pray their prayers. You know, some place the cross there because they're praying for someone who's ill or praying for someone who has died. Some place it because of a happy occasion. Like the first time I went, for instance, there's a woman who's bringing along her, her boy and says, come on, let me show you the place where I put the cross when you were baptized, you know, so, so that kind of thing. Again, it's a place of sort of universal Christian pilgrimage. They don't check your religious ID card at the door. So. Yeah, another one that's probably a little bit controversial from Lithuanian history and, and people might not realize it's Lithuanian history is the Orthodox St Peter Mohila. So St Peter Mohila is the Metropolitan of Kyiv after the loss of the churches to the uniats. So Kyiv, of course in Ukraine, but the Grand Duchy of Lithuania includes both of Belarus and Ukraine at that point in history. And at that point is actually then part of the, the, the Polish Lithuanian Commonwealth. Right. So St. Peter Mohila, a lot of people pointed him and say he's a Latinizer. You know, he's just, he's using Latin textbooks, he's a Latinizer, he. Whatever. But he's a saint. He's an actual orthodox saint. So that means you have to deal with what he did. We can critique it, but there's actually been, you know, so some scholars, of course, like Father George Floroski really critiques him and says this is a Latinization, and so on and so forth. But there's other scholarship that you can read now that essentially says, well, St. Peter was actually trying to do with Catholic theology that was around him and that he had to deal with because he's living in it. He was trying to do with that like the early Church fathers were doing with pagan philosophy. So I'm. I'm not an expert to tell you what the truth of the matter is. But I mean, this is another way of interpreting him and it's worth kind of exploration. So that's actually a theological engagement. It's not just sort of material culture stuff. It's actually like language and so forth, you know, so that's a really. He's a really interesting figure. I want to finish up by talking about a couple of icons, but before I do that, there's a significant practice that I want to mention. So in Lithuania, there is a two day holiday called Valenus. So velinus from the word, I think it's Veles, which means soul. So Velinus is November 1st and 2nd."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":3048.97,"end":3050.25,"speaker":"Jonathan Pageau","text":"They're all souls, basically."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":3050.33,"end":3087.05,"speaker":"Fr Andrew","text":"Exactly. It's the feast of All Saints and All Souls. And in the Catholic tradition and the practice in Lithuania on those days is to visit the graves of your departed loved ones. So if you go to Lithuanian cemeteries, they're not like most cemeteries in North America where it's just row upon row of stones and they've hired somebody to mow the lawn. And there might be flowers that people put that die, you know, whatever. You know, there's sometimes. There's more to that. More than that. But I mean, most cemeteries in the U.S. yeah. I don't know a lot about Canada, but most."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":3087.05,"end":3088.57,"speaker":"Jonathan Pageau","text":"No, it's the same. They're pretty bare."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":3089.05,"end":3100.81,"speaker":"Fr Andrew","text":"Yeah. In Lithuania, every single grave plot is outlined in either cement or stones. So they're like little or. Or sometimes a fence."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":3100.97,"end":3101.45,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":3102.09,"end":3109.37,"speaker":"Fr Andrew","text":"And they're all like flower gardens and they're immaculately taken care of. And it's not because there's some gardener. Can you imagine how much work that would be?"}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":3109.37,"end":3109.85,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":3110.25,"end":3216.36,"speaker":"Fr Andrew","text":"You know, they're that way because the family takes care of them. I went to the Cemetery where my ancestors are buried. And I went to the grave and we found the grave actually of my family, which was an astonishing moment, you know, and it's. It was immaculately taken care of. Everything was in perfect order. Perfect order. Right. So. So Lithuanians visit the graves of their relatives twice a year, once on the day that is the end, the anniversary of the death. And then also at Venus. Right. And particularly at Villainous, they will bring candles and place them there. And so if you go to cemeteries in Lithuania at night during Villainous, it's almost like another city with all the candles. I mean, it's just. You can see an outline of the cemetery in candles. It's just completely filled in with these little flickering flames. So Orthodox Christians do this in Lithuania on those days, even though those. That's not the Orthodox feast of All Souls or of the departed, but they do it. They visit the graves of their relatives, they put the candles, there are specific prayers to be prayed when you go there. Now, it's interesting. There's a sort of Orthodox adaptation that's occurred. So the Saturday before the feast of Saint Demetrius at the Slaniki is traditionally a Saturday of souls. Right. We think of usually the ones in Lent, but. Or around Lent, but that's also a Saturday of souls, traditionally in the Orthodox Church, the Saturday before October 26th. Right. So, of course, most Orthodox Christians, Lithuania, are on the old calendar. So that would mean that it's about November 8th or whatever is when that. Or actually it's a Saturday before November 8, which sometimes would kind of coincide with Villainous."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":3216.36,"end":3217.32,"speaker":"Jonathan Pageau","text":"Right, right, right."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":3217.32,"end":3316.78,"speaker":"Fr Andrew","text":"You know, because of course, the Catholics are on the new calendar. So what they do is they visit the cemeteries on Velinus. And then on that Saturday, that's usually right after they go to church and they pray for the departed in church. So they created this hybrid practice. You know, again, they're just. They're they're taking something from Catholic practice and they're engaging in it themselves. And there are. You talk to Lithuanian Christians and a lot of them will say, now, I don't know if the truth of this. A lot of them will say, oh, Villainous actually is. Is pre Christian. Yeah. Which is believable, you know. Yeah, yeah, totally believable. So, yeah, so they make this kind of annual pilgrimage to the graves of their family. And again, it's not because it's a feast day on the Orthodox calendar. It's. It's. Now those, those are public holidays in Lithuania. One of the advantages of what is at least still Officially a Christian nation. They have religious freedom. But you also get November 1st and 2nd off from work in school. You also get, you know, August 15th off. You get, you know, June 24th. You know, like, in fact, St. John's Day in June is a. It's called Yoninis is a huge holiday there. Huge, huge holiday. Right. And a fun little thing. I was talking one of my Lithuanian friends one time because we had started to see fireflies in our yard. I don't know if you have them where you are. And I asked him, I said, do you have fireflies in Lithuania? He said, oh, yeah, we have fireflies. We call them yonvales. I was like, what does yonvabalas means? He says it means St. John's bug. So they literally name the fireflies after the forerunner there in Lithuania, probably because of the."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":3316.86,"end":3319.94,"speaker":"Jonathan Pageau","text":"Probably because of the summer feast, time of year. June 24th."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":3319.94,"end":3394.02,"speaker":"Fr Andrew","text":"That's right. Right, Exactly. Exactly. Okay, so I want to. I want to finish up with Lithuania talking about two different icons, one that a lot of people probably know about. And I think we talked about when I was with you, with Richard, when we talked about this documentary, the Wolf and the Cross, before, and that's Our lady of the Gate of the Dawn. I won't go into a lot of detail because we talked about it before, but it's worth noting that this icon, which is above a gate in Vilnius, the Capitol, there's some possibility that it might have an Orthodox origin. There's some possibility that it might have spent some time in Orthodox churches, but there's no good evidence for that. Even if all of that is true, for most of its life, it's been in a Catholic chapel. In fact, one of the times I went to see it in my most recent trip, Mass was going on right in front of it when I went there. Right. This is the national icon of Lithuania, Our lady of the Gate of the Dawn. And it's. It's the Theotokos as she's depicted in Revelation, chapter 12. Clothed in the sun, the moon at her feet, a crown of 12 stars. Like that's. That's the image. Right. And a copy of this icon was very likely given to Saint Seraphim of Sarov and is the famous icon in front of which he prayed and in front of which he died."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":3394.18,"end":3394.7,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":3394.7,"end":3758.07,"speaker":"Fr Andrew","text":"You know, given to him probably in Kiev, because veneration of this icon spread throughout, you know, the Polish Lithuania, Commonwealth, Grand Duchy of Lithuania. You know, Orthodox Christians make pilgrimage to that icon, venerate that icon. It has A feast day on the Orthodox calendar. This, as far as anyone has ever known, Catholic icon is celebrated on the day after Nativity. And local Orthodox Christians, including the bishop, including clergy, go and pray a Malevan in front of this icon on the day after Christmas in this Catholic chapel. Yeah, right. And it is, you know, it's, it's. This is the, the calendar of the Russian Orthodox Church has this icon on it, lesser known. And this is one of the visits I made in my most recent stop in Lithuania. So there is a monastery near Kaunas. So Kaunas is sort of the second city of Lithuania. It's in the center of the country. It was for a time the capital during the interwar period because Vilnius was held by the Polish during that period. And so the capital gets moved to Kaunas and second largest city. So there's a monastery near Conis called Pazyslas Monastery. So Pesyslis was built, as I recall correctly, in the, either the 16th or 17th century. And it was built as a Catholic monastery. Right. So it's built by Catholics, for Catholics. And you know, this is the, the Polish Lithuanian Commonwealth period. And so Catholicism is the official state religion of the whole Commonwealth. Of course, there's still Orthodox minority, a significant Orthodox minority, especially if you look at the areas that are now Ukraine and Belarus, but even still Lithuania proper, there was some Orthodox. So Pajisus Monastery. One of the things that's made for this monastery is an icon of the Virgin Mary. And so it's called Our lady of Pagesis. Right. And if you look at it, it's. It's painted probably by an Italian. It seems to have been a gift from the Pope. If you look at it, it's a very Western sort of Renaissance depiction. You know, it's not, it's not sensual at all. Right. It's actually very restrained. You know, there's a sort of a circle of roses in the icon. So I mean, it's not a Byzantine icon at all, like a circle of roses. Like if you put that on an icon, you know, that would get returned probably, you know. And so it's definitely a very Western depiction. Pages about an Italian gift from the Pope for this Catholic monastery. Okay. And it's venerated. You know, miracles start to be associated with this icon. So in the late 18th century, the partition of the Polish Lithuanian Commonwealth is complete with a third partition and Lithuania becomes part of the Russian Empire. Okay. So the Russian Empire, I'll just say, was not kind to Lithuania and in many cases engaged in religious persecution, which if you're interested in that episode four, which has not yet been made, but episode four of the Wolf from the Cross is going to be talking about Lithuania and the Russian Empire. It's not going to be a comfortable story for a lot of people. It's just the reality. The Russian Empire engaged in religious persecution of non Orthodox. And so one of the things that happened was churches and even monasteries that belong to the Catholic Church were taken and given to the Orthodox. Right. And Pajis Monastery is one of those places. So in the. I think it was in the 19th century, it becomes a Catholic, an Orthodox monastery. And I should mention, by the way, you know, the architecture and the interior decor of this monastery is absolutely astonishingly beautiful. It's really something very different from a lot of Western churches, definitely different from Eastern churches, but it's really, really worth looking up. Anyway, so. So what do they do with this icon that's like the altarpiece, you know, so it's a major, very prominent image in this church. What do they do with this icon? They say, oh, look at this Italian thing. Let's get this out of here. Get some good Russian iconography in here, you know. No, they keep it. Yeah. And they venerate it. And they take the Catholic feast day of the icon and put it on the Russian calendar. So it becomes a feast of the Orthodox Church of this miracle working Catholic icon. Orthodox Christians make pilgrimage to it. They especially would go on the Dormition. The feast day is July 15th. It remains on the Russian Orthodox calendar. If you go there now, it is once again a Catholic monastery. And so it was given back. And when Lithuania became independent in 1915, I think it was from the Russian Empire. A lot of churches that have been taken from the Catholics were, were given back to them, you know, and so it reverts to being a Catholic monastery. So here's a couple of fun details. Not only do Orthodox Christians continue to make pilgrimage to this Catholic monastery to venerate this wonder working icon that has a completely Catholic origin but was sort of Orthodox for a while. The, the Orthodox Church maintains the feast icon even though the Catholics have moved it. So what you're looking at when you see the July 15th feast is the old Catholic feast day maintained by the Orthodox Church even now. Right? Yeah. So. So this is still like, you can look this up, the Russians call it, which I'm sure I'm probably mispronouncing, but it's probably pretty close. But the name of the monastery is Pazeislas, you know. And so again, this is an example of this sort of Horus border. Yeah, Right. It's, you know, one could look at that and say, ah, syncretism, you know, but what's happening is simply as we looked at the tradition of the church."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":3758.23,"end":3758.63,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":3758.63,"end":3790.38,"speaker":"Fr Andrew","text":"From the Bible, early Christianity and so forth. Right. So. So those are just some examples that I could point out. I mean, there's. There's a number of other things that we could mention. Like burial practices. For instance, Orthodox burials in Lithuania tends to. Rather than having the cross at the foot, which is sort of the Orthodox tradition, they often will put the. At the head, which is, you know. You know, there's other things you could mention like that. But. Yeah. So, you know, in our life."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":3790.38,"end":3814.3,"speaker":"Jonathan Pageau","text":"I mean, it's like, in our life, this is. At least for my life, this is true. You know, I. To be honest, like, you know, you're not gonna take my Christmas songs away from me. I don't know what to tell you. It's like, I love Western Christmas songs. I think they're beautiful. I think they're wonderful. I wouldn't want them sung in liturgy. But you're not gonna completely take them away from me. Like, you will hear them in my house, and we will sing them and we will love them, you know, so there's some of that all over the place, I think."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":3814.3,"end":3829.53,"speaker":"Fr Andrew","text":"Yeah. I mean, like, just like, let's just look at Orthodox Christianity here in the West. We've taken a whole bunch of stuff from other Christians, largely without a lot of analysis in many cases. Right. So Sunday school, I mean, Sunday school, I thought."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":3829.53,"end":3830.17,"speaker":"Jonathan Pageau","text":"Exactly. Sunday."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":3830.25,"end":3874.77,"speaker":"Fr Andrew","text":"Sunday school is probably the most obvious. Seminaries, I mean, you know, now seminaries existed in Orthodox history before it ever made it to here. But seminaries are not the ancient Christian tradition. Like, there are other ways of training clergy. You know, you mentioned Christmas carols. I mean, that's a really, really good example. Christmas carols. And, you know, it's great. You know, many. Many Orthodox in the west will sing the Christmas carols from wherever their tradition is from. But, I mean, you can still get to hear Joy to the World and Silent Night and, you know, this stuff that's. That's just the English language Christmas carol repertory. You know, Another great example I think, of this is the fact that we have parish membership."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":3875.25,"end":3875.97,"speaker":"Jonathan Pageau","text":"Yeah, yeah."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":3876.13,"end":3880.57,"speaker":"Fr Andrew","text":"That's not a thing. In. Mostly on the other side of the Atlantic in Orthodox. Yeah."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":3880.57,"end":3882.37,"speaker":"Jonathan Pageau","text":"Parish councils and all that stuff."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":3882.37,"end":3905.02,"speaker":"Fr Andrew","text":"Parish councils are another big example of that. And, you know, something that's near and dear to both you and me. Media. Yeah, yeah. Using Using especially modern media for orthodox purposes. The Catholics and the Protestants were there long, long before us. Right. So. All right, so I mean like what, what do you, what's the takeaway from all of this stuff?"}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":3905.1,"end":3940.28,"speaker":"Jonathan Pageau","text":"Yeah, it doesn't mean that anything goes. I think it's important to be careful. It's like we're not at all saying that. All right, so then, you know, whatever. Like it all, it's all, it's all. But it, it's really about hierarchy. You know, it's usually just an understanding of hierarchies that we have. We have the, the main traditions. We have the cannons, we have all of these things which guide us. And then we have to understand like a machine. They're not like a computer that runs and that, that tabulates. It's a, it's an organic reality that's connected to the world and, and there's room for God to act within that in ways that surprise us constantly."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":3940.52,"end":3984.87,"speaker":"Fr Andrew","text":"Yeah, I mean, you know, like, so like, why does the church do this? How does the church do this? The first question I think is easier to answer than the second one. But I, I should say it's not about putting a stamp of approval on non orthodox religion. Obviously not the same Old Testament that, you know, pokes fun at the gods of the nations, also steals their stuff, you know. Right. So. So it's not about putting a stamp of approval. It's not. Right. It also doesn't happen without creative engagement. Like there always changes me to the work to make it conform to orthodox Christianity. And it can be maybe a little uncomfortable to see that in process."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":3985.19,"end":3986.47,"speaker":"Jonathan Pageau","text":"Yeah, it's a mess."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":3987.27,"end":3987.63,"speaker":"Fr Andrew","text":"Clean."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":3987.63,"end":3989.59,"speaker":"Jonathan Pageau","text":"It's not a clean thing. It's messy process."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":3989.75,"end":3996.39,"speaker":"Fr Andrew","text":"And, and you know, I've, I've studied this and I intend to study this a lot longer, but I, I haven't found like a theory of it."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":3996.47,"end":3996.87,"speaker":"Jonathan Pageau","text":"No."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":3996.95,"end":4046.51,"speaker":"Fr Andrew","text":"Like this is how you do that well or correctly, you know, but it's, it's still a thing. It's, it's happening. Right, so like the why of it. Right. It's because whatever is being adopted and adapted, I think it's important to put those two words together in this. Adopted and adapted. It was seen as being for the salvation of Christians. Like, it's not about like, oh, I want to adulterate my pure. Or, or oh, I'm some kind of, you know, liberal ecumenist. That's not what's going on. That's, that's not what's going on. It's, it's like, oh, here's something that we can use for the salvation of people. And like I, I, I said this in the most recent episode of Wolf in the Cross. An icon of the Theotokos is an icon of the Theotokos."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":4046.51,"end":4046.99,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":4047.95,"end":4107.43,"speaker":"Fr Andrew","text":"Like it is what it is. Like it might have been made by somebody that I would regard as, as a heretic. It might have spent all of its life in the hands of people who are not orthodox Christians, but it still is what it is. Yeah. And the church is able to recognize that and does recognize that. It's funny, we have this saying now from the Zeitgeist, Love is love. Now, they don't mean by that what I'm about to say, but love is love, which means that someone who's actually engaging in acts of love, real love, Christian love, is doing it even if that person is not a member of the right church. That's right. It is real. All truth is God's truth. I mean, Saint Justin Martyr very famously talks about the, the spermaticos Logos. Right. That the logos and seed form that he sees everywhere. I mean, he's looking at pagan philosophy. And we should remember that pagan philosophers are not just, not a bunch of ivory tower academics who never sully themselves with religion. These are actual demon worshipers."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":4107.67,"end":4128.56,"speaker":"Jonathan Pageau","text":"Yeah, well, also, I mean, it's, it's like read, read Plato, folks. It's, there's stuff in Plato that you would blush at. And so, you know, so the idea that we can read it as Christians and we can take the good and let leave the bad fall to the wayside is something the Christians did from the very beginning and that we continue to do through a whole history."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":4128.64,"end":4155.29,"speaker":"Fr Andrew","text":"Yeah, I mean, this is, you know, like, this is what St. Basil says in that text that I mentioned earlier. He says, be like the bee, Right? This is the original. Be the bee. You know, go to the pagan flower, take what you need and leave the rest. That's, that's what he says. Yeah. You know, it doesn't say, you know, don't go near that. Right. And, and he's living in a time when paganism is on the wane. He doesn't have to do that. He's not, he's not feeling pressure from the society."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":4155.53,"end":4156.41,"speaker":"Jonathan Pageau","text":"Yeah, exactly."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":4156.65,"end":4156.97,"speaker":"Fr Andrew","text":"Yeah."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":4156.97,"end":4158.41,"speaker":"Jonathan Pageau","text":"He's on the winning side at that point."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":4158.41,"end":4295.06,"speaker":"Fr Andrew","text":"Yeah, yeah. Late fourth century. I mean, he's, yeah, they're winning, you know, so I think that, you know, as if we look at this question of creative engagement, I believe that particularly at this time of polarization, that we have so much of that where it's really about lining up all the guns and blasting the other side, which, I mean, polemic is sometimes appropriate. The Church fathers do it, especially when someone is attacking or trying to undermine the church. They. I've never seen them do it simply because someone who has a wrong belief or wrong practice just exists. You know, it's really about. It's. It's a defensive thing to do. No, they're not being defensive in the sense that we talk about it now, but they're being defenders, but they're actually defending against actual attacks. They're not. They're not looking for enemies. They're not looking for people to debate. They're actually defending against real attacks. Right. And here's the thing. I believe that if we can, if we can begin to understand this creative engagement better, not only can we do it ourselves and God willing, do it well, probably with some stumbles along the way, like we're going to make some mistakes, but we can make them in good faith. But I think that this in many ways is a way forward out of our polarizing. It's a demonic spirit, actually, the spirit of polarization. It's a way forward out of that because it's actually about humility. And demons can't do humility. And I would also say it's not just something that, oh, this is a good idea for now here in 2023. I think it's pretty clear this is what the church has always done because the earth is the Lord's and the fullness thereof. Or as St. Paul said, you know, whatever things are good, whatever things are true, whatever things are honest, whatever things are beautiful. Think on these things. He didn't say whatever things are in this box that I'm presenting you with. It's whatever things. And he himself did this. He took some of these whatever things and, and made use of them. You know, so the same guy who said don't worship Zeus also took Zeus poetry and applied it. Applied it to God. That's right."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":4295.62,"end":4330.22,"speaker":"Jonathan Pageau","text":"Well, thanks, Father Andrew. This is amazing. I mean, you know, I'm going to re. Listen to this just for all the examples. They're so such wonderful examples that, that can help us see just to what extent this has been happening. And, and you're really also bolstering the, you know, what Richard and I's universal history position is, which is that, like you said, this is something that Christians have always done, that even the Old Testament is already happening. And so we just need to, yeah, humility. Move forward with humility and also attention you know, and prayer. So thanks, Father Andrew. This has been wonderful. And also. And good luck."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":4330.22,"end":4330.5,"speaker":"Fr Andrew","text":"I."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":4330.58,"end":4334.18,"speaker":"Jonathan Pageau","text":"Good luck with the continuation of the the Wolf and the Cross. Can't wait to see how that."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":4334.36,"end":4353.04,"speaker":"Fr Andrew","text":"Thank you. It's a big. It's a big project. Bigger than I think we realized. But we decided we wanted it to be big, so we're just going for it. I mean, it's gonna be nine episodes of two to three hours each, so we just released episode three. So as I like to say, at the end of each episode, we've got a lot more stories to tell. All right."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":4353.04,"end":4354,"speaker":"Jonathan Pageau","text":"Thanks, Father Andrew."}
{"episode_id":"SW - #313 - 2023-11-09 - Fr. Andrew Damick - Redeeming Pagan Symbolism","start":4354,"end":4354.6,"speaker":"Fr Andrew","text":"Thank you."}
