{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":0.08,"end":52.25,"speaker":"Jonathan Pageau","text":"The idea that, let's say Elon Musk will bring back free speech to Twitter, like, just frame it that way. Elon Musk is not going to bring back absolute free speech to Twitter. That's not going to happen. Because just the fact that you have to create hierarchies in the manner in which information is displayed means that whatever you think free speech is, it can't completely exist because you have to prioritize. You can't get the flood of all Twitter at once in your face. It's not possible that that happens. So there has to be a kind of prioritization. And therefore, that prioritization is based on a hierarchy of values. And that hierarchy of values will appear in the way in which information is displayed to you. This is Jonathan Pageau. Welcome to the symbolic world."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":64.23,"end":73.91,"speaker":"Paula Pageau","text":"Because, I mean, who can possibly be. Well, at this weird time? I think it's probably best in some ways not to think about it too much. In other words, I am fine."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":74.31,"end":100.67,"speaker":"Jonathan Pageau","text":"Yeah, I know what you mean. I guess we're fine. As much as it's possible. I think, like you, I've been trying to. I've actually tried to disconnect a little bit and try to be focused on closer things. Just because it's some point, it starts ripping you apart and you. Yeah, there's not much you can do about the big story. You can talk about it a bit, but if you obsess on it too much, then you get. Then you can really fall into despair because there's not much you can do."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":100.91,"end":114.59,"speaker":"Paula Pageau","text":"Yeah, you can fall into despair and you can also start. You can also start thinking the most ridiculous things because there are so many people who are trying to find out exactly what's going on. And how could you. How could you even know exactly what's going on?"}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":114.94,"end":135.02,"speaker":"Jonathan Pageau","text":"Yeah, because you have a sense that things are going on. We have this sense that things are happening and that there's all these. You can see that there's. Yeah. That there's things happening, that there's directions being taken, but it's all very ambiguous. And none of it is. Is communicated clearly or it's communicated through weird secondary means and stuff. So it's. Yeah, it's hard to really."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":135.1,"end":135.5,"speaker":"Paula Pageau","text":"Yeah."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":135.5,"end":135.98,"speaker":"Jonathan Pageau","text":"Anyways."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":136.62,"end":153.82,"speaker":"Paula Pageau","text":"Yeah. And in any case, I think that insofar as there are things happening with control and tech and all the rest of it, one of the great things to do against that is to do stuff locally and face to face and person to person. That is just one of them. That's one of the ways of resisting it."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":153.82,"end":201.84,"speaker":"Jonathan Pageau","text":"Yeah, exactly, yeah. Creating resilience by having real networks of people that you are connected to. And that for sure, that seems to me definitely to be the only thing that you can really do. And. But it's hard because at some point I'm thinking, okay, I need to move away from the digital space just because it's all kind of happening through the digital space. But then if you do that, I don't know, then the digital space also offers reach, which it really does. Like, it really offers reach and the capacity to communicate ideas. And so you think if I do that, then it also has a cost. Which is. Yeah, which is. Then your ideas don't get out there and then you're not part of the conversation anymore. So it's. It's a difficult, difficult decision to make."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":202.32,"end":222.8,"speaker":"Paula Pageau","text":"Yeah, it's difficult. But in a sense it's kind of like medicine. It's like the way that medicine is also poison. So it's a matter of using it wisely, I think, rather than, you know, because you could, you can use technology, you can, you can listen to idiotic TikTok videos and get into on Twitter or you can listen to sort of documentaries from things you've never heard about and talk to people on the other side of the world."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":223.04,"end":237.48,"speaker":"Jonathan Pageau","text":"Yeah, exactly. And you can network with people in a way that is not possible in the physical space. It has limited. It's limited and you have to be careful not to take it for what it's not. But it, it's also. But it has a certain level of reality."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":237.72,"end":238.2,"speaker":"Paula Pageau","text":"Yes."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":238.52,"end":240.6,"speaker":"Jonathan Pageau","text":"Which is. Which can be pretty powerful too."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":241.56,"end":257.49,"speaker":"Paula Pageau","text":"I do think it needs to be balanced. I think it just needs to be balanced by material reality as well as just seeing people in person. And I think a lot of people are doing that, actually. I think a lot of people are more doing crafts, you know, learning woodwork. Just. It just gets fed up with living totally in their mangled heads."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":257.81,"end":310.13,"speaker":"Jonathan Pageau","text":"Yeah, definitely, definitely. So I think that what I wanted. I really enjoyed you sent me a message about agency and I think that it would be really interesting to go into that in terms of, you know, my discussion with John Revake and also the question of how being stack up and how they exist at different levels. And so maybe you can, if you want, you could give a sense of what you were talking about in terms of agency and we can start from there. I think it'd be really interesting you mentioned that agency, that even higher level agency doesn't necessarily require consciousness and that to a certain extent consciousness is that that most of the things we do with agency actually require. Don't require consciousness to kind of seep into the things you're doing. So, right, you're going downstairs. Skills. As you master a skill, you actually become less and less conscious of that skill."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":310.29,"end":310.69,"speaker":"Paula Pageau","text":"Yes."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":310.69,"end":377.31,"speaker":"Jonathan Pageau","text":"And so really thought that was a really great point because it can also help us understand the fall and the relationship of, like the notion that knowledge of the specifics isn't necessarily always. It's not necessarily a good. It can actually be a danger because you're actually falling into the. Into the lower tiers. Whereas as you, let's say, as you join them together, you're. You can be moving up in the world and you become less. You can become something like super conscious. So there could be a sense in which there is a super consciousness which is not the same as unconscious in the sense of ignorance and just not knowing what you're doing. Because that also exists, like, let's say the state before you learn a skill, you're not aware of it and you can't discern difference. You can't know what's relevant and what's irrelevant. And then you learn the skill and then you reach a point where those points kind of fuse together into a state of super consciousness where you actually now are no longer conscious of the distinctions. You just engage with them. And so I think that that's a really interesting idea."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":377.55,"end":408.01,"speaker":"Paula Pageau","text":"Yes. Yeah, that's what I was thinking about. Because in terms of what you're talking about with John, you came across a point where you were worried about the notion of moral responsibility, that could you be responsible for something if you weren't conscious of it? But of course you can be. In fact, it's easier to see it in terms of when we praise somebody for their skill. You know, a concert pianist isn't going to be thinking consciously, remembering the scales and where to put each finger. You would just. Would be unable to do it. And I presume, like when you're doing your carving, the stuff that you had to learn, that you. You just do it automatically, I should imagine."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":408.01,"end":435.73,"speaker":"Jonathan Pageau","text":"Yeah. And there's something. There's a sense in which, like, you could see that in the positive, where you accumulate a skill and then you become unconscious of it. But you could also see it as a habit sometimes, like. Like a bad habit that at first you engage with consciously and then slowly it becomes part of your being and then, you know, you. You're not. Let's say you're not conscious of the nastiness you're spreading. Sometimes you're actually unconscious of it because it's been completely assimilated to your being."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":436.13,"end":459.53,"speaker":"Paula Pageau","text":"Yes. So then the judgment of whether or not you know, whether or not you're responsible for that is going to depend upon so much as how you got there, how you developed it, how you fell into it and what the consciousness, what self consciousness you had as you were going, what you, what you were actually trying to aim towards. So if you're actually aiming towards the good, then you would incorporate things. But if you're developing those bad habits that you weren't aiming towards."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":459.77,"end":484.39,"speaker":"Jonathan Pageau","text":"But it's interesting because one of the things that we've seen in terms of narrative in the past few generations is the idea that all the bad stuff that you have as a result of, let's say your parents, your parents were a certain way and then you've accumulated these patterns and now you're repeating the pattern. So it's like my mother's fault, you know, I'm a, you know, I'm mean to my kids and it's my mother's, my parents fault, basically."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":484.39,"end":506.63,"speaker":"Paula Pageau","text":"Yes, yeah, yeah. And do you know that Philip Larkin poem? No, no, Philip Larkin is this like really famous 20th century British poet who always had the most miserable poems. And the poem actually contains like an Anglo Saxon word. But it's like they f you up, your mum and dad. They may not mean to, but they do. They fill you with the faults they had and add a few more just for you. And so it's that kind of idea."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":506.89,"end":522.17,"speaker":"Jonathan Pageau","text":"Yeah. And so you can really see how the problem of agency is there even in the question, like our modern pop psychology and the way we, we kind of understand ourselves, we have a sense in which we can actually do bad things and not be responsible and say it's my parents fault basically."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":522.33,"end":522.81,"speaker":"Paula Pageau","text":"Yes."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":522.89,"end":544.45,"speaker":"Jonathan Pageau","text":"And so how do we then how do you see the question of consciousness in terms of. Or how do you see the relationship of agencies at different levels? Like, have you thought about that in terms of the notion of personal agency? But then let's say subpersonal agency and then transpersonal agency in terms of larger beings like teams or families or sports or, you know, or nations?"}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":544.85,"end":655.37,"speaker":"Paula Pageau","text":"Well, I mean, that's a really interesting question. But in order for it to work as a team, you'd have to have some kind of, you know, some kind of shared goal, wouldn't you? And some awareness of where you were in the team. But that can actually happen. It can actually happen through. So through training and through deliberately doing stuff like for example, in an orchestra or in a choir. In a choir, you could sing as a soloist. But if you're singing in a choir, your aim is to blend in with a choir. Your aim is not to sort of stand out unless you're the soloist. If you're. And if you're playing in an orchestra, your aim is to make your sound, you know, so if you're playing second flute in the flute section, your aim is to make your sound blend in with the first flute and all the rest of the orchestra. So that would have to be done. That's a huge amount of skill. Would have to be. It would have to be aimed towards, you know, a goal that you're all trying to. That you're all trying to achieve. But it can actually happen kind of spontaneously. Can I say. Can I tell you a story about a time when I caught a thief in Amsterdam? This was absolutely fantastic. It was like, I've got a friend who lives in Amsterdam and I'd gone to visit her for the weekend and we'd, like, gone out. We'd gone out on the town, various places, which I hadn't done for such a long time because I'd been at home with kids. So you'd kind of forget where you were. And we were walking along in the middle of Amsterdam and there was a group of young men, just overtook us. And as they overtook us, one of them just turned around and glanced back at me. And I knew instantly, like, he gave me the evil eye, basically. I knew instantly. He's got my purse. I knew it before I'd even checked in my pocket. He snatched my purse. And my friend and I, we had been cycling. So we were wheeling on, wheeling bikes along, and we just acted as if we'd been training for years. So we just scooted on our bikes. She went ahead of him and caught her because he was on foot and caught him like that. And I went behind like that. And we trapped him against the wall with our bikes. And he was. He was absolutely petrified and threw my purse away and ran off. But it was. It was. If. It was a really fantastic example of. We hadn't planned this at all. We just somehow we was acting together."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":655.45,"end":709.76,"speaker":"Jonathan Pageau","text":"Yeah. And it's interesting because you can understand, like, anybody who's played a sport and is good at playing team sports or let's say, made a. Worked in a play or something, where all of a sudden everybody. You actually give up your immediate agency to a certain extent or like your independent agency in order to participate in a higher form of agency. There's a Weird kind of magic that happens. And you can even experience it almost like as a form of ecstasy. It's like a little ecstasy because you feel as if you're participating in something bigger than you. It's like, you know when that feeling of playing. I don't know, you're playing basketball with someone you're used to playing with, and you don't even think about it. You're not looking. You bank the past. You know they're there. You don't know why. You know they're there, and then they get it. And it's like. And you have this sense of, like, right, the world is one or whatever. It's almost like a little religious experience to have that. To have that happen to you."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":709.84,"end":735.48,"speaker":"Paula Pageau","text":"Yes, but I don't think that means that the team itself is conscious. I don't think it means. It means that there's a kind of subjective awareness for team itself in the same sort of way as, you know, different parts of. You don't need to have. In the same way in which you're learning a skill. That doesn't have to be consciousness. You can have consciousness in the sense of having knowledge of what's going on, but that's different from a sense of, like a subjective awareness of what's actually happening. So I don't think the team needs to have that subjective awareness."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":735.64,"end":771.82,"speaker":"Jonathan Pageau","text":"So this. I mean, this is what I've been thinking about. Like, this is the question that I have. And so one of the things that I've been thinking about is how organizations, like teams and those types of organization organize themselves hierarchically. And there's usually. There's often a point, you know, like a team captain or a coach or maybe there's a few. But there's a sense in which they can maybe become the locus of consciousness of the team. And so it's. So the team does have a form of agency and consciousness, but it's expressed in the hierarchy through people. Right. And so that's why you have a leader. And so the leader is actually the locus of consciousness for the. For the group. But it's a."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":771.82,"end":772.1,"speaker":"Paula Pageau","text":"So."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":772.1,"end":810.8,"speaker":"Jonathan Pageau","text":"So in a sense. So that's why I would think that the group probably does have a form of consciousness and agency. But it needs to be. It needs to happen in that way. It's not just automatic. It has to happen in a way in which there's a point like a leader that is directing action and is also a reference point that we all agree on in order. In order for what we're doing. And so in that way we can have. But like, in your case, that's not what happened. So, for example, like you said, all of a sudden two people are acting in unison towards a goal. And so. And there's no. There's no. Like, there's no person. There's just a reason. The reason is what is making that body existence at that moment."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":810.96,"end":895.09,"speaker":"Paula Pageau","text":"Yes, but I imagine in that kind of case, because my friend. My friend and I, we both had. We would have had a lifetime of common experiences of maybe she's her person nicked. And we're both women who have the experience of if you. If you're a woman, you have a different sense of safety in the street with your man, you know, on average. So. But we would have had those. And also, she's like. She. I mean, she. I was originally friends with her mother. I mean, the most kind of like, determined, amazing family. So it's also her personality. But it can just happen spontaneously like that. But also it can go wrong. So in terms of a team, I actually have just been watching. There's a Netflix documentary about this space Shuttle Challenger disaster, which is like a horrible example of that not happening because there were so many different goals that the management were after. So there was pressure on NASA. So that was the disaster where, if you remember, it was in 1980, 1987. I think that was supposed to be the first teacher in space. So it's the first time they had a sort of like a civilian going up in space. And one of the reasons why they did that was because people were losing interest in the space shuttle. So they needed to have public interest to get. To get the funding. And there was. The launch had been delayed because of various reasons. And there were so many people in the organization warning people in the management that the O Rings were going to fail. There was ice on the shuttle when they launched it. And there's different strands of management as to what their goals were."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":895.25,"end":922.93,"speaker":"Jonathan Pageau","text":"Yeah. So you can see how, let's say the goal was not a good. That could bind that together. Like, let's say the goal of getting good marketing, a good PR impression. Let's say that's not the type of goal that can bind a space shuttle team in order to succeed. If it is bound by a better good, then all those things would not have happened. Like, they wouldn't. They would not have happened that way."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":923.01,"end":962.75,"speaker":"Paula Pageau","text":"Yeah. I mean, there's another element of. That is the element of spectacle, but also because of. Because of the children involved. In a sense, it's reverse of what should have happened because there were children watching. Like there were millions of American school children watching children launch. Her pupils at the launch and her children. She had no but school teacher. Obviously all the astronauts had families, but they wouldn't have had millions of children watching. So you would have thought they should have had higher standards of safety. But it led to them having lower standards. Like distracted, like, oh, it's for the kiddies. The kiddies will find it fun. I've noticed that kind of thing happens. Happens a lot actually, in terms of luring us to do things. It's a bit sort of, you know, it's a real distraction, actually."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":963.15,"end":1054.75,"speaker":"Jonathan Pageau","text":"Yeah. There's also like. We talk about how it can go wrong. There's also ways it can go wrong when it can go too well. Right. Where this is of course, the cult or the, you know, or the, let's say the tyrannical. The possibility of a tyrannical leader that sucks up the people so much into a higher cause that they cease to almost exist as individuals. And they just become. They just become nodes for this, this pattern. And so then it can spiral because it, you know, because there is like a real ecstasy in participating in something bigger than you. Like that's a real thing. And so you can weaponize that towards evils if you, if you're capable. Like if you're a charming cult leader, you can drag people in and make them really feel that sense. And it's, it's. And it's real. It's not an illusion. It's. It's really happening. But then they, Then they can lead to. There's a. There's a movie, a crazy horror movie. What is it called? Midsommar, that a 24 put out like a few years ago, where they explore the problem of a. Basically a cult, that the individuals almost cease to exist. Like they. Someone gets hurt, everybody feels it. Like there's a sympathy all through. And then it draws them in so much. But then there's also obviously like this crazy dark side to it, which is that they end up killing all these strangers and they have to do these, these types of murders in order to cohere their group together. But you can see like in any. We can see it from. In hindsight, when we look at movements like Mao's Cultural Revolution, for example."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":1054.91,"end":1098.84,"speaker":"Paula Pageau","text":"Yeah. And I think, I think that could be happening at the same time within an organization. So that kind of thing could have been happening, I'd say, within NASA with people who've identified so much of the organization. One of the things I Find really worrying about a lot of the big tech giants like places like Google and so on, when they're just. People are just. They're like nurtured like babies, like their whole lives are on site. Everything's laid onto them so that you can really get under. One of the. One of the main findings that social psychologists who look at the ways in which people can make disastrously wrong decisions or things can look evil can come out of good intention is that you should make certain you've got more than one social reference group so that if you go to work, but you also belong to a church or it could even be like a bridge club or anything differently."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":1098.84,"end":1171.23,"speaker":"Jonathan Pageau","text":"No, you're right. This is something that I've been talking about recently too, which is that in the buffer against this type of excess is a fractal identity system. So the idea is that a real healthy traditional society would have a fractal levels of identity where like you said, you, you have your family, you have clubs, you have different clubs that are based on different things. You can maybe have a sports club or something that celebrates some aspect of your. Even if it is your nation or whatever. But you know, you have the. What is it? In Quebec they had like the Daughters of Isabel and the Knights of Columbus, but then they also had, you know, the. So you had all these different like organizations and they would scale up in a way that, that was fractal. So the nation doesn't compete with these lower levels, they just exist at lower levels and they actually build on each other in order to succeed. But what you can see in the kind of tyrannical single identity problem is how it wants to actually eliminate the intermediary, say allegiances. And Mao's Cultural Revolution is actually a great example of that where Mao actually tried to eliminate all intermediary allegiances, you know, to. As superstitious, in order to bind everybody to one central one which was the state."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":1171.55,"end":1217.46,"speaker":"Paula Pageau","text":"Yeah. So one of the things you need for that is actually a block on communication and on knowledge. So for example, you might get like a woman's group within a church and what happens is that they'll be moaning about how stupid they think the sermon was this week, for example. Or you know, actually that kind of thing is, is necessary. But there is a block on communication so that you can, you can get together and say what you really think about things or talk about things more privately. But I think that's one of a big. One of the big problems with the kind of thinking behind a lot of the digital stuff. Now it's like an ethos that data is good, information is good, and then straight away equating that with communication, with open communication. But I think that actually what works. What works then are different pathways of knowledge and information. Does that make sense in terms of."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":1217.62,"end":1221.22,"speaker":"Jonathan Pageau","text":"Oh, definitely. I totally agree. And I'm trying to see."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":1221.46,"end":1221.82,"speaker":"Paula Pageau","text":"So."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":1221.82,"end":1327.81,"speaker":"Jonathan Pageau","text":"So when you have a fractal system of. Of identities, there's certain constraints on that fractal system which are just. Just the fact that you live in a village, you have people around you. Like, maybe you have a club that's actually bigger than your village, but you can't meet all the time. So maybe, I don't know, you're like, you're. You're in a guild of whatever, your guild of people making jewelry. So if you. Once every few years, you can get together with your guild. And so there's all these limiting factors which create. Create. Which actually bind the hierarchy in a normal way. So you spend a lot of time with your family, and so you have that private space in order to air out. Like, you can. Like you said, you can complain to your husband or to your wife about how bad the sermon was or whatever. So you can kind of have these. These fractal structures. One of the things that the online space does is that because it's. The potentiality is. Is unbound, you could say. And so let's say in. In a normal. Like in a normal traditional world, you might have someone with kooky ideas in the village. And that person, they'll be kooky, they'll have weird ideas. They'll be. They'll be strange. It might be a bit obsessive. And so you keep an eye on them, you watch them, you're careful. They don't spend too much time with your kids or whatever. So there's like a natural, like, system. But what happens online is that that kooky person with like, really crazy kooky ideas can now be connected to 10,000 other people all around the world that have those crazy, kooky ideas. So because of that, then from those that hold the reins of power, they suddenly feel the need to. I'm trying to play devil's advocate here. They feel the need to want to stifle that because they can see, let's say, a pattern which would exist in the world regularly but would be constrained, is now more and more unconstrained because of what tech offers. So they have to bring down on it more control than what you would in a village situation."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":1328.31,"end":1416.56,"speaker":"Paula Pageau","text":"Yes, I think that's what's happening. Because a lot of the stuff that's happening is a solution's brought in by technology to solve the problems that technology has created. Technology frees itself and also what generally tends to happen. So technology creates problems, then rides to the rescue like the guys with white hats on are rescuing it. They cause the problem in the first place, and it's always the individual people who get blamed so that the technology is designed in ways that would enable that kind of thing. And then the people who are behaving like this seem to be like dreadful people. They might not be all that great as people, but it's the technology that's enabled them to do it. It also, I mean, it just happens. This can happen anyway in ways in which society is becoming more fractured. You know, like people who live in suburbs are very distanced, and in lots of cities, it's actually also becoming fractured because there are different populations, different demographics, different population groups living kind of like almost sort of separate parallel lives. I was thinking about this last week just for again, something personal that I noticed, which is that I live in my property's leasehold because I own it, but it's on land owned by the council. They want to change the lease and they want to introduce a clause whereby. Which is a harassment clause. But you're not supposed to use abusive or offensive language for race, sex culture or other characteristic and to kind of think this is the kind of thing which is happening in the digital space and it's happening here as well. So how much is. How much are people thinking? How much are people kind of learning from the kind of control in the digital space and thinking we have to have it in the real world."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":1416.96,"end":1495.4,"speaker":"Jonathan Pageau","text":"No, that's a really good point because there's a sense in which. How can I say this? This is going to sound. People are going to find this really weird. But there's a sense in which, let's say, like abusive language, for example, or using kind of horrible language. Those are things that happen in the world. Like they happen. And the thing is that doing that in the world can bring. You can, let's say, can create certain situations. Like you can actually impose your strength on others if you use those types of language. But it actually also creates problems for you. It actually has a cost. And that cost plays itself out in the world, especially in a world that has more and more, let's say, different groups interacting with each other. And so it's like, you know that racist uncle. It's like, oh, yeah, I have that racist Uncle. So that racist uncle, you know, you're annoyed with him, he's annoying. You just kind of. But you still meet with them, you know, for Thanksgiving or whatever. But it's like, he's just annoying. But because of. Because of. You're right. It's interesting because of the online space is so pervasive, and then you see these mobs and these patterns that appear. Then all of a sudden it's like, oh, that racist uncle who's annoying and offensive. It's like, I want him to get free. I want him to go to jail. Because I can see it as part of this larger kind of pattern that's happening in. In the digital space."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":1495.8,"end":1521.37,"speaker":"Paula Pageau","text":"Yeah. Because, I mean, that has been happening and how people have been divided and things like whether you're vaccinated or not. And I mean, people. I mean, here it's different in different countries because in here, in Britain, it just seems to have stopped. It's like it's mostly over. And if you tiptoe around, you can just avoid having rows with people. It's just like it vanished into thin air. It's different in different places. But it could get really unpleasant. It could be. Oh, yeah."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":1521.37,"end":1560.86,"speaker":"Jonathan Pageau","text":"It's like this is a moment where I wish the Queen would remind the Canada that we're in the Commonwealth and that, you know, but now that's not what's going on here in Canada. It's like, my goodness, this has to stop. But it's not going to stop. It's really been weaponized where we are and it's been politicized. All of this whole question is. Is really becoming a political tool and you can actually see it play out. And you can realize that right now, those in power in Canada have absolutely no reason to back down. They have every reason to hold onto this because it's to their political advantage in every way. And so, yeah, it's a bit of a strange time."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":1561.34,"end":1564.22,"speaker":"Paula Pageau","text":"Can't McQueen just sack Trudeau? Can't she do that?"}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":1565.1,"end":1569.93,"speaker":"Jonathan Pageau","text":"In theory, she can. In theory she can, but it's never going to happen. That's never going to happen."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":1571.21,"end":1572.41,"speaker":"Paula Pageau","text":"No, it's never going to happen."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":1572.73,"end":1665.64,"speaker":"Jonathan Pageau","text":"Yeah, no, it's never going to happen. I'd like to. It's funny because I didn't think, you know, I thought, we're going to talk about agency and then you thought, we're going to talk about digital id. But it's just super interesting that those have. Even in our own conversation, they kind of come together. There's a sense in which, because of the digital space, because of the digital space itself and what it offers, and also the dangers of it. It seems as if the need for a single id, like, of a single identification that will encompass all of your being, it seems to be pressing upon us as something which is inevitable and so we can, like. I hate everything about it, but I also see that. I can also see that because of what the. Because I participate in the digital sphere, I can notice that without that, at some point it becomes untenable. Like the digital space becomes untenable without something like that. So what are your thoughts about these? Because we have one in Quebec right now where we are, it's happening right now in June. The digital ID project is starting in Ontario, in another province. It's already started. And so we are seen as the forerunners. Right? There's a video of our banking association and it's like the president of the banking association, whatever, the Canadian Banking association for the World Economic Forum saying, like, Canada is going to be. Is going to spearhead this, the single digital identity thing. And it's related to banking, of course, because it's related to security and to the problem that online banking poses because of identification and security."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":1666.84,"end":1668.52,"speaker":"Paula Pageau","text":"So is it going to be just used for banking?"}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":1668.68,"end":1669.72,"speaker":"Jonathan Pageau","text":"It's going to be used for everything."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":1670.36,"end":1671.56,"speaker":"Paula Pageau","text":"And it's going to be compulsory?"}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":1671.64,"end":1746.48,"speaker":"Jonathan Pageau","text":"Well, no, that will. Of course it's going to be compulsory, but not right away. Right away it's all voluntary and so it's all voluntary, but like there's a. It's voluntary, but it's biometric. In terms of Quebec, they've said clearly that there's going to be a biometric element to the digital id. So you can see that if this is. I don't know if this is the case, but I find it very interesting to notice that both our prime minister and my premier in Quebec, they, although they're not using like here in Quebec, they're not using the vaccine passport anymore. But they said don't remove it from your phone, right, because we might need it later. And so you realize that with a biometric ID then all of this can easily become compulsory, like any other pandemic, any other disease or anything. And all of a sudden it all becomes compulsory because it's like a perfect. It's a perfect storm where you need to control people at the entry in stores, you need a digital id. They scan your face or your eyes when you walk in. They let you in if you're vaccinated or not. And then you just pick things up, you Walk out of the store and you paid everything. It's like. It's perfect. But you can see how it'll easily become compulsory with the COVID or another pandemic question."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":1746.72,"end":1787.8,"speaker":"Paula Pageau","text":"Yeah, it could easily become compulsory, but we can easily get sucked into this sort of piece by piece. Again, one of the things about agency there, in terms of the attraction, the attraction of having a digital id, it's being pushed forward in some circles as being. It makes life so much easier online because you just have one. You wouldn't have to have all your different passwords. So it's presented to us as actually enhancing your agency, of course, which it actually does. Of course it does the reverse. It's enhanced your agency to engage with technology. So the technology. Technology produces a world which in some ways obviously enables you to do lots of things, but on the other hand, you have to do it in the way that technology sets out."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":1788.29,"end":1824.1,"speaker":"Jonathan Pageau","text":"Exactly. And as it becomes centralized, then you're also giving up all your agency into that centralized system. And so if, let's say 50 years ago, it was really hard to turn a citizen off because their birth certificate was a piece of paper, their cards were all. They had money in their bank account, they had money. It's like it was all decentralized. And so it was really hard to turn someone off. As you create a centralized system, then all this comes together and then it ends up centralizing into a government digital id. Then it's like click, yes, of course."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":1824.1,"end":1831.5,"speaker":"Paula Pageau","text":"The whole system's much more fragile though, than a piece of paper, because the whole thing could just. The whole thing could just. The whole thing could just disappear. The whole thing."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":1831.5,"end":1840.51,"speaker":"Jonathan Pageau","text":"Yeah, and that's the Tower of Babel. Like, that's the problem of too big to fail too, which is that as you kind of give up your. All of this kind of gets centralized into one space, then it."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":1840.58,"end":1864.66,"speaker":"Paula Pageau","text":"Yes, but also in many ways they oversell it to themselves. So, for example, when about vaccine, passports, it has to be digital. It didn't have to be digital, actually, because you could have had. You could have had a stamp in your passport. You could just have had a. In the old days, you just had a vaccination little card. So it doesn't have to be digital. So again, a lot of it is just. A lot of it is overselling stuff in order to justify its own existence. But that happens all the time."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":1864.9,"end":1901.64,"speaker":"Jonathan Pageau","text":"But it's also. It's like. It's interesting because there's also technology offers. It offers something. And so, for example, like, if you have a Centralized ID system, like a server, like we add here, like you have a centralized system of COVID passports, then the state is regulating it and the state is controlling it. It's like if you have a card with the date of your vaccine and the doctor's signature, it's like that could be faked very easily. Right? It could be easily faked. And so there's a censor because, because technology offers us the capacity. Because one of the problems that happens is as soon as there's control, there's corruption."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":1901.64,"end":1901.88,"speaker":"Paula Pageau","text":"Right."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":1901.88,"end":1921.08,"speaker":"Jonathan Pageau","text":"There's no corruption. If there's no control, there's no need for corruption. There's no control. Control systems bring about corruption and then the control system wants to cover for that corruption through more control. And so technology offers an unlimited version of that indefinite scaling of what that, that, that, that brings about."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":1921.53,"end":1934.65,"speaker":"Paula Pageau","text":"Yeah, because it's going to go, it's going to claim to be uncorruptible. Somebody will manage to hack it. But it's like when you develop locks, you have just become one step ahead of the people who can crack locks. That's what's going to be, that's what's going to be happening."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":1935.13,"end":1972.36,"speaker":"Jonathan Pageau","text":"And you can feel it. Like it's funny because I don't know how to say this like you can feel it. For example, two step identification has become mandatory. It's almost everywhere now. You almost can't get out of it. My, my banking app asked me a few weeks ago if I wanted to use facial recognition to get onto the, to the banking app. And I was like, okay, well I guess, I mean I knew we were there but it's like, it's just weird to have the app tell you. Well, you know, it's, and almost hinting at, you know, you can put it off for a little while, but you won't be able to put it off forever. Soon you're going to have to or else you're not going to have access to the service anymore."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":1972.44,"end":1979.53,"speaker":"Paula Pageau","text":"Yes. But of the things that struck me, I mean for banking, I suppose it's, it's, it's to do with the security of your, of your money."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":1979.69,"end":1980.17,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":1980.25,"end":1990.97,"speaker":"Paula Pageau","text":"But of course one of the reasons why your money is so insecure is because of the digital. Digital. I actually, every time I log into my account I have this free sort of fear, but it's completely empty."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":1991.13,"end":2002.46,"speaker":"Jonathan Pageau","text":"You're going to get there, it's just going to be zero. Yeah, I know what you mean. Because it's like it's not, you know, if I, there's a Way in which, let's say, you know, my money, if I have it under my bed, it's locally insecure."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":2002.54,"end":2002.94,"speaker":"Paula Pageau","text":"Yes."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":2002.94,"end":2009.82,"speaker":"Jonathan Pageau","text":"Yeah, but I can. But, but I know like it's there. I know it's like if someone breaks in or whatever. But this, this virtual world."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":2009.98,"end":2114.16,"speaker":"Paula Pageau","text":"Yes. Yeah. The whole, the whole system is set up to increase anxiety. So even some of the, some of the advantages of having a one digital id, because then you don't need to remember all the passwords is because, I mean, I wrote down, recently wrote all my passwords down in a book because there are so many of them. There were like 300, I had 300 different passwords and. But some of them, they have, they have ludicrously high standards for what to have. For something like who, who is going to sign into some obscure academic journal and write a review on my behalf? Nobody's going to do it. But so, so they're inventing ludicrous levels of security. So it's like this constant state of anxiety that we're living in, this really heightened state of. And because it's all digital, you could, you could just forget your password. You could just. I suppose if it's. It's interesting they're introducing the digital, I mean the biometric for, for banking. Because one of the things that I was thinking about, you probably have it somewhere here, but I'm not sure. The first things that they introduced biometrics in was the things where the state was interested in security, so passport control and police things and banking, it was more like you remembering the information. One of the things I'm really interested in thinking about are ways in which digital ID is controlled in terms of a. Levels of information and then also the material realization, because take vaccine passports, for example. If you think if a state say you have to have vaccine passports, you think they would provide you with. So when you had a vaccine certificate in the old days, when you just got vaccinated, you got piece of paper, they gave you paper. Now you have to buy the phone yourself. You are paying for the phone and you're paying for the data each month in order for the state to control you. Seems like. It seems like a bit of a con."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":2114.48,"end":2114.96,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":2115.04,"end":2132.16,"speaker":"Paula Pageau","text":"And also, but in terms of digital identity, I was thinking about that a lot because the word identity is carrying so much work. So it's identity in terms of individuating you as a person, which you can do. Like you say Jonathan Peugeot for Canadian icon carver. You know, is there any one?"}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":2132.64,"end":2138.11,"speaker":"Jonathan Pageau","text":"Russian Orthodox. Right. I'm just joking. Because that's what Jordan Peterson called the Russian Orthodox icon carver."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":2138.82,"end":2140.7,"speaker":"Paula Pageau","text":"Didn't he say you were a former Catholic atheist?"}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":2140.7,"end":2145.22,"speaker":"Jonathan Pageau","text":"Yeah, yeah, that was hilarious. Like, it was just funny. I love Jordan. He's funny."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":2146.5,"end":2151.14,"speaker":"Paula Pageau","text":"That's an interesting example because it still identifies you. Everybody still knew who he meant."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":2151.3,"end":2152.18,"speaker":"Jonathan Pageau","text":"Yeah, exactly."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":2152.18,"end":2153.14,"speaker":"Paula Pageau","text":"Yeah, but, but."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":2153.86,"end":2263.3,"speaker":"Jonathan Pageau","text":"But there's something about. The question of identity is super important. I mean, I guess that that's the question of the day. It's a question of. Of our time. You know, the problem of identity and the problem of identities in general and how these work and the excesses that our world has brought about, which is, on the one hand, this fluidity of identity, this notion that identities are fluid, that we praise hybrid identities, that we have all of these. But there's also a desire to totally map out and control identity at the same time. Those two extremes are happening at the same time. And the idea, for example. So you would understand, like, in a traditional way, or like, I think in a. In a mystical Christian way, you would understand something like. You would have the notion that identity is apophatic, that to a certain extent, identity leads to mystery. And so behind identity is something like a mystery. There's something. You know, it's like Christ in you. You could say it that way. Or you could say the divine light, the divine spark. There's something behind you, behind all your named identities, which is. Which is. Which is higher and is. Can be completely contained. And that is actually. That's a really important part of what identity is and what it leads to. But there's a sense in which the idea of digital identity and the idea that you could have a name or a number or something which identifies you, without which you cease to exist almost in practice, or that you cease to exist socially at least. Like, you couldn't exist socially. You can't. It's already there. Like, you know, Social Security numbers and all these types of identification. It's not like this is one thing that's happening now. It's something that's been building up for, you know, for a century or more. But the idea that if you don't have this, then you don't exist for socially. I mean, that's a crazy idea."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":2263.7,"end":2346.65,"speaker":"Paula Pageau","text":"Well, yeah, I mean, of course, there are people who live like that. But one of the things that fascinates me is how identity can mean just like picking out one individual person. So that's. It's just about a matter of separating one person from another. But of course, in a sense, the state has to do that in terms of like tax, which is legitimate and so on and, but, but also identity. So that's just simply bare, you know, bare identification of one individual as opposed to another individual. But then we use identity to mean, you know, our essence or how we're going to make ourselves or our agency or what makes us really distinctive of filling out the. Filling out the individual things. And that's one of the things I was thinking about and thinking about how like, you know, vaccine, passports and all the rest of it are actually physically on your phone, on a person's phone. Because if you have a, if you have a smartphone, which most people do now, then it's also. The smartphone is also where you are, you know, looking at videos, engaging with friends, getting lots of feedback, interacting in the world in a way which is building up your identity in the online space, connecting to friends. But it's also where. Which is. So that's quite. That's two sort of slightly, you know, not quite the same thing, but all actually physically embodied in the same device that you. That you're carrying around with you. Yeah, it's collecting information about you. It's collecting information about you all the time. So there's also the notion of a digital identity in terms of the identity that's being constructed out of the vast trail of information that we're leaving wherever we go."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":2346.89,"end":2360.31,"speaker":"Jonathan Pageau","text":"Yeah, the digital twin. And there's a sense in which you get an idea that the moving toward digital identity and even biometric measure especially, is moving towards a space where your digital twin. It's like in a movie."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":2360.31,"end":2360.47,"speaker":"Paula Pageau","text":"Right."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":2360.47,"end":2364.59,"speaker":"Jonathan Pageau","text":"Your digital twin replaces you and becomes the truer self."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":2364.75,"end":2365.19,"speaker":"Paula Pageau","text":"Yes."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":2365.19,"end":2376.04,"speaker":"Jonathan Pageau","text":"Because it's actually the self by which all your social interactions and social clout, all your participation reality. That's the one that is measured like. That's one that's measuring all those things."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":2376.28,"end":2410,"speaker":"Paula Pageau","text":"Yes. Yeah. I mean, who go into directions from here. But you know, there are some people who are trying to do that, trying to actually make digital twins, like trying to create. So Martin Rothblatt is trying to make Scott's robot been a 64, I think it's called, is trying to make identical copy of. I forget if Martin. I forget whether Martin Rothblatt is a man or a woman because it's one of these people who transitioned, but his or her wife trying to make an identity. And you get the idea that Ray Kurzweil and people like that have of trying to actually upload ourselves completely get a copy of our mind and upload ourselves. But we did."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":2410,"end":2455.05,"speaker":"Jonathan Pageau","text":"Yeah. Into The. Into the. Into the. But these are narrative. Like, it's important. I think it's important to understand these types of events. Let's say someone who's doing that as a narrative crux, like, as a narrative point that makes you notice a pattern that's happening more generally. That is, they are built. You are building your digital twin. You're doing it all the time. We are building a kind of digital twin. And then you have examples where this becomes almost like a mythical, ritualized version of it, where someone is building a robot and training it to be them. And so we find that odd, but it's important to understand it rather as a marker to understand something that's happening on a bigger scale, which is. This is being done to you. Like, we are building our digital twins."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":2455.45,"end":2471.34,"speaker":"Paula Pageau","text":"Yeah. And so a lot of our problems, I think, would arise when you actually start believing that all this data about you is actually you. So I think that gets back to what you're talking about, a Christian sense of the self being, the identity being a mystery, because it has a causal."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":2471.34,"end":2546.86,"speaker":"Jonathan Pageau","text":"It's super important. What you're saying is super important because it has a causal effect on you. You can imagine that this causality can be reversed, and you can see little examples of that. Imagine a little example of that that you can find is like, you see it in celebrities sometimes, where a celebrity develops a Persona, and then that Persona invades them, and then they become a caricature of themselves, and they become like, you know, they become a caricature of their own Persona. And so you can see that happening in the. In the world. It's the kind of thing that's already. Already exists. But in the digital space, it's a. It's far more. It's dangerous, and it's dangerous on the scale that's everybody. Like, everybody can be colonized by their Facebook Instagram Persona. And the algorithm is doing that to you too, because if you go and you visit certain sites, then the advertisements start to reflect that digital twin, and then it's not as if it's neutral. That return is actually going to affect you and is going to causally transform you in a way that will make you more into that twin. Like even you as a. As a. In your full. In the fullness of yourself will make you more into that twin."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":2547.1,"end":2655.65,"speaker":"Paula Pageau","text":"Yeah, I think one. I think one of the ways in which that's happening is in. In terms of the ways in which a conflation between information or data and actually knowledge and understanding. So data. That's data that's collected is just like little points of information which have been analyzed in various ways. And you can, you know, you can extract meaning out of it, or you can extract sometimes pseudo meaning, because what's out of the data, it hasn't got any meaning at all. It's just like, say, some piece of machine learning is putting stuff together in a way that's sort of nonsensical, but that's not how we understand ourselves. There's some interesting work from somebody called Neil Lawrence, who's professor of machine learning at Cambridge, and he mostly works technically in machine learning. He's got some really interesting stuff about the difference between how minds work and how artificial intelligence or machines work. He's actually got a really good TED Talk on it, but he's written some stuff on it as well. So he talks about what he calls the embodiment factor, which is just to cut a lot of it really quickly. One of the main differences between how computers process information and how we do is that he says that we all have what he calls locked in syndrome. So compared to computers, we are more like. He uses the example of Jean Paul Bobby, who's written a book called Diving Bellavin and A Butterfly. Actually a really beautiful book. Actually. He had a catastrophic stroke and ended up communicated through blinking his eye. But he said that human beings are all more like him than we are like computers, because how we communicate in terms of our brains of processing absolutely massive amounts of information all the time. If you had to think about what you can see right now and communicate to somebody else, exactly everything that you could even just see right now, you couldn't do it. So somebody's worked out in terms of information theory, it would take you something like longer than the age of a."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":2655.65,"end":2662.23,"speaker":"Jonathan Pageau","text":"Universe to be able to just communicate what you're seeing. Yeah. What's in just the complexity of the world that's presenting itself to you."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":2662.31,"end":2752.95,"speaker":"Paula Pageau","text":"And computers the other way around, they can communicate really, really quickly. So, I mean, what we need to be doing is using them in complementary. Complementary ways. But the result of that for how we think is that we have to communicate. So, for example, from poetry, through art, but also because we have access to our own understanding, we can know immediately. So, for example, when my friend and I were both chasing that thief in Amsterdam, we both had immediate access to like, a whole store of similar, maybe similar things that happened. Maybe we watched the same police films or something. You know, we've got. We could instantly know. I can tell from what she's doing, but what she's going to do. Yeah, he's trying to catch him as well. So the way which we communicate is we can, you know, communicate through poetry and so on. So I thought that might be interesting just to recommend his TED talk. Actually. I think it's. It's really interesting because he's. It's interesting as well because a lot of the people who actually work really intensely in tech. Exactly. The people who are skeptical about whether or not artificial intelligence is at all like human intelligence. Very, very different. But this roundabout way of saying, emphasizing the dangers of thinking that the digital information collected about you is actually anything like what you are like because it's missing so much. It's missing so much stuff and it's interpreting the data in a way that's sort of like machine readable, that anybody else can access it. But we access ourselves quite differently. And information means. What's information to one person is something completely different. Completely different. It means something."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":2753.11,"end":2753.59,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":2753.75,"end":2844.66,"speaker":"Paula Pageau","text":"So I mean, another example that might be easy to grasp to illustrate all this, I've recently been looking at, I think I mentioned before, I do some work with a team of people who do research on the care of patients with dementia. Mm. There's lots of research trying to find ways of using, using machine learning to help diagnose dementia. And it's interesting they want to try to diagnose dementia earlier. So some, there are some teams trying to diagnose dementia like decades before first symptoms, which is really, really interesting because if you haven't got any symptoms, what does that mean to say you have dementia? So if they're trying to do it from really minute little ways in which your brain works or how suggestions that you collect all the information from all your health information from every health incident you ever had. Information from things like your gate, how you use computers, how you use. If you're connected up to the Internet of things, how you use technology around you, all sorts of data and then try to claim you can build up a picture, this is a picture of that you now have dementia or are diagnosed with dementia and just assuming this is a good thing. But they haven't actually thought that for them it's interesting information for research, but for a person to be told that or to be told that actually you may be functioning perfectly well in everyday life. But we can tell from how you've answered this little puzzle. But you've got. The beginnings of your brain isn't processing information quite the normal way. And actually this means that they haven't not necessarily thinking that this is going to mean something. Medical information means something to an individual."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":2845.11,"end":2849.59,"speaker":"Jonathan Pageau","text":"Yeah. You're not a neutral agent that'll just receive. It won't. It'll have a causal effect on you."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":2849.91,"end":2850.71,"speaker":"Paula Pageau","text":"Yeah, yeah."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":2851.03,"end":2857.91,"speaker":"Jonathan Pageau","text":"So how can you do something about it? Like you can do something about it if you knew that information. That'd be horrible."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":2858.15,"end":2892.21,"speaker":"Paula Pageau","text":"Yeah, it would be horrible, wouldn't it? It would be horrible. It's actually a. Sorry, this is, this is going off topic a bit. It's a real example about how tech sells itself because they start off by saying we have to do this because dementia is such a terrible, terrible disease in a way that nobody working in dementia care would go on about how awful it was because people have to live with it. So you're trying to make it as livable as possible. And then half the papers say we need to diagnose dementia as early as possible so that we can have treatment, begin treatment, and the other half say we need to diagnose it as early as possible because there is no treatment."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":2892.85,"end":2976.92,"speaker":"Jonathan Pageau","text":"Can you imagine? But that's a great, this is a super great example to understand the problem of the digital twin or like the information twin or even like the. So think about it. Like you could give yourself a, like a speculative example. Like you, you could diagnose dementia in a person at 10 years old, right? So you have a 10 year old kid and you diagnose that when they are 75, they will have dementia. And so you tell them like, okay, so now we know that you're going to have dementia when you're 75. And so if you do like an hour of this exercise or you take this drug every day for the rest of your life, then there's a 70% chance that when you're 75. Right. You won't have dementia. So you can see. So that means that you're going to make that person's entire life managed by this thing and it's going to basically take up all their resources. And it'll be like, it's super interesting because there's something about COVID in that kind of thing too. It's like, because we can, then we will. And we don't understand that. We don't calculate what the causal effect is and what the cause is because we can lock everybody down for two years pretty much. And we can force everybody to do this and do that and force kids to wear masks and do this. We will do it because it will work. We will, let's say, prevent a certain amount of people from dying from the disease and Then not realizing that it has a causal effect which is beyond the disease."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":2977.32,"end":2993.89,"speaker":"Paula Pageau","text":"Yes. It's so often health. You really have to watch it. So often health, which is used to, to push these technologies so not, you know, like even Elon Musk's neuralink. I don't know what his first. What he. Why are you doing it? But it's a. You say, oh, it could be useful for people who are quadriplegic."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":2994.13,"end":2994.53,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":2995.09,"end":3026.78,"speaker":"Paula Pageau","text":"It's always health. But it's also, it's interesting, it actually gets back to the children because it's often kind of like thinking about the children. So people are persuaded of digital ID online because then you could use that to make certain children can't access pornography, for example. That's one of the arguments that used. But also, Ben, like in terms of COVID the children were collateral damage. They were, they were, they were just used as shields for. They were used as shields for 85 year olds. So it seems to be. I mean, I don't know if you've got any thoughts about that. About what? There's something, there's something really. What is it?"}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":3027.18,"end":3134.37,"speaker":"Jonathan Pageau","text":"Yeah, what is it? What's going on? What's happening? I think it's the. I think we're. I think it really is the McLuhan's electric beast. Like, I think that what we're seeing is the possibilities of technology. The possibilities of. The possibilities of technologies are advancing through attention and through the. Just the capacity that it has. And we're just following and so. And it's not like nobody's. You hope that most people are definitely not doing it through ill means, through ill intent. It's just, it's just happening. It's like if a possibility of. How can I say this? It's like if I can impose a certain stricture and it'll. I can do it through technical means, then it'll happen. And what it does is it makes that system stronger and then it just keeps happening over and over. So there's no. I don't know, like, I don't have a solution for it. Like, I don't know exactly what the. Like in terms of the idea of sacrificing children to, to the elderly. I do think that to a certain extent, a lot of what the extent of the COVID measures that were happening is like there's something about a. There's something about the last moment of the boomer generation, like the last moment of the 60s. And some people get really angry that I say that, but I think that there's Something about it which is. Which is there as well. Like a fear of death. Like a fear of death that is really pervasive. And we don't know what to do with it. Like, we don't know how to die, and we don't know. So we move from euthanasia to these extreme measures, and we don't know how to manage. How to manage death."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":3135.33,"end":3157.65,"speaker":"Paula Pageau","text":"That's really interesting. It's also really interesting. But trying to advance. Because you have euthanasia in Canada, don't you? Yeah, yeah. Advancing euthanasia and trying to extend life are kind of both for peace. It's a notion of control. But one of the things that really struck me about how elderly people were treated in Britain, and I'm sure it was similar in Canada, was that they didn't want them to die, but they didn't want to live either."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":3157.65,"end":3231.71,"speaker":"Jonathan Pageau","text":"That's right. They imprisoned. I know people that were imprisoned in their apartment for months basically could not leave, could not walk out on their porch, had guards at the door, and they were saying, this is for your protection. And it's super interesting because there's a local restaurant near my. Like, a little restaurant in my house. And as soon as the strictures would come down a little bit, they'd be full of old people. And they were like, oh, don't they know that they could get it? Don't they know that they could die? It's like, stop thinking they're idiots. Like, people live. They want to live. They don't want to just be a living dead person for two years. Getting imprisoned in your. I remember if you saw, like, they would show these crazy videos towards the end of some of the measures where they would say a husband and a wife, you know, that are like 90 years old. They haven't seen each other in a year. And they're like, oh, and now they're celebrating because they're. They're seeing each other again. What is happening? Why didn't you just let them see each other and maybe they would get it and die? But you risked, like this. This. You created this extreme pain between these two people, and you told them that we're doing this for your own safety. I don't know. That kind of stuff just drove me nuts. I was like, what is happening? What is the story?"}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":3232.36,"end":3275.56,"speaker":"Paula Pageau","text":"The same here. There were couples who were in the same care home, the same care home, but not allowed to see each other. And when you're talking about somebody in the 80s, in their 80s or 90s, that's not a boomer. Generation, they might have taken part in the Normandy landings, liberated Bergen Belsen, rescued people from fires, and then, oh, you can't go to your granddaughter's wedding in case you catch a nasty illness. It's pathetic. They're not the boomer generation, but even the boomer generation, it is a bit ironic that these are generation who kind of like took ludicrous amount of drugs and rode around on motorbikes and now they're worried about dying now. But, but I think there's, there is something, there is something in it about this, this, this, this fear. Fear of death. The fear of death and dust."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":3276.6,"end":3383.72,"speaker":"Jonathan Pageau","text":"Yeah, well, that's what technology is. So, so the technology is, is ultimate. Like technology primarily, let's say mythologically is to put off death. That's what it is, right? It's the garments of skin, it's the, it's the city of Cain, it's the whole death at bay. That's what medicine is, all of these things. There's nothing wrong with that. But we can understand that if we divorce technology from its basic primal reality, which is a desire to stave off death through means that are taken from death to a certain extent, then we don't understand it. And then we will struggle to understand why and be surprised that people are. The transhumanists understand technology as a way for immortal life, that they understand that it's all about this desire to stave off death. So as technical society increases, then it's not surprising also that fear of death increases as well. And this is not like, it's not a weird thing. We experienced this when we were in Africa. We experienced it so much. When you live with risk, you are less afraid because you know that it can happen at any time, but you just live with risk. So we were living in Congo, we'd live in local neighborhoods and so there was always danger, obviously. But you would, you would manage the danger, you would, you would live with it, you would see it. But the people that lived in closed off compounds, completely closed off compounds, they were always scared, completely afraid to go out and couldn't, you know, they would, all of a sudden they would look outside and everything was danger. And that's also what technology does as it makes you safer, it makes you more afraid. There's no way around that. And so that's also what we're seeing. That's also what we see for the last two years."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":3384.44,"end":3446.02,"speaker":"Paula Pageau","text":"Yes. So that explains all the anxiety about safety online. I think you have to have higher and higher and higher levels of security. So I think. People think that technology is increasing their agency, and it does increase it in certain ways, but it's decreasing it in other ways. But if you think of it, if you think about it in terms of staving off fear of death, would that be a kind of a way of making us see how it's curtailing our agency, but we're just willingly going along with it? But I think you said a little while ago that we were just passively going along with it, but in a sense we're not, because we're sort of actively, actively colluding in our own fragmentation, the way in which our notion of identity is becoming fragmented and the ways in which the technology is often hacking the worst bits of us. So, you know, in terms of, like the online. The social media companies have worked out that it's our worst. Our worst emotions are the ones that are most easily riled and the ones that are most addictive. Like, you know, the ludicrous, righteous indignation you can get in some. Having some insane spat on Twitter with some you don't even know this person is."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":3446.34,"end":3585.09,"speaker":"Jonathan Pageau","text":"Yeah, they're maybe even anonymous. Like, they don't even know their name. Yeah, no, you're right. But it has to do with increased. So there's also a relationship with staving off death and an increase in power. And so that's a real thing. If you stave off death and increase your power, it's like a drug, obviously. And that increase in power is something that can happen at a very physical level, which is that I have a gun or I have a fortified castle, but it can happen also in terms of your influence and in terms of your reputation. Because as I increase in power, in influence, then the type of feeling that I get from having a gun, I can also have from just increasing my power of reputation. And so you can understand that. So you can see, like, if you can. If you can understand that it's related, the notion of safety, increase in power, but then it also leads to the fragility at the same time. All of these things are happening at once. And it's hard to kind of capture analytically, but if you capture it mythologically, you can see that there are many structures like that. Where you see this image appear. Like, one of the biggest ones is the statue of Daniel, the statue of Nebuchadnezzar in the Book of Daniel, where you see this hierarchy of metals and this soft metal at the top, and then these harder and harder metals that are more powerful and more brittle, and then they end with a kind of hybrid metal at the bottom, which is multiplicity, which is fragmentation, which is quantity, but it's also the most fragile. And then the statue shatters. So if you think of your online presence as something like that, also the type of influence that you have with your wife or your husband is something which is extremely qualitative but is very limited. And then your family, your. Your social sphere, your influence in your church or whatever, then online, it's like the capacity you have to influence and to. To affect others is huge. But then it also has the other characteristics of being fragmented and fragile at the same time."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":3585.49,"end":3645.76,"speaker":"Paula Pageau","text":"So then your self reflected back online is fragmented and fragile. So one of the things I've been trying to grapple with, and I haven't got, I'm still thinking about this very programmatically, is in terms of how there's a paradox between how way we're using technology in the online world is kind of like really prioritizing for self, as if the self, you know, yourself alone with a computer or a smartphone is like the center of a world. And yet our notions of self are just becoming increasingly fragmented. And in some of the sort of identities that are coming up, it's as if there's a real priority to the mind or the self. A sort of like isolated little, like almost like a Cartesian self or a Cartesian mind. As if that's got to take priority over the body. So the ways. See, there seem to be so many body modifications and so many ways of it. If your. If your mind doesn't match your body, you have to change your body to. We can. The body is just like, become a piece of technology that we can just use to alter. In the case, you know, the way in which Hydra talked about the standing."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":3645.76,"end":3649.52,"speaker":"Jonathan Pageau","text":"Reserve of the world, your body's a standing reserve."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":3650.08,"end":3752.76,"speaker":"Paula Pageau","text":"Your body's their own standing reserve. So you can put a chip in it to make it easier to access everything if you want. You can change sexes, apparently. You can have ludicrous piercings, or you can just present yourself in different ways. But I was actually thinking about. I was thinking about this in terms of how Descartes developed, because people are talking about this dualism, but how Descartes was thinking about this, because nobody is a Cartesian dualist anymore in the sense of Descartes, there was a mental substance and a physical substance. Nobody thinks there's a mental substance and a physical substance. But then it kind of struck me that when, I mean, you probably know this, but not everybody will know it when Descartes sat down to write his discourse on the method about how he came to the, you know, he's came to his conclusions that cockatoo ue go som I think, therefore I am. He'd done it at a time when the reason why he was searching for certainty, because he was living at a time where there are lots of different beliefs around. There was, there was no certainty as to what to believe. And he spent some time away just doing things like spending years playing cards with soldiers to try to wipe his mind clean. And when he sat down to do this, he isolated himself. He sat alone in a stove heated room as he described it. I was thinking, so is that solitude connected with the way which he came to the conclusion that the source of his certainty, what he can know for certain is his thinking self. And so not just for substance, but the fact that this is the basis of his epistemology. How similar that is to the way in which people are walking along, walking along, not seeing the world because they're on their phones or just alone with their computers. Do you think I might have something to do with how the mind is being prioritized?"}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":3752.76,"end":3804.52,"speaker":"Jonathan Pageau","text":"And I think, I think you're right. I think that, I think that it's the way it's always, when I think about the contemporary word, I always have to think of it in extremes. And so it's like as we're presenting, let's say as we're presenting the extreme of the mind, the isolated mind, and this, this, this idea of the mind looking at a screen and tracking with the screen, there's also at the same time a kind of obsession with the idiosyncrasies of the body as well. So you know, in it, in a normal world, there would be less of both. Like there would be less, there would be less obsessing with this kind of weird solipsistic world where you self define yourself. And then it would also be less obsessive with, you know, seeing that, because there's also like a weird obsession with gratification and the sense in which the idiosyncrasies of the body also have to be met."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":3804.76,"end":3805.24,"speaker":"Paula Pageau","text":"Yes."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":3805.24,"end":3853.28,"speaker":"Jonathan Pageau","text":"And so that's kind of how, that's also the way it's presented. If you pay attention to some of the discourse. It's like the body wants this, what can I do? That's what my body wants. Like there's, there's like an extreme sense of disjunction. And that is. So I see it more as a disjunction and so, yes, there's. There is so. But you can already see it like in the time of Descartes and as, as the Enlightenment kind of makes its way out is that you end up having idealism and materialism and they can't, they can't bring them together again. And so we're seeing extreme versions of that in individual lives where people are, on the one hand, obsessed with like, pleasure and obsessed with their own, like, personal idiosyncratic satisfaction, but at the same time they're divorced from their body and they're living in this kind of abstracted self. Willingness."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":3853.51,"end":3853.79,"speaker":"Paula Pageau","text":"Yes."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":3853.79,"end":3907.31,"speaker":"Jonathan Pageau","text":"You know, solipsistic being. So, so that's the way that I, that I see that. Yeah, that's the kind of. That's the way that I kind of. And there's also, there's also a weird thing that happens, which is that it seems like breaking down someone that way seems to also make it possible for them to get sucked into. Sucked into something that will kind of take them up, let's say, you know, and so give themselves to some, to some cause or some identity that will completely absorb them, you know, and so that's why you, you also see these weird neoreligious movements and these, this kind of neoreligious politics, you know, and, and you know, the clans and all of that. It's like, it's, it's all. It's because the clans are important on the online space too. So it's, it's as if doing this makes you also like, almost like, like something that was prone to being in a cult or something like that. I don't know how else to say it. Does that make sense?"}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":3907.55,"end":3912.51,"speaker":"Paula Pageau","text":"Yeah, I think it makes sense. I said, what? So one of the things. There's lots of different things happening at once, I think so."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":3912.59,"end":3913.23,"speaker":"Jonathan Pageau","text":"Exactly."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":3913.23,"end":3943.41,"speaker":"Paula Pageau","text":"One of the things that's happening is distortion of time, so that everything has got to be instant. So, I mean, even. Actually, a friend was saying the other day when she was. She wanted to know why I hadn't got a smartphone. And she was saying, oh, but if I'm out somewhere and I want to know something, I can find it out immediately. Why do you want to know it immediately? Even everything has got to be really instant. But also, I think you're right about that point about the desire. If you have. There's a move around that if you have a desire for something or even if it's a fleeting desire that's somehow part of your identity."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":3943.57,"end":3944.05,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":3944.05,"end":3958.38,"speaker":"Paula Pageau","text":"Well, you're getting about 8,000 trillion different kind of gender identities and sexual orientations and so on. Because if you ever have some sort of fleeting desire, then that must somehow reflect on who you are, which is just."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":3958.38,"end":4006.39,"speaker":"Jonathan Pageau","text":"But, but it's, it's interesting because it's, it's not unrelated also to consumer culture and to marketing and to like mass capitalism. Because we have that reality not just with our sexual desires, but we have that reality for everything. Right. You want to eat something, you could probably find it, whatever it is, whatever you can think of. You know, if you're near any city, you could probably find what it would you want to eat. You go to the grocery store and you have foods from everywhere in the entire world that is there to you to available to you. And I can order something on Amazon and get it tomorrow any, pretty much. And if I can't, I'm annoyed. It's like, wait, what? Why isn't there two day shipping for this one thing? I have to wait two weeks? Really? Like it just gets, it gets on your nerves and so it's like this instant gratification is all over the place. Yeah, it's not just."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":4006.63,"end":4039.74,"speaker":"Paula Pageau","text":"Yeah. I mean that also links back to what we were talking about at the beginning about agency, about building up a skill and building up a character over a long period of time. But this is just the reverse of that. It's the idea that you've got to form what your identity is. Maybe that's one of the reasons why people's identities are shifting, are shifting so much that somebody can say, you know, some celebrity can come out one week bear non binary, the next week they're trans. But that's kind of a reverse of the idea that you're build. You're building up something which is. Can get integrated into yourself over a long period of time. Time. But it's got all done at times it's just gone."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":4039.98,"end":4154.47,"speaker":"Jonathan Pageau","text":"Yeah, well, I mean I think it's all. There is definitely an inversion that happened in general. Like and then it happened really in the 1960s. Most, most basically where it really was that there was a sense in which we shifted. We inverted it. We said that your identities are socially constructed and therefore they have no validity. They're not real. They're just social construction. Your desires, because they're experienced, then those are real and those are that on which you should base your identity. And it's really opposite of any traditional world, like any, any traditional religion or any traditional world where there's a sense in which you participate in these, in these identities that are. That come from above. You could say, and those are the ones that are the most stable. But those down here, like these little desires, they're constantly shifting. They're always changing. You know, you can have contradictory desires and you can have desires that you can hate someone and love them at the same time. And so you actually have to be careful with, down here with all the desires because they'll lead you into chaos and confusion and tyranny. And so it's like all these things are going to happen. But I mean that's a, that's a basic major change that happened in, in the, in the past few generations that has been kind of building up, I think from materialism itself. Yes, you can understand that that's, that's one of the implications of materialism is that identity comes from below. It comes from this, this stuff. Not from, not from these, these structures that are, that are, come from above. Those are just tyrannies. They're just, you know, methods of controlling others and all that stuff. So the trouble is very deep like in terms of, of how to, how to. If we can't get out of that thinking already, like we're, we're, that's going to be, we're going to be in trouble no matter what. Because if you, if you really think that your desires are, are real and that you should be led by them after that, no matter what, no matter what, you're always going to, you're always going to be turning in a, in a circle, in a wheel."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":4154.79,"end":4218.02,"speaker":"Paula Pageau","text":"Yes. So it may well be that like from the 60s that that came into popular culture, but it's actually been present in philosophy for longer than that. So that you can see it in utilitarianism from the idea that what we need to do is. So Jeremy Bentham talked about how mankind is under two sovereign masters. So for motivation to seek happiness or to avoid pain. So you can always see some point of that because of course it's stronger in terms of pain. Because if you're using it as a basis for ethics, it might not be enough as total basis. But you can see the attraction of thinking. But of course, I mean, inflicting gratuitous pain must be wrong. And then more modern versions of utilitarianism are actually desire based. So thinking that because there are problems with, we don't just want to have the experience of happiness, we want to actually do, we want to actually do stuff. You know, John Nozick's. Is it John Nozick. I never remember the philosopher Nozick. I can't remember his first Name. He invented the idea of the experience machine. But you could just go in and just have all these experiences but nothing real was happening, you know, like."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":4218.1,"end":4231.23,"speaker":"Jonathan Pageau","text":"Yeah, yeah, I know. And I also read recently that they, they, they tried to re. Ask some students about this again, like they tried to redo the experience and that the results were radically different than what they were when he came up with the experiment."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":4231.39,"end":4232.99,"speaker":"Paula Pageau","text":"But more students wanted to go in."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":4233.15,"end":4236.75,"speaker":"Jonathan Pageau","text":"Yeah, like a lot more, A lot more people wanted to go in now."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":4236.83,"end":4366.45,"speaker":"Paula Pageau","text":"Oh, right, yeah. Because, because I always asked, I've taught this for years. I've always asked the students about it and it's always a substantial minority of students who say bed going. Mostly men actually. But so, but the idea that what we want to do is have our desires satisfied. So you can see how that might be a preference, you know, move on from that. But then there are all sorts of ways in which you might try to solve a problem. But desires can be fleeting. So Harry Frankfurt brought in an idea about higher order or lower order desires. But we can order them in some way that you might have a desire not to have a certain desire. But that still has, that still has the problem. There's nothing outside the field of desires. You just have to get into a coherent system. But this is, I mean this actually comes into a lot of the computing and a lot of work in AI. So for example, Stuart Russell, have you ever come across his work? He's like a leading AI type. He's co written what's probably the most well used textbook on AI. And he's also recently, two or three years ago written a book about superintelligence. He's trying to address Nick Bostrom, who wrote a book on superintelligence about a while ago now, about six years ago, I think was worried about looking at the problem about how superintelligence might develop in a way that's going to control us and trying to how can we stop, how can we build AI in a way that's going to make certain, but it's going to align with human values. So, but Stuart Russell is trying to do a second go at trying to refine that. But his way of doing it is to say, because his definition of intelligence, which is widely used, is completely instrumental. So intelligence is judged in terms of how well or how efficiently you reach a goal. So the goals aren't part of the definition of intelligence. It could be any goal. So you could intelligently kill the whole human race, for example. So the goal's got to be put in there. So the question is, how do we stop insofar as super intelligence is possible? Which is another question, how can we make certain that it's aligned with our goals? So Russell's idea, in a nutshell, is to train the AI to observe our desires and our behavior and extrapolate."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":4366.53,"end":4367.41,"speaker":"Jonathan Pageau","text":"Oh, my God."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":4367.81,"end":4377.09,"speaker":"Paula Pageau","text":"Extrapolate. Yeah, that's what I thought. Yeah, extrapolate. Extrapolate from how we. How we're behaving so that it can learn what humans really want."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":4377.33,"end":4383.41,"speaker":"Jonathan Pageau","text":"Yeah, that's great. That, especially if you do that online. That's super duper there. That's not going to end well."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":4383.97,"end":4396.84,"speaker":"Paula Pageau","text":"Yeah. So. But if it's going to extrapolate from human behavior, how could it extrapolate when it hasn't got that shared experience of a human being in some ways, like, you know, my friend instantly, we both instantly knew we were trying to catch that. The person who stole my purse. Yeah."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":4396.84,"end":4437.41,"speaker":"Jonathan Pageau","text":"And also, if you can't tell the difference between quantitative and qualitative realities, which is that, you know, you might get married just once in your life, but that thing might be the most important of your. The most important thing that you're aspiring to. But every day I do stupid things and I play video games and I. Whatever. And I do things that are boring and useless. But if you ask me what's the most important, I'll tell you that it's one thing that happened at one time. And so the idea that you could extrapolate out of human desires is hilarious because most of the time our desires are pointless. Well, not pointless, but they, they. They really are base and they kind of lead us into base behaviors."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":4437.57,"end":4447.01,"speaker":"Paula Pageau","text":"Yeah, yeah, I know. So if you'd asked me the question about, you know, which two days of my life were I happiest? They were also the two days when I had the most pain because that's when I had my kids."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":4447.41,"end":4447.81,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":4448.45,"end":4450.93,"speaker":"Paula Pageau","text":"How could you extrapolate from that?"}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":4451.25,"end":4587.34,"speaker":"Jonathan Pageau","text":"Exactly. No, I think you've got it right. But it's interesting. Maybe I want to finish with one last point, which maybe want to get your opinion on, because it actually comes down to what we talked about a little bit at the outset in terms of the question of understanding agency or even consciousness of higher order beings as being framed in human. In humanity. That is that the hierarchy of beings itself is the actual frame by which consciousness and intelligence happens. Right. So it happens through agents. It's not something that happens just up there in the sphere. And so the agency and the consciousness of a group culminates into leaders into you know, into beings that actually have position. Right? So I think that that's one of the things that people seem to. I think maybe some people are thinking about it, but in terms of super intelligence or in terms of artificial intelligence and the idea of, you know, that AI could surpass us, right. I think that we need to always understand it within the human hierarchy, which is that it depends who is going to wield it. And those in power will always wield it. And so artificial intelligence will just always be more power, and it will be wielded by those that already have power. And so whether or not the computer is thinking on its own or whether or not it is fully conscious or whatever, you'll never know that. You can never verify that. You'll never be able to have that experience. But what you can see is you can see the fingers of those that. The kings and the powerful in the world of how they will utilize that power for certain actual purposes. And so I think that we should not be naive. Like, the idea that you could program good intentions in AI, it's like, who's going to be wielding that AI? Who's going to hold it? Who's going to hold the reins? Who's going to hold the on off switch? Who's going to, like, who's going to decide what information gets put into it? All of that is what's most more important than the actual algorithms themselves, like, although they can be super powerful. And that's the real question. That's more important than the other questions, in my opinion."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":4587.42,"end":4661.96,"speaker":"Paula Pageau","text":"Yeah, I think you're right. Because in a way, there's a real tendency to think of AI as if it's a separate agency, when AI is just something that's produced by people and used by people. So the control problem in AI is a problem, is an issue in the technology. But to make certain it does what you want it to do, which is a problem because it's a problem with, like, with any computer program. You could write a computer program, and everybody who writes programs know that they don't always work. It's just. And because it's so complex, there's a big problem with that. But people. I mean, I think the real control problem is the people who are using the AI, the people who've got all the power, the big companies. I mean, look what's happening in our world at the moment. This is not so much a matter of AI, but the day that we're recording this and waiting to find out whether Elon Musk is going to buy Twitter So I sometimes think that's one of the reasons why the state wants to control individuals, because they've given up any idea that they could control all these billionaire tech people who are ones who are really running the world. So it's. Yeah, I think you're right. We tend to attribute agency to something. We tend to attribute cause to whatever seems to be new or distinctive. If there's a complex situation, you'll pick out the person who looks a bit different or the new thing that's just happened. But that's often a mistake. That's what's happening with tech. The AI is made by people. It's operated by people."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":4662.2,"end":4757.87,"speaker":"Jonathan Pageau","text":"You're right on both. Like, if you look at the Elon Musk situation, it's really interesting because you can actually see how everybody knows that implicitly. Like, everybody really knows that implicitly, because you have people that are in this situation where Elon Musk might buy Twitter. You have people that are cheering and are gloating and are so excited because they align themselves with Elon Musk and his way of thinking and what he's doing. And then you have people that are freaking out and are completely, completely losing their mind. And the thing is, is that this is also the problem. So, like, for example, Twitter, couldn't. The idea that, let's say Elon Musk will bring back free speech to Twitter, like, just frame it that way. Elon Musk is not going to bring back absolute free speech to Twitter. That's not going to happen. Because just the fact that you have to create hierarchies in the manner in which information is displayed means that whatever you think free speech is, it can't completely exist because you have to prioritize. You can't get the flood of all Twitter at once in your face. It's not possible that that happens. So there has to be a kind of prioritization. And therefore, that prioritization is based on a hierarchy of values. And that hierarchy of values will appear in the way in which information is displayed to you. So, I mean, I can understand why people are. I mean, I'm annoyed at Twitter because I don't like their hierarchy. The way that they create hierarchy of values. I think it's lopsided. I think that it's only. It's only on one political. In one political direction. And so I'm annoyed and I find it frustrating. But people who think that all that's going to happen is, like, you're opening your free speech. That's not how it works. Information doesn't work that way."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":4758.03,"end":4783.49,"speaker":"Paula Pageau","text":"Yes. It's also not going to work because in different countries you can. I mean, like in Britain, lots of people have been, you know, interviewed by the police, for example, over what they said on Twitter or lost it. Have actually lost their jobs over stuff they said on Twitter. So, yeah, there's a well known case here of a woman, myof. Maybe she didn't say it on Twitter, but there's cases of people who get into trouble for saying really outrageous things like men can't be women."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":4783.89,"end":4795.49,"speaker":"Jonathan Pageau","text":"Yeah, well, that's what I mean. It shows you that it's revealing where the principalities are when that happens. Like, you can see if you want to, you can actually detect who's in charge, like, who's running the story, who's running the show."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":4795.73,"end":4806.51,"speaker":"Paula Pageau","text":"It's also interesting about a lot of the newspapers and media outlets that are coming out outraged about Musk buying the Washington Post, owned by Jeff Bezos. But, you know."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":4808.43,"end":4838.41,"speaker":"Jonathan Pageau","text":"It'S so funny. I mean, that for sure is hilarious. Like, yeah, I have to admit that I've been perversely enjoying the whole thing. Like, I just find it hilarious and it's making me want to pull away from Twitter even more. But it's still funny to watch. To watch people become very obvious. Like things become very obvious in these types of moments. We've been going for a while and I need to go, but this was wonderful, as usual. We need to plan, like every once in a while, come back and continue our discussion."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":4838.57,"end":4846.73,"speaker":"Paula Pageau","text":"That would be great. I've really enjoyed it. And it was. Yeah, it was. It's interesting how the different ideas between agency and ID will match up."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":4846.81,"end":4850.97,"speaker":"Jonathan Pageau","text":"Yeah. In the end, even though we didn't know we were going to bring them together, they turned out that they."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":4850.97,"end":4854.25,"speaker":"Paula Pageau","text":"But it's been great talking to you. It's really interesting and fun as well."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":4854.58,"end":4884.59,"speaker":"Jonathan Pageau","text":"Thanks for your time. And, and for people who were listening, the opening of this video, the, the music, it's like that we were going to put in the heavy metal version, which was done by my nephew Jamie. Yeah. And so. And so Paula is the one who, who, who. I think you reached out to your nephew and said, oh, would you like to do a version of this? And they did this great heavy metal version that a lot of people love. People really love it. So, so that. Thanks for your. Thanks. Thank your nephew Jamie for us. We really enjoy it."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":4884.59,"end":4885.91,"speaker":"Paula Pageau","text":"Yes, I will. Yeah. Yeah."}
{"episode_id":"SW - #234 - 2022-05-27 - Dr. Paula Boddington - Digital ID and Control","start":4886.55,"end":4950.58,"speaker":"Jonathan Pageau","text":"All right, everybody, thanks for your attention. I hope you enjoyed this episode of the Symbolic World. The Symbolic World is based on a series of videos that you can find on my YouTube channel, Jonathan Pedro's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course leaving a review on itunes. Everybody knows that's the best way to get the podcast out there to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon, the Pageau videos as well and on subscribestar. All those links you can find on my website or in the show description. So thank you and I will see you soon."}
