{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":1.44,"end":52.6,"speaker":"Paul Kingsnorth","text":"What does that mean? What does God do? Well, God creates. That's what God does. So if we want to become God, we have to create, so we have to create life. So again, there's something almost subconscious there going on that we have to create new life in order to actually be gods if we're going to really cement our dominance of the planet and our coming dominance of the universe. Because we're going to colonize that as well. Because that, I mean, that's another aspect of it, right? We end up colonizing the whole of creation. This is all part of the same narrative. We're going out into the stars, we're going to. We're going to terraform the planets. So it's a. In order to become like gods, we have to create. We have to create worlds, which is what we're going to do when we terraform Mars. That's what Ellen Musk wants to do. And we have to create new life. So here we are openly trying to do it, but at the same time, we have this kind of terrifying sense that the life we're creating isn't under our control. You know, it's. It's already looking like it's going to supplant us."}
{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":52.6,"end":52.88,"speaker":"Jonathan Pageau","text":"So."}
{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":52.88,"end":62.37,"speaker":"Paul Kingsnorth","text":"Because funnily enough, we're not very good at being gods. You know, we're good at creating, but we don't even really know how, what we're doing or where it's going to go. Turns out that being God is quite complicated."}
{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":74.05,"end":130.23,"speaker":"Jonathan Pageau","text":"This is Jonathan Peugeot. Welcome to the symbolic world. So, hello, everyone. I am here with Paul Kingsnorth. Paul Kingsnorth, for people you know who watch my content needs no introduction. He is a writer. He has written several novels and recently did an entirely very powerful series on the machine, which broke down some of the mechanisms of what is happening around us, trying to help us understand, you know, the processes with the, let's say, first of all, the principalities behind it, but then also understanding how it. How it runs. And so he has finished his series. He's actually going to publish it as a book next year. And so I wanted to talk to him and see what his insights are after going through this. So, Paul, thanks for talking to me."}
{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":130.71,"end":132.55,"speaker":"Paul Kingsnorth","text":"Yeah, great to be back. Good to see you again."}
{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":133.19,"end":146.21,"speaker":"Jonathan Pageau","text":"And so you have. You've gone through the whole process of thinking through, let's say, our situation, you know, and things are moving so fast. What, what are the main insights that you taken away from your process?"}
{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":147.17,"end":439.93,"speaker":"Paul Kingsnorth","text":"Yeah, it's a good question. So. Well, it's. So you Just use the word principalities, right, to talk about, talk about the thing, the power behind the machine. And I think this is the main insight for me. So I mean my, my, my sort of long term, I don't know what my background is exactly. I'm a writer, but I, I've always, I've always kind of, I've cycled between my left and my right brain as a writer. So I'll. I write a novel and then I'll, then I'll write some non fiction, then I'll go back to the novel. And I'm always circling around the same question. I think all writers do. And I think the question for me is why modern people are so disconnected from, well, everything real actually. Disconnected from culture, I think, disconnected from nature, disconnected from God. And I felt that all my life and I've tried to explore it in all my work since I became a Christian, since I became an orthodox Christian three or four years ago now it's, it's really come into a different focus entirely. It feels like that's the kind of the apex of the understanding. But what I, what I was trying to do with this book, which I started writing while I was in the process of becoming Christian, so that, that, that kind of is reflected in the writing. I think the last chapters are more Christian than the first ones, strangely enough. But what I was trying to do was look at the technological society that we're living in, which I. Which I called the machine, which is a term I borrowed from writers I've admired for years. R.S. thomas, D.H. lawrence, Robinson Jeffers, you name it. For 100 or so years people have been using this phrase. George Orwell used it this because it's a very good image, it's a very good symbol for the kind of world we're living in. It feels like we're cogs in a machine. It feels like we're part of something very much bigger than us that isn't really natural, that's constructed in some way and we're controlled by it. Maybe we built it to control things, but now it controls us. And it's accelerated a thousandfold in the digital age. And it's accelerating all the time. And it's very difficult not to feel like we're part of something that we can't get out of. Now that's starting to feel like it's got a mind of its own. And that's the big insight. So especially in just in the last couple of years as say AI has taken off, we've really started to feel and we've seen a lot of people talking and writing about this, that there's something behind this that's almost intelligent. So I felt like we were trapped in this thing, and I wanted to write about what it was, where it came from, what it, how it actually infected or affected or infected the culture and politics and what we could do about it. And, and I think that the big insight for me probably is, is a spiritual one. It is the sense that there's, if you look at this from, if you look at it, say, from a Christian perspective, then it looks like the ultimate manifestation of the rebellion against God that begins in, in the start of the book of Genesis. Right. So we decide to, to stop aligning our will with that of God, and we start to follow our own will. And what do we do then? Well, we construct cities, we construct technology, but more than that, we start to try to build a world of our own. And the ultimate endpoint of trying to build a world of our own is trying to build God. We're trying to build gods, which is the way that the people in Silicon Valley now openly talk about what their project is. Yeah, so we've ended up building this thing, which is far more than the sum of the technologies involved. So it's not just about whether smartphones are good or whether cars are good or whatever. It's a, It's a whole network of something that feels like it's taking on a life of its own. And one of the things that I really found most fascinating and disturbing in the research was this. If you start to read the stuff that's written by the guys in Silicon Valley who are coming out with this stuff, who are really designing the, the, the kind of, the brain of the machine that we all function on all the time, which we call the Internet. They talk very openly about what they're doing as summoning God, building God, creating a platform for something to come into. They talk about the importance of, they talk about self replication, but more than that, they talk about something that has its own mind and, and its own way of seeing. So, you know, you can dismiss that as mad fantasy, but they're the people building it. And so if you, if you look at it from, from a spiritual perspective, from the perspective of those powers and principalities, you see something going on the sort of long predicted. It's very old, but it's also very new. We're trying to replace nature, and we're trying to build God and we're trying to live forever, and we're trying to become Gods. And in that sense, it's a very old story. But the machine, if you like, is, is, is, I think that the latest manifestation of it, probably the most successful one. So that's the weird, disturbing conclusion that I ended up coming to."}
{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":441.29,"end":503.99,"speaker":"Jonathan Pageau","text":"Yeah, I mean, I, I, I think I totally agree with what you're saying. I, I mean, there's a question that I have. This is something that I've been thinking about for a very long time, which is, if you can. So in, in Revelation, right, there's, there are two images. There's the image of the beast and the, you know, of this, this kind of, let's say, civilizational beast, which is using people's desires to advance itself and to basically become more powerful. And then ultimately the beast kills the horde, and then it's just tyranny all the way, all the way through. So there's this one image, right, that's one image of civilization, but then there's another image which is heavenly Jerusalem, in which you do have this sense of techne, of a city, you know, have you ever thought or imagined or thought of how technology, would it be possible to turn this into something that would serve God, let's say?"}
{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":504.15,"end":621.61,"speaker":"Paul Kingsnorth","text":"Well, that's the question, isn't it? The question is always what the machine, what the technology itself is serving. So, firstly, I think there's a difference between a tool and a technology, because a tool is a very simple thing that you can use to, you know, a spade is a tool. You use it to break the ground, and you could use it to dig the grave of somebody you've just murdered, or you could use it to plant beautiful plants and grow food that you need to feed your family, right? So that tool could be used for good or ill. A technology is something that is almost able to manifest its own will, and that's where we are now. So the question is what something serves. So I don't think that's just the question of, you know, a very common argument you'll hear is technology is neutral, and all we really need to think about is whether we do good or ill with it. And sometimes that can be true. Like it's, as I say, it's true with the spade. But some technology is not neutral, and an atom bomb is not neutral. It can only do one thing. I would actually argue that a smartphone is not neutral either. I mean, it's going to take you in one particular direction. So you can create technologies and tools. And creating technologies and tools is what humanity does. There's no way of getting out of that. That's who we are. That's the gift we're given. It's a question of what you create. And what you create is determined by what you serve and what the. What the machine is. So this thing I'm calling the machine, I think is designed to serve our independent will, so it will take us in a direction away from God. You could build technologies designed to serve something else and they would look different, I think. So it's not a question of the tool or the technology per se. It's a question of the thing that's being served, as you say. Yeah, there's a different kind of city. I've seen you talking about this before. You know, the heavenly Jerusalem has a tree at the center of it. You know, Know, it's a very particular type of city. I'm struck by the fact that the cities we used to build in the Middle Ages, the highest buildings in those cities were churches. The highest buildings in our cities are banks."}
{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":621.69,"end":622.09,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":622.09,"end":652.28,"speaker":"Paul Kingsnorth","text":"So that's the difference between the city now and the city then. There are a lot of different kind of cities. There are different kind of technologies there. It depends on. On. On who you're serving and what you're trying to do. And I think that in a culture like ours, which specifically almost even rejects that question, can't see anything other than the material and the financial and the. And the progressive in the broadest sense of that word. It's always going to build something like the machine, which will always just turn us back to our own will all the time."}
{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":652.52,"end":790.6,"speaker":"Jonathan Pageau","text":"Yeah. One of the things that I think is interesting. Tell me what you think about this, because I've been thinking about this a lot, which is. So when you build a tool, you make a tool, then the tool serves the purpose of what the tool is made for. But there is a manner in which we become dependent on the tool to some extent. Right. So if I, you know, if I have matches, then I forget how to make fire with something else. And, and at some point, if I don't, you know, as technology increases, then I lose certain organic abilities to make that ability more powerful. So there is a manner in which we. We tend to become dependent of our tools. Now, is that good? Is that bad? You know, it's just reality. Like, it's just how it. How things function. But when you create a technology which has to do with mind and a technology which has to do with attention and technologies which have to do with human. The way humans perceive meaning and engage with meaning. So the idea of creating a Statue of a God, for example. Like that's an example where you create a tool. You're creating a techn. A technical structure, like you're making a statue of some God. There's, There seems to be a way in which all of a sudden that the manner in which we become dependent on changes because then we serve it. Because you're the AI. Like, what we're seeing with the AI is that we're creating this AI to serve our will, but everybody knows that ultimately we will subject our will to it. It's a, It's a weird thing, right? It's like we're doing it to increase our power and to increase our capacity and decrease our. To do these things. You ask even the people building it, like, will it transcend us and then become a God in the proper sense of being above us and managing us? And the answer is. Well, probably. Probably yes. You know, my daughter, like my daughter, her last essay for graduating English was to write an essay about how AI serves the needs of students. And she said that the way that the, the, the, the. The things that they gave her to read in order to write the, the. The essay were all about it basically being impartial, you know, of being able to manage things without the human prejudice and all this stuff. And I'm like, basically they're saying you're going to serve these AI."}
{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":791.56,"end":856.85,"speaker":"Paul Kingsnorth","text":"No, it's really, it's really interesting, the, the whole, the whole notion of what you serve. So again, I mean, we've known for a long time that we've already created a society which we're serving. Consider how people talk about the economy, okay? Politicians talk about the economy all the time. And when there's an election, the argument is, who's going to run the economy best? What's best for the economy? What can we do? And the economy is spoken of like a God, like it's a separate thing. And if you actually look at what, you know, the economy, literally the, you know, going back to the Greek, you're. You're looking at a term that means household management, right? So, so an economy is something you're embedded in, say your home is an economy. Then in a traditional society or even in a modern one, it's just, it's the sum total of things humans are doing. But we now talk about this thing called the economy, which is somehow out there. It's separate from us, and we're already serving it. Okay? So, and, and you'll hear, oh, we need lots of immigration for the economy, or we need privatization for the economy, whatever it is as if you somehow have to make a sacrifice to this God. Right. Well, we might not like this, but we have to do it. So we've already accepted."}
{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":856.85,"end":857.61,"speaker":"Jonathan Pageau","text":"Exactly, yeah."}
{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":857.61,"end":889.9,"speaker":"Paul Kingsnorth","text":"So the economy has become. It's become an idol and we're already serving it and we're accepting. If you listen to the way that politicians talk about this, we've already accepted that we've created a thing that is now controlling us and we have to give the economy certain sacrifices every year, otherwise the economy will collapse and then we're in trouble. Right. That's like the God rejecting us. So we've been in this for a long time. So AI in one sense is very new, but in another sense it's just a culmination of living in this system in which you say we are totally dependent on. And we have been for centuries on millennia."}
{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":889.9,"end":890.34,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":890.66,"end":965.41,"speaker":"Paul Kingsnorth","text":"There's a. There's a phrase that the historian Ronald Wright came up with called the progress trap. He wrote a great book called A Short History of Progress, and he's talking about exactly this. You create. You create a technology to solve a problem, maybe it solves the problem, but you're then dependent on that technology. So say you want to. I'd take something like the Green Revolution, right? So we're saying, oh, there's, there's a lot of people in the world, there's not enough food for them. Well, let's, let's, let's use artificial fertilizers and phosphates and chemicals. Well, great. Now we've, now we've increased the food supply, but we've also damaged the soil. And also we have to keep producing this stuff because there's so many people now dependent on it. So now we're locked into an industrial system that needs all these inputs and then that has a lot of ecological impacts that you hadn't worked out before. And then you've got to deal with them. That requires another technology. So you get deeper and deeper all the time. So AI is the solution to the problem of us already being dependent on a society that we're stuck in. And so we just get deeper and deeper and deeper into it. And it's like we have to always convince ourselves that what's happening is good. We have to have the myth of progress, because otherwise we might step back and say, hang on, we're completely dependent on this machine and we don't even know where it's going. And now, as you say, it seems to be going somewhere that is not under our control at all. Yeah."}
{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":965.57,"end":995.47,"speaker":"Jonathan Pageau","text":"Yeah, but the, the problem, and this is, it's so, it's so interesting. Technology is so fascinating because the issue in some ways is also real. Like if I, I want to give the devil is due, as we say, right? So the AI problem, once the cat is out of the bag, it's almost impossible to put it back. Like once the serpent is out, it's almost impossible to put it back because, because then there's also world competition. So if we don't do AI means that we're going to let China do."}
{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":995.47,"end":997.19,"speaker":"Paul Kingsnorth","text":"It, of course, and we don't want."}
{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":997.19,"end":1045.37,"speaker":"Jonathan Pageau","text":"China to be the ones ruling us with their AI. And so it, it, and it's interesting because that's when you can understand what it means to be dominated by a principality where like, no, nobody controls this anymore. And this is what was great about your entire essays, I thought. That whole series of machines that people, you know are always saying, oh, you're a conspiracy theorist. Because you see these, these, these things happen in the world. Like, no, you don't have to be a conspiracy theorist. You don't have to, have to have intention at every level of, of the, the system. It's just, it's just like, it's just whether or not people follow their own advantage. Once the, the, the cat is out of the bag, then the, the, the process just lays itself out and you're, you become a slave to it. And now we're going to ride AI until what?"}
{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":1045.69,"end":1176.65,"speaker":"Paul Kingsnorth","text":"Like what? Well, that's the thing, isn't it? It was so interesting. You saw that thing that happened maybe six months or a year ago when all these guys in Silicon Valley came out with a call for a moratorium on AI development, right? And they were pretty high level people. They were the people who were developing this thing. And you knew as soon as they did that, that that was not going to happen, right? These are the people developing this stuff. They are saying, this is dangerous, we need to take a step back. And you already knew that wasn't going to happen because as you say, the cat's out of the bag now and then, okay, we can stop it, but the Chinese won't, etc. So it's an arms race. There was a fascinating piece in the New York Times, and I can't remember who wrote it. I quoted it in one of my essays. And the journalist just went and spoke to a lot of these people who were concerned about AI development in Silicon Valley. He spoke to the developers who'd signed this moratorium and he said, if you're Concerned about this. Why are you still. Why have you been developing these things at all? Right? And they all gave different sort of vague answers. And one of them said something fascinating. They said, he, he. He said, he said when he listened to them all, he would sum up what they were saying as. They were scared about what's happening, but they felt like they had a responsibility to usher this new form of intelligence into the world, right? To usher this new form of intelligence into the world, right? So he literally summoning a new intelligence into the world through their machines. This is a New York Times journalist, right? He just spoken to these people and he's trying to sum up what they say. So you get the impression that the people developing this stuff don't exactly know what's happening either. Right there. That's why there's no, there's no conspiracy theory required. You don't need six evil geniuses in a room with a plan. They haven't got a plan. They're developing it. They, they can feel that there's something behind it that they're ushering into the world, but they don't even know what that is. But they feel like they have to do it. It's like. It's almost like they're. They're addicted. It's a very strange, very strange thing to, to hear people. Arg. To hear people who are making the tech itself say that they're scared of it. They don't really know why they're doing it. They think we should stop, but they can't stop. And they're ushering in a new form of intelligence. And you think, well, hang on a minute. This is, this is a very, very strange situation."}
{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":1177.21,"end":1219.75,"speaker":"Jonathan Pageau","text":"So one, one of the ideas that I had as well is that if you think about the revolt against heaven, so you think about it like a structure. And you see that structure in Hesiod's cosmogony, right? Theogony, where you see the gods castrate the father, and then because of that, they have to create a tyranny because you know your own children are now going to come and get you because you killed your father. And then you have this back and forth where on the one hand, the one who does the castrating first has to tyrannize the people below. Like Stalin. That's what happened in the Soviet Union, right? It's like a bunch of, we killed the Tsar, we create a revolution. At some point, somebody takes control of it and then kills everybody that participated in the revolution."}
{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":1219.75,"end":1220.67,"speaker":"Paul Kingsnorth","text":"That's usually how it works."}
{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":1220.67,"end":1274.52,"speaker":"Jonathan Pageau","text":"Yes. Just to like clamp down, right? So you have this problem, but it seems like the revolutionary thinking itself where we think that we have to take from heaven, right? This Promethean gesture that we have to take from heaven for ourselves, that we're owed this, that we take it. The sense that I have in this is that secretly hidden in that process is the secret knowledge that if I've done it, I will be supplanted. And therefore there's almost like a weird, like unconscious desire to be supplanted. And we are, we're actually. People unconsciously are creating the thing that will supplant them. They know even that they're doing it. But it's almost like this is the process. This is what we did. We took from above and we lifted ourselves up to be the gods. And now that's going to happen to us."}
{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":1275.4,"end":1333.03,"speaker":"Paul Kingsnorth","text":"And sometimes consciously, that's the thing you hear from people as well, you know, this is a thing you hear from philosophers of technology. Some of them will openly say, yes, we are creating the species that's going to supplant us. And they'll use the argument from evolution. They'll say, well, this is how evolution works, right? New species evolve. So we're just helping the new species to evolve and we hope it will be kind to us when it evolves. And I think that, I think that the gamble is that if we can create these new things, this new mind, this kind of Asimov style overmind, then we can hitch a ride on it. This will allow us to become immortals. We'll put the chips in our brains, we can replace our bodies with silicon. We can upload our minds, all of this stuff. So yes, we will create a new species, but at the same time we will somehow, you know, we'll merge with it. This is the Ray Kurzweil Kurzweil Singularity, right? We merge with the silicon new species, we become part of it. We, we move to our ultimate destiny. So it's a deeply religious narrative. Yeah, it really is exactly that. Yeah."}
{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":1333.03,"end":1338.71,"speaker":"Jonathan Pageau","text":"And it's been there since the beginning. I don't know if you were. I was a science fiction fan when I was younger."}
{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":1339.11,"end":1340.31,"speaker":"Paul Kingsnorth","text":"Yeah, me too. Yeah."}
{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":1340.72,"end":1376.61,"speaker":"Jonathan Pageau","text":"And the, the first Star Trek movie, that's what basically it was about, right? It's like they send this, they send this technology out into space and then it becomes conscious. Who cares what the reason, the way it becomes conscious. But now it wants to return and merge with its maker. Like it's a, it's a, it's a theological It's a form of. Of. Like a weird form of. Of theosis, kind of inverted form of theosis. And that is possibly. Yeah, that's. That might be the fantasy. It might be a deformation of theosis that we're looking at, like we're going to create this God and then we'll murder."}
{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":1376.61,"end":1465.7,"speaker":"Paul Kingsnorth","text":"Yeah, it is that, isn't it? And it's also that, you know, if we want to become gods, which I think we do, I think our ultimate aim is to become gods. And again, this is. This is the story of the snake in the garden, right? The snake says, you don't need to follow God's will. You can follow your own will and you can become gods. And he literally says that, right? You can become like gods knowing good and evil. So don't bother with God. He's just trying to keep you from your. For your. For your own power. So become like God. So it's the ultimate dream. If we want to become like God. What does that mean? What does God do? Well, God creates. That's what God does. So if we want to become God, we have to create. So we have to create life. So again, there's something almost subconscious there going on that we have to create new life in order to actually be God's if we're going to really cement our dominance of the planet and our coming dominance of the universe. Because we're going to colonize that as well. Because that's another aspect of it, right? We end up colonizing the whole of creation. This is all part of the same narrative. We're going out into the stars, we're going to terraform the planets. So in order to become like gods, we have to create. We have to create worlds, which is what we're going to do when we terraform Mars. That's what Elon Musk wants to do. And we have to create new life. So here we are openly trying to do it, but at the same time, we have this kind of terrifying sense that the life we're creating isn't under our control. You know, it's. It's already looking like it's going to supplant us, so. Because funnily enough, we're not very good at being gods. You know, we're good at creating, but we don't even really know how. What we're doing or where it's going to go. Turns out that being God is quite complicated."}
{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":1466.1,"end":1468.54,"speaker":"Jonathan Pageau","text":"Yeah, it's complicated."}
{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":1468.54,"end":1468.98,"speaker":"Paul Kingsnorth","text":"Yeah."}
{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":1470.1,"end":1527.62,"speaker":"Jonathan Pageau","text":"The fact that we listen to the snake, the fact that we, you know, because ultimately our destiny is to become God. Like that is what God wants for us. But not through our own self willing. Right. Not through this taking, but rather through obviously through submission to the highest principle, to God himself and also self emptying. That's the image of, that's what Christ comes to reveal to us. But then because we did it by this grabbing, by this grasping, by this taking. Yeah, it's interesting because you know, you ask, because I've asked some of the people that are, that if they have ideas about where AI is going to go, you know, why is it because we do create beings. Like we have children. That's what, you know, we actually. But then they, sometimes they'll talk about it like this is our child, that we are, that we're, that we're creating. But it's different. Making and giving birth is not, not the same, I guess."}
{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":1527.62,"end":1548.48,"speaker":"Paul Kingsnorth","text":"No, because. Because what would you know if you have a child? You, you, I mean, you're not really in control. Right. You have the moment of creation and then nothing else is really up to you. You have to bring the child up. You do. But the being that you've created is not in one sense it's created by you, but it's part of the same species as you. Yeah. What we're doing now is we're trying to create a new, whole new order of beings."}
{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":1548.48,"end":1548.6,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":1548.6,"end":1549.16,"speaker":"Paul Kingsnorth","text":"A whole new space."}
{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":1549.16,"end":1552.08,"speaker":"Jonathan Pageau","text":"So it is like God, because God creates beings that are not."}
{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":1552.4,"end":1553.36,"speaker":"Paul Kingsnorth","text":"Yeah, exactly."}
{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":1553.36,"end":1557.64,"speaker":"Jonathan Pageau","text":"Giving birth to children is continuation of your own nature. Now it's like we want to create."}
{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":1557.64,"end":1653.78,"speaker":"Paul Kingsnorth","text":"Something and it's something you're given. You know, you're given this ability to create, create to replace yourself, to create new life. But it's new life in the line that's already been created. So. And then when I think about what you were just saying about the difference between the way that we're to become godlike as Christians, it's the difference between aligning your will with that of God. Like you say, there's the self emptying aspect, the destruction of the passions, emptying of the self, destruction of the will. Align your will with God's will and that's how you become godlike. Whereas what we're doing is we're saying now we don't want to do any of that. We don't want to do the self emptying. We're not doing any, we're not doing any asceticism, not aligning our will with anyone's. We're going to align the world's will with ours. And since we don't believe in God. That's not a problem anymore. We just have nature, and nature is just fungible and malleable. We can take that and we can use that to our own advantage because we've got the tech to do that now. So we take nature, which is just a collection of dead matter. There's nothing sacred about it, and we use that for our own ends. And then we create a new species, we create new life, and then we fulfill our destiny, which is to colonize the universe and become godlike. So it's a, it's a, it's a, it's a religious story. It's a theological story. You know, it's. And it's also, it's just foreshadowed in so many creation myths. It's obviously, it's Genesis, but it's also stealing fire from the gods. It's, you know, there are so many stories in which humans just. Their pride overtakes them. They try to become gods and then they, they fall burning from the heavens. And it's such an old story. Such an old story. It's like we're going to get it right this time. This time we're going to win. It's going to be different because it's."}
{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":1653.78,"end":1663.62,"speaker":"Jonathan Pageau","text":"Not like we, it's not like we've totally forgotten all those other stories. We, you know, we, we completely know the plan. Like, we've forgotten all our myths and now we think that we're going to do it this time because, yeah, we."}
{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":1663.62,"end":1673.86,"speaker":"Paul Kingsnorth","text":"Don'T believe in myths anymore because we've moved beyond myth and religion. Right. We're all Richard Dawkins now. We've all moved beyond that. So we know that was just stories and doesn't apply to us because we've got, we've got the Internet. So it's going to be different."}
{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":1674.18,"end":1679.62,"speaker":"Jonathan Pageau","text":"Although, as everybody knows now, Richard Dawkins has officially said that he is a cultural Christian."}
{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":1679.62,"end":1690.8,"speaker":"Paul Kingsnorth","text":"Oh, he's, he's moving rapidly towards his deathbed conversion. Well, it's weird. You can see it. You can see it. It's coming. It's coming. He's on the way."}
{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":1691.36,"end":1748.98,"speaker":"Jonathan Pageau","text":"All right, so I have a, I actually have a very, I have a tough question for you. Like, I don't. Maybe it's not a tough question. You'll see. And so, you know, before, before you converge, it, you were, you were obviously quite involved in, in the environmental movement. You, you, you had dedicated a large part of your life to, to that. And, you know, I would say I definitely believe in the principle of humans. Tending properly to the creation. But I also see that at least modern environmentalism, the way it's set up now, that it seems to be somehow wedged into globalism somehow like that there seems to be some relationship between the desire to set up some type of one government or a global system and the modern. At least the way the environmental narrative is set up. And so I don't know if you've thought about that, if you have thoughts about that relationship."}
{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":1749.06,"end":1988.4,"speaker":"Paul Kingsnorth","text":"Yeah, yeah, no, I have a lot. I've written about that. Fair bit. So I mean, the way to see this is environmentalism. It's a little bit like socialism or something like that. It's been swallowed by the machine. That's really what's happened. So I mean, you could look at the trajectory of the left, for example, say, you know, a movement which at least originally, say where I come from in Britain had a strong working class contingent. Say take something like the Labor Party, for example, or the labor movement comes out of the working classes, exists to help the poor, exists to get working people represented where they weren't represented. Yeah. 50 years later it's Tony Blair, you know, and, and he's. And he's jetting around the world talking about globalization. And the labor movement has been entirely swallowed by globalization. It's been. And as you say, by, by the, the kind of global machine which points you towards a kind of technocratic global state. Effectively, that's where it's going. And lots of old socialists have been complaining about that for a long time. Right. And quite rightly so. There was a huge controversy in Britain over Tony Blair because he was very obviously a kind of cuckoo in the nest of the Labor Party. And so the left's gone in that direction and the Green movement has been swallowed by it as well. And that's what's happened. If you look at the origins of the Green movement, they're fairly small C Conservative, the likes of EF Schumacher or Leopold Core or Teddy Goldsmith or a lot of the people who came from Britain, they were kind of traditionalists, really, these people. It was very much about conservation. Conservation of nature fits with conservation of culture. It's about, it is about stewardship, it is about tending. It's also about respecting the rest of life. That was the kind of the Green movement I grew up in. And you know, it was always, it was always leftist and so was I when I was young anyway. But it was also had a sense of a kind of small scale localism about it. The Green environmentalism works when it's localist really? Yeah. And what's happened is that the Greens decided, or at least the leadership of the Greens decided lots of people. Environmentalism is a very broad church, but the kind of mainstream commentators of the Greens decided that localism wasn't going to save the planet. And we had to go all in on effectively technocracy. And what we've got is there's an essay about this in the book, actually, what I, what I would call machine environmentalism, in which we say that the way to save the planet, which is defined now almost entirely as cutting carbon emissions, that's all they're concerned about, as if there was nothing else to talk about. And that is an issue. Right, and you do need to do that because climate change is real, but the way that we're supposed to do it is through, yeah, global agreements, probably global governance, certainly intense technologies, say, artificial food, the destruction of small scale farming, giant wind farms all over the mountains, et cetera. So the green movement that used to say that the way out of the environmental problem is localization, small scale living, a form of asceticism, really, community roots in place, et cetera, that's effectively been killed by a movement which says that the way forward is, is, is high tech machine globalization and if we don't go down that road, then the planet's going to die. And so that's really, that's, that's my analysis of it and I was always part of the old small scale, slightly romantic Luddite, you know, just really, just saying, look, the actual problem is the machine. Yeah, the actual problem is the machine. So you're going to try and live outside that if you want to live ecologically. And there's still a lot of people who do that. But the green movement that we see in the newspapers and that we see at Davos and that we see in the, the, the, the so called thought leaders of it is entirely machine shaped at this point. Yeah, And I think that's a tragedy because I think that the, the green movement always came into being to, to resist that. Right, to resist the machine. And it's been almost entirely swallowed by it to such a degree that people are now saying, well, you know, screw the Greens. So I want to drive my car around and eat as much beef as possible. So it's like almost as if, if you don't like environmentalists, the way to deal with it is to, you know, poison nature to make a point. And that's a, that's a tragedy as well. So what's happened is, as well is it's been swallowed by the culture war now, right?"}
{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":1988.4,"end":1988.72,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":1988.72,"end":2014.14,"speaker":"Paul Kingsnorth","text":"So a bunch of people on the right who say, well I hate the Greens because they're socialists, so screw it all, I don't believe in climate change. And then you got a people on the left, people on the left who will say, well we have to save the planet from all these fascists, so let's, let's bring as many new laws and, and, and, and high tech George in as possible. So it's, it's yet another thing that's been swallowed by the, by the culture war that's eating this eating society, I think."}
{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":2014.63,"end":2068.32,"speaker":"Jonathan Pageau","text":"Yeah, it's been, it's been fascinating to watch locally where we are to notice a hostility against local farming, like an open hostility against, for example, they passed several laws recently where you're not allowed to have like, you're not allowed to grow stuff at home, like you're not allowed to have even just chickens or whatever, like in different, different places in Quebec. They, they're really trying to clamp down on people doing, on their own. And even, even some organic farms have been closed down for reasons that are very suspicious that are nearby where we are. And you're, these are the same people, like the same governments that are touting how we need to save the environment and everything, but at the same time. But then they're opening. The biggest bug factory in the world is going to be in Ontario here. I think it's already open. And they're making insects, they're making protein."}
{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":2068.64,"end":2154.09,"speaker":"Paul Kingsnorth","text":"Yeah, of course. And that's a great example of exactly what's happening. So you know, an actual, an actual, if you wanted this horrible word, sustainable, that used to be a good radical word and has now been completely ruined. If you wanted a society that was actually sustainable, right, which meant it could be sustained and it was you, you would have to be culturally sustainable, ecologically sustainable, spiritually sustainable and all of those things would go together. And so you would have to, you know, you would have lots and lots of people managing small farms. You would have lots of people actually involved in their culture. People would want to protect the natural, natural world because they actually knew what it was, right. Because they went outside and they knew what grew in the hedgerows and they actually had connection with nature. That's what, that's what an ecological society looks like. What we've got instead is this top down system in which everybody's sitting inside looking at screens and eating bugs and living in the pot and all the rest of it. And this is this is allegedly sustainability, but it's not. It's just been the. The entire thing has been hijacked. Yeah. And it's you. Here's the other thing as well. You can't have an ecologically sustainable society that isn't culturally and echo and spiritually sustainable as well. It has to be sustained, sustaining to our spirit, sustaining to our families, sustaining to our cultures and our communities and our towns. If it's not those things, then all it is is the state and the corporations handing down a ton of things that you have to do and you have to eat and you have to cut down and it just becomes a sort of green brave new world, you know, Brave new world with wind farms is what you end up with. That's great."}
{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":2154.65,"end":2166.37,"speaker":"Jonathan Pageau","text":"And so you finished the essays on the machine. One of the questions I've had. And so now you've been writing this. How many. You've been doing it for three years. How long did."}
{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":2166.37,"end":2175.85,"speaker":"Paul Kingsnorth","text":"Well, yeah, I mean, the essays themselves took over two years and a bit, I think, and then I've had to edit them down and turn them into a book. So it's been kind of in my head for a long time."}
{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":2176.49,"end":2192.27,"speaker":"Jonathan Pageau","text":"And so my question is, as this is. Been happening, like you're working on these essays, you're, you know, you're moving away from. From fiction and you, you know, converted Christianity. All these things happened. Has it changed? Like, have you noticed that you are per."}
{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":2192.35,"end":2192.91,"speaker":"Paul Kingsnorth","text":"Or your."}
{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":2192.99,"end":2202.27,"speaker":"Jonathan Pageau","text":"The way you think about. About story and about literature, about fiction? Do you feel like it's changed in the past few years as you've been working on this other thing?"}
{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":2203.63,"end":2339.12,"speaker":"Paul Kingsnorth","text":"It has changed and it's changed. It's changed because I. Well, it's really changed because I've become a Christian. It changed since I was baptized because. Really? Yeah, I thought about this so much. I mean, I was baptized in the River Shannon in January, so it was very cold. And we sort of. My priest just. He's a. He's a. He's a force of nature. And he said, we're going to baptize you in the river. We're going to do it properly. Because he said, if you ever go to Mount Athos, they're going to ask you if you were baptized properly. So we're going to do it properly. So just. He said, right, we're doing it in the river. So he took me out to the River Shannon on this freezing, frosty day. And he was standing there pushing my head under the water and trying. He was halfway up, up to his waist as well, so he. He had trouble saying in the name of the. So we were both kind of almost on the verge of a heart attack, and then we both came out and, you know, it was. It's. It. It's such a kind of. You know, at the time I thought, well, this is a kind of ceremony. It's a symbolic ceremony, right? I know I'm becoming a Christian here, but this is a kind of. It's. It's a piece of symbolism, and it is a piece of symbolism, but it actually changes you, right? It. It changes the way you see. It physically changes you in some way that you can't put your finger on. And what's happened to me is I haven't been able to see the world in the same way, and I can't explain that. I can't explain that. It's not that I've become a Christian and I've decided I have to believe in some things, and so now I believe in them, and I didn't before. It's not a question of that. It's like I. Because of this, I've been initiated into this whole cosmological vision of the universe that you talk about so much. And. And that. That kind of symbolism, this whole pattern that you're always trying to lay out is inside you, you know, and it gets introduced to you through baptism. And you come out of that and you think, my God, the world looks different. You're looking out through the same eyes at a different world. So I couldn't write the sort of novels I used to write because I'm not the same person anymore. I see the world differently. So for me, the question is, now that I'm like this, and this is a process, obviously, I'm just at the beginning of it. What kind of stories would I write if I were to write fiction? I don't want to write, you know, Christian fiction in some sort of horrible, didactic way. Nobody wants to read Christian fiction, including most Christians. That's right."}
{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":2339.12,"end":2339.8,"speaker":"Jonathan Pageau","text":"Exactly."}
{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":2340.84,"end":2375.6,"speaker":"Paul Kingsnorth","text":"Nobody wants to do that. But, you know, the. The stories have to be different in some way because they reflect a different universe. And I don't really know what that looks like yet, but it's going to look like something different. But I want to find out what it looks like. I do want to try and do something, but I feel like I'm still in a kind of state of transition, you know, where I have to work out how to write a bit differently now in some way. And it doesn't even mean that I'd write about Anything that was even necessarily obviously Christian or religious. But whatever I did, it would feel it would reflect a different world, different universe in some way."}
{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":2376.8,"end":2381.92,"speaker":"Jonathan Pageau","text":"And so, and so have you dabbled? Like, have you."}
{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":2381.92,"end":2383.28,"speaker":"Paul Kingsnorth","text":"Have you? Have you? Have you."}
{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":2384.08,"end":2384.88,"speaker":"Jonathan Pageau","text":"This is the question."}
{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":2385.12,"end":2463.91,"speaker":"Paul Kingsnorth","text":"This is so. It's interesting. So. So we. We last met in Dublin, didn't we, last year, doing an event together. And you started harassing me about how I had to write fiction. And that was actually very useful. I thought, this is. I'm happy. No, it was good because you. You were just telling me I had to write stories. And you were quite right because the way I. The way I seem to work, this isn't really a choice. It's. I. As I said earlier, I think I bounced between my left brain and my right brain. So I've just spent two or three years on these essays, which I just had to write because it was all bouncing around in my head and I had to try and understand what was going on. But now my left brain is exhausted and I need some creativity and I need some soul. And so I've been, you know, I've been writing these stories on. On my substack called. Which I've called Lives of the Wild Saints, which I've quite enjoyed. And I've taken. I'm trying to tell stories of ascetics who lived in the wilderness. And I'm taking the. Taking the original sources. And I'm. I'm not exactly fictionalizing them. I'm trying to stay true to the story, but I'm writing them as stories, which I've really enjoyed doing. And hopefully I'm going to bring that out as a book as well, actually. So I'm kind of in. In on the source of that. But that feels like a sort of bridge between. Between what I was doing before and what I might do next. So I've had a few ideas. I've had a few ideas for novels. You gave me an intrigu idea about writing a novel about the Desert Fathers, actually, which I do. Yeah."}
{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":2464.23,"end":2465.79,"speaker":"Jonathan Pageau","text":"I still dream that that'll happen."}
{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":2465.79,"end":2482.63,"speaker":"Paul Kingsnorth","text":"That was a good idea. Your dream come true. I thought about that. I've thought about that a lot, actually, and that's. That's. I would really quite like to do that. It's. Again, it's a question. And when you're writing fiction, it's always a question of the how. It's always about the technique. You can have the idea, but it's. It's always the how that's going to make it. Yeah."}
{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":2482.63,"end":2503.98,"speaker":"Jonathan Pageau","text":"Because the Technique has been so important in your writing. Like, you've always, you've always the, the style, even the grammar, everything about your writing is related to the purpose of what it is you're doing. And so it's like, that's why I, that's why I kind of dream about what a Paul King's north book on the Desert Fathers would be like, because I know there would be some integration like that."}
{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":2503.98,"end":2564.11,"speaker":"Paul Kingsnorth","text":"It would be fun. It would be interesting. What I found with fiction. And again, it wasn't even, it wasn't a. It wasn't an idea that I sat down with. It's the, the form is so connected to the content that you can't separate the two things out. And I discovered that I was writing the Wake, which was my novel set during the Norman Conquest, which is famously or infamously written in its own version of Old English, which is. Which was a mad idea that somehow worked. But I did it because I just. It had to be done that way because this is. It had. The language had to reflect the way people would have spoken. And when you do that, you find that it then creates an entirely different landscape and that you couldn't have created in modern English. And so all of my books have been like that. So the language, it's, it's. Again, it's a. You can come back to this question of AI and the machine. The language we speak is such an, an unthinking reflection of the world that we live in. It's so the, the, the. There's been a lot of controversy around, you know, AI programs being hyper woke, for example."}
{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":2564.19,"end":2564.67,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":2564.91,"end":2590.28,"speaker":"Paul Kingsnorth","text":"You know, the language that they use because obviously an AI is created by a, a group of people. So whatever their politics or their culture is, which is probably completely. They didn't probably sit down to try and create a radically left wing AI program. It's just, that's just the way they think. So that's how it came out. And if a different bunch of people created it, it would have spoken different language. And the language we speak is a completely almost unconscious reflection of the way we see the world."}
{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":2591.56,"end":2600.41,"speaker":"Jonathan Pageau","text":"I'll be honest, though, I won't give the Gemini people the benefit of the doubt, because if you've used it, you know what it does is it actually takes your prompt."}
{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":2601.45,"end":2603.25,"speaker":"Paul Kingsnorth","text":"I've seen these pictures. I've seen the pictures."}
{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":2603.25,"end":2610.81,"speaker":"Jonathan Pageau","text":"Reformulates it with dei and then it gives you the answer. And you can. Sometimes you could catch the reformulation before it would spot out."}
{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":2610.81,"end":2731.06,"speaker":"Paul Kingsnorth","text":"No, no, it wouldn't surprise me in certain Cases. I've seen all the pictures of the African kings of medieval England, for example. Yeah, but again, I mean, that's just a really obvious, clumsy manifestation of, of the reflection of the. The way that we see the world, the way that we speak. And once you start paying attention to the language you're using, rather than just doing it unconsciously, which we mostly do, you go, I can see how I'm. Every time I open my mouth, I'm creating the world. Right. I mean, isn't it interesting that in the beginning there was the word, Right? So we have this translation of logos, which is word, and Christ is literally a spoken word and he speaks creation. So right at the beginning of the Bible again, or certainly the beginning of the Gospels, Gospel of John, you've got this fascinating notion that in the beginning was the word. So there's a way that you speak reality into existence every time you open your mouth. So that's always reflected in fiction. You can't use language unconsciously when you're writing fiction because the way that all your characters speak and the way that you represent the world is going to create the world. Yeah. So, you know, that's, that's, that's why it would be interesting to try and recreate the world of the desert fathers. Just to be. It's such an interesting thing to do, to put yourself into the head of. I mean, I'm fascinated by history. I'm a history nerd. So I love to love the idea of, you know, what. What would it actually have been like to be in that desert at that time? Because these people were so different to us. Right. I mean, they're human, but the way they see the world and the world they've grown up in is so alien. It was like that with, with the Norman Conquest. And you try to. Try to imagine yourself into that world and it just. Yeah, it's a fascinating process. I mean, it really kind of. I mean, I couldn't spell properly for about a year after writing the wake because I was just, I was just in that world. I couldn't, I couldn't write in modern English. It took me quite a long time to get back into the, into the boredom of modern, modern English language."}
{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":2731.06,"end":2796.08,"speaker":"Jonathan Pageau","text":"So that is, that, That's a, that's hilarious. Yeah. Well, I think that also artists in general, we are more aware of the sacramental power of, of language and in some ways, like the magic that is in language because we see it. Right. Like you said, you. First of all, if you're writing a story, you have to create a coherent world for the story to exist in. And that happens at different levels. But then also you're affecting the world as you put it out there. You know, so many stories, you know, if you think of, for example, if you think of 1984 and Brave New World, for example, you know, are they on the, are they just simple prophecies? Are they self fulfilling prophecies? To what extent do these fictional or even the science fiction of the, you know, like late 19th century and, and to what extent does, do these stories actually participate in the predicted or participate in the process by which it comes about? It's, it's not clear. There's a, there's an ambiguity in that. In that, in that."}
{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":2796.08,"end":2829.25,"speaker":"Paul Kingsnorth","text":"Yeah, I've always been so fascinated by that. I've always been so fascinated by that question. It's like, it's like the people who are creating the technology we use now are looking at some of these things as instruction manuals. And it is a question, isn't it, how much of this is, is a prophecy? How much of it is created by people who read it and then integrate it consciously or subconsciously into themselves and then create the thing that they've created? I feel like sometimes like people watch, you know, Mark Zuckerberg watched the Matrix in 1999 and then. But he thought the agents were the good guys."}
{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":2829.25,"end":2829.85,"speaker":"Jonathan Pageau","text":"That's right."}
{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":2830.81,"end":2861.82,"speaker":"Paul Kingsnorth","text":"So he then created this lovely metaverse which luckily isn't proven very, very fashionable. But, but yeah, it's, it's, it's like there's a, there's a, a back and forth all the time between the science fiction and the fact and which came first? And are they actually integrated? And is that, are those novels? The really interesting question is, are those novels some kind of unconscious picture, some kind of unconscious story of something that's unraveling, something that's unfurling that people can sense."}
{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":2862.54,"end":2927.93,"speaker":"Jonathan Pageau","text":"And yeah, I think it's akin to prophecy. It's not prophecy per se, it's not direct, it's not like revelation from God. But it, there's something of prophecy in it where we're, we're perceiving something that doesn't have form yet and that beings that, that, that let's say embody meaning and formulate meaning. It's almost like a tuning fork that catches a vibration. Yeah, I think before, before it's fully kind of embodied in the world, I think, I think that's it. And in some ways it doesn't matter which side. Like it doesn't, it doesn't matter which side you're on. If you portray it as the bad guys or the good guys, it doesn't matter. It's just the actual disembodiment of it. So you could. You could be James Cameron and think, I'm writing this to stop. To stop the AI, you know, machine. But that's not actually what's happening. You're. You're in. In a weird way, participating in. It's in its unfolding and it's an unraveling. And then, you know. But you come up with Skynet, but then by the time we have Starlink, it's like, wait, what's the difference between Skynet and Starlink? Is that exactly just the exact same. That same word? Like, isn't that the same name?"}
{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":2928.89,"end":2977.63,"speaker":"Paul Kingsnorth","text":"Yeah, no, it's exactly that. It's the participation in it. And it's. What's interesting is that you can go right back to the beginning of the Industrial Revolution. You can see these novels starting, written as soon as the dark, satanic mills start up, you know, and. And it's interesting that they're called satanic in Blake's poem. As soon as you get these kind of infernal industrial monstrosities beginning across the landscape, you start to get novels like Frankenstein. And then you start to get novels like we and you. You know, then you're into the 20th century, and it's like the novels are always a few paces ahead of what's happening, but like you say, they're in. They can tune into what's going to unfurl. And it doesn't matter how many warnings you issue. You can issue as many warnings as you like. It makes absolutely no difference to the process of the thing. You know, nobody ever checked. Nobody ever stops. People don't read the novel and say, my God, yes, we must change direction. That. No, it never happens."}
{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":2977.79,"end":3004.07,"speaker":"Jonathan Pageau","text":"No, because like I said, it doesn't matter which how you portray it. You just have to portray it, whether you're against or for it. It doesn't matter in some ways. And it's not like we can. It's not to blame the artist. There's no blame to put. Because it's not a. It's something that's happening. It's not like. I'm not saying we don't. We do participate in it, but it's not like you could stop it by writing it like a complete story, you know, in some ways, you're just kind of riding this wave."}
{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":3005.19,"end":3030.15,"speaker":"Paul Kingsnorth","text":"That's all you can do. As a writer, I've discovered in my life from being a young man who thought he could change the whole world through his writing and then being an older man who realizes there's no chance of that at all. If you're lucky, a few people might read you and it might be helpful and that's all you can do and that's all right. But, yeah, it doesn't matter. In fact, it's almost a case to be made that the more of these novels are written, the more they accelerate the process, you know, because it just normalizes it. It normalizes the kind of horror show."}
{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":3030.31,"end":3051.44,"speaker":"Jonathan Pageau","text":"It's interesting, I think, that there are, like, there are some novels that in some ways give a fuller picture. So maybe that's also the way to do it. So if you think of Tolkien, for example, you know, I actually, I've confessed this before. I actually didn't enjoy reading Tolkien that much. Like, I love the story. The reading of it was difficult for me."}
{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":3051.92,"end":3058.6,"speaker":"Paul Kingsnorth","text":"Yeah, it's. It's whisper it, but he's not a great writer, actually. Yeah, I mean, he's a fantastic creator."}
{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":3058.6,"end":3059.16,"speaker":"Jonathan Pageau","text":"Yeah, exactly."}
{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":3059.16,"end":3071.28,"speaker":"Paul Kingsnorth","text":"He's a wonderful creator. He's a wonderful world builder. You know, so much. He's got so much investment in the. In the kind of genius of the world he's created. But on an actual technical level, his writing is just. Yeah."}
{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":3071.36,"end":3072.56,"speaker":"Jonathan Pageau","text":"And it's laborious to."}
{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":3072.8,"end":3093.74,"speaker":"Paul Kingsnorth","text":"And it needs editing. Someone needs to strip all of the songs sung by hobbits that go on for three PA is out of the. You're making enemies on my channel. I know I'm gonna be. I'm gonna be cancelled by lots of people. But I love Tolkien. I love Tolkien. He's a genius. But I just don't think he's on. In a technical level. He could probably just do the bit of trimming, you know, But I think."}
{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":3093.74,"end":3157.85,"speaker":"Jonathan Pageau","text":"What I was going to say is that. Because in some ways he gives this full epic vision, you know, he isn't. He is portraying the. The vision of what's happening. Like, you know, he's. He is kind of seeing this kind of technocratic world coming to us, but he's also bringing us. He's also in some ways bringing us out of it. He's showing us the way that it will resolve itself. And so. But that might be. That might actually have just to do with how much insight you can. You can muster. And so, for example, like the Matrix guys, you know, you could tell, like, they're. They were. They didn't know what they were doing, I'm sorry to tell you. Like, they just really didn't know what they were doing. They were just catching something. And you can tell because they just put all these. They just put all these names in there and there's no meaning. Like, so a lot of, like the mythological references, it's just references for references. But they caught something. Like, they definitely caught something. But then how do they resolve it? Who do you remember in the third movie? Like, Neo gets merged with the one with the Source or something. But what does that mean? Who knows?"}
{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":3157.85,"end":3164.21,"speaker":"Paul Kingsnorth","text":"Well, he's kind of. He's kind of techno Jesus, isn't he? I mean, he's kind of crucified and then resurrected. I can't quite remember. Something like that."}
{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":3164.32,"end":3216.21,"speaker":"Jonathan Pageau","text":"Yeah, he gets joined with the Source, right? And then he. Then he becomes like. Maybe he becomes like a hidden God or something. But it's like. But it's. It wasn't particularly insightful. Like, it wasn't as insightful as. As, you know, as. As Frodo, like, you know, hesitating to destroy the Ring and, and his dark shadow has to basically do it for the wrong reasons. Like, that's a really. That's such an insightful. It's such an insightful and almost disturbing way to end. Like, the, the, the. The epic, it has. It, it hooks in you. Right. It kind of hurts. But anyways, so, so, so I, I do think that we can change. Like, what I'm trying to say is that I think that as artists, we can participate fully, like, as fully as possible in giving people also a glimmer of what's possible beyond the, the monster."}
{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":3216.29,"end":3227.39,"speaker":"Paul Kingsnorth","text":"Yeah, I think so. Yeah. Because what you're, what you're doing is. I mean, Tolkien's a great example. Again, you put, as you say, you're painting a full picture. You're trying to paint a full picture of what all the forces are."}
{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":3227.47,"end":3227.95,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":3227.95,"end":3352.89,"speaker":"Paul Kingsnorth","text":"So. And, and, and you have to do that in a way that is not. That is really true to what nature is. So, again, the end of the Lord of the Rings where they go back to the Shire and actually the Shire has been scoured, you know, because everybody wants the happy ending. And they made that. They did that in the film. Of course, in the film, you go back and everything's nice, which is a kind of a nicer ending because they've sorted it all out. But actually the reality is they go back to the Shire and the Shire is not the same anymore because after what's happened, nothing could be the same anymore. So that's not hopeless. But it does mean that what's happened has gone through the whole world. And so there's that kind of refusal to give a simple happy ending tied up in a bow, but at the same time, it's that kind of, you know, the, the what's happened with the ring can't be undone. Even though the ring's been destroyed. Yeah. You know, the world has been changed in some way, but you can, you know, you could clean up and you can move on, but there's a recognition of what human nature is and what your nature is. And the ring is just such a wonderful symbol. I mean, it's just. I think. I think I saw something recently that somebody had done online that they took all the references to various passages from Lord of the Rings where Frodo or Bilbo are effectively addicted to the ring, and they just replaced the word ring with the word iPhone. And it was really good. It was really good. That's. That's a bit obvious, but it's just that the, the, the understanding of. Of that kind of ability to be addicted to something that, you know, is killing you as well, is right at the heart of it. Yeah. So it's, it's such a. It's such a great. Like you said, it's a universal story, but it's a universal story that works because it focuses on really particular small things and ordinary people. And it's. It's so interesting that, you know, back in the 80s, I read the Lord of the Rings, and it's like it was just a fantasy book then, and now it's become this. This huge symbol of something much bigger. In the time that we're in, Tolkien has become so much bigger than he was when he was just a fantasy writer. Something, you know, because he put his finger on something a long time ago that's almost manifesting now."}
{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":3353.46,"end":3387.51,"speaker":"Jonathan Pageau","text":"Yeah. And there's, like, becoming more relevant and people. You know, as a fantasy, it's, It's. It's one of the stories that people live in quite a bit like they. In, In a way, they use it as their. That there's. As their lenses to look at the world. A lot of people see the world through Lord of the Rings, it seems. It seems that. And especially since the movies, it. It really did, you know. You know, for all the criticism we can level at the movies, they really created a kind of subconscious series of images that inhabit."}
{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":3388.31,"end":3388.79,"speaker":"Paul Kingsnorth","text":"Yeah."}
{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":3389.51,"end":3390.15,"speaker":"Jonathan Pageau","text":"Really strong."}
{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":3390.23,"end":3416.12,"speaker":"Paul Kingsnorth","text":"They were great. They were fantastic. Everybody wanted to be Aragorn, you know, of course, I wanted to be Aragorn when I was 16. So this, the films just Made it worse. They just made me realize I would never be Aragon. But I enjoyed. The fantasy was finally over. But they were. No, they were great. They were. They're timeless. Those, those films. It's. It's a great example of, I mean, the, the achievement actually, of taking those enormously long and complex books and boiling them down that way was very good."}
{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":3416.36,"end":3426.8,"speaker":"Jonathan Pageau","text":"And it's, that's another example, actually. It's similar example that you can see how artists sometimes they just. They like catch something. Because, I mean, what has Peter Jackson made after Lord of the Rings?"}
{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":3426.8,"end":3495.35,"speaker":"Paul Kingsnorth","text":"That's been. Yeah, well, did he make before? Yeah, no, it's very true. It's very true. I mean, I think that's. That's almost what we have to. It's the kind of best that we can hope for as, as creators that we know. We just keep doing our work and maybe we'll catch something. Maybe we'll. There'll be some zeitgeist that we're tapping into in a way that we. You could never consciously do it, you know, if you sat down and decided to do it, you. You would never be able to. But it's out there and if you, if you have your aerials out, you could touch it. So the question, I mean, for me, the question as a. As a writer, someone who's written novels, is where. What are the novelists going to do from now? Are there even going to be any novelists? I don't know. A novel's going to continue to be written to people, even read them. I don't know. But how a story is going to be told because we're, you know, we're obviously so obviously at the end of a kind of cultural cycle. Everything's so exhausted. Everything's being recycled, everything's boring, everything's political, everything's woke. And even when it's not woke, it's just got nothing to say. It feels like such a tired time in the culture. But something's got to change. Something's going to come. You know, something has to. Those kinds of periods always lead to some kind of renewal."}
{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":3495.35,"end":3495.87,"speaker":"Jonathan Pageau","text":"Oh, yeah."}
{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":3496.11,"end":3530.24,"speaker":"Paul Kingsnorth","text":"So there's going to have to be new forms of writing, new writers, and they'll be out there now, beavering away. You know, they'll. They'll be doing it. So the question is what it's, what form is it going to take? What are the stories going to look like? What. How are they going to move beyond what's been done and yet somehow remain kind of tied into the stream? I don't know the answers. But that's, you know, I'm desperate to see the, the new stories because I'm so bored. I'm so bored, you know, I'm so bored. It's terrible now. I mean, it's, you know, there's. It's such a lull in the culture almost, but it's. Yeah, yeah."}
{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":3530.24,"end":3551.2,"speaker":"Jonathan Pageau","text":"But it also means that there's a hunger at the same time, and almost like, I'm just tired of eating candy. People are just, they. They've been oversaturated with just bland culture and regurgitated over and over and over. And so I think people are just. Are just hungry for something beautiful."}
{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":3551.2,"end":3600.02,"speaker":"Paul Kingsnorth","text":"Yeah, it's exactly that. And the challenge is going to be tap. You tap back into the source, the eternal source that the stories come from. And as ever, you have to do that in a way that's going to make people look at things freshly. And that will happen. People will come and do that. Like I say, I'm sure they're out there now doing it. And for those of us who are kind of a bit seasoned, it's a harder question in a way, because we've already written books, right. So we're kind of stuck in a rut. But it's. How do we do this? I think this. In that, in that sense, it's quite an exciting time because I think the last 10 or 15 years have been a time of cultural decline. And like I say, it's just become so dull and it's getting to the point where something's going to explode. And that's interesting. You know, there's. There's stories. The stories will hopefully come. Come roaring out again. Yeah, it's just how we tell them. Yeah, yeah, yeah, yeah."}
{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":3600.02,"end":3603.26,"speaker":"Jonathan Pageau","text":"And so we have to keep our. How did you say, keep your aerials out?"}
{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":3603.26,"end":3630.43,"speaker":"Paul Kingsnorth","text":"Is that how you say? Yeah, it feels like that. It feels like you have. You've got to have an aerial out there. You've got to be paying attention to somehow, to the, to what's. To what's in the ether. And you can't almost can't do that consciously as you write. It will just come to you. But, you know, the times, the times, they are changing and all that, and they really are now very fast. It's impossible to predict what the world's going to look like in five years, you know, which, which in a way makes it a hard time to write, but it also makes it exciting."}
{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":3630.75,"end":3631.71,"speaker":"Jonathan Pageau","text":"Yeah, definitely."}
{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":3631.71,"end":3631.99,"speaker":"Paul Kingsnorth","text":"Yeah."}
{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":3631.99,"end":3691.6,"speaker":"Jonathan Pageau","text":"And in some ways, like you said, the, the, the. And the fact that the Old stories have been twisted and forgotten. And, you know, there's this. I always feel like we're in this moment. In Lord of the Rings, you kind of have this image, right. It's like there are these old stories that have been forgotten, you know, this old lineage that has been forgotten. It's still there. You know, Aragorn is there, but nobody knows. It's like, it's all. And this, this idea of reforging the sword or this idea of finding the treasure. Right. Because the treasure has been. Has just. It's there in a dusty box. Nobody knows it's there. And so there's something about that that's exciting now because we can. We can in some ways represent the stories in a manner that will once again be surprising and fresh to people because. Yeah, because they've been forgotten and because also people are hungry. And so it is a great. I mean, in some ways it is a great time, a great opportunity, but who's gonna. Who's gonna be able to. To catch it?"}
{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":3691.6,"end":3790.36,"speaker":"Paul Kingsnorth","text":"Yeah, well, it's kind of. It's like you. You've got to take that reforged sword and then you've got to slash your way through all of the. The cultural thickets that have become. Because all the crap. Yeah, because it's like you say, people have either forgotten the stories or all the stories have been taken and deliberately inverted. Right. By giant corporations, which I know you've done a lot of stuff on. And it's always impossible to, you know. You know that if Disney produces a version of a fairy tale, you know exactly what they're going to do. Right. It's going to be yada, yada. You can predict it without even bothering to watch it. But the. The alternative to that is not to. To go back and faithfully reproduce exactly what the Brothers Grimm did. You know, that's not an option either. Right. Because that's all been done, too. So. So how do you go back to the source of those stories and do something that is neither of those things? Yeah. And again, I think people are just. If these stories are playing on. On deep images and archetypes and things that are unconscious and things that are always real and forms, whatever we want to call them, which I think they are, then people always need them. They don't always need them in the same form, told in the same way, but they're not going to put up forever with boring corporate inversions of the stories making political points. You know, they actually want the real thing. Yeah. And as I say, it doesn't mean going back to the past. It means going back to the source and then, and then refreshing it like you say. It's like, it's like I've been writing a lot about holy worlds recently. It's like, you know, sometimes you'll go and visit a holy well and it's been neglected and it's clogged up and it's full of leaves and so what do you do? You clean it out and then the fresh water comes out again and then, you know, then, then, then you're onto something and then you can start drinking. It almost feels like we have to go back to the source and, and clean it out, you know, and let it, let the water come roaring out again and then see which direction the stream goes in."}
{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":3790.68,"end":3795.08,"speaker":"Jonathan Pageau","text":"Yeah, well, let's keep, let's keep trying."}
{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":3795.4,"end":3828.32,"speaker":"Paul Kingsnorth","text":"That's something to keep, keep you busy. So there's this. Yeah, yeah, we've both got our orders now. We've both got our orders. Yeah, there's a lot of interesting people out there and you know, you've spoken to plenty. I've met plenty more. I, I hear from people all the time who are writing, who have ideas, who are doing things. Like you say, there's a real hunger. You can feel it, it's bubbling up. So, so yeah, I hope that in 10 years time things are going to look really different. You know, this, there's, there's. Yeah, things are happening. I feel like we're on the verge of some sort of explosion. Hopefully a good one."}
{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":3828.89,"end":3856.16,"speaker":"Jonathan Pageau","text":"Yeah. Well, I really hope that you, that you're able to kind of that, that you move towards some fiction because I, I am excited of the idea of a, of a kind of diving into some aspect of the weird, you know, Christian tradition by, by Paul Kings North. I think it, it would be. For me, it'd be really exciting to, to, to read that. So I'm looking forward to seeing what you're gonna. Getting it pulled together at some point."}
{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":3856.48,"end":3870.16,"speaker":"Paul Kingsnorth","text":"Yeah, I haven't been able to get this desert father's idea out of my head since you mentioned it. So something, something's going on there. You've put that in there. So I'm gonna have to, I'm gonna have to dig into that is. Yeah, it's, it's intriguing. We'll see. We'll see what happens. That's fair."}
{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":3870.16,"end":3872.24,"speaker":"Jonathan Pageau","text":"Now that, now that you made it public, now you've got it."}
{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":3872.24,"end":3878.04,"speaker":"Paul Kingsnorth","text":"Well, I know I shouldn't have said anything now. So someone else will steal the idea and do it better. Which would also be fine."}
{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":3878.04,"end":3879.12,"speaker":"Jonathan Pageau","text":"Yeah. Which would be fine."}
{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":3879.12,"end":3879.6,"speaker":"Paul Kingsnorth","text":"Exactly."}
{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":3879.6,"end":3881.8,"speaker":"Jonathan Pageau","text":"All right. So, Paul, thank you so much for talking to me."}
{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":3881.8,"end":3884.55,"speaker":"Paul Kingsnorth","text":"It's always wonderful, and it's always a pleasure. It's great."}
{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":3884.71,"end":3889.19,"speaker":"Jonathan Pageau","text":"And can't wait to see also your book. How is the book going to be called the Machine? Do they already have a title?"}
{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":3889.35,"end":3898.07,"speaker":"Paul Kingsnorth","text":"The working title is against the Machine. Against the Machine. It's nice and stock, and it should be out sometime next year, 2025, I think, but no dates or anything yet."}
{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":3898.55,"end":3909.47,"speaker":"Jonathan Pageau","text":"All right. And so also for all of you watching, we're just recording this right after Pasca. So Christ is risen, everyone, and we'll talk to you soon."}
{"episode_id":"SW - #342 - 2024-06-01 - Paul Kingsnorth - Becoming Gods Without God","start":3909.47,"end":3910.79,"speaker":"Paul Kingsnorth","text":"Bye. Bye. Take care."}
