{"episode_id":"SW - #286 - 2023-05-16 - Music and Pattern (Royal Northern College of Music Q&A)","start":0.24,"end":73.05,"speaker":"Jonathan Pageau","text":"I think you can actually know the difference between someone who's had a true mystical experience and someone who's had a twisted mystical experience is that often the person who's had the twisted mystical experience comes back from that experience and wants to destroy the world. They're like, I experienced everything. I experienced, like, the mystical, ineffable root of being. And now nothing matters. Now all of this is trash. Like, the whole world is just Maya. Like the whole world is just illusion. And none of these things matter. All your religions, all your communities, all your things, they're all nothing. Right? You listen to people sometimes you'll hear exactly that tone. And to me it's like, well, I think you're on the wrong side of the bed. Because, like, if there is something ineffable behind phenomena, then it is the source of phenomena. So it should actually fill phenomena with this kind of unsaid, but not destroy it. Like, anyways, I tend to always keep that in mind when I listen to people who talk about that. This is Jonathan Pedro. Welcome to the symbolic world."}
{"episode_id":"SW - #286 - 2023-05-16 - Music and Pattern (Royal Northern College of Music Q&A)","start":82.57,"end":91.19,"speaker":"Unregistered: Interviewer","text":"Thank you so much for agreeing to do this. We absolutely appreciate it. And it's amazing that you're spending your time to talk with us."}
{"episode_id":"SW - #286 - 2023-05-16 - Music and Pattern (Royal Northern College of Music Q&A)","start":91.51,"end":92.23,"speaker":"Co-interviewer","text":"My pleasure."}
{"episode_id":"SW - #286 - 2023-05-16 - Music and Pattern (Royal Northern College of Music Q&A)","start":93.03,"end":128.22,"speaker":"Unregistered: Interviewer","text":"So we spoke with one of your colleagues the other week, John Vervaeke, and so he expressed that he holds you in very high regard, and he said to us, your thinking is delicious. So one of the things that I really appreciate about what you've brought to say, the public discourse, is this idea, this approach to religion and mythology is something that is symbolic as part of your symbolic world. I was wondering, why do you think that has been so effective as an approach to religion?"}
{"episode_id":"SW - #286 - 2023-05-16 - Music and Pattern (Royal Northern College of Music Q&A)","start":128.7,"end":350.52,"speaker":"Jonathan Pageau","text":"Well, I think one of the issues that people have dealt with, let's say, in the 19th, 20th century, is that because many religious groups have tried to defend their faith based on, like, say, scientific methods or accepting scientific presupposition. One of the. One of the things it did is that it in some ways made faith or religion arbitrary. It's like we hear a bunch of things that you have to believe. You know, so you believe in the material world and all these weird and all these scientific causalities being the only type of structure you can describe. And then on top of that, you add something like, so. So God came into the world and then died on a cross, and now he went to heaven. And you're. And if you believe. I mean, what are you talking about? This is absolutely ridiculous thing to say. If you. If you just take on this, like, materialist type structure but if. If you believe in that the world is actually. That they depended on meaning and attention, and that attention actually, let's say, at least, participates in the way the world reveals itself to us. And so it means then that the mechanisms of attention, which. Which is something like stories, images, the way that we compress facts together into stories, are part of the way, or not just part, but they are in some ways the source of how reality unfolds. And so then you can start to talk about narrative and about ritual and about images, and it makes sense to people because you're coming at it from a different. A different tackle. You're coming at it from the question of meaning, which I think that if you talk to John Vervecki, you've noticed that meaning is inevitable. You can't avoid relevant. The question of relevance, and you can't avoid the question of telos and purposes. We see things through purposes and through relevance. And so I think that in that frame, then I can show how. So one of the problems with this happened with religious thinkers is that on the one hand, you had religious thinkers that said something like, you know, in the more conservative side, you know, the Bible doesn't mean anything. It's just a description of things that happen. So if you try to look for meaning in it, it's almost as if you're destroying the factuality of it. You're destroying the fact that it happened. Because we're scientists, we believe the world is arbitrary. We think things happen arbitrarily. There is no pattern. There are no. These deep patterns don't exist. And on the other hand, you had the same on this, like, let's say the opposite of it. You had religious thinkers that said, oh, look at all these patterns. None of this must have happened because all of these look like mythological stories. They all had. They have rhymes and they're structured. They have chiasms. They have all these structures in them. And so it's like, because we believe the world manifests itself arbitrarily, therefore all this is just a bunch of stuff people made up, a bunch of stories people made up. And so what I'm trying to propose is saying, no, the world actually manifests itself through patterns. And so there you have to have a pattern in order to even perceive the world. And so the thing religions deal with are real. They deal actually with events that happen, but they just don't describe them the way you would like them to. They describe them in a way that reveals their meaning is the way to say that. And so because of that, I Feel like I've been able to kind of bridge a little bit Christian and secular worlds, and I've helped more conservative Christians to realize, and you can't. The tack that they've been taking is nonsense. And I think I've helped secular people say, oh, okay, this is what this stuff is about. It's, you know, and also, you know, all these things help you understand religious phenomena in different ways. I don't know if that answers your question. That's a brilliant answer."}
{"episode_id":"SW - #286 - 2023-05-16 - Music and Pattern (Royal Northern College of Music Q&A)","start":350.52,"end":358.56,"speaker":"Unregistered: Interviewer","text":"Thank you very much. And I'd invite anyone here to ask questions, even on Zoom. Maybe if you could type them in the chat, that'd be great. So."}
{"episode_id":"SW - #286 - 2023-05-16 - Music and Pattern (Royal Northern College of Music Q&A)","start":360.53,"end":370.77,"speaker":"Audience Member","text":"Yeah, just on this, on when you talk about mythology, one conversation you and I have is, does it matter that all of it happened? Because that was the conversation."}
{"episode_id":"SW - #286 - 2023-05-16 - Music and Pattern (Royal Northern College of Music Q&A)","start":370.77,"end":372.01,"speaker":"Jonathan Pageau","text":"Did it happen? Did not happen."}
{"episode_id":"SW - #286 - 2023-05-16 - Music and Pattern (Royal Northern College of Music Q&A)","start":372.01,"end":382.21,"speaker":"Audience Member","text":"And now because of Jordan Peterson, Christianity's got a good hold because of its talk about mythology and archetypes matter, that it actually happened."}
{"episode_id":"SW - #286 - 2023-05-16 - Music and Pattern (Royal Northern College of Music Q&A)","start":382.93,"end":668.33,"speaker":"Jonathan Pageau","text":"So I think that. How can I say this? I think that all religions are based on events, you know, and even when you just. Even when the ancient myth described the gods, they're talking about events. They're not talking about events at the same level that we're talking at. Right? And so there are different levels of events. And it's very simple. Like when I describe the tying of my shoe, it's not the same level of event that if I say Rome fell, the category of Rome fell is an extremely high event in terms of what it implies, what it. You know, what it. And then people could even argue about it because it's so big. So imagine if you take that even bigger when they describe the gods, I think they're describing events, just very, very high events or almost very abstract events, maybe the best way to understand it. But for sure, let's say one of the things that happens in time, and you see that in the Bible, and you see that in the Old Testament and the New Testament, is that there's a way in which people realize that there's a concretization of those patterns. It's like these patterns actually happen in the world. They're not just high, high patterns that actually the world that we live in is actually patterned in those same way. So for sure, in terms of Christianity, I think that Christians, I think to be a Christian, you have to believe in the incarnation and the death and resurrection of Christ and that those are events that happen in the world. Now, I've said many times, they're not forensic descriptions, and they're not trying to describe the causalities of what's happening. They're not trying to describe the nature of the resurrected body of Jesus. You don't see any of that. They actually tried to obfuscate the capacity to simply see the resurrection as some kind of, you know, let's say, forensic event that you could describe to police officer. Because there's actually moments when the disciples don't recognize Jesus. They. They don't know what they're. What they're looking at. They don't know what's going on. You know, so there's a sense in which the Bible itself is saying, yes, the resurrection happened, but don't try to box it in. Like, don't try to give it a forensic description. But I think it's important to understand that because one of the problems of wanting things to be symbolic or only symbolic or only mythological or only archetypal is that then you again have the same issue, which is that you believe that the world doesn't actually exist in those archetypes, that somehow the world can exist just neutrally and arbitrarily. But I think what we're discovering more and more is that your very capacity to perceive the world is imbibed in those mechanisms. So your very capacity to link events to together in order to see unity in multiplicity of events is necessarily archetypal. So you could say something like, there's nothing that happens which isn't to some degree archetypal. Or that if we don't. If we're not able to see the archetypal aspect of what's happening, it's a fault of ours. And that something like the saints, you know, the enlightened ones, could see the pattern in everything. They could notice that the entire world is a theophany of these primordial patterns. So I think that it's important. It's an important distinction because I get a lot of that, obviously, because I talk about symbolism. People, they want to stay up in the symbols and they're interested in seeing the patterns. But it's how it lands that's really important, I think. And that's what makes a difference in terms of a way to live and a way to embody these patterns. It's not just something we think about. It's not just something we read in books. It's not just when we interpret movies. It's that, let's say, if a movie is a condensed, very, very compressed story of someone's love life, let's say a love movie, your story of your love life will follow similar patterns. Right. The difference between a story is just that they compress. It's like you take all the salient facts, you distill them into more salient facts, and then you compress them together. So you take your love story of your life, let's say, and then you remove the bits where you're going to the bathroom and where you're, you know, you're doing something else and you're working. You, like, take out all the bits that don't relate to the pattern, and then you just smash them together. And that's why we have. That's why when we watch movies or we read books, like, let's say, novels, we have revelation. Because it's like I'm connecting all these things much closer together, and then it can reflect back on me. But those patterns exist in your life. That's why we care about them. That's why we find them interesting, is because they're reflecting something which exists in the world. Do you think the same thing is."}
{"episode_id":"SW - #286 - 2023-05-16 - Music and Pattern (Royal Northern College of Music Q&A)","start":668.33,"end":684.51,"speaker":"Unregistered: Interviewer","text":"True with something like music in that music is a layered sort of set of patterns? I think this is something that Jordan Peterson talks about quite a lot and really, sort of emphatically, this idea that music sort of embodies this harmony that people should live in."}
{"episode_id":"SW - #286 - 2023-05-16 - Music and Pattern (Royal Northern College of Music Q&A)","start":684.99,"end":810.54,"speaker":"Jonathan Pageau","text":"I think so. I think so. I think that for music, it's harder to talk about because music seems to be much more abstract in terms of the relations between, let's say, the things that it posits. And so the patterns are almost. In some ways, they're more immediate because they're almost pure. They're just basically. So you have experiences of. Let's say you have experiences of relationships between sounds. That's what you're experiencing. So there has to be a beginning, there has to be an end, and then there has to be some kind of movement, you know, of course, a lot of contemporary composers have tried to smash that or break that as much as possible. But even in breaking it, they're calling. They're always calling back. It's like I'm breaking this. Like I'm breaking this thing that is. That will call and will create tension and opposites and longing for resolution of the pattern. And then you can tease someone with music by not resolving the pattern and then finally giving you a resolution which is different from the one you expected. So there's all these things you can do to play with. But I think that that's exactly what's going on in music. So you have different joys that you experience in music. Some of them are really more like a roundabout, like a round. Where you have one melody that repeats and then you know what to expect. And you kind of. It's almost like it can also become trance, like, where you just keep repeating the same melody over and over. You find also a comfort, let's say, lullabies, all these things that our parents used to sing to us or church songs or whatever. Things that find comfort. And then you have more. Let's say if you. You have more complex pleasures that you can experience in terms of pattern, where there is more like a novel. Right. It's like I've set you up and then I think. You think I'm going that way, and then I take you this way and then, oh, finally I resolve it in a way that you didn't expect. So, yeah, that's what I. But I'm not an expert on music, but I think that's definitely true about music, too."}
{"episode_id":"SW - #286 - 2023-05-16 - Music and Pattern (Royal Northern College of Music Q&A)","start":811.1,"end":830.41,"speaker":"Unregistered: Interviewer","text":"Brilliant. I'd love to dive into some of your thoughts about contemporary art and music, but before we do, Stephen Chan in the chat, has asked some of what has been described, reminds me of fractals with nature. What is the relationship between archetypal patterns and fractals? Are they two of the same or is there some differentiation?"}
{"episode_id":"SW - #286 - 2023-05-16 - Music and Pattern (Royal Northern College of Music Q&A)","start":830.97,"end":1154.13,"speaker":"Jonathan Pageau","text":"I think the best way to understand symbolic patterns is fractals, that's for sure, if people are interested in that. My brother wrote a book called the Language of Creation, which goes more into it in almost like a mathematical way. But that is really the way to understand order. And what fractals do in terms of symbolism is that in some ways you basically have one pattern, which is like one and many. Like, that's. That's the pattern. It's like one and many. And usually it's almost like one and two. So it's like unity, opposition, and then resolution of opposition. Sometimes it can become more complex, but usually that's just the basic pattern. And it can be represented in all kinds of ways as a mountain, as all these different. These different types of patterns. But the idea that it's fractal is very important, which means that because you can experience the pattern at every level, you can experience unity. So let's say it this way. You can experience unity and multiplicity. At. Let's say, take. Let's take the relationship between people and groups and things. You can. You can experience it within yourself. We have a multiplicity of thoughts and passions and ideas, but you're somehow able to notice that you're one person and then you can do that in A group in a family. So it's like there's multiple people in the family, but we recognize unity within that family. Then you can scale that up into group, into groups, into churches or religious groups or cities, nations, et cetera, et cetera. You can just keep scaling that up until you realize that the idea that, for example, the United States is one thing, it's like, why is it one thing? It's like billions and billions of things. But it's true. And through that fractal relationship. And one of the things that modernism has done is that if we do want to get into modernism, is that modernism has tended to level the fractal nature of things. It tends to want to either stay in opposites, kind of irreducible opposites, often wants to reduce it into a basic opposite where you don't have this self, same fractal structure. And so because of that, it tends to. So a good example would be the way that traditional societies are usually set up or have this fractal nature, right? So a medieval village has the home with the hearth. And then those homes in the hearth exist in neighborhoods with churches. And then all those neighborhoods with churches exist in a bigger city with the cathedral. The cathedral is the highest building. And then it's like the center for the entire city. And then now that reproduces itself all the way down. And so what modernism tends to do is that it levels. It doesn't tend to want to understand the fractal nature. And so it'll create things like suburbs. Like suburbs and, let's say, shopping centers. And then there's no centers, and the houses become decentered. We don't even think about the manner in which the family would come together properly in a house. It's just like living spaces, basically, that are just kind of leveled. Modernity tends to do that. It tends to move towards absolute uniformity and then also idiosyncratic multiplicity. So if you look at most modern movements, you'll notice that they tend to swing between those two extremes. And so you can have something like, let's say in painting, you can have something like supremacism and expressionism happening at the same time. You know, you have these movements towards abstraction where we want to reduce. You know, if you think of Malevich's painting, for example, you want to reduce everything to its absolute essence, like color field painting, even all the way into the seventies or conceptual art. And then you have absolute breakdown where it's like everything goes. There are no rules. It's just complete idiosyncrasy. Tape a banana to a wall, and that's considered equal to any form of art. So that's definitely what I think happens. I don't know modernism as much in music, sadly, but I do see something about, for example, atonal music in the 20th century that it has that tendency. It's like it doesn't take into account the fractal nature of how we experience music. And so you have this imposition of mathematical structures that are extremely complex onto a musical system that doesn't take into account the human desire for something like a simple round, like a simple return or a simple cycle of coherent experience. And so you. I don't think that modern music or modern art is. How can I say this? That it's stupid or that it's. You know, a lot of people have this idea that it's just anything goes. No, it's not true. It's not anything goes. It actually tends to be extremely like, almost tyrannical imposition of, like, systems of thinking of onto the art. And then you end up with things that people actually, or that very few people can enjoy because it's so high that it's almost impossible for it to land."}
{"episode_id":"SW - #286 - 2023-05-16 - Music and Pattern (Royal Northern College of Music Q&A)","start":1155.81,"end":1189.66,"speaker":"Unregistered: Interviewer","text":"Beautifully articulate. Tywee Roberts, who can't be here today, has asked, you've discussed before your view on contemporary art as an odd fetishization of the art object removed from any actual function. Could you say more about that, and especially whether you think that contemporary music has arrived at a similar place? There's much crossover between these two worlds, and I wonder if music might have also been removed too far from having a functional context. I'd love to hear your thoughts on how music has evolved in the modern era. And he says, thank you so much for your work and best wishes."}
{"episode_id":"SW - #286 - 2023-05-16 - Music and Pattern (Royal Northern College of Music Q&A)","start":1190.46,"end":1536.17,"speaker":"Jonathan Pageau","text":"No, I totally think that the same thing happened to music that happened to all the other arts is that if you think about the medieval. In the medieval world, people struggle to understand this and they think that it's actually like a diminishing of art. But in the medieval world, poetry and music would always serve a function, which is why, for example, poetry would be panegyric. Most poetry in the medieval times would be panegyric, would be something like celebrating. Something like celebrating a king, celebrating a saint, celebrating Christ and everything. And we tend to think like, that's lower, but it's actually because it was trying to serve a purpose in the world. And music, I think, would have been the same. That is, most music would have been either, let's say folk music in terms of dancing so it has a communal function. It would have been composed for certain events, for certain high figures like kings and nobles or whatever, to celebrate certain accomplishments often related to poetry as well. So let's say someone would compose a ballad to celebrate a great feat that would have happened in a battle. And then you can see, of course, that the highest version of that would be celebrating God. And so the highest forms of music would be used, would be directed towards the church and directed towards celebration of God. And I think that even as secular people, I think it's probably possible to kind of understand why that is. It's just saying we want the music to be integrated into everything else. We don't want it to stand out as just a strange, idiosyncratic thing, but rather we want it to integrate with other things. And therefore it has to participate in the world. And especially the church would have been a manner in which it participated in society at the highest level, celebrating the highest thing, but then also would have been in relationship to the poetry, in relationship to the images as well, in the space, let's say, in a kind of sacred space. So architecture, music, all these things would have come together into a kind of celebration. So what we see with the modern music is first of all, already, I think already with the opera, we have a problem, which is that we have a problem because in some ways we're moving towards, like, let's say, entertainment. Now, there's nothing wrong with entertainment. I think entertainment's fine, but I don't think that that's the highest part function that music can play. But it's. Sadly, that is pretty much now, today, what it has been relegated to. And I think that already starts at the moment with the celebration of opera as being supposedly the highest start. And you see the same with dance. It's like ballet becomes the highest dance. Well, it's like, yeah, I don't know. Wouldn't the highest dance be more integrated? Like folk dancing or. Or court dancing would have been more integrated into the world in ballet, because ballet is just spectator. And so I think that concert music already brings music into a space where it's going to. It's going to reach high. So it's like, this is the thing, when I talk about this separation of, like, absolute, let's say, a kind of tyranny and then a kind of idiosyncrasy. So it's going to bring highs. And so I totally agree that Bach and Mozart, you know, and maybe Beethoven or reach highs that liturgical music didn't, because it kind of Abstracts itself and it moves away from its ground like the way that it's incarnated into the world. But I think already when you get to Beethoven, you're, like, in deep. You're seeing the trouble, like, right out the door. Like, you're just seeing the trouble coming. And I think that that trouble starts to unravel rather quickly. And so then you end up with composers that are so obscure in terms of popular capacity to listen. Like, if nobody listens to Weber, that doesn't study art. Like, nobody listens to all these modern composers. And then what happens is the music that becomes popular becomes more and more, let's say trite and more and more. Almost like all in the. All in the hips, right? It just kind of moves down into the hips, which was there in the Middle Ages. Like, it would. You know, there was dance. Dance was part of it, but there was something kind of holding it together. But now it moves just in. Into the hips, and then it's like, basically, you know, whatever electronic dance music is the. Is the. The end of that. It's like. It's just a beat, basically. It's just a beat. Pop music just. It's. It's like these. Just these same. Especially now, these, like, new AI, they sound like AI generic. I think they've been working using AI for a while because you have these, like, melody tropes. And then you're listening to a song, you're like, what the hell? Like, I just heard that. You know, and then they. People kind of. They pull out certain tropes from each other's songs, and then all the songs just end up sounding exactly the same. It's pretty. It's pretty. It's very weird. So I think that. That. I think that the deincarnation of music has led both to its moving towards something completely obscure and that nobody cares about except for people that study music. And then coming all the way down the one that's the most incarnate. In some ways, I think jazz was the most incarnate because it did have. Because it stayed with dance. I think it was still the best. The best of what the modern world had to offer was jazz. But even that gets. Yeah, I don't know. I think I like listening to Miles Davis, but then I don't. I'm just like, what am I listening to? Like, I can handle 10 minutes and then I'm done, you know?"}
{"episode_id":"SW - #286 - 2023-05-16 - Music and Pattern (Royal Northern College of Music Q&A)","start":1538.49,"end":1558.3,"speaker":"Audience Member","text":"Yeah. Just coming back to the question of liturgical music. There's still lots of texts where no compositions have been written yet for the Liturgy. And as new composers are taking it on in this day and age, what advice would you give to them to write for liturgy?"}
{"episode_id":"SW - #286 - 2023-05-16 - Music and Pattern (Royal Northern College of Music Q&A)","start":1559.66,"end":1675.7,"speaker":"Jonathan Pageau","text":"Yeah, it's rough because I'm not like, I don't know. I don't think I know enough about music. I think one, let's say, I would say one of the tropes that I see happening, because in the Orthodox Church right now, there is a kind of renewal or desire to renew. And I'm from the Orthodox tradition. So there is a. There are some musicians, composers, even in the United States. Benedict Sheehan, who actually was nominated for two Grammys, his recent Vespers composition is an attempt to try to create something that is both fully liturgical in the best sense, but then also takes into account some of the modern. Some modern development, let's say, puts it to the service of the liturgy without blowing it up. Right. And so in some ways, offering something also that is accessible to people. I know, big fashion, let's say, in the Orthodox Church right now is to. Is to use melodies that can be sung by the congregation. Because even in the Catholic Church and in the Orthodox Church, as the modern world kind of became more and more present, what happened is the music became more and more difficult and more, you know, more professional. And so because of that, it also, at some point, going to church became a show. So we have that now, too, on the other end, which is like the evangelical churches that just kind of keep. They just like make up new songs every two weeks, and then nobody knows them, and then they. They just like, sing these songs and they're all. They're all pretty much the same anyways in terms of, like, their melody, structure and stuff. So I don't. I. That's. I would say look at some of the people there. Vladimir Morozan is one of the people right now that I know in the Orthodox Church who's working on that, and then Benedict Sheen. Those are the 2 in the U.S. i think, that are at least the most effective."}
{"episode_id":"SW - #286 - 2023-05-16 - Music and Pattern (Royal Northern College of Music Q&A)","start":1676.5,"end":1700.12,"speaker":"Co-interviewer","text":"So I was thinking. I haven't fully fleshed out this question in my head, so I'm sorry if it's going to be confusing, but a common theme of what your. Of your sort of criticism of modernity and also of recent artistic developments, where is a sort of disregard for meaning and for pattern. Right. So."}
{"episode_id":"SW - #286 - 2023-05-16 - Music and Pattern (Royal Northern College of Music Q&A)","start":1700.12,"end":1718.32,"speaker":"Jonathan Pageau","text":"No, no. Well, there's both. There's actually like a hyper. Pattern, you could say a pattern that is so. That is so in. That is so abstract that. That it. Almost no one cares about it because a lot of the modern yeah. And then there's the opposite. Then there is also like anything goes, whatever you can do. So both these seems to happen at the same time."}
{"episode_id":"SW - #286 - 2023-05-16 - Music and Pattern (Royal Northern College of Music Q&A)","start":1719.32,"end":1775.02,"speaker":"Co-interviewer","text":"Okay, so what I was thinking was sometimes when, let's say a person whose outlook of the world, maybe a Christian, that sees meaning and pattern in the world as something objective that exists and that reveals the truth that is there independent of me, a conversation between this person and a person who is a complete relativist, for example, and doesn't believe in any meaning or any pattern. Usually what I find when I have those conversations is the person that doesn't believe in any sort of pattern feels very much restrained when they, when they are sort of pushed to believe in a pattern. But if they don't, they have to disregard, for example, human nature. Because humans, human nature is a form of a pattern. Right?"}
{"episode_id":"SW - #286 - 2023-05-16 - Music and Pattern (Royal Northern College of Music Q&A)","start":1775.02,"end":1775.5,"speaker":"Unregistered: Interviewer","text":"Yeah."}
{"episode_id":"SW - #286 - 2023-05-16 - Music and Pattern (Royal Northern College of Music Q&A)","start":1775.98,"end":1987.93,"speaker":"Jonathan Pageau","text":"No, they're stuck. You know, it's. I totally agree, I agree with your sentiment, that is that you can see it like in the modern world, this desire to free ourselves from the pattern has led to things that are so abhorrent and absurd that, you know, for a good example would be, you know, that's a deconstructive, Deconstructive architecture in the 1980s and 90s. And so, you know, architects would create buildings with like just a massive hole in the living room. It's like, okay, there actually are patterns. You cannot live in a house that has like a 10 foot hole in the living room because it's just not, not going to happen. Right. So, so it actually, it's like, it's as if some of the modern, I think some of the experimental music, in some ways it actually reveals the pattern. And so it's like you can make an effort and listen to like, it's a minimalist acoustic music and listen to, you know, someone, someone like grading the side of a counter for an hour. Like you can do it. It's not impossible to do it, but it's like it actually reveals just how difficult it is to get there. And so, and so we have, for example, like, for someone who doesn't, who doesn't think we have patterns, like we have a certain frequency of sound that we're able to hear. It's very simple. We have a certain level of decibel of volume that we're able, or that we can sustain hearing, that we're able to hear and that we can sustain hearing. Those are patterns. You just cannot, you cannot avoid these patterns. Like you could destroy someone's hearing if you don't, if you don't pay attention to these patterns. And so, and then there is a certain level of variation which people find pleasant. And those are probably, they're probably derived from the human voice. They're probably derived from our thousands and thousands, millions of years of hearing human intonation and hearing the space that exists in our, in our intonation. And so they're derivations and probably concentrations and derivations of the, the, the, the possible tonalities in the human voice. And so I don't think, I don't think, I don't see how even the most secular person could think that that's absurd. It's like these are just, these are just kind of like natural, you know. And you could say something like, you could say something like, you know, there are certain birds that make certain sounds and if the, the male bird makes certain sounds to attract the, the female and if they're off, they won't get, they won't, they won't reproduce themselves. And I think that that's true about music. Like, I think that there are certain, there's there's a certain, like, you know, I mean, I don't mean, I mean, yeah, of course there's a musician getting laid or whatever, but that's not what I mean. But I mean is that there's also like. What I mean is that just that if certain sounds don't continue, let's say there's a certain perseverance of sonority and distance between sounds, then those will become one off experiments and then they'll go away. Whereas some things will just continue. The things that continue is because we like them and we care about them and we want to kind of perpetuate them. So, so I think that even like from almost like a Darwinian perspective, you can argue for patterns. Basically."}
{"episode_id":"SW - #286 - 2023-05-16 - Music and Pattern (Royal Northern College of Music Q&A)","start":1988.81,"end":2035.81,"speaker":"Co-interviewer","text":"I think what I get from that is that we all live, whether we believe in patterns and meaning or not. We all live as if they exist. We just can't escape it. They exist and we live according to them. But in this sort of conversation that I was talking about, the person that doesn't believe in them, or rather the person lives as if they exist, but feels restricted when they have to accept the truth that comes with those meanings and those patterns. So I wonder if you could talk about the relationship between, or the necessity, the necessary relationship between truth and objectivity and these patterns and these meanings."}
{"episode_id":"SW - #286 - 2023-05-16 - Music and Pattern (Royal Northern College of Music Q&A)","start":2036.53,"end":2223.02,"speaker":"Jonathan Pageau","text":"Well, it's pride and I think it's like, if you want to understand all the, like, the source of sin, you could say you write in the world that's what it is. It's saying, I don't. They're like, I, I. There are patterns that have authority over me and I don't care like either. You just can't get away from it, right? You can't eat rocks, you can't. There are a bunch of things that you cannot do. There are some patterns that have authority over you and you exist within that. That, that's the scope of those patterns. So that exists both objectively in the natural world, but it also exists in the human world. Like we have, we necessarily have people that are authorities. We have our parents that were. That had to guide us. We have different structures of authority. And so I think that, I think that there's just a. It's just pride. It's like, it's, that's why we see that as the root of sin. It's like the idea of self causation is the idea that I can cause myself, right? I can completely contain myself. I can be free from any type of constraint. And there was a moment, I think there was a moment maybe in the late 19th and early 20th century where people could credibly believe that. I really don't see how anybody can believe that anymore. Because one of the things that happens too, which is hilarious because like in the early 20th century, really, I mean, I can have sympathy for them. Like I have sympathy for the, for the artists in the early 20th century, they're like, we've got this, we're going to do this. But then whatever happened between like, let's say 1900 and. And, and maybe 1925, maybe, I don't know, in music, but in art and visual art, like then that set up a new way of doing that. Nobody has changed. It's like experimental music or experimental art is no different now than it was in like 1920. It's like the Dada artist did everything anybody can do now. It's like not explicitly everything, but every idea that any, any contemporary artist has, you know, installations or whatever or, or breaking these rules or whatever, or art that, that doesn't last long, that, that, that, you know, that it's like all of this was this, all this happened in 1920. And so what happened is like, even the counterculture, like, even the people that wanted to break all the patterns which rule over us, created like a kind of weird anti. Pattern that now people just follow. It's like ridiculous. And so, you know, it's like, who's more conforming? Someone who goes to church or a punk rocker? I'm not sure. Which one is more conforming? Like they both had uniforms. They both, they both. You can recognize them. You can. You know, it's just that one is like a kind of anti pattern, but it's still a pattern. And so I think that's what happens. It's like that's what happens with a lot of the, with a lot of the contemporary or the idea of not wanting a pattern is that what you end up is you create an anti pattern, which is still a pattern. And you can recognize. Right. You can tell. It's like, yeah, yeah, you're just doing it upside down, dude. That's all you're doing. Because you turn something upside down doesn't mean that it's. I can't still recognize it yet. Still recognize it."}
{"episode_id":"SW - #286 - 2023-05-16 - Music and Pattern (Royal Northern College of Music Q&A)","start":2224.54,"end":2280.65,"speaker":"Unregistered: Interviewer","text":"This sentiment echoes a lot of some of the things we were talking about with Samuel Andreev, who is another guest on Jordan Peterson's podcast. He was saying to us that as a professor of composition in his students work, he can't see any sort of innovation, something that's necessarily new compared to what's happened in say, the last few 50 or so years of contemporary classical music. And he said to us that he thinks that the contemporary music world, and I wonder if this is true about the contemporary art world too, is in a period of consolidation rather than innovation. And just on top of that, is there a way that we can get back to looking at something like beauty as something that is objective? You mentioned there's a sort of Darwinian sense to that pattern. Is there something biological that we can ground beauty in so that we can get back to this sort of sense of consolidating the arts?"}
{"episode_id":"SW - #286 - 2023-05-16 - Music and Pattern (Royal Northern College of Music Q&A)","start":2280.97,"end":2514.37,"speaker":"Jonathan Pageau","text":"I think so. I definitely think so. And I think that there are certain, I think now, I think now we're in a good position in terms of beauty because we have people, let's say people like Christopher Alexander, for example, or what we call the New Urbanist movement. You know, these are, you know, these are credible. And so what they're saying is this fractal relationship, these fractal relationships are necessary. So if you can't make a building in any way, there are actual, there are actual forms that you inhabit a space. So it's like if you inhabit a certain space, you will be prone to do certain things in that space. And you can't make a person a blank slate. Like if you have a dark crypt like place, you know, it's not the same as a grand staircase going up into a two story building. It's like these two things you're not going to be the same person in one space or the other. And so design. Now, I think the. Almost like a. It's like. Almost like a scientific approach to design is bringing back the. I think the idea of beauty and it's breaking down. So if you think of Bauhaus, for example, I'm sorry, I'm just in architecture right now, in my mind, but do you think of Bauhaus, for example, and Brutalist architecture? You know, they were thinking that they were going to be practical and it was all going to be scientific and everything, but it turns out they're not. It turns out the imposition of uniformity in the world actually kills the human spirit. It really destroys living in Bauhaus. Buildings will destroy you. And so right now, I think that we're. People are kind of waking up and thinking, oh, no, actually, these spaces, they relate to something that we exist in. And so I think we're in a good place, honestly, in some ways. I don't know in terms of music, though, but for sure, I know that it's going to start. I think that the fact that it starts with architecture and city planning is probably inevitable because that's the space in which we live. And so if we can see the. If we can see movements like the New Urbanist movement and these kind of. These rediscovery of neighborhoods, rediscovery of city centers. There are several projects in the United States like that, very interesting projects, then I think that we're gonna slowly see other arts follow. And so in my own world, let's say in the world of Church of Iconography, what I'm seeing is that the top iconographers in America are actually issued from contemporary art. They're actually issued from the academy, right? They're not just like improvised mom and pop people making icons. They're people who studied in New York, studied in the big schools, and then finally decided to move towards incarnate, let's say, art at the service of the community. And so I think that we're in a good position. And people like John Vervecki, for example, and his idea of relevance and these questions, like these types of. Of categories. And you think of Ian McGilchrist as well, and his vision of how the brain works and how perception works. All these thinkers, I think, are opening up the possibility of really saying so. It's like, beauty is not one thing. Beauty is a pattern. And so there's a flexibility. It's like a poem. There's a form, but there's also a kind of Improvisation. So that's how we. That's what beauty always manifests itself as. It's. It's like there's a pattern and then there's an. There's a spice, like an improvisation part to it. If we can find the right balance between those two, that's when we. That's when we. That's when we knock it out. That's when we hit it. So."}
{"episode_id":"SW - #286 - 2023-05-16 - Music and Pattern (Royal Northern College of Music Q&A)","start":2516.21,"end":2556.9,"speaker":"Unregistered: Interviewer","text":"Before we come on to the question, I just want to just point out in something like the study of what the name is, the study of animal behavior, basically, there's this idea of fixed action patterns which are something that is sort of naturally selected for the animals, you know, will inhabit if. How do you say, because of their evolutionary history. So, for example, like on seagulls, you have these little red dots on the beaks that the baby seagull pecks to get the food out of the mother's mouth. I would expect something like beauty as a pattern, as you describe it in a Stalwinian sense, to be something that's built into our biology. Is that. Is that."}
{"episode_id":"SW - #286 - 2023-05-16 - Music and Pattern (Royal Northern College of Music Q&A)","start":2557.62,"end":2664.35,"speaker":"Jonathan Pageau","text":"No, you're right. That it would. It would deeply connect to the way that we're made. And so that's why. And I think. I mean, we have plenty of examples. The Old World is just full of examples. Just go to a medieval village in Europe. Just go. Just go to a very old city, just walk around, and then you'll understand what it is that's going on. There's like a. There's a clear pattern, but there's also a kind of whimsiness through the pattern and also an adaptivity. So it's like one of the things I think humans find beautiful is the adaptation of the pattern to a particular is the best way to understand it. It's not just a pattern. And so it's like, how does the church fit in that landscape? What's the relationship between this, the. The. Between the. The city hall and the church? Like, if you go to London, for example, and you stand there and you see the parliament and you see the church, and it's like these relationships of. Of things that we know what they are, but how they're. How they come together and how they're related and how. How one is. You know, how you have this building next to the river and you have a bridge. And so it's like. I think that that's what. That's. What's that for? Beauty is. It's like this. This interrelation of patterns to their particular. And so. Yeah, so that seems to be exactly how evolutionary. I think that's how evolutionary selection works too. Right. It's like if it's properly adapted, then it gets selected and then it gets moved up. And it's not like we're going to reproduce London in another city, but it's rather that we see how it's properly selected and that, that very. Those relationships, they kind of inhabit us in a way."}
{"episode_id":"SW - #286 - 2023-05-16 - Music and Pattern (Royal Northern College of Music Q&A)","start":2668.83,"end":2706.27,"speaker":"Audience Member","text":"Hi Jonathan, It's a pleasure to have you with us. I have sort of a three part question. Sorry. To bring us back to modernism. My first part of the question is, do you think modernism is inevitable? And the second part of you sort of already touched on when you talked about beauty. And you also talked a little bit more, I feel, on the criticism and detriments of modernism, but I would like you to talk more about the. What you think is productive within it. And the third part of the question is, what do you think is coming next if we continue the way we're headed?"}
{"episode_id":"SW - #286 - 2023-05-16 - Music and Pattern (Royal Northern College of Music Q&A)","start":2708.27,"end":3161.9,"speaker":"Jonathan Pageau","text":"Get me in like apocalyptic mode here. It's not great. It's not good for you. All right, so yes, I do think modernism is inevitable. I think the best way to understand it's always there. So the thing that's the problem is like, it's a fractal pattern. So what modernism is, has always been there, let's say, but as a spice or as an excess or as a movement towards something which is a little too much. So that's how. I think that. That's kind of how tradition works. So if you so like. And it. And there have been. There's cycles like that. So for example, if you listen to 13th century, you know, high music in France, I mean, it is crazy. It is wild. It is wild. It, it's like the mathematical patterns are extremely complex. You know, there's like, there's rhythmic, they're like different rhythms. And so. And when you listen to it, you know, it's almost like it's so difficult to listen to because you have, you have, you have like text, you have someone singing melodies and then other people singing and there seems to be no relation, but there's like this strange mathematical relationship between the different voices. And it's like. But then that. It's like it. So what I mean is that these things happen and then, and at some point it, it kind of, let's say it breaks and then it feeds into a more, a more embodied world and it's always kind of there, there's. There's going to be a little bit of that experimentation. I Always kind of think of, you know, if you look at church architecture, again, like middle aged church, church architecture, so you'd have the saints and you'd have, you know, the biblical images and then in the fringes, in the margins, then you'd have all the crazy stuff. Like you'd have like, lewd images and, you know, monsters and things eating their own tails and like just all this kind of. There's kind of experimental space which was held in the margin. And so the same with manuscripts, for example. So you had the main image in the center and then you had an experimental space in the border where you would. You could go. You could go wild, like do any. Do all. Whatever it is. Like, you know, knights fighting snails or scatological imagery. All kinds of stuff that is. That is usually not explored in everyday life. So I think that what modernism did is it basically took that and just like put it out there. It's like that's what the world is about now. It's about. It's kind of about the extremes. And so in some ways, I do think that in big cycles, we'll come to moments where these extremes will manifest themselves. So we saw the same happening in the Late Roman Empire, for example, or let's say the late Roman Republic and early Roman. At that transition, there was some really wild things. Like, there were mosaics that made. They would make mosaics of crumbs. And so they would make like a mosaic where it looked like someone had eaten the day before and had left crumbs on the table. And like, that was their decorative element. And so they would have like, images of. Yeah, like decomposed things. And there was this experimental space that was opening up that was becoming really, really intense. And I think that you could even argue that Ovid's Metamorphosis is a very modern text, you know, and that's why Augustus hated it so much. It's like. It's like he hated Ovid. He's like, just talking about sex all the time and then talking about. So it's like these moments have happened before, you know, So I think so. So what is its use? So one of the things that. That it does is that it does. It exposes the pattern in some ways, because you could say that in a normal, traditional world, things are just natural. Like, people don't necessarily think about these. These questions, they just live them. Right. It's like animals. Like animals don't ask themselves about the patterns that they. That they inhabit. But when things start to go awry and things start Kind of start to go into extremes where you actually see extremely, extremely, like, difficult, obtuse patterns up here. And then you kind of see idiosyncrasy down here. You're like, oh, wait a minute. Like, you can. You can kind of see what's going on. And I think that that scene can then be fed back into a more embodied world. And so that sounds abstract, what I'm saying, but so I do believe that. I do believe that, let's say the future will be an integration between embodied, kind of incarnate art with enough understanding about what modernism proposed to be able to integrate it in a way that doesn't call attention to itself completely. And so a good example, if you're interested, there's an iconographer. His name is Father Silouan Giustiniano. I think he's one of the best icon painters in America. He was an abstract, postmodern, kind of postmodern, abstract painter in the 90s. And he had all these scholarships in New York. He was doing great. He was on that path. And then he became a monk. So he began painting icons. And what he's been doing is integrating, let's say, extremely sophisticated color field theory and let's say, the principles that were developed by the Abstract Expressionists into his painting. And so the way in which, like, in the 70s, the theories about color like that they came up with were crazy about. They went really deep into. So they would make these paintings that no one could ever care about. Right? Just a bunch of squares. Like a bunch of squares of color. But it was the theory that went behind. It was an extremely sophisticated understanding of color relationships and vibration and how colors affect each other. And so it's like you can take that and put it back into something great. You can think the same about literature. It's like the modern writers. If you think of Beckett or you think of Joyce, you know, they're. They're. They're deep understanding, for example, of both, like, pattern and abstraction and. And also of idiosyncrasy at the same time. Like, that kind of relationship, that extreme relationship they're able to create, can feed back, I think, into. Into. Into the modern world. So if you. A good example of that. I don't know if, you know, there's a author, his name is Paul Kingsnorth, and. And he does that like he. He writes something like Beckett meets Tolkien. I mean, it's crazy. He wrote a novel called Beast. It's like. It's an astounding novel, but he. He actually grammatically he actually trans. He actually changes the grammar of the words as he's so his character, as he's losing his mind, like the Grammatic, the grammar of the sentences starts to break down in the story. So he uses modern tropes of actually playing with grammar and playing with punctuation. And this is like really avant garde stuff. But he's ultimately telling a story that follows the mythological pattern. So I think there are ways to do it. I don't know in music. I'm afraid I don't know enough about music. That'll be you guys. People point to Arvo Pert a bit like. I know people point to Arvo Perrot as a possible solution to the conundrum. As someone who is integrating, you know, avant garde into a more kind of embodied and celebratory music."}
{"episode_id":"SW - #286 - 2023-05-16 - Music and Pattern (Royal Northern College of Music Q&A)","start":3162.06,"end":3193.38,"speaker":"Audience Member","text":"So do you believe that the art or music is created or is rather discovered? So if there is such thing as objective beauty that I suppose it's derived from natural patterns. So then would you say that it's more closely to be like, discovered? Like, as if you were like. I don't know, as if minor."}
{"episode_id":"SW - #286 - 2023-05-16 - Music and Pattern (Royal Northern College of Music Q&A)","start":3194.9,"end":3197.38,"speaker":"Jonathan Pageau","text":"Yeah, yeah, yeah, I know. I understand exactly what you mean."}
{"episode_id":"SW - #286 - 2023-05-16 - Music and Pattern (Royal Northern College of Music Q&A)","start":3198.9,"end":3217.95,"speaker":"Audience Member","text":"And then second part, then we say that contemporary music because disregards for beauty and the natural patterns is as such more closely to be created because it's more of a random chance."}
{"episode_id":"SW - #286 - 2023-05-16 - Music and Pattern (Royal Northern College of Music Q&A)","start":3218.91,"end":3478.08,"speaker":"Jonathan Pageau","text":"Yeah, yeah. So I would say. I would say to your. The first part of your question, I would say that it's both. I know that's boring as an answer. It's like I'm not going to answer. But I think that anybody. I think that anybody who has an intuition, a real intuition, feels like they are not. It's not. Doesn't come from them. Like, if you. Like when that happens, usually you're on the right track. At least in my. In my case, like when I have an intuition and I feel like that intuition isn't from me, that, like you said, I feel like I'm. It's like. Like falling into me or. Right. It's like I. I'm being. I'm being assaulted by the idea. You know, it's like you. It's like it just seizes you. And then I think most of the time you feel like you're discovering. At least I do. But then there. Then there's also the implementation. And I think that in the implementation, then you have more of this kind of giving birth or this. This forming and the shaping. Right. Because usually what you have as an insight doesn't have body. At least I don't know about you guys. I'm not a musician. Like, I'm talking about my own experiences. So usually what comes to me as inside doesn't have body. It's like almost like a. Yeah, it almost is like a. Like a relationship, right? A pattern, a relationship. And then. And then when I put it into the world, then there's a shaping that comes. So I think that, that that would be the way that I would. At least I would. I would, you know, describe it, let's say, you know. So an example, like, I've been. I've been just for a while now, I've been wanting to like, rewrite fairy tales. And so. And the way that I want to do it is I want to get to the fairy tale like I want. So, for example, like, I don't understand Jack and the Beanstalk. I never understood Jack and the Beanstalk since I was a kid. I was like, what is this story about? Like, why is this the hero, he's. He's like. He's stealing from the giant. Like, what? Why? So why? Why? Like, what is happening in the story? And so it's like, I basically just been. That question has just been in my mind for 20 years. I mean, not more, you know, 35 years or whatever, 40 years. And so. But recently I'm like, no, I want to. I need. I need this. Like, I want to write a version of Jack and the Beanstalk. So I just left that there. And then I don't know how it works. I don't know how it works. At some point, you know, I'm sitting there, I'm like. And all of a sudden it just like, it's like a lightning bolt, right? Just strikes you and you're like, oh, I get it. I know what that's about. Like, I know what that story's about. But then I have to write it. Like, I haven't written it yet. So in terms of contemporary music, like your second part of your answer, I think, then again, I think that this is what I see about contemporary music is that I see that some contemporary music is actually hyper patterned. Like, it's not. It isn't idiosyncratic. Some of it is. Like, I'm gonna have this pattern and I'm gonna like, I'm gonna shove it down your throat. Like, I'm gonna just like make you listen to it, you know, even though it's unbearable. But it's like, here's my idea. I have this idea and it's like this idea that I'm Just gonna, like, just force into the world almost. And so I think there's a lot of that in contemporary art in general. And I think contemporary music is especially. And then, then. But then there's also the other. Exactly what you said. There's also the other part which is just like this kind of, like, noise where, you know, like, oh, like, yeah, I dropped this whatever. Like, I hit the side of the bowl. And it's like. So you have these. You have this sense of, like, idiosyncratic sound as well. So that's what I see in both. And so I do. I think that. I think there can be an excess of both. I really see the modern world as something like a move into excess. And if we try to understand it too much as one side, which is moving towards idiosyncrasy, and if we try to understand it too much as kind of authoritarian patterns that are imposed, then we miss one part of it. But if we see it just as a radicalization of the two sides, which is like. Which is the Internet. Is the Internet the freest, most chaotic space to ever existed? Or is the Internet the most authoritarian space that has ever been thought of by man? It's like it's just both at the same time. I don't know exactly how that is, but it's just both at the same time."}
{"episode_id":"SW - #286 - 2023-05-16 - Music and Pattern (Royal Northern College of Music Q&A)","start":3479.68,"end":3492.24,"speaker":"Audience Member","text":"So the thing like a sin of a contemporary music is that it's too much of following patterns, or it's too much. Not only the patterns. Which one do you think it is?"}
{"episode_id":"SW - #286 - 2023-05-16 - Music and Pattern (Royal Northern College of Music Q&A)","start":3492.88,"end":3549.57,"speaker":"Jonathan Pageau","text":"I think that it's. I think. I really do think that it depends on the music. I think that it's a. So you think about this. Think about two sins, right? Think about one sin. And both of them have to do with pride, right? The first sin is saying, I don't want to submit to any rules. You know, I'm my own person. Nobody's going to tell me what to do, right? That's the first sin. The other sin is, oh, I'm going to make this happen. I don't care if the whole world resists me. Like, if all reality resists this thing that I want to do, I'm going to do it, and there's nothing you can do to stop me. And so you can see they both come from the same source, but one manifests itself as an authoritarian desire to impose a pattern on something that can't hold it or doesn't want to or will just get crushed by it. And the other one is refusing all natural patterns and wanting to move away. So I think that it's just both. It's same time. Yeah."}
{"episode_id":"SW - #286 - 2023-05-16 - Music and Pattern (Royal Northern College of Music Q&A)","start":3549.57,"end":3582.11,"speaker":"Audience Member","text":"I just want to ask about you as a Christian iconographer and artist. I know. Correct me if I'm wrong. I understand in Orthodox tradition, icons, even in the Catholic tradition, icons are seen as a window into heaven, and each, you know, symbol of the hand or each color is seen as a very theological expression, and any changing or invasion of that could be even seen as heresy. So how do you, as an artist, kind of break those boundaries of innovate, express yourself, and how do you move."}
{"episode_id":"SW - #286 - 2023-05-16 - Music and Pattern (Royal Northern College of Music Q&A)","start":3582.11,"end":3833.32,"speaker":"Jonathan Pageau","text":"Forward with that art? Yeah, so I think that some of what you said, I think, has been vastly, like, exaggerated in terms of. In terms of just how strict it is. And I think. And I. And I understand why. You know, it's like. I think that. I think that some people who felt like most contemporary art was just anything goes, and that there were no rule, rhyme, or reason and no meaning, then looked back at medieval art and saw, wow, these things have patterns, these things have meaning. These things have a sense. And then they just want to hold on to that. But the reality of traditional iconography is that it is extremely variable. There's a lot of variation, variation in styles, variation in tropes. Now, it's not an absolute variation. There are. There are limits, and there are tropes. There are patterns that you have to follow in order for it to be recognized by the community in which you're trying. That you're trying to serve. And so that's probably the best way to understand it. It's almost like you could understand it like, you know, English has certain grammatical rules, and if I. If I don't use those grammatical rules, then people won't recognize that it's English. And so if I make an image and I'm like, well, you know, I want Jesus to have a pumpkin head. Well, I'm sorry to tell you that no one will recognize that as Jesus, and therefore, it will be seen as heresy. And so it's. So there's a. So there is a way in which we recognize something as belonging to the tradition. But you'd be surprised to what extent there's variation. And I think that the way that I see it is that innovation is neither good nor bad. Innovation is a neutral thing. Innovation has to serve a purpose. And when innovation serves a purpose, usually the strange thing that happens is people recognize it. People recognize it as being traditional, having been traditional the whole time. They have the feeling that. That they've seen it before, but they haven't so it's like, I've created images which absolutely never existed before in the church. But I've never had anybody complain because they'd say, the spirit in which I did it, the reason for which I've done it was, was in order to. With love towards the community. It's like, I don't want. My purpose isn't to, like, show you that I'm, like, you know, call attention to myself, show you that. That I'm better than you, that I'm smarter, that I, you know, I thought of this new thing that I want to kind of shove into your face. It's like, no, I want to serve this community. I want to participate. And so a good example would be. So, for example, in the Orthodox Church, we have an image of the resurrection. So we have an image of Christ going into death and saving Adam and Eve, right? You see Christ holding Adam and Eve. He's like, pulling them out of death. And so then we also have the image of the crucifixion of a cross. And so at some point I started making crosses that had that image on it. And I'd never seen that ever. And I don't think that actually exists. But no one ever said anything. It was totally fine. And so priests started wearing crosses with this image on it. And no priest in the history of the world had ever worn a priest with that image on it. But it was totally fine because it's like, I'm not putting a cat there. I'm not putting Justin Bieber. I'm, I'm. I'm. I'm doing something which is like. It's like a. It's like a poetic reformulation of something you already participated in, right? It's like. It's like, oh, wow. Yeah. An image of, of. Of. Of the descent into death on the cross. Like, maybe they don't even think it, they just see it and it's like, yeah, that makes sense. So I think there's a lot of that where it's a lot of the problem that modern religious art has had is that it doesn't. It acts out of the sense of genius, like the sense of trying to keep up with the times. Like, it's not acting with the desire to integrate and to make something participate in the community. But if you do that, you'd be surprised at what you can do. You can actually do quite a bit."}
{"episode_id":"SW - #286 - 2023-05-16 - Music and Pattern (Royal Northern College of Music Q&A)","start":3834.92,"end":3863.65,"speaker":"Unregistered: Interviewer","text":"I think it was Isaac Newton, who always carried a Bible underneath his arm or something like this. Just like this idea of, like, constant, Constant serving his genius to something Higher than him. Magnus, in the chat, asks a mystical question. He says, do you experience something under the symbolic layer? Something ineffable, numinous and hard to define, but something which can be experienced in the body in moments of silence and depth and be transformed."}
{"episode_id":"SW - #286 - 2023-05-16 - Music and Pattern (Royal Northern College of Music Q&A)","start":3864.69,"end":3998.56,"speaker":"Jonathan Pageau","text":"And so I, I, Yes, I do. I do believe in that. And so I think the best way to understand that is that is the source of the. Actually the symbolic patterns. So you can understand that, let's say at the core is something like a. That they had transcended, transcended something, Something which actually cannot be described, something that cannot be said, something that cannot be expressed. And you can access that. You can have access. You can have access to those experiences where you all of a sudden feel transported into that space. But then what happens is that when it expresses itself, so as soon as it expresses itself, when you, when you talk about it, when you, when it comes back down into your art or when it comes back down into the world, that's. It actually will inhabit this, this kind of symbolic world. And so, yeah, so I do think so. And I think that you can actually. I think you can actually know the difference between someone who's had a true mystical experience and someone who's had somewhat or a twisted mystical experience. Is that often that one, the person who's had the twistical mystical experiences comes back from that experience and wants to destroy the world. Like, they're. Like I experienced the, Everything I experienced, like the mystical, you know, you know, in effect, ineffable root of being. And now nothing matters. Now all of this is trash. Like the whole world is just Maya. Like the whole world is just illusion. And, and none of these, none of these things matter. All your religions, all your communities, all your things, they're all nothing, right? So there is. You see it like you, can you, if you, if you, if you listen to people, sometimes you'll hear exactly that tone. And to me it's like, well, I think you're on the wrong side of the bed. Because like, if that, if there is something ineffable behind phenomena, then it is the source of phenomena. So it should actually fill phenomena with this kind of unsaid, but not destroy it. Like, anyways, so that I, I tend to, I tend to always keep that in mind when I listen to people who talk about that."}
{"episode_id":"SW - #286 - 2023-05-16 - Music and Pattern (Royal Northern College of Music Q&A)","start":3999.68,"end":4060.29,"speaker":"Unregistered: Interviewer","text":"I'd love to get your thoughts on psychedelics. We talked yesterday. This is something I really want to chat. Yesterday we talked with Karl Rook, who is one of the authors of the Road to Eleusis, and One of the experts on the Eleusinian Mysteries, we were talking to him about the difference between. So in terms of altered states of consciousness and sort of mystical experiences and this kind of thing. We were saying, we were comparing, say, playing a musical instrument to sort of achieve an altered state of consciousness, but requires a level of skill, dedication, discipline, practice, this kind of thing. But taking a psychedelic is very easy and it does something to you, which people come back and say that was a mystical experience. Do you think that there is a fundamental difference between something like, how would you say, genuine religious illumination or mystical experience and the kind of experience that people describe coming back from psychedelic chances?"}
{"episode_id":"SW - #286 - 2023-05-16 - Music and Pattern (Royal Northern College of Music Q&A)","start":4060.85,"end":4216.75,"speaker":"Jonathan Pageau","text":"Yes, I do think so. I. I think very much so. I. I do think that it's like, for all the love of the people that I. That, I mean, that I exchange with today, it's like, psych. Everybody's talking about psychedelics. It's just. Everybody talks about it and. And I feel like. I feel like it's misplaced and I feel like it's dangerous. So. So a good, A good example, the Elesini, Eleusinian Mysteries is actually a good example of this very problem, which is that let's say the Eleusinian Mysteries had a psychedelic in their ritual, right? And so people tend to think that that's true, and they tend to think they have proof of that. If the Elysian Mysteries had a psychedelic, the Elysian Mystery lasted, I think, was it three days? Three days of rituals and fasting and attention and maybe like sleeplessness and whatever it is that they did it. Like a whole huge ritual that lasted days and also lasted a millennia in time. And so if at the end of that to tip them over, whatever, they took some kind of substance, now why the hell is everybody just talking about that substance now? Now that's all people care about. It's like, what's the formula? What's the chemical formula? Like, what's the. What's the chemical? Right, Because. Because exactly. That we just. We're just that we. We're. We're. I mean, we're materialists and we. We think that that's. That that's what transcendence is. It's like, you know, and so I've seen. So. But I'm not saying it's complete. I've never taken psychedelics, right? So. But I have met people that have taken psychedelics and it transformed their life for the better, to be honest. I admit them. I've also met psychedelic people who've taken psychedelics and that it turned them into Psychos, like, just turn them into complete psychos and they lost their. They lost their family, they lost their jobs. They became. They just lost it. And so, like, whatever psychedelics are, if they rip the veil away or whatever, I think that, like you said, I think that the discipline of practice, whether it's prayer, whether it is music, whether it is, you know, dance, whether it's all these different things, is. Is far more integrated and far more useful for your life than just having, like, a tourist experience in the, in the transcendent. It's like, here I am, you know, some tourists walking and walking through this world of spirits, man. I don't know, it just, to me, like, it just sounds very dangerous also because I have met people that have just completely lost their lives because of the. Because of them."}
{"episode_id":"SW - #286 - 2023-05-16 - Music and Pattern (Royal Northern College of Music Q&A)","start":4217.72,"end":4220.12,"speaker":"Unregistered: Interviewer","text":"Thank you very much. Winnie, did you have a question?"}
{"episode_id":"SW - #286 - 2023-05-16 - Music and Pattern (Royal Northern College of Music Q&A)","start":4220.28,"end":4267.66,"speaker":"Audience Member","text":"Yeah, I did. I will backtrack our conversation a little bit. So earlier when we were talking about modernism, and also when you were talking about innovation, you sort of brought up twice in different ways. You sort of talked about this concept of having something new, whether it's caused by extreme visions or where it's caused by, like, just fresh ideas, and then sort of finding that is more traditional and compatible with it, and then sort of marrying those two as sort of the middle ground. How do you identify what is compatible with what? Is there some sort of identifiable law or pattern behind that?"}
{"episode_id":"SW - #286 - 2023-05-16 - Music and Pattern (Royal Northern College of Music Q&A)","start":4268.78,"end":4485.8,"speaker":"Jonathan Pageau","text":"Yeah, I think there are. There are, there are in the sense of. There are in the sense of the practicality. You know, I think that's one of the reasons why I talked about this idea of, like, embodiment in a community. And so that is usually part of it. And so I think the. One of the. I mean, I. It's not easy because it's like the, the opportunities to create embodied works of art right now are very, Are very, you know, far in between. Not like something that we, that we can do. It's not like a lot of people get commissioned to, like, write, you know, a piece of music to celebrate the anniversary of something or whatever. Like, it's, it's difficult for that, that to happen. But like, usually that would have been part of the, the, the meat of the, of the art, right? Part of the, the consistency of it would have been its integration into its purpose. So, like, what is its purpose? So, like, let's say I write a piece of music for a dance is not the same that if I write a piece of music as a national anthem, right? If I write a piece of music in a Church. It's not the same as if I write a lullaby for a child. Those actually are recognized by people as participating in their world. So there's a part of it which is objective, which I think has an objective pattern. And so it's like lullabies usually aren't fast and fast tempo. They. They're slow. And, you know, they have a kind of way to. To modulate sound that. That is appropriate to the. To their. To their use. But then there's also just the historical reality of what you live in, right? The world in which you live has certain traditions of. Of sonority, certain traditions of space, certain traditions of images that you just kind of. You just kind of continue and you. You. You participate in. Now, in terms of an actual pattern, usually the pattern is like. You can understand it like a wave. You can understand it like a circumambulation, right? So you start at the center, you move out, and then you return to the center. Not exactly the center. Maybe another point which is similar to it that tends to be the pattern of pretty much everything. All stories tend to have that pattern. Images have that pattern in space. So they have a central focus, and then they'll have an edge or a margin, and then that edge or margin has characteristics, and the central focus has characteristics. And so that's the way that I would see it in terms of music. I don't know, like I said, the technical aspect of it enough, but usually that's the way that's the pattern. You can impress it different ways. It can be a mountain, like a coming up or coming down the mountain. It can be, like I said, it can just be this. Like a. Like a serpent moving around an axis. So it's like a pattern that cycles and returns. It changes a bit and cycles and returns and changes a bit. So a mix of recognizability and difference, right? So if you have enough of that, like, I mean, I think Bach is the best for that. Like a fugue is. Fugue is like almost like the perfect vision of that, right? It's like he. He gives you something, he states it, and then he's like, let me play with this. And he plays and he plays and somebody. You're like, where. Where is this going? I don't even know what's going on anymore. It's like. And then all of a sudden you're like, wait a minute. No, no, no, I see it, I see it, I see it. It's coming, it's coming. And then all of a sudden it comes. Not exactly Maybe even the way you wanted to. And it's like that's. That's like probably in terms of the way I would understand, like, in terms of music, one of the best versions."}
{"episode_id":"SW - #286 - 2023-05-16 - Music and Pattern (Royal Northern College of Music Q&A)","start":4485.8,"end":4552.74,"speaker":"Unregistered: Interviewer","text":"Of that pattern, just coincidentally, next door, someone's playing the piano. They're playing a mystical piece by Scriabin. And it just made me think of something Scriabin wrote in his diary, because he was very interested in this sort of fun. Similar to. You talk about, like, the Orthodox, the theodic, this idea of, like, sort of becoming sort of united with God. But Scriabin writes in his diary, I am God. And this is. This is something that I think could potentially be a problem with this sort of new understanding of religion as a sort of symbolic language that people will try. And like, we were talking earlier about, like, the modernists, like, they try and create the music instead of discover it in this way with religion, people are sort of. I worry that people will start to create religions out of this sort of symbolic substrate. Do you think. Do you. Do you worry about the same thing? And how do you. How do you. Just on top of that, like, how do you then defend a religious belief without it being attached to something? Like a dogma?"}
{"episode_id":"SW - #286 - 2023-05-16 - Music and Pattern (Royal Northern College of Music Q&A)","start":4552.98,"end":4773.22,"speaker":"Jonathan Pageau","text":"Yeah, I mean, I see it happening. It's happening now. It's happening all the time. Like, the religious is crashing back into our world, you know, with speeds that are hard to. That are hard to deal with. And it's happening in ways that are very. That are kind of chaotic and kind of messy. So, you know, we saw during COVID Covid was an accelerate, like an accelerant of religious patterns. I mean, it was nuts in terms of watching, you know, taboos get set up and then, you know, scapegoating. And then also George Floyd during. During the. During COVID it was crazy. It was like it was a religious event. I mean, it was circumambulation and. And. And like, you know, kind of ecstatic union after fasting. So think about it, like, people had been, like, isolated in their houses for months, and then someone gets sacrificed. And then all of a sudden it's like. It's like. It's almost like Dionysian in terms of. Of what was going on during George Floyd. And so we're seeing it happen all around, and it's. It's kind of, you know, it's scattered and it's messy. And so I think that it's. That we are definitely in danger of seeing because religious patterns. You know, it's like religious patterns are super dangerous. Like, they're so dangerous. So like most dogma, like dogma and rules and taboos, like, you know, thought out taboos and rituals are there in some way to mediate the religious in the world because it tends to burn like a fire, right? If it comes through, it's not. It can leave. You know, if you, if you read the Baccha. The Baccha, you can see what religious patterns do. If people kind of let themselves go to that inebriation, you know, it leads to sparagmos, right? It leads to ripping a part of the world. And so I do think that we're definitely in danger of seeing that happen. And we have, I think Covid was really an example where we could kind of see a glimpse of what was possible in terms of religiosity in a secular kind of technological world. And so I do think that. I do think that dogma is actually a good thing to a certain extent. Like if dogma is. If dogma is. Is understood in its proper place. Right? And so, you know, for example, in orthodox Christianity, we have. We have a creed, we have a statement of faith, we have things that we believe. And we also understand that it's apophatic, which is that these are not positive statements. They are in some ways protective statements or negative statements to avoid us from becoming crazy. But ultimately the transcendent is beyond that. So God is beyond, like, it's like, you know, I can. I could. I'd say I believe, definitely believe in the Holy Trinity, but I could also say God is not a father or son or a spirit. Like, that is not heretical at all because we know that these are kind of negative statements to help us understand. So I do, I do think that dogma in religion is. Is inevitable and necessary because without it, it leads to like, like New age insanity, right? It leads to. It leads to like crystal, like just, you know, cults and, and gurus and like, you know, like neo tantric, like madness that we've seen happen in the past, you know, you know, 10, 20 years, which leads to really, I mean, it really destroys people. Like, I know people that have been destroyed by Neo Tantrism, like, really, like, psychologically messed up. So I think a lot of the. So I do think that dog was important because. Or else. Or else we're. We're in trouble. So sorry. I hope I'm not disappointing you guys too much with that."}
{"episode_id":"SW - #286 - 2023-05-16 - Music and Pattern (Royal Northern College of Music Q&A)","start":4773.78,"end":4847.75,"speaker":"Audience Member","text":"Well, I come from a very religious country, from Sri Lanka, and the biggest religion is Buddhism. And there are, you know, there's Christianity and Islam, but There was always a respect for each other's religion. But as I came to England, especially to university, it could be because I lived in such a religious country. I saw so many forms of religion in university, in the secular form. Meaning, oh, here's a belief. For example, gender is a spectrum. You have to believe it. If not, you will be, you know what, in the old days is a heretic, and these days a bigot or something like this, or you need. Or. I see even there's this kind of negative view on white male, as if the white male is the worst thing to exist and all opportunities are given based on, you know, sex or based on color and not anymore on merit. So I feel that it wasn't the conversation I wasn't expecting coming to the West. But in the west, how do you think we can have just more conversation between different beliefs and just more respect for different beliefs?"}
{"episode_id":"SW - #286 - 2023-05-16 - Music and Pattern (Royal Northern College of Music Q&A)","start":4848.71,"end":5099.14,"speaker":"Jonathan Pageau","text":"Yeah, it's hard. I mean, because the. The religion, let's say the. Let's say the ascendant religion, you know, right now I would say there are different versions, but that the woke kind of ascended religion is definitely one. Like, it's definitely one. It's. It's part of. It's part of it because it has a. It has a kind of a zeal. Right. And. Right. It has that, that, that, like, fundamentalist zeal where you can't question. There's certain things you can't say. Like if you, if you. If you ask, even just ask questions about certain things, like there's a. There's a kind of, you know, fire, divine fire that just like rushes out of people. And so I think. I think we're definitely in that. In that world now. It's really a problem because, you know, all religions will exclude. Like, all religions will have dark skeletons in their closet. But the way religions are set up is not arbitrary. And so they actually have. There's a reason why they're set up the way they are. And so, for example, if you take. I mean, I'm a Christian, so obviously I understand Christianity better. You know, the notion of Christ, for example, the notion of the crucifixion, right. Is in some ways a way to safeguard against the things we're seeing now, which is that it's like I see myself as the one who crucified Christ, for example, right. I see myself. I see in the one that is beaten and rejected and refused. I see in them an image of God. And then I try not to do that, let's say. But now we have this. It's like a weird. The modern one is almost like a weird parody of Christianity where Christianity has always had a deep compassion for victims and a deep desire to love the oppressed and the marginalized. But now it's like being weaponized, where it's like, let's flip it upside down. Where now the marginalized and the oppressed, you know, have the right to demand of the. Of other people this. Have the right to, let's say, exclude the others. And so we were returning to more of like an ancient, like, religion of purity. Like almost like a. Yeah, you know, you know, in the Jewish temple, for example, in the Hebrew temple, you know, strangers weren't allowed in to the temple at all. Like they weren't allowed to come in. And so it's like we're returning to that type of behavior. So, yeah, hopefully. I mean, we all hope that it'll just kind of play. It'll play out without too much violence, I guess, is the. Because in some ways it can't. I don't think it can sustain itself, that type of thinking on the long term. But yeah, we're in a strange situation, that's for sure. But actually the solution, I think though the solution, and this has been a solution that I've been proning, is to help people understand the function of the margin and the exception and the strange. And so, you know, I talk about monsters a lot. I talk about margins and I talk about idiosyncrasy. And it's like, you know, I talk about carnival in a lot of my talks about the function of carnival in a traditional society. And so it's. I think that. Because what happens is that the right or the, the conservatives or whatever, the people reacting to this woke thing, I mean, they just go full on too. And it's. Oh, so you just create these two, these two opposites that just can't talk to each other. It's horrible. And I think the best way would be to help people understand the role of the strange, but then also understand that it's strange for a reason. It's like the margins are marginal and the marginal has a function in the world and that function has positive and negative aspects to it. And it's like if you want the positive aspects of the margins, you kind of have to live with the negative aspects of the margin. If you want the positive aspects of the center, you have to live with the negative aspects of them. So you can't have it all. You can't be a margin and a tyrant at the same time. That leads to absolute madness. So we need to find, I think, the proper balance."}
{"episode_id":"SW - #286 - 2023-05-16 - Music and Pattern (Royal Northern College of Music Q&A)","start":5100.34,"end":5111.24,"speaker":"Unregistered: Interviewer","text":"Just as an Orthodox Christian, you were saying dogma has its place. Do you think then that right action or orthopraxy requires Orthodoxy?"}
{"episode_id":"SW - #286 - 2023-05-16 - Music and Pattern (Royal Northern College of Music Q&A)","start":5112.12,"end":5188.06,"speaker":"Jonathan Pageau","text":"I think so. I mean, I think they go together for sure, because, you know, the. The. Especially in Orthodoxy, in other types of Christianity, maybe not so much like in Orthodoxy. It really is the liturgy, you know. And so. So, for example, like, we sing the Creed during liturgy, but we don't just abstractly think it. We sing it together. And so as we sing it together, we're manifesting our unity. And so that's actually moving us towards communion. That's why, you know, in the Creed, for example, its place in the liturgy is moving now because there's the first part of the liturgy, which is. Which used to be for kind of everybody, and then there's the second part of the liturgy, which used to be just for the people that are baptized. And so the second part of the liturgy is like this move, like compression, moving towards the meal, where we all share the same, you know, the same sacred meal. And. And I think that we have to understand that the Orthodoxy and the. The orthopraxy, they just. They just go like that because it's a celebration of what we have in common, both in practice, you know, and in love of one another, but also in mind to a certain extent, and then kind of moving towards the communion, childhood. So, yeah, I think you need both."}
{"episode_id":"SW - #286 - 2023-05-16 - Music and Pattern (Royal Northern College of Music Q&A)","start":5191.26,"end":5204.22,"speaker":"Audience Member","text":"What is your opinion on the current movement of spirituality without religion? Do you think those two things are separable?"}
{"episode_id":"SW - #286 - 2023-05-16 - Music and Pattern (Royal Northern College of Music Q&A)","start":5205.1,"end":5343.03,"speaker":"Jonathan Pageau","text":"No, I don't think they're separable. And the reason why is, you know, we talked about this fractal pattern. You know, we talked about how these patterns of the world, they kind of exist at different scales. And one of the problems with the, like, spiritual but not religious is that the spiritual but not religious person says, I don't want this spiritual pattern to bind me to others. I just want it to be my own individual thing. And so the only way for it to bind you to others is through common something. That's how you're bound to others. You're bound to others through common action, through common attention, through common singing, through common movement. And so that's religion. I don't know what to tell you. And so if we stand together, if we sing together, if we process together, if we bow together, if we do the things that we do together, then the spiritual is not just binding me as an individual, but it's binding me to my family. And my family to a larger communion, et cetera, et cetera. And so the spiritual but not religious is just another version of modernism because it doesn't like the fractal relationship it wants to reduce to the individual. It's like I want to be. I want to be an individual in relationship to the transcendent, complete transcendent. Right. And see that, that extreme that I mentioned, it's like I want like the absolute transcendent, like, you know, non being of nirvana. And I just want it me, I don't want it to bind me to others. Like, I just want it to be me. And so, and so I don't think, I don't think. I mean, it's better, like I'd prefer spiritual but not religious to. I don't know, to someone who goes dancing at the club every day. Like, you know, it's like I prefer someone who has spiritual practice, even if there's, if they're idiosyncratic and personal, rather than someone who drinks, you know, gin all night. Like, you know, it's like there's a hierarchy of things. But I do believe that true spirituality will have religion attached to it because it's a binding agent."}
{"episode_id":"SW - #286 - 2023-05-16 - Music and Pattern (Royal Northern College of Music Q&A)","start":5343.5,"end":5343.86,"speaker":"Unregistered: Interviewer","text":"In a way."}
{"episode_id":"SW - #286 - 2023-05-16 - Music and Pattern (Royal Northern College of Music Q&A)","start":5343.86,"end":5355.34,"speaker":"Co-interviewer","text":"It's the same answer as you gave before. It comes from pride, isn't it? Spiritual without religion, in a way, is like wanting to keep the meaning without accepting the truth."}
{"episode_id":"SW - #286 - 2023-05-16 - Music and Pattern (Royal Northern College of Music Q&A)","start":5355.82,"end":5446.89,"speaker":"Jonathan Pageau","text":"Yeah. And without having to submit to authority. A lot of it's that too. It's like, well, I don't want to submit to any authority. I just want to have my own experiences. And, you know, it's like I want to have my own thing, but that's just not how the world works. You know what happens actually, and I know it sounds weird, it's like what happens is the opposite. It's like you're going to end up submitting to authorities that have never existed before. We're going to end up submitting to levels of authority that have never existed in the history of the world. Like, we're moving towards like weird authoritarian systems that are. That are going to be total. And it's like it goes together like the extreme. You know, I always say, like, a punk rocker can only exist in a world that is completely buffered and completely controlled and completely maintained on a schedule. Because if you put a punk rocker in the Amazonian jungle, like, they'll die in one day, two days, because they're not bound. Like. So you need these extreme systems of like, control. And so if you, if you, if you try to Move towards idiosyncrasy. And you're like, I just want me to. My spiritual thing, my own thing, I'm just going to take a hodgepodge or whatever I want. It's like you're creating that rift and what's going to. And it's, it's actually, it's going up too. It's going to, it's going to create. Yeah. Systems of control and it sounds weird, it sounds like it's a contradiction. But if you look, if you think about modernism that way, it actually will solve a lot of problems for why modernism happened the way it did. Because that's what it looks like."}
{"episode_id":"SW - #286 - 2023-05-16 - Music and Pattern (Royal Northern College of Music Q&A)","start":5448.41,"end":5458.18,"speaker":"Unregistered: Interviewer","text":"If dogma is necessary or a relationship with the transcendent. How then do we avoid the dark side of dogma?"}
{"episode_id":"SW - #286 - 2023-05-16 - Music and Pattern (Royal Northern College of Music Q&A)","start":5458.82,"end":5516.14,"speaker":"Jonathan Pageau","text":"I mean, saints. I don't know what to tell you. It's like, I mean, you need developing your own life instead of focusing on others. Like, I think that's probably the best. It's like, like loving others and then, you know, seeing sin in myself. I mean, that's for sure. Like I'm docking way more from a Christian perspective. I'm sorry, but I think that from a Christian perspective there's a joke about how. There's a joke about how Protestants think that no one's going to heaven except for me or except for my gang. And there's a joke in orthodoxy which is that everybody's going to heaven except me. That's probably the best approach, right. Is to see your own sin and to, to, to, to. To always focus on your own, on your own lack. And then, and then, and then you probably will be able to avoid the problems of dogma if you do that."}
{"episode_id":"SW - #286 - 2023-05-16 - Music and Pattern (Royal Northern College of Music Q&A)","start":5516.38,"end":5516.94,"speaker":"Unregistered: Interviewer","text":"Brilliant."}
{"episode_id":"SW - #286 - 2023-05-16 - Music and Pattern (Royal Northern College of Music Q&A)","start":5517.26,"end":5517.9,"speaker":"Co-interviewer","text":"Can I just."}
{"episode_id":"SW - #286 - 2023-05-16 - Music and Pattern (Royal Northern College of Music Q&A)","start":5518.22,"end":5519.66,"speaker":"Jonathan Pageau","text":"Sorry, sorry."}
{"episode_id":"SW - #286 - 2023-05-16 - Music and Pattern (Royal Northern College of Music Q&A)","start":5519.66,"end":5523.5,"speaker":"Audience Member","text":"It just like with the last thing you just said then. So then how do you avoid the."}
{"episode_id":"SW - #286 - 2023-05-16 - Music and Pattern (Royal Northern College of Music Q&A)","start":5523.5,"end":5526.46,"speaker":"Jonathan Pageau","text":"Psychological problems with that? What do you mean?"}
{"episode_id":"SW - #286 - 2023-05-16 - Music and Pattern (Royal Northern College of Music Q&A)","start":5526.86,"end":5531.66,"speaker":"Audience Member","text":"Just, I guess the association that like everyone is going but me."}
{"episode_id":"SW - #286 - 2023-05-16 - Music and Pattern (Royal Northern College of Music Q&A)","start":5532.89,"end":5646.51,"speaker":"Jonathan Pageau","text":"Yeah. It's mostly a mental state where you're just trying to not see yourself as higher than others, you know, and so we, we obviously you also, you wouldn't. If in that state you are self flagellating, then that's pride too, by the way. It's like self flagellation is pride. You know, most people that are like. Because you think, you think you're so important, right. You think you're that important that you should flog yourself. But I think that just this sense of attending to your own thoughts and attending to your own and not thinking that you should be better than you are because a Lot of the psychological problems that we have is that we think that we should be better than we are. So it's not that we actually think we're wretched, is that we think we're wretched, but we think we should be awesome. Like we should be heroes, but we notice we're actually wretched. I think that that's the problem. But if, but if you just kind of see your own sins and you're like, okay. I mean, from a Christian perspective, you just see your own sin, you're like, yeah, you know, just give it up. Like, I don't know, like when we confess our sins in Orthodoxy, we confess our sins. Like it's like we're sinning constantly. We always say, for all the sins, all the sins, you know, that known and unknown. Like all my. I don't even know that I'm sinning. Like, I'm just sinning all the time. And so if you're in that state where it's like you actually think that you're just sinning constantly so much that you don't even know how much you're sinning, it's like, and you know, it's like, are you, is there even room to self flagellate? You know, it's like you just, that's how, it's how it is. And so all you do is you kind of just give up and you just, you know. Yeah. So I hope that, I hope that. But it's like, by the way, I don't do that because I'm not a saint. I've got a lot of pride. Don't worry. Like, I'm not. I hope, you know, I'm a hypocrite. Like, that's for sure. I just hope that's clear."}
{"episode_id":"SW - #286 - 2023-05-16 - Music and Pattern (Royal Northern College of Music Q&A)","start":5648.27,"end":5662.83,"speaker":"Co-interviewer","text":"Oh no, it was. I guess it's a question to both of you because you seem to be in agreement. You met. You were saying, you were talking about the problems of dogma or the dark side of dogma. And I wonder if you could elaborate on what this is."}
{"episode_id":"SW - #286 - 2023-05-16 - Music and Pattern (Royal Northern College of Music Q&A)","start":5663.39,"end":5759.31,"speaker":"Jonathan Pageau","text":"No, but the dark side of dogma is that it gives you an insight to judge other people. That's what it is. It's like, it's like as soon as you, you, you have something which binds you. And it's not just dogma, it's the problem of any unity. So as soon as you have something that binds you together, as soon as you have any group, anything that you see in that you see that you have in common with others and binds you, that immediately creates an outside. There's no way around it. You can't. You can't have it all, right? Like, I know that a lot of the, like, weird postmodern move is to just try to integrate everything into everything, but that doesn't work. It destroys the world. So you could see it in all kinds of things. If you think of a sports team, a sports team will have things that bind them together, and then they will have adversaries that are outside them, that they're fighting. And so that's part of any type of unity. Now, the problem with religion is that it does that, too. It does it in the absolute, because it's like, I have access to God through this, and so now it gives me ultimate weapon to, like, to judge other people if I. If I let myself go to that. So that's the danger of dogma. And I think. I mean, I do think that. I think that we have the tools, you know, I know for sure. I think for sure, within Christianity, we have the tools to fight that. And I think part of the nature of Christianity is. Is to avoid that problem in. In the image of Christ himself and the Sermon on the Mount and all these. These aspects. But that's definitely an issue. And, you know, if you. You'll catch yourself doing it all the time."}
{"episode_id":"SW - #286 - 2023-05-16 - Music and Pattern (Royal Northern College of Music Q&A)","start":5759.79,"end":5760.35,"speaker":"Audience Member","text":"Thank you."}
{"episode_id":"SW - #286 - 2023-05-16 - Music and Pattern (Royal Northern College of Music Q&A)","start":5762.59,"end":5774.51,"speaker":"Audience Member","text":"And so I think it's come up a lot tonight that pride is kind of, sort of behind a lot of the sources of, I don't know, many problems to say, at least. So what's. So what's your antidote to pride?"}
{"episode_id":"SW - #286 - 2023-05-16 - Music and Pattern (Royal Northern College of Music Q&A)","start":5775.55,"end":5881.75,"speaker":"Jonathan Pageau","text":"I mean, I think I just formulated it, right? I think it's. It's to. To try to see your own lacks first, right? To try to see what you're missing yourself. And so practicing humility in the sense that, you know, if you see, like a. An easy. An easy trick to do. And it's like, when I'm in my best moments, I can do this, but it's not often, but, like, usually you catch yourself thinking something, right? You know, you know, you look at someone and you catch yourself kind of judging them or, you know, whatever, or even if you're in a relationship, you catch your. You know, you judge your. Your. Your partner. And I think it's like the discipline of right away asking yourself. It's like, could I say the same thing about me? Right? And so it's like, you know, someone lies, and you're like, yeah, they're lying. It's like, yeah, do I lie? Yeah, okay. Yeah, okay. So it's like, I'm not saying that this let's say the thing that's happening to me, or let's say someone's doing something to you, it's like it doesn't justify it. It doesn't mean you'll justify, but it's like, it's like, have I been crappy to others, right? You know, have I lost my temper? Have I. So it's like so just kind of remembering yourself in a way so that, so that you. So then what it does is it kind of mediates. I think the issue now, I'm not saying you should. It doesn't mean you should accept everything. I don't think so, unless you're really like a monk or something. But it, I think that it just the discipline of always asking yourself what aspect of what bothers me? Because often the worst part of it is that sometimes when something bothers you with someone, usually because you've got a little seed of that yourself, right? And so it's like, oh, that person's really cocky. It's like, really, why are you noticing that? You know, like, you might have a little bit of that yourself. That's why you're noticing it. And so, yeah, so I would say that that's probably the best, the best way to go about that."}
{"episode_id":"SW - #286 - 2023-05-16 - Music and Pattern (Royal Northern College of Music Q&A)","start":5882.23,"end":5898.36,"speaker":"Audience Member","text":"I think Jonathan gave a solution earlier as well as he was talking about sin and catching yourself sin all the time. And then, you know, when you see your, you know, sitting all the time, just kind of give up. And that's also surrendering to your higher power is also Megan to do."}
{"episode_id":"SW - #286 - 2023-05-16 - Music and Pattern (Royal Northern College of Music Q&A)","start":5901.48,"end":5914.92,"speaker":"Audience Member","text":"What's not quite making sense to me is that this at the end of the day still sounds psychologically detrimental because it's still referrals like self referential, like in. In all the examples that you have given."}
{"episode_id":"SW - #286 - 2023-05-16 - Music and Pattern (Royal Northern College of Music Q&A)","start":5914.92,"end":5973.53,"speaker":"Jonathan Pageau","text":"So maybe I could. Maybe I could, I could, I could take the same thing that I said, but now flip it the up the other way, which is that what if. What if every time you. You come in the morning and then there's someone who's impatient or there's someone who's annoying or whatever, then maybe try to notice something about them that, that, that is positive. Do it that way. Do it. Do it the other way. If you don't like the, like the seed on yourself, like, just try to remember that that person is a human being that has a life and experiences and that you know, that, that. So if it's hard for you to say, to see how you're the same in terms of the negative part, you can maybe rather try to see the mirror. You Know, the mirror of the good in the other person. I mean, there's. I'm not saying that it's. It's always possible, but. But I would say that that might be. Yeah. A better. Maybe another way to do something similar that would be also kind of humility."}
{"episode_id":"SW - #286 - 2023-05-16 - Music and Pattern (Royal Northern College of Music Q&A)","start":5974.25,"end":6009.24,"speaker":"Co-interviewer","text":"Could I add just one thing that Peter Kraft. I'm sure you. Maybe you've talked to him personally, I don't know, but Peter Kraft really showed in an interview or a book. I don't remember that humility is an arrow that points outwards, whereas pride is an arrow that points inwards. And so I think it's in this sense that the over judging ourselves and over criticizing and this posture of I'm so bad, I'm. It's really me, me, me, me, me."}
{"episode_id":"SW - #286 - 2023-05-16 - Music and Pattern (Royal Northern College of Music Q&A)","start":6009.4,"end":6009.96,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #286 - 2023-05-16 - Music and Pattern (Royal Northern College of Music Q&A)","start":6011.48,"end":6017.24,"speaker":"Co-interviewer","text":"To put it very simply, humility is whatever points outwards."}
{"episode_id":"SW - #286 - 2023-05-16 - Music and Pattern (Royal Northern College of Music Q&A)","start":6017.56,"end":6056.05,"speaker":"Jonathan Pageau","text":"And I remember hearing the Dalai Lama actually say that someone asked him about. About people who are. Are shy. And he said, it's pride. It's like it's fried because you're too self conscious. You're thinking about yourself way too much. Right. You're. It's like you think you're so important that people are looking at you. Like, you think people are, like, concerned with you and your presentation and all these things. And, like, that's what makes you shy. It's interesting. I mean, I don't know if it's. If it's completely true, but I just thought it interesting that he totally, like, switched it in terms of the way we think of it now. Yeah."}
{"episode_id":"SW - #286 - 2023-05-16 - Music and Pattern (Royal Northern College of Music Q&A)","start":6057.09,"end":6093.61,"speaker":"Audience Member","text":"Mention that because, like, when you mentioned the pride and then answer those, and then humility instantly reminded me of. There's a cartoon called Avatar, the Last Airbender, and there was a quote in there, like, with a Hyrule, basically saying paraphrasing pride is not the opposite of shame, but its source. The only true humility is the only antidote to pride. So it's interesting how it's basically exactly what I would just."}
{"episode_id":"SW - #286 - 2023-05-16 - Music and Pattern (Royal Northern College of Music Q&A)","start":6094.65,"end":6095.13,"speaker":"Audience Member","text":"Yeah."}
{"episode_id":"SW - #286 - 2023-05-16 - Music and Pattern (Royal Northern College of Music Q&A)","start":6095.77,"end":6111.56,"speaker":"Audience Member","text":"I think something could be said about beauty for that as well, because true beauty is always taking you out of yourself, isn't it? And what you were saying earlier about modernism is that it's just inward and not pointing to something outward."}
{"episode_id":"SW - #286 - 2023-05-16 - Music and Pattern (Royal Northern College of Music Q&A)","start":6112.68,"end":6162.46,"speaker":"Jonathan Pageau","text":"Yeah. Yeah. Well, there's definitely an aspect of modernism that's like a kind of radical, you know, a radical subjectivity, you know, and so it's like you go to a museum and some artist has their whole thing, like, they just have. They probably wrote books and books about the thing they're doing. And then you walk up to it, and it's just. I don't know, it's like strands of hair hung from the ceiling, right? And. And it's like. And it's like, yeah, this person spent, like, 20 years working on this project. And it's like. And then it's like, white. So really, I should care. Like, I should care enough about your little idiosyncratic world to, like, dive in and, like, discover all the references that you're like, I'm sorry, I just don't have the energy for it. And also, like, really? Are you gonna subject me to that? Like your own little. Like your own little idiosyncratic world? I don't know. Not interested."}
{"episode_id":"SW - #286 - 2023-05-16 - Music and Pattern (Royal Northern College of Music Q&A)","start":6163.26,"end":6171.58,"speaker":"Audience Member","text":"Yeah. Then along that line, like, if everything points outwards, like, to me, that sounds a lot like compassion, Right. In a sense that everything should sort of."}
{"episode_id":"SW - #286 - 2023-05-16 - Music and Pattern (Royal Northern College of Music Q&A)","start":6172.62,"end":6173.74,"speaker":"Jonathan Pageau","text":"Yeah, there you go. Good."}
{"episode_id":"SW - #286 - 2023-05-16 - Music and Pattern (Royal Northern College of Music Q&A)","start":6175.1,"end":6187.97,"speaker":"Audience Member","text":"And for us as musicians, then, do you think that our. How do we, I guess, be compassionate performance? Are we in service to our own audiences? Is that compassion?"}
{"episode_id":"SW - #286 - 2023-05-16 - Music and Pattern (Royal Northern College of Music Q&A)","start":6189.17,"end":6283.05,"speaker":"Jonathan Pageau","text":"I would hope so. I mean, I would. I think that you have to be careful, like, when you say, service your audience, of course, you. There's like a. There's a balance. I think there's a balance because also, you're trying to, like, let's say you. You make a piece of art. So on the one hand, you are trying to. To, let's say, reach out. Let's have compassion for your audience. But there's also a way in which you're also trying to kind of take them by the hand and kind of pull them into something. There's. So there's a. There is both. There's like, both. You know, you can find, I think, a nice middle ground because, you know, I think that modern pop composition is like. It's like the worst of trying to please the audience because they're just like, you know, what can I get people to click on? And then, you know, it's just like, things. Songs appear and then vanish, you know, within a few months. But it has to do with that problem of, like, trying to, like, really hit what people want right now, you know, and just kind of give them what they want. But I think that true art is not. That is not like that. Like, there's a. There's a. Yeah, there's a balance between, let's say, kind of teasing. How can I say this? It's all. It's. I mean, you think about it really like a meal, right? It's like. So I'm. I will. I'm Offering something of sustenance to the person. But then I will have spice in it in order to make it attractive and make it taste good. But there also has to be, like, substance to it, you know, so element."}
{"episode_id":"SW - #286 - 2023-05-16 - Music and Pattern (Royal Northern College of Music Q&A)","start":6283.05,"end":6287.45,"speaker":"Audience Member","text":"Of you inputting parts of yourself to."}
{"episode_id":"SW - #286 - 2023-05-16 - Music and Pattern (Royal Northern College of Music Q&A)","start":6287.93,"end":6356.34,"speaker":"Jonathan Pageau","text":"Well, that's going to happen inevitably. I tend to think people shouldn't put too much effort into that. Like, I mean, that's like the opposite of the of. Of contemporary thinking. It's mostly in service of something. I hope, like in service of something higher. Right. In service of some. So it's like, for example, if you. If you say. I mean, I'm just thinking out loud here because it's difficult for music now, like I said to. But if you. Let's say, like, I want to bring. I want to bring joy to people. Like, I want. Or I want to. I want people to experience longing. Like, I want that them to kind of move into that experience of longing and have a sense of that. And so it's like you're serving a higher purpose. You're like trying to. You're basically like training people to have these experiences and these subtle experiences. And so. And so you want to do it in a way that they'll recognize what you're doing, that they're seeing that you're. They see the breadcrumbs, right? Or they can get the little breadcrumbs as they're moving into what you're doing. And then once they're there, then you can kind of take them on a trip. I just want you to know, I need. I have a meeting at 3. So I have, like, about."}
{"episode_id":"SW - #286 - 2023-05-16 - Music and Pattern (Royal Northern College of Music Q&A)","start":6357.06,"end":6402.31,"speaker":"Unregistered: Interviewer","text":"Yeah, I just wanted to say, just on top of what we were just talking about, which is such a beautiful part of conversation, it echoed very closely what we were talking about with John Veki, which was this idea that love is the opposite of addiction. And so this idea of pride being something that's inward and humility that's outward. John Viveki was saying that addiction is something that is reciprocally narrowing and narrowing it sort of like thing where your framing comes increasingly closer and closer, but the opposite of that is reciprocal opening. And he calls that what love is. And I think that's a beautiful line of agreement with you and John."}
{"episode_id":"SW - #286 - 2023-05-16 - Music and Pattern (Royal Northern College of Music Q&A)","start":6402.79,"end":6605.85,"speaker":"Jonathan Pageau","text":"Yeah, definitely. I think on that case we really agree. I really. Recently I've been using Dante a lot as an image of that. And I think that for art, it's probably a good image to understand, let's say, what Dante was trying to do in the commedia, which is exactly that it has to do with your question about. So you could understand that, say I make a piece of art and I do it in service of a higher good, right? You know, in the celebration of God, the celebration of love, or the celebration of something beautiful. But then I understand that, like, that people don't have access to that. And so what I do is I engage lower loves, right, in order to draw people in to this higher. This higher celebration. And so, you know, so then you can use. Let's say you almost like, seduce people into the experience. So you use tropes that people recognize or you surprise them, or you do different things, but their purpose is actually just to draw them up into something, something more. And you see, in Date, you see that because it's something like. He starts with poetry, right? He starts with Virgil. Like, Virgil is that. That lower love, these structure, these artistic patterns that we use in order to create our works, right? That's what Virgil is. That's what Virgil represents. And so it's like the craft, the. The, you know, the techniques, all these things that we have. There's nothing wrong with them. You know, especially. We have to think about that, especially in the modern world, because people have seen these techniques and these. This craft as being factitious, as being, like, tricks and things that you shouldn't use because, you know, they're cliche or whatever. But if they're in service of a higher good, then all of a sudden they find their purpose. And so you can use these techniques in order to draw people into higher loves. And so, you know, Dante moves from Virgil to Beatrice, which is a woman that awoke love in him when he was a young person. Then he moves up towards saints, ultimately towards God himself. And so it's like these embedded loves is a good way to understand it. But you can also understand that in art, which is that. Because I remember a friend of mine who's a contemporary painter that I love very much. At some point, he was basically saying, why are you doing this, like, the icon thing? Why are you doing this stuff? It's all. It's all done. It's all been done, right? It's all these. These. These tricks and. And tropes and images that have all been done. And it's like, I can do it because I'm. I'm making an image for someone's baptism, but I can do it because I'm making an image to go into a church. Like, I have a reason that. That's an actual reason, like that this object will enter into a community, will participate in the life of a. Of a church, of a family or whatever. And so. And so the lower love, these lower aspects, these techniques, the way the lines work or the way, you know, using a halo and all these things are in service of a higher participation. And so there's no shame in using them. Right. I'm not. I'm not pretending that they are. That they are, that they are new or innovative or whatever. It doesn't matter. Beautiful."}
{"episode_id":"SW - #286 - 2023-05-16 - Music and Pattern (Royal Northern College of Music Q&A)","start":6606.09,"end":6613.29,"speaker":"Unregistered: Interviewer","text":"I think that would be a really lovely place to end, especially because you've got something coming up. But thank you so much. It's been an amazing chat."}
