{"episode_id":"SW - #354 - 2024-08-23 - The Real Reason Behind the Olympic Controversy in Women’s Boxing","start":0.32,"end":1289.24,"speaker":"Jonathan Pageau","text":"That has been the tool of the left wing since the post war era. That is push against what people find acceptable. Push as hard as you can. And if people don't react, keep pushing, keep provoking, keep provoking the categories. Keep pushing against people's standards. And then when people react too strongly, then say, no, no, no, it's ambiguous. And open up the ambiguity. Say, that's not what we meant, that's not what we're actually referencing. You know, open up the space so that you don't have an enemy to punch. And it's all very fluid and all very, very ambiguous. And then. But what you want is to find just enough reaction to be able to wedge. And if you can wedge and gaslight at the same time, it's even better. So then you can wedge and you can create two sides and you can force people to take your side and then force people to be against you. And then, like I said, if you can gaslight at the same time, it's even better because then you can say, they have no reason to attack us. Look at how defenseless we are. Look at how we're victims. You know this. They misunderstood us. And although they misunderstood us, they're attacking us anyways. And so now we feel morally justified to continue to push. And so this is exactly what we're seeing, you know, when you look at the boxing matches. This is Jonathan Peugeot. Welcome to the symbolic world. Hello, everyone. With the surprising success of my last video on the Olympics and the opening ceremony. You know, I wasn't thinking that I'd be making videos on the Olympics, but because there are other things going on with the whole question of the male, female boxing situation that is happening, and I'm seeing that explode as well. And I'm also noticing that for many people, things are a little confusing and they're not certain, you know, what is happening and why all this is happening. But there's a direct relationship between what happened at the opening ceremony and the controversy that's going on with the female boxing situation. And so I thought that it would be a good idea to talk about it, you know, maybe to help people understand the general situation. And you know, that it's not just really about male to female boxing, but. But that there are bigger things at stake. And so, as you can see, I am. I'm not in my usual place. I'm actually right now on the island of Samos. I'm here for Ralston College. All you young people in your 20s, if you don't know about Ralston College, you Should definitely check it out. It is one of the great things happening in our world today, something that is giving us hope, giving me hope. And so I'm really happy to be here to support them in any way that I can. And so one of the things that happened during the. During the opening ceremony was a celebration of gender ambiguity. And so that is what we talked about in our last video, that the use of drag queens. But it wasn't just gender ambiguity. It was ambiguity in general and ambiguity as a political tool. You could say the. The fact that the reference of the, you know, the whole gender problem that happened, the fact that there's contestation about whether or not it was the Last Supper, whether it's just the feast of Dionysus, you know, and all these people fighting over. That has to do with the question of ambiguity. It's an image of the drag queen themselves as an image of ambiguity and. And how ambiguity causes a drift between categories and causes confusion and a. You know, and that confusion can be used politically because one of the things you can do is that once you create confusion and you create uncertainty, you can wedge that uncertainty and you can force people to take one side or the other of a question. That is, of course, the culture war. And we're seeing the culture war come at full force, which within the Olympics. Now, what I hope to do is to maybe help people think through some of the things that are happening so that we don't have reactionary react. You know, just reactionary approach to the question and that we don't just take sides in the culture war, just to take sides. Now, sometimes it is important to fight for things that you. That you think are worthy and are important to fight for. But we have to be careful not to be roped in, seduced by our anger into our. Into these two camps that are set up in a manner to. How can I say this? And there are all these beautiful ways that it's being set up in this question. You know, it's. We're being forced to take sides, let's say, in a culture war. So like I said, one of the things that happened during the opening ceremony was this ambiguity that is being celebrated. It is, of course, the ambiguity of carnival and. And the drag queen is a great example of ambiguity. By showing a person that has ambiguous characteristics, you are forcing people in their. Let's say it makes reality fluid, really, in the way that the rainbow people talk about. It creates a fluid reality to you, a puzzle to you, right? So you have a being that presents itself to you, that is, showing you different characteristics that usually don't go together. And what it forces you to do is to, in some ways impose an order. And it forces you to, let's say, see the world with a certain lens. It forces you to take sides. The question is, you know, and this is, of course, the entire trans issue, is that it forces you to say, is that a man or is that a woman? But, you know, usually we do that very implicitly, but now it forces you to do it explicitly. Usually we don't talk about that. We see men, we see women. We just recognize them as such. We, we don't actually have to make a debate about it. It's not part of our discourse. It just is just, you know, experience reality. But when something ambiguous presents itself to you like a sphinx, right? This is the whole idea of the enigma of the Sphinx. The Sphinx forces you to explicitly solve the puzzle and decide what it is that is facing you. And because gender is a dual category, by presenting to us beings that are ambiguous, it forces you to decide. And when you decide, you are going to decide on one side or the other, hence the culture war, hence the conflict. And so that is why ambiguity can be a very powerful tool for, to bring about political change and to force political transformations that go, you know, especially people pushing for this type of ideology that wedges the issue and forces people to take sides in something that they never would have taken sides in. You know, think about the question of gendered bathrooms 20 years ago or 30 years ago with our parents, they wouldn't even have understood the question. They wouldn't even have. They would have been completely confused at the idea that we have to decide who goes in what bath, bathroom. Although it's not like there weren't drag queens 30 years ago. It's not like the idea of sex change operations didn't exist 30 years ago. It, it is the use of it in political discourse and the bringing of this into the public sphere and making it, you know, a hot button issue, you could say, that is forcing us to enter into this culture war. And so what happened, what is going on in the boxing situation is the mirror reflection, the exact mirror reflection of what happened in the Paris opening ceremonies. It's important that we see that because look at the issue. And so what we have are two characters, two people that are ambiguous. They present ambiguous signs. When you look at them, they present characteristics that are male, and they also have other characteristics that are female, or at least the way they dress. And, you know, the idea maybe their genitalia might not be, might not be male, but. But we're not sure. And so the person presents themselves as ambiguous. And what that does is it forces organizations to have to judge whether or not they're male or female, especially if they're going to enter into the public sphere. You know, usually in the past, gender ambiguous people kept that private. And, you know, this is something that has existed. You know, people have ambiguous sex, for example, who have deformed sexual characteristics, who, when the child is born. And this is very rare, right? These are very rare event where someone is born and then you have to decide whether or not it's a boy or girl, depending on the characteristics they present. It seems like, you know, maybe one of these people at least has some kind of condition that is similar. We don't know. I don't want to decide what their condition is. That's not the point. That does what doesn't matter. But when you put someone like that into the public sphere in a situation where someone is beating on someone else and it forces us to take sides, it forces us to decide which way this goes and the way that it's happening is going to be done with the culture war. And so either you're a progressive and you believe that gender is fluid and that people can decide their own gender and that. And that, you know, gender is a social contract, etc. Etc. On this side, or whether you think that it's XY chromosomes or it's very specific ways of dealing with this. Now what's amazing about this situation is that the people that are being presented, at least one of them, the Algerian boxer, is truly ambiguous, right? Because there are rare occasions where that true ambiguity happens, but that true ambiguity is being used as a political tool to move an agenda forward. If you look at the issue, you can see what's going on. First of all, the organization that had judged that this person was not eligible for boxing, we're being told by the Associated Press that this is a Russian organization or an organization with Russian ties. You have to be able to, when you hear, you have to be able to see how things are stuck together on one side of the political war in order to make you realize which side you have to take. And it's unconscious for some people. And so if I hear Russian and I hear, you know, that they're deciding that this person is not a female for biological reasons, then all these things line up and I can see, oh, far right or whatever, whatever word you want to use, reactionary, conservative, transphobic, all these terms now appear in my mind because these things are brought together into one little, into one nice band. And then if I see on the other side the, that the gender of the person is decided by what is on their passport and that it's a, let's say, a globalist organization like the Olympics and everything around it, ah, then I see nationalism, Russia, right wing, and then I see globalist, open, left wing and progressive and all of that stuff. And then I know which, which place to go. I know people don't do it on purpose, again, most of them, but then I immediately intuitively know which side to take and also who my enemy is. And it truly is the case, because it's interesting that the press has been announcing or the Olympics announced themselves, that they used what was written in the passport in order to decide which gender someone is. And that raises alarm bells on the other side right away because you think, oh, so it means that now all the countries that believe that gender is fully a social construct and that anybody can change their gender in any way they want legally, that means that those people will in the next Olympics be permitted to fight or to do whatever they want and to be on whatever side they want. And that's what it's signaling now, whether or not that's exactly what's going to happen. But that's what it's signaling, and the same is with the other side, is that, you know, these Russian people that are actually banned from the Olympics and don't want to participate in the globalist discussion, these, these, these right wing nationalists, now these people are the ones who do not want to accept someone who is an exception, like the Algerian fighter and therefore is a bully, is excluding, is whatever, transphobic and all the words that you want to use. But this was already announced in the opening, in the opening ceremony of the Games where this situation, think about it, the situation of ambiguity. Here's a tableau. It looks like Leonardo da Vinci's Last Supper. Some people have said that it references Leonardo da Vinci's Last Supper in the organization. Some of the people in the tableau themselves, even the organization mention that. And then all of a sudden they're saying, well, no, it's not. It's actually referencing this other painting that is the piece of Dionysus. So create ambiguity and now force people to take sides. And then what happens is you create that divide in the culture war. Some people will take the right wing side, some people will take the left wing side and everybody will feel like they're completely justified. But that is the, that has been in some ways the tool. And now I am going to take sides myself to some extent. That has been the tool of the left wing since the post war era. The idea is push against what people find acceptable. Push as hard as you can. And if people don't react, keep pushing, keep provoking, keep provoking the categories. Keep pushing against people's standards. And then when people react too strongly, then say, no, no, no, it's ambiguous. Then open up the ambiguity. Say, that's not what we meant, that's not what we actually referencing. You know, open up the space so that you don't have an enemy to punch. And it's all very fluid and all very, very ambiguous. And then. But what you want is to find just enough reaction to be able to wedge. And if you can wedge and gaslight at the same time, it's even better. So then you can wedge and you can create two sides and you can force people to take your side and then force people to be against you. And then, like I said, if you can gaslight at the same time, it's even better because then you can say, they have no reason to attack us. Look at how defenseless we are. Look at how we're victims. You know, this. They misunderstood us. And even though. And although they misunderstood us, they're attacking us anyways. And so now, you know, we feel morally justified to continue to push. And so this is exactly what we're seeing, you know, when you look at the boxing matches, you know, and also because we've seen it in other sports already, you know, if you guys remember, in mma, there was a fighter, Fallon Fox, who was a man who transitioned to be a woman and was beating the crap out of. Out of women. And that created so much controversy. And now we feel like there is a repetition. But now this repetition is, you know, and it's too bad, because this person, like the person that's involved in this, this boxer, and I'm not going to name names because I don't want to. I mean, you know what their names are. But I don't want to participate in this. It's not their fault. Like, it's not this person's fault. You know, they're just a regular person from Algeria trying, you know, she's just trying to make her way in sports. Possibly she should have not been allowed to participate. I'm not an expert, I don't know. But that's the thing. That's the whole thing about the ambiguity of the situation. The fact that one organization has banned her and Another organization is letting her in. But the quality of those organizations is important to see that all it is is a continuation of the culture war. And so I would say it's important to see this. It's important to be able to see, so that you can keep thinking. Because one of the problems, and I see it happen every time, is that people just take side to take sides. They actually stop thinking about why they're taking the side. They're thinking. They just have a way to associate certain things together, and then they just take political sides and then fight their enemy. And it prevents thought and makes people stop thinking about the actual issues. You know, it's like you can, for example, be against the war in Ukraine and still agree with some Russian organization's judgment that these people shouldn't fight. But the fact that we say that in the news that it's related to Russia is because someone is trying to stick it all together. Someone is trying to make you react in a way that if you're against the war in Ukraine, therefore, you should be against this organization and you should be for this other, you know, organization. And that's why we have to be careful and notice these strategies. And the strategies, by the way, are used by both sides, let's be honest. And so we have to be able to be attentive and to be able to continue to think. But one of the problems is the problem of ambiguity, which is that because things are set up in a way to celebrate ambiguity, it makes it very difficult to think because we're not experts, we don't know, but we see that, you know, the Olympics are saying anybody who puts a certain gender, have a certain gender on their passport, they're communicating that to us, that they'll be able to participate in women's sports. And so it feels like. How can I say that? It feels like what we're seeing is the slow disappearance of women's sports. I don't know. I'm not actually that interested in the subject of sports. But what we're seeing, the biggest surprise in all of these questions is how ultimately a lot of these issues and these ambiguities will force the world to decide, and it will recreate a rather strong manifestation of gender, even if it is men who come in to the ring, you know, or male types who come into the ring who are feet or women, but are male in their presentation, and everything about them looks male. That now you see these. These characters beat up women. What it will do, ultimately, is reify the notion of gender, reify the difference between men and women. There's no doubt about it. It might take a little while, it might be a little bit of a roundabout time for us, but that is the last inevitable, that is the inevitable situation we'll find ourselves in. Because the reaction that you have of watching a man beat a woman is a very deep, deep one that it will be difficult to suppress in people. And even if we accept consciously, and people accept consciously that, oh, it's really, they're both women and that, you know, it'll still reify that there is such a thing as masculine characteristics. And those masculine characteristics, they have an effect in the world. And there's a reason why we separate men from women. You know, even if, whatever, whichever side you take, that is the final path towards which this will lead. We might see a lot of chaos in between, but that is definitely where all of this will end up. And so hopefully this is good to help you think a little bit and to consider and to not let yourself just be taken up by emotion, but be able to think through these issues and to notice the strategies that are being used in order to create narratives, we need narratives, but we have to be attentive and recognize the narratives because sometimes narratives are very useful for political control. And we want to be as clear minded as possible as we see the story that's being presented to us. So I hope it's been useful. Everyone, don't forget to go to symbolicworld.com and become a member if possible. We are getting ready, Richard Roland and I, to start Purgatory, Dante's Purgatorio. We just finished Inferno about a month ago and it was amazing. Just so much insight coming out of this class. And although people don't know Purgatorio so much, it's actually where a lot of the meat of, you know, the thing that's the most applicable to your life and how to understand how Dante's comedy can apply to your everyday life. It is in purgatorial. So come join us as we ascend the mountain of Purgatory. And for everybody else, we'll talk to you very soon. Bye bye."}
