{"episode_id":"SW - #298 - 2023-07-28 - Mary Harrington - Conspiracies and the Return of Myth","start":0.56,"end":92.77,"speaker":"Jonathan Pageau","text":"The Internet. Because now attention is everything. It's in some ways a sped up version of what the ancient world had. Because what will survive is only that which gains attention and which is able to keep attention, even if it's for a short time. And so inevitably, the world will fall back into tropes of attention and memory. So if I say that Trump is brutish, but it's complicated and he has this quality, but mostly negative things, I won't get anybody of attention. But if I say Trump is Satan, then all of a sudden everybody is listening. And so we end up falling back into ancient tropes of mythological patterns, but way faster. This is Jonathan Pedro. Welcome to the symbolic. Hello, everyone. I am here with Mary Harrington. And I know many of you have been looking forward to this conversation. We've been kind of skirting around each other. I've been, I've been watching it from the sidelines, seeing very many interesting discussions and her wonderful articles. But it is a article called the Fairy Tale Allure of Conspiracies, which really kind of caught me and I thought would be an interesting starting point for a conversation with her. And so, Mary, thanks for coming on."}
{"episode_id":"SW - #298 - 2023-07-28 - Mary Harrington - Conspiracies and the Return of Myth","start":93.25,"end":94.29,"speaker":"Mary Harrington","text":"Thank you for having me."}
{"episode_id":"SW - #298 - 2023-07-28 - Mary Harrington - Conspiracies and the Return of Myth","start":94.93,"end":104.29,"speaker":"Jonathan Pageau","text":"And so maybe you can tell us a bit about what the basic thesis of that article is and we can start the conversation because I think it comes close to many of the things that we talk about in the symbolic world as well."}
{"episode_id":"SW - #298 - 2023-07-28 - Mary Harrington - Conspiracies and the Return of Myth","start":104.85,"end":146.83,"speaker":"Mary Harrington","text":"Yeah, it's a simple thesis, which is that, I mean, it's what people say about Alex Jones. Right. That he may be factually wrong, but he's often directionally right. Yeah. Or, you know, to put it in slightly, slightly more kind of high polluting terms and without the, the extremely problematic commentator. What I'm saying is that when I talk about conspiracy theories or the, the stories that float around, which tend to get dismissed as conspiracy theories, is that they may. The factual details of them can sometimes be way off and very baroque, but at a metaphorical level, as a, as a poetic level, they're often, they're often pretty much pretty on the nose."}
{"episode_id":"SW - #298 - 2023-07-28 - Mary Harrington - Conspiracies and the Return of Myth","start":147.15,"end":199,"speaker":"Jonathan Pageau","text":"Yeah, I think that's an interesting. I think that's definitely the point to look at. And we can actually use tools of storytelling analysis. You know, you can use the same kind of tools you use to interpret myth or interpret fairy tales or religious stories to look at some of the tropes that appear in these conspiracy theories. You know, the lizard people one. I like to look at the extreme ones because I think they're the best cases. You know, the lizard People. One is, is so simple. You know, it's the idea that there are snake people and that those snake people are not like us. But in some ways they've ended up becoming our own leaders. And so we have. I mean, it just basically manifests a deep distrust in leadership and the idea that the people that are running us, the people that have control over us, do not want our interests. They have other interests that are strange. You know, they have strange interests and not our own."}
{"episode_id":"SW - #298 - 2023-07-28 - Mary Harrington - Conspiracies and the Return of Myth","start":200.22,"end":251.37,"speaker":"Mary Harrington","text":"I remember thinking much the same when there was a whole, there was a rumor. I mean, it's still flying around. There's a whole series of rumors that fly that slosh around the Internet about how Joe Biden is not in fact real. Some people say he's an AI or that he's, he's computer generated simulation or. You know, another variant of this is a slightly more banal variant of this is the one that just says he's senile. I don't know what, I don't. I mean, I can't, I can't attest to the truth or otherwise of any of these. But what they seem to me to be conveying is a sense that the President of the United States is not in fact the leader of the United States. And in some sense, and the details vary, he's a sort of cardboard cutout behind which something is calling the shots. And that's the story that's actually being told. And the rest of it's just kind of vivid coloration."}
{"episode_id":"SW - #298 - 2023-07-28 - Mary Harrington - Conspiracies and the Return of Myth","start":251.88,"end":316.71,"speaker":"Jonathan Pageau","text":"Yeah, yeah. And it's story tropes really. And it's kind of falling into ancient story tropes, which are almost. They're necessary to call to the importance of the, of the moment. You could say, you know, when you look at the way people tell, like say, tell stories in movies is a good way to understand that, you know, in real life, the two, the good guy and the bad guy actually don't fight. They don't duke it out. They have armies and they have, you know, they have all these bureaucracies between them and. And then they have these massive complicated things that are really boring to look at and to think about. But if you want to get the image of it, you have to. The two guys, the two protagonists, even if they're the president and some other character, they actually have to physically duke it out. Or if you want to show a bomb in a movie, you have to have a red blinking light. Like no terrorist would ever put a red blinking light on a bomb, but you have to have that in order to signal to People what is going on? And I think that in a lot of these kind of crazy, wild, imagistic stories you have this similar type of approach, similar type of tropes that are being used in the way we remember them."}
{"episode_id":"SW - #298 - 2023-07-28 - Mary Harrington - Conspiracies and the Return of Myth","start":317.43,"end":391.96,"speaker":"Mary Harrington","text":"Right. And one of the examples I gave of these, which actually is a provocative example, I suppose, concerns the theory which also sloshes around. It's kind of QAnon adjacent, I guess, that there exists a conspiracy, a sort of baby eating Satanist conspiracy. I mean, theories of that kind have been slotting around for some time. But there's definitely a Q adjacen recent version of that story that there exists a cabal of people who are, for esoteric, possibly devil worshipping reasons, kidnapping and murdering babies. And I'm thinking, well, actually this is probably not true. However, there is an organization that calls itself the Satanic Temple and they have created a telehealth clinic in New Mexico where you can obtain abortion pills in order to circumvent the changes in legislation since Dobbs. And they have also launched a court case under religious freedom legislation in the United States to protect the right to what they call an abortion ritual in order to release complicated feelings around terminating a pregnancy. And I'm thinking this, I mean, it's not quite the thing, but you can sort of see how you get from A to B. Right?"}
{"episode_id":"SW - #298 - 2023-07-28 - Mary Harrington - Conspiracies and the Return of Myth","start":392.2,"end":473.44,"speaker":"Jonathan Pageau","text":"Yeah, yeah. And it's also, I think the idea of people who eat your children is a very important image and it's a very dark image. Of course, we know how that it's been used in very dark ways in the past, but it is, it is an image which shows the notion that something is taking your fruit. Like something is taking that which is important to you. Someone is stealing it away from. He's kind of pulling it away from you. And one of the, like, one of the, one of the important shifts that in the kind of conspiracy language or this kind of imagistic language which is important to notice is that in the ancient world we used to use these types of tropes for the people that we didn't know who they were. Right. It's like the cannibals and the monsters and the lizard people and the dog headed men. They were on the edge of the world. There are these weird things that we don't know about, these kind of strangers that we don't know about. There's an interesting shift that happened, which is that now these types of images are used against our own elites, which it is not something to just kind of shy, to just brush away. That seems like there is a shift. It means that if the normal traditional society, little tribal society anywhere in the world tends to be suspicious of the stranger, now we're suspicious of our own power, the people that are powerful over us. That's a very. That's a different thing."}
{"episode_id":"SW - #298 - 2023-07-28 - Mary Harrington - Conspiracies and the Return of Myth","start":473.6,"end":764.23,"speaker":"Mary Harrington","text":"Yeah, it's a significant shift. I mean, it tracks with returning to a more banal level of interpretation. It tracks with a pervasive loss of trust in institutions. But you know, the explanation for it, or rather the emotional, you can see where emotionally re situating the lizard guys in our own elites rather than outside on the edge of the world makes sense if there's been a pervasive loss of trust in institutions and loss of trust in the alignment of elites with the masses. And that's measurably the case. I mean, I interviewed Peter Turchin last week who writes about elite overproduction and the way in which elites need to be kept in check or at least roughly aligned with the masses, because otherwise they will have a tendency to turn power into goodies for themselves. At which point that sets off a whole cycle of elite overproduction which usually culminates in crisis and some kind of an uprising, at which point the whole cycle starts again. And in his view, I mean, I think his phrase was, America is now in a revolutionary situation. And I think, I can't speak for where you are, but Britain doesn't feel a million miles off that in the divergence between the interests of those with any access to the levers of power and those from whom they're siphoning wealth and resources and opportunities to lead a decent life. So given this, you know, the fact that that's emerged, emanating, you know, at the sort of mythical, mythic level as lizard people who walk amongst us or baby eating cabals gathering on Epstein island or whatever, whatever variant of the story we're looking at, it doesn't feel so strange really. What I find fascinating, just kind of zooming out for a bit, is just how radically and how quickly it's become normal again to speak in mythic terms, since we transitioned from print to a digital culture. I mean, this is a kind of long, long term, preoccupation of mine that transition from print to digital culture. I read English literature at university and I was lucky in being probably one of the last to get frog marched through a fairly comprehensive kind of canonical English undergrad in the sense that I was. I mean, it was pretty sketchy, but it was, it was pretty much the entire English literary canon. From Beowulf onwards. And I ended up with in. In. In order. So you got this, you got the sense of historicity and the sense of. The sense of the evolution of ideas and. And tropes and of. Of literary forms over time. And one of the things I found incredibly interesting and just has been preoccupying me ever since is the transition from pre modern, from. From the pre modern to the modern moment. And particularly, particularly around how stereotypes, tropes, Stereotypes and tropes disappear or become low status at the point of modernity. In a sense. The idea. I can take one word to illustrate what I mean when we say commonplace. We mean it in a dismissive sense, right? But a commonplace in medieval terms was something that you took quite seriously. I forget the Greek term for it, but it's a rhetorical term that refers to areas of shared meaning which are widely understood and which you can reference if you want to make rhetorical points using the art of public speaking. So commonplaces might refer to love, or to the relations between men and women, or to the duties, the obligations of a prince, or the whole series of them. And if you study rhetoric in the ancient up to the medieval world, you'd be expected to have a decent working knowledge of the common places. Topoi, in fact. And they're understood as. They're a conceptual place, but they're understood as, in a sense, a very real place that's shared and everybody can visit. In a sense, it's the public square, but on the sort of memetic level. And all of that disappears over the course of modernity to the point where we have to speak of something being commonplace is to speak of it being banal and ordinary and low status and probably belonging to the peasants. It's boring. It has nothing, nothing to recommend it, because what we're interested in now is the signal and not the noise. And common places are just dismissed as noise rather than being read as signal. And what I find fascinating about having left the modern era, which for the digital, or rather having left the print era, for the digital era, is that all of those topweight are back. It's just that we call them memes now."}
{"episode_id":"SW - #298 - 2023-07-28 - Mary Harrington - Conspiracies and the Return of Myth","start":765.84,"end":924.8,"speaker":"Jonathan Pageau","text":"I think it has to do with the reality of attention. That's the way that I think about it, is that the ancient world was one in which attention was extremely valuable because we had to remember things. Although we did have writing, that writing, there were few books and few people had access to them. And so attention and memory are extremely important. And there are certain patterns of attention and memory. Which are pervasive. And those, you know, the older they are, the more, let's say, mythical they are, the easier they are to perjure. You know. And so it's like if I want you to remember something, I have to be careful not to make it too idiosyncratic. I have to make it, I have to contract it in a way that is as universal as possible and connects as closely to you as possible that you can remember it and you can not only remember it, but then pass it down to the next generation. Now what written culture was able to do was in some ways to stilt that to some degree. So you end up with, you know, Victor Hugo and like massive historically accurate novels that are very idiosyncratic and try to describing all these very little things. But that in some ways is a, it's also in the myth of this kind of authoritarian publisher and you know, this kind of centralized streamline of information that peaked with tv, like television was the peak of that, you know, where you have this like streamline of a high, supposedly high minded information that is, that is programmed and given to us. But the Internet, because now attention is everything. It's in some ways a sped up version of what the ancient world had. And it's a sped up version because what will, what will survive is that only that which gains attention and which is able to keep attention, even if it's for a short time. And so inevitably the world will fall back into tropes of attention and memory. So if I say that Trump is a, is brutish but it's complicated and he has, you know, and he has this quality but mostly negative things, I won't get anybody of attention. But if I say Trump is Satan, then all of a sudden everybody is listening. And so we end up falling back into ancient tropes of, of mythological patterns, but way faster. I mean, now it's, it's sped up and it's also being, it's being filled in with a lot of the, let's say the, the strange part of that because we don't have a common place so much. We just have attention. So we were just like cycling attention."}
{"episode_id":"SW - #298 - 2023-07-28 - Mary Harrington - Conspiracies and the Return of Myth","start":925.12,"end":960.97,"speaker":"Mary Harrington","text":"Yeah, yeah, yeah, yeah. Yes and no. I think there are thermometic landscapes emerging, but they, but are very much at the grassroots and among subcultures. And in a way, yeah, it's moving very fast. I mean, just going back to the Trump is Satan. One of my informal metrics for whether or not a political figure gets cut through in the Internet age is could this can, could an utterance by this person ever be sampled over a base beat and cause the crowd to go wild? And if the answer is no, then they're going to see it without trace. Yeah."}
{"episode_id":"SW - #298 - 2023-07-28 - Mary Harrington - Conspiracies and the Return of Myth","start":960.97,"end":965.29,"speaker":"Jonathan Pageau","text":"If someone can't meme it into the, into people's mind, I mean I listen."}
{"episode_id":"SW - #298 - 2023-07-28 - Mary Harrington - Conspiracies and the Return of Myth","start":965.29,"end":977.01,"speaker":"Mary Harrington","text":"You know, I don't, I have no, I have no particular fondness for the orange man. Right. Pretty much everything he says could be sampled over a base beat."}
{"episode_id":"SW - #298 - 2023-07-28 - Mary Harrington - Conspiracies and the Return of Myth","start":977.09,"end":977.73,"speaker":"Jonathan Pageau","text":"That's right."}
{"episode_id":"SW - #298 - 2023-07-28 - Mary Harrington - Conspiracies and the Return of Myth","start":978.29,"end":1162.99,"speaker":"Mary Harrington","text":"And I don't, I don't like that this is the way the Internet the, the way the way Internet attention works. But it, but it is. And whether. Whether we want it to or not. The last British politician that got sampled for a rave track was Boris Johnson. Which figures really, whatever else you may think of Boris Johnson, he was box office. Now that we. I mean until somebody else shows up who's box office in the same way, we're basically in the sink. But thinking about. I mean you're saying. I just wanted to add one thing to your theory of attention, which I think is bang on. It's about what sticks and what can be remembered because the flow of information under digital conditions is so fast that unless something sticks in a very catchy way, it will just disappear without trace. Most of the stuff that I write in that sense is eminently forgettable, which I remind myself of at every possible opportunity. Most of my. This is why I like to meme as well as. As well as theorizing at length. Because you often find that a coinage, a two or three word meme coinage can unpack into four or five thousand words or sometimes fifty, just depending on. Depending on how hard you're trying to explain it to normal people who aren't far too online for their own good. But I wanted to add a materialist layer to that as well, being the crypto Marxist that I am, which is about the relationship between meaning making and money, which. Which is distinct. In the print era there's of the. The economics of copyright printing and relative information scarcity meant that for a while, for maybe, I don't know, 250 years, it was actually possible to make your living directly as a writer. That wasn't really the case in the medieval era where you might be employed by the court as a poet or you might be an itinerant minstrel, or apart from that, you probably have to go join a monastery and copy Bibles and make your livelihood that way if you want to enjoy the life of the mind. Your opportunities as a sort of independent opinion haver are pretty Limited. And that's true again. Now digital reproduction makes it more or less impossible to make a living directly as a writer. Now there are people who do it, but their numbers are pretty low and the money just isn't that great, except for a handful here and there. I mean, I think about Alexander Pope, who was one of the first to nail this in. His translations of Homer in the early 18th century were insanely successful. There was this incredible, incredibly avid reading public who were desperate, who maybe hadn't learned Latin and Greek at university and were desperate to get their hands on the cultural goodies and they flew off the shelves. And, you know, it made him so much money, his translations of Homer that he was able to buy this massive house in Richmond and, you know, and create this incredibly elaborate garden there. It's. I mean, these days, these, I don't know, people are writing listicles for Buzzfeed and even they're getting laid off in favor of ChatGPT. It's a different world, right?"}
{"episode_id":"SW - #298 - 2023-07-28 - Mary Harrington - Conspiracies and the Return of Myth","start":1164.11,"end":1177.47,"speaker":"Jonathan Pageau","text":"It's a more oral world too. It's a, It's a strange. It's not exactly oral in the same way the ancient world was, but it ends up being post literate. Yeah, the people that are making money with ideas now are speaking and not writing so much."}
{"episode_id":"SW - #298 - 2023-07-28 - Mary Harrington - Conspiracies and the Return of Myth","start":1178.07,"end":1223.05,"speaker":"Mary Harrington","text":"Yeah, it's true, it's true. Yeah, it's very, very post literate. The point at which I realized just how, just how far into that we are already was when I gave a talk at a very well known, very respectable, very expensive English boys school, one of the more conservative of the, of the boys schools in private, expensive, yada, yada, yada. And one of the boys came up to me after my talk and said, you should be on TikTok, Mary. Because you, you realize people, my generation just don't read. And I'm like, you know, this is, this is the creme de la creme that I'm talking to here. This is a scholarship boy at one of the most academically rigorous, demanding and conservative English public schools that there is. And he's telling me that his peers don't read. You know, this is where. We're not in Kansas anymore."}
{"episode_id":"SW - #298 - 2023-07-28 - Mary Harrington - Conspiracies and the Return of Myth","start":1223.13,"end":1327.43,"speaker":"Jonathan Pageau","text":"Yeah, yeah. And the difficulty of the oral culture now is that I want to be careful not to make too many comparisons with ancient oral culture, because it is. Ancient oral culture was a culture of memory in the true sense. Right. It was a culture of internalizing stories, internalizing, you know, places. Whereas now it's really, it's like hit dopamine, you know, it's still it's like quick dopamine hit and forget, you know, like TikTok. I mean, there's no, There can't be TikTok in my house. It's just impossible. My kids have deleted all that stuff from their phones. It's insane. It's a, it's a very dangerous. But it, but in terms of, let's say, paying attention to culture and noticing patterns, it's still helpful, it still works because it does, it does fall into orality and it does help us see, you know, what's going on much. It's as if a lot of the religious things that we're seeing kind of popping back in have to do with that as well. Because certain, you know, like ancient worlds would. I don't know what you're going to think about this, but like ancient worlds talked about, you know, let's say, transpersonal intelligence, this idea of angels and demons and gods and all of these intelligences would act on people in like long spans of history. And so, and so, you know, they had this, this intuition that had, that they developed over millennia about this and they put, they engage with this, you know, in the modern world. We were able to dispense with that completely. But now because of sped up Internet attention, culture, we see back in the discourse again. And we see the agencies act because it's sped up. Says if you can see, you can see like waves of, of control kind of come in and then vanish. Right. They just come in and move away and it's. Everything's so fast."}
{"episode_id":"SW - #298 - 2023-07-28 - Mary Harrington - Conspiracies and the Return of Myth","start":1327.67,"end":1343.41,"speaker":"Mary Harrington","text":"You can see amongst people who are paying attention, it's back in the discourse again. People talk about egregors, which is just a, you know, that's a, that's just a modern kind of West Coast, West Coast America way of saying demons, right. Or angels, you know, extra, Extra human intelligences."}
{"episode_id":"SW - #298 - 2023-07-28 - Mary Harrington - Conspiracies and the Return of Myth","start":1343.73,"end":1345.65,"speaker":"Jonathan Pageau","text":"Yeah, exactly. And so it's."}
{"episode_id":"SW - #298 - 2023-07-28 - Mary Harrington - Conspiracies and the Return of Myth","start":1345.97,"end":1347.73,"speaker":"Mary Harrington","text":"Or it's close enough to jazz anyway."}
{"episode_id":"SW - #298 - 2023-07-28 - Mary Harrington - Conspiracies and the Return of Myth","start":1348.37,"end":1349.89,"speaker":"Jonathan Pageau","text":"Exactly. And then."}
{"episode_id":"SW - #298 - 2023-07-28 - Mary Harrington - Conspiracies and the Return of Myth","start":1349.89,"end":1350.21,"speaker":"Mary Harrington","text":"Yeah."}
{"episode_id":"SW - #298 - 2023-07-28 - Mary Harrington - Conspiracies and the Return of Myth","start":1350.21,"end":1368.85,"speaker":"Jonathan Pageau","text":"And then AI is also making us, forcing us to think about this, you know. You know, I wonder what you. What as a writer, you know, AI is what. How you see it looming on us. Like, how do you see it affecting your own, your own. Not maybe your personal career, but let's say writing in general."}
{"episode_id":"SW - #298 - 2023-07-28 - Mary Harrington - Conspiracies and the Return of Myth","start":1371.05,"end":1521.16,"speaker":"Mary Harrington","text":"I wrote something about this a little while ago. I might be wrong, but I think it's going to. I think it will have a sorting effect in the sense that workman, like jobbing writers will suffer and there will continue to be a class of writer whose work is valued and who stand out and they'll, they'll, and they'll do so by, on, on two fronts. First, a capacity for pattern recognition and sense making. Or rather, I mean, I mean at the end of the, okay, we have to think about what an AI is. At the end of the day, it's a glorified autocorrect, right? It's a very, very, very clever autocorrect that guesses based on, based on pre existing patents, but it doesn't originate anything. It doesn't actually think and it doesn't, it doesn't know. It doesn't have any way of sense checking what its output and the difference between that and a human sense maker is tiny and also infinitely, infinitely large. Because at the end, because the human sense maker, a human sense maker is distinctive on one hand by virtue of not having access to all of that information and also by the being an active awareness which is choosing which information to notice and which information to notice just by virtue of that idiosyncrasy. There's something distinctive about human sense making. So that's, and there are just some sense makers who are valued because their work speaks to people. And that's not something, I think that can be reproduced by a machine. So that's one thing, but the number of people for whom that's the case, it's going to be pretty limited. So once again we're back to court poets, basically. And it's also very difficult to make your. Under conditions where you can just get a machine to output text jobbing. Writing work is a lot of, it's just doomed. Right. So at the end of the day, if you do want to make a living as a sense, I mean, I think writers will become sense makers. And if you want to earn a crust as a sense maker, chances are you're not going to be, you're not going to be doing it directly. It's much more likely, I think for a host of other reasons as well that you're going to be effectively a court poet again. I mean, we're back in, we've already exited the democratic age and we're back in the era of lords and princes, even if we don't call them that."}
{"episode_id":"SW - #298 - 2023-07-28 - Mary Harrington - Conspiracies and the Return of Myth","start":1521.24,"end":1521.96,"speaker":"Jonathan Pageau","text":"Yeah, yeah."}
{"episode_id":"SW - #298 - 2023-07-28 - Mary Harrington - Conspiracies and the Return of Myth","start":1522.12,"end":1648.65,"speaker":"Mary Harrington","text":"And it's increasingly clear to me that survival as a sense maker for the most part means some kind of court patronage. That's just how things work again. Once again, you know, as James Poulos says, digital retrieves the medieval, you know, so, but I think, you know, in as much as you did a couple more things on the, the relation between ChatGPT and human sense makers. I also think it's possible, at least I'm sort of hopeful that it's possible that we'll see, we'll see human sense making thrive to the extent that it's, that it can work. I'll start that from, start that from another, another point of view. I think the way the human sense makers will be able to distinguish themselves from the machine by their grasp of the tacit what is not said. It might seem paradoxical to say that writers will be able to distinguish themselves by what they don't say. But I think, But I mean, ChatGPT sucks at puns, right? It sucks at implication, it sucks at puns, it sucks at illusion because there's no thinking there. It's a pattern recognition machine. It's just an autocorrect. And so of course it can't do implication, of course it can't do illusion, of course it can't do dog whistling. So there's an entire, entire poetics of dog whistling, of jokes, of puns, of references, of illusions, of hints and implications. And all of which is really to say, a literature of the unstated. And particularly, you know, if politics continues on its current trajectory towards ever more censoriousness and restriction, I think those writers who are political dissidents or political radicals will also just be forced to embrace the poetics of the unspoken anyway. So, I mean, there's some not particularly well organized reflections on how AI changes writing or sense making as a craft. But I mean, that's where I've got to up until now. I think a lot of writers are doomed. I might be one of them, I might not."}
{"episode_id":"SW - #298 - 2023-07-28 - Mary Harrington - Conspiracies and the Return of Myth","start":1648.65,"end":1650.61,"speaker":"Jonathan Pageau","text":"We'll just have to see."}
{"episode_id":"SW - #298 - 2023-07-28 - Mary Harrington - Conspiracies and the Return of Myth","start":1651.89,"end":1653.77,"speaker":"Mary Harrington","text":"I'm working on plan B, just in case."}
{"episode_id":"SW - #298 - 2023-07-28 - Mary Harrington - Conspiracies and the Return of Myth","start":1653.93,"end":1688.87,"speaker":"Jonathan Pageau","text":"Yeah, but it seems, I think that you're. But I think your intuition is right and it has to do. Again with. I wouldn't use the word attention in this case, but I'd use the word care. You know, the AI doesn't care, doesn't have relevance. It doesn't, it doesn't have direction, right? We provide it, we provided direction. We ask the questions, we tell it what to talk about. And not only that, but we also provide the intelligence for it, that is that the AIs are trained by humans. We have told them what's good and what's not, and that's how they align their pattern recognition onto our own."}
{"episode_id":"SW - #298 - 2023-07-28 - Mary Harrington - Conspiracies and the Return of Myth","start":1689.19,"end":1698.55,"speaker":"Mary Harrington","text":"Right? You can't ask a machine to say, show me, create me an image which is not disgusting and be absolutely certain that It'll succeed in doing so."}
{"episode_id":"SW - #298 - 2023-07-28 - Mary Harrington - Conspiracies and the Return of Myth","start":1698.71,"end":1733.25,"speaker":"Jonathan Pageau","text":"Yeah, yeah. And so the. But I think that lines up with your. Which was a little surprising to me, but still, I think you're right. A kind of neo feudalism, you know, in some ways that what will be necessary for people as we move now very quickly is to have, let's say, to have little city states, you know, intellectual city states of people that are. That are aligned, that, let's say, move in certain directions, but also, like you said, have patronage in some ways that, that have."}
{"episode_id":"SW - #298 - 2023-07-28 - Mary Harrington - Conspiracies and the Return of Myth","start":1733.81,"end":1734.13,"speaker":"Mary Harrington","text":"We."}
{"episode_id":"SW - #298 - 2023-07-28 - Mary Harrington - Conspiracies and the Return of Myth","start":1734.13,"end":1779.75,"speaker":"Jonathan Pageau","text":"We also need. How can I say this, you know, and I say this because this is, you know, as you maybe know, like I'm involved in this ARC thing, this, this. And, And I, I hesitated a very long time to be involved in that because I'm not a political person, you know, I'm fine with politics. I'm just not. It's not my main thing, let's say. But I realized something like what you said that in some ways we need to be able to recognize even those that have money that are, let's say, moving in the right directions and to be able to. To signify to each other that we're in the same team, let's say. And that's a weird, weird thing to have to do because it does signify a kind of fragmentation of society. But in some ways there's no. There's. There, there aren't. I don't see any other solution at this point."}
{"episode_id":"SW - #298 - 2023-07-28 - Mary Harrington - Conspiracies and the Return of Myth","start":1780.55,"end":1906.52,"speaker":"Mary Harrington","text":"No, no, me nor me. I think you just summed that pretty succinctly. I mean, what the, what the implications are of what was going through my mind as you were speaking is that an unknown at this point is how that maps onto existing. Exists pre existing political structures and pre existing modes of government. I guess there's only one way to find out, which is get stuck in a way and find out is to do it and see. But I mean, yes, I wrote something else not long ago about how. Although as much as it grieves me to think this, I think the nation state is toast. I think it's over for the very straightforward reason that there's no elite consensus for it. It's broadly not in the interests of the. Of the elite who are predominantly knowledge workers and very internationalized, both in their culture and also in their economic interests to support boundaries, banded nation states where, where there are. There are clear delineations between the people here and the people there. It's just, it's. There's. There's no elite consensus in favor of that being a good way of doing things. And as far. And I, and I don't see, I don't see the masses at present as having enough leverage to, to push things back the other way unless something changes significantly. None of the, none of this makes me very happy because I'm a, you know, I was raised in the age of democracy and I'm a democracy respecter and a democracy enjoyer, but that's what I see happening. And I think it's part and parcel of the same phenomenon as you're describing about if you like sense making and meaning making tribes which are coalescing sometimes around singular or affiliated sources of finance, of patronage really, you know, in a sense as the, as the sort of second order layer of cultural production that relates to whatever this emerging mode of governance is."}
{"episode_id":"SW - #298 - 2023-07-28 - Mary Harrington - Conspiracies and the Return of Myth","start":1907.4,"end":1950.02,"speaker":"Jonathan Pageau","text":"Yeah, yeah. And there is, but there's also, in this moment, there's also possibilities for, you know, the crowdfunding possibility has also made that very interesting, you know, because crowdfunding can be a form of resilient patronage if you manage it properly. You know, the difficulty of the ancient form of patronage is that it was usually single. You know, like you said, you find a prince, you find some rich, powerful person and then, and we need them, obviously, definitely we need those people as well. But there is also, there is also the possibility of crowdfunding, which makes that a little more resilient in my, at least that's what I've noticed."}
{"episode_id":"SW - #298 - 2023-07-28 - Mary Harrington - Conspiracies and the Return of Myth","start":1950.58,"end":1957.06,"speaker":"Mary Harrington","text":"It comes with its own pitfalls. I mean, audience capture is a thing. You know, if you want to talk about egregores, there's one."}
{"episode_id":"SW - #298 - 2023-07-28 - Mary Harrington - Conspiracies and the Return of Myth","start":1958.1,"end":2172.01,"speaker":"Jonathan Pageau","text":"You're right. No, the guru problem is a real problem. Like it's a, it's a real problem. And I think everyone is trying to figure out a way to avoid the pitfalls of that, of that issue as we see people kind of fall into it head on and then also become. One of the problems with that, and you see that on youtubers fall into that all the time, is that in some ways they also, they also become a slave to their own body. Right? They become a slave to their own egregore because then they, they just want to make sure they feed the body what it wants. And if that, that can also be low level, you know, just constant barrage of, of, you know, how can I say this? Like commenting on TikTok videos, which I'm seeing a lot of conservative people doing now, it's like, that's a bad going in on a bad direction where the, where the supposed social commentators make their Money commenting on TikTok videos, we're like, that is definitely a version of audience capture. And this weird. Yeah, desire to please your own, your own support group, let's say. I hadn't thought of that until you mentioned it, but as soon as you said it, I just saw the image in my mind. I thought, yeah, that's absolutely, that's absolutely true. I want to, I want to come back to the, to some of the, this basic, the fairy tale conspiracy stuff. I don't know if you thought about this. One of the things that I've been thinking about is, you know, there's also a weird, there's also this weird thing that in the mainstream media, which is the use of the conspiracy theory tag as a political attack, which is that as soon as you point to opposition, as soon as you point to organized opposition, if you, you notice patterns of, of, of capture and of opposition in the system, then, then they just call you a conspiracy theorist and people back off right away, you know. And so if you talk about the, for example, like the, the, the LGBT thing, which is obviously organized, which is obviously moving, which is obviously politically weaponized towards certain goals, then they'll say, well, you're a conspiracy theorist. And it's like, and in some ways the, the silly aspect of the conspiracy theories is, is almost advantageous to, to that, to that type of attack because you can always move into QAnon, into the fringe point to the insane looking conspiracy and then say, well, are you like those people? Like, are you like the people who believe in the lizard people as soon as you point to opposition? And so it disarms a lot of, because I've noticed it disarmed a lot of conservatives, especially during COVID You could just see it, people were so disarmed because, you know, in Quebec, where I am especially, I mean, the conspiracy theorists at the outset said Covid is going to be a tool to bring about digital ID and control people through digital id. And then we were called conspiracy theorists. And when it happened, there was no way out of it. It didn't matter. It didn't matter that it actually happened and that people were standing in front of churches with cell phones forcing people to scan their passport to go into the church. There was no way out of that trap of being called a conspiracy theorist. And I'm not sure how to get out of that trap. Sometimes Paul Kingsnorth seems to be doing pretty good at, pretty well at it, but it's, it's very difficult to be able to talk about opposition and capture without immediately Being afraid of that tag."}
{"episode_id":"SW - #298 - 2023-07-28 - Mary Harrington - Conspiracies and the Return of Myth","start":2174.49,"end":2414.95,"speaker":"Mary Harrington","text":"One of the things Paul does really well, which, which may contribute to this is he's a good storyteller. And when I, when I say storyteller, I don't mean, I mean it's very easy to say, oh, you know, there are, there are mysterious forces which are doing it, yada yada. He talks about the machine and he talks about the things. I mean you're familiar with his work and he manages to do so without imputing it to a shadowy other and yet making it a very compelling story which obviously speaks to a lot of people. And I think that's one of the, that's one effective tool. He also uses self disclosure in his work, which I find, which I think is significant. And it's also unusual for a man. It's much rarer in my observation to find men, male writers, male thinkers who are as generous with self disclosure as Paul is. I don't know why that is. That's not something I've given much thought to. But I mean this is just my observation. It tends to be a women thing. But it's, I mean self disclosure can, it can often. I don't know if disarming is exactly the right word, but I think a humanizing effect which makes it, it makes it much more, much more difficult for people who disagree with you to dismiss to unperson you. If you've already, if you've already drawn people in with your personal story, it's much more difficult to dehumanize you out of hand. It just is. I mean this is just a few. I'm sort of thinking on the hoof here because this is a really interesting question. Another, Another instance of somebody who, who uses stories very intelligently in some quite political, some quite contro activism is Katie Faust who campaigns for children's rights in the United States and who, I mean she deliberately avoids standing on any of the really controversial rainbow colored landmines where it comes to children's rights. She's just not touching that stuff. But what her focus, absolutely laser like focus on we need to, you know, these are what, this is what children need and this is how. These are the things that we need to do in order to meet their needs and just, you know, to turn the whole argument around and to say, you know, this should never be about adult desire, this should be about what children need. And to that purpose she has collected and is as an ongoing project she collects stories from people who grew up in situations where. For whatever. For a sort of different. Whether it's Divorce or being the child of surrogacy or something like that. They had to make a sacrifice for the sake because they're the adults who cared for them, needed something other than what they needed. And she collects stories, and it's an extraordinarily powerful set of stories to read through and. Yeah, and I think, you know, and she uses. She uses and offers them as a resource to anybody who wants. Who wants something which isn't just statistics. Like, nobody. Nobody pays any attention to statistics. Right. You know, maybe some policy wonks here and there, and you sort of have to. You sort of have to show you have some. You need some data, but nobody really listens to data because there's always other data. Yeah, but. And again, in the sort of, you know, neo. Neo medieval memeplex of the Internet, people do listen to stories, particularly if they're arresting stories. This is. This is just powerful currency on the Internet. So, Yeah, I think that's my sort of scattershot thought. Personal disclosure is a powerful tool. Storytelling generally, if you can. Can. If you can draw a narrative together which isn't. Which doesn't just fall back on the familiar tropes of, you know, lizard. Yeah, the sort of lizard man thing. And, and if you're. If. And if you can tell a compelling. Or you have compelling stories from people, yeah, you can do something. You can do something quite different than you could if you were just sort of pointing to those guys over there."}
{"episode_id":"SW - #298 - 2023-07-28 - Mary Harrington - Conspiracies and the Return of Myth","start":2415.35,"end":2524.23,"speaker":"Jonathan Pageau","text":"So I think. I agree, and I think especially with Paul, I know his work better. And I. And I see it. I see that one of the ways he's been able to do it is to show the mechanisms of the machine and to show how they just are. They'd say they're just corollaries of. Of enlightenment modernism, that this is just something that plays out, you know, like a. Like a story. Right. It's like you put these things into place and you start the. The ball starts to turn. Then at some point it reaches this point like this. It's where we are. But one of the things that makes it very difficult at this time is that there are some people who do identify their enemy. Right. Very clearly and will say, like, Western culture is our enemy, basically, or however they phrase it, like the this or that, the group, our enemy. Like the conservatives, the right wingers like to be, for example, to be called a right winger is like, everybody shakes. Like, all the conservatives start to shake when they're just being called the right winger. And so there's this weird, like, imbalance where on the one hand, the, the one side is not only allowed to call on their enemy, but does it simult constantly, like just non stop with all the weapons possible. And then, yeah, and then, and then, and then I knew this is my, my maybe this is my perception. And then it's like I realized that I'm always trying to do the kung fu move. Like I'm always trying to do the jujitsu thing. I'm always trying to do this thing where I'm not, I'm not doing that. And I'm wondering, you know, is it cowardice? Like, is it, is it, is it being a good Christian? Like, I don't. Not sure sometimes the reasons why I realize that this is necessary to kind of, to try to do this type of jiu jitsu. I don't know. I'm also really thinking at the edge of my thought here when I say these things."}
{"episode_id":"SW - #298 - 2023-07-28 - Mary Harrington - Conspiracies and the Return of Myth","start":2524.63,"end":2648.83,"speaker":"Mary Harrington","text":"No, I understand. It's a. Funny enough, I've been writing about exactly this today. It's still, still a work in progress. So I'm sort of hesitant, hesitant to try and set out the whole thesis. But my sort of, my working, my working hypothesis is that we end up doing so much jiu jitsu, not least because we've conceded a great deal more of the frame to the opponents than to our opponents than we imagine. Because even conservatives have for the most part accepted in principle that normal is the enemy, that normativity is bad, or that normativity is at the very best, at best, suspect. I mean, actually this, in a funny way, this articulates with the pre modern, modern and postmodern story of how, of the role played by pattern recognition. I mean, in a sense, if we're talking about memes and meme culture and the memeplex, one of the reasons the left can't meme is because they hate normativity. They suck at means because they're always in. They're never interested in paying attention to the noise. They only want to pay attention to the signal. Because that's the essence of what progress is. That's the essence of what the machine, that's what the machine runs on. Signal rather than noise. And memes are noise. They're aggregate, the aggregate topoi that emerge out of the sort of collective, semi conscious or subconscious, the meme plex, the general sloshing, the here and there of signification and shared recognition of what the world is. And they're funny because people recognize them, they're funny because. And they travel in direct proportion to how instantly Intelligible they are. So having said all of that, where was I going with this? Oh, yes, the war on normal and the war on normativity and the politicized war on normativity. Essentially we have to be able to defend the meme. We have to be able to speak from the place of the meme. Does that make sense?"}
{"episode_id":"SW - #298 - 2023-07-28 - Mary Harrington - Conspiracies and the Return of Myth","start":2648.83,"end":2649.63,"speaker":"Jonathan Pageau","text":"Yeah. Yeah."}
{"episode_id":"SW - #298 - 2023-07-28 - Mary Harrington - Conspiracies and the Return of Myth","start":2650.03,"end":2700.55,"speaker":"Mary Harrington","text":"So by that we have to see the entirety of the discourse which even a great many of us have largely accepted as a normal phobia, as a bigoted hatred of what is in fact normal and observable and wholly self evidently intelligible to the vast majority of people. And I think I'm coming to think that it's time to go on the offensive against normal phobia and to see it as a kind of bigoted, irrational fear and attempt to destroy something which is A, fundamentally culturally and socially important and B, just impossible to destroy anyway. It's futile and socially destructive to try and abolish all norms in favor of personal freedom. It's just frankly wrong thing to do."}
{"episode_id":"SW - #298 - 2023-07-28 - Mary Harrington - Conspiracies and the Return of Myth","start":2701.75,"end":2763.33,"speaker":"Jonathan Pageau","text":"Well, in some ways it's that, but it's the revolutionary trope which has been there now for a very long time. Right. It's been there since the Enlightenment at least. You know, this vision of revolution as being, as being the justification for narrative. And so, you know, like every movie that I grew up with had that trope. Every single one always had the underdog story. And the underdog story, it's not wrong in itself. It's fine. The underdog story is fine. But usually the way it is presented, as the ragtag weirdos who basically take power from the established thing, and that structure is just basic, our basic narrative structure. And so it's difficult because conservatives also have that same basic structure. And so what are they conserving? I don't even know. Like, I use the word conserve myself. I use word conservative, but I really don't see myself as a conservative because I don't know what the hell to conserve anymore. Right. It's like, in some ways."}
{"episode_id":"SW - #298 - 2023-07-28 - Mary Harrington - Conspiracies and the Return of Myth","start":2765.17,"end":2766.93,"speaker":"Mary Harrington","text":"This is why I prefer reactionary."}
{"episode_id":"SW - #298 - 2023-07-28 - Mary Harrington - Conspiracies and the Return of Myth","start":2767.17,"end":2767.65,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #298 - 2023-07-28 - Mary Harrington - Conspiracies and the Return of Myth","start":2768.69,"end":2778.69,"speaker":"Mary Harrington","text":"There's a wonderful quote from Nicolas Gomez Davilo. He says the true reactionary is not a seeker after abolished pasts, but a hunter of sacred shades on the eternal hills. And I'm like, yeah, sign me up."}
{"episode_id":"SW - #298 - 2023-07-28 - Mary Harrington - Conspiracies and the Return of Myth","start":2781.02,"end":2781.94,"speaker":"Jonathan Pageau","text":"But it's an interesting."}
{"episode_id":"SW - #298 - 2023-07-28 - Mary Harrington - Conspiracies and the Return of Myth","start":2781.94,"end":2784.14,"speaker":"Mary Harrington","text":"I want to hunt sacred shades on the eternal hills."}
{"episode_id":"SW - #298 - 2023-07-28 - Mary Harrington - Conspiracies and the Return of Myth","start":2785.26,"end":2857.72,"speaker":"Jonathan Pageau","text":"It's an interesting time to be. So, I don't know, you probably, probably don't know about this. But, you know, I decided very similar to what you're saying that in some ways there was this strange moment right now and in storytelling where all of a sudden the normal can become bright and precious and desired. And so we're publishing these series of fairy tales, right? I'm doing a version of Snow White, and it's Snow White. I don't know what to tell you. It's Snow White. There's no deconstruction. There's no cynicism. There's no, like, weird. It's Snow White. I hope it's a very insightful version of Snow White. I hope it's a version of Snow White that will actually bring people into understanding the reason and the purpose for these ancient stories. But it's Snow White. And, you know, we. We started crowdfunding it a week ago, and we're like $200,000 in, and we still have like three weeks to go, and people are just like, raving and, and just. And people are throwing massive amounts of money at this because I think. I think in some ways that's. That's where we are. You know, Disney is going to put out a version of Snow White next year. And I don't know how they can even do it. I don't know how they can do it."}
{"episode_id":"SW - #298 - 2023-07-28 - Mary Harrington - Conspiracies and the Return of Myth","start":2857.72,"end":2858.04,"speaker":"Mary Harrington","text":"How."}
{"episode_id":"SW - #298 - 2023-07-28 - Mary Harrington - Conspiracies and the Return of Myth","start":2858.04,"end":2861.12,"speaker":"Jonathan Pageau","text":"They can't even have Snow White being woken up by the prince. It's not even."}
{"episode_id":"SW - #298 - 2023-07-28 - Mary Harrington - Conspiracies and the Return of Myth","start":2861.12,"end":2864.54,"speaker":"Mary Harrington","text":"They can't even end. They're obliged around with it."}
{"episode_id":"SW - #298 - 2023-07-28 - Mary Harrington - Conspiracies and the Return of Myth","start":2864.54,"end":2865.86,"speaker":"Jonathan Pageau","text":"What are they going to do with that?"}
{"episode_id":"SW - #298 - 2023-07-28 - Mary Harrington - Conspiracies and the Return of Myth","start":2865.94,"end":2961.77,"speaker":"Mary Harrington","text":"They're going to ruin it. You just know they're going to ruin it because they. Because they're obliged, by virtue, contractually obliged to destroy it. They have to destroy Snow White. They have to. They have to rape Snow White. That's all, you know, Disney is. Is obliged to. To rape Snow White. It can't. It can't go any other way because that. That's just where they sit archetypally in the story. But here's the thing. I mean, you know, if I say, you know, we've. We've left. We've left modernity, which is, say, the printer, and we've arrived somewhere new, you know, post modernity or digital cultural, the cyborg era, or whatever you want to call it, which has retrieved the memeplex from just being commonplace in the disparaging sense, and returned it to the common places in. In the much more powerful and historic esoteric sense, possibly at full. You know, if. If along with that, we're getting neo feudalism and we're getting a return of artistic patronage, it's just possible that we might also get a return of normal as something which is no longer disparaged and no longer abject and low status. That's been the direction of travel for a great many decades, if not centuries. To disparaging the normal as something at best taken for granted, if not actively, actively the enemy of all that's good and progressive. I think the tide can and will turn. I mean, maybe I'm over optimistic and I'm usually wildly out on the timelines. For all I know this won't happen in my lifetime. But, but I think I, I think, I think the tide is. I think the tide will turn because, you know, there just aren't any left apart from anything else."}
{"episode_id":"SW - #298 - 2023-07-28 - Mary Harrington - Conspiracies and the Return of Myth","start":2962.01,"end":2968.33,"speaker":"Jonathan Pageau","text":"Yeah, I'm a long term optimist, short term pessimist, that's for sure. And long term optimist because in any."}
{"episode_id":"SW - #298 - 2023-07-28 - Mary Harrington - Conspiracies and the Return of Myth","start":2968.33,"end":2972.78,"speaker":"Mary Harrington","text":"Case, you know, just because we've lost a normative language, we're talking about human nature, doesn't mean our nature has gone away."}
{"episode_id":"SW - #298 - 2023-07-28 - Mary Harrington - Conspiracies and the Return of Myth","start":2972.78,"end":2973.42,"speaker":"Jonathan Pageau","text":"Exactly."}
{"episode_id":"SW - #298 - 2023-07-28 - Mary Harrington - Conspiracies and the Return of Myth","start":2973.58,"end":2974.06,"speaker":"Mary Harrington","text":"You know."}
{"episode_id":"SW - #298 - 2023-07-28 - Mary Harrington - Conspiracies and the Return of Myth","start":2974.62,"end":2992.7,"speaker":"Jonathan Pageau","text":"Yeah, well, that just what will happen is that that nature will appear as suffering for some time, you know, because you can't, we can suffer perversion and distortion of our nature. We can suffer it and we will. And so that suffering is a call. It's always a call. And at some point that call has to end."}
{"episode_id":"SW - #298 - 2023-07-28 - Mary Harrington - Conspiracies and the Return of Myth","start":2992.78,"end":3007.13,"speaker":"Mary Harrington","text":"I think, I think what sits at the root, what's it to the, the behind that call and what really gives it power, in which I already see giving it power is the fact that the ultimate, the ones, the, the group that ultimately pays the price of the war on normal is children."}
{"episode_id":"SW - #298 - 2023-07-28 - Mary Harrington - Conspiracies and the Return of Myth","start":3007.13,"end":3007.61,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #298 - 2023-07-28 - Mary Harrington - Conspiracies and the Return of Myth","start":3008.57,"end":3038.15,"speaker":"Mary Harrington","text":"Because the children's, children's maturation organismic needs have not changed just because the desires of adults have changed. That's just obviously true. You know, a baby still needs what a baby needs and a child still needs what a child needs. You know, of course human cultures are infinitely malleable, but there's a baseline, right, that just hasn't changed and isn't likely to change anytime soon. And I mean, if you were to genetically engineer a baby not to, not to need or not to need its mother's love, it just wouldn't be a person. I don't know what it would be, but it wouldn't be a human being. You see what I'm saying?"}
{"episode_id":"SW - #298 - 2023-07-28 - Mary Harrington - Conspiracies and the Return of Myth","start":3038.15,"end":3039.63,"speaker":"Jonathan Pageau","text":"No, I know exactly what you're saying."}
{"episode_id":"SW - #298 - 2023-07-28 - Mary Harrington - Conspiracies and the Return of Myth","start":3040.59,"end":3133.62,"speaker":"Mary Harrington","text":"Given this, when we get to the point where we're waging war on normal to the extent of asking commercial surrogacy, for example, this is one I come back to again because it's so fundamentally at war with what. And it's such a transparent instance of placing on a baby's shoulders the sacrifices required to meet adult desire. It's so clearly what's going on there. You're asking a child to sacrifice mother, the bond with his or her mother, gestational mother, in order to meet the needs of an adult, which is radically inverts the way it ought to be and the caregiving obligations that adults are owe to children. But I think that that essential principle stands actually for most of the wars on normal, you know, where the war on normal hits the buffers, hits an immutable limit in human nature. The group that pays the price is always children. And I think enough people see that on a great many fronts. You know, I'm not going to point at them because I imagine you can. It doesn't take very much reflection to see, to see fronts where people are saying, no, enough. You know, leave the kids alone. You know, that's, that's happening on a great many fronts at the moment. And I probably don't need to point to them. I, I think that's. Yeah, people see it and people say, no, enough. You know, enough. We've asked too much of children and it's. We need to, we need to turn, we need to turn things around a bit."}
{"episode_id":"SW - #298 - 2023-07-28 - Mary Harrington - Conspiracies and the Return of Myth","start":3133.86,"end":3171.69,"speaker":"Jonathan Pageau","text":"Yeah, well, I, I hope so. I hope so. The machine is strong right now, let's just say, and it's getting stronger. Next year is going to be. It's going to be a great year for the machine. The world seems to work. The feet of the world seem to be something like the American election cycle. Like that seems to be how things happen. And so we have to be attentive to next year and see how things play out. In terms of all these questions, they're going to accelerate quite a bit. And with AI, with these, with AIs battling each other, it's going to be a wild year, that's for sure."}
{"episode_id":"SW - #298 - 2023-07-28 - Mary Harrington - Conspiracies and the Return of Myth","start":3171.69,"end":3189.81,"speaker":"Mary Harrington","text":"Yeah, it is going to be wild. Yeah, you're right. Yeah. America sneezes and the rest of the world catches the cold. You know, it remains, it remains the global hegemon. It's all. It's the Rome of our day, you know, where, where it is in the sort of Rome historic cycle is, I think more knowledgeable classicists than me need to argue that one."}
{"episode_id":"SW - #298 - 2023-07-28 - Mary Harrington - Conspiracies and the Return of Myth","start":3191.5,"end":3194.46,"speaker":"Jonathan Pageau","text":"I don't think that that one's. That one's actually not that hard to notice."}
{"episode_id":"SW - #298 - 2023-07-28 - Mary Harrington - Conspiracies and the Return of Myth","start":3194.46,"end":3195.18,"speaker":"Mary Harrington","text":"It's interesting."}
{"episode_id":"SW - #298 - 2023-07-28 - Mary Harrington - Conspiracies and the Return of Myth","start":3195.18,"end":3196.66,"speaker":"Jonathan Pageau","text":"I don't know if some people think."}
{"episode_id":"SW - #298 - 2023-07-28 - Mary Harrington - Conspiracies and the Return of Myth","start":3196.66,"end":3202.06,"speaker":"Mary Harrington","text":"Well, it's still in The Republican stage. I am not so sure. Yeah, yeah, I think."}
{"episode_id":"SW - #298 - 2023-07-28 - Mary Harrington - Conspiracies and the Return of Myth","start":3202.14,"end":3219.85,"speaker":"Jonathan Pageau","text":"Yeah, well, yeah, whatever. If it, the. Let's say the emperor is not. It's not. Is not visible yet. You know, at least if in Star wars, using Star wars terms, it's the, you know, Palpatine is still in the, in the, in the corner. Like he's still kind of hiding out. You know, we'll see if Palpatine."}
{"episode_id":"SW - #298 - 2023-07-28 - Mary Harrington - Conspiracies and the Return of Myth","start":3220.33,"end":3243.77,"speaker":"Mary Harrington","text":"I think one not at all impossible hypothesis is that we end up mapping radical egalitarianism onto the need for an American Caesar. And the only possible solution is to put AI in charge. Because the only way to not set any one person over another is to hand off responsibility and accountability to the machine."}
{"episode_id":"SW - #298 - 2023-07-28 - Mary Harrington - Conspiracies and the Return of Myth","start":3243.85,"end":3303.54,"speaker":"Jonathan Pageau","text":"Yeah. And the willingness of people to do something like that is just so surprising to me. And I've noticed it. My daughter. Yes. Yesterday got from her from the, the Quebec government. She was asked as a student to, to participate in a poll. And the, and the poll, this is from the government itself. And the poll was asking students what they thought of having AI counselors for student with emotional problems. Yeah. Because, you know, no prejudice. Come on. If it's an AI, it has no, none of the, none of the. It has no prejudice. It has none of the hang ups. Not all the, all the hate that humans have. You know, the implicit biases. It's crazy. I mean the fact that the government, that my government is willing to ask a 15 year old that, you know, send her an email and promise her $50 if she answered me that she could win $50 if she answers that poll is completely insane. Like it just shows where we are."}
{"episode_id":"SW - #298 - 2023-07-28 - Mary Harrington - Conspiracies and the Return of Myth","start":3304.73,"end":3427.77,"speaker":"Mary Harrington","text":"Yeah, there's a. I'm gonna have to go in a minute, so we might have to stop another time. But there's a, there's another piece in the puzzle. The kind of big, the big narrative from pre modernity through modernity to postmodernity, which is about, about and how that relates to storytelling and fairy tales and that's how we conceive of ourselves. Yeah. Which is something which in tandem with the, with the, the rise of literacy changes and becomes something, something much more interior. I'm sure you've read Walter Walter on. I mean when we're talking about orality and literacy and the, the transition from orality to literacy, you know, comes, comes with a transition in how people think of what. Understand their interiority in a much more general sense. And this is, you know, more and more erudite and intelligent people than me have. Have drawn links between that and the emergence of the individual as such, you know, as a feature of the modern era and then the political systems to meet and to meet and engage with those individuals. It stands to reason that that's changing again. In fact, I see it changing already. And where this relates to the idea of having an AI counsellor is because I sometimes I wonder what you think of this. It's occurred to me on occasions that the post modern understanding of selfhood or if you like the digital age understanding of what a self is, is much emptier than the print era one. It's much more, it's, it's a little more, it's less like a, it's less, it's less like a deep pool or a place than it is like a dream catcher. It's something through which things flow and upon which things can be hung. It's not, it's not a, it's not a place in which things are collected so much. And, and I wonder if from that perspective there might not be a great many 15 year olds who've, who've just internalized from a young age that understanding of selfhood and just don't really have a problem with being, being catechized by a robot because they don't think of their inner lives as being that different to a glorified autocorrect."}
{"episode_id":"SW - #298 - 2023-07-28 - Mary Harrington - Conspiracies and the Return of Myth","start":3427.77,"end":3428.25,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #298 - 2023-07-28 - Mary Harrington - Conspiracies and the Return of Myth","start":3428.65,"end":3429.29,"speaker":"Mary Harrington","text":"What do you think?"}
{"episode_id":"SW - #298 - 2023-07-28 - Mary Harrington - Conspiracies and the Return of Myth","start":3429.29,"end":3493.29,"speaker":"Jonathan Pageau","text":"Good? No, I think that's good insight. That's a good insight. And I think that all of the, all of the, like, for example, like the, even the fact that, you know, we're moving more and more towards medication as solution to all kind of mental health problems. You know, like this is the basic key shows us that the idea of the self as something that you nurture, something that you, that you, you have to align with virtue, all of these types of things that used to be a normal thing to think about the self are, are, are slipping, you know. And we see as a, we see the human as a kind of, as a complicated machine that you have to press the right buttons. And so it's like if I, if the, I can press the right buttons, it's like of course then the eye can just press those buttons and then you're, you're, you'll be fixed. If we can give you some pills and you give you pills and you're fixed. And so there isn't. I would say you're right that the, I mean the self, the idea of the soul, obviously this was the ancient idea of the soul is very, yeah, it's not as strong now and The. The. The idea of fluid identity is very popular. Like the notion."}
{"episode_id":"SW - #298 - 2023-07-28 - Mary Harrington - Conspiracies and the Return of Myth","start":3493.29,"end":3498.33,"speaker":"Mary Harrington","text":"The only. The only place. The only place where we see the soul alive and well, of course, is in gender identity."}
{"episode_id":"SW - #298 - 2023-07-28 - Mary Harrington - Conspiracies and the Return of Myth","start":3499.21,"end":3517.54,"speaker":"Jonathan Pageau","text":"Yeah. But it's. It's. There's a. There's a move towards fragmentation, and fluidity is the best way to talk about that. Like, it's so. So there's this weird relationship between pride and fluidity, which is. Which is almost like a. It's almost like a contradiction, you could say, because usually you're proud in something."}
{"episode_id":"SW - #298 - 2023-07-28 - Mary Harrington - Conspiracies and the Return of Myth","start":3517.94,"end":3527.22,"speaker":"Mary Harrington","text":"I don't know. I think there was. There was one. One very famous figure from myth and legend who was both proud and resistant to all boundaries. Who springs to mind."}
{"episode_id":"SW - #298 - 2023-07-28 - Mary Harrington - Conspiracies and the Return of Myth","start":3528.5,"end":3531.09,"speaker":"Jonathan Pageau","text":"I'm not sure I can. I can. Who is it?"}
{"episode_id":"SW - #298 - 2023-07-28 - Mary Harrington - Conspiracies and the Return of Myth","start":3533,"end":3534.92,"speaker":"Mary Harrington","text":"He's. He's kind of. He's kind of the bad guy."}
{"episode_id":"SW - #298 - 2023-07-28 - Mary Harrington - Conspiracies and the Return of Myth","start":3535.24,"end":3541.04,"speaker":"Jonathan Pageau","text":"The bad guy in most stories. Okay, that's fine. I get it. Yeah. No, that's right. That's right. Well, that's all. Yeah."}
{"episode_id":"SW - #298 - 2023-07-28 - Mary Harrington - Conspiracies and the Return of Myth","start":3541.04,"end":3544.68,"speaker":"Mary Harrington","text":"That seems to be notoriously associated with all of those things."}
{"episode_id":"SW - #298 - 2023-07-28 - Mary Harrington - Conspiracies and the Return of Myth","start":3544.68,"end":3549.84,"speaker":"Jonathan Pageau","text":"All right. Okay. We cannot. If we. We end without saying his name, that's probably a good place to end our conversation."}
{"episode_id":"SW - #298 - 2023-07-28 - Mary Harrington - Conspiracies and the Return of Myth","start":3549.84,"end":3554.08,"speaker":"Mary Harrington","text":"Yeah, yeah. Don't. Don't. Don't do that. I don't want to attract his attention."}
{"episode_id":"SW - #298 - 2023-07-28 - Mary Harrington - Conspiracies and the Return of Myth","start":3554.08,"end":3558.48,"speaker":"Jonathan Pageau","text":"I don't want to. Mary, thanks for this great first conversation. I really appreciate it."}
{"episode_id":"SW - #298 - 2023-07-28 - Mary Harrington - Conspiracies and the Return of Myth","start":3558.48,"end":3562.94,"speaker":"Mary Harrington","text":"It's been such a pleasure. I'm sorry it's been. I'm sorry it's been so short, but I have to go. I have to go pick up my daughter."}
{"episode_id":"SW - #298 - 2023-07-28 - Mary Harrington - Conspiracies and the Return of Myth","start":3563.1,"end":3568.62,"speaker":"Jonathan Pageau","text":"No worries. And so hopefully, at some point, we can do this in person. You know, something. All right, great."}
{"episode_id":"SW - #298 - 2023-07-28 - Mary Harrington - Conspiracies and the Return of Myth","start":3568.86,"end":3569.82,"speaker":"Mary Harrington","text":"Thank you. Bye."}
{"episode_id":"SW - #298 - 2023-07-28 - Mary Harrington - Conspiracies and the Return of Myth","start":3569.82,"end":3570.14,"speaker":"Jonathan Pageau","text":"Bye."}
