{"episode_id":"SW - #302 - 2023-08-25 - My Participation in a Worldwide Conspiracy","start":0.56,"end":1184.88,"speaker":"Jonathan Pageau","text":"The idea that conspiracies can't exist is a ridiculous thing. I participated in a worldwide conspiracy to convert the entire world to evangelical Christianity. And like I said, you don't need micromanaged levels, and you don't have to imagine some person sitting at the top twirling their mustache, you know, and directing everybody at every level. For this to happen, you just need common attention. You. You know, a common, implicit, and sometimes explicit recognition that we have something in common, a goal in common. This is Jonathan Pedro. Welcome to the symbolic world. So for those of you who have seen, I put out a video with Mary Harrington talking about the often mythological imaging of conspiracy theory and how we can often see through some of the fairy tale motifs or some of the story motifs that you find in the conspiracy theories to find a nugget hidden behind it, which can help us understand, you know, what is happening in the world, that it's not completely arbitrary the way that these stories show up and how they do manifest a deep distrust for the authorities. And they also often manifest some aspects of how that distrust, you know, based in actions that the elites or the governments have on us contain patterns of truth in them. But I also wanted to be careful that people don't think that conspiracies are impossible, because there is a very strange moment right now in culture where it becomes almost impossible to identify someone acting against us. And as soon as we do, we are accused of being a conspiracy theorist. In some ways, the word conspiracy theorist has become a slander that we. We give to anybody who seems to suspect the official narrative that suspects what the governments are telling us. And so the word conspiracy theorist has become a propaganda tool for people in power to prevent us from noticing when some of the actions that are being taken against us don't seem to be in our best interest. Let's say we saw a lot of that happen during the COVID era, and we're going to see a lot more of it come downstream for us. My own prime minister keeps using the word misinformation, disinformation to basically tag on any narrative that he disagrees with politically. These are very dangerous times when we see this happening. And so I just want to point you to my brother, Matthieu Pageau, on Twitter. He has been doing what I can only say is an amazing job at, let's say, analyzing and looking at the mechanisms by which we've come to think this way and by which we've come. It's become impossible for us to identify, let's say, when the System is rotten. And when there's action against us, when enemy is acting against us from within the system, and he. He really breaks it down. So it's very much worth following him and looking at his different threads on Twitter to see how it is that this has captured us. But what I wanted to talk about today is mostly to help people understand how. How conspiracies are. Are often around us, how we participate in them and how other people participate in conspiracies. And that, you know, although we do that all the time, we are now told that it is impossible for these things to exist. And so I, for example, grew up in an evangelical church. I grew up in a Protestant environment, and I participated in what can only be called a worldwide conspiracy. You know, in the churches that I grew up with especially, there was a conspiracy to convert all human beings on the earth to not only Christianity, but to my very specific version of Christianity. And this was both explicit and implicit within the structure that I had. It was both centralized and decentralized, which means that there didn't have to be strict relationships between all the different churches for that conspiracy to take effect. But we all knew that this is one of the goals that we had as churches, our own church, and churches that we didn't know about and people that we didn't know about. And sometimes it would manifest itself centrally. That mean that there would be people in power, certain evangelists or certain pastors that were, you know, considered revered or having influence, even though they didn't have a strict, you know, micromanaged relationship. It didn't have to be like an organization that is completely organized all the way through, but it was people that had influence and that we all recognize as having some kind of authority would give directions, you know, how do we evangelize movements and evangelization, different ways of doing it, and then that would trickle down in the churches so that it would affect our. The way that we did our evangelization, the way that we recognize how important it was at different moments with the waves of how important it was. And. And so this was something that I participated in. And so the idea that conspiracies can't exist is a ridiculous thing. I participated in a worldwide conspiracy to convert the entire world to evangelical Christianity. And like I said, you don't need micromanaged levels, and you don't have to imagine some person sitting at the top twirling their mustache, you know, and directing everybody at every level for this to happen. You just need common attention, you know, a common implicit. And sometimes Explicit recognition that we have something in common, a goal in common. And then people end up helping each other, working together, working decentralized and centralized towards the manifestation of that, of that, you know, that worldwide conspiracy. And you know, and so when we recognize, for example in the Rainbow Coalition a conspiracy that, to affect the world and we're told that that is impossible and it's ridiculous to state that obviously it's a conspiracy. Of course it's a conspiracy. It's a conspiracy of people that are both centralized and decentralized, that recognize a goal which is to get everybody to accept their own position. And they act in the world, they have agents in the world, you know, and so they, they try to infiltrate different organizations, just like Christians do that too. They don't do it out of weird, mischievous and like, you know, whispering behind doors. You know, it's like we want people that agree with us to be part of the institutions around us and influencing those institutions towards the goals that we think are important. And that is true of the Rainbow Coalition and it's true of Islam and it's true of, you know, different interest groups in the world and different organizations that are sometimes centralized and like I said, sometimes decentralized. This year we saw the advent of the Progress Pride flag. And so all of a sudden everywhere in the world the pride flag got switched to this new Progress flag. And so that is called a conspiracy. That is a network of people that have all agreed to do something in unison. You know, this isn't a government. This isn't like people that were elected for it to happen. It was a concentrated effort, let's say, of a series of people related to each other that all agree to do something in unison. And it's not like it doesn't have to be a totally top down thing. Sometimes it can just be everybody knows where to look. And when something changes in that direction, then everybody aligns themselves with that change without receiving orders, without receiving some like explicit orders from the top down all the way to them. And so that is very important to understand. And so we have to be able to break like this is what Matir has been trying to help people do is like to break a kind of spell on us where we, you know, it is impossible for us to notice that these patterns of aggression or these patterns of organized intention appear in the world because the media and the governments are telling us that as soon as we notice that, that it is a wild conspiracy. And so it's the same with things like the WF or globalist organizations. Those Globalist organizations, they have a conspiracy, it's called 2030, you know, and in 2030, they have goals that they want to reach, and they are organizing people that agree with them both explicitly and implicitly in order to bring about those goals. And so opportunities, any opportunity is good to bring about that goal. And so people activate themselves at different levels of this conspiracy in order for that to happen. And so when we notice it happening in the world and we call it out and we're told that we're conspiracy theorists, this is just part, this is in some ways a weapon of the conspiracy in order to prevent us to stand in the way, in order to prevent us from not wanting it to happen. And so we have to, we really have to break that way of thinking. And it's interesting because my brother Matthieu, for a few years now, he's been telling me, jonathan, you need to talk about this. You need to talk about this. And I didn't see the way to do it. Like, I just didn't see the way to do it. And so he decided to do it on his own, to go out on Twitter and to start breaking down how this works. And it helped me because I'm like, oh, this is the way we can talk about this so that it makes sense. And there is a relationship ultimately between that and symbolism. Because there is another way in which you can understand that centralized activity can happen without what people imagine to be this insanely detailed top down agreement on everything. Think about any type of hierarchy. You know, the way a hierarchy works isn't through this like explicit top down thing. There is a top down structure that moves all the way down. But, but in some ways, the people that are at different levels of the structure, they don't have to transparently know what is completely above them. In some ways, what is above them can remain opaque. And all they need is an incentive to do the thing at the level that they are. So think about a soldier digging trenches during a war. That soldier does not need to know what the general's strategy for winning a certain fight is. You know, he has to be vaguely aware that they, that they want to win the war. He has to have like, at least some direction, but he doesn't need to know all the plans coming down all the way to him. You know, he just needs his commander to tell him to dig the trenches. And he just needs enough trust and enough incentive at his level to do that. So that is also true of any type of directed, centralized, you know, action in the world. People just need to have advantage at their level in order to do that. So think about, you know, a lot of what people said were the COVID During COVID we saw a lot of this type of action, which was that the doctors didn't have to be part of some crazy conspiracy about COVID in order to implement certain things. All they needed was to have advantage at their level to do it. And it was the same with all the different organizations, all the different companies or whatever. It's like if you are handing out mass amounts of money to people who go along with the basic narrative, then that's all you need in order for the entire conspiracy to work. You don't need anybody being completely aware of whatever goals people have. You just need at your level. So if you give incentive, if you pay more money for hospitals who declare someone to be a COVID death, you know, and then obviously then you'll have more COVID death. And, you know, it doesn't necessarily even have to be that everybody there is completely shifty and is just trying to get money for themselves. It's just like an implicit thing that sets itself up when you give incentive for people to do it. And this is something that we experience all the time. And so let me give you an example in your life that you experience that I experience all the time. Right. So where I live in Quebec, there is a implicit thing which is that if you get a construction worker or a plumber or an electrician to come to your house to do some work, they will ask you a question. And that question will be, would you like a receipt with this work? Do you want a receipt? And what that question means is, do you want to pay taxes on the work that I'm going to do? Now, this will happen all the time. Almost every single person that works in construction or in these type of manual labors knows that that's how it works. So why does it happen? Well, because there's advantage for that conspiracy to exist. Because if I say I don't want tax, I don't want to pay taxes, then I don't have to pay taxes. And this person will take cash and won't declare that as his revenue, therefore will also pay less taxes to the government ultimately. And so this is something that everybody does, that everybody knows is happening. Every police officer, every politician, every single person all along the hierarchy knows that if a construction worker comes to your house, will ask you, would you like, would you like to pay taxes? And everybody plays along. Although it is completely illegal, right? There is this mass conspiracy to break the law, all of everybody agreeing to do it or not to do it, and nobody's snitching on anybody. So that there's this massive illegal activity which happens all the way through my society. And so conspiracies obviously exist. Like there, there it is, like mass. So this one isn't centralized like this one is, isn't directed. It's just an emergent phenomena. But all of these possibilities exist. It is possible also to have more centralized, directed intention like when I grew up in the evangelical churches or like the Rainbow Coalition is also doing and other different types of influences that people have. All of these things are possible. And the caricature of, of thinking that conspiracy theories are impossible because, you know, it's always this completely has to be this like top down, micromanaged thing where everybody knows what they're, why they're doing, what they're doing from top to bottom. That's a ridiculous thing. And it's ridiculous because nobody acts that way and nobody, nobody, you know, that that's not how it works because, you know, it just happens that way. Like here's another example of a global conspiracy theory. And this is going to go against a little bit the way that I talk about Santa Claus, which is that every year, you know, millions of parents tell their children that there's a man in a red suit that flies above their house and is going to land on the house and bring gifts to the child. And then not only the parents, all the companies do that. Every single company is advertising advertisement, you know, talking about this red man in the suit that flies around and brings gifts to everybody. And not only that, the government is involved. If your child writes a letter to Santa Claus and sends it through the mail, then that letter, you know, will get to the post office and Santa Claus will answer and send it back to you. You know, and there isn't an actual red man who does this. All of these people from the very, from the president or the prime minister of your country through the entire, you know, system of the government, all the corporations and all the families are participating in this worldwide conspiracy, you know, to tell children that Santa Claus exists. And the answer is yes. And the reason is because Santa Claus exists, he doesn't exist exactly in the way, but there's a principality acting on all of these levels and making it, making it happen. And so that is also true of other types of conspiracies. That is, there are principalities acting out in the world and everybody can participate in them without having to get a memo from the Secret boss or whatever. And, like, you know, suspiciously acting, you know, in secret so that nobody knows what you're doing. And, you know, the way that people imagine, like the Illuminati or the Freemasons or whatever, it's like. It's just the way that systems of intention actually manifest themselves in the world. And so I would say, you know, it's very important on the one hand to look at a lot of the stories that come out. I mean, obviously a lot of, you know, there are a lot of conspiracy theories that are just blatantly false that are. And just because some conspiracy theories are blatantly false doesn't mean that conspiracies don't exist, that conspiracies can't happen, and that governments can't act against their people, and there can't be faction within governments that act with other intentions besides to serve the people. All of these things can be true at the same time. But when we fall to this weird fear, and I felt it myself, because I myself have been. I like. I don't want to be called a conspiracy theorist. You know, I don't want. Because that's like the worst thing you can say about someone. But I think it is in some ways time to break away from this kind of simple thinking and to be able to rather discern when we are seeing, you know, concerted action in different directions and be able to recognize different agencies working through the world. Even if we know that the people implementing it at the lower levels don't know what they're doing, that they don't necessarily have a vision of the grand scope of things, it doesn't really matter. They only need reason to act at their own level. And that can just be money, can just be prestige. It can just be to look right in front of your neighbors. It can just be like social acceptance. There are all kinds of reasons why conspiracies can happen in the world and that everybody can participate them, you know, without knowing what the end goal is. So that is, you know, a few thoughts on that, because in with the discussion with Mary Harrington, we kind of talked about it more in the fairy tale, mythological way, which I think is important to understand and to see. But I wanted to be careful that people didn't think that I was saying that. Therefore conspiracy impossible. It's like, no. Yeah. There are sometimes necessarily. That's just how the world works. There is directed action in certain directions, sometimes explicit, sometimes implicit. But we have to be able to recognize it when we see it. So hope this was helpful. Thanks. For your attention and I will talk to you very soon. If you enjoy these videos and podcasts, please go to the symbolicworld.com website and see how you can support what we're doing. There are multiple subscriber tiers with perks. There are apparel and books to purchase, so go to the symbolicworld.com and thank you for your support."}
