{"episode_id":"SW - #089 - 2020-01-15 - The Road From Equality to Inversion","start":0.56,"end":946.93,"speaker":"Jonathan Pageau","text":"So many of you will have watched my video Symbolism and Propaganda by now on my channel. It's become one of my most watched videos. And I see a lot of commenters talk about the problem, noticing in the stories these strange figures of, you know, the woman who beats all the men up and humiliates them. And I see a lot of people complain about it, but I don't see a lot of people understand why it is that this is happening, what mechanism is bringing about this type of narrative. And so I thought that it would be a good idea to go into understanding the relationship between hierarchy, the desire for equality, and how this desire for equality actually leads to inversion to upside down behavior. And so hopefully we can go through a few stories. I can try to explain it to you as much as I can. This is Jonathan Pageau. Welcome to the symbolic world. Now our culture is obsessed with freedom. Freedom is one of the main qualities ever since the Enlightenment, this idea that men should be free, that people should be free, that they should not, that hierarchy itself is dubious. The notion that something that is above you will necessarily be tyrannical, will necessarily show itself as imposing order and doing it violently or through abuse. And so of course this is possible. This has happened numerous times in history. But it is not the only way that things can lay themselves out. And through the revolutions and through kind of the ascent of liberalism, we, we've had this idea of equality, that equality is the main value, let's say that we hold onto. Now, equality is a bit of a problem because equality is something which ultimately doesn't end up meaning much, because when we say that two things are equal, each thing has an innumerable amount of qualities. And so what do we mean when we say that they're equal? Are they equal in value, monetary value? Are they equal in strength? And if you're talking about two people, intelligence or strength, or, you know, the capacity to hide or the capacity like whatever, we have an innumerable amount of capacities. And so when we talk about people being equal, this is very problematic. Of course, in the United States they have the notion that people are equal under the law, which is already a better solution to the problem of equality. But usually when people think about it in, you know, in terms of their philosophy or let's say they're just taken for granted values, they really have this notion that people are equal or that different groups or different people, that they're equal. This is of course, mind numbing to the extent that it, it prevents you to think. And what it does is it Also prevents a very simple truth, which is that we are all participating in different hierarchies. There are all kinds of hierarchies going around us. We are all engaged in them. And most of the time, in each aspect of our life and in each aspect of our being, we are somewhere in some kind kind of hierarchy. We have people below us and we have people above us. And when we have this idea of freedom, this notion of the free person, we can kind of understand the satisfaction which comes from being above, being on top, winning all this stuff. We kind of understand it in this kind of cult of the individual. We also have this cult of the winner and of the individual who succeeds. And so we can kind of understand the satisfaction of rising in a hierarchy and becoming the top of a hierarchy. But what people struggle, or at least deny, more normally deny, is the satisfaction which comes from actually submitting yourself to a higher level in a hierarchy. And I know that people are going to be watching this, and just me saying that is going to create a kind of friction in them that I would even suggest the idea that we get great satisfaction from submitting ourselves to something, to someone which is higher in the hierarchy. But I would say that if you. If you have that feeling in you, it's really because you're denying reality. And so what I'm going to do, I'm going to point to a few stories so that you can see that everybody has that desire. In popular culture, we still have some of. We still have tropes of this satisfaction of submitting yourself to something which is above you. The main trope that you can imagine is, for example, the knight who looks for a king, A king that is worthy so that the knight will give service to that king. We also have the trope of the student in kung fu movies, for example, the trope of the student who is looking, who is yearning to find a master and. And submit themselves to a master. One of the reasons why people like the first Star wars movie so much was the fact that you have this. This kind of irascible Luke character that can't find his way, that is kind of. Kind of hungry, kind of looking for meaning. And when he finally meets Ben Obi Wan, he is able to become his apprentice. And that relationship, it can be fraught, can be. Can be frustrating. But you can see you find great satisfaction in actually seeing a student get put in his place by the master. One of the best versions of this, this story was in the Karate Kid, where, you know, the. The young man comes to this karate Master. And the guy says he's going to teach him. And at first it looks like the karate master is actually abusing the young man. He, he's forcing him to paint his fence, to wax his cars, and he's kind of doing this. And then he gets so frustrated, he's like, well, what am I going to learn? Karate? You know, you're teaching me all this stuff, it's useless, it's pointless. You're making me do all your chores, what am I going to learn? And then you have this moment where the master puts the student back in his place as he's demonstrating to the student that everything that he has done was in order to elevate the student. Okay, so there's extreme, extreme satisfaction in, in finding that. And like I said, this whole idea of a knight who submits to a king. You can also see it in stories about coaches. You know, all these movies that have a team, ragtag team. And finally at first they don't listen to the coach and the coach finds a way to bring them together and to listen to what the coach is directing them to do. And then they win the championship, something like that. But the importance is to understand the great satisfaction that we find in seeing people see, submit themselves to a higher authority. Now it's really important to be able to acknowledge that and to understand that it is something that we are all searching for, that we all have a desire to submit, to submit ourselves to a worthy authority, to something which is above us, which is worthy, which is worth our attention, which is worth our submission. And ultimately what that is, is really pointing us towards the whole idea that we need to be submitted to God, that we need to be, that we need to put ourselves below God. And that actually brings the greatest satisfaction. And we see it in the Bible that every time someone, you know, even St. Paul talked about being, freeing yourself from sin. But when you free yourself from sin, you do it in order to submit yourself to God, to become a slave to God, to so that you, you're actually submitting yourself to the most worthy thing. When we have this idea that you can somehow free yourself and just be your own person, we are deluding ourselves. We are, we are living in an illusion, illusionary world. And what happens when we do that? When we have this idea of the, the kind of self fulfilled individual, the individual who is his own God or who is his own, the own summit of his hierarchy, what ends up happening is the satisfaction that we get from watching someone submitting or participating in the submission of one thing. To a higher thing will end up coming back in very strange and disturbing ways. And it's going to be inevitable. And we can see that in the modern world, the ultimate trope has been the trope of the underdog. The underdog has been a way to, on the one hand, signal that we don't believe in hierarchy, that hierarchy is somehow evil, that this idea that there's a team that's really, really good and a team that's really bad, that somehow there's something wrong about that. And to watch the lower part rise up and ultimately submit the higher one is something that we have. We, despite our desire for equality that we find acceptable, that we could we allow ourselves to. To find pleasure or to find satisfaction in watching something which was below rise up and submit what was above. And the reason why we have that satisfaction is, like I said, because the this, the desire to watch that, the desire to participate in that is in us. It is a part of being in the human world. It is a part of being human being to want to submit yourself to something above you. And so what do you do when you have this notion of equality? You have to find strategies in order to give people that satisfaction while at the same time denying the very structure. And so it creates all these very weird things. Now, the underdog isn't so bad because there are traditional versions of these stories of underdogs who kind of rise up and then take. Take power. But as the. That way of thinking accelerates and takes up more and more room in our society, what we end up seeing is stranger versions of that, very stranger versions of that. And so imagine that you're making a commercial and you want to use that satisfaction. People are doing this unconsciously, hopefully to the. Let's hope that they're doing it somewhat unconsciously. You want to use that satisfaction. You want to use the showing of something being submitted, something being put back in its place, and you want to bring that out in the person you're making the commercial for. Now, in a world where you have preached equality, equality, equality, there is only one way to do it which seems ethical. And the only way to do it is to show the lower party submit the higher party. And so if you have a situation, and we've seen it so many times in commercials, where some person shows up the other person, it now will ultimately always be a woman who shows up a man. And why? Because it. Because we have the desire to see that relationship, but we also want to deny that relationship. We want to affirm a kind of equality so the only way to do it is through inversion. And that is how upside down behavior starts to become prominent. It. It doesn't become prominent right away in a desire to invert, it becomes prominent in the desire to equalize. And in that desire to equalize, it will inevitably lead to inversion. And so that the same thing will happen in. If we don't attend to that and we don't realize that there are honorable ways to show this. You know, like I talked about the student and the master who learns from the master, as you discover that the master's harshness towards the student is there in fact to help the student become better. You see that in trope sometimes in movies where there is a military, and you see that really, really harsh commander who's super tough on his. On his men. But then you realize that he's doing it to help them and that he's actually willing to sacrifice himself for his men if push comes to shove. And he's doing it to raise his men up so that they be ready for what he is waiting for them. And we, like I said, we find great satisfaction in that. But then if we, if we are not attentive and we let that pattern in our kind of come unconsciously in us, then we have, and especially if we're declaring equality, then we have the figure of the disturbing figure of the dominatrix which appears everywhere in culture and it's kind of creeped in and has appeared everywhere in culture. And you can even understand the very disturbance, disturbing ascent of the pattern of cuckolding. This notion of people who want or desire to see their spouse cheat on them is that problem is the problem of somehow thinking that there's something wrong with the relationship of a man and a normal relationship of a husband and a wife and a man and a woman, but still wanting to see that play out despite your desire to be equal to. The only way for it to come about is to give to the exterior, to give to the, to the stranger, so that the stranger will enact that desire that you have in you, which is actually a normal. Which comes from a normal place, which come from a normal desire to see that relationship play itself out. And so I think it's really important to understand that as we're watching culture and to understand the mechanism of inversion. And, and it's not just that we look and we see the inversion. It's that the, the very desire, like the very mechanisms of democracy and, and, and democratic notions and the very desire to have everything be equal ends up being what brings about the inversion. And so I hope that this has been helpful to help you understand how this works. And as we work towards bringing back those natural desires in a normal way, hopefully it will at least help you be attentive to that when it pops up in your own mind and in your own in the own way in which you find satisfaction in seeing that that dynamic play itself out. So thanks again everybody and I will see you soon. I hope you enjoyed this episode of the Symbolic World. The Symbolic World is edited by Justin Ward and it is based on a series of videos that you can find on my YouTube channel, Jonathan Pageau's YouTube channel. You can also get involved There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course leaving a review on itunes. Everybody knows that's the best way to to get the podcast out there to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon Pageau videos as well and on SubscribeStar, all those links you can find on my website or in the show description. So thank you and I will see you soon."}
