{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":0.16,"end":59.17,"speaker":"Laura Diaz","text":"Tucson, the weight is over Mediweight loss. They're officially open on North Oracle Road. That's right. No more counting down the days. You can walk in right now and start your journey to a healthier you. Hey, it's Laura Diaz from iheartradio and you can trust me. This isn't just another weight loss clinic. I know that because it's where I lost weight safely with real medical support. GLP1 medications. You can see them everywhere online right now. But the truth is your health shouldn't be a DIY project ordering these meds without the professional guidance. It can lead to dangerous mistakes, wrong doses, no oversight, and serious risks at mediweight loss. I got the same medication but with a customized plan, weekly check ins, and a licensed physician guiding me every step of the way. And the cost? The same as those risky online options. Tucson, your moment is here. If you're ready to take control, feel better and lose weight the right way, mediweight loss is ready for you. Walk in, get started and see real results. Call or visit mediweightloss.com to learn more and book your free consultation today."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":59.25,"end":130.33,"speaker":"Jonathan Pageau","text":"That's mediweightloss.com we're used to thinking that magic, bad and everything that's not scientific is basically sorcery and evil. And that's the way it's kind of treated as in, in mainstream Christian thinking. But that is not in the middle ages. That is definitely not how it was treated and not during the Renaissance and, and not during the Reformation. It's kind of moving to. As the age of enlightenment comes because in some ways, some of the oppositions to all forms of magic are actually a conflict between science and religion rather than a conflict between Christianity and some, you know, some of these practices. This is Jonathan Pedro. Welcome to the symbolic world. Hello everyone. I'm here with Deacon Seraphim who now properly looks like the true intellectual that he is."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":130.33,"end":130.81,"speaker":"Dcn Seraphim","text":"That's right."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":130.81,"end":132.65,"speaker":"Jonathan Pageau","text":"He is getting set. He is set up."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":132.65,"end":132.97,"speaker":"Dcn Seraphim","text":"We're."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":132.97,"end":140.09,"speaker":"Jonathan Pageau","text":"We're finally seeing all the books that he talks about. We are, we're finally realizing that they exist. They're not just. They're not just in his mind."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":140.49,"end":146.57,"speaker":"Dcn Seraphim","text":"That's right. You. You don't really know somebody's a serious intellectual unless they have books behind them on YouTube. So."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":148.59,"end":160.91,"speaker":"Jonathan Pageau","text":"But it's nice to see your studio kind of coming together and you becoming more and more of a deacon with the hair growing and the cassock and everything. It's like suing the ponytail. It's wonderful. We love it."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":160.91,"end":165.43,"speaker":"Dcn Seraphim","text":"That's Right. Well, you know, it's dress for the job you want, I guess. I don't know."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":165.43,"end":169.95,"speaker":"Jonathan Pageau","text":"It's really dress for the job you want. So what are we talking about today?"}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":170.35,"end":306.49,"speaker":"Dcn Seraphim","text":"So I thought we would talk about magic. And usually when I do these videos with you, it's really. Because I have things I can't figure out. And so I do all of this work to get basically, like, so that we have the premise of recording a video together. And then somewhere in the middle of this conversation, I'm just gonna throw out random Jonathan, what's actually going on with this weird thing. So we're gonna do that with magic today. So there won't be any warning. I'm just gonna throw it at you and be like, please explain this bit of, like, this weird thing. I don't understand why it's a thing. No. So everybody has been clamoring for, you know, the universal history of America for quite some time now. And there's a lot of different angles that we could kind of hit that with. One of them is that we could just take a look at the. The, you know, like, the American civil religion and things like that. And I do intend to do that at some point. It's really interesting to me. Today is actually an American civil holy day, which is why we. To record, because I have to be at work. But the thing that I'm kind of really more interested in is actually kind of American religion and why American religion is the way that it is, which is actually pretty odd, historically speaking. Even the fact that there's some kid that grew up Baptist in the buckle of the Bible Belt and he could become an orthodox deacon, that's a pretty weird thing to be able to. What I want to do is over the course of the next two or three Universal History episodes, probably, I want to look at some of the aspects of American religion. And along the way, we will also handle. I know everybody on X got super excited because I tweeted a picture of a particular critter from Appalachian folklore and folk magic. And everybody is like, oh, we're going to get a Cryptid episode. Are you going to talk about Chupacabra and stuff like this? Not this time. We will probably do that at some point because it would be fun to actually talk about some of the American monsters."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":306.81,"end":308.09,"speaker":"Jonathan Pageau","text":"I think it's a great idea to."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":308.09,"end":356.09,"speaker":"Dcn Seraphim","text":"Do that, but I basically have a planned segue into this. And so since we're talking about the symbolism of America, we are, of course, going back to Europe today and specifically Europe at The time of the Reformation. So I thought it would be good to talk about. So what I really want to talk about today is American folk magic in the context of American Christianity and the way that those things interrelate. And to do that we have to go back to the Reformation and look at how magic, superstition, sorcery, witchcraft, alchemy, astrology, divination, the way that all of these things are basically handled at the time of the Reformation, which I think will probably surprise some people."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":356.94,"end":394.28,"speaker":"Jonathan Pageau","text":"Yeah, because we're used to thinking that magic bad and everything that's not scientific is basically sorcery and evil and that's the way it's kind of treated as in mainstream Christian thinking. But that is not in the Middle Ages. That is definitely not how it was treated and not during the Renaissance and not during the Reformation. It's kind of moving towards that as the age of Enlightenment comes. Because in some ways some of the oppositions to all forms of magic are actually a conflict between science and religion rather than a conflict between Christianity and some, you know, some of these practices."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":395,"end":407.64,"speaker":"Dcn Seraphim","text":"So do you want to define for us what magic is? Or like, what do you think magic is? Because, because actually this seems to be one of the big questions actually is like, where's the line between religious practice and magic?"}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":407.8,"end":478.42,"speaker":"Jonathan Pageau","text":"Yeah, well, I think that the way to understand magic is to understand it as influence. And so it's something like influence through meaning and influence through the way that will influences the world and the way that happens. So that is a very vague description, but I think it encompasses the most. Magicians kind of understand that our intentions and our meaning making can affect reality and they develop certain practices in order to kind of master those effects in different ways. And that is the basic idea. But then it can also obviously be a, a way to tap into other forms of meanings to let's say higher or you know, transhuman forms of meaning and death. That's when you enter into like demonology and the idea of invoking spirits and all of that, so you can see how they're related. But basic, basic kind of sympathetic magic, wearing amulets, you know, the, the idea that there's a relationship between causality and meaning and we can influence that. Does that. Is that a good enough?"}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":478.58,"end":495.14,"speaker":"Dcn Seraphim","text":"Yeah, I think definition, I think that's nice and broad and, and good for what we're talking about today. Now, I guess a follow up question, I told you I was going to throw these things at you. A follow up question would be something like what's the difference between magic and superstition or is there a difference?"}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":495.7,"end":526.58,"speaker":"Jonathan Pageau","text":"Well, they're not, they're definitely related. They're definitely related because in some ways they're, they're related to the noticing of superstition. Usually it's about avoiding things. Not always, but a lot of it's about avoiding things. So you perceive certain patterns and then you have to do something to counter those patterns. And when you. In the symbolism master class, I did a few analyses of some of these superstitious patterns and now they're actually deeply meaningful most of the time because they, they've just been refined for thousands of years."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":526.98,"end":589.79,"speaker":"Dcn Seraphim","text":"So, yeah, I, I really liked your explanation for some of those things in the masterclass I was talking to, you know, so I come from like a Protestant missionary family, you know, and so a lot of times they'll talk about how, you know, just like in, in these circles I run in family and friends and things like that, people talk about how they, you know, they have these certain practices in the old world and this is all obviously just superstition and we need to cut that stuff out. And it's not, you know, not just among, you know, you know, pagans, like, you know, in, in my case, my, my family were missionaries in Asia. So it's like Buddhist, Taoist, so on. So it's not just those practices, but it's also the practices of, you know, Christians who come over. But maybe they bring something like synchronous with it, synchronous with them, or obviously the superstitions of, of other kinds of Christians, like Orthodox Roman Catholics, et cetera, define that. Like, yeah, all of that stuff kind of gets like lumped together. So that's the first thing I want."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":589.79,"end":684.6,"speaker":"Jonathan Pageau","text":"To do is let's disambiguate the idea, the modern idea of superstition and the, you know, the, you could say the Enlightenment vision of superstition is that ritualization is meaningless. There is no relationship between ritualized behavior and the effects in the world. And, and you see that if you listen to some of the new atheists, they talk about magical thinking, they criticize magical thinking, which is the, the idea that you can perceive meaningful structures and you can invoke mean structures and that will affect the world. That, that is superstitious, that the world actually doesn't work that way. Right? The world is a bunch of things bumping into each other and it's all this, this, these types of mechanical causes. But I think that at this point, most people watching these videos will realize that that's just not the case that in fact there is a verticality to meaning, even if it's only the very identities that you perceive in the first place, you know, there's a reason why you perceive them. And therefore there is always verticality in, in the way the world lays itself out. And there's always, you know, if you, if you can disambiguate some of the mythology around magical thinking, you realize that you do it all the time. You're always doing action at a distance. When you use influence, you're, if you ask someone to do something for you, you're using, you're using words to get something to happen that you're not doing yourself, you know, which is in the magical mythology that gets. There's a shortcut. But you're always kind of doing things like that where you're in using your influence and meaning making in order to make things happen in the world."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":684.76,"end":801.01,"speaker":"Dcn Seraphim","text":"Yeah. And very often magical traditions, even like folk magic traditions within a Christian context, which is kind of what we're going to be talking about today. Magical traditions use the idea of like bringing down something higher, something like more powerful. So a good example will be in a lot of Protestant folk magic in the United States, which we'll talk about a little bit later in this video. One of the things that is used as a, as like a major part of what, what like a modern person or anthropologist would consider to be folk magic is psalms. Like they use different psalms for things and, and from a folk, from, from like an anthropological perspective or you could say like a very, let's say like a very pure version of Protestantism, which I'm basically going to argue. I don't think has really ever existed anywhere, not in the way that, you know, like you would like it to be like laid out on paper. And that's not a dig, by the way, guys. That's. I'm just, I just, you know, like, I want to be really clear when I'm talking about these things today. What I'm, what I'm trying to, what I'm trying to do is talk about the actual experiences that people had and actually brought over here. Yeah. And in those, in those, you know, and so anyway, in that way of studying it, you would say, oh, so, so and so is sick. And there's this. You've got to use this herb and you've got to say, you know, you got, say these prayers. And it starts with you have to use these psalms. And you're sort of like, from a, from like a modern perspective, you'd Say, oh, you're using the psalm like it's a magic spell. Right. And they would say, no, it's like this is like, it's the Psalms. It's like a holy thing. And I'm not really arguing for the folk magic either, but I'm just saying from their perspective, the thing they're doing kind of makes sense because from their perspective, what they're doing is they're bringing in something that has the power of God and they're bringing that in and they're trying to basically use that to get an outcome that they're hoping for. Right."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":801.33,"end":834.98,"speaker":"Jonathan Pageau","text":"So, yeah, in some ways you're, you're, you're basically seeing scripture as a type of incantation that is influencing the world. And therefore it's like if you say these, these words, if you, if you use these words, you can have, you can influence the, the disease. Obviously. It's not, it's not a, there's not a trade off. You really do believe that God is acting through this. It's not like it's, I don't think it's cheap, but, but it is. That's what it is. It's saying, here's a certain kind of incantation. I can use it and therefore it will affect the world."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":835.06,"end":839.14,"speaker":"Dcn Seraphim","text":"Yeah. And the question then is, of course, like, what's the difference between that and prayer?"}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":841.06,"end":864.48,"speaker":"Jonathan Pageau","text":"In this particular case, I don't think there is a difference. I think it very much is prayer. In the orthodox tradition, we have prayers for the sick. We ask God to heal people. We have certain prayers that we do. We also will pray and invoke the prayers of certain saints. We'll ask certain saints to pray for, for the sick and for us. And so these things are very similar, you know."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":864.88,"end":925.4,"speaker":"Dcn Seraphim","text":"Yeah. All right, so we'll come back to more, some more of the, maybe the kind of differences between these things. And I will share some, I will share some secret lore from my childhood that is actually related to all of this. But so I want to begin with this kind of idea that we sometimes have about the Reformation. It was certainly like the idea of the Reformation I was taught growing up, just as a refresher, you know, I grew up in a very, you know, kind of like reformed Baptist tradition. And in fact, on October 31st every year, we had a Reformation Day party while all the cool kids were doing Halloween or like trunk or treats down at the megachurch down the street, we had a Reformation Day party. And people would literally come dressed as like, Martin Luther. And one year this girl actually came dressed in a pickle barrel because of the story about Katarina, Luther's wife, who was like a nun and they smuggled her out of her monastery in a pickle barrel. And so anyway, like when it comes to like these guys, people come dressed."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":925.4,"end":926.12,"speaker":"Jonathan Pageau","text":"Up as the Bible."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":928.92,"end":941.68,"speaker":"Dcn Seraphim","text":"Only the nerds did that. I mean, did that. Yeah, yeah. But I mean we put on like a ref, we put on like a, like a play, like a Reformation Day like play. I wrote several of those, by the way."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":941.68,"end":942.28,"speaker":"Jonathan Pageau","text":"Amazing."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":942.52,"end":1190.04,"speaker":"Dcn Seraphim","text":"So like I, I, you know, like when it comes to, like when it comes to these reformers, I mean, these are characters I know well, this is a big part of my childhood. And of course the sort of the things that we tell, the stories that we would tell is something like there's all this clutter, there's all this superstition and then these guys come in and they remove all the clutter, they remove all the superstition and all you have left is pure doctrine, right? The doctrines of grace, like the pure doctrine. So one of the guys who did this, who's not as well known as like Luther and Calvin, but is quite important, he was working during, he kind of came to prominence during Luther's kind of time in exile or there was a time when Luther wasn't writing. A lot of people thought he was dead, but it was actually his university chaplain, Andreas Karlstadt, and he publishes a treatise called On Holy Water and Sacred Salt. And this is a really important treatise in the early days of the Reformation. This is published in 1520. And basically his argument in this. And I'll just take this from Carlos Erie's wonderful book called Reformations, which is a book I just strongly recommend to people. If you want a really even handed look at the period about the 300 year period leading up to and then following the Reformation. The wonderful thing about this book is that it does not treat the Protestant Reformation as this thing that came along that was like totally sui generis just appeared out of nowhere. Everybody was blindsided by it. But he shows that there's actually a continuity of reform movements that happens over the 15th, 16th, 17th centuries, of which the Protestant Reformation is a central part anyway. So in his summary of this unholy water and sacred salt text, which as far as I know, I've never been able to find a translation of it. I've read it in German, but I've never been able to find a translation of it in modern English. So somebody has a good one and they want to send it my way, I will share it because it's quite interesting. And to me, it really kind of sums up the shift that's happening at the time, or at least the shift that the sort of intelligentsia of the German Reformation is trying to push at that time. And here I would not. You know, this was a. Carlstadt goes a bridge too far for Luther. So again, just to be totally fair, like, a lot of the things that Karlstadt is saying are things that Luther would not have accepted. But what he basically argues in this treatise on holy water and sacred salt. Why holy water, modern sacred salt, you ask? Because these are the main things that are used in Western Roman Catholicism to combat demons, right? Even the sort of like the pinch of salt over your shoulder, right. That's all related to this association of holy water and sacred salt in particular. Obviously, salt is used. Part of. Sacred salt is part of what is used in the purification of water for baptism and so on, that these are things that are used specifically for as like, parts of spiritual warfare. And in this text, Carlstadt argues that matter and spirit are so radically different from each other that they are completely incompatible. So you can never have a physical object or a set, a series of physical actions that affects the spiritual world in any way, at least not in a positive way. And this is a very important qualification because of course, everybody believes that you can continue, like, you can do things with your body that are sinful and that will damn you and send you to hell. Everybody continues to believe that. But the idea that there could be something physical that actually somehow results in the purification of the world, the exorcism of the world, you know, like those things Carlstadt really kind of tries to push out. And so, wow, that's amazing because it."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":1190.04,"end":1214.75,"speaker":"Jonathan Pageau","text":"Actually accounts for a lot of things, like why people don't kneel, why, you know, any kind of physical action that you would do, any kind of physical discipline he can. Discipline of fasting, all of this stuff is actually seen as suspicious because it seems because of this. And I never thought that people still believe the opposite, still believe that in some ways the body can drag your spirit into. Into. Into sin, but not. Not."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":1215.07,"end":1262.32,"speaker":"Dcn Seraphim","text":"And my, My guess is that if Carlstadt were, you know, like, if you were to push him on this, he would say, oh, well, that's because it's a. It's a. The. The things you're doing with your body are downstream of, like, your will. And it's like the will is choosing to rebel against God. So that's actually the thing you're being punished for, not actually the Physical action done with your body. But. And so, like, that's my guess about how that would probably be. Would be rationalized. But the. So, so what. What he argues is basically that material symbols cannot convey spiritual benefits. That's the. That's the. That's the idea. So that the material symbols are signs that point that could maybe, like. But they're like road signs that maybe point to a higher, unseen reality, but they don't have. But, But. But the sign is arbitrary, right?"}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":1262.32,"end":1265.16,"speaker":"Jonathan Pageau","text":"We have formed by the spiritual thing, right?"}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":1265.16,"end":1265.64,"speaker":"Dcn Seraphim","text":"Yeah."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":1266.44,"end":1275.64,"speaker":"Jonathan Pageau","text":"Like radical separate. It's not the idea that spirit forms matter, but rather that there's spirit and there's matter and they're separate and they have their separate rules and separate ways of functioning."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":1275.72,"end":1283.96,"speaker":"Dcn Seraphim","text":"And basically, you could decide to make the sign something else. That. That would be okay. Yeah, yeah. Wow. And so, hello, nominalism."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":1284.04,"end":1284.44,"speaker":"Jonathan Pageau","text":"Like."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":1284.76,"end":1601.2,"speaker":"Dcn Seraphim","text":"Yeah, yeah, exactly. Right. Yeah. So. So Karlstadt argues. He says he wants Christians to stop acting like brute beasts. Right. So the idea is, like, if you want to be like, you know, like, stop living this animalistic existence where you're like, in the world, and instead let go of this nonsense. He follows us up a year later with a treatise on vows, in particular clerical celibacy and monastic vows, but then also in there also against the cults of the saints, against holy images, basically, you know, making the argument that all of this is idolatry, which, again, is not something Luther would have really agreed with. And then he. And then he, you know, follows that up with another treatise about a few months later called on. On both forms of the Holy Mass, which is basically an attack on the Eucharistic theology of the Roman Catholic Church. And so it's. It's. It's proposing. It's denying the. The sacrificial dimension of the Eucharist, and then also spiritualizing the understanding of Christ's presence in the bread and the wine. We're not quite to Zwingli yet, but we're getting there. So again, it's just this decoupling of the world of spirit and matter and basically treating those two worlds like they're totally separate from each other. They don't have anything to do with each other. The world of spirit and the world of matter, they can have associations, but the associations of the signs are essentially arbitrary. That's the idea. And so the idea is that this is supposed to be this sort of the pristine idea that the Reformation brings about. Like, on paper, everything is nice and clean now. Right. You know, so in one of the Swiss towns, you Know, they throw out all the images they paint over all the frescoes. And Zwingli writes in his journal, all the churches are so beautifully white. And that's on paper. That was like, that's the triumph. We cleared out all of the clutter. We got rid of all the stuff that's kind of overly associated with matter. Overly. So now we can worship God with our minds. Because things that are in your mind are spiritual. Truth. Yeah, right. Things that are in your mind are spiritual. I mean, to me, this is like, one of the basic. In my opinion, obviously it's a flaw, but it's one of the basic assumptions of the modern world is that stuff that you do with your mind is spiritual, as though your mind is also not part of your body, you know? So in any case, the idea is we're supposed to restore the church to this ancient, pristine form where everything is clean and everything is spiritual. And so the way that Erie describes this is this idea that there's, like, barnacles on the ship of salvation. And what they're trying to do is just like, scrape all of that. That. So everything could be perfectly clean. So the ships, the churches can be beautifully white and so on. And the idea is that. Is that once we do this, we did it, guys. We got rid of all the superstition. This idea of the Reformation basically only existed for, like, five minutes, Very, very, very quickly. Magical traditions, folk magic, superstition, all these different things kind of start pressing in. And in this sense, I even think that maybe when Max Weber talks about the idea of the disenchantment that the Protestant Reformation brought to the world, which Weber, by the way, thought was a good thing. He's very pro. Disenchantment that this never really existed on a. On a. Like, a ground level. And I will try to actually give some examples again, kind of from my own life and experience. So in the Middle Ages, or like, coming out of the Middle Ages, in the Middle Ages, superstition is very. It's very particularly defined. So, for instance, Aquinas defines superstition as a vice opposed to religion by way of excess. So this is not because in the worship of God, it does more than true religion, but because it offers divine worship to beings other than God, or it offers worship to God in an improper manner. So for Aquinas and for basically medieval theologians, that is what superstition would be. It would be if you offer worship to someone other than God, which everybody agrees you should not do. Now, we might disagree about whether, you know, there's a difference between worship and veneration, etc. Etc. Like all the polemics, it's not important to get into that stuff here, but everybody agrees worship should only be offered to the most high God. All Christians agree on this. So superstition is something that either offers worship to someone other than God or that offers worship to God in a manner in which he has not. Not asked to be worshiped."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":1601.2,"end":1602,"speaker":"Jonathan Pageau","text":"Yeah, yeah, yeah."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":1602,"end":1626.94,"speaker":"Dcn Seraphim","text":"And so this is, you know, the good example of this in the Old Testament is the strange fire that the sons of Aaron offer. Right. We don't exactly. We don't even know what the strange fire is. Like it's some kind of incense or it's some kind of sacrifice. But it's. The point is, is that probably something like they're offering worship to God in the after the manner of the nations around them instead of the way that he is commanded in the law. It's something like that, that. And so God, I mean, there, you."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":1626.94,"end":1663.32,"speaker":"Jonathan Pageau","text":"Can imagine all kinds of weird things that would pop up in. Even in Christian churches that are just random people. People decide, I don't know, they decide that they're going to come to church with like some red symbol painted on their forehead. And then they're like, what's happening? People start doing weird things. And some point the priests and the bishops have to say, okay, this practice here, this is not, this is not traditional. This is just some aberration that has, that has appeared. Like one of the traditions in, for example, that led to the iconoclastic controversy was people scrape the paint off and then would drink it as a kind of remedy. And the church was like, nah, no."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":1663.32,"end":1664.56,"speaker":"Dcn Seraphim","text":"That'S not how icons work."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":1665.28,"end":1670.96,"speaker":"Jonathan Pageau","text":"Images, they're not like material. The materiality of the icon is, is quite secondary to, to its function."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":1672.32,"end":2037.1,"speaker":"Dcn Seraphim","text":"I'll give you a fun example from France since that's. That's my bit now, is just slagging off the French. So now that's your bit now? Yeah, yeah. Well, you know, you've never done that. Yeah, very kind of notorious case in the 13th century. There was some Dominican inquisitor who found that some peasants in southern France, you probably know the story, had been trying to revive dead infants by dunking them in a local stream where a dog had. Had drowned. And the dog kind of became like this local. Became basically venerated as a saint by the community there. So I love dogs. I have 11 right now, by the way. If anybody wants a puppy, just hit me up. But we have. So there's a local dog that they they named Saint Guinephoen. Yeah, there it is. Thank you. Yeah, I was like. I don't know how to say French words. So they would. They were like sort of dunking dead infants in the stream, trying to revive them, hoping, you know, that the dog was going to, like, save them in some kind of a way. And there's probably some kind of a story where, you know, the dog saved an infant or something like that, but it basically became this full custom. And eventually, you know, church officials came along and they said, you guys cannot be doing this. This is not how this works. Right. So this is what superstition is considered in the Middle Ages. Now, if superstition is offering worship to beings other than God, and we've decided that the veneration of saints is in fact, worship, and if it's worshiping God in an improper manner, and we've decided that anything that is ritualistic or embodied is an improper way of worshiping God, then sort of it follows necessarily that all of the practices of the Roman Catholic Church, which were rejected by the Reformation, that those things would become superstition, and that also anything that looks like those things or like, bears some kind of superficial similarity to them would also kind of be lumped into this superstition. So superstition is one category. There's also the category of, of the witchcraft mellificum, Right? The, the, the. The actual invocation and interaction with the devil. Right. And so this is actually a second category from superstition. And then beyond that, there are the related but distinct practices of alchemy, astrology and divination. And so what you would sort of maybe expect, if you look at it on paper, is that as the Reformation is coming along, getting rid of the idea that the way that you. That you can purify demons using incense and holy water and sacred salt, that they would also get rid of the idea that that would be something you needed to do do. And the way that some scholars have described it is to say that the Reformation gets rid of the idea of the real presence, like the physical presence of Christ in the world, but it retains, embraces and intensifies the real presence of the devil in the world. So it actually takes away the means of combating demons and the demonic in the world, but it holds on to the belief in them in a big way. I mean, Luther had a bunch of encounters that he really believed was like, the devil coming after him specifically. And this is kind of all over the literature and like the political cartoons of the Reformation as the Reformers were getting dispats with each other. They would actually accuse each other of being like demon possessed and you're a servant of the devil and you know, all this stuff. And so this idea of like this perfect Reformation that strips away everything so that we can go to this pure kind of solamensis Christianity that's been stripped bare of all superstitions never really lasts for more than a few minutes at the beginning of the Reformation, at least not on a popular level. And so, and I want to be really clear here, we're not just talking about, okay, some peasants in some corner of the whole of the. Of Germany. You know, they're still, you know, performing weathermancy to see whether or not a badger is going to come out of its hole on the feast of the Pres. The presentation of purification of Mary, which of course, as we've talked about about on this channel, is the origin of Groundhog Day. But we're talking about kings, we're talking about the intelligentsia of the day. One of Luther's sons, I think it's. Paul was an alchemist. He wasn't just an alchemist, he was an alchemy tutor. Right? He taught alchemy to rich nobles as a profession. So these are so, so you have all these kind of practices that continue to, to. They perpetuate themselves throughout the Reformation and, and throughout the, for instance, during the Thirty Years War. Johannes Kepler, you know, we have like a whole telescope named after him. He was, he was basically the, the, the court magician for Gustavus Adolphus, the King of Sweden. Like, basically he was. His, his astrologer. Adolphus actually had a bunch of different birthdays circulating so that nobody could like accurately make a horoscope for him and like predict when he was going to die. Right. You know, things like that. So, like, this was like big, I mean, this was like big business and it was a big part of, you know, this is, this is a man who's like literally making war on Roman Catholic states and believes that popery is like the worship of the devil, but he's got his own magician because he believes that this stuff also works. You know, so it's. Anyway, the actual picture of magic on the ground at the time of the Reformation is more complicated than we often make it look. That's the main point of the court."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":2037.1,"end":2041.18,"speaker":"Jonathan Pageau","text":"Magician is one where people don't think that that's real, but it was, it."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":2041.18,"end":2043.38,"speaker":"Dcn Seraphim","text":"Was totally a thing, man. Totally a thing."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":2043.38,"end":2064.6,"speaker":"Jonathan Pageau","text":"You have some very famous ones, obviously, John Dee being the most famous. Most people know about John Dee, but most kings would have had characters like that. And it seems like they actually did dress somewhat like the images we have, which is the, you know, robes with stars on them and like, pointy hats and like that kind of this kind of wild way of dressing."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":2064.6,"end":2392.45,"speaker":"Dcn Seraphim","text":"Yeah, and I'm personally really happy about that because it's just kind of like when you find something in real life that's just like, this is too good. Like, there's no way this could be real. Like, this is just too. It's too perfect. Yeah, yeah. So you have. What eventually happens is that all of this stuff in the. The within Puritanism, which is a very particular strain of the. The Reformation, but it's one that has had a very important effect on the early history of America. You have. You have superstition, idolatry, and papistry. Those are all basically synonymous. And so. But then, like, what do you do with some of this other stuff? So a good question to ask is, you know, you find yourself in. You're living in a Puritan settlement in New England, and you find yourself really, really sick. Maybe it's with some kind of embarrassing illness that you don't really necessarily want to. Want to admit to in public for various reasons. Maybe it's just the fact that it is something which is. You've tried all the normal medical things. Nothing's working. So what are you doing? Do. What do you do? Well, historically, what people do is they go to a. They go to a witch. They go to what's sometimes called granny magic or Braucherie, or there's like a bunch of names for this sort of thing. And many of these things are still kind of practiced in various parts of Appalachia and Pennsylvania, North Carolina, places like that, where you. You go. And it's sometimes called focused pr. Sometimes called. It has all these kind of different names, and it has a lot of weird kind of overlaps. Just in terms of practice, it has a bunch of kind of weird overlaps with, let's say, more charismatic forms of Christianity in, like, the way that it looks. And so sometimes you'll, you know, one of these folk healers, they'll have something like a charm or an amulet, and they'll, like, touch it to different places in your body. And when they touch the place where the sickness is, they'll, you know, like, go into spasms or, like, you know, like, if you just look up videos of, like, people being slain in the spirit and things like this, which, again, not at all the kind of Protestants that I grew up as. I'm not trying to say that's everybody's experience, but, you know, I'm. I'm. I'm a Baptist, so we have no upper arm strength. We can't do this during. We can't do this during prayer. Yeah, the. The. But so you have all of these. These practices that look that. That, that have this overlap, and most of these practices are happening in a totally Protestant context. Very often, like, in a totally, like, Anabaptist. The Amish have their own sort of folk magic healing tradition. And it's never. It's never like a totally accepted thing. There's always witch hunts going on, obviously, a lot of famous witch hunts in, you know, in these different parts of New England. Right. Those witch hunts themselves are, though, very much associated with the reality of folk magic among the people there. And it's like, well, okay, if it works a little too well or if somebody's able to affect certain cures, well, what's keeping them from also. What's keeping them from also doing the reverse? Right. You know, and so this. This sort of, like, becomes the. The big question. And once you. You've identified there's somebody in your community who has that kind of power or has that kind of ability, or you just think it's possible that somebody in your community might have those kinds of abilities, and then it suddenly becomes this really potentially kind of a threatening thing. So all of this is. All of this is related to. And as I mentioned, a lot of these folk magic traditions which still very much exist within American Christianity. In all of these folk magic traditions, there are heavy use of the Scriptures made, like, extensive use of the Scriptures, extensive use of things like psalm verses as part of an incantation or a charm. And usually it'll be like you pair this herb with this psalm verse and you pray it and you put it on that part of the body, like where the pain is or something like that. So this is where I'll tell a kind of a fun story from my own childhood. So, as I mentioned, I grew up in this very kind of strict Baptist, fundamentalist, Reformed tradition. But because we also had this association with this large parachurch ministry that was much more ecumenical in the sense of basically, as long as you were not Catholic, you could be a part of it. We did have exposure through that group to a lot of other things. And this was. So I'll tell two stories about this kind of. This sort of, like, you could say, like, magical thinking or like folk magic within a modern Protestant tradition. One, do you Remember the prayer of Jabez stuff?"}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":2392.61,"end":2394.18,"speaker":"Jonathan Pageau","text":"Yeah, yeah, yeah, yeah."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":2394.18,"end":2406.38,"speaker":"Dcn Seraphim","text":"The prayer of Jabez is one of my favorite examples of this. First of all, like, genius marketing idea. The prayer of Jabez. Guy made so much money. I mean, my goodness, you still see those books in, like, Walgreens or something here."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":2406.38,"end":2408.74,"speaker":"Jonathan Pageau","text":"Now explain it to people what it. What it was."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":2409.22,"end":2424.48,"speaker":"Dcn Seraphim","text":"So there's a prayer in the Old Testament that was prayed by a guy named Jabez, and he basically prays, you know, God, you know, do this, do this, do this, and do this for me. And then he prospers. And so. So there was a guy that increase."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":2424.56,"end":2428.16,"speaker":"Jonathan Pageau","text":"My kingdom or increase my orders. Yeah, something like that."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":2428.24,"end":2502.91,"speaker":"Dcn Seraphim","text":"Yeah. I'm going to get the exact scripture up just so people know, for some of you are going to be like, oh, yeah, Prayer of Jabez, totally. And then there's going to be other people who are going to be like, I'm sorry, what are you talking about now? So the prayer of Jabez is 1 Chronicles 4:10. Jabez called out to the God of Israel, if only you would bless me, me and enlarge my territory. May your hand be with me and keep me from harm so that I will be free from pain. And God granted the request of Jabez. And part of the reason this prayer jumps out to you is because it comes in the middle of all of this. A lot of Chronicles is just genealogies, like, a lot of the Old Testament is. And so suddenly, in the middle of all the genealogies, you have this prayer. It's like, enlarge my territory. May your hand be with me and keep me from harm so that I will be free from pain. And you read that, and you're like, ooh, wouldn't that be nice if my territory would be enlarged and if I would be kept from harm and be free from pain, that would be awesome. And so they made this whole. There was this guy that wrote this whole book about it, and he was like, here's how to pray the prayer of Jabez. And if you pray it in this way, and people in my circles really pick this up, and they're like, well, okay, it can't be magic because it's in Scripture, right?"}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":2502.91,"end":2503.31,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":2503.47,"end":2527.39,"speaker":"Dcn Seraphim","text":"So we're going to use the prayer from Scripture, and it's going to have this effect on our life. So you're going to pray the prayer of Jabez, and then your territory is going to be enlarged, whatever that means, and then you're going to be kept from Harm and your life is going to be free from pain. And there were these Prayer of Jabez devotionals and, like, little booklets and videos and, like, summits, like conferences where you'd go to. And learn how to pray the Prayer of Jabez. And it was kind of this."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":2527.63,"end":2528.91,"speaker":"Jonathan Pageau","text":"Increase your territory."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":2529.07,"end":2537.65,"speaker":"Dcn Seraphim","text":"Yeah, it was very much this kind of. What's the. The what's the thing? It's like. It's not visualize, it's. It's a manifesting, right?"}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":2538.21,"end":2539.49,"speaker":"Jonathan Pageau","text":"Yeah, yeah. Name and claim."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":2540.37,"end":2849.86,"speaker":"Dcn Seraphim","text":"Name it and claim it. Like, manifest it. You know, like the. The idea is, like, there's this thing that your life could be. And here's. Here it is. Guys, we found it. There was a hack, like, hidden in the Bible, there's this one little verse. And, man, if you pray this, it's going to happen. And you can't argue against that because this is in the Bible. Right, right. So there was the Prayer of Jabez thing, which. Which I. I very vividly remember when I was. When I was young. There was also something called the. Oh, what was this called? This one's a little more. This one's a little more niche, but people out there. Some of the people out there watching this will know this. Yeah. So there was this book that was published called the Power of Crying out, and the idea was that if you were praying for something in your life, this was published by Bill Gothard, who I've talked about, and some other things, other places I used to clean his carpets, which in retrospect is pretty weird. But he wrote this book called the Power of Crying out, and it was endorsed by all the big evangelical people like Bruce Wilkinson and people like this. The idea was that if you were praying for something in your life and you weren't getting it, it's because you're not praying correctly. And the way to pray when something is really, like, serious is to cry out. And so there would be. There was, like, a little liturgy for this. And so it took it from, like, all these different passages, especially in the Psalms, where people cry out to God right, in their distress, et cetera, which you should do if suffering. You should cry out to God. Like, you should do that. You should pray. You should especially pray the Psalms. But what Gother did in this book was to take these psalm passages and actually systematize it. So there was a certain way that you had to cry out. And you always started out by saying so you would have one person that was leading. And then the more people you get involved, the more powerful it is. So you want to get as many people as possible to cry out with you. And you have one person who's leading, and it's repetition. So if I'm the one that's leading, I cry out, oh, God. And then everybody else cries out, oh, God. And then I cry out, help us. And you're supposed to do it at the top of your voice. You're supposed to make it as loud as possible, and it's supposed to, like, all do it together. And this is the power of crying out. And again, like books, seminars, courses, all this stuff, like, I didn't know about that one resulted from the power of crying out. And. And this is endorsed by a lot of kind of big names in that particular part of the evangelical world. And again, there's nothing wrong with getting together, crying out to God in doing it in even a liturgical way. Obviously, all those things are great, but the idea was that there's these hidden secrets about how to pray in the Bible. And you have to read the Bible kind of esoterically in this way, and you find the hidden secrets, you find the, oh, here's the prayer of Jabez. Nobody noticed this before, but if we pray this, God will enlarge your territory, will be free from pain. Or it's. Here's all the stuff about crying out. Nobody's noticed this before, but if we get together and we, like all in this kind of, like, actually liturgical kind of call and response way, then God is going to hear our prayer and answer it in a way that he would not do otherwise. And so there's like, the idea is like, here's a method, and if we do this method, then we're more likely to get the thing that we're asking for. Yeah. So those are some examples of kind of, you could say, like, sort of Bible based, what you could almost consider to be kind of folk magic. And again, like, what's the difference between that and prayer? I do think there's a difference in the sense that when we pray and ask God for something, or even when we ask for the intercessions of a saint, I think that it should always be with the intention, the understanding that God will do what he will do. And you have to also kind of. I mean, this is why. This is why most of the saints don't pray. It's sort of like the midwit meme. There's kind of a prayer bell curve where the very simple person and the very holy person can both say, God, please make it rain. And it Will just rain. And then for most of us in the middle, the thing we just need to pray is let your will be done. Because we just don't know what to ask for. Right. And we don't, you know, so anyway, all this to say. I'm not trying to make this just about that, but I do want to say, like, there does seem to me to be some kind of a distinction. And, you know the difference. The tagline for this book, the power of crying out, was when prayer becomes mighty. You know, so it's like, if you want mighty prayer, if you want to, like, then. Then, like, here's my method. And when you need to buy my book and learn my method, and then you'll be able to. And there's something about that. There is something about that that I think is very much connected to these, like, old folk magic traditions."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":2850.81,"end":2894.3,"speaker":"Jonathan Pageau","text":"So I think that. I think that you've got it right. In some ways, you could say that the. The sympathetic type, magic stuff, it's usually about serving one's will. Like, we want. You want something. And there. And you're trying to kind of funnel. You're trying to funnel. Meaning you're trying to funnel intelligence. You're trying to funnel all that towards. Towards getting what you want. See, the problem with some of this stuff, like, the problem with the idea of. Of manifesting and naming and claiming, is that sometimes it actually works. Like, because that is actually how things function in the sense that if you want something to happen and you focus your will on it, there's definitely a better chance that it's going. It's going to happen sometimes through causes that you can."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":2894.7,"end":2918.11,"speaker":"Dcn Seraphim","text":"Yeah. Even if you explain that through natural. So I will tell you, like, we have stories in my family about, you know, like, you know, large family, pastor salary, not a lot of money, et cetera. And like, you know, we cried out to God and then like, a check showed up in the mail the next day. You know, those kinds of things. We do have those stories. So it's interesting. Like, and the thing again, is that when I'm talking about all of that."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":2918.11,"end":2936.53,"speaker":"Jonathan Pageau","text":"Happens, even for darker things, like, if you want a new Ferrari, if you want, like, a new pair of shoes, like, sometimes that will happen. Like, if you want something really a lot and you focus on it and you try to get it through your thoughts and through that, like, the possibility that it will manifest is greater than if you didn't."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":2937.01,"end":2949.73,"speaker":"Dcn Seraphim","text":"I want to. I want to be very clear that when I'm describing these things, I am not trying to Say that I don't believe magic works. Yeah, yeah, yeah. Like, I'm, I'm not that guy. Like, I definitely believe, like, you know, and like, if you tell me, like."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":2950.05,"end":3012.38,"speaker":"Jonathan Pageau","text":"I think the difference is that the problem is like, be careful what you wish for. That's also one of the issues is that, you know, when you're wishing for a Ferrari and the Ferrari comes to you, the idea that this is good for you. Yeah. It doesn't mean that it's good for you. Sometimes you get what you want, but it's not to the, to the benefit of your soul. And so I think that that's in some ways the difference. Like you said, true prayer is always in service of something higher. So it's like when we pray for health, when we pray for God to give us the things we need, we kind of understand that it's not for our increase in that sense. It's not like that I become more powerful so that I have more girls, so to have more, whatever, more stuff. That's not the point. So that we can continue to serve our family, continue to serve God, continue to be in the loving relationships that."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":3012.38,"end":3084.92,"speaker":"Dcn Seraphim","text":"We are supposed to be. And if you look at the prayers for healing that we use, for instance, in our tradition in the Orthodox Church, the prayers for healing are always like, raise this person up so that they will have more time to repent. Repent. Right. The thing that you're always thinking about is the fact that you're going to die eventually and then you're going to be judged. And so the more time you have to sort of get your life together and not be kind of like, that's the prayer against. It's in the litany is a Christian ending to our life. Painless, peaceful and unashamed. And a good defense before the fearful judgment seat of Christ. Part of that is asking for time, like not to be taken suddenly, but to have adequate time to make a good repentance, make your last confession, receive communion, like all these things because. Because then, because then comes the judgment. Right. So I think that ultimately, like one of the things to look for if you're, which is not the topic of this video, but if you want to look at, like, what's the distinction between these things? One of the things would be, you know, again, like, who are you going to for help? That's one thing to ask. And the second bit would be just to say, why are you asking for this help? Like, is it, is it self serving or is it because it's got something to do with your repentance. So."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":3085.56,"end":3182.81,"speaker":"Jonathan Pageau","text":"But there is. I think that the idea is also to kind of to not. I don't have a black and white thinking on this. I see really that there is a scale. It is completely normal to want certain things like this is just part of being human and to in some ways have our secret prayers, to have moments where we kind of wish or we ask God, you know, if it's your will, I would like this to come to me. There's nothing wrong with that. It really is about, you could say the scale of it. And the image of the sorcerer is a good image to understand when that becomes excessive. Like it's a mythological image where usually the image of the source will be something like, I'm going to sacrifice someone else. Right. So this kind of magical idea that in order to get what I want, I have to give someone that someone that I love. Right. I have to sacrifice them. You saw that we see that a lot in kind of African American. The African folk magic tradition was if something really good was happening to someone, there was this suspicion that they had sacrificed someone in their family. They would always watch to see if someone would get sick and they'd say, oh, they sacrificed this person to get what they want. But that type of practice, which is happens both in magic, like in a magical way, you could imagine really doing something ritualistic to get there, but you could also do it in a more mundane way, which is basically like not go see your mother ever because you're too busy making a lot of money and you don't care. Just like, forget about. About her because you're just focused on your career like the you. But you can see it mythologically in magic on how that is the sinful aspect. Right. That's where it becomes really horrendous."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":3183.05,"end":3222.63,"speaker":"Dcn Seraphim","text":"Yeah. So one of the. I was actually, I was just thinking it's like, man, that that basic idea applies to a lot of economic systems actually. Just. Just the idea. I mean, and the thing is, like, you even know people who will be like. Like, oh, this good thing is happening to that person. But all this bad stuff happens to me. And so there's like this, this. You, like, you'll talk to people who have kind of this implicit idea that, you know, my suffering is necessary so that other people can be happy. I'm the one person in my friend group who's not allowed to be happy. Or I'm the one person like everybody else is getting married, I'm not getting married, or everybody else has got a great job but my job sucks. And, like, it's sort of this idea that."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":3224.05,"end":3225.09,"speaker":"Jonathan Pageau","text":"And being sacrificed."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":3225.09,"end":3284.58,"speaker":"Dcn Seraphim","text":"Yeah. But also, you can see how. So there is a dynamic that happens in friend groups. And every sitcom, for instance, does this. So this is where we're going to pivot and talk about Seinfeld for a moment. So. No, no. So every. Every sitcom does this where you'll have one person in the friend group who is the loser. Loser. Right. Like, who's a little bit of a loser or the nerd. But they're basically the person in the group that everybody else can kind of mock. And in doing that, they actually kind of elevate themselves a little bit, and they actually do become kind of more successful in the world. And they sort of get there by pushing this person down a little bit. Like, that's. That is like a social interaction, which I've observed many times in the real world. And it's. It's. Again, it's a key element of, like, a lot of sitcoms. And that is that same kind of a. Same kind of an idea that you have to sort of push somebody down to raise yourself up. So. Okay, so."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":3284.9,"end":3329.08,"speaker":"Jonathan Pageau","text":"But I think it's mostly to help people understand. And this is. It's hard because we're modern people, but to understand that the notions of magic are not removed from your experience. They're often concentrated mythological versions of things that you go through all the time. Right. Of how will affects the world. You know, how some people. People are able to make things invisible, make things disappear. We see things disappear all the time in media today. There's. That those are magical actions. And so we need to re. Understand it that way because. Or else what are we even talking about? Like, this isn't Harry Potter, you know, shooting lightning bolts out of. Out of wands or whatever. Like, that's not magic, and it's never been magic."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":3329.08,"end":3363.81,"speaker":"Dcn Seraphim","text":"Yeah, yeah. Nobody. Nobody's ever actually thought that was magic. Magic. Right. And in fact, the main thing that people sort of. You could say, like, there are these different categories for magic. So what we've just described, the ability to kind of like, harm at a distance or, like, sacrifice some things so that you get some power out of it. Whether it's like, I'm going to sacrifice my soul, you know, like the Fausti impact. But the selling your soul idea is the idea that whatever comes next, I don't care about that. So, like, the afterlife, whatever, the devil can have me then, but right now, I get everything that I. I want. Right."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":3363.81,"end":3367.41,"speaker":"Jonathan Pageau","text":"But you, every time you sin you're doing. You're selling your soul to somebody."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":3368.77,"end":3369.13,"speaker":"Dcn Seraphim","text":"Yeah."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":3369.13,"end":3372.21,"speaker":"Jonathan Pageau","text":"You're. You're picking to now instead of eternity."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":3372.29,"end":3382.21,"speaker":"Dcn Seraphim","text":"So it's like the same. Same thing. Like every time you take out a loan, you're doing that a little bit. You're saying you can have this much of my. Yep, yep. You. You're saying, like, you can have this."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":3382.21,"end":3383.49,"speaker":"Jonathan Pageau","text":"We're going there, are we?"}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":3383.49,"end":3412.33,"speaker":"Dcn Seraphim","text":"I guess so, like, you can have this as much of my time and labor and money and. And attention. You know, because, like, once you owe money, like, it's. It starts to eat, like, occupy the space in your mind all the time. Right. So like, like, you're saying you can have this much of my time and attention, et cetera, in the future, but what I want right now is a car. Right. And you know, and so like, you justify that to a certain extent and, you know, basically, that's what our whole economy runs on."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":3412.65,"end":3414.89,"speaker":"Jonathan Pageau","text":"Whole economy is based on magic."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":3414.97,"end":3464.17,"speaker":"Dcn Seraphim","text":"It is, actually. I, I mean, okay, but like, go look up new monetary policy. I'm so sorry. I don't know how we got here, but like. Yeah, like, like, I mean, the. Certainly the whole economy is based on the idea of. Of like, attention is value. Right, right. You know, when, when somebody says something like, you know, the, you know, we're. We're off the gold standard, so now our money is worthless. It's like. Well, that's not exactly true. Money is always worth what everybody agrees that it's worth. Right. And it's just sort of this. That's how it works. That's actually how it works with gold as well. But the thing is that with. Historically with gold, you can make things and. Yeah. So. Okay, so I don't want to go down like a whole rabbit hole here about the Fed, et cetera, et cetera. So we're gonna. We're gonna. Yeah, you gotta go doing the."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":3464.17,"end":3467.05,"speaker":"Jonathan Pageau","text":"The universal history of America. We're gonna have to talk about the Fed itself."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":3467.05,"end":3665.86,"speaker":"Dcn Seraphim","text":"We will actually have to talk about. Well, okay, so it. Is it actually related to where I want to go in a few weeks. And so, um. All right, so the kind of magic that we've just talked about now, which would be like, harm at a distance or like control at a distance or like enlarging yourself at the expense of some other thing that you sacrifice. Right. That's the. What would normally be considered to be like, witchcraft when it's done in an improper way. Right. The mellifikarum. Right. So another really important kind of magic, especially during the Reformation is what we would call divination. So there are basically, there are basically two ways to do divination and one of them has always been totally rejected by Christianity and the other actually has always been basically accepted. So this is a plug for my Lord of Spirits talk later this year, if people are coming to the Lord of Spirits conference where I'm going to say all the things about astrology out loud. It's going to be really fun. I'm very excited about. About it. Yeah, it's going to be awesome. But you have to drive to rural Pennsylvania to hear it. So it's like, you know. Yeah, so divination is when you either you call out to some spiritual power, like for instance, like a God, like, you know, let's say like Marduk, who's, you know, the king of the gods and like the God of war. And so you say, I want to invade the neighbor, neighboring city state, you know, in the Mesopotamian Bronze Age, I want to invade the neighboring city state. So I'm going to sacrifice an animal to Marduk and then we're going to look at the liver of that animal and there's somebody who is trained on interpreting animal livers and they're going to basically look at that and tell me whether or not Marduk will give me a favorable outcome. Then there is the observation of natural signs and events. These are in German, these are called wunder, like wonders, but like as like signs and wonders. And this kind of divination is based on the interpretation of things that happen out of the ordinary in the natural world. Astronomical anomalies, strange lights in the sky, cloud formations, dragons flying overhead, beached whales, deformed animals, et cetera, et cetera, et cetera. Right. These are things that are not normal but do happen. And so when they happen, this tells you something. And so the question then is like, what does it tell you? So famously, for instance, there's a bunch of wonders, a bunch of two headed calves being born, or various comets in the sky, etc. The night before Caesar's assassination. Right. If you read even in the church fathers, they will talk about things like how the passage of comets predicts the birth of kings. And they would not have considered that to be astrology in the sense of, of the first sense, which again is like, let's sacrifice something to a pagan God and ask them for an outcome. Because the idea is the world is made by God and so God can communicate things to us through the natural world. However, it's not always so clear."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":3666.26,"end":3712.87,"speaker":"Jonathan Pageau","text":"Yeah, what's interesting is that you can see the difference that we're trying to point to, right, in those two examples, which is that the idea of. Of invoking a deity and offering a sacrifice in order to control what it is you're going to do in order to know what you should do, and especially in terms of things like battles and all of that, you can see why that's different from, in some ways, being attentive and noticing what is being given to you, like noticing the signs that are given to you and then trying to make sense of them. One is this willful desire to increase my power, and the other is a kind of attention to the language of creation in order to understand what it is that's happening to us."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":3713.03,"end":3938.77,"speaker":"Dcn Seraphim","text":"So in the medieval west, the Catholic Church very carefully regulated the kinds of divination you were and were not allowed to practice. So, for example, it's against the law of the Church to make a birth chart that is a horoscope for yourself unless it is for medical purposes. So you would have basically, like medical astrologers. I mean, this was actually just a part of learning to be a physician in the ancient world, because the idea is that different parts of the heavens correspond to different influences, have influences corresponding to different parts of the body. And so you were not allowed to. Because most of the time, when people make a horoscope, what they want to know is, I'm talking about, like, real astrology back in the day, not like whatever your weird aunt does now, but, you know, although, I mean, obviously they're kind of related. But the old stuff, very often it has to do with, like, am I going to be. It has to do with wealth and power, basically, those things. Right? Increasing your wealth and power. It's not always like, oh, am I going to meet somebody? Or something like that. Which seems like what most horoscopes are about now. But it's about wealth and power. So if you're doing that, you're doing it for a bad reason and ultimately for a reason that's really harmful to your soul. When the church bans astrology, it is not because they don't believe it works. It's the other way around. Right. And when the. So, so, like, if you're a doctor who's doing this as part of a medical examination, well, that's for the purpose of healing somebody. So it's. It's different. That's how they treated it. Now, when the Protestant Reformation comes along, they do not get rid of these practices. In fact, they intensify them. Um, so for instance, in Zurich, which is the ultimate citadel of the Swiss Reformation, that's where, sorry, Geneva. That's where. That's where Zwingli, for instance, you know, says, oh, how gloriously white all the churches are, right? They had entire libraries where they collected massive amounts of what were called wonder literature, which is basically people would write, usually pastors would write and collect. Here's all the weird signs that are happening right now in the place where I live. You know, just for instance, in 1578, there's a deformed lamb born in the village of Steidersdorf. And so they. So one of the local pastors immediately publishes a pamphlet about this and interprets, you know, this four eared, eight legged monster with a snake's mouth. And this is like God is sending a message to the people of this village that you're all wicked and you need to repent. And he here's the things about you that are specifically wicked. And here's what the ways that the lamb is deformed are allegories of the way that you're deformed. And this is a sign from God and you should get your life right, right? That kind of thing. And so people publish pamphlets like this and the publication of them massively ramps up during the Reformation. So by like 1585, you have entire libraries across Germany and Switzerland basically just full of this kind of literature, which also includes things like how to interpret the different kinds of sign when they come along and things like this. So this kind of divination is like at a really kind of larger cosmological scale, but it's associated with some other kinds of divination at a much smaller scale, which have to do again, has to do with folk magic and things like this. And among this is the practice of like water witching. So this is something I've never understood, Jonathan."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":3939.09,"end":3941.09,"speaker":"Jonathan Pageau","text":"I don't know what that is. What's water witching?"}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":3941.41,"end":3955.41,"speaker":"Dcn Seraphim","text":"You know, you see like in old movies, you'll see somebody like with like a stick with like a forked branch, they're holding it by two ends and they're like walking across the ground and they're looking for water."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":3955.57,"end":3956.61,"speaker":"Jonathan Pageau","text":"Oh, looking for water."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":3956.61,"end":3961.53,"speaker":"Dcn Seraphim","text":"And you're supposed to feel like some kind of vibration in the stick or something that would tell you that there's a source of water. Water here."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":3962.17,"end":3967.77,"speaker":"Jonathan Pageau","text":"I mean, look, man, I have to be honest with you. I know someone who does that."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":3968.17,"end":3976.33,"speaker":"Dcn Seraphim","text":"I do too. Please explain what's going. When I talk about these things, I'm not saying they're not real. I just don't understand what's going on."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":3976.33,"end":4066.9,"speaker":"Jonathan Pageau","text":"And it's been interesting. It's actually been interesting talking to him about it because it's something that he discovered and he didn't want this. He had another job. And ultimately what happened to him is that, that he had this sense that he really had to quit his job and to start a water detection, like water infiltration detection company. And so I think he was like making furniture or something, quit his job, bought all the equipment in order to help people detect water infiltration in their houses and their buildings and stuff, started doing that and then at some point started realizing that he didn't need the equipment. And so he would walk into the building and be like, I'm using the equipment for the client, but I know exactly where the leak is. And he said at some point he would just, he just would just. He said, he said one time I walked into a building and I went up and like, he said, I punched through the, the, the gypsum and I grabbed the pipe and it was like, that's where the leak was. And I just knew where it was. And so he didn't know anything about it. He started looking online about what that is and what it is. And so he ended up buying like a copper rod because these. They saw that that's what people were doing. And so he started like, started using it. And, and it was like, I mean, so what's interesting is that, that this is, this is so interesting. So you could, you could really. This is a. Something that you could totally explain naturalistically. Right? The idea that some people have an intuition about where water is. This is something that would be completely normal. Animals have that."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":4067.06,"end":4069.82,"speaker":"Dcn Seraphim","text":"Yeah, you could make some kind of like evolutionary psychology explanation."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":4069.82,"end":4105.18,"speaker":"Jonathan Pageau","text":"There's a completely. You know, but then you could. What's harder for people to understand is to what extent certain physical disciplines, certain disciplines of ways of acting or ways of, of or of all of relating to the history of this, all of these would actually increase that capacity in you where, you know, by, let's say, learning from someone who's done it before, if you already have the intuition would also help you kind of refine that and be better at it. But definitely, I mean, I don't completely. I mean, I think that even naturalistically you could understand this type of behavior."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":4105.98,"end":4196.09,"speaker":"Dcn Seraphim","text":"I mean, I'll do you one weird. Weirder. Well, it's not weirder, actually. I do have a weirder thing than that, but I'm not going to say it while we're recording. I'll tell you later, but there's a. I have a series of books that somebody, actually, a podcast fan, sent me recently, and it's just. It's a collection of the Life. The Life and, like, recorded miracles and stories about St. Porphyrios, one of my favorite modern saints. One of the most common miracles that he performs was to find locations for wells. And he would just know. He didn't have a ritual he did or a copper rod or something. He would just be like, oh. He's like, you're going to drill a well here in three years, and that well will be contaminated. And you're going to figure that out too late, because you're not going to take my advice. So you're going to drill a well there, and that well is actually contaminated with diesel fuel. But then after you figure that out, you're going to dig one over there, and that one's going to be pure. And then, like, you know, three years later, the guy laughs all that off, but three years later, he digs a well where he wanted to dig a well, and turns out it's contaminated. And then he digs a well where Saint Porphyrius tells him to dig the well, and the water is there. Right? So accepting that this is basically. This is a thing that some people could do. I know people who can, like, more than one person who can do this kind of thing. What is the symbolism of that? Like, what's it mean? Like, what's the symbolism of, like, finding hidden water?"}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":4197.69,"end":4243.7,"speaker":"Jonathan Pageau","text":"I mean, we. It's also finding fresh water. It's not just about finding water. It's about finding fresh water. You know, it's related, definitely. You know, the idea also that they have this rod that they're using is related to the story of Moses and the tree, right? So the rock rod. Moses has this tree, but it's a rod. And then he, you know, he. He puts it in the, The, The. The salt water, and it becomes a. It becomes pure water. And so, you know, it's related to how. How can I say this? Like, it's. It's an image of how humans are able to find value. Like, because clean water is heavenly water, right? It's water that. I know it's hard because it comes from below, but it. It is. It is. It is like, it's like a well."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":4243.7,"end":4244.02,"speaker":"Dcn Seraphim","text":"Is."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":4244.29,"end":4258.37,"speaker":"Jonathan Pageau","text":"Is this pure, like, pure water? And so I don't see, like, to me, it's pretty simple. Like, you know, it's the capacity of humans to. To find value, to find Meaning to find things that are. That are. That are important to us."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":4258.53,"end":4265.25,"speaker":"Dcn Seraphim","text":"It's always seemed to me that there is a connection between the symbolism of, like, being able to find water and, like, looking for buried treasure in the sense that."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":4265.25,"end":4274.01,"speaker":"Jonathan Pageau","text":"Yeah, for sure. Actually, my friend this friend that can. That can. This is gonna get. Now it's gonna get a lot weirder. My friend that can find water, he also realized he can find other things."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":4274.24,"end":4274.48,"speaker":"Dcn Seraphim","text":"Things."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":4275.76,"end":4302.32,"speaker":"Jonathan Pageau","text":"And. And. And he. At some point, there's this guy who was. This guy was skiing, like, water skiing, and he was a guy who had, like, a fake leg. Like, he had, like, a prosthetic leg, and he was water skiing, which doesn't seem like the smartest thing to do, but he fell, lost his leg. The leg fell into the water. Nobody could find it for, like, days. People were, like, trying to find it, couldn't find it. And because obviously the boat was going super fast, they couldn't find it. And so my friend."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":4302.72,"end":4305.68,"speaker":"Dcn Seraphim","text":"I'm trying not to laugh at your disabled friend. Like, that's."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":4306.1,"end":4307.98,"speaker":"Jonathan Pageau","text":"So now I don't know. The guy with the light."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":4307.98,"end":4309.38,"speaker":"Dcn Seraphim","text":"Okay, okay, we can laugh then."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":4309.78,"end":4329.5,"speaker":"Jonathan Pageau","text":"But my friend found out about this, and. And he said, well, take me out on the water. And they take. Took him out on the water, and he said, it's here. And then they just went down, and it was right there. And so he discovered that he can. Yeah, he can find things. And so it's definitely related. I mean, now it gets weirder because people are like, oh, God, you can't explain that naturalistically. But the thing is that I can."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":4329.5,"end":4332.27,"speaker":"Dcn Seraphim","text":"Though, because my wife is better at finding things than. Than I am."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":4332.59,"end":4333.07,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":4333.07,"end":4351.11,"speaker":"Dcn Seraphim","text":"And like. Like, I will look for half an hour for something around the house, and I'm, like, so frustrated. I get. Do you know where this is? And she's like, no, but let me look. And then, like, literally three minutes later, she'll find the thing that I'm looking for. Like, some people. Some people are better at finding things. It seems not unreasonable that you could then extrapolate that."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":4351.11,"end":4360.03,"speaker":"Jonathan Pageau","text":"But, yeah, it does become a little harder to at least explain with normal naturalism. Definitely more of a vertical. Of a vertical thing."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":4360.27,"end":4549.49,"speaker":"Dcn Seraphim","text":"So, boy, I've got a weird story to tell you later when we're not recording. But in any case. Okay, so this kind of brings me to one of the most interesting to me, folk magic traditions in America. So this is. This is it, guys. We're going to tie in the last video the idea of, like, titular spirits and guardian spirits and things like this, we're going to tie that in because one of the most common folk magic traditions in North America and this is very closely tied to, tied with like Protestant folk magic. And again, like, I'm not saying, I'm not saying it should be like, it's not like a. I don't know, I'm just reporting like historically this is the reality. Right? And so, and this particular happens in a part of upstate New York that's usually referred to as the burned over district. It was like this heavily charismatic region of New York State where a lot of important, important spiritual movements happen that a lot of people know about. And some of you already know where I'm going with this when I mention it. In the burned over district there were a lot of folk magic traditions that are part of this kind of like wider, kind of more mystical is not even the right word, but definitely more like, you know, the idea that you, certain kinds of prayer, like you say this prayer under a full moon, then you'll get this result, right? So like, like much more like folk magic traditions that are also associated with this highly revivalistic version of Christianity. And this includes things like folk healing, folk medicine, folk magic, also things like divination. As we've mentioned, one of the main forms of divination was the ability to find buried trees, treasure. So this is what is usually called money digging, is what they called it, money digging. And the way that it would work is that you would have a vision. You would receive a vision usually through like a scrying stone of some kind, which ultimately comes from European alchemy. Right? You would have a scrying stone of some kind. Like this is like a stone that usually get a big hug of quartz or something like that. And you would look into it and you would have visions in the stone. Right? And the visions would tell you where water is located. That's one of the main things they used it for, but they also used it to find buried treasure. Now whether or not anybody actually ever found buried treasure doing this, I do not know. But lots and lots and lots and lots of people were trying. In fact, in the early 19th century, there was a massive wave of this kind of treasure digging going on throughout New England, not just in New York, but all around New England. And the way that it would work is you'd have somebody who's a seer and who had this gift of being able to find water and being able to find buried treasure. And they would look into the stone and they would find, they'd have a Vision, they'd say, okay, it's right here. But here's the problem. Buried treasure is always guarded by something. Everybody, I think, knows this intuitively, you know, like, like, obviously, if there's buried treasure, there's going to be something guarding it."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":4550.13,"end":4552.08,"speaker":"Jonathan Pageau","text":"There's a reason why someone buried. Buried it."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":4552.24,"end":4616.09,"speaker":"Dcn Seraphim","text":"Yeah. In a medieval alchemical, like, tradition, the idea of, like, buried treasure is. Or hidden treasure is also associated with, like. Like a dragon or like a small, Like a dragon spirit, like a familiar that would, like, be guarding. So you have to, like, if you want to get the alchemist's secrets, you have to get past his familiar kind of a thing. And so they would have this. They would have this. They would say, all right, there's right here. There's buried treasure under here. But the problem is that there is a guardian spirit guarding it. And the guardian spirit is usually supposed to be the spirit of, like, Native Americans who used to live there. And maybe they're the ones that buried the treasure. Or specifically, sometimes they had this idea that when the treasure was buried, they killed a war warrior, like, on the spot, and so that his spirit would remain there to guard the treasure. Right. That kind of idea. So what you have to do is you have to placate the spirit in some way."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":4616.49,"end":4617.69,"speaker":"Jonathan Pageau","text":"This is in New England."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":4617.85,"end":4684.87,"speaker":"Dcn Seraphim","text":"This is in New England. This is in the 19th century. Jonathan wild man. It's like the early 19th century. And so the way that you would placate the spirit is by offering it a sacrifice of some kind, usually an animal sacrifice. There were always, like, rumors about, like, they would. They would, like, you know, like you would. There. There were rumors about, like, it being a human sacrifice. Like, you would murder one of your company and, like, offer their blood to the spirit. I, again, don't know if this ever really happened. This is the rumor, but usually it was like a rooster or a dog or something like that. Okay, so you, You. You kill this animal, you offer the blood as a sacrifice to placate the guardian spirit of a place. And then, very important, importantly, the seer, this is part of being this kind of diviner, is that you know that there's a certain number of things. There are certain ritual, procedural things you have to do. And if you violate any one of them, even in a very small detail, the guardian spirit will wake up or be displeased. And then what they will do is they will draw the treasure down deeper into the earth."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":4684.95,"end":4685.37,"speaker":"Jonathan Pageau","text":"Okay."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":4685.44,"end":4694.96,"speaker":"Dcn Seraphim","text":"Okay. So I want to be overly cynical. I think I've established I'm the Sort of person who's, like, not cynical about spiritual reality in general."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":4696.64,"end":4702.48,"speaker":"Jonathan Pageau","text":"But I don't even understand, like, what treasure would, like, ancient Native American people."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":4703.52,"end":4712.32,"speaker":"Dcn Seraphim","text":"Bury that gold, man. It's always, like, golden. I mean, just like, treasure. Like, it's like. I mean, think about."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":4712.32,"end":4715.44,"speaker":"Jonathan Pageau","text":"Think about New England. Native Americans, like, care about gold."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":4715.44,"end":4804.37,"speaker":"Dcn Seraphim","text":"That doesn't matter. It's got nothing. Nothing to do with this, Jonathan. Like, I. And I don't know the answer to that, but also, it doesn't matter. Like, it's. It's got nothing to do with this. Like, if you think about part of the symbolism of the New World, right. Is this idea of there's a Fountain of Youth or there's a. Or there's, you know, treasure in the terms of, like, you know, gold and silver, you know, especially from, like, south and Central America, which is where most of that was coming from. But, like, when people are exploring, I mean, we'll talk about some of these explorers point. At some. Some point, if we ever get to them. But, like, when they're. They're exploring the New World, they're looking for the Fountain of Youth. They're looking for El Dorado, the city of gold, like, all this stuff, and that is farther south than New England. But the point kind of stands that part of the symbolism of the New World is that it is this unprecedented source of riches. Yeah. Like, the thing that ends the Middle Ages is Spanish gold. Like, they have so much gold and silver coming over. It totally changes the eastward orientation of. Of Europe and basically, like, just, like, changes everything. That's one of the major things that brings the Middle Ages to an end. But once you're there and you're living now in this land of plenty, and you find out it's actually really hard and you have to farm most of the time. Like, well, instead of the gold being over there, now it's under here. Right. There's supposed to be some kind of a treasure here. There's gold in them. Our hills. Right. Like, there's supposed to be some kind of a treasure here."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":4805.01,"end":4813.09,"speaker":"Jonathan Pageau","text":"Yeah, for sure. All of America and the Gold Rush and all of this. The whole aesthetic of the gold, of the gold hunting is important, for sure."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":4813.09,"end":4891.24,"speaker":"Dcn Seraphim","text":"Yeah. And just this idea in general that there's some resource that we haven't tapped yet, and if we tap that, I mean, this is, of course, a human desire, but it's one of the main things that drove European exploration, settling, colonization, et cetera, of the New World was this idea that there's this untapped resource out there. And if we just tap into that, it's going to fix all of our problems. We're going to heal, we're going to cure aging, we're going to cure. And we're still doing all of this. We're still looking for every one of these things. So they. So imagine that you are somebody who has at least convinced other people that you have this gift, that you have the gift to find water, to find treasure, et cetera, et cetera. And then all we have to do is we go out here, we make a little sacrifice, we kill a dog, dog sacrifice the blood, we appease the guardian spirit, and then we start digging. We start digging. We dig and we dig and we dig. After, like a day of digging, we've. And keep in mind, like, we had to hire like an entire digging crew plus my fee, you know, so it's not a cheap endeavor. And after a couple of days of digging, no treasure. What you say is that guy over there, the seer. No, no, no. You as the seer, you say it was that guy over there. He. He talked when he wasn't supposed to talk."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":4891.24,"end":4892.92,"speaker":"Jonathan Pageau","text":"Oh, he. He didn't follow the order."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":4892.92,"end":4912.44,"speaker":"Dcn Seraphim","text":"He used one of the words that you're not supposed to use. And that woke the guardian spirit up. And now the treasure is pulled down even deeper. It's actually going to take more money and time. So then it's like the only people actually getting wealthy off of the treasure digging are the treasure finders themselves, right? That's the idea. So all of this to say."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":4915.17,"end":4915.33,"speaker":"Jonathan Pageau","text":"One."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":4915.33,"end":5025.29,"speaker":"Dcn Seraphim","text":"Of the great money finders, one of the great money diggers of New England was a guy by the name of Joseph Smith, who is, of course, the founder of Mormonism. Joseph Smith had two scrying stones that he used that he kept, and he would put it in his hat. So the way you had to work with a scrying stone, it's actually fun woodcuts of like a guy looking into a hat with, like, light coming out. Or that's like. That's Joseph. Joseph Smith. Maybe we can put one up on the screen for some people and see, Joseph Smith was a. He was a seer. Like, he was somebody who had at least convinced the people around him that he had these certain gifts, this ability to kind of find this lost treasure, this buried treasure. And the way that he would do it is he had these two scrying stones, like chunks of quartz, and he would put them in his hat. Because to make a scrying stone work, you have to blot. Out all other sources of light. So you can see the light that's shining out of the. The stone. So he would put it in his hat, and then he would hold his hat up to his face and block out all the other sources of light. And then as he's staring into the scrying stone in his hat, he would start weeping. He would start kind of like speaking in tongues. He would start doing all these things, and then he'd say, I've seen it. I've seen the vision. I know where the treasure is. I know where the thing is. As far as we know, never actually found anything until, of course, he found the golden vision of where these golden tablets are. Yeah. So Harold Bloom, the great literary critic, American literary critic, in his book the American Religion, he makes the argument that American religion is fundamentally gnostic in all the senses. That this means. And importantly, Bloom does not think this is a bad thing."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":5025.69,"end":5026.12,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":5026.27,"end":5118.51,"speaker":"Dcn Seraphim","text":"Okay. So he's not saying this in a negative way. If I said something was fundamentally gnostic, you would note that it means I don't like that thing. But for Harold Bloom, this is actually a good thing. And so what are the trademarks of Gnosticism? Well, for Bloom, it's the combination of the separation of the material from the spiritual, and then it also has to do with the idea of there being kind of like echelons or deeper levels of esoteric knowledge that you can move into. So for Harold Bloom, American relationship religion is fundamentally gnostic, which he sees as a good thing. And he sees that, and in his view, Mormonism is the most purely gnostic and therefore the most purely American form of religion. And that's where we're going to stop today. Just going to leave that out there. And in a few weeks when we pick this up again, what I want to do is actually look a little bit at the early history of Mormonism and some of the folk beliefs and practice practices, as folk magic from Europe gets carried over as also gnostic influences from other things. I mean, I didn't even talk about all of the Puritans, some of the Puritans who were involved in some of the witch hunts that we mentioned earlier, some of them were very interested in and extensively studied Kabbalah. So there's a lot of weird stuff that I want to look at as we look at kind of the weird history of early American religion and this kind of esoteric. Esoteric thrust that it takes. So that's. That's what we're gonna do."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":5118.51,"end":5174.82,"speaker":"Jonathan Pageau","text":"And in some ways, it's Funny, because it looks like a contradiction, but if you. Because at first, we started with the idea that in the early Reformation, you have this split of heaven and earth, where in some ways there's this. But what happens, and you see it, you know, in the split right away, very soon, is when you see Freemasonry being developed, you kind of see these secret societies. And in some ways, this split is creating a tie type of esoteric thinking and magical thinking that becomes divorced in weird ways from the basic belief of people and becomes this kind of secret thing that people participate in. And so, although it looks like a contradiction, it is, in fact, if you don't have a completely integrated vision of how it is that God acts through his saints, through his angels, into the world and how we're meant to ask God to show us, to help us, and that it's embodied in liturgical practice."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":5174.97,"end":5175.17,"speaker":"Dcn Seraphim","text":"This."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":5175.17,"end":5182.33,"speaker":"Jonathan Pageau","text":"It's not that those will go away, is that they'll just become weirder and weirder and weirder because it's a. It's. It's a human need that people have."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":5182.73,"end":5390.01,"speaker":"Dcn Seraphim","text":"One of the things that I think that I. I'm ready to start pushing back against, actually, is the idea of re. Enchantment in the sense that I don't think the magic ever really went out of the world, but I think that what happened is something more like modernity. And you can see this. I mean, like, there are extreme cases where you have, like, nuclear physicists who are also, like, practice practic occultists and things like that. And that stuff is relatively well known. But I don't think it is really the case that this, you know, Weber's idea of, like, disenchantment, like, just totally sucked all of the enchantment out of the world, and now we can just deal with the world in this rational basis. But it's that when the. When the. You could say there was, like, a hierarchical way within Christianity, humanity, of approaching these things in the world. And as we kind of established in our last video, there was, like, some messiness on the edges of that, where you're like, okay, but what about this fairy? Maybe she can be saved, maybe she can't. We'll see if she can hack it as a monk for seven years or like, whatever. Like, there's. There's, like. There's folk traditions and legends and things like that kind of on the edges, but then you have this kind of solidity in the center, and when that is kind of stripped away from the cosmos, what we don't get is this kind of Perfect. Everything is now rational and explainable and understood. What we get instead is this really where everything kind of becomes ambiguous. And so then what you need is you need to find the secret. And maybe the secret is, for a lot of Christians, even in kind of a modern American Protestant context, this is me meant trying to go back to Judaism or some form of Jewish mysticism, right? Say, well, they, you know, like, Christianity came from Judaism, so maybe we can go back to those things. For other people, it has meant, you know, the creation of basically gnostic hierarchies of knowledge and esotericism. And for a lot of people, it has meant things like, here I am reading my Bible every morning, like I'm supposed to, and I'm reading The genealogies in 1 Chronicles, and this is really boring. But I. But every part of the Bible is just as important as any other part of the Bible Bible. And so there must be a reason to read the genealogies. And bam, right in the middle of the genealogy, here's a prayer. Here's the secret. And if you say this prayer, your life is going to be ordered. And I think that is a very kind of important thing for us to understand about ourselves. And the reason that this is important to me is because, you know, as we talk about, like, the re Enchantment movement, and obviously, like, you have been featured in books about Re Enchantment, right? You know, so, like, you're. You're here kind of at ground zero. And as we talk about these things, like, there definitely is a dark side to some of this stuff. And there's also, like, you know, it's very easy to get carried away and kind of lose sobriety as we're. As we're kind of dipping our toe in these things. So I think just kind of understanding where some of these motivations come from, especially for those of us who are Americans. And this is actually like, a really key part of our. A really key part of our. Our tradition, our culture, the symbolism of what it means to be an American. It will be important to help tease some of those things out. So I promise, guys, we will get to Bigfoot eventually, but I just, like, we'll get there when we get there."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":5390.33,"end":5395.45,"speaker":"Jonathan Pageau","text":"When we get there. And so next episode, Deacon Seraphin takes on the history of Mormonism."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":5395.45,"end":5399.61,"speaker":"Dcn Seraphim","text":"Everybody, I guess send all of your hate mail to Jonathan."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":5401.38,"end":5402.82,"speaker":"Jonathan Pageau","text":"All right, everyone, talk to you soon."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":5402.82,"end":5403.38,"speaker":"Dcn Seraphim","text":"Bye. Bye."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":5403.86,"end":5418.9,"speaker":"Jonathan Pageau","text":"If you enjoy these videos and podcasts, please go to the symbolicworld.com website and see how you can support what we're doing. There are multiple subscriber tiers with perks. There are apparel and books to purchase, so go to the symbolicworld.com and thank you for your support."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":5420.02,"end":5482.47,"speaker":"Laura Diaz","text":"Tucson the Weight is Over Mediweight Loss. They're officially open on North Oracle Road. That's right. No more counting down the days. You can walk in right now and start your journey to a healthier you. Hey, it's Laura Diaz from iheartradio and you can trust me. This isn't just another weight loss clinic. I know that because it's where I lost weight safely with real medical support. GLP1 medications. You can see them everywhere online right now. But the truth is your health shouldn't be a DIY project ordering these meds without the professional guidance. It can lead to dangerous mistakes, wrong doses, no oversight and serious risks. At mediweightloss, I got the same medication but with a customized plan, weekly check ins out, and a licensed physician guiding me every step of the way. And the cost? The same as those risky online options. Tucson, your moment is here. If you're ready to take control, feel better and lose weight the right way, mediweightloss is ready for you. Walk in, get started and see real results. Call or visit mediweightloss.com to learn more and book your free consultation today. That's mediweightloss.com we're chatting with our guest."}
{"episode_id":"SW - #414 - 2025-10-03 - Dcn. Seraphim Rohlin (Universal History) - American Folk Magic and Christianity - From the Reformation to Mormonism","start":5482.47,"end":5496.06,"speaker":"Dcn Seraphim","text":"811 megaphone man Call 811 before you dig. You never stray from your mission of letting homeowners, landscapers and excavators know you should always call 811 before you dig. Call 81 1. Brought to you by Southwest Gas."}
