{"episode_id":"SW - #351 - 2024-07-31 - Did God Want Adam and Eve to Eat the Fruit -","start":0.48,"end":1599.35,"speaker":"Jonathan Pageau","text":"Hello, everyone. I thought that I would spend for this patron only video a little bit more time talking about the tree of knowledge of Good and evil, or as my brother loves to put it, the tree of the knowledge of good and bad. You know, I made several statements recently, I did a video where I discussed this question about the tree of the knowledge of Good and bad. And I've made a few times a few statements about the church fathers about 10 Ephraim, the seer, Syrian, St. Irenace of Lyon, and how in their writings they talk about how if Adam had waited and had been humble, God would have given him the fruit, even though in the text, in Genesis it says that they're forbidding from eating the fruit. And so, you know, for some people, the Church father saying that might be enough. And they might feel like, you know, that's the Christian tradition, that's what the, the fathers believed. But I understand why for some more biblically minded Christians, they might think that it's a cop out. They might think that, or even atheists or even secular types, they might think that it's a cop out to say that, that I'm not actually dealing with the difficulty in the text and in the Bible about this weird situation where God doesn't want Adam and Eve to eat the tree of the Knowledge of Good and Evil and says that they'll die. Interestingly enough, if you pay attention, soon another discussion that I had with Alex o' Connor will be out where we discuss this specifically. But I thought before even it comes out, we could look at this question and what it will do. Also it will help you understand the way the Church Fathers live in Scripture. This is Jonathan Pedro. Welcome to the symbolic world. And so this is a difficult thing for us to understand too, is that the Fathers lived in Scripture in a way that is very difficult for people today to understand that it wasn't just that they knew their scripture, but they lived in it. It was the entire frame of their being. And therefore sometimes when they say something about scripture, they are so imbued in the text that they don't feel like they have to refer to where it is that they're getting their thing in the Bible, because it's so obvious and so imbued in the, in their frame of mind, you know, and it's not just scripture, it really is Christian tradition, but that's what is imbuing their mind. But if you look in scripture, you'll find the traces of what it is that they're saying. And so this will also be A good way for us to kind of go into the text and I'll show you how this idea that God was going to give Adam and Eve the fruit of the knowledge of good and evil is actually in the Bible. It's not just something the church fathers came up with. It is them continuing to the deep, deep tradition, you know, of coming out of Judaism into Christianity and completely exemplifying it in their writings at different levels for different fathers as well. Now, the first thing to do is nonetheless to remember the text of St. Ephrem the Syrian, because St. Ephrem is amazing. The Hymns on Paradise. I'm telling you, folks, if you haven't read it yet, reading the Hymns on Paradise is a masterworks in symbolic thinking. And you will read it and reread it and have to pay attention to every line in it, you know, to kind of understand how powerfully St. Ephraim sets up the structure. Now, the way that St. Ephraim helps us understand the garden is that he relates it because he can see the relationship and structure between the Garden of Eden and the Tabernacle and the Temple and the mountain. All of these images of sacred spaces that are set up in Scripture, he sees them as basically being the same thing. So when he helps you understand the Garden of Eden, he's doing it using the Bible, the structure of what a holy place is. What a place where God walks, where God reveals himself to man, what that place looks like. And therefore it's helping us understand the garden in that way. And so the way that he sets up the structure is that he says that the Tree of Life is the highest tree. It is in some ways the place of the. Of the revelation itself. It's at the top of the. Of the mountain. And that the Tree of the Knowledge of Good and Evil is placed in the middle of the garden. And what he means by the middle of the garden is between the bottom of the mountain and the top of the mountain. That's where the Tree of the Knowledge of Good and Evil is. And then the Tree of Life is at the very top of the mountain. And so the Tree of the Knowledge of Good and Evil becomes a veil, becomes like the holy place looking into the Holy of Holies. And it becomes, in some ways that veil becomes for Adam and Eve, a kind of test of humility and of preparation in order to be able to enter into the Holy of Holies, into the highest place. And so I want to read a little part of the text if you want to look into it more. It's him three is the hymn where all of this is happening. The whole hymn is beautiful, you know, it's hard when you try to quote parts of it, because if I could, I would have quoted the whole thing. But I don't want to spend all my time on it. So. All right, here we go. And so in him 3, section 10 says, God established the tree as judge, so that if Adam should eat from it, it might show him that rank which he had lost through his pride, and show him as well that low estate he had acquired to his torment. Whereas if he should overcome and conquer, it would robe him in glory and reveal to him also the nature of shame, so that he might acquire by his good health an understanding of sickness. A man indeed, who has acquired good health in himself and is aware in his mind of what sickness is, has gained something beneficial and he knows something profitable. But a man who lies in sickness and knows in his mind what is good health is, is vexed by his sickness and tormented in his mind. So then he goes in and gives an example of this a little later in hymn three, section 14, where he says, in the midst of paradise, God had planted the tree of knowledge to separate off above and below sanctuary from holy of holies. Adam made bold to touch and was smitten like Uzziah. The king became leprous, right? And so it's clear what he's saying, right? He's saying, basically, it's like a veil, it's like a test. If Adam had been humble and not prideful, then he would have received the knowledge of good and evil from the point of view of good, the knowledge of good and bad from the point of view of bad, and would have known what shame is, would have known what difference is, would have known what you know, let's say what a bad thing is. But from the point of view of good. But because he took it in pride, then he basically, it revealed his lowly rank to him and it opened up. He talks about it at other places. It actually opened up the holy of holies to him and he saw the glory of God. That's what happened when he took the tree of the knowledge of good and evil. It's actually what the serpent said would happen. He took the fruit and then it opened up the glory of God. But the glory of God was now to him a kind of judge. It was too bright on him so much that he had to hide himself, and then saw his shame, saw his bad, because he had been presumptuous and tried to raise himself up when he wasn't ready to do that. All right? And so now if we want to understand that this idea that God wanted Adam and Eve to receive the fruit, the place to look is not in Genesis. You know, the Bible is an interesting text because it moves back and forth, right? It talks to itself and it responds to itself. Now, the place we need to look at in order to know that God wanted Adam and Eve to eat the knowledge of the fruit of the knowledge of good and evil is actually in the story of Solomon. Now, in the story of Solomon, there are two versions of the story. Now, the one that is important to us at the outset is the one that's told in 1 Kings the now first Kings 3, 1, 15. Let's look at this. So at Gibeon, the Lord appeared to Solomon during the night in a dream. And God said, ask for whatever you want me to give you. Solomon answered, you have shown great kindness to your servant, my father David, because he was faithful to you and righteous and upright in heart. You have continued this great kindness to him and have given him a son to sit on his throne this very day. Now, my lord, you have made your servant king. You have made your servant king in place of my father David. But I am only a little child and do not know how to carry out my duties. Your servant is here among the people. You have chosen a great people, too numerous to count or number. So give your servant a discerning heart to govern your people and to distinguish between right and wrong, between good and evil, between good and bad. That's what he's saying. For who is able to govern this great people of yours? The Lord was pleased that Solomon asked for this. So God said to him, since you have asked for this, and not for long life or wealth for yourself, nor have asked for the death of your enemies, but for discernment in administrating justice, I will do what you have asked. I will give you a wise and discerning heart, so that there will never have been anyone like you, nor will there ever be. Moreover, I will give you what you have not asked for, both wealth and honor, so that in your lifetime you will have no equal among kings. Etc. Etc. Etc. All right? And so what's interesting in this text is that you know Saint Irenaeus Levilion, that's how he presents Adam and Eve. He presents them as children. He says they are children in the garden and they have to learn, they have to be trained, they have to become more than what they are in order to attain their purpose, which is to be united to God, which is actually to become God through participation, to become what Christ was given, what Christ was incarnated into. That was the telos of man. That's what. The telos of what. Of what God wanted for Adam and Eve. And so what's interesting here is that this is the way that Solomon presents it. Solomon presents it and saying, he humbles himself, he says, I am but a child. So if Adam and Eve had recognized that they were, but children had recognized their humility, had not been prideful and arrogant in trying to take for themselves that which was not, that for which they were not ready, then the result would have been different. And we see that the result is different because that's exactly what Solomon asked for. Solomon asks God to give him what Adam and Eve took in the garden. And not only does God give him that, he says, this is the greatest thing you could have asked for, it is the greatest thing you could have asked for. And therefore I will give it to you. And not only will I give it to you, but because that is what you asked for, then I will give you wealth and honor and everything else on top of that. Okay, so then what is the difference? Like, what is the difference between receiving the knowledge of good and evil and being inappropriate, or receiving the knowledge of good and evil in an appropriate way? Now, of course, the difficulty in this. And I want always to remind you that, you know, it's difficult when we talk about these things because we kind of fall in theological language and we have a sense in which it's like, we think we understand it. Because I'll, you know, I'll tell you this, and then you'll say, oh, I get it. You know, it's like, okay, they took the fruit. They shouldn't have taken it, you know, and it's the knowledge of good and evil. Then they have this thing they know, you know, they're in goodness. And then now they know shame instead of being in shame and knowing goodness. And it's like, it makes kind of. It makes sense, right? We think we know it, but we have to be cautious to not think we understand it until we understand it. And the best way to understand it is that the Scripture is actually talking about reality. And therefore, we always have to be able to see the fractal representation of what it is the Scripture is talking about. Now, this, of course, is what's amazing about Matthew's book about his language of creation, which is that he's able to help you see the structure so that you can apply it at almost anything and that it makes sense. Now, this is of course, a place where we specifically have to do that, because in some ways it is the very origin of understanding the relationship between wisdom and knowledge, for example, and understanding how it applies to our life in general. So one of the keys to understand it is actually to look at the other text that king, the other place in the Bible where King Solomon asks something from God. Now, and we're not going to go through it again because I don't want to spend so much time like reading the Bible. But you can look at it for yourself. It is in Second Chronicles, chapter one. And in that version, what Solomon asks for is wisdom and knowledge. That's what he asked for. He says he asked for wisdom and knowledge. He said he doesn't just ask for knowledge of good and evil. Now, what's interesting in the one that we did read is that God says, you ask for knowledge of good and evil, and then I'll give you wisdom. I'll give you a wise heart for discernment. And this is of course, all of that is tricky because in the, in Genesis as well, when Eve sees the fruit, she says that it's good for wisdom and then for the knowledge of good and evil. And all of that is true, right? It's like this is the key, like, of kind of understanding in some ways what it. What is the. What is the. What is being played with in terms of understanding. And it is in some ways the difference between the knowledge of good and evil and wisdom. Now, wisdom, you know, we think of wisdom often as something like applied knowledge. But the best way to understand wisdom is to understand the reason for knowledge is to understand what is the reason for the knowledge of good and evil. Like, what is the purpose? Right? And so it's not just that it's applied in the sense applied to every day, to everyday life, but that it is in some ways higher. Because it is because knowledge of good and evil is something that. It's like you could just know what good and bad is. You don't understand why you don't understand the purpose of good and bad. You don't understand the higher thing that unites them together, you could say, and therefore it can lead you to a whole lot of mess, which is what we see in the story of Adam and Eve. But the idea that ultimately what you need is wisdom that anchors the knowledge of good and evil, that's the good way. That's the best way of understanding it. And so what I want to do with you is I want to look at some examples, hopefully as close in everyday life to kind of understand what it is. You know, what the problem is of trying to gain the knowledge of good and evil without the proper alignment, without the proper. Or like receiving it from heaven, receiving it from purpose is maybe a good way of understanding it at a lower level is that unless you receive the knowledge of good and evil from the higher reason, from the purpose for which you're doing something, then it will lead you into a lot of mess. Now an example in the Bible of this is the grumbling we call the grumbling in the desert, right? And so the Israelites are in the desert, God is leading them to, to the promised land. But they don't seem to totally know that. They don't. They can't see beyond their struggle, they can't see beyond their lower struggles. So they see they don't have food, they don't have enough water, they don't have enough of the comfort stuff that they used to have back in their slave days in Egypt. And because they can't remember, they can't see beyond their duality of good and bad at the lower level, they can't see the purpose of why it is that maybe they're struggling, they don't have as much as they did in Egypt because their aiming towards a higher reality. Then they have the knowledge of good and evil, you know, quote unquote, without wisdom. And now they, then they grumble because they can see good and bad. Oh yeah, because they're hungry, because they're thirsty, because they're suffering and they have all of this problem. But because they are not able, they don't have the wisdom to be able to see what it is that God is doing for them. Then their situation becomes unbearable. It becomes a kind of complaining and a grumbling in the desert. That's one aspect of understanding the problem, right? Of the, of the knowledge of good and evil that is taken without proper alignment, without the proper alignment towards a higher reality. Because then it creates this issue where it is you are suffering but you don't know why you're suffering. And therefore because you don't know why you're suffering or you don't, or because you can see good and bad at the lower aspects, then you can't really align yourself properly. There are many examples of that. One of the ones I've used before, but I think is just one of the best example is in Karate Kid. For those who don't know in Karate Kid, there's a sensei Mr. Miyagi, who teaches karate, and he tells this young boy, I'll teach you karate. He. Right. But when the young boy starts his training, Mr. Miyagi, it just says, all right, now go paint my fence. And then he goes and he paints the fence all day. And then the next day he comes back and he says, now go wax my cars. And he's. He shows them how to do it. Very particular way of waxing the cars, putting the wax on, rubbing the wax off. And. And. And he. I think there's three. Like, he tells him to do these chores that are. And Enzo, Karate Kid, the Karate Kid, is stuck in a situation where he's doing a bunch of things, and he can see that it hurts, and it's frustrating. But he doesn't know why he's doing them because he doesn't know why he's doing it. He's stuck in the problem of the knowledge of good and evil without being able to see beyond it, without being able to see the wisdom, the application, right? The orientation of what it is that he's doing. And so now he's stuck in the problem of. And then Mr. Miyagi, at some point, reveals to him the purpose of what he's doing. And what it does is it aligns him, right? As soon as Mr. Miyagi says, okay, now I'll show you how the things you're doing, painting the fence, waxing the cars, is going to help you in the purpose that I've set for you. And then it kind of realigns him properly. Okay? And so this is, of course, ways in to kind of understand how the knowledge of good and evil and the higher aspect of it, how they're connected together. Now, in the story of Saint Ephraim, you know, he talks about Uzziah, and he says, uzziah is a man in. In the story of King David, who. The priests are carrying the Ark of the Covenant. And then they slip, and the Ark of the Covenant starts to fall. Then Uzziah goes up, and then he tries to stop the Ark from falling. And he touches the Ark and he falls dead. And the idea in the text is that in some ways, he didn't. He. How can I say this? Like, he did it impetuously because that wasn't his role. And he wasn't a priest. He wasn't in the right place to touch the holy thing. And therefore, the holy thing for him became a kind of harsh judgment and a painful judgment that brought him down. And so there's another. Another way of Seeing it another way into understanding the relationship between the knowledge of good and evil and the higher truth or the higher mystery that joins them together and makes them properly is in understanding something like the Dunning Kruger effect, right? A lot of people are talking about the Dunning Kruger effect right now, which is that the tendency for people to overestimate their capacity. All right? And so it's a different tack. And in some ways it seems. It might seem unrelated, but this is the more prideful element of the grabbing of the knowledge of good and bad for yourself when you're not ready for it, which is the idea of thinking you can do something when you're not ready for it and kind of claiming that for yourself. And then as soon as that happens, right, you become a slave of good and bad. Good and bad wrecks you, right? Good and bad does not. Can I say this? Like sand? Ephraim says, it's not like you are in a place of good and you can see how things could go wrong or how things could be off. No, no, no. Now the good and bad just totally destroys you. A little example of that that I've lived in my life. And, you know, it's just funny because it's my son, you know, I love my son. He's an amazing boy. But when he was young, we brought him one time to join a soccer team. I think he was super young. He was like 7 years old. I don't remember 7 or 8 years old. And he wanted to play soccer. He was really excited about it, and he just wanted to play soccer, but he never really played soccer for a soccer team. And then he went to the soccer practice, and the coach said, okay. You know, I think it's like their goalie wasn't there. And so he asked the team, he said, we need a goalie who wants to be the goalie. And my son said, I'm going to be the goalie. And everybody was like, well, have you been a goalie before? He's like, I'm amazing. I'm really good. I'm the best. Like, I'm really good at being a goalie. I mean, he was super young and he thought that he could do it. Like, he was sure that he could be the goalie. And. And. And so he was so confident that he convinced the coach, right, to put him as goalie. And then what happened? Right Then the light of the glory of soccer shone down on him in a way that he was not ready for. That exposed his shame, right? Exactly. Like in the Garden of Eden, it Exposed his shame instead of being a vehicle to. For his glory, right? If he had been ready for that, if he had been ready to become goalie, if he had practiced, if he had done everything needed, and then at that moment, right, the coach had recognized him as being ready to become a goalie and had given that to him from above and would have said, oh, I see you're good. Like, I've been watching you practice. I've been seeing what you're doing. I'm going to take you from below, right? Like Christ says, sit in the back so that people can ask you to come to the front, right? He would have said, now you come into my glory. Come into the glory of soccer, and I'll put you as goalie. And now you will. And now the knowledge of good and evil will be a garment of glory for you, and you will become, you know, a shining soccer star. But instead, my son was like, I can do this. Like, I'm the. You know, I'm really good at playing soccer. I'm really good at being a goalie when he had never done it before. So they put him in the goal, and he was humiliated. Like, humiliated in a way that was so sad to watch. You know, he just bawled and cried and, you know. You know, we had to comfort him, obviously, you know, and. And it was so difficult for him to go through that. It was one of those things that we've all been through that. I remember his story. I probably have a hundred stories like that from when I was young or in my life when I. When I'd been cocky and thought that I could do something and plate myself in a situation like that. But it's just the one story that I remember. And what it can help you understand is just to what extent these stories, right? The stories in the Bible, the story of the knowledge of good and evil, good and bad, and it's, you know, the idea of the right. Taking that in the right way or entering into the knowledge of good and bad with the right attitude and humility and receiving it from above will bring you into the holy of holies, will bring you into the glory of the thing that you're participating in, whether it is. Whether it is ultimately your spiritual life and God, or whether it is playing soccer or whatever, or whatever you're engaged with. And so hopefully that was useful to kind of help you understand what it is that these texts are talking about. And everyone, thank you for your support as usual. I really appreciate everything that, you know, that you're willing to support what I'm doing and that you take it seriously. It's. It's very. I appreciate it. Every day gives me great joy that I have the chance to do this. And so thanks a lot. We have a lot coming very soon. We're going to announce all the new courses. We've got so much stuff coming coming up. We just finished all the art for God's Dog. It's really great. We're finishing up Jack and the, the Beanstalk, Jack and the Fallen Giants. So there's so much stuff going up and your support definitely makes it possible for my, for me to free myself up to be able to do all those things. So thanks everyone and talk to you soon. Bye. Bye. If you enjoy these videos and podcasts, please go to the symbolicworld.com website and see how you can support what we're doing. There are multiple subscriber tiers with perks. There are apparel and books to purchase. So go to the symbolicworld.com and thank you for your support."}
