{"episode_id":"SW - #056 - 2019-09-14 - Twitter and Mass Shooters","start":0.32,"end":107.73,"speaker":"Jonathan Pageau","text":"I'd like to welcome you to the Symbolic World podcast. On this episode, I will be playing for you back to back two videos that I made that are talking about the same subject in a different guise. You could say one was about Twitter and the reign of chaos and the other was about mass shooters. And what I'm looking at is how chaos doesn't manifest itself so much, at least often it doesn't manifest itself as a kind of mush. You would say, you know, that as the things decompose, what happens is what you get is many tyrannies. You have little points of attention that try to grab all your attention and do it in a way that is in rapid succession. And so when you look at mass shooters and Twitter, all of these have a similar structure in terms of showing us what it looks like when something breaks apart. So I want to remind you that everything I'm doing, all these videos, the podcast, it's all done thanks to your support. So if you love what I'm doing, if you are fascinated by symbolism, go ahead and go to the symbolicworld.com support. You can find ways to support the podcast. All supporters get early access to a lot of the videos. Plus I have started to add one video a month just for supporters that is usually an interpretation of a traditional story. This month I will be doing Rumpelstiltskin and there's some really fascinating stuff in there. So go ahead and do that if you like what I'm doing and so enjoy. This is Jonathan Peugeot. Welcome to the Symbolic world."}
{"episode_id":"SW - #056 - 2019-09-14 - Twitter and Mass Shooters","start":118.26,"end":2071.39,"speaker":"Jonathan Pageau","text":"One of the things I'm constantly talking about is hierarchy. The notion that the world exists through these hierarchies of meaning and the consequences of what happens when those hierarchies break down. And I thought that I would give a very particular example that we're seeing today, which is in the rise of social media. We are actually seeing the. We would call the reign of chaos. And it doesn't look like. Only look like a kind of mush. You know, you can imagine something decomposing and becoming a kind of incoherent mush, but rather it appears as the succeeding tyrannies, you could say, as a form of all these mini tyrannies which pop up and try to assert themselves. And so in our society, we've been seeing the notion of hierarchy break down ever since, for several hundred years by now. And we're seeing accelerate in, in the 20th century and in the 21st century with postmodernism, this notion that hierarchy itself is bad, that we talk about multiplicity we talk about all these terms which tend to emphasize diversity and all of that. Now one of the difficulties that happens when chaos starts to reign is that it ends up actually looking like a bunch of little tyrannies. One of the things that I noticed my first glimpse of that was actually when I lived in Congo and in Kinshasa, the state had broken down, we were living in a state of chaos. And so that did look like a kind of lawlessness, a kind of far west reality where anything can happen, anything can, can, anything goes. But it also manifested itself in explicitly giving room for little tyrants, warlord type figures, or people who could abuse their power. So in a state of chaos, a policeman can abuse their authority much more because there's impunity, there's no structure to judge his actions. And so encountering a police officer, for example, as you're driving, can become your worst nightmare because that person is, is going to impose themselves on you like a little tyrant. And so I had to deal with that quite a bit. When I was in Congo, I tried to get myself out of sticky situations where I had been stopped by the police and they were trying to get some money out of me or some kind of impose their power on me. And so when someone has a weapon, that is obviously can become a very scary thing. Now, obviously most people have not been in Congo or in those types of countries, but we can see something like that happening right now on social media, and we can see it happening especially through Twitter. Now as we're watching, let's say, the narratives break down, as we're watching the narratives fragment. Social media is becoming a series of little tyrannies. And what do I mean by that? Now, one of the ways that the little tyrannies have been, we've been seeing the little tyrannies appear in our space is the notion of fashion. So the notion that something becomes fashionable and then goes out of fashion is a caricature of a tyranny. And so in a world where people are not turned towards a common goal, a common purpose, a common center, then our desire for centers is not going away. That's how we're made. We're made to desire something which brings things together, focuses our attention, focuses our desires, our energy into one direction. That's just how human beings are made. So in the absence of a all encompassing center, something which transcends us and which kind of brings us together, what ends up happening is not just a bunch of random occurrences, but rather the appearance of extremely strong points of interest that succeed each other. And so what it does is the breakdown of hierarchy accelerates time. What do I mean by that? Now, fashion is a good way to see that. And so in fashion, what you can see is things appearing. You know, all of a sudden everybody is. Everybody has a. Everybody has a mullet. And then it's. The mullet is the thing to do. And everybody's getting a mullet and a mullet and a mullet, and then all of a sudden it falls out of fashion. And then you're an idiot to have a mullet. You're such a moron. And we've seen that happen quite rapidly. What is it? A year and a half ago, every single child in the world had a little hand spinner. And you, everywhere you would go, you see these children with little hand spinners. And then a year later, they're all gone. They've all disappeared. And so you can see that happen in all kinds of domains, in music, in fashion, you know, in all kinds of cultural manifestations. Because, you know, because we're not focused on a transcendent ideal, because we're not looking towards something which will stabilize the hierarchies where we actually end up having all these little things pop up and succeed each other in rapid succession, you know? And so that's what I mean by it. What it does is it actually accelerates time. And I think most people can feel that time is accelerating right now. Most people can feel that the world is accelerating. And part of this has to do with the breakdown in a normal hierarchy because of the rapid succession of what you would call focuses of attention in terms of what's happened. And so we can see that now with this whole idea of the news cycle and all these crazy news cycles that pop up and these things that appear. Another thing that can help you understand the problem of these little tyrannies is of course, the whole idea of something going viral. The very name viral is a great name for what that is, because a virus is exactly that. A virus or a disease is a breakdown in hierarchy of your body. There's a breakdown in the normal functioning, in the normal hierarchy of the body. And there's something that. There's a disease or a microbe, a parasite, which all of a sudden takes up all the attention and becomes. And so in the breakdown of the bodily hierarchy, there's a little tyranny which appears and then. Which will draw all your energy, draw all your attention into that parasitic thing. And so the idea of videos going viral, a post going viral is. Is exactly that. Something appears. All of A sudden, and everybody's talking about it. What was it? That crazy meme about what's her name? Was it Momo or something? Some hoax online about this evil thing that people were doing? And then within, in a few days, everybody was talking about it. My whole Twitter feed, my whole Facebook feed was full of people who were talking about this one thing. And then a week later, it's as if it never happened. And. And so the idea of virality is a caricature of the desire that we have for focusing our attention, for focusing in a hierarchy. And so you can see that there's an analogy in that to our own self, into our own bodies. And so giving in to a passion is exactly that. When we give in to when the normal hierarchy of our being, let's say we with meaning as being first, with our spiritual identity as being first. Once that starts to break down, we now start to focus on lower things, and we get these little tyrannies. Now, the little tyranny could be an obsession with a food. It could be an obsession with eating chocolate or eating certain things. It can be all kinds of desires that pop up and that completely suck away your attention and into that desire. You know, pornography is probably one of the best examples because it fragments into all these little types, all these little genres, and every little genre becomes this obsessive thing where people focus only on that one genre. And so it becomes this strange tyranny of attention that will drag people into it and will take up all their attention. And so this is a phenomenon that we're seeing all over the place. And one of the symptoms of this breakdown is, of course, the way that Twitter works. The amazing thing about Twitter is it shows you what it means for there not to be hierarchy. And so on Twitter, you have all these people speaking, and it's even crazier because a lot of them are anonymous. And so you have all these. You have all this bubbling up of all these little things that people are saying, and a lot of them are anonymous. And so what happens is that you, the media on either side can draw a narrative, any narrative that they want, and they can increase the breakdown of culture by doing that. Now, let me give you an example. Let's say something happens in the world. Let's say there's a shooting like we saw in New Zealand. And so someone in the media will write an article and say, people on Twitter are saying this. And then they will find the craziest thing that they can find on Twitter and they will put it up there. Someone who says, because of the New Zealand shooting, we need to ban Jordan Peterson and ban Sam Harris and ban all these people from the platform. And so, you know, other people are freaking out because all of a sudden, people on Twitter are saying this, and it's like, who are these people on Twitter? We don't even know who they are. They've just been. They're this sea of crazy chatter of tweets of Twitter. Exactly. Of a kind of inane chattering. And then someone points to that and pulls something out and says, this is reality. This tweet that I found here that maybe has 12 likes, or even if it has 1000 likes, it doesn't matter. It's nothing in the. In the main narrative. But they point, they take it out, and they say, here, this is reality. And so you can see how the. The. The absence of. Of hierarchy and the absence of a hierarchy of meaning really does create this strange. This strange capacity to make anything all of a sudden, make it make anything real. And that's what happens with the absence of authority. That the fact that every voice is somehow equal, that we actually do believe that every single voice is equal, means that you can just pull out some random voice and you can write an article saying, this is what people are saying on Twitter. And you can have four or five. You can have 10 tweets. Oh, look at these. 10 tweets that are saying things that cause me outrage, or 10 tweets that are saying things that I agree with. And so look at what people on Twitter are saying. And what's crazy about Twitter, especially Twitter, is that we don't know who those people are. They could actually be people who are pretending to be what is there. We have no way of knowing whether who these are, what their intentions are, and on what side there are. You know, every time someone will put up some tweet of someone saying something crazy, you always have to ask yourself the question, if, is it someone from their side who's putting up something crazy so that they can then point to it and then say, look at what the other side are saying. We have no way of knowing. And that's really the very notion of the incapacity to discern which comes in this breakdown of hierarchy and the breakdown of meaning. And so you can see. And then you can also see how in the breakdown of a normal hierarchy, what ends up happening is you start to get these warring sides. And because there's no way of qualitatively distinguishing voices and qualitatively distinguishing information, what they'll end up doing is they can point to. They can point to little things on the other side that exist but that are not important in the hierarchy. And they can say, see, see, look, this is why we oppose them. This is why we're against them. And so that. And because there's nothing to bring us together, there's no transcendent ideal to move us in the same direction. There's no way to discern, because the problem is that the facts that are being quoted are true. It is true that there are people on Twitter saying crazy things. You can point to the tweets and there they are. So you'll see all people, people on the left, but also people on the right. You get people online, even people like Sargon of Akkad who will make entire videos pulling out tweets on Twitter which he thinks are insane, and then making fun of them on his podcast as if, as if those tweets are anything but a bunch of gibbering chatter from people that you don't know who they are. They could be 12 years old, they could be larping, they could, they could be pretending to be their enemy in order to mock them. And we saw that even conservatives got caught up in that. You know, when they did that, I forget the name of the group that did it, but they did these studies about sexual predators and dogs and they published it on a liberal, in a kind of left leaning journal. And, and the more conservative or more straight journalists got caught up and saw that as something which was actually real. And then the people on the other side also thought that it was real, but it was someone pretending to be their enemy in order to make their enemy accept things that maybe they wouldn't even have accepted without that happening. See, that type of insane incapacity to discern, that is what it looks like when there's an absence of hierarchy. And it ends up looking like a rapid succession of little tyrannies which will only speed up, guys. It's only going to get. Go faster and faster. You know, the news cycle now is absolutely insane. And not only is it insane, but the speed at which we forget the previous news cycle is also insane because that is also a thing that is necessarily going to happen when hierarchy breaks down. Hierarchy is memory. Hierarchy is the manner in which things remember their purpose, even though they're far away from it. That hierarchy is a form of normal memory. And as hierarchy breaks down in society as the, the common purpose, the common goal, the common direction breaks down, then one of the things that will break down is Also memory. And so these rapid succession of little tyrannies that are quickly relegated to the past and we just move on to the next one. And we see this getting faster and faster as the cycles accelerate. I wish I could tell you what the solution is in terms of society. Sadly, I cannot. But. But I can only help you understand the problem, see it in your own lives in terms of this also, these tyrannies of desires that you experience and how they also, let's say, pull you away from the normal hierarchy, from your normal purpose, the things that you really would like to want or like to value, and see how this is a pattern which manifests itself at all different levels. And if we can at least work on our own, let's say, passions and our own little tyrannies, our own desire to give in to fashion, to give in to fashionable ideas, to give into the click bait, the rage bait. You know, this kind of mob mentality where we move from scandal to scandal, because a scandal is exactly that as well. A scandal is a kind of inverted hierarchy where some dark thing appears as attracting all our attention. So if we want to get away from that, we have to start with ourselves, and hopefully it will help us then also pull away from the other scandals. And so maybe that will also help all of you to understand why. I am very careful and I try to not comment too much on current events. And I know that this might seem strange to some, but the idea that these current events are meaningful is extremely dubious. We need to be able to pull away from current events and see the patterns. But when we get caught up in this succession of current events, of Donald Trump's latest tweet, or Justin Trudeau's latest idiotic thing that he said to the media, we are losing. We lose the capacity to pull away and to view patterns in a bigger sense. And so I can only plead for everybody to take the time to do that in your life and also as you look at society as a whole. So, thanks again, guys, and I will see you soon. And so what I'm talking about here is what we could call the tyranny of the individual. One of the things that represents the modern age is the individualism in which we have come to exist. That is, as the purposes that we have in common, as the identities we have in common. As society stopped looking towards the same transcendent ideals, the world started to move more and more into a kind of fragmentation. And that fragmentation is ultimately realized in what we could call individualism. That is the notion of individuals as small Independent points on a space that aren't related together in any discernible way. The only way in which, in the world of individualism, people seem to be connected together is as economic agents in terms of their capacity to produce, their capacity to consume. All of that is the last ditch of a world that is breaking apart. And it is not sufficient. It leads to some serious diseases that we see in society today. And the problem is that we can't desire for something more. We can't desire to heal the issues, the disease, a lack of meaning, the fall into nihilism, the fall into drug use, and, you know, the fact that we become addicted to things like pornography and to different drugs, all of that cannot be healed in only its manifestations. The problem is much deeper, and it is the problem of watching our common ideals, our common identities, start to fragment. And so, in one of my last videos, I promised you that maybe I could start laying out more criticisms to Jordan Peterson. Jordan Peterson is my friend, and I respect a lot of the things he says, but there are many things that I disagree with him on. And this is, of course, one of the things that I disagree on. I do not believe that the individual is a sufficient ideal in order to preserve societies, in order to help us get out of this meaning crisis or this crisis of Western civilization. I wanted to look at a specific. A few specific manifestations to show what it looks like when our commonality begins to break apart. Now, as I've mentioned before, when the common ideal, the transcendent ideal, starts to lose its grip, or we start to turn away from this common, transcendent ideals, then what ends up happening is not so much a devolving into a kind of brown mush, you know, like a. A kind of decomposed apple or something like that. Although that is what happens. But what that looks like really is a, let's say, a tyranny of the specific, a tyranny of the individual, is that instead of us all kind of looking towards something which unites us, what ends up happening is in our distraction, in the fact that we've lost this common focus. We start to focus on specific things. Arbitrary things start to pop up and then take up our attention. The important way to understand it is to always remember the strict analogy that exists between a person as a coherent being and a society as a coherent being as well. The way that a person comes together, but also the way a person fragments is similar to the way that a society comes together, but also fragments. And we can see that as our attention as individuals Breaks apart in certain ways, our attention as societies breaks apart in very similar ways and in ways which are very analogical. So, for example, as a person, the way that our attention breaks apart or starts to fragment is what Christians, especially orthodox Christians, have preserved as this notion of the passions. We have in us a bevy of desires. And these desires are not bad in themselves. They are fine if they are, let's say, gathered together and held together with a common purpose or a common unity. But as we forget that common unity, then those desires start to pause us apart, start to rip us apart, and start to appear as little tyrannies. And so we have the little tyranny of the belly, we have the little tyranny of the eyes, we have the little tyranny of paying attention to gossip or, you know, the tyranny of our sexual desires as well. Those things can. Because we've. As we forget our transcendent purpose, as we forget our common, the thing that brings us together, then those individual desires can appear to us. They can suddenly appear to us as little idols. They suddenly take up all of our attention. We give in to those desires, and then all of a sudden, we deal with the consequences afterwards. Okay? And so in a culture, the same thing can happen in a normal traditional culture. We are all, let's say, worshiping together. Hopefully, that is what. What we're doing. If not, then at least we're worshiping analogically together. That is, we're not completely. If we. If we're not completely separate, we at least have some things that we hold in common. And we have an ideal, societal ideal that we hold together. But as that starts to break apart, then just like a person's passions starts to pull them apart, so too these things analogous to our passions will start to pop up and take up our attention in a manner which breaks us apart. Now, this is exactly what celebrity culture does. Celebrity culture, the people who are able to pop up and appear in celebrity culture as grabbing our attention now all of a sudden manifest the very opposite of that unity. They will manifest things like, for example, being an actor pretending to be something that you're not. Now, there's nothing wrong with being an actor, but the fact that someone who pretends to be something else all of a sudden takes up the most important amount of our attention is very problematic. The same with music. There's nothing wrong with music, but the fact that musicians, that people who are there to entertain us, clowns, basically, the fact that our clowns have now become the top attention grabbers in our society. Shows us what direction those are going. And then if you look at what those celebrities will manifest, they will be equivalent to the individual's passions, you would say. And so people who now all of a sudden grab attention are people who will be excessively. Excessively full of pride that. Who will be excessively full of sexual energy, who will manifest a kind of boastfulness, a kind of excess which is equivalent to the excesses that we ourselves can encounter at our margins, let's say. So there is this strict analogy, constant, strict analogy between the individual as a person and the his or her passions on the fringes, and how a society, as it breaks down, how the individual can suddenly take up attention. And so we end up with a very strange world in which all of a sudden, someone who pretends to be a, you know, something else for a living, someone who is basically a clown, will have political opinions that everybody thinks are important. And they will be expressing their political opinions or their opinions on religion or all kinds of things that somehow we somehow think that that has value. And that is because as this breakdown happens, these little tyrannies pop up. And one of the ultimate examples of this has been the event of the mass shooter. Now, the mass shooter is very much a symptom of this breakdown in meaning that we're seeing, because one of our, let's say, desires that we have on our fringes is this desire for violence, this desire to show our strength upon others, to impose our power upon other people. This is something that if we're attentive to our desires and to our thoughts, we will see kind of appearing in our fringes. We usually do it with words, or we usually do it by making fun of someone, by talking about someone behind their back. We do it by, you know, by playing the victim in a manner which will then give us power against the other person. We have all kinds of strategies in which we are. We try to show our power upon others. But the ultimate version of that is, of course, violent action is, of course, the possibility of ending someone else's life. And so that desire, you know, if we let ourselves go to our fringe, that desire starts to manifest itself as well. And we can understand also how in a society that desire on the fringe can be related to war. That is, as something on the fringe starts to bother, as another empire, another people, another group attacks us or is taking our resources or whatever, then that desire will manifest itself in order to impose our will, in order impose our power on the other group, whether it's to defend ourselves or whether it Is to attack another group. You know, if you invade another country, that's what it is. You are. You are imposing your identity, your will on that other person. And so the mass shooter becomes the individual version of that, the individualist version. So the mass shooter has everything of our culture kind of boiled down together, and that is why they have become so important, and that is why they won't be going away anytime soon, no matter what we do, because they are a symptom of a much more profound disease of culture. And so the mass shooter, because of our celebrity culture, the mass shooter ends up accomplishing what they hope to do, which is one, to attain, get people's attention, become the focus of everybody's attention. And so they become a momentary center, Just like the church in a village, traditional village, is the center of the church. In a society where that breaks down or that our saints aren't the one who bring our attention to that which transcends us, Then in celebrity culture, anybody who can get that momentary attention Becomes a small, tyrannical center for that moment, Is able to impose their identity on everybody else for a single moment. And that is what the mass shooter does. If we look at what happened in new zealand, the new zealand shooter, we see one of the most egregious, but also one of the most potent examples of this happening. The shooter went so far as to tell us what he wanted. The shooter wanted for the culture war to escalate, Wanted that people start banning guns so that those who have guns will then have to defend themselves. He wanted to smear more centrist, conservative thinkers so that people would have to take sides in the culture war. And by doing what he did, he became this little center of attention, this little tyrannical center. And all of a sudden, the change that he wanted actually happened. And it is a very, very sad reality, which is that the mass shooters tend to get what they want, and they tend to accomplish that which it is that they. That they are trying to do. And our society at this moment does not have an answer to the problem of the mass shooter. Because we have completely and fully embraced celebrity culture, because we have fully and embraced individualist culture where we have. We do not see how we need these transcendent ideals to bring us together because we have embraced that culture. We. We can fight as much as we want the symptoms of this problem, but the disease is too profound, and you will not be able to get rid of the symptoms that easily. And so I know that is a bit of a sad finish for my video, But I think it's important to understand how serious the situation is becoming and that although I do talk about Twitter and talk about culture, we have to understand that this breakdown of meaning, this meaning crisis in which we are, has effects which are not purely in terms of meaning, which have effects in everybody's life. And the Mass shooter, sadly, has become a little inversion of an icon for the contemporary age. I hope you enjoyed this episode of the Symbolic World podcast. As you know, these podcasts are all versions that of videos that I put out on YouTube. So if you want to see more, there are a few videos that I don't put up. So if you want to see more of what I'm doing, you can check that out on my YouTube channel. The link is in the description of the podcast and I hear also that if you do want to help the podcast, one of the ways you can do that is to go to wherever it is you're listening to podcast and leave a five star review. Supposedly that is quite helpful so that the podcast gets suggested and promoted and put out there. So once again everybody thank you for."}
{"episode_id":"SW - #056 - 2019-09-14 - Twitter and Mass Shooters","start":2071.39,"end":2073.27,"speaker":"Jonathan Pageau","text":"Listening and I will talk to you soon."}
