{"episode_id":"SW - #277 - 2023-03-10 - Scala Foundation - The Mother Of God","start":0.64,"end":99.08,"speaker":"Jonathan Pageau","text":"She is the embodiment. Like she's the source of body, is the. I don't know how else to say it. And so because of that, she's the one who gave body to Christ. Maybe that's the best way to think of that, if you understand. It's like Christ's body doesn't come from anywhere else besides her. Like that's out of which his body comes. And so she becomes a stand in for the church for all of us. She's a stand in for all of us. That is, she is that which gathers us, gathers us in Worship towards Christ is a good way to understand it, right? And so because of that, that's why also she can appear, appear in visions as well, because she is that. So a good example is, of course, I don't know if you know, she often appears in images of protections, for example, famous Orthodox images, the veil of protection. So in Constantinople, someone had a vision of her in know, above the church and putting her veil as a protection around the church. And so there are versions of that in Catholic art where you've seen, you've probably seen these images where you see the mother of God standing up and then she has her cloak open and then in her cloak is like standing all the people, right? They're all gathered together in her. And so that's a good way to understand it. It's like she is the gathering of the body. And so she, she stands in for the church itself. This is Jonathan Peugeot. Welcome to the symbolic world."}
{"episode_id":"SW - #277 - 2023-03-10 - Scala Foundation - The Mother Of God","start":109.32,"end":186.59,"speaker":"Margarita Mooney Clayton","text":"Let me begin. My name is Margarita Mooney Clayton. I am the founder and director of Scala foundation, which is based in Princeton, New Jersey, where I'm an assistant professor of Practical theology. Scala's mission is to renew culture through bringing beauty into art and education and our faith communities. I'm delighted today to host Jonathan Pageau, who is an artist based in Montreal, Quebec, Canada. He's also the founder and director of the Symbolic World Project, which hosts blogs and YouTube videos. And. And I first encountered him, in fact, as perhaps many of you did, through one of his many YouTube videos. Then I began to look at his website and saw beautiful carvings of the Virgin Mary, different images, icons. And I began to read and listen to his videos and I thought, this guy should be speaking at Scala's next conference, which is April 21 in 22 in Princeton, New Jersey, this coming year, 2023. And the topic is Art, the Sacred and the Common Good. If you haven't heard about that conference, we'd love to see you there in person. It will also be live streamed. So, Jonathan, welcome. Thank you for being here."}
{"episode_id":"SW - #277 - 2023-03-10 - Scala Foundation - The Mother Of God","start":186.99,"end":198.27,"speaker":"Jonathan Pageau","text":"Yeah, thanks for having me. It's great to see all these people. I put it in the mosaic mode or whatever, looking at everybody, actually a few faces, people that I know. So that's also wonderful. So it's nice to be here. Thanks."}
{"episode_id":"SW - #277 - 2023-03-10 - Scala Foundation - The Mother Of God","start":199,"end":319.21,"speaker":"Margarita Mooney Clayton","text":"Great. Yeah. So the title of our conversation today, right. I picked the image of Mary and the burning bush, the Exodus. But before I started in that, I wanted to just kind of say the reason I wanted to have you here is that I want to speak through Scala foundation to artists who are trying to live out this vision of art as contributing to community and memory and identity. One of my favorite writers on culture is a philosopher named Joseph Pieper. I don't know if you've ever read him, but in his book the Basis of Culture, I didn't realize it until I was preparing to speak to you that some of those essays. Sorry, some of the essays in Only the Lover Sings, Pardon me, were talks he gave at a sculptor's studio. So he was friends with artists. And one of the things he says is that art flowering from contemplation does not so much attempt to copy reality as rather to capture the archetypes of all that is such art does not want to depict what everybody sees, but to make visible what not everybody sees. So when I listen to you, Jonathan, talking about the meaning of the mystery of the story of the burning bush and how the burning bush is actually a Marian prototype, a lot of questions emerged into my mind. But I think one of the things that you said that I wanted you to say a little bit more about in your video is you said that reality comes to us veiled and needs to be unveiled. And in this process of unveiling, we have mediators. Can you tell us a little bit more what you mean that reality comes to us veiled and needs to be unveiled through. Through mediators? And is the art that you make supposed to. Is it actually claiming to help unveil reality for us?"}
{"episode_id":"SW - #277 - 2023-03-10 - Scala Foundation - The Mother Of God","start":321.93,"end":523.71,"speaker":"Jonathan Pageau","text":"So I would say, well, first of all, it's important to understand in some ways the mystery of unveiling or the mystery of revelation. But even the term revelation is very ambiguous because unveil, on the one hand, it seems to be showing you, but then it's actually veiling. So it's like the showing and veiling sounds like it's complicated. It's not that complicated. The way to understand it is that, let's say, unity or identity manifests itself by several characteristics. We often don't have access directly to the 1. We have access to the many. That's the body that represents itself. Like you, you see the different aspects of something, and those aspects, both veil and unveil, like they show you, they point towards identity. But at the same time, because they're a particularization of that one, they act as something like a veil. Now, this is, of course, represented in sacred space very clearly. If you look at the pattern of the tabernacle in Scripture, this is what's going on. So what you have at the outset is you have the very presence of God that. That manifests itself in the holy of holies, right? The very source of all reality which descends and connects with the earth. But it's as if that unity is too much. Like, it's just too much to handle. In some ways, it's almost like you couldn't even see it. It's too simple, maybe is a good way to understand it. And so then it has to be mediated. Think of it as a seed. For example, if I showed you a seed and I said, like, you know, this is a tree, and you're like, well, that's not a tree, right? That's just a point. It's just a dot. You can't see the implications. So the veiling will then. Will then add the implications of the revelation and the particularization of the revelation. So that's why you need veils in order to help you see something. Like, you need mediation. And of course, in the tabernacle, that appears as the actual veils in the temple, that you have different layers of veils that are thickening from a linen veil all the way to these shaggy garments of skin that are dyed red, you know, on the outside of the tabernacle. And that's kind of the way to understand how mediation function. But it's there in everything. A good. Another. An example is, for example, Moses goes up to the mountain. Moses goes up to meet God, and then God will set up mediation between him and the people. He'll set up, you know, leaders of a thousand, leaders of a hundred, leaders of ten, etc. So these are mediations to. To exemplify the aspect of what is revealed at the top of the mountain. The law itself is that the law is like God just says, I am. It's like, okay, I don't know what that means. Like, I don't know what that implies. And so then the I am becomes, you know, you will have no other God before me. You will make no idols. You will. You will. You will Cycle the time with meaning you will like. Then it's like, oh, so that's what I am means. And then it keeps filtering down into practices and laws and purification rituals and all these things. But it's ultimately all rooted in the I am. So those are the mediations that appear, you know, the problem of identity and mediation is the best way to understand it is that through these, let's say, specification of. Of the revelation."}
{"episode_id":"SW - #277 - 2023-03-10 - Scala Foundation - The Mother Of God","start":524.27,"end":600.68,"speaker":"Margarita Mooney Clayton","text":"I find this so exciting because, as I think, you know, my background is in sociology, and there's a long history of a study of ritual and art. But what I often found missing in sociology was the word that you began by mentioning, which was revelation. And I wonder, beyond the work that you do as an artist, what led you to found the symbolic world project? Like, who are you arguing with when you're saying that reality comes to us veiled, that there's an element of revelation? Because I hear who you're arguing with, right. And you're arguing with, on the one hand, a kind of really radical human, human empiricism, that all of reality is contained in the movement, like a billiard balls hitting each other, like that's all this kind of crass empiricism. And then on the other hand, I think maybe you're arguing also with people who think that the meaning of symbols is in relation to other symbols. Right. That symbol, this symbol signifies something, but there's no signifier behind any of those symbols. Right. So just what led you to found a whole project dedicating to helping people understand the meaning of symbols? And who's. Who's arguing with you?"}
{"episode_id":"SW - #277 - 2023-03-10 - Scala Foundation - The Mother Of God","start":600.76,"end":794.34,"speaker":"Jonathan Pageau","text":"Who's arguing with me? So I think that, you know, for those who haven't followed my work, this project is done very much in collaboration with my brother, Matthieu Pageau, who wrote a book called the Language of Creation. Just plugging that. It's an amazing book, by the way, And I think that it. In our 20s, you know, we grew up in a very. We grew up in a Protestant world, a kind of evangelical Christianity, which was very zealous and had a lot of energy to it, but was also quite materialistic in its suppositions. And so then when we came to university and came to higher learning, we kind of hit a wall and had to account for these crazy stories in scripture, you know, and then diving back into tradition, diving back into the church fathers, you know, into rabbinical thinking, into medieval thinking in general, iconography, we started to notice that in fact, you know, what these stories are, what these images are are just revealing us, the patterning of reality. So the problem with empiricists, and the problem even with, like, realist artists, is that they don't under. They seem to not realize that you always have to frame. You can't avoid the frame. So if you're an artist, you know that, right? It's like when you're looking at something, even if you're representing it with the most immediacy that you can, you still have to reduce it. You still have to frame it. You still have to contain it within a limit. And it's like. So that frame is something like attention. It's something like what's important. So, you know, contemporary artists try to play with that, try to break it as much as possible, right? They try to represent things which usually don't gather your attention or that are. That are broken and fragmentary, you know, ironic. There's all these ways of contemporary art trying to frame it, but it's still calling back to the problem of framing, to the problem of attention. So once you understand that, it's like, okay, well, then what makes us care about things? And you realize that there's an actual pattern to that. It's not arbitrary. And what makes what. What appears as the center of attention, what appears as distraction? You could say, so that's one way of framing it. But then you realize that it ends up being honestly just the pattern of everything. That there basically is a pattern of how reality, let's say, reveals itself to us, and that you can coherently see it and you can help people understand it so that they no longer think that religious rituals are arbitrary or that religious images and stories are just ridiculous, arbitrary stories, but rather they are patterning, ritual. For example. It's so important to understand that action is the same as perception. It's like you have to frame actions. You can't. You don't just act in the world. You act in a directed way. And the directed way in which you act implies an order of action. And so brushing your teeth is a ritual, right? It has to be a ritual. It has to be in order. So anything you do as a human that has purpose is ritualized. So once you understand that and you think like, well, then. Then I can explain religious rituals to you in a way that you should understand because, you know, everything you do is ritualized. You just cannot avoid the order of action that. That it implies to do anything with meaning."}
{"episode_id":"SW - #277 - 2023-03-10 - Scala Foundation - The Mother Of God","start":794.58,"end":875.79,"speaker":"Margarita Mooney Clayton","text":"Right. Well, now let me. You know. So what I hear you saying is that I actually didn't realize that you had Grown up in a kind of evangelical Protestant world with this kind of strong emphasis probably on, you know, the heart and devotion and knowing scripture, but then trying to then later on grapple with strange stories in the Bible, especially in the Old Testament, trying to grapple with the persistence of certain kinds of rituals or, you know, the meaning of the Eucharist and the really symbolic structure of the Christian faith. Right. And that Christian faith itself is not purely rationalistic or law based. There's a kind of attraction to a mystery as well that's there. But then if there's an attraction to the mystery, I've often wondered, how do I know that that mystery is real versus made up. Right. You said that really important for people to understand that religious rituals aren't arbitrary, that there are patterns of reality that are unveiled through those. And we can approach that mystery, maybe never fully, but we can approach it with trust that we're going to discover more about our own memory, our own identity, and not just a kind of arbitrarily assigned meaning of signs."}
{"episode_id":"SW - #277 - 2023-03-10 - Scala Foundation - The Mother Of God","start":876.68,"end":1033.52,"speaker":"Jonathan Pageau","text":"Good way. You're absolutely right. And I think that most people today can access that. It's not that hard. So for example, you can. I always try to go as low as possible. You don't like, it's hard to talk about the Eucharist in a materialist world because like, what, it's too far. It's like so high that it becomes. People can't see it. But if you talk about shaking hands with someone and you say shaking hands has a pattern, it has a reality to it, and it's not. There's variability. Like, it wouldn't have to necessarily be shaking hands, but it could be something like slapping each other in the face. Like slapping each other in the face could not be, let's say a ritual of communion, because it has a certain form, it has a certain way of acting on each other that is objectively true. I could also not turn my back to the person, like if I wanted to talk to someone and meet them. And I said, well, my ritual for that is turning my back to them. Well, it's like, no, that's a universally, universally unacceptable way of encountering someone. So there are actual parameters by which we engage with each other. These are not arbitrary. Doesn't mean that they're all the same. There's flexibility. And so if you can scale that up and you can realize that a family meal needs to have a certain structure, you can't have anything happen at the family meal. And I tell people, if you don't think that just try stepping up, standing up on the table, just once, see what happens. Right. It's like family meals have a ritualized dance that functions and so do feasts. And you know, anything we do together and it's like that scales up into a church and into a, into the Eucharist. And I, I mean, I could go through all the steps to show you how the Eucharist is in some ways the source or the highest version of eating together. But you can at least see that the, it's not arbitrary. Like these, these rituals that we engage with are, are based on the way our attention works, the way that, you know, our human interaction works. The way that we bind together as society is that you can't bind in a society around anything. You can, like, you can, but it will have effects. Like you can bind as a group around smoking crack. Like you can do that. And people do, like people do will bind in groups around smoking crack. But the, the fruits of that will be coherent with the purpose for which they're binding together. And it's like, so it's like the idea that we're binding together right in the Incarnation under the God of love, that's, there's, it's like, it's not arbitrary why we're doing that. These are coherent images and rituals we participate in."}
{"episode_id":"SW - #277 - 2023-03-10 - Scala Foundation - The Mother Of God","start":1033.92,"end":1183.91,"speaker":"Margarita Mooney Clayton","text":"All right, that was fantastic. Listen, you know, to build on that. I think you're right. Sometimes the modern world, talking about the Eucharist of people who've not encountered it sounds like really woo, woo, what doing there? Well, one way that I've. One other topic that I have struggled to talk about in the modern world is Mary, the Mother of God, the Blessed Virgin Mary. I was, I was raised Catholic. My mother is here on this call. I went to Catholic school. We had devotion to the rosary in the home. I never really thought much about this May processions and those kinds of things, but I also really didn't know how to accept, explain Mary in faith or Mary and art. And you know, fast forward many years and I've now encountered popular devotions to Mary in Haiti, which was what my first book was about in, you know, Fatima, Portugal, these pilgrimage sites. And there was something about this enduring popular devotion to Mary that's super interesting. And then I get to Princeton Theological Seminary and it turns out that, you know, I was actually really afraid when I taught Robert Orsi's book the Madonna of 115th street, which is about popular devotion to Mary amongst Italian Americans. I was afraid that my Protestant students were going to be like, this is all really out of touch with modern world, and it's not true Christianity. It was actually more like, can you. Can you tell me more about Mary? Can you? And so I ended up teaching an entire course on the Virgin Mary here at Princeton Theological Seminary. I'm teaching it again starting tomorrow. Some of my students in that class are here with us today. And one kind of hook that maybe will make all of this stuff we're talking about. Identity, memory, community. You know, why is the Virgin Mary and the symbolism around the Virgin Mary so powerful in Revelation? And so for me, one aha moment listening to you, and then I went back and studied this a little bit in Aidan Hart's book on the festival icons and. And in one of the books I teach in my class, which is on the development of Marian doctrine and all of these names for Mary. So one of the recurring images of Marian art is Mary and the burning bush, right? The burning bush is a story, I believe. Well, you know, why don't you tell us, like, what is the story of the burning bush? And how is this Old Testament story of God and the burning bush related to Mary, the mother of God?"}
{"episode_id":"SW - #277 - 2023-03-10 - Scala Foundation - The Mother Of God","start":1184.33,"end":1502.22,"speaker":"Jonathan Pageau","text":"So the story of the burning bush is that Moses, when he left Egypt, the first time he kills an Egyptian and has to flee into. Into the. The wilderness. You know, he becomes a shepherd. And then on the mountain of God, as he sees on the. On the mountain of God, he notices this. This burning bush. And so what it is, it's a. It's a thorn bush that is burning, but it's not being consumed. And so Moses approaches the bush, and then he hears a voice which tells him to remove his sandals. And for this place is a holy ground. This ground is a holy ground. And so he removes his sandal and approaches the burning bush. And it is in the burning bush or through the burning bush that he receives the name of God. And it is in the. In the Bible, it is the first time that God reveals his name to the people. And so, you know, the God of Abraham, Abraham knew of God and had different appellations for God, different names for God. But here God reveals his name as the one who is right, as the I am. And so why is it a burning bush? And why is it not being consumed? So there's a. There's a problem in the problem of mediation, which is that there's a sense, you see that in scripture, right? The idea that God would consume the world. Like if God was in the world, he would consume it because the infinite cannot fit in the finite, it's just pretty simple equation. You try to fit the infinite in the finite, you blow it apart, right? You just explode it. And so if you try to, like. And it's not. How can I say this? If you try to fit the essence of basketball in just dribbling, just dribbling, can't hold the essence of basketball. You need all these other things to mediate basketball. And you can't fit the identity of something in one of its elements. It's not a. It's not like a magical thing. It's just like. That's how reality works. You can't. You just can't do it, right? And so. And so the problem, so much of the problem of the Bible is then how do we encounter God? How does God mediate into the world if the origin of reality can't fit in reality? So you have this problem, which is that you need mediations. Those mediations kind of show you God, but they're also distance from God. So how do we deal with this? And so what happens in the burning bush is this mysterious moment, because it's a thorn bush. It is multiplicity itself, right? That's what the thorn bush is. It's like a bunch of spikes. It's all these multiple, multiple spikes. And it's actually in. In Scripture, the thorn bush is the consequence of the fall. So when Adam falls, God says the earth will produce thorns. And so it's like you fell from unity. And now you will be lost in multiplicity, right? You'll be lost in this, in all these spiky, spiky points. Let's say instead of one point, you've got spiky points. And so now this mystery of God appearing in the multiplicity, right, in creation itself and not consuming it. So what is going on? Like, how is this possible? And there is this, like, this call for a mystery of how the world can contain the presence of God. And it's not totally answered, right in the burning bush. Like, why is this, how is this possible? What is happening? You know? But there is this kind of call to mystery. And so the sense of why then the burning bush represents the virgin is to understand the question of space and the question of place for the revelation. So every time you'll see a revelation in Scripture, every time there'll be the revelation and there'll be the container or the space in which the revelation manifests itself. And that space is important, and it's mysterious because of the problem of God blowing up reality. Because the problem of that which is above not being able to fit in that which is below. And so what happens is this image of the burning bush becomes, you know, one of the. One of the early images of what it means the possibility of God being in the world without consuming it, that in some ways, God has made the world in a way that he can manifest himself in creation without consuming it. And that is represented as, you know, there are different ways to represent it. It's purity. It's something like, you know, if you have this first image in the Bible as, you know, the Spirit of God and the waters below. So it can be like the waters or this idea of purity or this idea of, you know, something that is reflective. Sometimes you have this image of, like, the God is under his feet. There's a. There's a sea of glass or a sea of. Of precious stones that reflects his glory back up. So there's all these images, and it's like, that's what Mary will ultimately become as the container, as the ark of the covenant, as, you know, the tabernacle, as the burning bush, as the mountain, as the ladder. And it's like all these images that we use about Mary is to talk about the way in which the world ultimately, mysteriously is capable. God has made it in a way that is capable to become a vehicle for his presence."}
{"episode_id":"SW - #277 - 2023-03-10 - Scala Foundation - The Mother Of God","start":1502.94,"end":1535.98,"speaker":"Margarita Mooney Clayton","text":"All right, so the idea, if I understood you correctly, idea that to the extent there is something that's infinite, it would make sense that the infinite can't fit into the finite, right? So we need some kind of mediation in order to see the. To perceive, to encounter in some way the infinite. And so the burning bush, something in nature that's burned but not consumed, is kind of pointing to this infinity. And then Mary, now walk us through this a little bit more. Mary as the burning bush. Why?"}
{"episode_id":"SW - #277 - 2023-03-10 - Scala Foundation - The Mother Of God","start":1536.46,"end":1615.82,"speaker":"Jonathan Pageau","text":"She's the bush. She's. She's the space. So Mary is always the space of revelation. So she's not the revelation herself. It's really important, by the way, to make the distinction. It's like, that's why in orthodox theology, we will always represent the mother of God with the child, right? So it's like the space and the glory. So she's the ark of the covenant. And the glory of God descends on. On the ark. So in. In any revelation, there are those two aspects. You could say something like the masculine and feminine aspects of the Revelation 1, which is that which comes from heaven and then that which receives it or manifests it below. And so Mary is that she's the throne. That's why she's represented as the. The throne of wisdom. So these early images of Mary represent her has as a throne with Christ sitting on her and with his head over her heart. And you see that in the images of the panagia where she's, you know, in the. The Orthodox churches, for example, she has her arms out like this, and then in her center, she'll have the divine logo shining through her, right? Appearing out of her. And so that's. That's in that image. He's an image of the burning bush as well, right? It's like. So you imagine the burning bush and then the glory of God, you know, let's say, revealing itself through that space, through that divine. That holy space."}
{"episode_id":"SW - #277 - 2023-03-10 - Scala Foundation - The Mother Of God","start":1617.1,"end":1631.46,"speaker":"Margarita Mooney Clayton","text":"Well, since you mentioned also the virgin kind of with her. With her arms open, you know, what are some other. I mean, the burning bush is one. What are some other prototypes of Marian art, by which I mean some kind of recurring images of Mary in Christian art."}
{"episode_id":"SW - #277 - 2023-03-10 - Scala Foundation - The Mother Of God","start":1632.26,"end":1682.66,"speaker":"Jonathan Pageau","text":"The first images that we know of Mary is an image called the hodgitria, which is the image of the mother holding Christ on her and showing us Christ with her right hand. And so usually you'll see it's actually one of the most famous images. And so she. She. She holds Christ and she. She's showing us. And sometimes she's. She's usually bowing her head slightly, you know, and so it's like it's the one who's showing the way. And you can understand that, right? You can understand it as Mary herself, but then also at the possibility of outward signs or of holy places or of prayers or whatever it is that's external, pointing inwards, like, pointing towards the revelation. And so she becomes in way. In a way, an image of the church itself, which. Which is pointing to Christ."}
{"episode_id":"SW - #277 - 2023-03-10 - Scala Foundation - The Mother Of God","start":1682.66,"end":1682.98,"speaker":"Margarita Mooney Clayton","text":"Right?"}
{"episode_id":"SW - #277 - 2023-03-10 - Scala Foundation - The Mother Of God","start":1682.98,"end":1725.17,"speaker":"Jonathan Pageau","text":"It's like that's the whole point of. Of why we're Christians, where we're pointing to Christ. We're little. We're like specifications of the revelation in our own lives. We're supposed to embody some aspect of Christ. And so you can understand that, like I said, as her, of course, directly doing that. But then ultimately, I mean, she's the one who says, at the winning of Kana, listen to what my son says. That's her role. She points people towards her son. And so. And so, like I said, it is also in some ways an image, the proper relationship of understanding the outward with the inner, like the. The outward aspect of anything and the inner aspect of anything, you know, okay, so the."}
{"episode_id":"SW - #277 - 2023-03-10 - Scala Foundation - The Mother Of God","start":1725.17,"end":1807.44,"speaker":"Margarita Mooney Clayton","text":"The inward and the outward aspect of anything. You know, Jonathan, when I started to do the research to teach this class on the Virgin Mary, well, first of all I discovered going to the Princeton Theological seminary, there are 2,000 years of books about Mary, so there's a lot of Mariology. And then I went over to the index of Christian art or the index of Medieval art here at Princeton University and discovered similarly, there's really 2,000 years of art about Mary. And you know what struck me going into the index, that there's not that much art about other women in the Bible, although other women appear in the Bible. I'm not saying there isn't any, but there's not that much. So this leads me to my other question. Just do you have any idea, I mean, when we talk about the Virgin Mary, you know that. Well, that's the word I was always taught to call her, you know, the Virgin Mary, right? Purity, virginity, these are not really culturally, you know, popular words right now one might say. But my question is, what explains the enduring devotion to Mary, the mother of God, above and beyond other women in the Bible? Like why, why is there 2000 years of art about why does Mary appear in all of these different countries speaking to people in their own tongues? What is the enduring presence of Mary across culture? What does that tell us?"}
{"episode_id":"SW - #277 - 2023-03-10 - Scala Foundation - The Mother Of God","start":1807.92,"end":1900.05,"speaker":"Jonathan Pageau","text":"How can I say this? She is the embodiment. Like she's the source of body is the. I don't know how else to say it. And so because of that, she's the one who gave body to Christ. Maybe that's the best way to think of that, if you understand. It's like Christ's body doesn't come from anywhere else besides her. Like that's out of which his body comes. And so she becomes a stand in for the church for all of us. She's a stand in for all of us. That is, she is that which gathers us. She's the one who gathers us in. Worship towards Christ is a good way to understand it. Right? And so because of that, that's why also she can appear in, in, let's say she will appear in visions as well, because she is that. So a good example is of course, I don't know if you know that she often appears in images of protections. For example, famous orthodox images, the veil of protection. So there's this in Constantinople, someone had a vision of her, you know, above the church and hold putting her veil as a protection around the church. And so there are versions of that in Catholic art where you've seen, you've probably seen These images where you see the mother of God standing up and then she has her cloak open and then in her cloak is like standing all the people, right? They're all gathered together in her. And so that's a good way to understand it. It's like she is that she's the gathering of the body and so she, she stands in for the church itself."}
{"episode_id":"SW - #277 - 2023-03-10 - Scala Foundation - The Mother Of God","start":1900.61,"end":1945.2,"speaker":"Margarita Mooney Clayton","text":"Well, so you know, one of the things that I learned in teaching this class on Mary is similar to what you said. There are lots of people and proph men and women who have important roles in the Bible. But maybe part of what I heard you say, what explains the enduring significance of Mary and popular devotion and art is that the church, the body of Christ, has to continuously be recreated across space and time and culture. And to the extent what I heard you say is that because Mary gave body to Christ, she also gathers the church together in worship. Right? She's there at Pentecost, she's there at the birth of the church. Right. And so the church has to be continuously recreated through a connection to this feminine presence. Is that correct?"}
{"episode_id":"SW - #277 - 2023-03-10 - Scala Foundation - The Mother Of God","start":1945.2,"end":2021.9,"speaker":"Jonathan Pageau","text":"No, that's a good way to understand it. And it's important to understand that in some ways she is very much a mystery of the church. And we should be careful. Like, I mean, it's okay to talk about her, but we have to be very cautious in talking about her because she is something which belongs to the church. In some ways she's interfacing, she's inward facing because she is that which gathers the church together. And so the mystery of the holy place and the mystery of sacred space is something which is very intimate and is very, and is very, let's say, almost secretive. And that's important to understand because if we don't understand that, you know, because she's hidden in the New Testament, you know, in some ways you actually have to have certain keys in order to understand her importance in the New Testament. You have to have some intuition about, you know, some inkling about the role of the church and what's being set up in the New Testament to see her importance in the New Testament. But at first glance, you know, she's not that present in the New Testament. But I do think she's, she's definitely every, everything said about her in the New Testament hides a thousand mysteries. But you have to, you have to have, you know, the intuition and the gathering in the church to be able to, to see those mysteries and to pierce them."}
{"episode_id":"SW - #277 - 2023-03-10 - Scala Foundation - The Mother Of God","start":2023.1,"end":2047.98,"speaker":"Margarita Mooney Clayton","text":"Right. So I guess another question, I don't know if you've Talked about this in other spaces. But one of the things that often comes up in my class is that the presence of a feminine authority in the church. Right. One of the things about today is that people don't really want to talk about roles associated with masculinity or femininity or male or female. Right. You're smiling here."}
{"episode_id":"SW - #277 - 2023-03-10 - Scala Foundation - The Mother Of God","start":2048.06,"end":2051.92,"speaker":"Jonathan Pageau","text":"So, I mean, I don't have a problem talking about it. It's fine."}
{"episode_id":"SW - #277 - 2023-03-10 - Scala Foundation - The Mother Of God","start":2051.92,"end":2053.4,"speaker":"Margarita Mooney Clayton","text":"Well, then let's talk about it."}
{"episode_id":"SW - #277 - 2023-03-10 - Scala Foundation - The Mother Of God","start":2053.4,"end":2053.84,"speaker":"Jonathan Pageau","text":"Okay."}
{"episode_id":"SW - #277 - 2023-03-10 - Scala Foundation - The Mother Of God","start":2053.84,"end":2097.86,"speaker":"Margarita Mooney Clayton","text":"What is it about? You know, so in the book that my students love, Robert orsi's Madonna of 115th street, people do really relate to the Italian American grandmother as a kind of moral authority of the family that's distinct from the public authority of the man. But what the students find so interesting is that when it comes down to it, the most important questions are the moral questions. And the woman has this kind of reverence amongst the rest of the family. Like decisions about the family and marriage have to go through the Italian grandmother. Right. Maybe I sound like I'm stereotyping masculine and feminine, male and female. But what are your thoughts? Like, what is the femininity of Mary, and how does that relate to femininity and culture? Or should it?"}
{"episode_id":"SW - #277 - 2023-03-10 - Scala Foundation - The Mother Of God","start":2098.74,"end":2279.3,"speaker":"Jonathan Pageau","text":"No, I think that, say, the role and the power of the feminine is represented very much so, in the story of Mary in ways that sometimes people fail to see. The Wedding of Kana is probably one of the best examples, if you want to kind of understand the power of the feminine. It's. It's one of those things where, I guess, in some ways, we have to talk about it now because the world is so. The world is kind of off tilter, off kilter a little bit. So we kind of have to talk about it. But it's the type of things which probably should be left implicit. But anyways, so in the Wedding of Kana, there's an interesting moment, you know, because there's this problem, and the Virgin comes up to Christ, and she says to Christ, she says, there's no wine. And what's Christ's answer? It's the craziest answer, Right. He says, my time is not yet come. Like, what? So she's saying, there's no wine, and he's saying, I am not ready to die yet. It seems like there's a problem of communication, but there's not a problem of communication. It's like she is open. She is showing him the door towards revelation. She is framing his coming public, and she's giving him the space in which to make his first miracle. And so she is. She's acting as a mother right there. She's saying, it's now, here's the moment, here's the place. This is the question. And now Christ has to answer the question. And so if you want to understand the relationship between a question and an answer, you know which one has more power. It's like, think of. Think of the question frames the answer. The question provides the space, provides the direction for the answer to come, right? That's why we pray. That's why we think. And so there's a deep, deep, mysterious power in the capacity to ask a question. And if we didn't think that, we wouldn't. We wouldn't pray, right? And so I can't. I won't explain it to you, but there's a very, very deep revelation of the role of the feminine and the role that that framing and a question can. Can play in revelation. I don't know if you probably have all seen My Big Fat Greek Wedding, but there's a very, very wise thing that said in that movie. You know, there's a scene where the mother is talking to her daughter, and she says to her daughter, she says, you know, the man is the head of the household, but the woman is the neck, and she can make the head look in any direction she wants. And it's like, that's what Mary is doing at the wedding of Kana. She's doing exactly that. She's saying, here, look at this problem. What are you going to say now? And if you think of the relationship between men and women, you'll notice that it actually seeps into so many aspects of. It's like the question of, like, would men do anything if there weren't women?"}
{"episode_id":"SW - #277 - 2023-03-10 - Scala Foundation - The Mother Of God","start":2280.18,"end":2325.67,"speaker":"Margarita Mooney Clayton","text":"Well, so I love that scene from My Big Fat Greek Whiting. It gives everyone, I think, an image who's seen it to think on. But I think part of what linking back this question to what you said earlier, that reality comes to us veiled and it needs to be unveiled, that the masculine and the feminine, in complementing each other, kind of point to this unity, but also a mystery, right? That there's. We cannot equate masculine and feminine being exactly the same without eradicating the mystery of who we are, right? So this. This difference between masculine and feminine, or masculine and feminine authority, or forms of influence reveals that at the end, humans aren't in charge. We are responsible to God. That this. This difference points to the mystery is what."}
{"episode_id":"SW - #277 - 2023-03-10 - Scala Foundation - The Mother Of God","start":2325.67,"end":2400.47,"speaker":"Jonathan Pageau","text":"Yeah, but mystery. So it's like we have a. It's important to understand what a mystery is in terms of. Because we have these words that we use in religious discourse. It's like a mystery is a puzzle. That's what a mystery is. A mystery is a question. And that's why I'm trying to help you understand that the feminine is. Appears as a question. That's, It's. That's its role, and that's what it does. It's like here, the space. Like if you. How can I say this? Like, if you build it, they will come, right? This idea that if you create the frame, if you have the frame and the question and the mystery, then the revelation appears on the mystery. And this is something that, you know, like in the very architecture of the tabernacle, that's what you have. The glory of God descends on. What descends on these cherubs. These cherubs are like. Are like sphinxes. They. They have mixture of different animal parts or whatever. It's that. It's the. It's the question which frames the answer. And so it's important to understand, like, I would say, like, when you talk about unveiling, I would definitely be careful. And I would say that the Virgin is. That is the one whose veil can never be removed. Like, you cannot remove her veil. Her veil is the kind of like the eternal veil. I don't know what else to say."}
{"episode_id":"SW - #277 - 2023-03-10 - Scala Foundation - The Mother Of God","start":2400.47,"end":2400.83,"speaker":"Margarita Mooney Clayton","text":"She."}
{"episode_id":"SW - #277 - 2023-03-10 - Scala Foundation - The Mother Of God","start":2400.83,"end":2472.31,"speaker":"Jonathan Pageau","text":"She represents like, the very deep, deep mystery of revelation. And it's shown in her story, like more apocryphal aspects of her story. In the story of the. In the. The. The Pro Evangelium, you have this. This story of when the Mother of God gives birth to Christ. She has these two. These two women helping her, one whose name is Salome. And Salome can't believe the virgin birth, right? And so in the text, if you read it, she checks. She tries to check if she's a virgin. And her hand burns off like your hand. It's very dramatic as an image, but there's a sense in which. In which she cannot even see if the veil is there. Like, it's like the veil. She heard. The veil of the Virgin is not something to be trifled with. Like, it'll. And so, so anyways, it's hard because I'm taught. Using very kind of cryptic language. I don't want to. I tried to make things as. When I explain things, I try to make them as simple and as accessible as possible. But. But talking about Mary is difficult because she. She has very deep mysteries assigned to."}
{"episode_id":"SW - #277 - 2023-03-10 - Scala Foundation - The Mother Of God","start":2472.31,"end":2488.06,"speaker":"Margarita Mooney Clayton","text":"Her, let's say, well, Look, I agree with you. Talking about Mary is difficult. Having taught a class on it and doing it again, it's. And looking in the library of the books and the images. But would you recommend. Are there any books that you recommend? Are there any images that you think."}
{"episode_id":"SW - #277 - 2023-03-10 - Scala Foundation - The Mother Of God","start":2488.06,"end":2488.42,"speaker":"Jonathan Pageau","text":"Because, Right."}
{"episode_id":"SW - #277 - 2023-03-10 - Scala Foundation - The Mother Of God","start":2488.42,"end":2501.74,"speaker":"Margarita Mooney Clayton","text":"I mean, you make images and images often express things in a way that it's difficult to capture in words. Do you have a couple of prototypes of Marian art that you think are really important to have in the house or to pray with or to meditate. Pray on?"}
{"episode_id":"SW - #277 - 2023-03-10 - Scala Foundation - The Mother Of God","start":2502.22,"end":2568.35,"speaker":"Jonathan Pageau","text":"I mean, I think the image of the Panagia, you know, this image that we talked about, the image of the Mother of God who has her hands out and she's forming something like a cup. She. She's a container, right, for that which comes above. And then you have Christ appearing in her heart, or let's say, manifesting himself in her heart. I think it's, it's one of the deepest images that, that, that Christians have. Because in some ways, you know, like I said, in some ways, Mary is a stand in for us. You know, it's like it's the hope that we have, right? The hope that we have, that we can have Christ descend into our heart, that Christ can become the center of who we are. You know, and of course, liturgically, that is true. It's true through the sacraments, is through, through the Eucharist. But, you know, we know that we have always have more that we could access, that we could have more of that, and that we could become even more transparent to the glory of God. And, and she was perfectly transparent. And I think to me, that image is really one of the most powerful images that we have."}
{"episode_id":"SW - #277 - 2023-03-10 - Scala Foundation - The Mother Of God","start":2568.51,"end":2634.95,"speaker":"Margarita Mooney Clayton","text":"I agree with you, Jonathan. It's hard to put these things in words because it feels like you're reducing this great complex mystery to, you know, it goes beyond words. But yet words and images, as you say, try to help us approach that mystery. But I'll be honest, no other class that I've taught is quite like the Virgin teaching about the Virgin Mary. And I've more explicitly this time around, included an aspect of. Okay, how does reading this theology and looking at these images, how does this impact your devotion to the Mother of God? Because at the end, these ideas and the images are supposed to help us on our personal journey, which is a journey that we share with other people. But I don't want to over intellectualize it or overturn it into the cultural study of art. So in terms of the proto evangelium, since you brought that up And a lot of the images from Marian art come from that. I know one person wanted to ask, and I've seen this in many churches as well, the significance of, what is the significance of Mary with the, with the yarn, with sort of sewing?"}
{"episode_id":"SW - #277 - 2023-03-10 - Scala Foundation - The Mother Of God","start":2635.19,"end":2638.59,"speaker":"Jonathan Pageau","text":"Yeah, well, that's, yeah, it's suggestion that."}
{"episode_id":"SW - #277 - 2023-03-10 - Scala Foundation - The Mother Of God","start":2638.59,"end":2640.47,"speaker":"Margarita Mooney Clayton","text":"She weaves the temple veil herself."}
{"episode_id":"SW - #277 - 2023-03-10 - Scala Foundation - The Mother Of God","start":2640.55,"end":2667.56,"speaker":"Jonathan Pageau","text":"Yeah, exactly. And so that's, exactly, it's, it really is to connect her with the notion of the, of the veil, of that mystery, of the mystery and the revelation. And so that's what, that's what she, that's why she's shown as, let's say, weaving the, the temple veil. So when you see her with a piece of yarn, that's what it's, it's signifying that she is, that she is mending the temple veil. And that's what she, she, that's what she is in some ways."}
{"episode_id":"SW - #277 - 2023-03-10 - Scala Foundation - The Mother Of God","start":2667.8,"end":2671.16,"speaker":"Margarita Mooney Clayton","text":"Can you say a little bit more she is the temple veil or she's men."}
{"episode_id":"SW - #277 - 2023-03-10 - Scala Foundation - The Mother Of God","start":2671.48,"end":2800.68,"speaker":"Jonathan Pageau","text":"She. Yeah, that's. So how can I say this? It's like it's, it's a fractal thing. So it's hard to, it's hard, it's hard to explain. But so she is the mystery in which or out of which the revelation comes. And so that mystery has different aspects to it, right? It can be the, let's say the ark of the covenant, right? That's this box. And the glory of God descends on the box, you know, and so her womb plays that role directly. It's very direct. But then there's also. Every level has these two aspects together, right? Every level of revelation has in some ways a veil and an unveiling or a veil and the manner in which the veil also reveals that which is behind it. And she always plays the role of the mystery at every, at every level. And so she's the veils of the temple. She's the, you know, she's the untouched mountain. You have this, this type of, or the uncut mountain, for example, the space out of which things happen. And so it happens at many levels. And that's why she's also veiled herself. It's important to understand. That's why, like, for example, if you look at an image of the deices, which is the basic image of Christian iconography, you have Christ in the center as representing the king, you know, the Son of man, all of that type of imagery. And then to his right there's the Virgin who is veiled. And then to his left there's St. John the Baptist, who is wild Crazy hair, you know, wearing garments of skin and, and you can almost understand that she, it's like she represents that. The veil, let's say, or the hidden, the secret, all of that type of stuff. And he represents like the guy out in the desert screaming like, repent, repent. You know, he, there's Nothing secret about St. John the Baptist. And, and he has a kind of directness and he's willing, he's talking about cutting the tree down, like repent or you're going to get thrown into the fire like that kind of language. But Mary, she's. She has this, she has the secretive aspect to herself, the mystery, mysterious aspect of it, let's say."}
{"episode_id":"SW - #277 - 2023-03-10 - Scala Foundation - The Mother Of God","start":2801,"end":2846.25,"speaker":"Margarita Mooney Clayton","text":"You know, we've got about 10 minutes left and I hope to get back to some of the questions about symbolic meaning and Mary, if we have time, but a number of people on the call today are artists, right? And so some, if we could get some questions about your vocation as an artist or your, how you understand your, your work as an artist. So for example, one person wants to know like, well, how is it that an artist in a way unveils or acts as a mediator? Is it appropriate for an artist to think that that's what they're doing? I mean, are there aspects of artistic style that emerge through partial abstraction like, or deviation from strict national appear natural appearances as through the content of an image?"}
{"episode_id":"SW - #277 - 2023-03-10 - Scala Foundation - The Mother Of God","start":2846.41,"end":3026.09,"speaker":"Jonathan Pageau","text":"Yeah, well, the first thing to get out of your mind is the idea that you can represent what's out there. You can't. No one can. That's a joke. Like anybody who thinks they're being naturalistic is just, it's ridiculous. You're not being naturalistic. Even by the simple fact of framing anything, you are contracting it, reducing it. There's no way. And you're pointing attention towards it. So now levels of abstraction can have a role in directing attention is the best way to understand it. So if you look at something that is highly abstract, not in the modern sense, but let's say in terms of representing a cross as an ornament or representing an ornamental or highly typified image of an anchor, like the old ancient Christians would be, these are abstracted in the sense that they are pointing your attention more. Like the more you abstract something, the more you're capable of pointing attention. And it's different from the type modern abstraction. I'm almost on purpose doing this to you, which is that the level, that which you show in an image should be related to what it's doing and what it should be related to what it is you want to do in terms of attention and in terms of participation. Levels of abstraction have always existed in art. This is not a modern phenomena. They've existed from time immemorial, and they still exist today. But the difficulty with contemporary art and modern art is that they don't necessarily ask themselves what function is this image playing in order for me to engage in this level of abstraction. And like I said, you know, abstract art or geometric art, for example, is abstract, but it all. It has a function. So I would say that the artist is. I say what's important, what's interesting about the artist is I think the artist can become more than others, aware of mediation and veiling. You can't avoid it. But you. When you're making something, you become. So you can become very aware that you are acting as a mediator between things, that you are contracting, that you're gathering aspects of reality together, right? You're taking color paint, you're taking wood or stone, and you're bringing it together in order to gather people's attention towards it. It's like that's something that we should be very careful about. And it's a. It's. In some ways it's a right. It's almost a magical position that we're in. And so we have to be. We have to be very careful because it's very powerful. Most people aren't aware of the things that I'm talking about. Most people aren't aware that reality has to be framed, that things have to be brought together in order for you to notice them. Artists just inevitably become aware of it because they're doing it all the time. You're constantly framing things and constantly mediating them and contracting them and deciding what to leave in what to leave out. All of this type of work that you're doing is the experience of mediation itself."}
{"episode_id":"SW - #277 - 2023-03-10 - Scala Foundation - The Mother Of God","start":3026.89,"end":3073.13,"speaker":"Margarita Mooney Clayton","text":"So it's impossible to be purely naturalistic, mediating. And you have to be extremely careful about it, because as an artist, what I hear you saying is that the very act of making art is an act of mediation of reality. And that can impact people based on. Based on what you create. So to approach this with a sense of real responsibility. And another question some of the artists have asked is, how do aspiring artists who want to do work in the kind of vein that you do? Where do you find community? How do you find the human relationships, the formation to persevere in this kind of career? For someone who feels this calling to be the kind of person you're talking about, how did you do it?"}
{"episode_id":"SW - #277 - 2023-03-10 - Scala Foundation - The Mother Of God","start":3073.45,"end":3196.17,"speaker":"Jonathan Pageau","text":"I mean, we're, we're in a strange situation. You know, it's like I, I see a few people in here. I saw David is here, David Clayton. You know, we're in this. We were in a strange situation. We kind of came out of contemporary art and in some ways we were in a highly irregular world. And so, you know, it's like the idea of becoming an iconographer was so difficult and so strange that, that we almost had to jump start something which was almost dead. Maybe that's the best way to explain it. Like Aiden Hart is a good example of that too. It's like came in a world where these practices had been almost forgotten and had been cast aside. And so us, and maybe a few people that came just before us, in some ways we're, we're restarting something that, that was lost. So I think that we're in a better position right now. I think there's. At least now you have people that you can recognize as, as masters that can at least show the way, you know, that you can learn from, either take seminars with or that you can at least look at the writings they've done. Like, Aidan has written a wonderful book. Like his book on icon painting is a masterful book to help anybody along that, that path. But I would say that ultimately it's important to also be connected to, to the Church. And you don't. If you want to make sacred art, there's. You shouldn't just be on your own making sacred art like you really should be. You should be sacramentally connected to, to the Church. You should be involved and you should be doing it to some extent with the blessing of your spiritual authority. You know, that's a little tricky, at least, at least when you start, you know, I think it's fine to take classes without the blessing of your priests. Some priests might disagree with me, but if you want to start doing it professionally or doing it publicly, then you need to kind of insert yourself into that, that family and participate in that family because you also need checks and balances. Like you need people to be able to, to tell you that. Know that image. No, like, it's just that you were not, it's not acceptable."}
{"episode_id":"SW - #277 - 2023-03-10 - Scala Foundation - The Mother Of God","start":3197.05,"end":3294.2,"speaker":"Margarita Mooney Clayton","text":"So, yeah, you know, we were speaking last night, David Clayton, who's my husband, he and I were speaking last night to Peter Carter, who'll also be at the Scala conference in April. He'll be leading the music, the liturgical music, the praying of the Liturgy of the Hours. And he started a group called the Catholic Sacred Music project. And he was also saying, hey, look, things are a lot better than they used to be. And I said, you know, if we're going to compare now to the 70s, yeah, it is better. Right? So. But I think your point is well taken. I think people like you, people like David Clayton, Peter Carter, Aidan Hart, all of us will be together at the scholar conference, represent that there. There is a rebirth of interest in liturgical art, sacred art, sacred music. And Scala hopes to be able to provide some of the connections amongst people who are doing this kind of work. That's why we host these online events, that's why we publish the books, we have, we have blogs, we're trying to share the wonderful work that you're doing. Jonathan, I wanted to introduce people to you. I encourage people to just listen to your videos, subscribe to your. To your YouTube channel, read your blogs. It is maybe not, you know, yet spreading wildly, but there are a lot more artists doing this kind of work than when you and David and Aiden started. There's more ways to get trained. But your point about staying connected to the church and staying connected to prayer is just such good life advice for anybody who feels that they have a vocation from God. It doesn't mean it's going to be easy. And staying connected to the sacraments and to the church and to a community of faith, but also artists like yourself."}
{"episode_id":"SW - #277 - 2023-03-10 - Scala Foundation - The Mother Of God","start":3294.44,"end":3359.51,"speaker":"Jonathan Pageau","text":"I just want to say one last thing, just to maybe wrap up, like the connection to the Mother of God also is that, you know, there's a reason why often the first icon that was made, the tradition that the first icon that was made was an image of the Mother of God painted by St. Luke. And you know, these are of course, deeply kind of traditional, legendary stories, but they. The fact that this is. That's the structure of the story is important to help us understand the role of the Mother God in liturgical art. Because in some ways we are exteriorizing something hidden or something secret. We are giving body to the tradition of the church when we are making images, when we're building churches, all these things, we're giving body to the church and to the tradition of the church. And so that's why there is a deep relationship between the artist and the making of these things and the participation and embodiment that with Mary herself. And so I think it's not at all arbitrary that she was the first one represented in an icon."}
{"episode_id":"SW - #277 - 2023-03-10 - Scala Foundation - The Mother Of God","start":3360.15,"end":3380.84,"speaker":"Margarita Mooney Clayton","text":"Wow, I hadn't thought about that. So you're saying that to connect, kind of. To wind down this talk when you're Talking about your vocation as an artist and the sort of the calling to mediate reality, to represent to people, to do that in a way where you're connecting also your own spiritual walk to the Mother of God. Is that what I was hearing?"}
{"episode_id":"SW - #277 - 2023-03-10 - Scala Foundation - The Mother Of God","start":3381.48,"end":3437.14,"speaker":"Jonathan Pageau","text":"Well, that she in some ways is an image of the art, of the art itself. Like she's an image of the, the practice of this gathering of things together. Like when you're, when you're taking, you're gathering elements together and you're bringing. There's a beautiful image of one of the most, I think powerful, the most powerful secrets in scripture is when Mary, she sees the wise men come to, to, to see her and you know, she has all these experiences and it says, she says Mary gathered all these things in her heart and it's like that's it, like that's what she does. She gathers these elements, she gathers stories, she gathers elements of the world together to give body. And that's what we do as artists, right? We gather, we gather color and, and stuff together into bodies. So, so that's why I think that, that she's so important for the, she was so important in the, the stories about how sacred art was born in the church."}
{"episode_id":"SW - #277 - 2023-03-10 - Scala Foundation - The Mother Of God","start":3437.94,"end":3544.52,"speaker":"Margarita Mooney Clayton","text":"That's fantastic. I didn't know that, Jonathan. I had not made that connection. I will bring that up with my students. Thank you to all of you who have pasted these wonderful links in the chat button. This was a very active chat. I'm really sorry that we can't get into everybody's questions because we're out of time. But I will invite you once again to the Scala conference April 21 and 22 in New Jersey. Register to come in person or if you can't come in person, please do register online. Jonathan's talk is going to be on memory and the role of art and identity. And then he'll have a follow up conversation with David Clayton and also with Paul Coryer of the Common Sense Society. Aidan Hart will also be speaking and he's going to be focusing his talk on the role of art in upholding human dignity and showing the face of the person as created in the image of God and why that matters so much for, for the modern world. We'll also have Peter Carter, as I mentioned. We'll also have Anna Bond who's a graphic designer and the co founder with her husband of Rifle Paper Co. Which some of you might have seen some of their stationary. So she's going to talk about the vision behind her, her brand in art. So thank you Jonathan, for your time. Thank you everybody for being here and I hope everybody leaves inspired to both to really ponder and gather and create. And I have great admiration for your work as an artist, Jonathan, and for the incredible work you're doing to spread this vision of art as ennobling humanity, mediating reality, while really standing, I think, in awe in front of the mystery of God's revelation, which is bigger than our words or our art could ever fully capture. So thank you."}
{"episode_id":"SW - #277 - 2023-03-10 - Scala Foundation - The Mother Of God","start":3545.25,"end":3614.67,"speaker":"Jonathan Pageau","text":"Yeah, thanks to you. This has been wonderful and I'm looking forward to meeting all of you or some of you at the conference. So thanks everyone. I hope you enjoyed this episode of the Symbolic World. The Symbolic World is based on a series of videos that you can find on my YouTube channel, Jonathan Pedro's YouTube channel. You can also get involved There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course, leaving a review on itunes. Everybody knows that's the best way to get the podcast out there to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon, the Pageot videos as well, and on subscribestar, all those links you can find on my website or in the show description. So thank you and I will see you soon."}
