{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":12.56,"end":16,"speaker":"Jonathan Pageau","text":"This is Jonathan Peugeot. Welcome to the symbolic world."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":26.49,"end":40.85,"speaker":"Rafe Kelley","text":"Jonathan. It's a real pleasure to get the chance to speak to you. I've been absorbing a lot of your work over the last week, and I've gotten a lot out of it. It's been really interesting. I wanted to start with this question of what does it mean to say that the world is becoming."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":40.85,"end":41.09,"speaker":"Jonathan Pageau","text":"Re."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":41.09,"end":41.85,"speaker":"Rafe Kelley","text":"Enchanted?"}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":43.05,"end":66.49,"speaker":"Jonathan Pageau","text":"Well, first of all, it's great to meet you. I understand that we have met before slightly, so it's good to meet you again. And I have also been interested in the kind of stuff you're doing in terms of parkour and everything. My son is really into parkour, so that's kind of what prompted me to say, oh, yeah, I should talk to this guy, because I do find. I always find if I'd been younger, I would have definitely been into parkour, like, you know, just a little younger."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":66.49,"end":70.29,"speaker":"Rafe Kelley","text":"Anyway, so we can totally get you into it. We'll talk about that after the class."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":70.29,"end":319.95,"speaker":"Jonathan Pageau","text":"Yeah, I'm a little old. I'm getting that. Getting that permanent little belly. It's not a big belly. It's like the little. Anyways, all right, so let's go for it. So what do I mean? The idea is that you could say something like the enlightenment, and not just enlightenment, a whole process, historical process of development, created the possibility for what we kind of call materialism or rationalism, rational materialism today. And it's basically been a desire to see the stability of the world in. In phenomena or manifestation and things that you can quantify, right? You can. You can calculate, you can quantify, you can count. And my contention is that the reason why it was able to kind of last is because it was. It was trying to remove, let's say, the mythological aspects of Christianity, but it was still surfing on that. And so there were still remainders of it or things taken for granted, which made it possible for people to. To pretend as if that wasn't there and then kind of look at the world just as phenomena and calculate and quantify. But as they were kind of chopping the tree that was holding them up, at some point, things started to break down and there really started to be like, a breakdown in terms of epistemology, which led to something like postmodernism, to this kind of. This instability of interpretation. But there's also another breakdown which is mirroring it, which is a breakdown in value and a breakdown in society, where we see society fragment and we don't have things to kind of hold them together. And so it's so what you feel is that this rational materialism is kind of running its course. It's becoming impossible to hold at every level of reality because society is kind of breaking down, honestly, because of the type of thinking which led to this, this approach. Now it's being replaced by other weird mythologies. And so the. The new atheists, without even realizing it, are being replaced by the woke. And they almost like open the door for the woke without totally. I don't think they did it on purpose, but they. They kind of set the stage for kind of this woke new mythology, which is. Which is coming in. So what my contention is, but it also has to do with the. These new. The fact that science is trying to deal with consciousness in a way that they haven't before because they reached the edge in terms of the problem of the quantum. The observer in the quantum realm and the problem of understanding the. What John Revecke calls, what is it, the combinatorial explosion. And the problem of combinatorial explosion. And so now they have to have to deal with things which until now has just been ignored and taken for granted. Right? It's like you don't see the glasses you're wearing. You don't notice them until things start to get really weird and really wacky. And then you have to say, wait, wait a minute. Why are things so wacky? Then you start looking at the lens through which you're looking at the world. And that's where we are now. And in that movement, what we're seeing is that meaning is kind of coming back in and storytelling, image making, all the tropes, ritual, all of these things are going to return because of the crisis. The crisis of understanding that the world actually has to be framed somehow. Even scientists are starting to understand that. And so what is that frame going to be? So what I'm perceiving is that this is happening in all kinds of ways. It's not just one. It's happening in very strange ways in terms of the return of religion and all these kind of weird, fragmented neopaganisms. This. This desire to be all these California Buddhists. Like, there's just all these ways in which this is pushing itself back into the world for good and for ill, in my opinion. But it's. To me, it's definitely happening almost. There's no. That's one of the reasons why I think Jordan Peterson was so effective is because he was scratching at something which was already like an itch that had been there for even a few decades now. And now everything's kind of coming together."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":320.82,"end":449.72,"speaker":"Rafe Kelley","text":"So let me restate that. I mean, I think that I'm largely in agreement with you in what you've described, but I want to see if my model kind of is the same as yours. But it seems to me, and following Vervaeke's work, that we have this drive towards rationality that maybe starts with a kindness and we see it playing out into Descartes and Newton and all these people. And it plays back and forth with the Enlightenment, the counter Enlightenment, empiricism, Romanticism. And so these two things are. It's not a linear trajectory, but in a certain way, like the late 90s and early aughts seem like a period where you had an upwelling of religious sentiment. Right. And the Moral Majority in America. And then you had the counter reaction to it with the New Atheists and, and science was delivering. Right. We had the tech revolution. We had all of these things that were sort of making the world seem like a rational approach was going to win. And I was part of this. I grew up in the counterculture, so I grew up surrounded by people who were into mysticism and astrology and they were part of this break from the rationalism of the west that happened in the 1960s. And I self selected into basically being a New Atheist type myself. And I remember all the discussions that were happening on the forums. And have you read an essay called the Godlessness that Failed by Scott Alexander? I highly recommend it. I think you'll get a lot out of it. But I mean, he tracks exactly what you're saying and how much it happened. Like you can look at, if you, if you dig below the surface of the New Atheists, there's this whole, there's this whole phenomena of people arguing for atheism from that perspective online. Yeah. And these whole battles with it. And there were all these figures who, who were major figures, even if they weren't writing books that were New York Times bestsellers, but who are figures in that culture war."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":449.96,"end":450.44,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":450.52,"end":475.47,"speaker":"Rafe Kelley","text":"And there's a point at which New Atheists, at which atheist forums and sub forums and platforms basically start adopting something called Atheism plus. And Atheism plus is Atheism plus social justice. It's not. Yeah. There's this realization that atheism isn't an ethical platform. Isn't. Isn't it? It's a nothing. Right. And people needed a something."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":475.87,"end":627.52,"speaker":"Jonathan Pageau","text":"Yeah. But it's interesting, like you can look at the moment in the late 90s when this happened and you can actually see the, you can see how it was going to fail from the very outset because the new atheists were in a large part reacting ultimately, not just in the late 90s, but like the big thing that made them really react was, was 9, 11, like that was kind of their high moment where it's like, here's this religious thing that's coming back and it's. And it's going to destroy us, right? It's attacking us, it's violent and it's all these things. And so the new atheists tried to counter that with their kind of rational atheism, but they could never account, they were never able to account to why destroying the two towers was going to destroy America. Like they didn't. They could never understand why it would do that. Because the reason why those two towers would become the break, the beginning of the breakdown of American culture was a mythological one. It wasn't a material one. It was the symbol of these two towers, what they were, how high they were, what they represented in terms of the God of America, in terms of business and in terms of money. All of this stuff was being attacked. And what happened was a massive ritual. It ended up being a ritual event which led to many things. And so the answer, which is what the atheist gave couldn't. They could never answer that because it happened. Like what the terrorists wanted is happening. This is what they wanted. Right. They wanted the world to realize, they wanted to watch the story of America break down. And they knew that by attacking their highest symbol, basically by an act of desacralization for the God of America, that they would succeed. And they're succeeding because this now back and forth between totalitarian security and desire for freedom, it's just moving back and forth and there's no way to stop it anymore because there's nothing to answer. And also because the God of economy is not a sufficient God, it can't hold the society together. That's one of the things we're realizing. Trade is not enough to hold the society together. So anyways, go ahead with the atheism plus. But I just wanted to kind of interject that and to see why it was. They never understood what they were dealing with. And I don't agree with the terrorists, obviously I don't agree with them, but I can understand what they were doing."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":628.16,"end":731.81,"speaker":"Rafe Kelley","text":"Yeah, I mean, I'm reminded of listening to Dan Carlin talk about the history of the Syrian empire and how when they conquered a new people, like one of the first things they did was take down all the statues of their gods and, and basically Take them back to their own city and put them in subservience to their overarching God. There's a symbolic power to this act. And I think the idea of capitalism as a God is actually a really profound one. But let's dig into that a little bit more as we go through. So yeah, to finish the thought that I was on is basically atheism as a sort of cultural trend was gobbled from within by social justice. And the people who were supporting this kind of militant atheism ended up almost in mass going over and really kind of particular figure you can look at is PZ Myers. PZ Myers spent all of his time arguing against creationists up until I think 2011, 2012. And then all of a sudden it switches over and now it's about the racists and the misogynists and the homophobes and the transphobes, right? And all of his writing is now there. And, and so I share this sense that, that religion keeps popping up, right. Like I remember I was, I was involved in CrossFit in the early days of CrossFit, and there was the sense all of a sudden that like CrossFit's a cult, right. Like it's many things, right. And it can be a great form of exercise. I'm not, I'm not sort of smashing down on all the, all the crossfitters, but, but like people start treating it as their place to have an experience of the sacred. Right."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":732.13,"end":734.05,"speaker":"Jonathan Pageau","text":"And I remember identify with it."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":734.05,"end":734.41,"speaker":"Rafe Kelley","text":"Yeah."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":734.41,"end":746.05,"speaker":"Jonathan Pageau","text":"Like they make it their part of their large part of their identity. And you can see it when you see someone does CrossFit, you can usually recognize them pretty fast. Not so much anymore. But when it was like at that it's high point, you could just like be like, oh yeah, that guy."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":746.53,"end":824.24,"speaker":"Rafe Kelley","text":"Yeah, you know, the joke was like, you know, how do you know someone's a crossfitter? Like, don't worry, they'll tell you. Right? The joke also works with vegans. Right? And that's the other, the other experience that I had of like, of like, okay, wait, like religion's popping up all over. Because I remember sitting down with this guy and talking about veganism and he was trying to sort of like he, he was a new zealot of veganism and he was moving through the parkour community in England and he's like, okay, I'm a sustainability vegan, right? I choose veganism because it's better for the planet. And I was like, well, here's why that's not probably the case, right. And then he's like, well, I'm a health vegan. And I was like, well, here's why that's probably not the healthiest for you. And then he was like, well, I'm an ethical vegan. Laid out. I laid out why, why it's possible. And maybe I'm wrong. Like, I'm not claiming I'm wrong, but I made an argument why. Why, you know, there are more animals that are destroyed through farming, you know, for soybean and corn than would otherwise be. And you have to utilize more land if you're not utilizing mixed farming system. And it just hit a wall. And then it was like, well, I'm just a vegan, because."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":824.72,"end":825.44,"speaker":"Jonathan Pageau","text":"Right, yeah."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":825.44,"end":834.07,"speaker":"Rafe Kelley","text":"And I was like, oh, there's. There's no rational argument that will convince you out of this because this is your sacred value. This is what you. You worship. Right."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":835.03,"end":902.22,"speaker":"Jonathan Pageau","text":"But the ethical vegan is the greatest vegan, because the ethical vegan is reinstating the human sacred without even realizing, is saying that we do not participate. We are above natural processes, and we kind of stand above them. And then we look at them from above, kind of like from this. This high mountain. And then we. We choose not to participate in the. In the violence because obviously animals eat each other like animals. You know, that the fate of an animal in the wild is pretty bleak, like, in terms of how it's going to end its life. And so the idea that someone would think that it's ethical to not kill animals means that they stand above, like, angels, above the world, and they kind of look at it from a spiritual place. So it's just interesting because veganism exists in religious traditions, but it's specifically like, monks are not vegan, but they're definitely vegetarian in the Christian tradition and I think in Buddhism and in many other, you know, and the Janes are like, they're basically. He should have just said, I'm a Jane. Like, that's what he should have said. Like, I'm really. What I really am is a kind of religious person. But anyways. All right, keep going. Sorry."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":902.7,"end":1037.61,"speaker":"Rafe Kelley","text":"Yeah, so this one's a touchy one, but you already mentioned wokeism. But I mean, like, it was really striking to see this come up after George Floyd, right. And the washing of the feet and the. Like, I was walking through Seattle and I saw this altar that someone had created in their front yard with, like, Martin Luther King's name and George Floyd's name and Tawana Bradley and Trayvon Martin and all of these slogans and all of this artwork, right? Like pieces of glass and mirrors and feathers. And like, I sent, I actually sent a picture of it to John and said, like, this is an altar, right? Like, is there any other way to interpret this but as an altar? And he said, yeah, it's an altar. It's clearly an altar. And so it was like I had the sense that, you know, I described this to. So I'll tell you a little story. A friend of mine who's a gay black man, he, you know, after the George Floyd protests, you know, he had all of these people calling him and asking him about, you know, is he okay? Is he okay? Is he okay? Right? And he's like, this has been my experience of America. Like, I, I've had this expectation of the police the whole time, right? Like, nothing's changed for me. But all of a sudden this one thing happens and everyone's concerned about me. And then, and then he had this sense that like, well, he felt at first like all these people loved him and were his friends. And then he had this disillusionment where his sense was actually they were just calling him to basically be shriven of their sins. Right? And I told him that. I think that basically this movement, the BLM movement, is a kind of, it's a kind of reflection of Christianity where the suffering of Christ on the cross has been replaced by the suffering of the African American. Right. And the thing about that, that's really terrifying to me is that African Americans are actually then forced into a priestly class, right. Where their role is instrumental for white Americans to be able to release their sins by checking their privilege. Because checking your privilege is just confessing your sins."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":1038.01,"end":1046.01,"speaker":"Jonathan Pageau","text":"That's what it, that's. It's exactly what it is. And it's, and it's different from Christianity because Christianity has a universal form."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":1046.25,"end":1046.69,"speaker":"Rafe Kelley","text":"Yes."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":1046.69,"end":1110.48,"speaker":"Jonathan Pageau","text":"Where there, there is an absolution. And also the priest himself, like if you watch, if you listen, if you look at a Christian liturgy, there's a moment in the liturgy where the priest will turn to the people and will say, forgive me, brothers and sisters. And there's an understanding that this is not just a one way thing where we all participate in this, in this desire to forgive each other and to kind of COVID each other's sins so that we can come together and be one. That's the point, the point of like, the point of asking forgiveness for your sins is to then be in communion with people. It's not just a moral finger wagging or some kind of getting ridding of a feeling of guilt. It actually is supposed to bind you, but if it doesn't, then like you said, it becomes a very, very dangerous situation where you have one group of people that has ultimate authority and then another group of people that just need to get that. Get their forgiveness from those. And that's it. And so. And there doesn't even seem to be a way to fully be absolved in that. In that movement. It's like a perpetual guilt. Yeah."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":1110.48,"end":1171.5,"speaker":"Rafe Kelley","text":"There's no. There's no redemption. Right. No, it's a dark. It's a dark enlightenment. Right. And there's another great book that I like called. Oh, Professing, Professing Feminism or. No, I'm sorry, I forgot. It's by Daphne Cortgy and. Or Daphne Patel and Courtge. But they basically tell. Talk about the rise of gender critical theory in women's studies, and they talk about it as, like there's eventually this. This realization that. That the young women mostly who are entering this are having a conversion experience, like a Christian conversion experience, except there's no hope. Right. What they're being told is that patriarchy is. Is in every. Every ounce of every moment of everything that is done, and that it's always going to be there, and it means that everything is. Everything is essentially dependent on the creation of their suffering. Yeah. And that's, that's actually an extraordinarily psychologically destructive way to view the world."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":1171.74,"end":1172.18,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":1172.18,"end":1172.62,"speaker":"Rafe Kelley","text":"Yeah."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":1172.62,"end":1193.9,"speaker":"Jonathan Pageau","text":"And that's why you see, like, the, the image of the critical, this, this kind of radical feminist is. Is a sad one. Like, and just in terms of, you know, how they, they, they. How they present themselves, like their mimicry, their. Their faces, you can feel like this deep anger and despair which rules over them. You know, like, they just live in a world of anger and despair. Yeah. So."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":1196.06,"end":1215.74,"speaker":"Rafe Kelley","text":"So if, if so, what should we do? So, so if we, if we identify that. That religion is popping up everywhere. Right. What is. What is the symbolic world? Why. Why is it necessary to understand at this point in order to. To move forward through the breakdown?"}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":1216.3,"end":1398.95,"speaker":"Jonathan Pageau","text":"Well, so the idea. What. So when we look at this, what we see is something which is. Is a kind of disease version of religion or a kind of completely whack, whack version of religion. But what we could help us understand is that it's manifesting something which is inherent to the human person and cannot be gotten rid of. That is the desire to participate in common purposes. That's what being a human is. And in order for that to happen, like, in order for us to be able to participate together, to recognize each other as being part of a group, there has to be a totem which appears above it. There has to be something which is beyond the group, which will bind it together. And so I often use the image of a. Of a sports team. Like a sports team is a religious venture and everything about it is religious. And there are certain sacred things. You have to be careful. Even it becomes superstitious. Like so many sports people are engaged in actions which for a rational materialist would be considered superstitious, but is really just all these token behaviors which are there to manifest the unity of the group. And there's a sense in which the unity, even of the fans, for example, will participate in the winning of the team. And this is true. Like it's true, it will actually work, which is why teams lose, you know, will lose at. In another city, but will win in their own city, because the coherence of the fans and their participation will participate in the winning of the team. And so all of it is really this kind of coming together. But I mostly want to point to is that this is actually completely inevitable. This is what makes us human. And so now that we realize this, we have to be able to deal with it appropriately. So if we try to ignore or suppress this reality, either we'll be doing it without realizing it, we'll participate in it unconsciously, or it'll actually come back almost like a hydra. It'll come back in a very dark, dark and dangerous way. Because these desires, they also, they also have a very dangerous and dark undertone if we're not careful, you know, because this desire to join together, it means you exclude necessarily. That's what it is. And so inclusion and exclusion is a dangerous. It's a dangerous thing. And it can lead to violence and war and all of this. And so if we need. So the idea is this is inevitable. And the kind of. The weird, like the weird globalist desire to create this like one world thing or whatever, to avoid it is not going to avoid it, it's going to fragment at lower levels. That's what the story of Babel is. The story of Babel is this desire to say, oh, if we just create one thing, if we just have one massive group and then we're all in the group, then it'll work. But that's not how it works."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":1398.95,"end":1399.18,"speaker":"Rafe Kelley","text":"It."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":1399.25,"end":1434.36,"speaker":"Jonathan Pageau","text":"If you don't have intermediary groups, if it doesn't manifest itself fractally, is what I tried to talk about is like you need, you need layers of unity. So it's like you, your family, your city, your group, and then your religious unity. And you know, you have all these layers of unity. If you try to remove those so that we're all in just one thing, we're gonna, we're gonna rip each other apart. We're gonna rip each other's eyes out. At some point we're gonna start to fear the. Your neighbor. You're going to start to create weird groups of unity and then there's going to be a civil, basically civil war. What's going to happen?"}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":1434.68,"end":1436.2,"speaker":"Rafe Kelley","text":"Sort of happening, right? I mean."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":1436.2,"end":1445.72,"speaker":"Jonathan Pageau","text":"Yeah, exactly. I mean, that's why I can say it without flinching because it's already happening and it can get a lot worse because we're not even, it's not even started. It's going to get worse."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":1446.28,"end":1465.19,"speaker":"Rafe Kelley","text":"Yeah, there's a, you know, there's. I think there's survey data that shows that like, you know, the sense of how good race relationships in this country are in is going down very fast. And then obviously the polarization between left and right has reached a level that's really absurd."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":1466.71,"end":1523.54,"speaker":"Jonathan Pageau","text":"And it's interesting because let's say when people talk like, let's say you think of the Civil War, the US Civil War, or you think of other civil wars in history, usually what it is, it's like there are competing groups within a unity. So there are two tribes that are together in war, two families, two big families that are together in one, one unity. And then the tension between these two tribes, you know, becomes so strong that the unity can't hold anymore. And then one has to defeat the other or they have to split or they have to do something like that. But now it's all across the system. So it's not like the north and the South. Right. It's everywhere. And it's your neighbor and it's in the cities and it's in the, it's the cities versus the, the outside. It's the, it's the, it's. It's not even, even just parts of the country. It's like within the country. It's happening at every level. So that kind of civil war, it's is, is, my goodness, you have no idea what could come."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":1524.1,"end":1580.11,"speaker":"Rafe Kelley","text":"We've got white versus people of color. We've got Asian versus black, We've got, you know, the whole thing that's going on with the Jews right now is really scary. And, and then you have rural, urban, you have low income, high income, you've got men versus women, you've got unmarried women versus married women. Totally different perception of things right now. So there's lots of. There's lots of fragmentation. There's one thing that's ironic, and I just wanted to bring this up quickly, is another essay by Slate Star Codex worth reading is called I Can Tolerate Everything but the Out Group. And it's about this idea that the sacralization of tolerance is actually allowing a sense of intolerance of anyone who doesn't hold that value as most sacred. That is paradoxically, extremely intolerant."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":1580.27,"end":1615.64,"speaker":"Jonathan Pageau","text":"Yeah. I mean, it's so funny when you encounter it. It's like you just want to laugh, just so you don't cry. I remember meeting a really kind of woke person at an event where I was talking about Jordan Peterson, and he came to me and he was kind because we were talking about Jacques Deida and the idea of hospitality, of like, radical hospitality, which talks about this, like, absolute openness. And I was trying to argue with him how impossible that is, but he was saying, like, this is the way we need to go. Then he. Then he says this little thing. He says, well, obviously we're not going to be radically hospitable to fascists. But then he keeps going. I'm like, okay, what just happened? What just happened?"}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":1616.09,"end":1620.49,"speaker":"Rafe Kelley","text":"Yes, everyone but the person that I've decided is my enemy."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":1620.57,"end":1621.45,"speaker":"Jonathan Pageau","text":"Yeah, exactly."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":1621.77,"end":1623.69,"speaker":"Rafe Kelley","text":"Which is where Christianity is brilliant."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":1624.01,"end":1650.31,"speaker":"Jonathan Pageau","text":"Well, that's the idea, Right. It's like it gets turned inwards and then it becomes about self sacrifice. That becomes the mode of. Let's say the mode of. And the person that was killed and brought out of the city is God himself. And then that plays itself in your own self, where it's like, I need to. I need to sacrifice myself instead of sacrificing the neighbor or the other."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":1650.31,"end":1666.15,"speaker":"Rafe Kelley","text":"Yeah, the scapegoat. That's right, the self. So I want to go back to the religion as a team sport idea, or team sport as a religion idea, because another. Another resource that I really am getting a lot from is a book called the Righteous Mind by Jonathan Haidt. Have you. Have you read that?"}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":1666.47,"end":1670.35,"speaker":"Jonathan Pageau","text":"Yeah, well, I haven't read the whole thing, but I haven't. I've read parts and listened to many of his lectures."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":1670.35,"end":1790.06,"speaker":"Rafe Kelley","text":"Yeah. So, I mean, you know, it's really resonant with what we're talking about because, you know, he has a chapter in there. I mean, basically it's about understanding the out group. Right. And it's about understanding what. What the telos of different groups actually is. Like one of the Things I told you before, the call that I wanted to have this call with you. Really. In particular, once I heard you with Rationality, Rules and Adam Friend, because I felt like I was able to operate the. The conceptual framework that they were playing in, but I was more open to the conceptual framework that you're playing in, and I wanted to be able to produce that. Right. But I think from a rational, materialist mindset like this chat, the chapter, you're right, it's called Religion as a Team Sport, really helps understand because he's essentially saying that biologically and culturally, we've evolved. We've evolved this capacity to act in groups. And the research shows that having a religious system improves that. And religions are probably selected over time for their ability to help people act in groups. Right. And there's always the thing about a group is that it has an out group. And this is part of your. You know, I think what you talk about a lot, which is really brilliant, is in order to define a group, you have to have an out group. And the default human tendency towards the treatment of the out group is complete alienation. This is something that people. I think it would be really useful for people to read the anthropological literature a lot more closely and not with a sort of noble savage gloss on it. Because I feel like sometimes people will read it, an anthropological thing, and they'll be like, oh, man, their lives are so amazing. And I'm like, I read the same book as you, and I don't know if you read the part where the man just kills a child for no reason or the woman is beaten by multiple husbands, because that's part of this tribe that you've just told me is like, the perfect example of egalitarianism. But. But one of the things that you find is that the. That very often in tribal cultures, the name for people outside the tribe is just not people."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":1790.3,"end":1791.34,"speaker":"Jonathan Pageau","text":"Yeah. They're not human."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":1791.66,"end":1796.78,"speaker":"Rafe Kelley","text":"They're not human and they don't have any. There's no sense of moral obligation to them."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":1796.94,"end":1797.42,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":1797.42,"end":1797.94,"speaker":"Rafe Kelley","text":"And I think."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":1797.94,"end":1811.71,"speaker":"Jonathan Pageau","text":"Yeah, which is why, like, the type of torture that they can inflict on someone, which is from outside the group, is, like, now there's no limits. You saw that in native culture here in Canada, where it's like they. If they caught someone from the other tribe, they could do anything to them."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":1811.71,"end":1812.99,"speaker":"Rafe Kelley","text":"Yeah, yeah, absolutely."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":1814.43,"end":1834.88,"speaker":"Jonathan Pageau","text":"And it wasn't like. It actually wasn't. It was interesting because it wasn't a racial thing. It was a ritual reality. And so they could ultimately adopt someone from another tribe. And Once they were adopted, then they were like, oh, then they're, they're the Indian group. But unless that happened, then they were, they were inhuman and they were just basically something to be acted upon. So."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":1834.88,"end":1872.25,"speaker":"Rafe Kelley","text":"Yeah, yeah, I mean, I think there's definitely a truce to the idea that the way that we perceive race or the way that race was perceived, say in the late 19th century, early 20th century, has this massive social construction and it's using this underlying group competition psychology and it's mapping it to certain physiological differences in order to, you know, for, for a variety of reasons. Right. Historically. But it's, it's not a default setting to, to automatically treat those physical characteristics as the most most important aspect of someone's identity."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":1872.49,"end":1900.71,"speaker":"Jonathan Pageau","text":"Yeah, yeah. And also, I mean the, the racism itself is a modern concept. Like it is a scientific, it's a scientific take on the, on the ancient perception of difference. But it, but now we've made it into the scientific defend. So scientific racism is most. The Nazis were more like scientific racists than they were like the ancient people and how they understood difference or understood stranger and that kind of stuff."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":1900.95,"end":1908.31,"speaker":"Rafe Kelley","text":"Yeah. So I wanted to get into your idea of the cosmological frame. Like, I think the conversation we've had."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":1908.31,"end":1989.84,"speaker":"Jonathan Pageau","text":"So far, maybe I can just into what you're talking about, about Jonathan Haidt. And let's say the difference between what Jonathan Haidt is saying and, and let's say a proper religious understanding is that Jonathan Haidt perceives that there are these axes, you know, that people will elevate something, a virtue or someone or something, and then they will process around that reality. Right. They'll circumambulate around a common point and then that will create cohesion in the group. But Jonathan Haidt seems to treat that as almost like arbitrary. As if, like whatever it is you decide is going to be up there, then that's going to be the thing that's going to join together and it's going to play out. But this is in terms of a religious understanding, you could understand that it is perceiving this which led to something like the, what we call the monotheistic religions, which is actually that if you, if you follow. Like I was actually just reading, I was reading Phaedrus recently, Plato's Feeders. And in it, Socrates talks about how the followers of certain gods will seduce their lover in a way that resembles the God. And so it's like if you follow Zeus, then the way you will approach your lover will be like Zeus, if you follow, you know, if you Follow this God, then. Then you will kind of approach your lover in that way. And this is."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":1990.24,"end":1990.88,"speaker":"Rafe Kelley","text":"You're going to use."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":1990.88,"end":1991.36,"speaker":"Jonathan Pageau","text":"Exactly."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":1991.36,"end":1995.2,"speaker":"Rafe Kelley","text":"And aggression. If you're pan, let's go to the woods."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":1995.6,"end":2133.85,"speaker":"Jonathan Pageau","text":"So there were different. So you just. But it's mostly the idea to understand that, like, whatever it is that you feel follow, you subject yourself to that. Right? So if you. Like you said when we talked about the idea of CrossFitters, it's like people who, who follow CrossFit or worship CrossFit, they become CrossFitters. It's not arbitrary. They actually. They actually embody the thing that they're worshiping. So it's so. So right. They become the body of the thing they're worshiping. And so this is the movement, let's say, towards monotheism, which is that, okay, we realize that there are aspects of reality that are fragmented. And if we. If we worship those as the highest thing, then we. We embody something, but it ends up being in conflict with something else because it's a. It's a fragmented aspect of reality. Which is why, like, so the Greek cities would just fight all the time. Even though they went to the Olympics or whatever, they would fight every year. There would always be wars between the Greek cities because they were subject to different principalities. And those principalities didn't necessarily elevate above. There was like a competition between them. Whereas the idea of like a monotheistic thing is like, how do these. All these things come together higher up? Can we have something which unites them in a higher way? And then you have the kind of Neoplatonic idea being itself. And then love, right? Because love is the manner in which multiplicity exists as one. So you can have both multiple and one. And so then you kind of go, you keep going. And then you have this idea, like, let's say in Christianity, the revelation of the Trinity, which is the notion that there's in you, there's a thing that's both infinitely multiple and infinitely one at the same time. It seems like a total contradiction, but you realize, actually, no, if we worship that, then we can both have multiple and one. Because if you're too much in unity, you have a problem which is that difference starts to get sucked into the unity. People become like carbon copies of each other, like in communist countries. But if you just worship multiplicity, then all of a sudden things start to break down like we're seeing now. And then fault lines start to appear. People start to fight amongst each other. So what's the highest thing we can worship. It's something which is both at the same time."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":2134.25,"end":2148.65,"speaker":"Rafe Kelley","text":"I want. I want to try to ground this in a biology. Right. Like, my frame often is going to go back to evolutionary biology, but. But I think, like, when you talk about multiplicity and unity, that's the right words, right?"}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":2148.73,"end":2149.21,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":2149.21,"end":2161.29,"speaker":"Rafe Kelley","text":"Like, that ends up having a very sort of mythological frame sounding to it. And I think it's hard for a rational materialist to grasp it. Like, I literally feel like I didn't get what you were actually saying until last night."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":2161.72,"end":2162.12,"speaker":"Jonathan Pageau","text":"Okay."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":2164.52,"end":2173.88,"speaker":"Rafe Kelley","text":"And then I was like, oh, this is exactly what Vervaeke is saying. Right. Vervaeke describes that as the process of diversification and integration."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":2173.96,"end":2174.44,"speaker":"Jonathan Pageau","text":"Yes."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":2174.52,"end":2184.92,"speaker":"Rafe Kelley","text":"So every process that complexifies has to both diversify functions while uniting them under some overarching telos. Right?"}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":2184.92,"end":2188.52,"speaker":"Jonathan Pageau","text":"Yeah. Simultaneously, it has to be constantly happening at the same time."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":2188.82,"end":2255.79,"speaker":"Rafe Kelley","text":"Yeah. And this is what Hai talks about in the Righteous Mind is the idea that cooperation always suffers a free rider problem. Right. But we've actually been able to move up through these levels of cooperation. The single cells. First, you have mitochondria that go into cells, right. And they're two different things. And then all of a sudden they learn to cooperate and not default off of each other. And then single cells become multiple cells, and then those become organs. And so like, that's. That's your developmental process. You started as a single cell. And then, then what can happen? There's two things that can happen. One, One sort of cell can just start. Start replicating itself and trying to turn everything into itself. That's cancer. And you die. The other thing that can happen is your. Your systems can go to war with each other. That's autoimmune disease. That can also kill you. Right. And so we have these, These two directions that you're talking about, the direction of. Of. Of. Of sort of collapse into a single thing which destroys the overarching thing, which."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":2255.79,"end":2269.08,"speaker":"Jonathan Pageau","text":"Is what they tried to do in the Matrix with Agent Smith. Like, that's what Agent Smith was supposed to be. He's supposed to be like this, this, like the tyranny of. Of. Of a specific thing that tries to. To make everything into itself. Yeah, Cancer, basically."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":2269.24,"end":2293.8,"speaker":"Rafe Kelley","text":"Cancer. Yes. It takes everything over. So. So I think that it's really helpful to be able to look at that from these two different frames right now. I think that part of what makes your worldview your. Your worldview and not, say, Jordan Peterson. Like, I think a lot of people are just mapped the way that you think to Jordan Peterson. Yeah. Like that was something that came up in those two conversations. It was like, wait, you're actually a religious person who believes in God?"}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":2295.08,"end":2297.08,"speaker":"Jonathan Pageau","text":"Yeah, not Jordan Peterson, that's for sure."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":2299.24,"end":2310.6,"speaker":"Rafe Kelley","text":"Is that you think that there's a reason why framing it as in that mythological realm rather than in the biological analogy actually works better."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":2311.08,"end":2436.57,"speaker":"Jonathan Pageau","text":"But it's not just that. It's that you can. One of the difficulties people seem to. You can see it top down and bottom up. You're seeing it top, bottom, bottom up, let's say. And that's fine with me. Like, I'm fine with bottom up. But the thing is that you have to keep going. That's the, that's the point is like, can you keep going? That is, is there a way to start bottom up from like, let's say, quantum possibility, field of possibility, and then move all the way to being itself? That is how all this multiplicity joins together towards unity. But then it also continues into human person, but it continues across human persons. That's what a city is. A city is the same as a cell. It's a transpersonal being that is engaging in those rules of complexity that you mentioned, constantly diversifying, constantly unifying. And it's a messy process. It's not always totally clean, but it's happening or else cities wouldn't exist. And then countries, et cetera, et cetera. And so the idea is that there, there has to be a way for it to continue to scale up. And then if you scale that up to. It's a limit. That's what you. You get to. You, you end dev. You inevitably get to something like love or infinite love or, or the divine Trinity. That's what you will get to. Because one of the problems that I see is that people see it in biologically, but then they stop at some level, some reasons, like, keep going, man. It keeps going, like, keep going up. And at some point it also becomes true in the world of intelligence. So it's like, it's not only biological. You'll notice that ideas also have that same pattern where ideas have places where they unify and places where they complexify. So if you think just any concept or any, let's say, abstract notion will also have that in it. It'll have an aspect of complexification and unification. And then you can keep going in that world."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":2436.89,"end":2481.45,"speaker":"Rafe Kelley","text":"Sure. So, like, just to throw an example for people, right, you could look at parkour and you could. You could divide it into a series of. Of sub disciplines, the different people practice. So there's like rail flow and there's bar swinging. And then there's like, all the tree jumping in the wood. Right. Like. And you could see those things as essentially separate. And they could. They could even, like, separate. Like, someone might decide they're just going to go be a rail flow guy and they're not going to mess with the rest of parkour. And then you can be like, well, okay, well, parkour is a movement art. And now you see that it's unified with other movement arts. Right? So now. Now you see that it's in some overlapping category that contains also martial arts and dance, skateboarding and, like, all these."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":2481.45,"end":2495.7,"speaker":"Jonathan Pageau","text":"Kind of movement arts. And then it moved, like you said, it moves into something which is even higher. And then you could. Then that could keep going. Like, it could keep going up if you were. If you were capable of perceiving how everything moves into being, let's say. So you were. That's exactly what I'm talking about. Yeah."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":2495.7,"end":2517.1,"speaker":"Rafe Kelley","text":"Yeah. So. So I had this. So growing up in the community that I did, I. The word spirituality makes the hairs on the back of my neck stand up. Right? Like, when. When someone says spirituality, I feel like they're about to try to sell me. Bullshit. Yeah, right. Like, they're gonna."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":2517.1,"end":2519.22,"speaker":"Jonathan Pageau","text":"I understand. No, I see what you. I know what you mean."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":2521.28,"end":2535.28,"speaker":"Rafe Kelley","text":"They're going to tell me, like, spirituality to me is telling me that it's really important to. I'll give you a really precise example. When I was growing up, there was certain people within my community who would say, you create your own reality."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":2535.36,"end":2535.72,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":2535.72,"end":2548.45,"speaker":"Rafe Kelley","text":"There's this idea that. That, like. And those people would then turn around and do heinous shit and say that the reason that you felt that their shit was heinous was because you were creating your own reality. Yeah."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":2548.45,"end":2549.05,"speaker":"Jonathan Pageau","text":"That's horrible."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":2549.21,"end":2571.13,"speaker":"Rafe Kelley","text":"Right. That. That. That just drove me crazy. Right. And so I've always, like. At a certain point, the. The stuff that I was teaching started being like, well, parkour has some kind of profound transformational impact on you. Well, how do I understand that? How do I help people get that? How do. How do we get more of that? And someone's like, well, you're a spiritual teacher. It's like, well, no, because those fuckers."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":2571.13,"end":2574.07,"speaker":"Jonathan Pageau","text":"Are full of shit. Yeah."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":2574.55,"end":2575.91,"speaker":"Rafe Kelley","text":"And I'm trying not to be."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":2577.27,"end":2577.67,"speaker":"Jonathan Pageau","text":"And."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":2577.91,"end":2680.5,"speaker":"Rafe Kelley","text":"But then I had this. I was reading two books. One is a book called the Spell of the Sensuous by David Abram, and that's about phenomenology. It's very much inspired by Merleau Ponty. And the other one is A book called what the Robin Knows. And it's about, it's about bird languages. And I had the sense of exactly what you're describing, I believe, which is that when you walk through the woods, you hear birds singing. And you can tune into a bird or you can turn into the birds. And all of the birds together actually contain an intelligence that's more than the single bird. So if all the birds go quiet, you know there's a predator in the area. Yeah, right. And so there's a neural net and you can, you can pay attention to where the quiet is and where the noise is, and you can pay attention to where the alarm calls are. And all of these birds are like, they're. They're little neural nets that are communicating to other neural nets through sound that are, that are giving you information about the environment. And hunter foragers are extraordinarily attuned to this. And they will be like, okay, I know where these animals are because I'm listening to the signals from the forest. And I'll say, well, that the easiest way to conceptualize that is that's the spirit of the bird, the spirit of the birds. And then you could understand that the spirit of the birds is a sub segment of the spirit of the forest. There's all this other information between the trees and the other animals, and all of that kind of rises up to something above that. And I believe that that's what you are referring to when you talk about something like powers and principalities. And then we can understand Facebook and Google and social media as, as all of these things. Right?"}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":2680.66,"end":2690.26,"speaker":"Jonathan Pageau","text":"Yeah. Especially now it seems like we're building something like we're building some kind of, of a body of a God. That's for sure. Like, it seems pretty obvious by now."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":2690.66,"end":2696.18,"speaker":"Rafe Kelley","text":"So interesting. We're building, we're building new gods. Right? It's really hard."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":2696.26,"end":2815.24,"speaker":"Jonathan Pageau","text":"Like, but this is not new. This is what pagans did all the time. Like, this is what, that's what making. They would make statues of, of a God and then they would, they would open its nostrils so that it could become the center of a community. And then people would embody the God. Like, they would, they would become worshipers. And like I told you about in the. How Socrates describes the followers of certain gods as embodying. But the statue would be like the, would be like the place where our attention would go, like all our attention kind of move towards that, that embodiment. And that would be part of the how we would, how we would manifest the God. And so it's like the Google is, is definitely acting that way. And what's interesting about Google and Facebook too, what's interesting about them is that they, they're pretend. They're. They're all there are. There's like a priestly cast that's whispering. There's like a priestly class whispering the will of God. And we, and we can't. They don't want it to know that it's there, but it's there. And so it's like the Google searches are obviously tainted towards whatever that priestly caste wants us to believe. And so all the, actually all the really negative stuff about religion that people caricature, like this idea of this like priestly cast that wants to control everybody, it's like this is what's happening right now, if you want to know. Like this is, and they don't have something above them which is supposed to be their judge. There's nothing above them which is, there isn't a tradition or something before them or above them which is telling them like, so like let's say a priest abuses his power. He can do it in the Catholic Church, let's say. But everybody knows that he's wrong even if he can do it. And it's going to happen all the time, but everybody recognizes that it's wrong. Whereas now there is no ultimate. There is nothing above to kind of judge. Well, there is, I believe. But like, at least in their perception, like they're the arbiters of reality really. So that's scary stuff."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":2815.4,"end":2829.48,"speaker":"Rafe Kelley","text":"And we, you know, we could say that there's a telos to social media. Oh yeah, there's a, there's a, there's a goal which it is serving and at a first approximation maybe that is, is capturing of attention."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":2830.04,"end":2894.89,"speaker":"Jonathan Pageau","text":"But that, yeah, that's, but that's, it's also understanding how reality works. It's, it's really, in a way we're in a good place because when, because social media and, and Google is showing us that the world is in many ways function through attention, that it's actually made of attention. And now once you realize that the world is made of attention to a certain extent, then again, ancient religious rituals will become less arbitrary to you. The idea that to attend to something which is beyond you, to do it together, to stand together, and then to attend to something which is beyond you is actually has a, actually has a causative function, like a causative role, it actually causes unity in that group. It's a different kind of causality. It's Hard because materialists understand that there are causalities of billiard balls hitting each other. But there's a type of causality which is a causality of unity. This is the formal cause that Aristotle talked about. There's a. There's something which brings you together."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":2895.45,"end":2931.52,"speaker":"Rafe Kelley","text":"Yeah. So in my conversations with. With Vervake and Van Der Clay, we've talked about your perspective, and in particular talked about your perspective also in relationship with. With David Abrams perspective. And the place where I get hung up is I find what you have to say extremely insightful. Right. But there's a point at which you assert that a pattern of being exists. Right? This is just the pattern. The pattern is heaven and earth. The pattern is there's the unstructured potential. Outside of heaven and earth, masculine is this. Feminine is associated with this."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":2933.28,"end":2937.44,"speaker":"Jonathan Pageau","text":"And that's annoying, huh? That's annoying."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":2938.72,"end":2997.17,"speaker":"Rafe Kelley","text":"And my question is always, how do you. What's the epistemology that allows you to assert that? Right. Like, I think that in your conversation with. With. With Steven Winford, you. You basically, I think, make it. I wish I could replay what you said. Exactly. But you made a case that essentially that he has no way of establishing the good, that his frame doesn't allow him to establish the good, and that he's not fully conscious of that. Right. That, I think, was a key part of your argument. So it's like you're telling me that my thing doesn't. Doesn't serve the good, but you don't. You don't know how to describe your own good. And like, you know, based on. On. On Haidt's book, I would say that harm reduction is actually the good that he's talking about. Right. It's the closest to. To the God that he's worshiping. But he couldn't actually tell you that. But I would say that reciprocally, I still don't understand how you establish the true."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":2997.95,"end":2999.63,"speaker":"Jonathan Pageau","text":"Sorry, you broke down. Could you repeat that?"}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":2999.87,"end":3037.67,"speaker":"Rafe Kelley","text":"I said, reciprocally, I would say I don't know how you establish the true. Like, I sort of. Like you asked him, where do you stand? Right. And I would say that I don't have the same certainty about where I stand that you do. Like, I feel like I stand within scientific epistemology. Right. As a rational materialist. And that I recognize that that frame, that set of axioms, doesn't give me everything that I need. And I suspect based on what that frame tells me, that a lot of what I'm relying on is actually Christian, that it's. That it's this Ghost of Christianity or the bones of Christianity that I'm standing on."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":3037.99,"end":3038.47,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":3039.03,"end":3047.19,"speaker":"Rafe Kelley","text":"I don't know that I can. That I can say that with 100% clarity. Right. I don't know. I think that's a quite difficult question to answer really well."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":3048.15,"end":3048.55,"speaker":"Jonathan Pageau","text":"But."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":3048.71,"end":3087.59,"speaker":"Rafe Kelley","text":"But that's where I would say that I'm. I'm standing. But I would say that I believe that we have a good way of asserting a truth claim within scientific epistemology and that we have to be able to understand and utilize that system because it's what allows this technology that we're speaking on to work. And if we allow sort of participatory, mystical, phenomenological thing to colonize all the way down into the propositional level, that runs a risk of collapsing it. And it's already happening. Right. Science is already like all of these. All of these little religions that are popping up, they're trying to colonize and crush science."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":3087.67,"end":3088.15,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":3088.23,"end":3096.95,"speaker":"Rafe Kelley","text":"Social justice does not want science to operate science. It wants it to operate fully in service. It's Lysenkoism. Right. So."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":3097.59,"end":3138.05,"speaker":"Jonathan Pageau","text":"But then you'll realize that science, at least the kind of the, the image of science that people think has never really manifested. Right. That it has always been serving goals like other goals. And what the social justice people want is only that science serves their goals. And by doing that, it appears to us like a clash because we're not in the same world. And so it's a different world. And they're saying we want these technical, physical descriptions to serve our. Our goals, let's say. But it. That I think has pretty much always been the, the case, like it's always kind of been there."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":3139.01,"end":3181.88,"speaker":"Rafe Kelley","text":"So I've made the argument to Verveki that. That I think that if we're going to kind of survive that Western. That if Western civilization and what it's given rise to, the world system that it's given rise to is going to survive, probably the best thing that we can do is in some sense recover Christianity because it's the only religious system that has a history of allowing science to fully develop within its. Under its eaves. Right. And his counter argument is that the Islamic golden age, and, you know, I don't think I have an answer to that, but, but, but I do think there's something there. And I think, you know, there's a claim that that rel. That. That science is sort of necessarily nested within a religious frame."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":3181.88,"end":3314.44,"speaker":"Jonathan Pageau","text":"Yeah, that's definitely what I believe. But maybe I can. Maybe I can. How can I say this? So Maybe I can help you with the problem of when I say heaven and earth and all these things. The first thing that we need to notice is that the terms that are used when I talk about it are always analogical. They're always. And so you can even hear it often in my voice. I say, could say something like, and then I'll say something because the pattern is a pure intuition. And, and I don't know what to say besides that. And that's going to be annoying for a lot of kind of materialists. But there is a sense, and it's a something, it's a universal sense. It's not just in Christianity. It's an almost, in every religious system that humans have a capacity to intuit the reality, to intuit the real pattern. And that intuition is not reason. It, reason flows from that intuition. And so, so it's, it's a direct grasping of, of the, of the pattern. But then you can't, you can't. When you, when you bring it back down into the world of manifestation, you have to translate that or you have to, you have to embody it, you have to give it form. And then you can talk about different patterns. And the only way to help people see or to intuit the actual pattern is to, I mean, there are different ways, like Zen Cohen's are like the different ways to kind of provoke that in people. The way that I try to do it is to give you a bunch of analogies that you don't think, that you don't think fit together. Like all these examples of things you don't think actually have something in common. And then all of a sudden you see that they have something in common and it gives you a little glimpse and it appears to you like an insight, like a spark. You have this like, scent that it's coming together. And often you can't hold on to that. It'll, it'll kind of get it and then it'll go away. But that, but that insight is described in every single religious system that ever existed. It's like this kind of, this glimpse of reality and then, then this kind of fade away. And so it's going to be annoying what I'm going to say, but it's like that's what my truth claim is grounded in."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":3314.44,"end":3320.27,"speaker":"Rafe Kelley","text":"I don't know what to tell your tooth. Correct. Your truth claim is grounded in a, in a personal intuition."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":3320.67,"end":3331.71,"speaker":"Jonathan Pageau","text":"It's grounded in an intuition which then becomes verified, as you can see, the intuition embodied in different levels of reality. But, so that's how you, that's how you verify."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":3332.03,"end":3332.31,"speaker":"Rafe Kelley","text":"Right?"}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":3332.31,"end":3382.61,"speaker":"Jonathan Pageau","text":"So you, so you have the intuition and then you have to, then you have to see if it finds body. So if it, if it works at the personal level, at this, at the civilizational level, at the family level, if, if, if it works in stories, if you find it in stories, you can find it in ritual. If you find, if you're able to see how this intuition embodies itself, then you're close. Like you're closer to a real pattern than if it's just this weird like freak thing that you, that you kind of, you get. People can have intuitions, but often they don't. They're not. Right. Like they don't actually verify when you try to embody them. And so, so there is a, there's almost like there is a kind of scientific, it's close to actually how science work because people don't realize that scientists often don't find things by digging in the dirt. They have intuitions."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":3382.93,"end":3383.41,"speaker":"Rafe Kelley","text":"Yes."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":3383.57,"end":3395.33,"speaker":"Jonathan Pageau","text":"And then they verify whether or not by digging in the dirt it'll, it'll pan out. And that's exactly the way that I, that I work. It's like I have an intuition and then I try to verify it at different levels."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":3396.13,"end":3396.45,"speaker":"Rafe Kelley","text":"So."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":3396.45,"end":3404.6,"speaker":"Jonathan Pageau","text":"But it's a little different than, a little different than the scientific way. But it's nonetheless trying to find the pattern embodied, let's say."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":3404.92,"end":3494.31,"speaker":"Rafe Kelley","text":"Yeah, so I heard two things there. One was kind of an appeal to pragmatism. Basically. It really sounds a lot like Peterson's argument. And there's two aspects to Peterson's argument. One is you kind of know that a pattern is true when it works for you and it works well enough. But the corollary to that claim would be that he would say that we only ever get there. We only ever get to true enough, we never have the full truth. And then the second claim is basically like in Maps of Meaning. Peterson basically makes a claim that his cosmological view that he's putting forth there is verified through multifactor, multi method verification. Right? That's, that's the term, that's the scientific term for it. So he's, he's saying, okay, if this pattern shows up in the neurobiology and in the cognitive science and in the anthropology and in the evolutionary biology, then, then I'm going to take that as, as true. Right. In the same sense that, you know, if I see something and it's surprising to me, if I can then smell it and hear it and touch it, then I'll Accept that it's real in a way that, that my eyes alone won't tell me that something's real. So those are the two things that I, that I hear as sort of your system starts with intuition and then moves into multi factor, multi method and then is grounded, grounds out in pragmatism."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":3494.71,"end":3560.03,"speaker":"Jonathan Pageau","text":"It's something like that. The difference maybe between me, Jordan and I is that I ground it above and he seems to ground it below. It's like, I think that. So it's like what is the word of Christ who says, blessed are those who did not see, see and, and, and believe like that is that if you have the pure intuition, that's where reality lays. Not in the embodied, pragmatic, pragmatic thing. Because the embodied pragmatic thing is messy. And it's kind of, it's a, it has variability and it's. Sometimes it's, it's a little off, but then the pattern is pure. Like it has it. It's a, it's almost mathematical. And so you need both. And I agree, and you totally need both. But I ground I. Let's say you could say something like this is going to be annoying to the secular, to the secular people. But I think I ground my life in my faith in Christ rather than in the multiplicity and in the like, the variability of existence. And so maybe that's the difference between Jordan and I. So I think solidity comes from above, doesn't come from below."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":3562.86,"end":3567.98,"speaker":"Rafe Kelley","text":"I'd like to dig into that. I mean, that one I struggle with."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":3567.98,"end":3570.62,"speaker":"Jonathan Pageau","text":"Right, I understand that you struggle with I."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":3570.94,"end":3588.38,"speaker":"Rafe Kelley","text":"Because so to go back to the beginning of the conversation, we're talking about how sort of modernity reaches a point. It's like you, you break all the molecules down into atoms and then you break the atoms down into subatomic particles. And then you reach this point at which it's just uncertainty."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":3588.77,"end":3589.01,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":3589.01,"end":3590.77,"speaker":"Rafe Kelley","text":"And that's not what you expected at all."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":3591.17,"end":3593.33,"speaker":"Jonathan Pageau","text":"Aristotle's potential is waiting for you."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":3593.41,"end":3643.55,"speaker":"Rafe Kelley","text":"Yeah. So you end up, you, you expect clockwork at the bottom of reality and you end up with quantum fields. And then, and then you spend the last like 60 years basically unable to get anything that creates new technological opportunities out of trying to figure out what's at the bottom of reality. And you know, I don't understand quantum physics. I don't think anyone understands quantum physics. So if I butchered it and what I say makes no sense because of it, you know, forgive me, but so we end up there, right? And essentially so much of science is powered by Reductionism. And then there's a point at which that doesn't work anymore. And now we have complexity, right? We have combinatorial explosion. We have complexity sciences, systems thinking. And all of this gives us a way to understand emergence, right? So we know that things emerge, right? That, you know, the way I understand, we notice it."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":3643.55,"end":3655.84,"speaker":"Jonathan Pageau","text":"I don't think people understand it. Okay? David Bentley Hart had a great term. He said rationalists use the word emergence like you would use the word magic. It's like your magic happens. They just found another word for it."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":3656.56,"end":3719.09,"speaker":"Rafe Kelley","text":"So a lot of people who talk about complexity, that's exactly what it sounds like to me. And what really helped me was understanding that you can understand a dynamical system as a system with two cost functions, right? And that when you put these two cost functions in opposition to each other across an equation, that they generate a random walk, right? So the classic one, the one that's, you know, really important to all of science is evolution, right? You have mutation and sexual reproduction, which produces variation. And then you have selection, which selects from among that. And then all these crazy things emerge from it, right? So. So I get that, right? That makes sense to me. And I feel like I have really, really epistemologically sound ways of getting there, right? So. But then, like, when I listen to you or JP Morceau or someone else, you talk about this idea of emanation, right? So I want to. I want to look at an example, right? One of the things that the problem."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":3719.09,"end":3882.24,"speaker":"Jonathan Pageau","text":"Is going to be easier to see emanation at a human scale because it has to do with intelligence. It's going to be harder to see it at a biological, like, low level. It's there, but it's harder to see. It's easier to see at a human level. Like, so if you deal with human phenomena, okay, so let's say I found a city. I talked about this on my channel recently. It's like, I'm Constantine, and I'm the king. I'm the emperor. And then I found a city. And so I come and I do a sacred ritual. I will take a lance and I will, like, walk behind an angel to, like, mark the limit of the city. And so I actually give it a name. I found it. I give it a name. And then from that, a city will appear. Like, people will start to congregate around that center and will start to do the things people in cities do around that sacred gesture that I did. So in the. Let's say there is right nearby where I live, there's A town that the first thing in the town that was built was a church. And so they built a church which is a common place, a place of unity, where everybody congregates and worships the same thing. And then a few decades later, there was an entire town built around the church. So that's a form. You could say that's a form of understanding causality from above, which is you found, you name, you create a coherence, and then the world kind of comes in and manifests from. So founding a company, founding anything that is almost human needs to have an aspect of eminence that you can easily perceive for it to exist. For a group to exist, it has to have a name. You have to name it, right? And so it's like you have a band, you get a bunch of guys together, but it's like, okay, so if we're going to exist, we need a name. And so then you name the band and the name of the band. Like, if you name the band a name that sounds like a pop band, or if you name the band a name that sounds like a death metal band, because those actually can be recognized in the name, it will affect. So you couldn't have like a death metal name and then make pop songs because it'll be so incoherent that it's going to break apart. So you need to have. So in the name and in the image and in this kind of founding, you need a type of coherence. So that's a form of. That's a form of eminence. But I mean, there are so many. But they're a lot easier to see, for sure, in the human sphere."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":3882.48,"end":3887.68,"speaker":"Rafe Kelley","text":"But, I mean, can't you see that that emanation itself is derived from an emergence?"}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":3889.26,"end":4024.98,"speaker":"Jonathan Pageau","text":"It's both happening at the same time. But you can't only see it as emergence. Like, you can't. It doesn't. Like, at least to me, like the founding of. Especially the idea of, like the. The idea of the founding of something. Because there's a whole idea that we remember the founding. It's like, why do we remember the founding if it's just emergence? Like, we tell ourselves the story of the founding of the United States. We tell ourselves the story of these sacred moments that are the origin of a community, because it actually binds the community together. That's why we remember it and retell the stories. And so companies that have good founding stories, it'll actually affect how much it lasts. So it's. But the thing is that you can't only See it as immersed, as top down. It has to be both at the same time. That's the bond of love. You could say that's the communion of love. There's a great quote by Saint Maximus the Confessor that I always like to quote, but people have heard it a thousand times. But he says that as a person, let's say a mystic kind of raises above phenomena and then starts to see the spiritual essences kind of rise up from the multiplicity. He notices that there's no contradiction. Like there's no contradiction between those essences and the way they exist embodied below those. That's actually. That's actually how it works. So it's like it's. It's. That's why reality is often described as the meeting of lovers, right? As a. As a sexual union, which is that you need. You need the desire of both. Like, you need the man to. You need the man to give and need the woman to be. To give herself as well in the different way that she does. Like, she has to be able to receive what the man is giving. And so that is the union of heaven and earth, which is both eminence and emergence happening at the same time. And that's how you have a child. That's how you have the fruit of the. You know, the next. That's how an identity is formed. You could say. But I understand that it's harder for you to see. For me, it's very easy to see. It's actually a lot easier to think that way than to think the other way."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":4026.02,"end":4050.5,"speaker":"Rafe Kelley","text":"Yeah, I mean, I'm very much grounded in a sort of a rational materialist epistemology. And I feel like I'm gonna need to watch this part back and mull on it to try to understand it. Because we're sort of. Obviously, this is tapping into the idea of the forms and this idea that."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":4052.17,"end":4093.7,"speaker":"Jonathan Pageau","text":"Let me give you one little more example. This is actually a pretty good example. So imagine you have something like punk music. So punk music appears. And so actually punk music is just rock music, right? So why is it that. Why is there punk? And so do we name punk? But that keeps going. So you. All of a sudden. Because there's always variability, but it's. Obviously no punk band is the same. But at some point you name the variability, and so you're like that emo. But then once you name the variability, it has a causal function. You're going to have way more emo bands once you've named emo than before."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":4094.1,"end":4094.66,"speaker":"Rafe Kelley","text":"For sure."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":4095.22,"end":4108.91,"speaker":"Jonathan Pageau","text":"Before it was just this Variable thing that was kind of. And then people start to perceive that there's something different and then they give it a name. And then once they name it, then it takes body and it starts to actually manifest as a, as a coherent whole."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":4109.63,"end":4208.76,"speaker":"Rafe Kelley","text":"Yeah. So the analogy that pops into my mind or the, the, the example that pops in my mind is of course, parkour. Right. So when I started parkour, I was teaching gymnastics and the guy who. There was a guy in my, in the gymnastics sort of adult class that I attended who they warned me was a crazy guy. And he was always doing like, weird off, like, fringe stuff to gymnastics. He was dive rolling over vault boxes and swinging between, you know, uneven bar setups and swinging on the rings and all the stuff that like, gymnasts don't do. And, and so I discovered parkour and I was like, okay, Dane, that's his name. Like, you should try this. Because it seemed like the stuff he was already doing. And he, he then like pulls me into doing parkour with him and then we go out and he takes me to all these places that he's already been jumping and climbing around the city that he didn't have a name for. And he had friends who he was doing this with for years. Right. And the same thing happens. Daniel Baku is one of the most famous parkour athletes. Like, he, he sees a guy doing a wall flip because he's a caporista, and then he starts jumping around and on the roofs in his city because he's just intuits that somehow wall flips mean you can jump off roofs. And, and then, and then Oleg Vorslav in, in, in Lithuania does the same thing. And so then like all over the world, as the parkour community sort of scaffold itself up, it finds all these people who are already doing it, but they didn't have a name for it. Right. So kids have always run, jump and climb. And then some people don't stop. Right. Or stop less than other people. And so it's like the potential was always there, but then there you go."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":4208.76,"end":4212,"speaker":"Jonathan Pageau","text":"That's a good way to understand it. It was, it was, it was in a potential form."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":4212.38,"end":4212.78,"speaker":"Rafe Kelley","text":"Yeah."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":4212.78,"end":4252.71,"speaker":"Jonathan Pageau","text":"And then when it received a name, then that name became a causal relationship. That is now people are. People who weren't doing that before now start doing it because they can. They see in that name and in that communion, they notice a being. They see a being that wasn't there before. That was just a scattered potentiality within gymnastics, within military training, within all these different fields and fit under those Fields. Somehow we're a little strange. Maybe that's why they kind of appeared as this odd thing and then they're rebound in a body with a name. And now here you go. It has a causal. Causal. Causal relationship. Yeah. So now you know what emanation."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":4254.23,"end":4256.99,"speaker":"Rafe Kelley","text":"But the, but the emanation emerges. Right."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":4256.99,"end":4262.19,"speaker":"Jonathan Pageau","text":"It's both at the same time. Right, right. Like it. But it's a reality. Like it's a pattern in reality."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":4262.19,"end":4284.17,"speaker":"Rafe Kelley","text":"Parkour. Right. No, it's not. It was. It was all these implicit things happening in this one specific place. And then somehow it got enough momentum from this bubbling potentiality that it catalyzed into something and then it. Then it received a name. And once it had a name, then it could spread."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":4284.41,"end":4298.76,"speaker":"Jonathan Pageau","text":"Right. So that. This is how God creates Adam. Right. So God takes the dust of the earth. Right. And obviously doesn't. And he gathers it into one place so it becomes a body. That's the emanation part. That's the emergent part."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":4298.76,"end":4299.28,"speaker":"Rafe Kelley","text":"Emergent."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":4299.28,"end":4353.93,"speaker":"Jonathan Pageau","text":"And then he blows the spirit into Adam. Blows the breath into Adam. Is that the logos? That would be the. You could see it as the logos. You could see it just as the pattern. Right. That's what spirit ultimately is. The invisible part. It's the invisible part of that body. The name is not visible and the identity is not visible. The thing that binds it basically and so blows that invisible part into Adam. And then Adam exists. And so it's so, so what you're describing is the same like you. You have. You see all these possibilities that are there. And then someone somehow starts to gather them. They start to gather, to accumulate and. But they're still not something. They're. They're kind of. And then all of a sudden something comes. Like someone. Something names it from above. And now that being has causal. It can now reproduce itself and gather it more into its body."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":4354.25,"end":4391.69,"speaker":"Rafe Kelley","text":"Okay, so that starts to feel like something interesting to me. Right. Because here's the problem with the way that science has described things. Or one of the problems that I see is that it's hard to represent how a thing that comes from emergence or from reduced pieces becomes agentic or causal. Right. So when we, when we run through the scientific story, eventually we run out of human agency or anything having agency. We. We. And I think this is a, like, I think someone arguing that free will doesn't exist is a performative contradiction."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":4391.93,"end":4392.33,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":4392.33,"end":4403.69,"speaker":"Rafe Kelley","text":"Because by arguing with me that free will doesn't exist, you are. You're assuming that I have the capacity to change and that your Action can change me or that I can choose to believe or not believe."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":4405.86,"end":4436.93,"speaker":"Jonathan Pageau","text":"People who don't believe that free will exists, they don't. Maybe they don't realize that they're the most dangerous people in the world. Like, they're so dangerous because if you go to the end of their argumentation, it's a scary thing because you can make people change. And the only agent is some kind of force, whether it's convincing or contriving. That's what ends up being. It's like you recognize the good. And now I'm going to. Because people don't. Aren't free, I'm going to make them follow the good. It's going to be inevitable."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":4437.57,"end":4438.69,"speaker":"Rafe Kelley","text":"So, okay, so you."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":4441.01,"end":4442.65,"speaker":"Jonathan Pageau","text":"Sorry, I take you on a tangent there."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":4442.65,"end":4468.95,"speaker":"Rafe Kelley","text":"Yeah, maybe we'll touch that. I don't know. I wanted to go back to this idea, though, that, that. That within. Within our understanding of reality, we have to have something that allows us to grok. How something that emerges then becomes a causal factor in itself. Right? Yeah, that parkour emerges and then emanates. Right. But in this, in this sense, emergence precedes emanation, right?"}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":4469.59,"end":4544.89,"speaker":"Jonathan Pageau","text":"It precedes it as possibility. And then. But then it does not. Identity is what binds it together. And so you're right. Like St. Gregor Nietzsche says, basically, he says the physical comes first and the spiritual comes after, let's say. And so it's like. It's almost like. It's like desire comes first. You could call it that. A question. It's a question comes first. What is this? Yeah, there's something which is appearing on my horizon, a puzzle. And I'm like, what is this? And then it gets an answer, a name, an identity. And once it has an identity, then it has causal. Causal factor. And so, like, you can imagine it like that. Like you have. You have a bunch of parkour people that aren't yet parkour guys who are noticing, like you're noticing these. A puzzle. It's like, what is this? Like, there's something going on. Like, there. There's something calling. Like, what is. There's. There's something calling from the ground, right? Like asking to be. Asking for a master. Like, asking to be. To be contained. And then once it is contained, then it. Then, like you said it, then it starts to have causal factor. So you can understand, like that. Like a question and an answer. You need both. And the question obviously comes first. Or else why would you speak?"}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":4544.89,"end":4545.21,"speaker":"Rafe Kelley","text":"Right?"}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":4545.29,"end":4573.92,"speaker":"Jonathan Pageau","text":"Like, why would you speak? And you can see it, like, even, like in the way that Christian theology developed. It's always like that. It's like that. There was always a problem first. Like Christian theology never developed as just straightforward, giving, giving, like teaching, like there's a problem and now there has to be an answer. And that answer becomes the road or the way. But the problem always happens first, like the question, the puzzle, let's say."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":4575.04,"end":4605.05,"speaker":"Rafe Kelley","text":"I'm going to back up a second because this just what you described, it hit this so many times. And this is. I just really think the first stanza of the Dao de Ching is so profound. Right. The way that can be spoken is not the eternal way. The nameless is the mother of all things. The named gives rise to the 10,000 things. I think a lot of people from the west, they pay attention to the first two stanzas in that verses, in that stanza, and they forget the name. Yeah, right."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":4605.29,"end":4606.81,"speaker":"Jonathan Pageau","text":"Which is the logos, really?"}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":4607.21,"end":4642.43,"speaker":"Rafe Kelley","text":"Yes. Yeah, I think. I think it is. Right, so you. So you start with undifferentiated potential, or you start with mystery. Right. What we can describe, what we can model is always an insufficient description of reality. And then there's undifferentiated potential. And that's. Everything comes out of that. It has to come out of that. And then in order for it to come out of it, though, it has to become named. In order for parkour to not just be. In order for parkour to grow and spread and become a causal factor in the world, it has to be named. It has to become a defined characteristic of the known."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":4642.75,"end":4746.42,"speaker":"Jonathan Pageau","text":"Yeah. So in the Bible, it's. In Christianity, there's a sense that the undifferentiated get separated into two. So you have the waters below and the waters above. Right. And so the waters below act like, let's say, the undifferentiated in the sense of chaos and potential. The waters above act as the undifferentiated in the sense of something which is beyond, beyond cause that beyond causality or transrational, and then comes down into the name or into. Into causality. And so you can. So it's important to. It's a little important to distinguish those two because they're not. They don't function exactly the same, but they say ultimately, infinitely. They end up being the same, but in terms of our experience, they end up being different. And so there's a space of intuition from which the names come from. And there is a space of potential or chaos out of which, let's say, potential is brought out of. And so then the name comes down and then comes down from heaven and Then manifests itself on the potential. And then you have, then you have a be. But that, that's already there. Like in the, in the, in the dao. You have a sense. You do have a sense in which they don't totally differentiate those two. Like, at least in that first out, that first setting where it's like there's the undifferentiated and then. But there has to be. Anyways, I don't want to go to metaphysics too much. Let's continue on. This would be too complicated. But, but, but just understand at least, like in Christian metaphysics, you have a sense in which there's. There's this separation and then the world kind of exists in this space which is created by the separating of two differentiations, let's say like chaos and like super rational. And then that comes down into the world."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":4747.14,"end":4750.58,"speaker":"Rafe Kelley","text":"So in the Mesopotamian myths, you have Tiamat and Apsu, right?"}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":4750.58,"end":4751.14,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":4751.14,"end":4752.9,"speaker":"Rafe Kelley","text":"The waters above and the waters below."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":4753.22,"end":4753.7,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":4754.26,"end":4773.33,"speaker":"Rafe Kelley","text":"And the clear water. And then, and then in the, in, in Genesis, I believe my camera died. I have to move to my other webcam. It says, God separates the waters. Right. That's like one of the first few things he does."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":4773.57,"end":4800.02,"speaker":"Jonathan Pageau","text":"Yeah. And then the idea is that the joining of the waters becomes the place of life. Like the place of life. And that goes all the way through scripture. It goes all the way even into Jesus talking to the Samaritan woman, and she's next to a well, which is the lower waters. And he says, I will give you a fountain that springs into eternity. So he's saying, I'm going to give you the living water and you're going to be the. The lower water. And then that's how the. That's how the world exists. Like those two joining together."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":4803.06,"end":4891.06,"speaker":"Rafe Kelley","text":"Like, I find this kind of mythological frame to be very useful, and I feel like it. I hit the end of rational materialism. I feel like. Right. I don't. Perhaps that sounds egotistical, but like, when I listen to Sam Harris, I'm like, I get everything you say. It's all coherent within a certain system. But it's like you have decided not to look at this thing that says that you have to step outside of that. Right. And I think essentially, once you really think about Godel's incompleteness theorem and Heisenberg's uncertainty principle, it's like you're stuck. It's like that doesn't work. And yeah, I think Hume's ought in his distinction is true. Right. And we need something else. And so these stories and like, when I listen to you and I would listen to Peterson, I'm like, there is insight there that I'm not getting from. From reading evolutionary biology. Right. Or physics. And I've crafted this idea within my own work of what is the heroic archetype? What are we seeking? So through Peterson, I got really into the idea of the heroic archetype. I was like, what are we doing when we do parkour? We go out and we confront chaotic potential and extract our own character out of it. Basically go do a jump that we've never done before. That's potential, right?"}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":4891.06,"end":4891.62,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":4891.7,"end":4932.35,"speaker":"Rafe Kelley","text":"And through confronting the fear and the challenge and everything that goes along with that, there's something beautiful, some gold, that we take away from that confrontation with chaos. So then I started to ask, what is a hero? Right. A hero is someone who. And it kind of like, through some of Peterson's ideas and other stuff, I came up with this idea that, like. Well, first a hero has to be able to recognize that there's a problem. Like, the first thing you do, the first problem that a parkour athlete has is actually being able to see where the. The problems are. Right? Yeah. How do I go and find places to do jumps? Right. So the first thing is being able to see the problem, and then the second is, like, articulation of it. Right. How do I. How do I recognize what's going to allow me to accomplish this? And then the next."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":4932.43,"end":4963.61,"speaker":"Jonathan Pageau","text":"You have to. Not only. It's like, you have to be able to recognize a holy place, like a place that is capable of receiving. Because if. I mean, obviously, if you're standing in front of a field, it's like that place is not. Does not have the right potential for me to engage in what. In what I want to accomplish. So you need to find, like, a sacred. People are going to be angry that I use that, but relatively at a lower level, something akin to a sacred space that when you see it, you recognize it has the potentiality you need in order to embody something particular."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":4963.93,"end":4989.08,"speaker":"Rafe Kelley","text":"Yeah. I mean, the way that I react, the way that I interact with the trees and the nature that I train in is a relationship of sacredness for me, for sure. It has this sense of helping me transcend and connecting me to something that's beyond. Right. So I have no problem with that, but. And I don't think my audience will. Maybe some of the Christians will, but. Yeah, that's hilarious."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":4989.08,"end":4993.24,"speaker":"Jonathan Pageau","text":"It's like. It's like, here's the Christians using that. You're saying Christians will react to this."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":4993.48,"end":5041.48,"speaker":"Rafe Kelley","text":"So, okay, so first is vision, right. Horus. Second is articulation, say Socrates or something like that. Then the next is emotional wherewithal to be able to confront the problem, to have the equanimity, to stand in front of a challenge. Then the next is the physical strength to accomplish it. And the last is the physical skills to have those embodied capacities and to build all that. It's like. And then as I looked at that, I was like, this describes a human being who's achieved greatness, who's achieved virtue, but it says nothing about goodness. And in fact, you could apply all of these capacities to being evil. A Genghis Khan is probably really good at all of these things, right?"}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":5041.48,"end":5042.36,"speaker":"Jonathan Pageau","text":"Yeah, exactly."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":5043.64,"end":5132.91,"speaker":"Rafe Kelley","text":"And so then I asked, well, what. What is what? What brings us into the Good? And Verve's episode 16 of Awakening from the Meaning Crisis. Agape is the answer. It's the only answer that I've come up with that works. I can't get below that. Right. The only way that I can define the good is being in relationship to reality, such that I am acting from love that wants to bring good into being. That's the highest principle. So then I've like almost got down to this set of axioms of basically, like, you're fundamentally, you have to respect the mystery. You have to accept that there's always going to be things outside of your own capacity to understand. And then you have to be in service of love. Right. And then you have to. To do that through truth and the cultivation of virtue. So that's, that's what I've derived from this. But here's my hesitation and here, here's where I'm trying to imagine myself, especially in the audience perspective. The woman at the well, she represents the lower, Jesus represents the higher. Here's a relationship of hierarchy between male and female. Right. And for. So you have an intuition, let's say that chaos, that chaos maps to the feminine. But for many people, that. That intuition runs maybe the opposite way or that. That. That that creates a reaction of the higher waters. Also map on the feminine."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":5135.31,"end":5164.65,"speaker":"Jonathan Pageau","text":"Well, that's actually in a way, not exactly, but there's a way in which these are the mysteries that we're not supposed to talk about. But let's say that Saint Ephrem the Syrian talks of the womb of God. He talks of the divine womb, out of which the divine persons emerge, which is the divine essence. And there's a very mysterious thing going on there. But anyways, yeah, so go ahead, continue what you were going to Say so."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":5165.77,"end":5188.76,"speaker":"Rafe Kelley","text":"If we take this intuitive approach and then some sort of pragmatism and some sort of multi factor, we still run into the reality that people have different intuitions or different orientations, symbolic systems that they operate within. And there's not necessarily I one, there's conflict there is what it feels like. Right?"}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":5188.76,"end":5189.08,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":5189.08,"end":5253.2,"speaker":"Rafe Kelley","text":"And one reaction to that is sort of, I think the Vervaeke response, which is let's step outside of the narratives and treat them as instrumental rather than existing within them. Right. And then we can have the religion that is not a religion. And then we don't have to deal with the fact that, that the Islamic description, the Muslim description of, of the, of, of Christ is, is not congruent with the Christian description of Christ. Right. Like he, he, he's respected there, but, but the meaning of what he did is impossible to glean from the description that they give. And so, so there, there's inherently a potential for conflict. And I, I don't know if that's the same in Buddhism and Taoism versus Christianity. I tend to think that the same, they're more potentially congruent, but whatever. There are going to be places where that's not where the two systems are going to be in conflict. And how do we navigate those waters without a clearer epistemology? Yeah."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":5254.48,"end":5392.55,"speaker":"Jonathan Pageau","text":"So obviously. Okay, so there are many things to say. One is that we can only perceive the pure pattern from an embodied place. And, and to pretend that you can, or to pretend that you are leaving, that is to delude yourself. This is what I think. And so I think that the position, or the universalist position of saying I'm going to step outside of these narratives in order to be able to see them all is, is a delusion. It's still a narrative. It's just that you don't, you don't see it. It's the, it's the narrative, the Tower of Babel. It's the narrative of, you know, and it, and it doesn't. And what it leads to is it actually will lead to, to fragmentation. It'll lead to a breakdown, the desire to kind of lead to not having a common, not having a real common narrative. And so therefore it'll be like a competition. That's where it's going to be even more so, a competition of narratives. Because you have to embody something like you have to, you have to be in the, in a path. Like you have to be on, on a road, going somewhere. If you say like I'm going to stand above all these roads and I'm going to say, well, actually I noticed that all these roads lead to the same place, but you're not, you're not doing it. You're not on the, you're not actually doing it. So that's one thing, like, that's one thing in terms of the, of, of that, of that, of that problem is I think that the idea of saying that someone is going to not engage or kind of rise above is it's, it's similar to Bret Weinstein when he says it's similar to Sam Harris or it's Brett Weinstein when they, when they say something like, don't you see, like when, when Brett Weinstein just says, don't you see that this is obviously moral? And you're like, what, you don't see your own story. Like you always are. You're in a story. To me it's just inevitable. Unless you're like in the mystical vision. Like once you, like if you enter into a mystical vision and you enter into, let's say, kind of this, this moment of pure transcendence where you're completely united with God, completely united with the infinite in every way, then yes, but then when you, when you talk about it, when you come back down, you still, you now have to give it flesh and body and story. It has to retake body and flesh for it to exist."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":5393.11,"end":5463.21,"speaker":"Rafe Kelley","text":"So where, where I get really caught in this, in all these discussions is again, as it comes back to scientific epistemology, works and delivers truth in a certain way, but it doesn't deliver all the truths that we need. But if we adopt any other system that collapses, that then it's really a problem. Right? So we have to do that. And where I get hung up is I've said that I think I'm a non theistic Christian. And the I think part is a really important qualifier. And I can go a little deeper there, but when I listen to a lot of Christians describe their relationship to the resurrection, what I hear them doing is trying to operate a logical coherent system that looks something like science where they're making all of these exceptions to how they would treat a actual scientific question. Right. And so in terms of the resurrection of Christ, you mean. Yes, yeah, yeah. What, what I tend to think is that's it."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":5463.21,"end":5576.56,"speaker":"Jonathan Pageau","text":"But that's also because, like, look, I don't deny that sad state of Christianity. Like, I really do not deny that. I think that Christianity has become, you know, with one of the reasons why it has led to where it is. I think it's part of the bigger story. I've talked about this many times before, but it's nonetheless happening like Christianity is dying. And it's. And, and in part of that is, has been Christians embracing of a really strange materialism and a kind of scientism as their worldview. And so the idea of understanding the resurrection is you have to understand the resurrection as, okay, as something like strong emergence. You could say, like something. As something. As a phenomena which actually gives you the key to all phenomena. And so it can't completely act on the same level as the phenomena that it's giving the unity to. And all miracles are like that. Miracles are not just weird, are not just like weird, exceptional things that happen. That's never the case. It's not just like something unexplainable happens and that's a miracle. Miracles are not. That's not what they are. Miracles are always higher up on the level of pattern. That is, they're actually embodying the pattern of reality at a level beyond the normal usual levels of causality. And so what it looks like is actually looks like. It's like it's pulling in the multiplicity into itself in a way that doesn't seem to make sense at the lower level. Just like qualities of certain beings. If you try to look at just the lower elements, when you, you're like, well, this doesn't make sense. Like, why is water wet? Oxygen and hydrogen are neither of those, you know, and so how is it that I get to wet? You can't find it there."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":5576.56,"end":5577.68,"speaker":"Rafe Kelley","text":"It's emergent, right?"}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":5577.68,"end":5601.05,"speaker":"Jonathan Pageau","text":"It's like, but it's a strong emergence because. But it's more than that. It's not arbitrary, because that looks arbitrary. Like the miracles of Christ and especially the resurrection is like, once you realize that, let's say once you, you see resurrection, then you're like, actually, you know what? That's how reality works. Resurrection is something that I see every day. I see resurrection all the time."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":5601.21,"end":5652.83,"speaker":"Rafe Kelley","text":"I get that symbolically, right? I do. I mean, like, when you describe it, it makes total sense to me, but it doesn't establish to me in any sense that I could believe that Christ died and was resurrected in the same way that I believe that my dog is scratching itself behind me or that, or even that, that. That evolution happened, right? Because I can verify aspects of evolution in a way that I can't verify that story. And you're, you're, you're, you're making an argument from a sort of. It makes sense of things, right? It's like the CS Lewis argument like it. It's a key to actually comprehending so therefore there's a truth to it. But, like, you're not a biblical literalist, right? You don't believe that, that the description of Genesis is true in the sense that it falsifies the existence of dinosaurs?"}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":5655.07,"end":5661.19,"speaker":"Jonathan Pageau","text":"I don't think that. I don't think that the description in Genesis is a scientific description. If that's what you. If that's what you want."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":5661.19,"end":5663.15,"speaker":"Rafe Kelley","text":"But. But I think it's true. Descriptions."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":5663.23,"end":5666.83,"speaker":"Jonathan Pageau","text":"My goodness. The best way to describe the world is in Genesis."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":5667.31,"end":5672.91,"speaker":"Rafe Kelley","text":"Is. That is the. Is. Is. Is the death and resurrection of Christ true as a scientific fact?"}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":5675,"end":5681.56,"speaker":"Jonathan Pageau","text":"Well, you mean a scientific fact in the sense that you could prove it scientifically. How could you prove it scientifically? It happened 2,000 years ago."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":5682.28,"end":5697.16,"speaker":"Rafe Kelley","text":"Exactly. So here's my perspective on this. I feel like a lot of Christians feel like that has to be asserted with certainty within. And then they're within that materialist frame. And I don't exactly know your relationship to this. I haven't. I don't know."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":5697.16,"end":5704.12,"speaker":"Jonathan Pageau","text":"But I believe the resurrection is real. I believe that it happened. I believe that the description that are in Scripture are the best way to describe what happened."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":5704.45,"end":5741.26,"speaker":"Rafe Kelley","text":"So let me, let me ask you if this would make sense, because the way that I could imagine myself relating to this and I don't precisely relate to it this way is something like I need to have access to scientific epistemology. And if I operate that system and I ask the question of Christ's death and resurrection, the answer I get is probably not right. But I know that that system itself is incomplete and it cannot tell me for certain what's happening. Now there is a broader ontology that I exist within that I think within. And in order to, to make my ontology work, the resurrection actually is key."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":5742.7,"end":5748.38,"speaker":"Jonathan Pageau","text":"So, so my question. So let me ask you a question, like, have you ever experienced a miracle?"}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":5748.78,"end":5749.18,"speaker":"Rafe Kelley","text":"No."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":5749.42,"end":5769.19,"speaker":"Jonathan Pageau","text":"Okay, so have you ever experienced, had an experience where the world around you, the causality around you, which was not related to your experience, all of a sudden merged with your experience? I, like, like, like, like."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":5769.59,"end":5770.23,"speaker":"Rafe Kelley","text":"That doesn't."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":5770.31,"end":5776.87,"speaker":"Jonathan Pageau","text":"I don't know what Jung call synchronicity, if that ever happened to you, where the inside and the outside, like, join together?"}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":5777.67,"end":5821.33,"speaker":"Rafe Kelley","text":"I mean, I have had moments where it seemed like. So I interviewed Paul Vanderklae recently, right? And Paul had been talking about superhero stories, and he published a superhero story the day that Jordan Peterson was satired as Red skull by telling D.C. coats. The day that that came Out. It's like, well, that's a strange coincidence. And I've had those strange coincidences happen in my life. Now, as someone who's trying to operate within rational materialism, I just think coincidences happen. Right? So when people talk about synchronicity, that feels like they're operating some kind of epistemology that doesn't make any sense to me. All right."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":5822.53,"end":5840,"speaker":"Jonathan Pageau","text":"Well, I guess it's hard because if you haven't, like, I mean, you've had little experiences like that, but there are moments in your life. Like I think most people have these moments where the, the outside world and the, the inside world seems to come together, where all of a sudden the world outside seems to be wanting you to see something."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":5840.8,"end":5842.72,"speaker":"Rafe Kelley","text":"Oh, yeah. I mean, I have those experiences."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":5842.88,"end":5846.08,"speaker":"Jonathan Pageau","text":"And why don't you believe them? You don't. What do you. Why don't you believe them?"}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":5847.04,"end":5885.33,"speaker":"Rafe Kelley","text":"Because what I understand about the way the human mind works from an evolutionary perspective makes me skeptical of our story making and pattern making behavior. Right. We know that this can mislead us in important ways. Right? And when I see people, and this is the other, the flip side of that, like the background that I talked about, when I see people who become, who fall in love with this story that they have in their mind of how reality is laying itself out and making them, giving them some sense of transcendence, those people become very dangerous to me and very likely to be full of shit."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":5885.65,"end":5997.53,"speaker":"Jonathan Pageau","text":"Yeah, well, that's also because usually they're not embedded in like a bigger pattern. Like, they usually don't have some. They don't deny part of a, A normal. But what I'm trying to, what I'm trying to try to get you to see is that there are moments where there is a causality of meaning which happens and that the, the, the multiplicity of the world in its mechanical causalities doesn't account for the causality of meaning, doesn't account for the fact that, you know, all of a sudden, like, I have to deal with certain problem and all of a sudden everything around me is screaming at me. Like everything I see is screaming at me to deal with this problem. Like, it. All these weird accidents, all these weird things. And there's like this, this moment where all of this kind of comes together. And I can only see that as having. It can only be reasonable if I understand that it's, it's, it's joined together as a body, right? It's, it's Jo. All these multiple elements are joined together as a body and they're waiting to be. They're waiting to find a name, let's say. And so that's actually. It's kind of like that's how. At least that's how. So, I mean, a good example. Like, let me find another. Let me give you an example from what I gave you before. It's like Constantine founds the city, right? And then all of a sudden, it becomes a city. But the mechanical causality, like the guy. The cart with the wheels and the guy driving the cart, like that mechanical causality has nothing to do. His cart is going to Constantinople to become part of that city. But all the mechanical causation has nothing to do. You can't find it in the mechanical causality. The reason why he's going to Constantinople, the reason why he's going to Constantinople is in the meaning."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":5998.9,"end":6001.7,"speaker":"Rafe Kelley","text":"I'm not sure that's true. I mean, I think so."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":6001.7,"end":6056.86,"speaker":"Jonathan Pageau","text":"That's a little part. But, like, the thing is that sometimes that becomes bigger. Like, it actually becomes bigger, and it starts to. It starts to grow into and to accumulate in ways that can only be described as miracles. And so it's like, if you've never experienced that. I don't know. Like, I've experienced it quite a bit, and. But I don't know, like. And so what I would tell you is that the resurrection is like the. The. Is the keystone of that process is like the top version of that, because it actually reveals how death can come together and become alive. Like how something dead, things that don't have any coherence with each other can join into a body and that they can find life. Like, that's what. That's basically what resurrection is. And so anyway, so there's no way that I'm going to. And I'm going to like, convince you in this discussion. And we've already been going for two hours anyways. I should probably go."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":6056.94,"end":6110.94,"speaker":"Rafe Kelley","text":"Okay. Yeah. One thing Revaeke says that I really like is people have mystical experiences, say, on psilocybin or whatever, and they come back and they have the sense that they had the most profound meaning that they've had in their life. And they have a lesson. But those lessons can be completely incongruent with each other. And the positive impact on somebody's life is the same whether they come back and say, God is definitely real or God is definitely not real. So this sense of the miraculous, maybe it's just broken in me. The cognitive anthropologists say that the origin of religious belief is overactive agency detection. And that's an Evolutionary feature. And that's reasonable to me. And maybe I have less of that than other people. I used to think that."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":6110.94,"end":6129.26,"speaker":"Jonathan Pageau","text":"Listen to what they say. It's hilarious. Listen to the terms they use. Overactive agency detection. Like, on what ground do they stand to, to, to tell us what the limit of agency is like? Do they even know what agency is like? How are they even saying that?"}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":6129.74,"end":6135.39,"speaker":"Rafe Kelley","text":"I mean, so seeing a face in a cloud, is there an actual face in the cloud?"}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":6135.39,"end":6142.91,"speaker":"Jonathan Pageau","text":"Or does your brain, from an evolutionary standpoint, is there an actual face in front of you? Like, if I look at your face, is there a face there?"}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":6143.39,"end":6144.67,"speaker":"Rafe Kelley","text":"There's pixels on the screen."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":6144.67,"end":6181.64,"speaker":"Jonathan Pageau","text":"Have you ever, have you ever, have you ever had the experience of not recognizing someone, you know, and then all of a sudden you recognize them and they become the person? Like, is that, is that scientifically, materially, is that real? Like, a face is not a, Is not a material, is not a scientific concept. A face is meaning. And so the idea of seeing a face in the cloud, why an evolutionary biologist would be bothered, why would see that as less real than seeing the face in front of you, to me, is mind boggling. Like, why is it seeing a face in a cloud less real in terms of pure biological understanding? Because there is no reason for these."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":6181.72,"end":6195.06,"speaker":"Rafe Kelley","text":"In terms of evolutionary, pragmatically, me interpreting your face as a face allows me to interface and interact with you. Whereas if I try to do the same thing with the cloud, usually that's considered craziness."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":6195.78,"end":6197.46,"speaker":"Jonathan Pageau","text":"I mean, you never see the face in the cloud."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":6197.7,"end":6203.22,"speaker":"Rafe Kelley","text":"Well, I've seen a face in the cloud, but I don't talk to it and I don't hear it talking back to me."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":6204.42,"end":6207.86,"speaker":"Jonathan Pageau","text":"But let's say that that would happen. Like, let's say that that could happen."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":6208.26,"end":6208.66,"speaker":"Rafe Kelley","text":"Sure."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":6209.3,"end":6243.91,"speaker":"Jonathan Pageau","text":"That might have a causal. It might have a causal function, especially in a world that is totally coherent, in a world that's completely coherent, that might have a causal function that you might struggle to understand. Like seeing a cosmic face or seeing a bigger face and that face informing you of some meaning. I think that biologically, just in terms of evolutionary thinking, I think that could happen and that it could be a way for a group to cohere and it could be a way for. It could do all kinds of things."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":6245.11,"end":6247.83,"speaker":"Rafe Kelley","text":"Well, yes, and it could be real."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":6247.83,"end":6250.87,"speaker":"Jonathan Pageau","text":"Like, it could be, it could be really. You're really seeing a face in the cloud."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":6251.75,"end":6252.87,"speaker":"Rafe Kelley","text":"I don't know about that part."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":6253.19,"end":6258.79,"speaker":"Jonathan Pageau","text":"As real as seeing your face. Like, like I'm saying a face doesn't exist. In the material world."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":6258.87,"end":6259.47,"speaker":"Rafe Kelley","text":"Well, it does."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":6259.47,"end":6262.79,"speaker":"Jonathan Pageau","text":"Face is a. Is a. Meaning is a. Is a. Is a. It's a way."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":6262.87,"end":6295.36,"speaker":"Rafe Kelley","text":"Right. Because. Because, like my face or your face, they're made up of muscles and bone and blood and nerves, and they exist through an evolutionary process to give us the capacity to see and smell and eat and now to express to each other. Like, human faces are way more variable than, say, wolf faces. And it's because we need the ability to easily recognize each other through vision and the ability to then communicate effectively through faces. Okay, so a face."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":6295.36,"end":6302.2,"speaker":"Jonathan Pageau","text":"I know. I've got it, I've got it. I've got it. Listen to this. Listen to this. Okay, so can an emoji have a causal effect?"}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":6303.08,"end":6303.56,"speaker":"Rafe Kelley","text":"Yes."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":6303.8,"end":6305,"speaker":"Jonathan Pageau","text":"Is there a face there?"}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":6305.48,"end":6306.76,"speaker":"Rafe Kelley","text":"No, there's a symbol there."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":6307.16,"end":6316.92,"speaker":"Jonathan Pageau","text":"But we recognize it as a face and it has causal effect. Like, it can actually change the way you act, change the way you feel, change the way you interact with. With the. With what you're seeing."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":6317.08,"end":6317.52,"speaker":"Rafe Kelley","text":"Yes."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":6317.52,"end":6323.43,"speaker":"Jonathan Pageau","text":"And so the same for a face in a cloud. Like you see a face in a cloud, it can have a causal effect. And it's a real causal effect. Yeah."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":6323.67,"end":6330.79,"speaker":"Rafe Kelley","text":"No, but it's not a real face. An emoji has a real causal effect, but it's not a real face. Right."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":6331.91,"end":6343.83,"speaker":"Jonathan Pageau","text":"So I just find that funny that you're saying that, like, as a materialist, I find it funny that you would say that an emoji isn't a real face, but this, like, sack of flesh in front of me, that's a real face."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":6344.95,"end":6352.27,"speaker":"Rafe Kelley","text":"Well, the emoji contains aspects of what a face is because it's a symbol, it's a faces."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":6352.27,"end":6379.09,"speaker":"Jonathan Pageau","text":"So let me. Let me. Face is a pattern, face is a pattern. That's what a face is. And so the face is a pattern that has. That has. It embodies itself in the people around me so that I can recognize them, but it's a pattern. And so if I draw a face on a piece of paper, I'm. I'm also manifesting the pattern you represent, at least, and I recognize it. And it can have causal. And it can have causal effect. Sure. Like, if I. Yeah."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":6379.09,"end":6408.86,"speaker":"Rafe Kelley","text":"So to go back to just. Just to go back to active agency detection, the idea is that you hear a bear in the woods. If it's possible that there's a bear in the woods, whether it's there or not, and that this is. Was important to our survival and that this. The way that. That. That that mind was built, then inclines us to this capacity for religious Belief. I used to have a sense that that aspect of me was just not as turned up as some other people. Right."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":6409.26,"end":6409.74,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":6410.86,"end":6449.28,"speaker":"Rafe Kelley","text":"I think that may just be hubris. Right. Another way to, to, to interpret my particular worldview is just that I've trained myself very intensely to view the world from a specifically rational, materialist frame for whatever reasons. Right. As a reaction to all the crazy hippies around me. Um, but, but, but, but the thing is that when you talk about the, the pattern sort of, boom, synchronicity, all that stuff, I don't have any way, I don't have any way to, to sort that from hearing the same thing from my hippie friend who just went on a dh."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":6449.28,"end":6475.7,"speaker":"Jonathan Pageau","text":"Yeah, I understand. But the emoji, the emoji example I gave you is probably a really good one in the sense that that emoji has. It's just a bunch of pixels or ink or something on a piece of paper, but because it participates in a pattern, it can have a causal effect on you. And so it's actually doing that. It's a little miracle. Like a very little one. Yeah, very, very small one."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":6476.42,"end":6490.83,"speaker":"Rafe Kelley","text":"Well, this is then the, well, this is where we get into the question and we're going to probably, I'm going to say the problem and then we'll just going to let it go because we can't go into. But the problem is, is the pattern just emergent from the human mind or is it something more?"}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":6491.07,"end":6525.25,"speaker":"Jonathan Pageau","text":"And that, I mean that, that question to me doesn't mean anything like it. Well, because it's like, is it just. What's the. Every time someone use the words just to me, it's like I, I, it's like a little, it's like a little itch that I have. It's like, what does that mean? Just emerging from the human mind is part of reality. It's like. So there is no just emerging from the human mind. It has to be. The human mind is there, it came about and so it's part of the world. So it can't be just. There's no just."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":6525.73,"end":6538.29,"speaker":"Rafe Kelley","text":"So hopefully this works. We'll see. We'll see. It'll be interesting. Ivan and Alyosha Karamazov, right?"}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":6538.29,"end":6538.69,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":6539.45,"end":6552.73,"speaker":"Rafe Kelley","text":"They're not real human beings or we're not real human beings. They represent things that are real and powerful and important and they have causal impact on the world. But they were never flesh and blood human beings."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":6552.97,"end":6564.17,"speaker":"Jonathan Pageau","text":"Right. They're not the same. They're not the same level of, they don't have the same level, they don't have the same level of existence as you do. They have a different type of existence."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":6564.57,"end":6576.89,"speaker":"Rafe Kelley","text":"So, so they are characters, let's say, that are that whose meaning is utterly collapsible to human psychology. On one level maybe."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":6577.29,"end":6612.6,"speaker":"Jonathan Pageau","text":"I mean, the reason why we recognize them as having value is because they're embodying things. They're embodying patterns in a way that resonate with us. Right. So it's not just, they're not just collapsible to human psychology is that they're, they're embodying patterns that we want to attend to. Yeah, right. And there's a reason why we attend to things. Attention is not arbitrary. Like, it's not just, it's not just reducible to human psychology. It has to do with a whole level of things that make us exist in the world or not exist. And there's, you know, there's a bunch of stuff."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":6615.88,"end":6671.17,"speaker":"Rafe Kelley","text":"So, so, so I have this, you know, I would say I'm a non theist, right. In the sense that I don't think that the objective, the question of the objective existence of God is answerable or particularly fruitful. Right. But I would say that I feel fairly certain within a rational, materialist frame that God is a psychological reality of human beings. But within that same frame, I can't claim that it's a object outside of me. Like, I believe that if I walk by a tree today and I leave and walk somewhere else and it's no longer in my field of attention or, or awareness, the tree doesn't disappear. Right. It's not simply a psychological aspect of my existence. It is, it obviously a lot of what it is to me is psychological and symbolic. But the tree's still there and that's, that's materialism, right?"}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":6671.17,"end":6677.53,"speaker":"Jonathan Pageau","text":"Yeah, yeah. But God is not there. Like God is not outside of your frame. God is not. God is not a thing."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":6677.77,"end":6678.25,"speaker":"Rafe Kelley","text":"Yeah."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":6678.25,"end":6719.65,"speaker":"Jonathan Pageau","text":"God is not a thing. And this is like this a totally orthodox. Like I always tell people, if you think God is a thing, then I'm, I'm, I feel better telling you that God doesn't exist. Like, if that's what you think, if you think existence limits itself to things that can be identified and quantified and all that, then I would say God doesn't exist. Because even in the very traditional Christian theology, God is as the source of all being. God is beyond name, beyond characteristics, beyond. That's what God is. God is the source of characteristic and being and, and all names and all essences. You know, come from that infinite non being and non being joined together. St Maxwell says God is being and non being."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":6720.93,"end":6728.37,"speaker":"Rafe Kelley","text":"Do you think. Do you believe or. Yeah. Do you believe that God has self awareness in a sense that we would recognize?"}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":6730.05,"end":6768.36,"speaker":"Jonathan Pageau","text":"How can I say this? Like the best way to understand that would be to say that I believe that God has what you would call something like infinite awareness. And our awareness is actually a participation in that infinite awareness. Like our intelligence comes from God. And so it's like. Because we can't. That's how. That's actually the best way to me to explain consciousness because it's very difficult to explain consciousness. Consciousness emanates from an infinite consciousness and that we are. We are sparks, let's say that our personhood is a spark of the divine."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":6769.4,"end":6787.24,"speaker":"Rafe Kelley","text":"So I don't think Google has a consciousness. Right. Or self awareness. Google does not. Does not think about being Google. There's no inside of the Google experience. It's an intelligence and it is causal and it is an agent that we interact with. But it's not self aware."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":6787.4,"end":6789.32,"speaker":"Jonathan Pageau","text":"But you also can't verify that in anybody."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":6789.32,"end":6791.76,"speaker":"Rafe Kelley","text":"No, I cannot verify that. I don't know that that's true."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":6791.76,"end":6795.6,"speaker":"Jonathan Pageau","text":"I can't verify that in you. Like I can't verify. Right."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":6795.76,"end":6797.36,"speaker":"Rafe Kelley","text":"I could be a philosophical zombie."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":6798.72,"end":6800.4,"speaker":"Jonathan Pageau","text":"Rafe, I need to go, man. I'm sorry."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":6800.56,"end":6801.88,"speaker":"Rafe Kelley","text":"No, this is."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":6801.88,"end":6814.16,"speaker":"Jonathan Pageau","text":"I think we should. We should like. I loved. I really enjoyed. I enjoy our conversation, but should probably. We should probably set up another one because I think. Because I think we. We. There are more places to go, but I actually. I need. There are other things I need to do."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":6814.16,"end":6825.56,"speaker":"Rafe Kelley","text":"I also need to go. Um. I'm glad that you. You enjoyed it. I felt like this was really fruitful. I stayed pretty close to what I was hoping, but it definitely went in different directions and. And I really enjoyed it and I look forward to. For future conversations."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":6825.64,"end":6843.56,"speaker":"Jonathan Pageau","text":"Yeah. And I will definitely be. I'll really be happy to share this. Cause I do feel like you. I do feel like you are making like a real genuine like effort to understand what I was talking about. And I feel like you're. I feel like you get it. At least most of it, let's say. And so that brings me joy, I guess."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":6843.8,"end":6862.65,"speaker":"Rafe Kelley","text":"Awesome. I'm glad that I could provide some joy and hopefully a better bridge because it didn't feel like it was getting built. And I. And I think I'm genuinely really impressed by the power of your insights and I want people to be able to absorb them and not get tripped upon the language. Yeah. Yeah. I appreciate it. Thank you very much."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":6862.65,"end":6865.37,"speaker":"Jonathan Pageau","text":"All right, let's set up another time for another discussion."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":6865.37,"end":6866.33,"speaker":"Rafe Kelley","text":"Absolutely. Thank you."}
{"episode_id":"SW - #170 - 2021-08-15 - Bridging the Symbolic and Scientific Worldviews (EMP Podcast)","start":6866.33,"end":6933.45,"speaker":"Jonathan Pageau","text":"All right, bye, Jonathan. I hope you enjoyed this episode of the Symbolic World. The Symbolic World is edited by Justin Ward and it is based on a series of videos that you can find find on my YouTube channel, Jonathan Pageau's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by, of course, leaving a review on itunes. Everybody knows that's the best way to get the podcast out there to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon Pajot videos as well and on subscribestar. All those links you can find on my website or in the show description. So thank you and I will see you soon."}
