{"episode_id":"SW - #141 - 2021-02-15 - December Q&A","start":12.56,"end":6194.92,"speaker":"Jonathan Pageau","text":"This is Jonathan Peugeot. Welcome to the symbolic world. So I am in a seriously very slow mood. Yes, I see in the chat new house. This is my future office slash studio for now. It is an absolute insane, crazy mess with a bunch of stuff because we, my family and I went nuts trying to just be in this house for Christmas. Do we work like mad the last week? That's why you probably didn't see me much online. Just not involved at all trying to make it for Christmas. And we did. We were able to put up the Christmas tree on the 24th and wrap our presents and prepare everything. So, yeah, so we did it. And then the last few days have just been winding down with the kids and the family, you know, kind of taking in this return to our house, which is kind of a new house because everything is. Everything is different, everything is new. So it's pretty amazing. I actually feel like I'm on vacation because it's. It's just very odd to just be back and feel home. I really feel like I'm back home, which I haven't felt like that in quite a while. So it's pretty amazing. So I'm pretty excited. I'm pretty excited to be back. I feel tired and rested at the same time. And yeah, I know so many people who, who will be watching this have been involved. You know, I've thought about my family. I prayed for our family. I have, you know, send us their, their wishes and also even have helped financially. You know, quite a few people helped us out when the flood first happened, which really kind of helped us get through those first. Those first months that were kind of crazy and chaotic and, and helped us even to, to. To fix the house. And so here we are. All right, guys, so this is the last Q A of 2020. The greatest. I'm not good at sarcasm. The greatest year. This year has just been so crazy. I guess I kind of said it would be crazy, but I can't get over how crazy it's been. And, and I think the thing about it is that it's going to get worse and that 2021 is probably going to be worse in so many ways, which is very annoying. And so, and so we'll see what happens. We'll see what happens. At least we can get through, see what happens next week or the next few weeks. You know, with the US Political situation, with all the lockdowns we're in, we're on lockdown now. You know, they locked everybody down for Christmas. No one's allowed to visit anybody in Theory. And, and so, yeah, so it's, it's just, it's just a crazy time. But we will do our Q A and hopefully it'll help us think of other things. So, Shane Artisan says 2020, the dumpster fire that keeps on giving. Joe Scott. Yes, indeed. The thing is that at least if you, if we had the sense that it was going to end, it would not be so bad. But it doesn't seem like it's going to end. It seems like it's going to continue. All right, so here we go. We're going to start and hopefully everything will be okay. And so like I said, this is going to be my new studio. I even have a new camera, which I'm not using tonight because I'm not totally sure how it works yet. I actually set up my computer this morning and I kind of set everything up because I had a. I had a meeting this morning. I hadn't turned on my computer since Christmas. So it's actually a good sign. It means that I actually did get some rest. And so. And so hopefully this will be a nice spot. All right, so I'm going to start with. So no questions on subscribestar. I've been kind of pointing people away from subscribestar. If you're, if you're on subscribestar, I, you know, it'd probably be better to Support me on PayPal or through Patreon just because SubscribeStar has been odd and, you know, it's hard to understand how it works. Nothing is clear in the way that it's described. And I, they keep telling me I'm supposed to get so much money and then I get like half or a third of it. And so it's just odd. They wrote me an email trying to explain it, but it's just still odd the way they're presenting. So I don't. Yeah, I mean, I'm still going to continue there as long as some people, you know, trust that platform. But I don't think it's not. It's not my favorite, I have to say. Okay, and so here we go. I will start with Nico says, to which saint do you pray most often, except Mary? And so I think that would probably be a toss up between Saint Maximus the Confessor and Saint Christopher, obviously. And so Saint Maximus is my patron. It's actually my, it's actually my name. My orthodox. My baptismal name is Maximus or Maxim in French, I guess you would say. And. And then St. Christopher. That's obvious if you watch my channel, you know, that I'm very close to St. Christopher. All right. Nomad in Socks asks. So I've been trying to understand and summarize the broad strokes, the points you have been making about ritual and symbolism. Could you tell me if I have this right? Ritual is used to bring those with knowledge down into feeling, thus motivating them into action. Symbolism is used to bring knowledge down to those who primarily feel, thus directing their emotions. Yeah, I'm not sure. That's not. That's not really. So. Ritual helps the thinker feel, and symbolism helps the feeler think. Thank you for all you're doing. God shines for you. I think it's. It's. That's probably not the best way. At least that's not the way that I would phrase it. I can kind of understand what you're trying to do there. But symbolism, Ritual is mostly just symbolism in action. It's just embodied symbolism. And so symbolism is just the way in which multiplicity comes into unity, and then you can still see the multiplicity in that unity. That's. So there's a pattern by which that happens. There's a hierarchy by which identities manifest themselves. And that ends up being the symbolic structure, the kind of image of everything that I showed you. It happened in a fractal way at every level. And then ritual is enacted, symbolism. And so there are some versions of some aspects of reality which appear to us more condensed, you could say. So you can kind of see or experience or participate in the pattern in a. In a kind of more direct way or a more concise way. And that's usually what we'll call symbolism. And in terms of action, then that's what we'll call ritual. Hope that makes sense. Nomad in Socks. All right. And so I'm happy to see that Neil the Great is there as Dirt poor Robbins in the chat. Marianne Ul is there as well. That's cool. I. Look, I can pay attention to the chat. Look at me. I'm getting better at this, you know, probably because there's less people there. It's not going as fast as it does sometimes. All right. So Bogdan asks. I finally got around to listening to Lord of Spirits after hearing it recommended all over the place. Thanks for bringing it. Bringing awareness to it. It's been blowing my mind. Yeah. The context the show provides makes the Old Testament stories much more understandable and gives them a great depth, particularly regarding gigantomachy and fallen spirits. However, this context also makes it feel more distance, more distant from the present time. How do we have conversations about these ideas, both with non Christians and Christians who are not necessarily aware of this context, in a world where the very existence of these entities is considered laughable. I love your conversation with Rationality Rules and Adam Friended, and they were, I think, important steps toward answering this question. So I think that a good way is to, to see what I'm doing. I guess, like what I'm doing, this is what I'm doing. I, I kind of joke and say that if I, if my work, if the, the things that I'm doing can make it so that when you listen to the Lord of Spirits podcast, you understand what they're talking about and it doesn't just sound like science fiction or some kind of fantasy novel, that it actually sounds like a description of reality, then I think I, I've done what I need to do. And so I, you know, I think that I, I'm constantly trying to give example or show the way that being manifests itself in ways that are more immediate and more easy to kind of grasp. But then ultimately that should lead you to understanding these ancient stories and to see how they're really describing reality, you know. But I was talking to Father, Father Andrew about this just a few days ago because I'm going to be on one of his podcasts, like a long form interview. And I was, I was talking about how they really tend to stay in the mythological mode quite a bit. Whereas I try to bridge the mythological mode with the kind of more modern scientific way of thinking, or I try to be attentive to the way that modern people think and try to help them kind of bridge into the mythological mode. But obviously the mythological mode is more, is better because it's, because it's actually something you can, you can be in like it's a story you can be in. And a lot of the things they're saying really help. Like, they're just so helpful. You know, I keep coming back to this idea that Father Stephen, if Father Stephen keeps brought up, which I guess I should have realized that before I didn't realize it is the idea that the relationship between the sons of God and women in Genesis is just, it's a ritual relationship that is, that it's, it's done through secondary causes that there are rituals that bring about, you know, that embody these, these entities into the world through kind of sexual relations, ritualized sexual relations. And it's like, I can't believe I didn't ever thought that that's what he was talking about. I read the Hammer of Witches Last year, for those who are on Patreon, you probably saw my video on that. You know, I read the Hammer of Witches and in that, that they basically say the same thing. They say that there is no possibility for a demon and a human human to have a relationship, but it has to happen through secondary causes. And some of those are, you know, kind of these ritual relationships. They. They also mentioned other secondary causes, but it has to happen through secondary causes. So anyways, so I'm really excited about, about the Lord of Spirits podcast. Everybody. Check it out. It's definitely worth listening to. And it's just the more they, the more they go, the more they're able to kind of bridge. You know, they say some wild stuff. Like they're really saying the things that I wish I could have been saying quite a while ago, but that I, that I always like, feel like I need to prepare people and they just got to dive in, which is great for people who are ready. You know, I think it's wonderful. So Timothy Aspelslaw says, hey, Jonathan, in the work of art in the age of Mechanical Reproduction, we. What does Benjamin, Walter Benjamin mean when he states the following? Fascism leads logically to an aesthetization of political life which culminates in war. Communism. Communism's reply is to politicize art. Yeah, well, I think that Benjamin is right when he. His opposition of communism and fascism is quite. Is quite right. And I think that's something that Jordan also really, Jordan Peterson was really able to grasp on and to be able to show how they're really these two opposites that manifested themselves. You can imagine that the fascist tendency or the nationalist tendency is to try to swallow politics up into something like identity, but then that also ends up being something like beauty in the sense of pattern. Right? And so you can imagine that the. Because the, the fascists or the Nazis especially kind of obsessed with a. A manifest order. And so, you know, the idea of the, you know, the giant, the huge area filled with people in perfect squares and, and this, this, this kind of idea of the procession, you know, this, this almost fetishization of the, of the military march and the procession and all the pomp that goes with, you know, that kind of imagery is something which was taken to really high levels in the. In fish. In fascism. So you can understand why for a fascist, politics would be. Would be kind of swallowed up into identity and beauty and you know, and this kind of aesthetization that he talks about, which is, which is actually quite superficial, but nonetheless can. Can have an effect on you. Whereas Benjamin, Benjamin, I need to pronounce his name right. Benjamin is always showing how his side, which is the communist side, he's. He was a communist, is always trying to destroy the patterns, is always trying to use mechanisms to destroy the appearance of being, basically. And so for him, all these things like mechanical reproduction, mechanized culture, was a way to destroy pattern. And so art became just another kind of political, a political tool which was used especially with mechanical reproduction. So you can imagine propaganda, you know, printed posters and, and kind of this mass art that was. That was available to everybody was a way to take away the. Take away the glow. You know, I talk about sometimes the glow of something which is special or that, you know, this glow that you get when you see the cup that your grandmother gave you and that it has a layer on top of just the. Just the regular cup. And so there's something about it which makes it stand out. And that's what Benjamin and the communists were trying to destroy. So. All right, so Tara Thomas asks, would you consider Tolkien and. Or C.S. lewis Symbolic Thinkers? If so, why. It's interesting. I've been thinking about that for some reason recently. I don't even know why I've been thinking about it quite a bit. I think that I'm. It took me a very long time to really understand Tolkien, why Tolkien was so adverse to saying that his work was allegorical, whereas C.S. lewis's work is very allegorical. And I think that it's actually because Tolkien is more a symbolist in the sense that he talks about how he wants his stories to be applicable. So he doesn't like the idea that his story represents something else, but he likes the idea that his stories can be applied to situations. And I think that that's a great way to understand symbolism, is that he's creating a story which is patterned in the right way so that then you can see analogies in the world. And so it actually, it's actually kind of like as if his story is above. And, and then you can apply it to different circumstances because. Manifests the pattern so well. Whereas, whereas Lewis seems to have been more on the allegorical side. You know, where I was going to say it's like Aslan is Jesus, you know, but in, in, in Tolkien, you don't have a character that's like, this is Jesus. And I really want you to know that it's Jesus. It's more. It's more a laid out pattern of different. Of different aspects of being which kind of manifest themselves. So, so I, I Actually, in terms of storytelling and in terms of patterning, I prefer token. All right. So David Flores asked, why did the principalities of the Greco Roman myth continue to persist in the naming of the planets, moons, etc with our expansion of scientific knowledge? Well, just because those are the names of those things. You know, these, the, let's say the naming of the planets, the moons, etc, it's more than Greco Roman myths. You know, the, the planets have names that are quite universal and that have. Have co. You know, are cognates to. To each other, you know, and so the ide. You know, for example, like if, if we have the notion that there's a relationship between God Saturn and Saturday, you know, this type of relationship, it's also there in Hebrew, like the, the name for the planet Saturn is also the name for the Sabbath. And so it's, it's these, these things are not arbitrary. They. And they're not just Greco Roman, they're really more ancient and more pervasive than that. And it's because they actually are naming a pattern that's there that it really exists. You know, and maybe especially in the kind of later Greco Roman culture, that pattern seems to have been somewhat forgotten or twisted for just whatever means. But, but at the outset you could kind of see that it was named the right pattern. And so you just can't avoid it. You know, they tried, you know, it's hilarious, during the French Revolution, they tried to do all this kind of stuff where they tried to like rename the months of the year and they tried to like rename. Remake a whole calendar. And yeah, it didn't work. You know, they're more, they're a little more. People are a little more successful now. You know, they always have the international day of this or that which they. They mention. Like, they'll mention it on the radio or something. But nobody really celebrates international this or they. This or that day. Not like we celebrate Christmas or celebrate Easter or something like that. All right, so Marianne says I must have missed the part where he explains why we suddenly have a diagonal view of the Pedro. This is because I'm just not set up in this space yet. And so I just set up my camera the way that it could work in the space. Soon you will have a much better setup and actually have a much better camera. I actually, I saw, I saw that Paul Vanderklay all of a sudden had such a better image of him. And I became very jealous of Paul Vanderklay. And so I tried to listen to what. Tried to figure Out. I listened to his videos, and then I heard him mention what camera he has. And then I bought the same camera, you know, like, during the. During the. Like pre. Boxing Day. Boxing Day that everybody was doing, because all the stores are closed here. All right. Why am I talking about that? It's not important. All right. Okay. So Numa asks why was it important for Paul to circumcise Timothy? Well, he basically says why it was important in Scripture. He says it. It was because of the. Of the Jews that were there and the St. Paul. One of the aspects you see in St. Paul, that he has this idea that you can kind of. You can. In the heart or in Christ, you can transcend the forms. And so he seems to talk about that all the time. Like, he. He seems to talk about how, you know, this idea that though there's no longer Greek nor Roman or Greek, Greek nor Jew, nor man or woman in Christ, and that as you move towards the source of all things, then you transcend the. The. The forms like that. The form in the sense of the. The particular. And so this is why he talks about this idea of the circumcision of the heart, which is ultimately what even physical circumcision is supposed to be about. It's pointing towards this idea of. Of the circumcision of the heart, which is, you know, this move where you, you know, you move towards the middle and you kind of remove the buffer, the peripheries. And so. But at the same time, he doesn't. He also acknowledges the importance of those things. Like, he. He has this idea that they continue to kind of exist, which is why he also tells, you know, how men and women should interact. And he talks to. He talks to people in their own. And he also is a chameleon, where he is, you know, Roman to the Roman, Greek to the Greek and all that stuff. And I think that he, like, he does. He didn't feel the need to scandalize the people who were there by. By not performing the ritual which was recognized by them at the time. So I think that's why he did it. He just. He just felt like it was not. That it was not the purpose isn't to scandalize people. And I think this is. It's actually probably a good lesson for a lot of people. It's like, if, you know, if, you know, if you have access to something higher, you have access to, like, a higher aspect of the world, or it doesn't mean that you go around, you know, debunking the. What the lower aspects of these things, you know, you should rather try to fill them with meaning and stuff. And so there's. You can know, you can, you can actually recognize a charlatan when they go around telling people that they, that they understand the higher mysteries and that they're kind of above everything and they don't have to follow any of these, these little rules and these little things because they've reached higher levels. Like, you can smell it. You can smell it. Charlatan. When someone says something like that, you see a lot of that in the kind of the weird, you know, spiritual, not religious folks. All right, so Josh the mover says, I've heard it said before. So I've heard it said that before the second coming of our Lord, a new Elijah will come as John the foreigner preceded the Incarnation. Is this a dog with the orthodox church or mere speculation? How do we distinguish such a figure from a false prophet? And so there's this idea in Revelation of the witnesses. And so there are different traditions about how these witnesses are, you know, Elijah and, and Enoch. This idea of these, these people who kind of ascended into heaven and now kind of come down and, and act as witnesses. You know, there's. You see that in, in Revelation and in some of the early traditions. So there is kind of this idea. And I mean, it's not that hard to, to distinguish. I mean, it's not that hard. It may be harder than you think, but, you know, way to, to distinguish a false prophet from a real prophet. One of the ways is that the, the prophet is calling on. On someone else. Like the, the prophet is preparing the way. You know, St. John the foreigner was preparing the way for someone who was greater than he was. And so, so he wasn't trying to. He wasn't, he didn't want the buck to stop at him. He wasn't calling upon people to worship him or to, to, you know, admire him. He was constantly trying to. Even though he did have disciples, he was constantly trying to kind of show people the way towards something else. And so, you know, it's like if someone appears and wants to start their own church, then that's already a big problem. But if someone appears and is telling people that they should go back to church or that they should rediscover the tradition, that they should return, that you should repent the way that St. John talked about, then already you're in a safer spot. I think anybody who starts their own church is already, I'm sorry is just right away is a problem because authority doesn't come from you. You can't. You can't self. Your authority never comes from yourself. It always has to come from someone else, you know, and so even Christ, for example, whose authority came directly from God for the people, manifested it as being baptized by John the foreigner. And then John showing everybody that this was the one that he was preparing the way for. And so this is. This is just how it should be, you know? And so I always kind of joke and say that, like, I agree with Martin Luther when he's criticizing the corruption of the church and the kind of. The abuse of the. Of the. The system of indulgences, all of that. I'm like, I'm with you, Luther. I'm with you. And then when Luther starts to, like, name his own priests and starts to act as if he's this bishop, all of a sudden, then it's like, sorry, Mr. Luther, then I just can't follow you anymore. Same with a lot of the other reformers. It's like, as soon as you take authority on yourself and you start to have your own church, then seems to me like you're on the wrong track. So Adam asked. Hi, Jonathan. I saved your Spirited Away video until I could get my hands on it. I watch it along with. With your analysis last month, and I'm going through all Miyazaki's movies with my wife. Are there any other Miyazaki movies that stand out to you symbolically? Yeah, I mean, I would say all of Miyazaki's movies are wonderful in terms of. Of symbolism, but I think Spirited Away is definitely my favorite. But, you know, how's Moving Castle is wonderful. What is it? The castle in the sky? That's also. Is that the city in the sky or the castle in the sky? That's really wonderful. Also, Pono is great. They're just. They're just all really great. He just has such a. Just has such a powerful symbol, symbolic intuition. All right, so Mikal asks, what is the relation between Logos and logic and mathematics that is an extension of logic, really? Is math an ultimate log language of angels, a prime minister of angels? There are even all those Sunday school paradoxes about God being almighty but unable to break logic. And so there's definitely a relationship between logos and logic, that's for sure. But I would say the one thing that differentiates Logos, at least in the Christian sense. And this is, I think, one of the powerful keys that Christianity has offered, but not only offered, but also, I would say, embodied, maybe, because you could probably see it a little bit in the video. Plateness, that it's embodied. And that is really useful for us right now. And as we see where the sciences are and the questions of relevance, realization and of emanation, all these questions and of, of not emanation, but with the word man, my mind, I hate when my brain does that. Anyways, the idea is the difference between just logic and the way we think of it and logos is that logos also includes the reason. Like not reason in the sense of logic, but reason in the sense of purpose. Like the reason for something, the why of it. And so it's not just that it shows the order of it, but it shows that the order of something is, is bound up in the very reason why it exists. So the reason why it appears to us as something and not just a bunch of stuff, you know. And so, so therefore the logos has, the logos becomes the origin of something. That is, it's the reason why it even comes out of the void of the multiplicity, right? And so there's, there's, there's, there's indefinite possibilities. So out of that comes something. And so there's a reason why it comes out. That reason shows us the order of the thing, but then it also shows us the purpose in the sense of the end of it too. What is it? What is it moving towards? Like what is it, what is it aimed at? You know, and so it's easier when we think of things that are directly, directly related to that. Like if you think of a, like a tool, like a hammer, right? The hammer, the reason for the hammer, it's also its aim. It's also the purpose for which it exists. But that's actually true of everything. It's just harder sometimes to see it when it's not something that is made by humans. But nonetheless, all the categories that appear to us appear to us as categories of meaning to us. I think Jordan, Jordan Peterson talked about this quite a bit. He talked about how even when you look at a chair or even if you look at a certain shape of rock, you, you actually see like that's a place to sit on. Or if you see an object of a certain size, you, you see it as this is an object, I can grab it. There's something about the way the world manifests itself to us which is always purpose laden, you know, at the first level. And so we need to. This is more related to the idea of logos in the Christian sense. All right, so Phil asks, is there a parallel between the first Sunday of advents this year, November 29, reading of Mark 13:33, 37, where Jesus warns the disciples, beware, keep alert, for you do not know when the time will come. And Santa Claus coming at night, discreetly staying awake might mean Santa will pass your house without stopping, of course. But the idea that someone might come by, by when you're being inattentive or asleep is interesting. Yes, I think there's definitely a relationship. It's not a direct relationship, but there's definitely a parallel relationship. The. One of the things that, that, that Santa coming down the chimney during the night when you're sleeping has to do with. It has to do with the incarnation quite a bit, you know, in the sense that that's what happened. You know, that. So Christ comes down. Imagine. I mean, obviously that's not what happens. But if you look at the icon, for example, you can see it's like there's a star. And then down from that star in the cave is the Christ child, which appears hidden, you know, to most. And, you know, and so is this hidden gift which is there in the, in the cave that is at the bottom of the chimney, right in the, in the darkest place where the animals are and, and, and in the soot, you could say. And so the, the, the manger is like, this is the bottom of the chimney, right? It's. It's the darkest place. And so that's where Santa comes down and then manifests himself in. In the darkest place. So in the middle of the night, but also in the middle of winter. Not in the middle of the winter, but at the solstice, right? At the lowest day, at the lowest moment, when the sun is the lowest. And so this is what's going on in the story of, of Santa and coming down the chimney. All right, okay, so I think, I think we're done with the website. Let's move on to, to Patreon. Less questions because of, because of Christmas, probably. Good. I have more time to kind of. To check out the, Check out the chat and engage with you guys there. Okay, so here we go with the Patreon question. So, as you know, I, I guess I should tell people. So guys, you know, people on Patreon who are Supporting me at $10 or more get to ask questions in advance. And then after that, then I, I go in and I look at super chats. But if, if we have less questions today, maybe I'll be able to kind of pick some stuff out of the chat. I'm kind of. I always hope that I can do that, but it just always ends up being like an hour And a half or two hours. And then I'm. I'm out of steam anyways by the end, so. So Christopher Juarez says I missed the advanced sales from your carvings. You posted the information on YouTube, but I realized too late that the icons themselves themselves were only on Twitter. Would you consider notifying patrons by email next time? I really want to purchase a carving from you. Thank you for everyone. So. So for those who don't know, I have two Patreon projects. One which is related to these videos and is related to the Q A and also to the monthly kind of Patreon video that I make for. For patrons. And I also have a Patreon project which is related to my carvings. And then people support me there. They get access to prints and to drawings and to early access to these carvings. And so that's probably still how I'm going to do it. And so those carvings I put up actually on the. My carvings Patreon at first, and a lot of them went there. And then when I ended up putting them up online, then they went super fast in like one day. And I usually put up carvings. They go up super fast. And. And so, I mean, we'll see. Maybe I could consider having people on the video Patreon, like have some advance notice from just the general public. That might be a good idea. I could do that. Could do that. Maybe I'll consider that. So get. If you want. Guys, want to. I'm gonna have another sale of these types of carvings, these kind of ornamental carvings with mosaics and some gilding maybe and stuff like that. I'm gonna have those at just before Pasca. And so these, these projects are done with. With my assistant who is helping me kind of develop new styles and new, new, new designs. And he researches different ornamental patterns. And we kind of look at it together. You know, I kind of recarve some of the parts and we. We worked on them together, which is why. Why I'm able to kind of get so many done, you know, in as a batch. And so just before Easter, I'm probably going to put out another maybe 20 of these. So get ready for that. So, Walrus King 14. Hi, John and Jonathan. Do you plan to continue your series on video game symbolism? I know 2020 has been crazy and that first Mario video wasn't a big success, but I hope you choose to continue on with it. Maybe a video on the first Zelda game eventually. I appreciate the energy. It's interesting because it is true that it's because I was kind of surprised I was kind of disappointed that, that the video didn't get more views. I thought, come on, people didn't ask me to do video game symbolism for a very long time. But, you know, it's possible that no one cares about Donkey Kong and doesn't want a video game interpretation of Donkey Kong. So I probably will make the Mario Brothers video, see how that goes. And if that goes well, then maybe I'll do some other video game symbolism. But no promises, because I don't know. We'll see. So Jesse Blaney says, I begun to get a sense that the Western church has over time, placed less emphasis on the Nativity. What more important. What more important to understand as the story of Christ, the Nativity or the crucifixion, resurrection. Are those two stories akin to the symbolic realism of heaven and earth? There's definitely a relationship between the, the Nativity and the. And Pascha. Easter, for sure. In the Orthodox Church, Easter. Easter is always more, Is always more important. It's always just a bigger feast. It's the feast of feasts. You know, it's not even considered in like the 12 feasts of the year. It's like a. It's like a feast of feast. And so, so it's definitely has more prominence. But I think that the Nativity is super important. Actually, I, I kind of felt the opposite. I felt like the, the west emphasizes Nativity more like Christmas is a way bigger deal here. And it's, it's a bigger deal, it seems, than, than Easter here. But I think there, there are obviously some parallels. You can watch my video on, on the Nativity, I did a video called. I think it's called Christmas as the foundation of Reality. Some, some. Some title like that, which I always use Nativity as the foundation of Reality or something like that, where I talk about how, you know, the, the structure of the Nativity icon in the story and how it also relates to how the, the. The cave and the womb of the mother of God also functions as the tomb. And you know, Christ that is wrapped in, in, in linen, it is wrapped in swaddling clothes, is meant to resemble Christ who is wrapped for his death and the manger becomes the. His coffin. And so there is like this parallel which, which appears for sure. And there's also something about how in, you know, one of the versions, one of the versions of Scripture says that there were two angels in the tomb. I hope I'm not mistaken here. And one was at the feet and one was at the head of Christ. So this is Related also to the ass and the ox, which is in the nativity scene and is also related to the two cherubim on the. On the ark of the covenant. So. So those two angels are actually the two cherubs, you know, on the ark and, and the Christ's body and the tomb of Christ becomes the ark, becomes the space where the. The divine revealed itself. All right, so Daniel DeMarco says, hi, Jonathan, I hope you. You and your family are getting settled into your home and that the move went well. What is the meaning of Genesis 15, 9, 11, when Abraham sacrifices the heifer goat, ram, dove, and young pigeon, then drives away the birds of prey? I think it has something to do with multiplicity, duality and unity. Wow, you got me there. Because I don't remember that. It's rare that there's something from Genesis that I don't remember. Cut them into. So the Lord said in bringing a heifer goat, a ram, each three years old, along with a dove and a young pigeon. Is this. This is actually not. Is it the sacrifice? Or is this when God. Is this. When he makes the covenant and cuts the. Cuts them in two? Yeah, this is. This is actually not. It's not. It's not that it's a sacrifice. This is actually the covenant that God made makes with, with Abraham where he. Where he separates the animals into two. And then. Then kind of God kind of comes through the middle of these two opposites, you know, and you can understand that as these two opposites that I'm always talking about, right, left, all of this, you know, and it seems like this, the, the chasing away the birds of prey probably has something to do with this, say, a refusal of idolatry in the sense that the birds are the spiritual represent, the spiritual beings. You know, they fly up in the sky, they're flying the heavens. And so I've talked about how the bird of prey represents the manner in which some of these principalities can, let's say, take. Take up things. You know, they can suck up things into themselves. You know, I've explained how Prophet Samuel talks about how, you know, he talks about the, the downside of having a king, which is the king. If you have a king, then the king will come in and we'll take things from you and we'll. We'll kind of bring them up into him. And so we'll take the best of you, we'll take your best women, we'll take your best men, and we'll kind of pick that away. And that's what the Bird of prey does, right? The bird of prey comes down and then takes the flesh and then pulls it up, you know. And so I think that that's what's going on here is that, is that Abraham is chasing away the false gods or the small principalities so that he can be in communion with the God of heaven or the creator God. At least that's what it seems to me, that what. That's what's going on. All right. And so Keenan Wang says, in the orthodox symbol of faith, we say that Christ was crucified for our sins. Is this understanding on the right track? We create death through sin, and in order to conquer death, he had to die. Yes. And so the, the orthodox understanding is mostly the idea of the filling up. Right. And so Christ in his incarnation had to kind of fill the different aspects of reality to kind of, to manifest them. If you read St. John Chrysostom's wonderful homily for, for Nativity, he kind of talks about that, how Christ became this. For. He talks about different categories of human, human beings. He talks about, you know, the, the, the prostitute, the publican, you know, the, the shepherds, the kings, that. All of these different aspects of reality and how Christ kind of fills the, those aspects, you know, let's say, manifest his glory in those aspects. And so that goes all the way down into the grave where Christ fills death even with his, with his, his glory. And so that's the idea. So he died for our sins in the sense, like you said, that as you miss the mark. So imagine you have a bullseye, you miss the mark, and so you move away from the center. You're moving into fragmentation, into multiplicity, into this breakdown. And so Christ actually goes all the way to the edge and kind of brings it all in and fills that with himself and shows. You know, I always kind of, I always tell you guys that Christianity is a non dual religion. And that's one of the aspects of the death of Christ is to manifest the, the how God transcends duality. So Drew McMahon asks, Is there a distinction between mind and soul, perhaps somewhat related between thoughts and prayer? I mean, those words are messed up. It's just hard to know what it is that people refer to. And so it's really difficult. So that's a good way to. If you read the Church Fathers, especially the Ascetic Fathers, if you read the Philokalia, for example, you'll see that in the text there is this three tier system where you have something like the noose, which would be the intellect the highest aspect of you, the way in which you can grasp immediately directly God, and not just God, but also the Logos in the world. And so you can grasp the patterns directly. And so then under that you have what you would call soul or you know, something like, more like your psyche, which would be all your thoughts, all your feelings, all the non physical aspects of you which are, are less direct, let's say, and also which are more related to the body in the sense that you know your, your thoughts and your feelings will, will, let's say, will affect your body. Right, right. You know, you, although your feelings are not physical, you, you, you experience them in your body in certain places. So, so I would say that that's probably the best way to understand it. So Dorotea asked, are the Pentecostal charismatic churches and movements on the edge of the church? They have all these phenomena like singing, dancing, screaming, fragmentation on one side, but also mega churches on the other. I also experienced some weird view where you had to be a charismatic to be a real Christian. I don't know if you could call that a pathology of the edge, but maybe that is my experience and isn't present everywhere. Anyway, I like to hear your thoughts. I do actually think that I, I really do see Christianity as a hierarchy and I've talked about this before. I do see that, like, I don't want to justify some of the weird aspects of, you know, charismatic movements and stuff, but I, I nonetheless see that they have a reach and a kind of, a kind of appeal to people who need more sensuality, you could say, in a sensuality, in the sense of, you know, kind of extreme experiences and all that stuff. And so, so I don't want to justify it, but I nonetheless see that it has something. And there is something like, I always joke, not, I don't joke about it, but I always talk to you guys about how there is this strange connection between, between the bottom and the top. And so there's something about death and glory, this, this flip that happens. And I think that there's something about the charismatic movement which is always on the verge of becoming orthodox. Like it, it's like it's, it's really, it's really on the edge and it has all this chaos in it. But there's something about the mind of a, of a charismatic person which is more capable of understanding symbolism than a, than a kind of high church, super rigorous, you know, type of a Protestant, let's say. And that's just an intuition that I have and I've noticed that Like, I've read some, a few charismatic kind of prophetic texts, and you'd be surprised sometimes how, how they get it right, you know, and so, so sometimes it seems like they get some of the pattern right. They get the, they, they can see it. It's just that it's disordered and they don't necessarily have the fullness of seeing how it connects to everything and how, you know, you, if you, if you have a vision of a sacred mountain with like, you know, with heaven, with paradise above. And I've seen these charismatics, you've had these visions. And it's like, you know, maybe your church should be shaped that way. Maybe, you know, maybe the way you pray should have that pattern too, you know, if that's what you're seeing in your visions. But anyways, so that's my, that's my intuition about that. All right? So Sander Tudor says, given that as humans we evolve to live in symbiosis with other organisms like bacteria, why shouldn't we negotiate rather than reject peace with artificial life? I, I don't think I've ever said that we have to reject artificial, let's say artificial life or artificial intelligence. It's, the problem is always, it's always place. It's always like where, where is the, the place of things? And so one of the difficulty with artificial life or artificial intelligence is that we are$we, we're idolizing it is that we are wanting to make these tools into the very thing that rules us. And so you, you. That doesn't work. And it, and if you try to do that, then these tools, these mechanistic tools or these, these empty shells are going to become vehicles for fallen principalities. That's what they used to do. They make a body for the idol. You make an idol and then the idol comes down. The, the God comes and manifests himself in the idol. So there's something about. And so it's not that, it's not that the idea, for example, that the, the, in the scripture, there are no graven images. It's not true. There are graven images, right? You have the cherubim in the temple. You have the bulls in the temple that, you know, hold the laver. You have different figures in the, in the temple, you have different things. It's just that those weren't. They were in their right place. They weren't, they were support the seat, let's say something like that. And so this is the thing with, this is the problem with like Facebook and Google and all these algorithms is that we think they're going to solve our problems. We think they're going to give us a solution to the problem of meaning, and they can't. And if we try to make them give us the solution to the problem of meeting, then that's when you create a body for, for a, for a, for. For all your passions to kind of come together blindly and to become a, you know, a very strange being that will not be, not be the one that won't want the best for all of us, let's say. All right, so Nina Morris says Merry Christmas, Jonathan. We talk about your ideas a lot in our family. Thank you for sharing us. Well, thank you, Nina. I appreciate it. I really appreciate it. I know I always keep repeating this, but I don't answer a lot of the messages that I'm getting because I just get too many and I, I have to be able to prioritize my time or else I'm going to go crazy. But I really do appreciate it. I gotten several messages, even around Christmas time, of people, you know, just kind of expressing their, they're, you know, expressing their appreciation for what I'm doing and, and telling me their story of, of their own personal transformation. And it always touches me very deeply, even if I don't answer. So thank you for those stories, people. All right. The Wakeful says. Dear Jonathan, if we should approach Christianity as it did not entail an afterlife, how should we interpret scripture? Like the story of the rich man and Lazarus, Luke 16, 1931. This passage seems to be clearly delineate a life after death. For instance, Abraham says to the rich man as he's being tormented. But Abraham said, son, remember that thou in thy lifetime received good things, and likewise Lazarus evil things. But now he's comforted and thou art tormented. And so, so I don't know why you say if we should approach Christianity as vida entail and afterlife. I, I don't like afterlife. I don't know what that even. I don't know what that means. Like you have a being and you have an existence and that existence ranges and has a, Has a range which goes beyond your physical body. It already has that. It's like the fact that you can even interact with me through YouTube means that my existence definitely has a range beyond just my physical body. You know, how could I write a letter to you and you answer me. If we, we. If our existence wasn't just. If our existence was just limited to our immediate physical bodies, and so we have, we have an existence which is more than that. And. And we have. There's a way in which we have a totality of our existence which spans more than just your physical body. So. So I don't. I don't have a problem with the idea of, like. I don't like the word afterlife, but. But the idea that being is not limited to your body, like, your physical body. Now, that's for sure. I don't. I don't. I don't. I don't think that. But, you know, it's. It's clear that. What. When. If you read that story, it's clear that it's also not just a simple continuation of. Of existence the way that people want to, you know, understand it in, like, the movie Ghost or something. Like something as silly as that. Because it's like, okay, so Abraham is. So Lazarus is in the bosom of Abraham. So try to figure that one out. Like, in terms of trying to understand it is just a simple description of. It's like he's in the bosom of Abraham, and here is the rich man looking at Lazarus in the bosom of Abraham. So obviously, we're describing something else. Something else going on besides just a. Just a kind of simple continuation of existence after death. Like, there's something more going on, and it's real. It's. There's nothing. It's not. It's not fake. It's not imaginary. It's real. But it's not just like. You know, it's not just like, what you see in Ghostbusters or some stupid thing like that. You know, It's. It's something else. All right. Hopefully that makes sense. Sometimes I'm wondering if I confuse you guys more with my answers than anything. All right, so Randall B. Says hi. Jonathan, loved your discussion on Marshall McLuhan's work. There is a horror movie based on his work. Videodrome, 1983. Will you analyze its symbolism after re. Watching it, I was shocked by how accurate it is to McLuhan's idea. Who made Videodrome? I think I. I don't think I've seen it. All right. It's made by David Cronenberg. Yeah, yeah, yeah, yeah. I've seen a few of Cronenberg's work in the past. I. I should probably watch it. I've never seen it. I don't think I've watched it. I will look into it. As you notice, I'm not making a lot of movie interpretations these. These days, partly because I don't watch a lot of movies, but. All right, so Chase and Lindsay asks. Hey, Jonathan, I hope you and your family had a nice Christmas at the end of this crazy year. The perfect year for a Christmas. Yeah. I was wondering if you had any insight into the symbolism of spiders and why in so many stories they seem to be connected to the feminine. Well, the reason why a spider would be. They don't, wouldn't necessarily only be a feminine. The reason why they're connected to a family is because they, because they're associated with a web. You know, they make a home, they make a, they make a matrix, you know. And so this matrix is, you know, is like a lattice in which things will come and get stuck. And so it's a, it's a, you know, the, the dream catchers, the dream catchers are actually a really good way to understand this, this whole symbolism of the web and how the web, the matrix, you know, the web or the, this underlying lattice pattern of being will, will catch potential, you know. And so if you look at a dream catcher, you'll see that it has kind of looks like a spider web. And then there are little stones that are caught in the web. And these stones are the dreams that get caught, right, that are, that are caught by this thing. And so it's a, it's a condensation of a potential into a, a form. So you can imagine this web now with the little stones in it. Now think of it as a, as a, as a net that is put down into the water and then catches all the fish and pulls it up. And so that's the net, right? That's the, that's the, this is this matrix underneath the world. And so this is related to the feminine because it's like the home. It's like the structure around which things happen. And so, and so it's the spider's web, the fisher's net, this dream catcher stuff, it's all talking about the same, the same thing. And then it is related to the feminine because it's the frame. So Charles Harrow says. Hi Jonathan, Merry Christmas. The expression we are all children of God has been on my mind lately. Jesus was the Son of God, but aren't we too? Does this imply we have the ability to be as Jesus was the embodiment of the divine. Divine Logos. Thank you for sharing your thoughts and wisdom and have a happy new Year. Yes, that, that, that's exactly what it implies. It implies that we, that we can participate in Christ, that we can embody the divine Logos to a certain extent, that we can, that we can be co. Inheritors. This is how Scripture Talks about it co inheritors, adoptive adopted sons, adopted adopted children. All of this language is there to say that we are meant to, to as much as possible become that and not just embody, but also rule with Christ. This is something that you know, if you watch, if you're listening to the Lord of Spirits podcast, Father Andrew and Father Stephen are doing a wonderful job. Is about talking about how the actual purpose of one of the purposes of humans in the world is to actually become principles, to become principles of things and to and that they manifest their being in the world in a way that glorifies God, not in the way that it just stops at them, but in a way that kind of participates in this grand dance of multiplicity and unity. And so that's why we have patron saints of cities and patron saints of different aspects of reality. Because these in Christ, these saints have actually ascended and have become the princes, the principalities of different aspects of reality. And that is what we are called to do. That is how we are called to rule with Christ. And so it's very mysterious. It's very mysterious. And so in a way we are called to become like gods. Like that's what, that's the purpose of humans and is to become like gods not for our own sake, but in service to the Most high. Then we, we just kind of take our place in this, this massive hierarchy of beings that act as principles for that which is lower than where they are. So that's how I see it. All right, so Jacobus Raudanis, what are the examples and your own thoughts on the possibility of physical violent counter resistance response for Christian to the cancellation of the center or hierarchy itself? Does Christianity offer an argument for a violent response or is it a case of too much mental gymnastics to constitute a courageous physical defense? I find myself among Christians who assume that there's no need for a physical reaction to evil, even if it's in their communities. They seem to take Jesus Jesus story and become absolute pacifist. This is in Lithuania, Eastern Europe post of it block it says if the Christian identity is too weak to counter attack, I think it is possible. Man, this is going to be tough one you guys. This is going to be a tough answer for you guys. I think it is possible for Christians to in service of a higher purpose, to defend, you know, their home or their territory. And so I believe that the idea of the Christian knight who fights for a higher king, someone who is above them, fights in the name of something above him and then in service to those who are below, can't defend themselves. I think that is possible now. What's happening now is different. And what's happening now looks way more like the story of the betrayal of Christ by Judas and how from within the west, from within the Christian story, rose up a traitor who was an Antichrist and who then dislodged, deconstructed, you know, brought about a dying of the Church. And so I don't think that in that case we should defend ourselves violently in the same way that Christ didn't. And I think that it's not. There's a mystery. There's a mystery in dying. I don't know what to tell you. There's a mystery in dying. There's a mystery in the martyr, and there's a mystery in what's happening right now. And the mystery of the martyr is the same mystery that we're seeing happen. So as we watch Christianity wane and as we watch it die, we have the responsibility to be seeds for the resurrection. Rather than fight off. What are you going to fight off? It's all coming from the inside. It's like this weird rot that is kind of manifesting itself from within our country, from within our churches, from within our own traditions. And so it's like, it's not the same. You know, it's not the same as. So through that, then there also are attacks from the outside which are happening, I have to admit that. But there is mostly, it's mostly this kind of, this, this strange betrayal from the inside. So that's how I see it. But I also have sympathy for someone who would disagree with me, and I have sympathy for that as well. So JL asks, is there a connection between how we write and the way we think? I mean, could a culture that uses logographs to represent words rather than a specialized system of describing each sound think more symbolically? To me, an Alphabet seems like scattering, fracturing, dare I say iconoclasm. I know ancients in the west had always used an Alphabet, but math literacy is only a new thing and being facetious, but to an extent, but could really, could be ready to. Could the ready adoption of emojis reflect a return to symbolic thinking? Us talking about symbolism prosaically being a necessary side effect of the fragmented tending towards a new unity. This is, this is an interesting idea. And I think that your, your basic intuition is right, because ancient language were more ideogramic or were more, you know, images. You know, even ancient Hebrew, the early Hebrew letters were, were, were more like hieroglyphs. They, they actually represented images and were very simplified into forms. And it's really when after the Bronze Age, when the west lost the Greeks especially and the Romans lost their Alphabet and they retook a Phoenician Alphabet or actually a Semitic Alphabet. And so our Alphabet is Semitic. Our Alphabet is, is based on the same Alphabet that Hebrew has. But it's just that it's a kind of weird, like you said, a kind of weird fragmenting scattering because it's, it's not, it's. There's no more direct relationship between the letters, their meaning, and it's, it's just phonetic. Right. And so, and so it actually shows a kind of descent, a kind of fall in the world, but it also means more power. And so it's like that's what happens when things go down, is that they lose their higher identities, but they also have more reach and more power. And so that's also one of the mysteries of Christianity, is that it was supposed to go to the edge of the world. So it wasn't going to be in Hebrew, it was going to be in like the most popular form of Greek. That's why Dante wrote in the most popular form of Italian is that Christianity also kind of comes down. Down and fills up the dark spaces. You would say. But I agree that there's something about the breakdown of grammar that's happening with texting. And there's something about the return of things like emojis that are maybe hinting in a very strange and surprising way to the possibility of more. Yeah, of a more direct connection between the actual image and the meaning. And so can it maybe can foster symbolic thinking? I never thought about emojis that way, but that's pretty awesome. I keep thinking about that. So Nick Scott asks, is there any symbolism to talk about with respect to superstitions? For example, not putting a calendar up early or a broken mirror causing bad luck. My best guess with the mirrors, that there's a full cycle that happens during the seven years of bad luck. But beyond that I'm not sure. Thanks as always. I always. I've talked about this before, I think in a Q and A about how there's more to superstition than we think. And it usually has to do with seeing things in a different way. Not seeing, not seeing causality direct, like a mechanical causality as the cause of the, of the effect of the superstition. But you know, I mean, like, for example, like if I've never heard of the superstition, I'm saying not putting a calendar up early but you can understand why that would actually be a bad thing. Like if you putting up a calendar early can be a problem. Like it can be a problem because you're not means that you are projecting yourself into the future too much. You're not in the now. The broken mirror seems more immediate. Like it's more, it's more immediate to imagine that if you, if you're not careful of that which holds your image and you're not attentive to that thing which reflects your image. You know, there's something about the way you act that if you, if you break a mirror, if you're the kind of person that will break a mirror, then you're, you're probably in trouble. In terms of it's not a direct thing. It doesn't mean that if you break a mirror necessarily bad things going to happen to you. But it's mostly understand it through these secondary causes of understanding that, that you need to be attentive and care for the thing which, which shows you your. Shows you to you like that reveals you to yourself. So if you break that then you're going to have a. You can have a bad cycle, let's say. So. So I would say that most superstition is like that where if you look at it carefully, you pay attention and you, you, you try to ask yourself like why this would happen. You know, then, then you'll find that it's usually not as stupid as we think, but we have to move away from mechanical causality. All right, so Charlie Longoria asked. Hello, Jonathan, can you expand on the discussion you had with Rationality Rules when the topic of homosexuality came up? I have friends who are gay and a person very close to me came out as non binary. I love these people and would do anything for them, but they would see me as being a Christian as a personal attack and that I am participating in keeping them from getting married and pursuing happiness. I feel like people are confused about the word sin. That to sin means you will burn in hell for all eternity. Yeah, I mean we all sin. So I heard or read somewhere that in Leviticus when it says man shall not lay with other men, that it's actually referring to pedophilia. But I know how true that is. Yeah, it's probably not true. So how can I navigate the social pressure to say sexuality is not a sin? P.S. tell Matthew we need to do a Q A with you. Yeah, he need him to do Q and A. Matthew is not gonna, you're not gonna see Matthew's face on the Moon on a video anytime soon. If he, if he does, I'll be very happy. But I have to say that those possibilities seem to get thinner and thinner. So this is the kind of stuff that's going to get me banned from YouTube. But that's okay. We'll go down this line. This whole idea of sexuality is probably one of the best ways to understand what sin is. It's really, really one of the easiest and most immediate way to understand what sin is. And it's so simple and easy that it's actually somewhat dirty. Like it's. You. You guys are not going to like it. And this is going to be. Not going to be for kids. But sexuality has a mark, and it, it's mark. The. The bullseye of sexuality is a child, right? That's the bullseye of sexuality. And everything in kind of Christian sexuality has to be somewhat aimed in the general direction of the child because that's the union of heaven and earth. That's the image of God in the soul. And that's also the. The actual way in which the world continues to exist when you hit the mark, the world continues to exist. And this is, this is, this is. All sin is like that. Now, the sexual act itself is also the same thing. The sexual act itself is also arrow hitting a mark. And that's why sodomy is viewed as missing the mark. You're missing the mark when you, when you don't. When you're not in the right place. I don't know how to say it without becoming explicit, but it's just one of the easiest way to understand what sin is. It just means finishing in the wrong place. That's what sin is. It's always that. And so sexuality is one of the most immediate representations of that. Not representation, but embodiments of what is sin. And so. So on the one hand, you understand that this is how the world works, is that there's a reason for things and a purpose. And if you hit the mark, then there's life. And if you miss the mark, then there are different degrees of death, right? And also we need to also understand why everybody also misses the mark. And so it's. That's the key to me, in my opinion, is to say that it's not. First of all, it's not just about homosexuality. It's about every form of sexuality which isn't aimed and aimed towards hitting that mark. Now, everybody falls from that, like everybody does. No one is completely in line with that because that's just how we are. And, And So to me, that's the, that's kind of like the solution is to say no. For he who, he who, who has no sin, cast the first stone. But apart from that, it's like the pattern is still there and you just can't, it's very, very direct and it's very immediate and it's, and it's like you can talk around it, but it's one of the most immediate expressions or, you know, manifestations of what sin is. So I can't, it's like I can't deny it because I see it right in front of my eyes. Like, it, it's just so clear that I can't, for social pressure, say, say something else. So, sorry, guys. And, and like I said, I think that what you said is right. Like, it's not about not loving people who are dealing with this. It's not about not caring for people who, who, who have these desires or have these practices. Just like I still love my neighbor who's living with his girlfriend, isn't married, and I still love, you know. You know, I, I, I myself haven't had a child in quite a while, so I probably, I'm right there with the same problem. And so it's like, it's not like we don't, it has nothing to do with whether you love the person or not or whether you care for them or, or it's just about understanding the pattern, seeing what it is, recognizing it as the model, and then knowing that we all fall short of it, you know, that's all I can say. So enough about that, right? So, Lisa, don't make a clip out of this because I just don't, I think it's important, but I don't think it's worth getting banned on YouTube for this, you know. All right, so here we go. So Jay Garcia says hi, Jonathan. I hope I can articulate this one. Will, how do you see overwhelming cynicism playing itself out? I see a knowledge crisis coming or getting worse as our institutions undermine themselves. Indeed, governmental, scientific, historical, economic and fragmented realities breeding distrust. On the bright side, I see phenomenology and symbolism still available to us, but how do you integrate the cynicism which seems to be intrinsic to an upside down world, so that community and friendship are preserved? You know, and I, you know, I, there's only one way to do that. And I, I wish there was more, but it's really to, to be, to be a just person and to, to be someone who fosters trust and someone who can be trusted to do things, you know. And you know, I say that, and I'm not saying that's what I am, but I don't, I don't see another solution that it's like you need to be that which you want the world to be. Be. And so if you, if you keep your word and you, you know, you do that, then I think that's the best we can do. And also, like I said, know that we all also fall short of that. At least I do. All right, so our generation is dumb says, hello, good sir, I hope you're doing well. I read your brother's book and unless I'm mistaken, it seems the two of you believe that heaven is the realm of the abstract, similar to how Plato view the realm of forms. Am I off base here? Because if that is the case, I don't see how we can ask the saints to intercede for us. I've heard you dismiss the idea of heaven as a sort of higher dimension. However, if it does contain conscious entities such as sayings, can we really get around that idea? Thank you. It's like so a good way to understand it would be it's not that it's abstract, it's non manifest or above manifestation. And, and it continues to happen. It happens fractally, you know, and so it's not just that that which is above is, is, is abstract, you know, but how can I say this? And so these, this hierarchy is actually not a hierarchy of, of just concepts, it's actually a hierarchy of beings. And so the way it works, it's like I talked about just before, is it actually ends up being beings that become principles of things. And so the way that the world shows itself is not at first and foremost through concepts, but through modes of being. And so these modes of being actually have embodiments. And some humans will kind of rise up into that mode of being and become the, the principle of something. And so it's not, it's not, it's not just abstract in the way that Plato talks about. It's more, it's, it's more, it's more like an ancient cosmology of gods than what Plato says. It's more like this hierarchy of angels. And what Plato said, although there's a connection, Plato can help us understand this. And, and there, there are ways to talk about it. And I try to, of course, to talk about it in a way that is more immediate for people that are struggling with that or find it difficult to get there. But ultimately it ends up being a hierarchy of Beings like a good way. I always use the army as a way for you to understand it. It's like the army exists with, with. With purpose. And so there's a hierarchy of, of beings in the army. And there is a general who is something like the head or the. The principal. And then the general will give direction and that direction will then come down into the world. And then the army can act as a. As a body and can do something, can accomplish things. And so that's more the way the world works than just a bunch of abstract things that exist in kind of concepts or ideas. The way that Plato talks about the ideas in Saint Maximus and I think in Christianity are bound up with purpose, not just abstract ideas, not just forms in that sense. Anyways, that's how I see it. So Ronnell Canada says, hey, Jonathan, what would you say is the orthodox view on destiny? You think we have a preordained destiny or piece of the cosmos responsible for upholding? Or would you say that it's more of an interplay between a purpose God has given us and the actions we take on in life? How might the story of Jacob wrestling the angel relate to this? I mean, I think that I've talked about this before. It's mostly about understanding freedom somewhat differently. It's mostly understanding that true freedom comes in. In what you would say, accomplishing your destiny. So it's not that you want to free yourself from your destiny. And in Christianity, your destiny is to become like Christ to the extent that you can. To the extent that your limited being can manifest Christ in the world, that's your destiny. Like, that's what. That's the plan that God has for you. And so as you embody that, then you are free. And if you refuse to, or if you hold on to smaller aspects of the world, then you actually are a slave. So it's not like in the Greek world where you're like a slave to your destiny. No matter what you do, you can't get rid of it. It's mostly that your destiny is to become like God and you're a slave when you refuse that or when you attach yourself to lower, lower things. All right, so Connor Mitchell asks, so do you have a resource that functioned as an HQ for the symbolic army of where we can share not just analysis of symbolic patterns, but strategies and methods by which they've been effectively revived and recreated in our respective lives and fields? Yes, we have a Facebook group, we. Which is acting exactly in that way. And it's not me. I'm not the one running it. I'm actually not even a moderator on the group. It's. It wasn't created by me, but it is. It is the place where the, the best discussion is happening. And, and so you can check that out. It's not, it's not an open group. You need to. You need to prove yourself to the moderators before they let you in. But, but it's there. It's called, it's called the, the Symbolic world in the Zombie invasion. Is that the right. I always forget the actual name of it. It's called the Symbolic world within the Zombie invasion. And so you can check that out. All right, so I think we have the last question here. So, Vic, Sarah says, why is Judas always shown right next to Satan and are depicting hell? I once saw one where Judas is on the devil's lap, just like how a child sits on his father's lap. Could that be a representation of how. On how evil is distortion of everything pure and good? Or does it mean something else? P.S. i just received the Language of Creation. Can't wait to read it. I'm happy. Yeah, you need to read that book. It has to. I think it mostly comes from. It comes in part from Dante where Dante places Judas. He doesn't place him on his lap, but he places him kind of being. Being devoured by Satan, you know, like kind of in the bowels of Satan. And so it has to do with the idea of betrayal as being the highest sin. And, and so, so that's what it has to do with. And the idea of showing him kind of sitting on the devil's lap the way that, that, say, Christ would be sitting on the, the lap of the Mother of God is, is definitely meant to show this parallel or, or opposition there. It's a really ancient tradition of showing a kind of parallel opposition between Judas and Christ. One of the earliest crucifixions we have will shows Christ on the cross and Judas hanging from a tree. And so both are hanging from a tree, but one to his glory and one to his. To his condemnation. And so, so it's a. There's a really ancient tradition of, of making those comparisons. All right, so. All right, so since we have time, I've actually reloaded the page. I usually don't do that because I don't like when people write in their questions right when I'm already answering, but so Christian Sakra asks. Hi, Jonathan. I'm sorry, this is a bit long. I was walking through Christmas this morning display at my Catholic college in Houston and saw images of Houston sports teams mixed with Christmas versions of pop identities from old trolls shows like Charlie Brown or Star Wars. I thought it was interesting how the Christmas identity seemed to be absorbed the pop identities and direct their narrative to a more Christian one. He concerned me, though, that the secular sports icon had no hint of Christmas identity and seemed to be colonizing the university rather than the other way around. Yeah, how do you think we should approach secular identities trying to take pieces of the Christmas story without Christ? Or is it just the beginning stages of the invasion of Christmas on the secular world? You know, it can go both ways. And this is. This is like, if you want to learn one lesson from my channel is that you can turn the tide on this pattern. For sure. I would say, and this is definitely true, we have seen in the past 60 years or maybe even more, we've seen a assault on Christmas, like, not the kind of assault that Fox News talks about, like, you know, but rather we've seen a desire to make Christmas as secular as possible. Which is why if you listen to the radio, you can hear Christmas songs all day and not hear one mention of the birth of Christ and hear about Jingle Bell Rock and whatever, you know, pop version of. Of Christmas, you know, and so it's definitely a desire to reduce Christianity, Christmas to a secular holiday, to reduce it to a kind of aesthetic and feeling and all of this. And, you know, it doesn't. It just doesn't. It doesn't work like it. It's gonna last for a while, but it can't last because, you know, that's not how reality functions. If something doesn't have a purpose, at some point, it goes away. And so it's just gonna. It's just gonna start to degrade and degrade and degrade, you know, and that's one of the reasons why, Chris, Christmas has been reduced to shopping, basically because part of the secularization of Christmas means that you need a purpose for it. And so in a world that worships mammon and worships money, then shopping will become the reason for the season, let's say. But like I said, I think there are ways to flip it. And if you watch my recent video on Rudolph the Red Nosed Reindeer, I think you'll see the ways in which we can probably flip things back and surprise people with some of their stories. The. The more secular versions of Christmas and show how some of them end up manifesting Christmas nonetheless and point back towards Christ. Not all of them. Some of them are hopeless and will. Will be assigned to the fire. But A few, I think, can, can participate in the resurrection. Let's say it's that way. So Kevin Patterson says, what is the symbolism of nudity and where does it fit in our lives, eg, with our spouse, family, friends of same gender? So I've talked about this a few times. You know, nudity has to do with a. There are two nudities. There's one nudity, which is a nudity in the garden and has to do with revelation and a kind of, of, of safety and, and, and a capacity to not need the garments of skin. Right. And so you can understand that ultimately you would hope that that's what the relationship between a man and a woman would end up becoming, you know, and, and you can understand it the same, like, even just more immediately. It's like when you feel safe at home, that's when you feel safe enough to take your clothes off. Like, you know, you don't change outside in public. You have to be somewhere where you feel safe in order to remove your, your clothing. And, and so then, but then there's also a nudity, which is the nudity of shame, which is the nudity of being exposed in public. And, and you know, and let's say not being able to contain yourself, not to being able to contain the secret, you know, and so that is also part of, that, is also part of, of the symbolism of nudity. So. All right, guys, I'm pretty much done with the, the questions, and so I'm going to go into super chats and see what we got here. All right? Okay. There. Sorry, the wrong thing. All right, here we go. Sorry about that. Okay, and so let's start with zach. Counts for $5, says I'm from the southern United States and gre around Southern Baptist churches. I would love to know your thoughts on the Southern Baptist tradition. And so, I mean, I, I grew up Conservative Baptist, I guess you would call it. And so I don't really know the difference between the two. I'm not, I would say that. I would say the, the strength of Baptist is definitely their knowledge of scripture and their kind of desire to, to really memorize Bible verses and, and know all the stories, you know? Know, I think that's amazing. And I think that it's a, it's why, I think it's like my experience of kind of discovering the church fathers and finding the kind of deeper mystery was based on the fact that I knew the Bible so well, because I grown up with it. So I really appreciate that. But nonetheless, I feel like, like Baptists Are not. It's hard because it's such a big denomination, but I would say that a lot of the batches that I've encountered because they, they've embraced materialism without knowing it. They've embraced kind of materialism and they've embraced a science. They, they think science is true, just true, like. And so they, they, they get caught up in that stuff and they, they end up, you know, they end up idolizing science without knowing it. And so because of that, they actually miss a lot of the, the patterns because they always try to see the description of what they see in Scripture as a description at the same level as, you know, as some guy describing, you know, the speed of a car or something. So, so because of that, they, some. I felt like, at least in my experience, that they struggle, but things have changed so much. And so I don't even know if that's true anymore. You know, you look at, you look at, like I've mentioned this before, like, you look at the Bible Project and this kind of Protestant reawakening of patterns and stuff, and you see it in the Theopolis Institute. And so it seems like there are a lot of more conservative Protestants that are right there, like right, right at the door and are. And are kind of perceiving this. So, so who knows what the future holds for all of this. So Brandt Rotramil for 999 says mythology must live on. Yes, indeed. Indeed it will. No, no doubt about it. So Patrick Foley for $10 says Armenianism, Calvinism and open Theism go. I don't have also symbology of the four living creatures and the Revelation, if you're interested. I'd rather talk about that. Like the other stuff, it's all one. It's all different versions of one thing that happened. You know, that all of, all of the west from the, from let's say the late Middle Ages, from the end of the Middle Ages until today is a. It's just this like, break apart. It's like pulling apart of the Incarnation and, and a lot of the problems have to do with that. They have to do with an incapacity to understand hierarchy, any capacity to understand how, how the world lays itself out in this kind of beautiful pattern and rather wanting to, to radicalize things and to see, like, is it God's will or is it free will? And it can't be one, it's one, it can't be the other. And if it's this kind of, you know, this kind of battle, which just doesn't need to be. If you, if you could just see the world in this, as this. This kind of flowing out, you know, it just. A lot of this stuff is not so symbology of the four living creatures in Revelation, if you're interested. And so I would. I think that the four living creatures, definitely, it's my understanding is that they're related to the four faces of the cherub and the four aspects of the divine chariot, you know. And so they're also related to the four gospels. That's the way I understand the four living creatures. And so it just has to do with something which becomes four. And so these animal totems, you would call them, I guess, manifest an aspect of the one, you know. And so in really almost in. In the same way that when we talk about how your animal passions are below and you know, your being is above and your animal passions pull you in different directions, it's actually the same pattern. It's just in a positive way, it's that you have the unity of the one riding the divine chariot. And then the four corners of the divine chariot manifest four different aspects which appear as animals. And so they're the positive aspect of this multiplicity, you know. And so that's the best way to understand it. You know, I'm not going to go into the specifics of the different faces, but you know, I probably talked about that in other places. If not, I probably should, but it would take too long to go into here. So. Gideon, you for 999 says I'm always very cautious about people selling religion. But you have described patterns I know, but couldn't describe. I'm looking into orthodoxy this year. Tradition is so bad for us. Well, thanks for that story, Gideon. I appreciate it. I'm happy to see that I don't come off as a. As just pro proselytizing. I hope not. I'm sure it happens sometimes, but I really try not to. I really. It's funny because growing up when I was young, like they would ask us to. To go door to door and like, you know, knock on doors and tell them how Jesus loved them. And man, that created such an aversion to evangelism in my. In myself, I always told myself it would never evangelize. Just hilarious because in a way, I guess it's like I'm kind of doing that, but I'm doing it in a way that I feel good about because I feel like I'm actually talking about reality, not trying to convince someone of some arbitrary thing that they need to believe to Be saved or something. Talking video games. I am Jesus Christ is coming out next year. I don't know what that sounds. Doesn't sound good. What's your take on retelling the story of Jesus in the form of a first person video game? You mean that you're Jesus? That doesn't sound right. That's not good. That should not. Don't play that game, folks. All right, Manson, Mason Bradford for five AUD says. Thanks, Jonathan. I watched a video recently in which Bishop Barron said that learning a foreign language can be seen as a spiritual exercise. Do you agree that's an interesting idea? It's an interesting idea in the sense that it can definitely be a very powerful exercise in perceiving the limits of your thinking and perceiving how your, your category structure doesn't encompass all of reality. Because you realize, like, I know two languages very quite like I'm perfectly bilingual in French and English and I are already. For me, it's such so useful to notice that there are actually some concepts which don't exist in French and then some concepts which don't exist in English. And so you realize how much the, how much language is related to the manner in which things kind of frame the world, you know. And so I would say it, it's. I would for sure suggest it to anybody to learn another language. So Chandler Turner says, to what degree are dreams real? Any thoughts on lucid dreams or visionary experiences like Swedenborg or Boehm? So the way that I like to explain dreams or talk about dreams is that dreams are really kind of this descent into chaos. Like it really is like this going down into the water. And so what happens is that it's kind of like, it is kind of like something like divination, like ancient divination, you know, it's like this chaos. So you, what is it? You throw the bones or you, you know, you look into a pool of water or you, you know, you, you do something chaotic, you stir a pool, then you look into the pool. And so that's really what dreaming is. So most of the time it's just a mesh of like, nonsense. But it can also become the body for a very high manifestation. So it's like, just like the chaotic waters are that out of which God pulled out all of the world. Then the same thing can happen to dreams is that it's like once in a while out of the, out of this chaotic mess of jumble of images, you know, it's like God can shoot, shoot a laser down and then a very, very Powerful image can come out of it. And that's why dreams can be prophetic. That's why dreams can be visionary. But most of the time they're not, Most of the time they're just whatever, they're just not, they're nonsense or they're, they're, you know, I, when you meet someone who talks about their dreams too much, like usually there's something off, like they're not too. It seems it can also be a form of escapism and you need to be careful about that. But nonetheless I think that, that dreams can be a place of visionary experience. And so, and yes, I think Swedenborg and Berm definitely had some insight. Like they definitely did have some insight. It was kind of mixed insight I would say, but definitely had some insight. So Stephen Anderson for $2 says I'd love your take on Avatar the Last Airbender. Yeah, I've never watched that, so I don't know. I, I think I watched that crappy movie that was made of the, of the, the anime which was just not good at all. So it didn't help. So leftistness for USD, for 10 to odds USD says could you speak on the tradition symbolism or ortho burial sites such as being returned to the earth, the 40 day and one year anniversary significance of why cremation is frowned upon? Yeah, you know, it's funny because I really, I know about the 40 days and I know about the whole process of after someone dies in the orthodox tradition and kind of the, the process, but I don't know it very well because I don't know a lot of people that have, have died in the church. And so it's something that I need to look into and I need to because I, I can kind of perceive something there, but I don't really know much about it. Cremation is frowned upon. That is, there's something very intuitive about that. It's something about the need to place the body down in the earth and it returning to the earth. I think that that's really important in terms of understand or let's say embodying what the end of life is, you know, and then also in terms of community, also kind of embodying what this return to earth is. And you know, it's, it's a way to manifest what is said in scripture. And, and I think that's probably why cremation is also frowned upon. But some of these traditions about burial and cremation and stuff are super deep. Like they're really, really very, at very base levels and they're difficult to understand apart from a kind of superficial understanding of them. So I probably don't have. I'm not, probably not doing this question justice. It's something I definitely want to look into before I die, I hope, or before someone. I. I am very close to Diesel. And so we got through all this. It is quarter to 11, not bad. I've been going like until 11 until now. So I'm kind of. I'm actually scrolling through the chat, which I rarely do, so hard to follow that. All right, so I'm gonna. What I'm gonna do, guys, is I'm gonna. I'm going to wish everybody a happy New Year. I know that's strange to say that with 2021 coming. I appreciate, you know, I appreciate everything you guys afford me in terms of watching. It's. I, I keep repeating myself, but I just. So excited to watch all these people kind of come up and I see them in the chat. Derek is there and I said, you know, Neil the Great is there. Brad, all these people that are kind of coming up and Christian. Who is there in the chat? Marianne, La Lisa. There's probably a lot more, but I'm just really excited to see people start to think symbolically and write and I feel like there's hope. And so I always keep saying the future is symbolic. There's no way around that it's happening. The world is changing and I think most people can feel it. And religion is coming back and the world is going to be re enchanted whether we want it or not. And that's for all the good and all the bad, like the light and the dark. You know, we're going to see things in the next few years which are going to be unthinkable even now. And things are going to get loopy and crazy and we're going to see things that we haven't seen in thousands of years are going to start to manifest themselves. And so, and so I'm just happy to see that there, that there's. Hopefully that we'll have some people who will have enough sense to, to be part of. Part of bringing things to light and to bringing light into things as well. So hopefully that doesn't sound completely obscure to you guys, but. But yeah, but get ready because, because, because none of this is over. It's just starting. And, and so, so Christ is born and glorify him. So I wish all you guys a happy new Year and a bit of time with your family to get some rest and get ready for the madness which is still on the horizon. So bye everybody. I'll talk to you soon. I hope you enjoyed this episode of the Symbolic World. The Symbolic World is edited by Justin Ward and it is based on a series of videos that you can find on my YouTube channel, Jonathan Pedro's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in in the show description and so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course leaving a review on itunes. Everybody knows that's the best way to get the podcast out there to get it heard. And if you want to get involved, you can also support the podcast financially going to www.thesymbolsupport or else on Patreon Pageau videos as well and on subscribestar. All those links you can find on my website or in the show description. So thank you and I will see you soon."}
