{"episode_id":"SW - #360 - 2024-10-10 - John Vervaeke - The Cognitive Science of Ritual","start":0.24,"end":22.16,"speaker":"John Vervaeke","text":"A proper part of being rational is the imperative to be more rational. So rationality is an inherently aspirational entity, which means at the heart of rationality is aspiration and transformative experience, which requires ritual because ritual is imaginal. Serious play."}
{"episode_id":"SW - #360 - 2024-10-10 - John Vervaeke - The Cognitive Science of Ritual","start":22.48,"end":33.77,"speaker":"Jonathan Pageau","text":"It's just funny because just with that you completely undermine the entire. The entire project of rationalism. That's true. I never thought about it. That because you want to be reasonable."}
{"episode_id":"SW - #360 - 2024-10-10 - John Vervaeke - The Cognitive Science of Ritual","start":34.09,"end":34.57,"speaker":"John Vervaeke","text":"Yes."}
{"episode_id":"SW - #360 - 2024-10-10 - John Vervaeke - The Cognitive Science of Ritual","start":34.65,"end":109.35,"speaker":"Jonathan Pageau","text":"Reason becomes aspirational and therefore has to be. You have to kind of imagine and project yourself into that space before you enter into it. Because why would you desire it if you couldn't imagine yourself in a. In a future state where you have to move towards that future state through imagination. This is Jonathan Peugeot. Welcome to the symbolic world. Hello everyone. I am back with John Vervaeke. You know, we just put out a video with. With himself and with Jordan hall and myself having a discussion. But today we are going to talk about John's upcoming class on ritual and cognitive science. I am extremely excited about this. You know, I can't wait to see. And it's actually fitting in some of the work that John is doing all around for the university, but then also other projects. So John. Yeah, I mean let's, let's start and tell us a little bit how this connects to your work in general."}
{"episode_id":"SW - #360 - 2024-10-10 - John Vervaeke - The Cognitive Science of Ritual","start":110.47,"end":377,"speaker":"John Vervaeke","text":"Thanks, Jonathan. It's great to be here. So in general, I've been doing a lot of work on the cognitive science of religion. I'm teaching a new course at the University of Toronto, a fourth year course, seminar course, you know, high level on the cognitive science of religion. And because I think the cognitive dimension of religion, how religion involves knowing, cultivating of wisdom, the transformation of the individual in ways that matter to it cognitively, I think is. Is not adequately well developed. On the other hand, there's a bunch of books that have been coming out. There was an initial wave of books that were rather officially. So that the cogsy of religion is hot right now. The first initial wave was somewhat hostile to religion, trying to explain it away, as you may expect, very much in the Enlightenment framework and mold. And then that has been superseded by a much more. Because a lot of the original proposals, I mean to be fair to these individuals, they presented them as scientific hypotheses. You know that for example, religion is about hyperactive agency detection. Right. And that's where it all comes from. And this has been subject to some pretty good criticism and demolished. It's good science. Right. They present a hypothesis, people have criticized it. The empirical evidence doesn't support it. And so we've moved into a second wave where people are stepping back and trying to say, you know, maybe there's some deeper functionality at here at work. Now what happens is they're still largely not paying attention to all the decades of work on the anthropology of religion and the philosophy of religion. They're paying a little bit more attention now to the philosophy of religion, which is good. So, but they're not paying attention to sort of broader philosophy. So, for example, in the course I'm teaching at the university, I don't start talking about religion until I think lecture four or five. I spend the first three lectures demolishing the Enlightenment set of presupposed dichotomies. Like, there's a clean distinction between fact, clean dichotomy between fact and value is an ought, all this kind of stuff. So all of this is happening, and I sought. I thought there's all these things, but they're not connecting, right? And they're not connecting. And what I like to do with my work is connect it. And the reason why I think connecting it is important is because I think what's happening right now and this. What's most calling me most deeply is I think there's an advent of the sacred happening right now in response to the meaning crisis. And as you know from a lot of my work, I don't think this is primarily carried by propositional knowing. I think it's carried by procedural, perspectival and participatory. And the thing where the behavior that's a bad term, but the behavior where that gets most educated and expressed is in ritual. And hence the move to really understanding, really trying to come up with a cognitive science of ritual, because although there's lots of good work here and there about what might call the cognition in ritual, by and large, that aspect, the cognitive dimension, how ritual might involve knowing or even give us a kind of metaphysics or a worldview is not been very deeply discussed. A lot of other important dimensions, which I readily and will repeatedly admit are at work in ritual. There's socioeconomic, there's cultural transmission, right? There's social role taking. There's obviously symbolic and theological aspects of ritual. I am not trying to explain them away or reduce them. I'm saying all of that's the case. But it seems like to me that what's missing and what even some of those other dimensions need is an account of, well, what's the cognition that's going on in ritual and how does it. Why should it matter? To us more. Because part of the. One of the courses that we're always ritualistic, we just don't realize that a lot of the rituals are implicit. And by that I don't mean the Freudian sense that we have neurotic behaviors. I mean, we do things that are properly understood as imaginal and inactive and as oriented aspirationally, et cetera."}
{"episode_id":"SW - #360 - 2024-10-10 - John Vervaeke - The Cognitive Science of Ritual","start":377.96,"end":442.81,"speaker":"Jonathan Pageau","text":"Yeah. And so one of the things that I've been doing in. In my work is in some ways trying to express or to help people see that there's a. Let's say there's a link, that there's a connection between ritual proper, the way we understand it, either civic, you know, civic rituals or religious rituals, that there's a connection between that and ordered behavior in general. Right. That in order to do anything, you have to order behavior towards a purpose. And one of the things that distinguishes what we most usually properly call ritual in, like. In the sense of like raising a flag or something like that, you know, that. That now there. There's something that's being engaged in relationship to meaning, which, you know, like when you're brushing your teeth, there is meaning there, but it's. It's very. It's very small. It's not about self understanding and about. And about how we participate with others. Whereas the types of rituals that we usually call rituals, they. Those have to. That's why they're. They seem different to us and they engage. What you call. Talk about the kind of imaginal space as well."}
{"episode_id":"SW - #360 - 2024-10-10 - John Vervaeke - The Cognitive Science of Ritual","start":442.81,"end":501.45,"speaker":"John Vervaeke","text":"Yeah, the imaginal. There's overlapping ideas again, I'm trying to draw them together. There's the imaginal. There's conceptual metaphor. We talk about. Do you see my point? Do you get what I'm saying? There's fictive language. The fence went all the way up the mountain. What? Like, fences aren't moving and then, you know, the whole mind in motion. You know, Robert Tversky, you know that I, you know, I'm abstracting and I'm moving through my. I'm moving through my argument. And these ideas are closely related to each other. So the imaginal is. In gesture itself, is pregnant in our cognition. And it's not ornamentation. It's a. It's an indispensable vehicle by which we think. There's a really good anthology that I'm going to make use of in the course called Thinking Through Ritual. Great play on words. The thinkers are thinking through ritual, but they're thinking. They're arguing about how we think through ritual by means of it and beyond it."}
{"episode_id":"SW - #360 - 2024-10-10 - John Vervaeke - The Cognitive Science of Ritual","start":501.77,"end":517.77,"speaker":"Jonathan Pageau","text":"Oh, that's. I mean, that's really interesting. And one of the things that we've noticed, I think we've noticed in, let's say, in the 20th century, there has been. I see it in Quebec specifically because this is where I live. I've seen a desire to de. Ritualize space."}
{"episode_id":"SW - #360 - 2024-10-10 - John Vervaeke - The Cognitive Science of Ritual","start":518.35,"end":518.67,"speaker":"John Vervaeke","text":"Yes."}
{"episode_id":"SW - #360 - 2024-10-10 - John Vervaeke - The Cognitive Science of Ritual","start":518.67,"end":563.67,"speaker":"Jonathan Pageau","text":"And it's. And it's explicit. And there's a sense in which, either consciously or unconsciously, people seem to understand ritual as superstition, as also a kind of tyrannical imposition on reality of identity. And so for that reason, the festivities that my ancestors used to engage with are always kind of being pushed to the side. And now even like, even though we had this nationalistic moment, you know, in the late 20th century, even those national rituals are eroding. You know, everything is kind of eroding. And so, I mean, I'd like to get your take on that. Like, what do you think? Why do you think that that is a tendency in the modern world to work against ritual, let's say so, part of it."}
{"episode_id":"SW - #360 - 2024-10-10 - John Vervaeke - The Cognitive Science of Ritual","start":563.75,"end":695.81,"speaker":"John Vervaeke","text":"And we'll touch a bit on this in the course. I mean, obviously not as deeply as a fourth year, 36 hour university course, but I mean, we're caught up in, you know, the dimensions of the Enlightenment dichotomies that really bias how we try and look at the phenomena of ritual or any religious phenomenon, to put it more broadly. And so we think, for example, really easy. Notice the idea that somehow we could peel ritual away and put it and then leave this purely secular space presupposes that we can sort of cleanly separate fact and value from each other. Right. And the point is, and this isn't from romanticism or weird, spooky, you know, German idealism or something like, this is the guts of, you know, you know, seminal analytic philosophy, you know, Wine and Putnam and Case, that this distinction has been this dichotomy. The pragmatic distinction is useful, but the idea of it being a radical dichotomy, a deep division in reality itself. Right. Has been completely undermined. And this goes right to the heart of my work, Jonathan, because relevance is. You can't. Relevance is simultaneously how we get facts while we're making evaluations like, there, there is no clean you and there. And there is no access to facts without relevance realization. And so the just, just the idea that somehow we could put aside our valuation projects and then just give this clean, secular space where it's just the facts, ma', am, just the facts, as they used to say. In Dragnet is actually a ridiculous presupposition. And then when you. And then the more aggressive side of this is, well, everything outside of this isn't connected to the facts and therefore it must be superstition, things like that. But if you realize, wait. At the core of your cognitive agency is relevance realization. You realize, wait, that whole picture is radically false. And it. And it actually doesn't give you a home in which to do rationality or science itself."}
{"episode_id":"SW - #360 - 2024-10-10 - John Vervaeke - The Cognitive Science of Ritual","start":696.21,"end":705.09,"speaker":"Jonathan Pageau","text":"Yeah, it's funny that just the facts Dragnet quote. I always fantasized about the person starting to list random facts of what's around."}
{"episode_id":"SW - #360 - 2024-10-10 - John Vervaeke - The Cognitive Science of Ritual","start":705.73,"end":707.49,"speaker":"John Vervaeke","text":"That are relevant to the case."}
{"episode_id":"SW - #360 - 2024-10-10 - John Vervaeke - The Cognitive Science of Ritual","start":707.81,"end":719.43,"speaker":"Jonathan Pageau","text":"It's like, you know, she was wearing pink shoelaces and it's like her fingernails were one sentence centimeter long. It's like, oh, no, no, no. Not just the facts. Actually facts that are relevant to the case, ma'."}
{"episode_id":"SW - #360 - 2024-10-10 - John Vervaeke - The Cognitive Science of Ritual","start":719.43,"end":720.15,"speaker":"John Vervaeke","text":"Am. Yeah, yeah."}
{"episode_id":"SW - #360 - 2024-10-10 - John Vervaeke - The Cognitive Science of Ritual","start":720.15,"end":920.24,"speaker":"Jonathan Pageau","text":"Anyway, so. So I always thought. But I think that's hilarious. After the success and the great reception of our first fairy tale book, Snow White and the Widow Queen, I am excited to announce the second book in our tales for once and ever series called Jack and the Fallen Giants. You know, as an artist, one of the things that I've always wanted to do as an icon carver, but in anything that I'm involved in, what I care about is making beautiful and amazing things. And I am so excited to see the beautiful book coming out, Jack and the Fallen Giants. It is illustrated by Eloise Charer, a young French artist that has really captured the boisterousness and the joyful tone that made me fall in love with the story of Jack and the Beanstalk when I was a child. And so I cannot wait for you to get your hands on this. You can see a preview on the website. You'll see what it looks like. And in order to do this, we are launching a new store for the symbolicworld.com youm can go to store.thesymbolicworld.com and there you will find a pre order for Jack and the Fallen Giants. We've decided not to do a Kickstarter this time. The book is printed, it is being sent to our warehouse. And so we're offering it on sale for people who want to get in early. And at the same time, there are also a very limited number of Snow White copies still available on the website. And so you can go there, you can get Snow White, you can go get copies of Jack, but you can also pre order God's Dog 2, the second book in the epic story of St Christopher, we are getting rave reviews coming in from the comic book industry, from the secular comic book industry, where people are really surprised and appreciating both the art and the epic story that is taking place. We are working right now on the third fairy tale book, which is Rapunzel, and the third God's Dog book. And so we're well on our way to continuing to give you the opportunity to participate in these amazing stories. So please go to the Symbolic World store right now and help us reawaken powerful stories in our culture. One of the things we did see, it seems, in. In the 20th century, well, actually since the Enlightenment, was a desire to replace religious ritual with civic ritual. And so you see that obviously reaching insane levels in the fascist and communist eras, where we basically worship the state and everything. All the spaces are organized. But what's fascinating about that is that that also seems to have eroded. And there's suspicion, right, about celebrating our nation. We see, in Canada, we see it almost, I mean, especially with the liberal government, this liberal, particular liberal government. There's almost like a disdain of our nation and disdain of the ritual spaces and the flag and all these things. And so it's interesting to notice how this, like, kind of tumble of ritual, where. And now ritual is under. Some people might appreciate ritual, but they tend to see it as personal thing, right? So if you say something like we do. I do meditation, then that's acceptable. But if you say something like, you know, like we celebrated, you know, Canada Day and sang the anthem and everything, then it's a little. Then it's suspicious. And so what do you think? Why do you think ritual has been brought to this individual level?"}
{"episode_id":"SW - #360 - 2024-10-10 - John Vervaeke - The Cognitive Science of Ritual","start":920.8,"end":1104.43,"speaker":"John Vervaeke","text":"Well, I think that's part. And another part of the Enlightenment dimensionality that was the space that was given to us, which is the hermeneutics of suspicion. I mean, and don't forget, you get that radical, totalitarian, vicious ritual in the French Revolution, the Reign of Terror, right? So it's also there at the beginning. So it's there at the beginning, it's there throughout. And it comes in culmination. And so. But because of Freud, because of Marx, you know, because of Nietzsche, you've heard me make this argument before. We've adopted our hermeneutics of suspicion. Now, this goes to a point in the course, but. And, you know, and this, you know, work I've been doing on the primacy of beauty, I did a course for the Peterson Academy on that based on DJ Schindler's work, you know, the hermeneutics of suspicion is based on a reality, illusion, judgment. You say I'm suspicious that this isn't the reality. There's a hidden motive, there's a secret agenda. Right. And that's, you know, and of course, that's sometimes the case. If it wasn't sometimes the case, we would just think the whole proposal was ridiculous. Yeah, but from Plato through to Marle Ponty, people have pointed out. But wait, right. That can't be the. That can't be the. The prior, the foregrounded or prioritized thing, because any judgment of illusion depends on a deeper judgment of realness. And that judgment of realness cannot itself be subject to the hermetics of suspicion, or you fall away and you can't make any judgments at all. And so where that shows up is people that do this. Right. And I do think, by the way, where we say appearances disclose rather than deceive about reality, that's beauty in the philosophical sense, not what we currently mean by beauty. Beauty just means sensual gratification. But the philosophical sense of beauty is that. So I call it the hermeneutics of beauty. And I think part of what ritual is is an enactment of the hermeneutics of beauty, by the way. But what happens is, because they don't fall into the abyss, we get the removal, liberal government, we get the removal of the rituals, but we get replacement by other rituals. And we get. Right. So we have all the rituals around. Identity politics. And they are rituals we tear down. We tear down statues, we. We wave flags, we make demonstrations. These are all symbolic acts that everybody knows aren't directly changing anything. What are they designing to? What are they designed to do? They're designed to reorient us. They're designed to point our attention. They're. They're designed to try and give us a different origin, a standard. Where do we stand? What do we stand? Listen to the language. Where do we stand? What do we stand for? Right. And what stands out for us? And so contrary to. I mean, I'm not disagreeing with you. I think these people think they're getting rid of all those superstitious rituals, but all they do is a surreptitious. Right. Replacement with a whole other set of rituals. Deeply, deeply, I would argue religious rituals."}
{"episode_id":"SW - #360 - 2024-10-10 - John Vervaeke - The Cognitive Science of Ritual","start":1104.67,"end":1109.38,"speaker":"Jonathan Pageau","text":"Well, yeah. The flag is the most surprising of all. Think of it like that. It's the."}
{"episode_id":"SW - #360 - 2024-10-10 - John Vervaeke - The Cognitive Science of Ritual","start":1109.53,"end":1111.61,"speaker":"John Vervaeke","text":"That that keep changing this symbol."}
{"episode_id":"SW - #360 - 2024-10-10 - John Vervaeke - The Cognitive Science of Ritual","start":1111.77,"end":1117.77,"speaker":"Jonathan Pageau","text":"Right. Because it's a. It's a symbol of. It's a tie. It's trying to ritualize fluidity."}
{"episode_id":"SW - #360 - 2024-10-10 - John Vervaeke - The Cognitive Science of Ritual","start":1117.85,"end":1118.33,"speaker":"John Vervaeke","text":"Yes."}
{"episode_id":"SW - #360 - 2024-10-10 - John Vervaeke - The Cognitive Science of Ritual","start":1118.41,"end":1162.18,"speaker":"Jonathan Pageau","text":"Which is like It's a. It's a weird. It's like a tantric move or something. It's like trying to. To. To ritualize fluidity. And. And so because of it, it always has to change, but every time it changes, it also has to capture. Right. So because, you know, your identity, let's say, I don't know, the national anthem or your flag, it captures you like it, you know, it commands your attention. It asks you to honor it and to treat it with respect and everything. So now you have this thing which is constantly changing, but is also constantly asking to keep up with it and to give it honor. And so although it's trying to be a celebration of change and diversity, it's like this weird tyranny of change. It's an odd thing to watch happen."}
{"episode_id":"SW - #360 - 2024-10-10 - John Vervaeke - The Cognitive Science of Ritual","start":1163.22,"end":1191.51,"speaker":"John Vervaeke","text":"And that goes towards two points. First is these rituals are ultimately not satisfying. Yeah. Because they are not for good. For good arguments from cognitive science. They're not deeply, you know, cognitively satisfying, cognitively transformative. And therefore there's a hunger for more. And that's. And within a framework, the only way to get the more is to intensify the action."}
{"episode_id":"SW - #360 - 2024-10-10 - John Vervaeke - The Cognitive Science of Ritual","start":1191.75,"end":1192.79,"speaker":"Jonathan Pageau","text":"Interesting idea."}
{"episode_id":"SW - #360 - 2024-10-10 - John Vervaeke - The Cognitive Science of Ritual","start":1193.19,"end":1193.55,"speaker":"John Vervaeke","text":"Yeah."}
{"episode_id":"SW - #360 - 2024-10-10 - John Vervaeke - The Cognitive Science of Ritual","start":1193.55,"end":1220.41,"speaker":"Jonathan Pageau","text":"So there's a constant intensification through the multiplication of the colors and the, you know, and also the acceleration of the change and also the increasing. Right. So you can see it like we used to have pride day, then week, then month, then we announced it was season. Right. Justin Trudeau said season. And you can see it's like this constant intensification kind of fill up the."}
{"episode_id":"SW - #360 - 2024-10-10 - John Vervaeke - The Cognitive Science of Ritual","start":1220.41,"end":1311.63,"speaker":"John Vervaeke","text":"Space of participation and a radicalization of membership, so it becomes more and more stringent. So this is typical ritual. So this is an anthropological theory, costly marker. So a lot of rituals are very costly. Like they demand a lot from people. And it's like, why? Well, the point is, the costly marker is a way of signaling to everybody, you can trust me because I wouldn't otherwise do this costly, useless behavior other than unless I was deeply, deeply committed. Now we talk about virtue signaling, but. Right, but. And I get it, some of it is people just playing along because they want a quick ride. There's always a free rider problem. But the radicalization by the true believers, if I can call them that, is part again of a function of ritual, which is costly signaling, which is, you can really, really trust me. And the thing is the costly signaling, it needs to be bound to deeper, real transformations and educations, or else you're really sort of draining people. And so this form. That's one argument, this form of ritualization has a real possibility of burning out like burnout. The other is, it's propositional tyranny. It's all at the propositional level. There's procedural, but they don't recognize the procedural and the perspectival and the participatory. So it's still all caught up in the level of beliefs and ideology and that's ultimately not reaching the meaning machinery."}
{"episode_id":"SW - #360 - 2024-10-10 - John Vervaeke - The Cognitive Science of Ritual","start":1311.87,"end":1321.31,"speaker":"Jonathan Pageau","text":"Hmm, that's really interesting because I mean, this idea of the costliness of the ritual, it can also help you understand initiation rituals in general."}
{"episode_id":"SW - #360 - 2024-10-10 - John Vervaeke - The Cognitive Science of Ritual","start":1321.63,"end":1396.7,"speaker":"John Vervaeke","text":"Totally. Yeah, exactly. Like, why do people. And part of what's happened, you know, and by the way, you know, these critiques I'm making are not. I can equally make critiques of the right and the Trump culture. Okay, I just did that because you brought up the liberal government. Right. This is so, this is in fact, I would argue that what's happening. The culture wars. But culture cultists. Right, right, right, right, right. The culture wars in America are really ritualized religious civil warfare. Yeah, that's what's good. Everything is done is almost, almost everything now is a ritual. There's actual. No, everybody notices it. There's no content. It's all costly display about your. Your allegiance to a particular religious orientation. And so I want to make it clear that I'm not landing, I'm not, I'm not trying to make an anti woke argument. I'm trying to point out that ritual is across the political spectrum. Far from it being absent, it has become more pronounced, but I think in a way that is ultimately pathological because it's tied to the hermeneutics of suspicion. It's tied to propositional tyranny. It's tied to the Enlightenment framework, which is actually crumbling."}
{"episode_id":"SW - #360 - 2024-10-10 - John Vervaeke - The Cognitive Science of Ritual","start":1397.82,"end":1424.72,"speaker":"Jonathan Pageau","text":"Yeah, yeah, yeah, yeah, yeah. And so the. I imagine one of the things also you're going to talk about in the class is related to, if talking about cognition, to the manner in which ritual participates in identity formation. Right. As much at the individual level as at higher level or whatever. And so, I mean, maybe you can say just a little bit about that because obviously that interests. Interests me."}
{"episode_id":"SW - #360 - 2024-10-10 - John Vervaeke - The Cognitive Science of Ritual","start":1424.72,"end":1548.53,"speaker":"John Vervaeke","text":"You know that. Excellent. So one of the things I can do there, I mean, there's a lot that goes on in identity formation. Right. And I'm again only talking about the cognitive dimension of it. I'm going to keep emphasizing that. Right. Because John Revaeke is not here saying your ritual doesn't have this theological meaning or it doesn't have this particular, you know, existential meaning to you. I am not, not, not saying that. But what I can talk about is. Well, one of the things, one of an important cognitive process in, in identity formation is what Agnes Callard calls aspiration. This is like I want. I want to be other than I am. I want to be a person other than I am. That's a fundamental identity change. And it's based on L. A. Paul's work on transformative experiences. We're going to talk about both of these women's important work in this. And so what do you have to do to go through aspiration, to go through transformative experiences? Well, you can't reason your way through it if what you mean by reason is making inferences, making using decision theory. You have to use imaginal serious play. You have to internalize the sage. You have to internalize the role model. You have to do dialogical practices. Right. And this I can all back. I can back this up with, you know, both good theory and good empirical evidence. Right. Even some recently done by. Well, he was my RA he's now got his PhD. He's now Dr. Jinsung Kim. I'll talk a bit about his work, about people doing aspirational projects in the university. Now here's the important point that I'm going to use Callard to make the desire. Okay, So a proper part of being rational is the imperative to be more rational. Right? So rationality is an inherently aspirational entity, which means at the heart of rationality is aspiration and transformative experience, which requires ritual because ritual is imaginal serious play. And this goes to."}
{"episode_id":"SW - #360 - 2024-10-10 - John Vervaeke - The Cognitive Science of Ritual","start":1548.69,"end":1565.86,"speaker":"Jonathan Pageau","text":"That's really, it's just funny because just with that you completely undermine the entire, the entire project of rationalism, you know, because that's true. I'd never thought about it that, that because you, because you want to be reasonable."}
{"episode_id":"SW - #360 - 2024-10-10 - John Vervaeke - The Cognitive Science of Ritual","start":1566.1,"end":1566.58,"speaker":"John Vervaeke","text":"Yes."}
{"episode_id":"SW - #360 - 2024-10-10 - John Vervaeke - The Cognitive Science of Ritual","start":1566.66,"end":1584.98,"speaker":"Jonathan Pageau","text":"Reason. Reason becomes aspirational and therefore has to be. You have to kind of imagine and project yourself into that space before you enter into it. Because why would you desire it if you couldn't imagine yourself in a future state where you have to move towards that future state through imagination."}
{"episode_id":"SW - #360 - 2024-10-10 - John Vervaeke - The Cognitive Science of Ritual","start":1585.38,"end":1669.85,"speaker":"John Vervaeke","text":"Notice way. Notice you're gesturing. You're right. And you're doing. And you're using perspectival and participatory knowing. Yeah, right. What's. What's it like to be that person? And who will I be? How will. What will the agent arena relationship be like when I am that person? And, and you know, this goes to very formal arguments from people at the core of like computational psychology. Like you can't But I won't get into the details. But if I'm in a weaker logic like predicate calculus, and I'm trying to get to a stronger logic, modal logic, and what stronger means, I can grasp more of reality with the logic. I can represent more. There's nothing I can do. And I can run all the possible logical permutations and I can't get from predicate logic to modal logic. I have to, I have to leap. Yeah, it's an imaginal leap. And I'm gonna. So those are the kinds of arguments I bring in to show. Again, John's on. I'm not gonna offer flaky romanticism. I'm gonna say no, no, really nuts and bolts arguments are saying that the imaginal is in the heart of the rational. And then I'll also do the reverse. Say, can we talk about a non propositional kind of rationality in ritual? Like Jennings and Shilbrech and others have been arguing, yes, we can."}
{"episode_id":"SW - #360 - 2024-10-10 - John Vervaeke - The Cognitive Science of Ritual","start":1671.77,"end":1695.73,"speaker":"Jonathan Pageau","text":"One of the things that has always interested me about ritual is in some ways the manner which ritual marks identity in time and space. So what I imagine is a good example is like you study in university, you do your exams and you have all these exams and you do all these things. And so now what?"}
{"episode_id":"SW - #360 - 2024-10-10 - John Vervaeke - The Cognitive Science of Ritual","start":1695.97,"end":1696.85,"speaker":"John Vervaeke","text":"Yeah, yeah."}
{"episode_id":"SW - #360 - 2024-10-10 - John Vervaeke - The Cognitive Science of Ritual","start":1696.85,"end":1737.12,"speaker":"Jonathan Pageau","text":"Like, are you, you're done with your studies. What does that, what does that mean? What, what are you. You're a master's now. You're. You're a doctor. And so it's as if there's a. There's an absolute need to mark the moment in. In in time and with some gesture of recognition to say that now this person is. Now this person is a police officer. I'm going to give him his badge, I'm going to give him his uniform. And it's a moment that transforms you from what you were before into what you are. And it seems like that is something that absolutely has to be ritualized, whether it's a signature or a handshake or whatever in order to mark."}
{"episode_id":"SW - #360 - 2024-10-10 - John Vervaeke - The Cognitive Science of Ritual","start":1737.6,"end":1738.32,"speaker":"John Vervaeke","text":"Here's why."}
{"episode_id":"SW - #360 - 2024-10-10 - John Vervaeke - The Cognitive Science of Ritual","start":1738.4,"end":1739.2,"speaker":"Jonathan Pageau","text":"Yeah, go ahead."}
{"episode_id":"SW - #360 - 2024-10-10 - John Vervaeke - The Cognitive Science of Ritual","start":1739.36,"end":1852.74,"speaker":"John Vervaeke","text":"Well, here's the cognitive part of why. This goes to recent work I'm doing on consciousness. So it's increasingly becoming a plausible proposal that the function of consciousness. Consciousness evolved to give us epic episodic memory. So episodic memory is when you remember episodes. So, you know, you have semantic memory, cats are mammals, or you have procedural memory. I know how to catch a ball. But do you remember what you had for breakfast this morning and what you'll do Is you'll create a little perspective and you'll run, you'll relive it. You don't just recall it, you relive it. That's episodic memory. And it looks like consciousness is or that. And then you go, well, why? I won't get into details. Because episodic memory allows you to solve problems you can't solve with just your beliefs and your skills. And, And. And episodic memory is bound up with narrative. Right. Narrative binds procedural, especially. Think about a story. Right. Perspectival and participatory knowing, character development, the viewpoint. Right. And then all of that stuff. And it binds insight into all of that. There's transformation. So we need narrative and episodic memory are actually integral to us being conscious of the world. And so when we want to be conscious of something to ourselves and other people, we're trying to create an episodic memory for it and a narrative around it. What does ritual do? Ritual takes you out of normal time and says, this is a special episode. It carves it off for you and puts a narrative around it. So it goes deep into episodic memory and therefore becomes something super salient to your consciousness and therefore becomes something that you can take into your autobiography in a powerful way."}
{"episode_id":"SW - #360 - 2024-10-10 - John Vervaeke - The Cognitive Science of Ritual","start":1853.06,"end":1869.23,"speaker":"Jonathan Pageau","text":"Yeah, that. I mean, that makes. That makes so much sense because then you're. Then you're. You're like, you meet this. You meet this girl, you start dating, you start, you know, and then it's like, it's just this flow of things that happen. And then you get married, right?"}
{"episode_id":"SW - #360 - 2024-10-10 - John Vervaeke - The Cognitive Science of Ritual","start":1869.23,"end":1870.27,"speaker":"John Vervaeke","text":"Yeah, yeah."}
{"episode_id":"SW - #360 - 2024-10-10 - John Vervaeke - The Cognitive Science of Ritual","start":1870.35,"end":1891.84,"speaker":"Jonathan Pageau","text":"And then everything about the wedding takes your relationship and everything about it symbolizes it crushes it together, brings everybody you know in one place, makes a ritual where you make promises to each other, which you've already done. Like, obviously, if you're there, you've already made those promises informally before, and you bring it together and then it crunches things into an. Like I said, a hyper episode."}
{"episode_id":"SW - #360 - 2024-10-10 - John Vervaeke - The Cognitive Science of Ritual","start":1891.92,"end":1892.4,"speaker":"John Vervaeke","text":"Yes."}
{"episode_id":"SW - #360 - 2024-10-10 - John Vervaeke - The Cognitive Science of Ritual","start":1892.4,"end":1915.03,"speaker":"Jonathan Pageau","text":"And now becomes a marker for my. My identity going forward because it's something that I can go back to and refer to very easily in my mind. It's like, date, we promise we did this. It's all together. Whereas before it was like, oh, we met this, you know, we. We started hanging out, we went on a few dates, we. Ya da da da. And then it's like, it's all these things that are maybe not as solid."}
{"episode_id":"SW - #360 - 2024-10-10 - John Vervaeke - The Cognitive Science of Ritual","start":1915.34,"end":1966.29,"speaker":"John Vervaeke","text":"Right. And so that's part of a broader thing that consciousness seems to be for. It's called chunking. Like when you're studying, if I give you like nine letters and they're just random and I ask you what, what were those letters 10 seconds later? I don't know. But if I rearrange them and they form those words. Yeah, if I rearrange them into words. Cat, pig, dog, you can do it like that. That's right. Right. And so that's called chunking, right. And it's a mnemonic strategy. And so doing the ritual is a form of chunking, like you said. You bring it all together and you make this mnemonic thing that's super salient and stands out. And what you're trying to do is you're trying to create a way in which your relationship to your partner is now literally more memorable to you and therefore you have a greater chance to reinforce your commitment. Things like that."}
{"episode_id":"SW - #360 - 2024-10-10 - John Vervaeke - The Cognitive Science of Ritual","start":1967.34,"end":2033.09,"speaker":"Jonathan Pageau","text":"Yeah. And also it's a common moment, right? Because let's say, even with your partner, it's like, I fall in love, she falls in love a little later. And each of us has these experiences that conversations that maybe we had is not that impressive to me, but had Mark. But then we have this one moment, you know, where it's like, this is, this is the moment. Right. We both agree that this is an important moment, that it's the moment of promise, it brings it all together. That makes sense. And so you can, you can almost understand any type of identity forming ritual as. And that, that would also explain, you know, anything like a swearing in of a judge, for example, like all of these things. And because the swearing in of the judge also now functions not just for the judge, but also for all of us. It's like, is he a judge? Well, yeah, he's a judge because on this day, you know, he put his hand on the Bible or whatever and made a promise and got his wig out of depending which, which. And then it was like, you know, and then from that on, from that on, we can all agree. Because we have an episode that we can refer to."}
{"episode_id":"SW - #360 - 2024-10-10 - John Vervaeke - The Cognitive Science of Ritual","start":2033.09,"end":2034.25,"speaker":"John Vervaeke","text":"That's right. And bind."}
{"episode_id":"SW - #360 - 2024-10-10 - John Vervaeke - The Cognitive Science of Ritual","start":2034.97,"end":2038.37,"speaker":"Jonathan Pageau","text":"We all agree that, that, that, that. Yeah, that's super, super interesting."}
{"episode_id":"SW - #360 - 2024-10-10 - John Vervaeke - The Cognitive Science of Ritual","start":2038.37,"end":2092.15,"speaker":"John Vervaeke","text":"So think about how this starts. It starts to make sense of the overall proposal in a way. The ritual is like what you do when you're studying. You're trying to make things, you're trying to chunk things together and create episodic memories, right. That are like what are called mnemonic strategies, ways of making things more memorable so you can recall them in a way. Right. That gives you much more access to them. Prospectival and participatory access, not just propositional. And that, like, when you're. If you're a good student, right. When you're studying for a test, you. You try. Those are the kinds of strategies that you try and use when you're studying. And so this is a way of knowing. This is a way of knowing, right? If we think that studying is a way of learning and knowing. This is a way of learning and knowing. It's a kind of studying. Now, I don't want to push that analogy too far, but it's a good analogy for what I'm trying to propose is going on with ritual. Yeah."}
{"episode_id":"SW - #360 - 2024-10-10 - John Vervaeke - The Cognitive Science of Ritual","start":2092.55,"end":2155.49,"speaker":"Jonathan Pageau","text":"Yeah. I mean, I think that is super interesting. I cannot wait to take this class. And so for those who are. Who don't know what we're gonna do, and this is gonna be a new experiment, is that John is gonna give the class and I'm gonna follow the class. And at the end, the very last episode, then we'll have a discussion about everything that John talked about. And so. And so I can't. I can't wait. And one of the things we talked about is that this can get complicated, right? Like, this stuff can get very complicated. And John is going to take you through, like, at the beginning, kind of step by step until by the end of the class, and you'll have all the. All the concepts and all the language needed to. To be able to interact with this, this. This content. And so I think it's going to be. It's going to be. It's going to be great. And how. Let's say, like, because you're doing this, this cog. Sav. Religion in university. And then. And this is more specifically about ritual. Are you going to talk about ritualization both in the religious and the secular? Like, are you going to."}
{"episode_id":"SW - #360 - 2024-10-10 - John Vervaeke - The Cognitive Science of Ritual","start":2155.49,"end":2178.31,"speaker":"John Vervaeke","text":"I'm going to. I'm going to prioritize the religious. I'll make reference to secular just to give people a sense of continuity. I wanna prioritize the religious precisely because what we were talking about at the beginning, which is sort of the attempt to marginalize the superstitious. And so I'm gonna foreground challenging that right from the very beginning."}
{"episode_id":"SW - #360 - 2024-10-10 - John Vervaeke - The Cognitive Science of Ritual","start":2178.55,"end":2194.24,"speaker":"Jonathan Pageau","text":"And so another question I had, because we often think of ritual as event, right? But have you thought about a little bit about the notion of ritual as space? Right. Also because there seems to be something in the way we organize space the same as how we organize it in terms of."}
{"episode_id":"SW - #360 - 2024-10-10 - John Vervaeke - The Cognitive Science of Ritual","start":2194.24,"end":2268.95,"speaker":"John Vervaeke","text":"But that's a mnemonic strategy. So again, like, okay, so I give. I Give a bunch of people a test? No, sorry. I give them some material to learn in room A, I bring half of them back two weeks later to remember the material in room A, half of them back in room B. That's all I've done, nothing else. Which group does better on average? Yeah, it makes sense, right? Because your memory is not just propositional content, it's perspectival, it's participatory. It does what's called transfer, appropriate processing. What was your perspective going into this? What kind of processing were you doing? And encoding specificity. What state were you in? The brain binds those all together. Because your brain is actually intelligent, more intelligent than enlightenment ideology. Your brain is trying to figure out how to make you an agent in the world. Wow, right. What a radical proposal. And so it's understanding that I need to constantly try to fit this person to a situation. That's what the learning is for. So organizing space, organizing time are part of this deep mnemonic aspect, which is a cognitive aspect. It's a way of learning."}
{"episode_id":"SW - #360 - 2024-10-10 - John Vervaeke - The Cognitive Science of Ritual","start":2269.19,"end":2277.84,"speaker":"Jonathan Pageau","text":"Yeah, but it seems also that the organization of space is. I mean, it sounds obvious when I say, but that it has to do with orientation."}
{"episode_id":"SW - #360 - 2024-10-10 - John Vervaeke - The Cognitive Science of Ritual","start":2278.08,"end":2354.88,"speaker":"John Vervaeke","text":"Oh, of course I'm going to talk a lot about orientation. We're going to talk a lot about orientation and the technical word for pointing, astension. How we point at things and we forget how unique and embodied this is for human beings. We use pointing in order to learn language. So pointing comes before. And there's a really good book out on it. I'll make a bit of reference to it in the course and orientation. All of these things come before and make our propositional knowing possible for us. But as far as we can tell, the only other organisms that get pointing, and that's because we bred them to do this for 50,000 years, are dogs. You try to get any other. We don't see pointing anywhere else. And dogs don't point for each other, they only point for us. Right. And so we forget how crucial pointing is and the organizing of time and space reorients us and gets us to repoint part of what it does. And I'll get into this in the course is it decenters us. It gets us to point away from the ego and towards. This is McNamara's idea about ritual being an act of decentering. It turns the arrow of relevance from this way to that way."}
{"episode_id":"SW - #360 - 2024-10-10 - John Vervaeke - The Cognitive Science of Ritual","start":2355.36,"end":2365.8,"speaker":"Jonathan Pageau","text":"Okay, so that's an interesting. So basically, let's say if I put up a poll, right, I put up something and then all of a Sudden that reference point now brings me out of myself, Right?"}
{"episode_id":"SW - #360 - 2024-10-10 - John Vervaeke - The Cognitive Science of Ritual","start":2365.8,"end":2366.4,"speaker":"John Vervaeke","text":"That's right."}
{"episode_id":"SW - #360 - 2024-10-10 - John Vervaeke - The Cognitive Science of Ritual","start":2366.48,"end":2370.24,"speaker":"Jonathan Pageau","text":"Into this pole. But what it also does is it makes it possible for others to do the same."}
{"episode_id":"SW - #360 - 2024-10-10 - John Vervaeke - The Cognitive Science of Ritual","start":2370.4,"end":2370.88,"speaker":"John Vervaeke","text":"That's right."}
{"episode_id":"SW - #360 - 2024-10-10 - John Vervaeke - The Cognitive Science of Ritual","start":2370.88,"end":2380,"speaker":"Jonathan Pageau","text":"Therefore it makes it possible. It makes group particip, group action more, more plausible or easier."}
{"episode_id":"SW - #360 - 2024-10-10 - John Vervaeke - The Cognitive Science of Ritual","start":2380.3,"end":2380.94,"speaker":"John Vervaeke","text":"You got it?"}
{"episode_id":"SW - #360 - 2024-10-10 - John Vervaeke - The Cognitive Science of Ritual","start":2382.06,"end":2391.94,"speaker":"Jonathan Pageau","text":"Yeah, that makes sense. And then you can understand then from there, once you understand that, then you can understand totemization. You can understand all kinds of more abstract processes."}
{"episode_id":"SW - #360 - 2024-10-10 - John Vervaeke - The Cognitive Science of Ritual","start":2391.94,"end":2405.98,"speaker":"John Vervaeke","text":"Right. And it's not silly superstition. Oh though, I mean, I'm speaking in a racist fashion because I consider it racist. So please, please don't misquote me on this. But you know, oh, the silly savages with their superstitious totem poles. Right."}
{"episode_id":"SW - #360 - 2024-10-10 - John Vervaeke - The Cognitive Science of Ritual","start":2408.11,"end":2421.43,"speaker":"Jonathan Pageau","text":"Like even not just a pole, but in a more abstract way of having some thing, you know, like in, in the native culture, like they would have a spirit animal. Right. Like spirit, the spirit animal that binds and they have different tribes that have different animals that bind them."}
{"episode_id":"SW - #360 - 2024-10-10 - John Vervaeke - The Cognitive Science of Ritual","start":2421.43,"end":2438.42,"speaker":"John Vervaeke","text":"Okay, but I'm going to talk about, I'm going to talk about that. I'm going to talk about that with work I did with Dan Chappie about the NASA scientists moving the rovers around on Mars. And, and this isn't my word. Berti, who did one of the best ethnography, say, sad, this is her term, they turn the rover into a totem."}
{"episode_id":"SW - #360 - 2024-10-10 - John Vervaeke - The Cognitive Science of Ritual","start":2438.58,"end":2448.1,"speaker":"Jonathan Pageau","text":"Yeah. And it had, it acted that way. It had to kind of act that way. And I remember that when you, the examples from, you gained. Some of the examples almost went into the magical."}
{"episode_id":"SW - #360 - 2024-10-10 - John Vervaeke - The Cognitive Science of Ritual","start":2448.42,"end":2449.14,"speaker":"John Vervaeke","text":"Oh yeah."}
{"episode_id":"SW - #360 - 2024-10-10 - John Vervaeke - The Cognitive Science of Ritual","start":2450.18,"end":2461.84,"speaker":"Jonathan Pageau","text":"That are not at all like, you can explain it, you know, the, the basic reasonable idea of yeah, we work together towards this thing. So it kind of acts as a binder for our thoughts and our action. But there were, there were more, there were stranger things going on."}
{"episode_id":"SW - #360 - 2024-10-10 - John Vervaeke - The Cognitive Science of Ritual","start":2461.84,"end":2489.99,"speaker":"John Vervaeke","text":"Well, they were talking like sympathetic magic. These hard nosed engineers. Yeah, very much, very much. And they were very worried that they were talking that way. But they didn't have any. Because of the Enlightenment economies. They didn't have any other language of talking about it. And they thought they were trying to be honest to their experience and I give them credit for that. And so they were, they were forced to use this language and then they were very nervous about using it because. Right, well, because of the Enlightenment economies."}
{"episode_id":"SW - #360 - 2024-10-10 - John Vervaeke - The Cognitive Science of Ritual","start":2490.07,"end":2532.72,"speaker":"Jonathan Pageau","text":"Yeah, yeah, yeah. Oh, this is going to be great. I guys, I cannot wait. I am really excited about this. And we said it is going to start on October 7th. That's right, October 7th at 2pm that is when it starts. And then it's going to go for six weeks. We're going to have one week in there. That's going to be a break. But that it'll, it'll go from then look down in the description. We'll have a link for you to be able to sign up for the class. And like, if you show up live, there'll be a possibility of engaging. There'll be Q and A discussion. We'll have moderators that will be able to manage that. And then on the last day, we'll have our final discussion and engage in Q and A. So this is. I'm, I'm excited about this."}
{"episode_id":"SW - #360 - 2024-10-10 - John Vervaeke - The Cognitive Science of Ritual","start":2532.72,"end":2547.53,"speaker":"John Vervaeke","text":"Can't wait to see it. Me too. I'm really looking forward to it. I think this topic is pertinent and has the potential to be profound, and I welcome. I actually proposed to you and you were very generous about it, making this more dialogical, which I really wanted. So thank you about that."}
{"episode_id":"SW - #360 - 2024-10-10 - John Vervaeke - The Cognitive Science of Ritual","start":2547.77,"end":2553.13,"speaker":"Jonathan Pageau","text":"All right. And so everybody show up. I can't wait to see you. And John, thanks again for all your insight."}
{"episode_id":"SW - #360 - 2024-10-10 - John Vervaeke - The Cognitive Science of Ritual","start":2553.45,"end":2555.45,"speaker":"John Vervaeke","text":"Well, thank you. I'm looking forward to this."}
