{"episode_id":"SW - #267 - 2022-12-31 - Luke Burgis - Revenge of the Scapegoat","start":0.32,"end":54.14,"speaker":"Luke Burgess","text":"I think it's really important to get at this idea of the scapegoat mechanism becoming less effective because of society's concern for victims. Girard would say our concern for victims is the universal value that now unites the world. Pretty much, who will you ever find that says that you shouldn't be concerned with victims or people being injustice? And Girard says this is really the fruit of the revelation of the scapegoat mechanism. We've now seen something that we can never unsee. And it sort of led over 2000 years, it led over a very long period of time to that becoming the most important value in the world to the point that there's now mimetic rivalry over who can be the best victim, because nothing confers more status and power than becoming a good victim. It's a weird, weird paradox and inversion of, like, the true nature of Christianity."}
{"episode_id":"SW - #267 - 2022-12-31 - Luke Burgis - Revenge of the Scapegoat","start":64.92,"end":109.64,"speaker":"Jonathan Pageau","text":"This is Jonathan Pedro. Welcome to the symbolic world. Hello, everybody. I am here with Luke Burgess. We've been trying to meet for months. Actually, we finally were able to meet. He is the author of Wanting the Power of Mimetic Desire in Everyday Life and an expert on. And, you know, he's been following what I've been doing as well and seeing me talk about sacrifice and Renee Girard. So I'm definitely excited to see, you know, what kind of insight he can bring to us. So, Luke, it's good to meet you. Tell us a bit about. About what brought you to thinking about Girard and mimetic desire today. Yeah."}
{"episode_id":"SW - #267 - 2022-12-31 - Luke Burgis - Revenge of the Scapegoat","start":109.64,"end":367.11,"speaker":"Luke Burgess","text":"Well, I'm glad we finally got to make this happen, Jonathan. I've been following your work for a while, and it was a consolation for me in the dark days of the pandemic. Yeah. So I think fundamental to Girard is he explained the nature of desire in a way that I'd simply never heard before. And I came across his work after I myself had underwent a complete revolution in my life in my late 20s. Sort of a religious conversion, like a very sort of dramatic spiritual conversion. And I realized that the very nature of it was related to my own desires. The nature of desires. I'd never sort of understood a telos or teleology to desire before. And then I realized that I had some. But I went most of my life totally blind to my own desires, as most of us are. Right. And in many ways, I still am. So Gerard's work, having revolved around desire, was especially intriguing to me and gave me some language to sort of understand humanity and myself both. And fundamental to Girard's thought In my opinion, is that human beings are religious creatures. Even if you don't think you are, we're religious creatures. And if you don't sort of accept that premise, there's all kinds of things about the world that you won't understand. I know that, you know that, but, you know, this was really eye opening to me, sort of an understanding the world. And in my opinion, what's central to his thought is the human desire for transcendence. And Girard articulated his notion of desire in a very sort of spiritual way, that human beings seek transcendence whether they know they are or not. And the notion of transcendence is the thread that I think runs through all of Girard's work. The very idea of the scapegoat mechanism, for instance, is a form of false transcendence. It's a form of people trying to achieve something beyond themselves and prevent some form of destruction, but it's a form of false transcendence. So as one who had been striving my entire life for something that I couldn't quite put my finger on, Gerard helped me make sense of so much of the kind of religious quest and search that I was on, which I didn't even, quite frankly know that I was on until he sort of introduced me to some very ancient concepts, quite frankly. Right. Like fundamental things that at least religious traditions have known for a very long time, especially in Scripture. And he sort of gave me a lens to see those things in an entirely new light. In some senses, I was a bit arrogant in the way that I approached the sort of religion of my youth, like reading the Bible. It doesn't have anything very interesting to say to me. You know, Augustine of Hippo thought the same thing when he first read the Bible. Right. It's not very. In many, many cases, not very beautiful language. There's some weird things going on. I was a bit similar to that. And Gerard sort of gave me a lens like glasses to sort of see myself in the story and to realize that I'm a participant in this story and to sort of see the way that I was part of that story. So Gerard couldn't be more relevant, I think, to the modern world, that he explains so much when it comes to the world grappling with false ways of trying to achieve transcendence and is so relevant to your work, I think, because Girard was an expert at recognizing patterns. So he recognized patterns in human behavior. He recognized patterns in the nature of human desire, a structure to desire, specifically mimetic desire. And he recognized so at the micro level, he recognized these patterns. And at the macro level, he saw that these problems of desire manifest themselves in patterns of conflict, rivalry, and violence at the macro level in human culture."}
{"episode_id":"SW - #267 - 2022-12-31 - Luke Burgis - Revenge of the Scapegoat","start":367.35,"end":378.47,"speaker":"Jonathan Pageau","text":"So what is the relationship? Could you talk about this idea of the desire for transcendence? And so what is the relationship between mimetic desire and the desire for transcendence?"}
{"episode_id":"SW - #267 - 2022-12-31 - Luke Burgis - Revenge of the Scapegoat","start":378.89,"end":539.03,"speaker":"Luke Burgess","text":"So mimetic desire, if you're hearing the word for the first time, or the term for the first time, Girard sort of coined this phrase, mimetic desire, to say that human beings do not create their own desires ex nihilo, out of nothing. Right? Desire is not our own creation. And there's a whole theology behind this. Right? We can go back to sort of creation theology and the creation of the world. You know, I'm not the author of all of my own desires, even though, you know, many of us think that we are, right a lot. So the nature of desire, because we're social creatures, because we're part of a story, we affect each other, right? And we affect each other's desires. And mimetic desire simply means imitative desire. So we imitate the desires of other people as part of the social process. So desire is formed through this highly social process, through rituals, through the culture that we're part of, and especially through specific people or groups that have a special importance to us that act as models or mediators of our desire. So if you grew up in a strong, religious, Christian home, some of your models of desire might be the saints. If you grew up in other kinds of communities, Every kind of community has certain models of desire. These are people that are sort of held up as exemplars. They bind people together. In sports, there might be some really great professional athletes that act as models of desire. So models of desire help inform our own desires and give shape to those desires, whether we know it or not. And we usually don't know that this process is happening. But the reason that models of desire affect us, the reason that they have some power over us in the first place, according to Girard, is because we are seeking a sense of transcendence, and we're looking for a higher level of being to move into some higher level of reality. And we look to people that model various desires to us as maybe possessing some quality of being that we lack, some quality of being that we lack. And we sort of enter into their orbit for better or worse, right? This can work in positive ways or negative ways. I can think of all kinds of positive examples of entering into the Orbit of somebody who's modeling a desire for something like, good and noble. But very often we sort of look to our right and our left and we find somebody that appears to have some quality of being or some higher level of being that we seek, and they become models of desire for us in some way."}
{"episode_id":"SW - #267 - 2022-12-31 - Luke Burgis - Revenge of the Scapegoat","start":539.91,"end":573.92,"speaker":"Jonathan Pageau","text":"It seems to become extremely true in the world of influencers, like the YouTube, Instagram type influencer, where in some ways the person is really just does become a focus of desire. They. They just buy a bunch of stuff, they wear a bunch of clothes. They. It's not actually a quality that is, they don't seem to have virtues. They just seem to actually be desire holes, like. Like vortexes of desire that are celebrated because they're able to. We can live our. Our excessive desires kind of through them. Something like that. It's very odd."}
{"episode_id":"SW - #267 - 2022-12-31 - Luke Burgis - Revenge of the Scapegoat","start":574.19,"end":628.54,"speaker":"Luke Burgess","text":"Yeah. So it's the influencer, it's the model that has the power over us. It's not the objects themselves. Right. It's like the definition of mimetic desire is that the choice of the objects that we're fascinated with come from the model and not from the objects themselves. Right. Not from any objective qualities of the objects. They're just imbued with some kind of symbolic, magical quality because of whoever our model of desire is. Right. Like what's a watch other than some kind of talisman of some kind of, you know, weird status that every man over a certain age that works on Wall street wears like one of six different types of watches that all happen to be in the magazines that you see at Hudson News and airports. They're symbolic. These things are literally symbols of some kind of quality of being or something like that. Right. So these models have. Are what's powerful for us, not the objects themselves."}
{"episode_id":"SW - #267 - 2022-12-31 - Luke Burgis - Revenge of the Scapegoat","start":628.72,"end":628.88,"speaker":"Jonathan Pageau","text":"And."}
{"episode_id":"SW - #267 - 2022-12-31 - Luke Burgis - Revenge of the Scapegoat","start":628.95,"end":680.28,"speaker":"Luke Burgess","text":"And this creates problems, a lot of problems, because we have a love hate relationship with anybody who's a model of desire for us because those same people act as obstacles to us. Right. Because then we start competing with them for the same things and measuring everything that we do according to the models. So this leads to rivalry. Right. This is a huge part of Gerard's theory, is that mimetic desire, the fact that our desires are formed through the social process with other people, leads to conflict and to rivalry and some really weird things. Right. Like Girard said one time, I think the reason that we talk about envy so much is that nobody wants to talk about sex. Right? Like, envy is the form in which mimetic desire takes in the modern world. And then you have somebody like In Montero, there's some line where he says, I want to f the ones I envy."}
{"episode_id":"SW - #267 - 2022-12-31 - Luke Burgis - Revenge of the Scapegoat","start":680.68,"end":681.24,"speaker":"Jonathan Pageau","text":"Yeah, Right."}
{"episode_id":"SW - #267 - 2022-12-31 - Luke Burgis - Revenge of the Scapegoat","start":681.72,"end":705.76,"speaker":"Luke Burgess","text":"So, you know, this crude way that's literally like Gerard, like Gerardian, most Gerardian statement that he could possibly make, because the reason that he wants to have sex with the person he envies, the person that he envies is somehow a model of desire for him. And through that act, you're somehow achieving some form of equality with the being of the model. Right, yeah."}
{"episode_id":"SW - #267 - 2022-12-31 - Luke Burgis - Revenge of the Scapegoat","start":705.76,"end":710.12,"speaker":"Jonathan Pageau","text":"Some kind of integration. You're like integrated to them or joined with them somehow."}
{"episode_id":"SW - #267 - 2022-12-31 - Luke Burgis - Revenge of the Scapegoat","start":710.36,"end":761.47,"speaker":"Luke Burgess","text":"Yeah, yeah. So we have a love hate relationship with models that leads to rivalry, ultimately misery. And then on the macro level, that plays out in very strange ways in our society as well, which is a whole nother part of Gerard's theory. But going back, I mean, this all has to do with transcendence, in my opinion, this human desire to sort of go beyond their current level of being. And there are sort of vertical forms of transcendence which are found, you know, really mostly in religion, spirituality. And then there are what I would call sort of horizontal forms of transcendence where we try to find transcendence in all kinds of strange ways. Right. Like through shape shifting and transforming our identity and changing jobs and looking for it in all the wrong places, basically."}
{"episode_id":"SW - #267 - 2022-12-31 - Luke Burgis - Revenge of the Scapegoat","start":762.03,"end":802.95,"speaker":"Jonathan Pageau","text":"Yeah, yeah. And so. So the vertical transformation of the vertical call for transcendence could account also for things like generals, let's say, Alexander, or people who inspired their men to have certain qualities. And so it's not all positive, but it. It would. You know, he would appear as someone who kind of drew people's desire into him and they would see him as an example, but also someone to impress, someone to outdo all this kind of happening. I imagine in sports you can see that quite clearly as well in terms of the relationship between players within a team and then with the other team, how those things play out in terms of mimetic desire."}
{"episode_id":"SW - #267 - 2022-12-31 - Luke Burgis - Revenge of the Scapegoat","start":803.35,"end":855,"speaker":"Luke Burgess","text":"Yeah. I mean, a sports team that kind of loses some. That loses some kind of transcendent purpose, like some kind of like telos outside of the team itself, just locker. The locker room just evolves very, very quickly. Right. You sort of like, forget what it is that you're. That you're doing. And I guess that's why, like, I don't know, like why some players or teams that win all of the time, like, what. What's. What's next in the teleology for that team, like what. What happens next? Right. And that's usually why people don't stay on top for very long because you can only sort of go so far. And if you're seeking, like, what's next? Right. I don't know. You win the super bowl three times in a row, what can you possibly do? I don't know. Tom Brady goes to the hall of Fame. Like, at some point it sort of exhausts its purpose for exhausted by the."}
{"episode_id":"SW - #267 - 2022-12-31 - Luke Burgis - Revenge of the Scapegoat","start":855,"end":865.64,"speaker":"Jonathan Pageau","text":"Category of the sport itself. It's like, you know, now are we going to go like, take over a country? No, that doesn't work. Like, it's like you reach the limit and then it's held in by that very category. Yeah."}
{"episode_id":"SW - #267 - 2022-12-31 - Luke Burgis - Revenge of the Scapegoat","start":865.72,"end":987.4,"speaker":"Luke Burgess","text":"So it happens in sports teams. This happens within companies all of the time. You know, I think, you know, we live in a world where there's a hierarchy of values, There's a hierarchy of being. Again, this is a very ancient religious concept. Right. And I think modern, in the modern world, people that reject that idea do all kinds of weird things that end up resulting in more conflict and not less. Right. They do things in the name of. In the name of progress that actually increase conflict. So to give you an example, if there's a hierarchy, if we live in a hierarchical world and people are sort of looking to other people as models of desire, by the way, it's very important for a culture to have positive models, period. But especially positive models. So there's a weird thing happens. One of the stories I talk about in the book is zappos.com decided to move from a more traditional management structure, which they have their problems. Right. I'm not a fan of bureaucracy or anything like that, to just totally collapsing the entire hierarchy overnight. Turned everybody that worked there into very confused and in total crisis mode and chaos. Because they literally collapsed their entire hierarchy almost overnight. I don't think that they understood sort of the nature of reality itself is hierarchical. And if you're going to collapse it visibly, what happens is that an invis hierarchy sort of develops under the surface that becomes like a dragon. You don't even know it's there. You don't even know how it operates. Right. I think something similar is happening with the sexes where we sort of like, not necessarily collapsing hierarchy, but collapsing difference. Right. Like collapsing difference and not admitting of complementarity, not admitting just fundamental things. It leads to a situation where people are trying to reconstitute some form of hierarchy in all kinds of different ways. Because we. We have like a need to do that."}
{"episode_id":"SW - #267 - 2022-12-31 - Luke Burgis - Revenge of the Scapegoat","start":987.96,"end":1052.59,"speaker":"Jonathan Pageau","text":"Yeah. And you end up having both confused identities. You have these confused kind of gender roles and gender identities but you also have hyperversions of extremes. You know, I pointed this out to someone recently. You know, people think that it's only that this kind of leveling of gender only leads to, let's say, all the letters and all this kind of fluidity, but it also leads to, you know, hyper masculinity and the kind of hyper sexualized masculinity and hypersexualized femininity. The types of characters you see in media today, like this kind of hyper male and let's say, kind of horror woman, something that would never, never have been public in the world, you know, for thousands of years. You never would have seen these kind of characters paraded out in public. But now it's become completely normal to see these hypersexualized beings, you know, and hypergendered beings in ways that are. That are very surprising. And at the same time, watching everything become fluid and break down in terms of identity at the same time, it's like you need a proper, like you said, proper hierarchy that leads to some kind of real transcendence."}
{"episode_id":"SW - #267 - 2022-12-31 - Luke Burgis - Revenge of the Scapegoat","start":1053.31,"end":1106.98,"speaker":"Luke Burgess","text":"Right? Yeah. So I. I've. Big part of Gerard's thinking does have to do with sacrifice, and that's kind of what I would call the societal macro, community level pattern that he recognized. Right. Something that happens at the community level, because when a person, when anybody is seeking transcendence, there's sort of something that has to die in order for them to achieve this sort of different quality of being that they're looking for. Right. So that happens at the individual level, but it can also happen kind of at the societal level. And, you know, I've listened to your. Your kind of theory on sacrifice, and I know you mentioned Girard in it, but I'm just curious as to. Do you think that Girard's sort of idea of the scapegoat mechanism squares with what you were saying, or do you think it's sort of just like a subset of a larger kind of theory of sacrifice?"}
{"episode_id":"SW - #267 - 2022-12-31 - Luke Burgis - Revenge of the Scapegoat","start":1107.38,"end":1226.43,"speaker":"Jonathan Pageau","text":"That's what I think. But, I mean, maybe you can help me understand it better for me to change my mind. I'd be fine with changing my mind, but it seems when I look at sacrifice, what I see, the Yom Kippur sacrifice is probably the best version of a sacrifice because it's an atonement sacrifice. It's an, you know, it's an at one mint sacrifice. It's the. The sacrifice that makes us one, and it has two sacrifices as part of it. There is, on the one hand, the scapegoat sacrifice. Literally, where you take a goat, you put all your. All your evil on it, and you kind of kick it out, you abuse it, whatever, and then it falls off a cliff or it runs into the desert to. To be become food for the demon. But then you also have another sacrifice, which is the pure animal, which is sacrificed up towards God. And what I see in sacrifice, at least in Scripture, is those two types of sacrifices, one which could be called a scapegoat sacrifice. And you see it in a lot of cultures. Sacrificing a prisoner, sacrificing. You know, you see, they did it even all the way up to Roman times when they would have people fight in the. In the arenas. It was basically a human sacrifice of their cap. Their captives in order to kind of manifest the glory of Rome in doing it. But then you also have a sacrifice which I would call a vertical sacrifice, which is giving the best up, and you give the best up. And then that. That is part of what constitutes the body. And I talked about it, like, let's say in terms of sports team. On the one hand, you do have to scapegoat in the sense that you can't let anybody into your sports team. Right. You have to eliminate behaviors and players that don't fit into the team. That's necessary. But then you also need to give your intention and your will and your best up towards the goal of what you're doing. So that's what I see these two. And so I don't know if Gerard accounts for them with his scapegoat sacrifice or if he has two theories or I don't know."}
{"episode_id":"SW - #267 - 2022-12-31 - Luke Burgis - Revenge of the Scapegoat","start":1226.75,"end":1251.89,"speaker":"Luke Burgess","text":"Yeah, I don't think there's any conflict between what Gerard is saying and kind of what I've heard you articulate, which is just simply like a broader view of sacrifice. I don't think Gerard. I think he identified a very particular kind of sacrifice. And I agree with you that there's all kinds of other sacrifices that don't necessarily fit into the pattern of the scapegoat mechanism, necessarily."}
{"episode_id":"SW - #267 - 2022-12-31 - Luke Burgis - Revenge of the Scapegoat","start":1251.97,"end":1317.87,"speaker":"Jonathan Pageau","text":"It's like him identifying that has been amazing. I think it's been really cool to understand Christianity, but then also to understand the 20th century and to understand a lot of the things that. That we went through, you know, as Christianity kind of started collapsing as well. And did Gerard talk about. Because one of the things that we say myself and also the people at Lord of Spirits, is we say, you know, Christ is both goats. That is, in the Yom Kippur sacrifice, Christ seems to be both the one who accepts to be the sacrifice of the stranger outside the city, who takes on the sins, who accepts the blame, all of that. But then he also is something like the sacrifice of the firstborn. And the sacrifice of the firstborn, even in Scripture, is not the same as the scapegoat sacrifice. So I don't. I don't know. Like, I also don't know if Gerard accounts for that idea. Like when. When Abraham is going to sacrifice Isaac, it's not a scapegoat sacrifice. He's supposed to offer his best up to God. And so I don't know. Yeah, these are things that I think about, but I'm not an. I don't know Gerard well enough to be able to."}
{"episode_id":"SW - #267 - 2022-12-31 - Luke Burgis - Revenge of the Scapegoat","start":1318.51,"end":1350.15,"speaker":"Luke Burgess","text":"Yeah, well, I want to go back to your idea of sort of horizontal and vertical sacrificing up triggered an idea. So I want to get. But what you're saying now brings up questions like atonement theology that are super complex, and we don't need to necessarily get into those right now. But there is an idea, I think you have to be careful, that there is one conception of Christ's sacrifice on the cross as sort of God needing some kind of blood sacrifice. Right."}
{"episode_id":"SW - #267 - 2022-12-31 - Luke Burgis - Revenge of the Scapegoat","start":1350.39,"end":1352.63,"speaker":"Jonathan Pageau","text":"Yeah, I don't see it that way either. No, I don't like that."}
{"episode_id":"SW - #267 - 2022-12-31 - Luke Burgis - Revenge of the Scapegoat","start":1352.79,"end":1484.76,"speaker":"Luke Burgess","text":"Neither do I. Right. And Girard, in his earlier days was sort of implying that. And then he befriended this old priest. I shouldn't call him old. I don't know how old they were when he met. But in Austria, Father Raymond Schwager, who sort of helped Girard understand the theological implications of what he was saying. And, I mean, I come from just a very old tradition of Augustine and Aquinas and Gregory, of Nyssa and Irenaeus. And my understanding is that God could have achieved the salvation of the world in many different ways, needed not be that particular way. But this was a sacrifice of love. Right. And in some senses, it was this, the most perfect sort of way, but needed not be that. So in other words, it's not like we chose to affect what we thought was going to be yet one more effective scapegoat mechanism. And yet the whole thing was subverted by the sacrifice of Christ on the cross because the Holy Spirit sort of enlightened the minds after the resurrection of a very, very small group of Christians that for the very first time, sort of saw the mechanism that was taking place and saw what we had brought on ourselves. So there's a big difference by us sort of being responsible for the violence and God being responsible for the violence. Right. Big difference. Right. So it's the revelation that we had. So God gave the revelation for us to be able to see the scapegoat mechanism in its fullness for the first time through the crucifixion. It's not the first time that it was ever. There were never hints of it. I mean, the Old Testament is full of the story of Joseph and his brothers gives us a perspective of what's going on that there's really no comparable. For in any other kind of literature. Like we see that Joseph is innocent and sort of the victim of the scapegoating through the whole story. It's almost like we have the director's cut from the standpoint of Joseph or something. Right. And we know that he's not responsible for that."}
{"episode_id":"SW - #267 - 2022-12-31 - Luke Burgis - Revenge of the Scapegoat","start":1484.76,"end":1571.97,"speaker":"Jonathan Pageau","text":"Yeah. It's hard to sacrifice is one of the hardest things to think about, by the way, to be honest. It is so difficult to think about because in some ways so primordial and so encompassing. But so one of the things you see, I think this is my, my perception also of what Christ is doing. One of the things he's doing is that by willingly becoming someone's scapegoat, you could say he's kind of flipping or joining the two sacrifices together, where in his willingness to die for others, you could say he's turning the scapegoat sacrifice into something like the, the sacrifice of good odor. Right. This idea of like, of the best, which is given up. And the reason also why I think that that's happening is because then you see that pattern modeled in the early Christian martyrs, where the martyrs are basically saying, I'll be your scapegoat. And then that scapegoat will become like a. A sacrifice of worship up to God. And it's going to secretly change you without you even knowing what's going on. It's like if I, if I do that and I don't, like I tell people, like, I don't want to do that. Like I don't want to die. I don't want to. I don't want people to kill me. I. I'm not. But. But I can see it, that that seems to be what's going on. It's like there's a mechanism, it really is like a mechanism where self sacrifice seems to be the place where these two sacrifices get joined. And it's like a refounding of reality if you do it properly."}
{"episode_id":"SW - #267 - 2022-12-31 - Luke Burgis - Revenge of the Scapegoat","start":1572.77,"end":1686.56,"speaker":"Luke Burgess","text":"I think that's right. And that's the idea of self sacrifice is the key to, I think, understanding Christianity. And what's happening in liturgy as well. So God willing, you or I will not have to become red martyrs, blood martyrs, and physically, who knows, and give up our bodies and blood. But what's happening in the Christian liturgy in Orthodox and in the west is a participation in that self sacrificial act on the cross. Right? So it's what the early church called white martyrdom, or it's still a form of dying to yourself and self sacrifice, that if you really understand what's happening, you're sort of uniting your self sacrifice to Christ's self sacrifice on the cross. And it's all being offered, offered. And there's something really beautiful about that and remembering. Part of a liturgy is anamnesis. It's a remembrance of what has happened. It only had to happen once. It doesn't mean that we can't continue to participate in it, but it's a remembrance of that singular event and also, very importantly, a remembrance of. I mean, this is why Good Friday is so important. And I always, for me, it's always like one of the most, I mean, solemn and powerful sort of liturgies of the year because it's a remembrance of the scapegoat mechanism and what the pattern of human behavior. It's almost as if we default back to the old rites, to the old sacrificial rites that involve not self sacrifice, but sacrifice of other people to preserve ourselves. So there's an element of like self preservation in sacrifice."}
{"episode_id":"SW - #267 - 2022-12-31 - Luke Burgis - Revenge of the Scapegoat","start":1686.72,"end":1687.52,"speaker":"Jonathan Pageau","text":"Yeah, of course."}
{"episode_id":"SW - #267 - 2022-12-31 - Luke Burgis - Revenge of the Scapegoat","start":1687.84,"end":1715.4,"speaker":"Luke Burgess","text":"Huge element of, to protect myself. And if that's like my default mode of being, then I will inevitably sacrifice somebody else at the altar of my, of myself. So there's an aspect of remembering our tendency to engage in that kind of behavior. And then to see, I mean, every week or every day, right? To see actually how that's been completely transformed into an act that can be an act of love."}
{"episode_id":"SW - #267 - 2022-12-31 - Luke Burgis - Revenge of the Scapegoat","start":1716.6,"end":1755.83,"speaker":"Jonathan Pageau","text":"And I've been curious about this. Does Gerard talk about the eating part of sacrifice? Does he address that in his theory, or did he just talk about the killing part, let's say in terms of sacrifice? Because of course we don't eat the scapegoat. Nobody eats a scapegoat. But you eat other sacrifice, like the sacrifice up, you tend to eat it. It's part of the part of the sacrifice that you offer it to God, but then you, it becomes your body as well. So. So in the, the Hebrew sacrifices, you would give the meat up and then you would eat it. Or in the Greek sacrifices that joke about how, you know, they Would offer up the bones, they tricked the gods, and then they would eat the meat, you know, But I don't know if Gerard talks about the. The eating part. He."}
{"episode_id":"SW - #267 - 2022-12-31 - Luke Burgis - Revenge of the Scapegoat","start":1755.99,"end":1762,"speaker":"Luke Burgess","text":"He. In. In terms of like. Like consuming the. The very, like, being of the other person, like, in. In the actual."}
{"episode_id":"SW - #267 - 2022-12-31 - Luke Burgis - Revenge of the Scapegoat","start":1762.71,"end":1762.95,"speaker":"Jonathan Pageau","text":"He."}
{"episode_id":"SW - #267 - 2022-12-31 - Luke Burgis - Revenge of the Scapegoat","start":1763.19,"end":1791.79,"speaker":"Luke Burgess","text":"Not a lot. I think that it's in Violence in the Sacred. His book from the 70s, you know, Orphic religions, Orphism, was sort of founded on this premise of, you know, Dionysus, right. Being, like, ripped apart and eaten by the Titans. And, you know, that formed the basis of a lot of cults for them. I just wrote an article just a few weeks ago about the cultural fascination with cannibalism. Like what?"}
{"episode_id":"SW - #267 - 2022-12-31 - Luke Burgis - Revenge of the Scapegoat","start":1791.79,"end":1793.03,"speaker":"Jonathan Pageau","text":"Yeah, right now it's like, what the."}
{"episode_id":"SW - #267 - 2022-12-31 - Luke Burgis - Revenge of the Scapegoat","start":1793.03,"end":1817.33,"speaker":"Luke Burgess","text":"Hell is going on with that? Right? There's a movie with Timothee Chalamet coming out where he's like, this teenage cannibal who's on this, like, love adventure across the country. I haven't seen it. I don't think it's out in theaters yet. But I saw the premiere for that and I was like, wow, there's been, like, a lot of movies about cannibalism, like Jeffrey Dahmer on Netflix. Like, what's going on there? Are people somehow, like, I don't know, right. Like, somehow fascinated by this idea?"}
{"episode_id":"SW - #267 - 2022-12-31 - Luke Burgis - Revenge of the Scapegoat","start":1817.81,"end":1879.18,"speaker":"Jonathan Pageau","text":"I think they are. I think it's definitely happening. And it's not just movies and tv. It's. It's the idea of also the idea of growing your own meat. Like, you saw a lot of that, but, like, for some reason they're always talking about how you could grow your own meat. Like you could grow your own flesh and you could eat yourself. Let's say it has to do with. It has to do with, like, self causation and this problem of all of these types of symbolism, like incest, cannibalism. They're all related. Sodomy as well, I'm afraid so. Has to do with, like, self causation. It's like, it's. It's not normal. Normal procession of being. It's like a circular type of causation. That's why it has to do with clowns and carnival and vampires and. And all of that stuff is all related. So it's not surprising that cannibalism will appear and so also will more and more. Just the idea of suicide as a. As a normal part of reality, the idea of self killing, self creation, self identification, all these things are all related to this kind of circular causality."}
{"episode_id":"SW - #267 - 2022-12-31 - Luke Burgis - Revenge of the Scapegoat","start":1879.75,"end":2028.27,"speaker":"Luke Burgess","text":"Yeah, yeah. And Suicide. Not to go off on a tangent, but there's a very mimetic quality to suicides as well, right? Like the imitation of a desire that one may have not had before. It's modeled and actually carried out in some way. You know, there's probably something to be said about school shootings. And the point is violence, whether it's violence to oneself or violence to others, according to Girard, is one of the most memetic kinds of behaviors, right? It's mimetic contagion. It's contagious, right? This. This desire for self preservation or the desire to. For vengeance. These things have some kind of a memetic quality to them. Before I forget, you know, this. This point that you made about like the sort of noble. I'll call it the noble sacrifice of the best, right? That form of sacrifice, as I read Girard, the way that he describes the scapegoat mechanism happening, it can happen in sort of in two forms, right? One of them, one is just pure self preservation of a community having decomposed and needing to reconstitute itself through this false transcendence that it tries to achieve through singling out the cancer, usually in the form of a person or a group of people, which it expels or eliminates. Interestingly enough, there's often a. The sacrifice only works if the person being sacrificed is not too strange, right? There has to be some similarity to the people that are doing the scapegoating. So in ancient cultures, you had, you know, if an animal was going to be sacrificed, that animal would need to be dressed up like a human, would need to be fed human things and sort of integrated into the community before it worked. So there was like a kindredness before it worked as an effective sacrifice. This, by the way, this is Gerard's sort of like, weird theory about how the domestication of animals happened, right? Like dogs and cats, they were literally used for human sacrifice, but they had to be domesticated first or else the sacrifice wasn't as effective. So there's something sort of weird about that. They're different. They're different species, different creature, yet we have to sort of see ourselves in them in some way for the sacrifice."}
{"episode_id":"SW - #267 - 2022-12-31 - Luke Burgis - Revenge of the Scapegoat","start":2028.27,"end":2043.99,"speaker":"Jonathan Pageau","text":"Enough. Yeah, enough for you to recognize what you're doing, let's say, because it's like you sacrifice a flower, it has no connection with you. Although you could offer flowers, though, you could offer them up, but not that kind of scapegoat sacrifice, that's for sure."}
{"episode_id":"SW - #267 - 2022-12-31 - Luke Burgis - Revenge of the Scapegoat","start":2044.31,"end":2091.48,"speaker":"Luke Burgess","text":"No. So the idea of similarity is really important in Girard So the two concepts of similar similarity and proximity, these are what really trigger a memetic crisis and eventually the scapegoat mechanism. So, as you know, the symbolism of the twins is really important in Girard. It's really weird. In almost every culture in the world, you have a myth where there are twins, usually identical twins, that one of them ends up killing the other one or they end up committing violence against one another. In the book of Genesis, I believe there are five stories of sibling rivalry alone in just. In the book of Genesis, Cain kills, Abel, founds a city, right? Then you have Joseph and his brothers, you have Jacob and Esau, and you've got."}
{"episode_id":"SW - #267 - 2022-12-31 - Luke Burgis - Revenge of the Scapegoat","start":2091.48,"end":2096.44,"speaker":"Jonathan Pageau","text":"Who are twins. Like clear. Like the clear twins. That's the explicit one."}
{"episode_id":"SW - #267 - 2022-12-31 - Luke Burgis - Revenge of the Scapegoat","start":2096.44,"end":2148.94,"speaker":"Luke Burgess","text":"Yeah, yeah, that's the explicit one. So the similarity seems to breed conflict. There's a. It leads more easily to a conflict of desire or the desire to differentiate oneself. Romulus and Remus, right? The founders of. Of Rome, they're these mythological twins, and there's not enough room for the both of them. So that leads to conflict and then proximity. Right, proximity. So again, twins are in close proximity to one another. These are what Gerard calls internal mediators of desire. Right? Internal. Meaning that they're inside of my world. So the scapegoat mechanism only happens with people that are in close proximity to each other, right? Like. Like within the community. That's part of why the sacrificed animal needed to sort of become more alike, right? It needed to become internal to the community."}
{"episode_id":"SW - #267 - 2022-12-31 - Luke Burgis - Revenge of the Scapegoat","start":2149.5,"end":2173.59,"speaker":"Jonathan Pageau","text":"So he wouldn't have seen, for example, the killing of foreign captors, foreign. Foreign prisoners as a scapegoat mechanism. Because that seems to be a universal practice too. It's like you win a war, you catch a bunch of people, then you ceremoniously murder some of them publicly in order to make a point about your nation and about your strength up and against another group, let's say."}
{"episode_id":"SW - #267 - 2022-12-31 - Luke Burgis - Revenge of the Scapegoat","start":2174.23,"end":2244.76,"speaker":"Luke Burgess","text":"I don't know if you would have. I don't know if he would have said that, but that doesn't seem to be effective anymore, right? I mean, and that could be because maybe at one point that was effective, but it doesn't seem effective anymore when that's happening. Maybe it's because it's not visible or something like that. And this is part of Gerard's whole thesis is that the scapegoat mechanism is becoming less and less effective. Right? It doesn't work any anymore the way that it used to before it was sort of revealed to. To humanity. And the concern for victims prevents the scapegoat mechanism, like our eyes are somehow opened to the victim. And that is a direct result of sort of what's been shown to us in the revelation, really, in the. In the scriptures. And it makes the scapegoat mechanism less effective. So we need. We either need more of them, we need them more often, and they simply don't work to bind people together. I guess in extraordinary cases, the scapegoat mechanism has worked to bind the world together. You could argue that the Holocaust in some sense, did that, and we're all united in this belief like this can never happen again."}
{"episode_id":"SW - #267 - 2022-12-31 - Luke Burgis - Revenge of the Scapegoat","start":2245.32,"end":2283.82,"speaker":"Jonathan Pageau","text":"Yeah, but I've actually argued that Hiroshima was a human sacrifice in the sense that Americans said, clearly, we have to kill these innocent people in order to stop the war. We have to kill these tens of thousands of innocent people and in one shot. And if we do that, then we'll get a blessing from heaven, like, we will end the war. Because they weren't killing soldiers. And it wasn't. It was like a gamble almost. It really was. It was very similar to the cliche of how people think human sacrifice used to happen. Right. It's like, you know, if I kill this person, you know, then. Then the rain will come or something like that. And it was like, that's what Hiroshima and Nagasaki were, I think."}
{"episode_id":"SW - #267 - 2022-12-31 - Luke Burgis - Revenge of the Scapegoat","start":2284.42,"end":2301.46,"speaker":"Luke Burgess","text":"Yeah. A calculated human sacrifice in the sense that we knew that innocent lives were going to be lost, but not knowing the future, just hoping that there was some kind of a. I don't know, would you say it was like a binding force or just pure deterrent and fear?"}
{"episode_id":"SW - #267 - 2022-12-31 - Luke Burgis - Revenge of the Scapegoat","start":2301.7,"end":2336.85,"speaker":"Jonathan Pageau","text":"I think it was also a binding force. I think for sure, it created, I think, the United States. The United States is born in Hiroshima in some ways, in terms of what it would become, because it's like the radical action and the result of it, let's say, ending the war, this kind of terrible thing, terrible action. At the outset, it seemed to be a kind of founding, I think, for America, leading into the next phase of their existence. But I don't know. Like I said, that's my intuition in terms of watching it."}
{"episode_id":"SW - #267 - 2022-12-31 - Luke Burgis - Revenge of the Scapegoat","start":2337.81,"end":2388.06,"speaker":"Luke Burgess","text":"I think the intuition, I think, is right in the sense that Girard said that every culture is founded on some. On a founding murder. So culture is always founded on some violent act. It's why culture emerges as the ritualized, like rituals and culture are, and institutions arise to prevent the violence of the founding murder from happening again. And in that sense, I sort of see. It's not like America's only had one culture. I think we've had like a special culture since World War II. Yeah. And like, maybe that. I'm just talking out loud here. I've never thought about this, but, like, maybe that's the founding murder of the new post world war culture and consensus. Right. That, that we've had, right. These, these founding murders."}
{"episode_id":"SW - #267 - 2022-12-31 - Luke Burgis - Revenge of the Scapegoat","start":2388.06,"end":2445.35,"speaker":"Jonathan Pageau","text":"And yeah, there's a few secret scandals in World War II that we can't. That nobody thinks about because they become. They kind of landed so deep in. In our psyche. The other example is that we always said we won the war, but, you know, we never say that it was actually the Russians greatly that won the war. And those Russians, we basically shook the hand with the devil in order to beat Hitler. And now because of that, communism gets a soft play in the United States. And people always wonder, like, why is it people are so soft on communism? It's a very, very deep, deep mythological reason. It's because we come. Our society is based on a very deep compromise in which we gave half of Europe to an evil empire in order to stop the war. So it's like there are these really deep sins that are at the origin of our. Of our civilization that we can't see. People kind of can't see them. But I don't know that that's not necessarily sacrifice, but it's like a weird sin that's at the origin of things."}
{"episode_id":"SW - #267 - 2022-12-31 - Luke Burgis - Revenge of the Scapegoat","start":2445.35,"end":2552.19,"speaker":"Luke Burgess","text":"Well, I think. I think it's very related, right. I mean, Girard's magnum opus is called Things Hidden since the foundation of the World. These are the things that we don't want to admit about humanity, about our own violence. In Christian terms, you could say sinfulness, about our own weakness and frailty, the denial of death, all these things. There's these things hidden since the foundation of the world are our own propensity to murder and cover up and to cover up these things under rituals, under institutions, there's all kinds of rituals in the world that are really for the sole purpose of preventing violence. This is a very important part of Girard's theory, is like, there's an initial act of the scapegoat mechanism that happened at some point, and then it's ritualized after that in the form of rituals. Right. So companies can have these rituals, like a lot of sports, I think, developed especially like in the Roman coliseum, developed as rituals to prevent the spread of more violence. The scapegoat mechanism is always about stopping the spread of more violence. Right? So Gerard's line, satan, cast out Satan. It's like, I need to do a little bit of violence. In order to prevent a lot of violence. Yeah. Which is a dangerous way to think. Right. It's this like very sort of calculating way to think. I think it's terrible ethics. It doesn't account for the dignity of the human person. There's all kinds of problems. But Gerard is saying that that's, this is the pattern that humanity constantly falls back into, is thinking that we can prevent a lot of violence through targeted violence, through making scapegoats, but we always need to find another one. That's the cycle that Christ stopped by becoming willingly the scapegoat."}
{"episode_id":"SW - #267 - 2022-12-31 - Luke Burgis - Revenge of the Scapegoat","start":2552.27,"end":2616.89,"speaker":"Jonathan Pageau","text":"Because some of the imagery in the story of Christ definitely has to do with this in the sense that even in many of the church fathers they'll often say, or in the hypnography we hear, you know, how the world is created from the side, from Christ's side that is in Christ being pierced. You know, the water and the blood that come out is the Church. It's actually the world Saint Maximus talks about. The world is being created, you know, while Christ is, is dying on the cross. And this sense that the world comes out of his side, like Eve comes out of Christ's side or the church comes out of his side. And so there is, there it seems like the symbolism is carried in to Christianity, but like you said, it's kind of flipped or it's, it's subverted because it's a form of self sacrifice. Then it's like the civilization that gets founded ends up not being the Roman civilization that pierced Christ, but the civilization that Christ is secretly planting is the one that will rise up and take over Rome. Ultimately, never completely, but at least enough for the transformation to be real."}
{"episode_id":"SW - #267 - 2022-12-31 - Luke Burgis - Revenge of the Scapegoat","start":2617.21,"end":2713.83,"speaker":"Luke Burgess","text":"Yeah. And that symbolism, the symbolism that you're describing, like the blood and water that flowed from the side of Christ, the Eucharist itself, it has all kinds of symbolism. Right. You're talking about blood and body and it itself is constituted through a sacrificial act. Right. You have to crush grapes until they can become and the wheat into the bread. So all of the language and the symbolism of sacrifice is now non bloody sacrifice is thoroughly infused in the symbolism of the liturgy, at least the one that you and I think both know. This idea that the victim, I think it's really important to just to get at this idea of the scapegoat mechanism becoming less effective because of society's concern for victims. So which, you know, Gerard would say our concern for victims is the universal value that now unites the world. Pretty much. Who will you ever find that says that you shouldn't be concerned with victims or, you know, people being injustice. Right. And Girard says this is really the fruit of the revelation of the scapegoat mechanism. We've now seen something that we can never unsee. And it sort of led over 2000 years, it led over a very long period of time to that becoming the most important value in the world to the point that there's now mimetic rivalry over who can be the best victim. Because nothing confers more status and power than becoming a good victim. It's a weird, weird paradox and inversion of like the true nature of Christianity. Right."}
{"episode_id":"SW - #267 - 2022-12-31 - Luke Burgis - Revenge of the Scapegoat","start":2713.91,"end":2733.99,"speaker":"Jonathan Pageau","text":"And so did Gerard. My understanding that at the end, towards the end, he also started talking about the pattern of Antichrist as related to something like that, Something like a kind of twisting of the twisting of the, the recognition of the victim into something like a, like a disturbed version of Christianity or something."}
{"episode_id":"SW - #267 - 2022-12-31 - Luke Burgis - Revenge of the Scapegoat","start":2733.99,"end":2894.09,"speaker":"Luke Burgess","text":"Well, there's, there's two, there's two ways out of the conundrum that society has got itself in, according to this is my reading of Girard. So one is Nietzsche, who Girard thought was like the most important philosopher of the last 150 years because nobody saw so clearly the role of Christ. He compared to the Dionysus myth. And Dionysus, by the way, is the God of insanity and ritualized madness who unites people and acts ecstasy and drunken parties and blesses the scapegoat, essentially the scapegoat mechanism. And he says nobody saw what the Christian story was about more than Nietzsche, but he rejected it. And he said the concern for victims is slave morality and we need to do away with the concern for victims. And not only that, in fact, victims should be like the weak. They should be sacrificed in the name of society. Right. Achieving some higher levels of being, which indirectly led to Nazi socialism. Right. So there's the Nietzsche approach that the concern for victims needs to be eradicated because this is the slave morality of Christianity or something like that. And then on the flip side, you have the Antichrist. And the Antichrist is one way that I would describe the. I don't like the term, but the so called culture wars is essentially the culture, really the secular culture trying to be more Christian than Christianity or more Christian than Christ and saying we care for victims more than you Christians do. Right. Or this is the Grand Inquisitor in Dostoevsky, Right. Like if you cared so much, we do a better job at caring for victims than the church has ever done or whatever. Right. And so there's this Weird rivalry almost. That is, in some ways way, the culture is like a memetic rival to Christianity. To the extent that the two of them get in a weird double bind, memetic war. It's really bad for both, especially for Christianity. And what is the Antichrist, but the one that comes along and does the best job at that, Totally unites humanity, promises peace, promises to have the utmost concern for all victims, to end poverty, to do all of those things that Christianity promised and couldn't do. So, in a sense, because of a lack of sort of eschatological sort of understanding and teleology, the Antichrist replaces Christianity by almost becoming what those who have rejected Christ want him to be. If that makes sense. Yeah."}
{"episode_id":"SW - #267 - 2022-12-31 - Luke Burgis - Revenge of the Scapegoat","start":2894.49,"end":2946.42,"speaker":"Jonathan Pageau","text":"So there's one thing also about Girard which puzzles me a little. My understanding. And maybe tell me if I'm wrong, but my understanding is that he also had a sense in which the scapegoat, after being sacrif. Sacrifice, was also deified somehow like. Or was placed in a position of. Of honor, like a high position after the sacrifice. So maybe if you can talk a little bit about that, because I'm not sure I understand. Like, I've seen it. I've actually seen it myself. I. There's some African tribe I remember dealing with in Congo named the Cuba tribe that they. They had. They had chased the pygmies out of their land, and they had a mask which was a pygmy mask. And the pygmy mask was something that they would like, was one of their most sacred objects, and they would honor it, but they also would see the pygmies as like, basically like forest demons. At the same time. It was like. It was just this weird thing I didn't understand."}
{"episode_id":"SW - #267 - 2022-12-31 - Luke Burgis - Revenge of the Scapegoat","start":2946.9,"end":3137.24,"speaker":"Luke Burgess","text":"Well, that's. That's a huge part of his theory. And. And it's. It's because nobody has the power to unite a community that's embroiled in mimetic violence which would otherwise destroy itself. Right. That they can't save themselves. And the only thing that will unite them together. One way to think of it, the only thing they can agree on, the only desire that will unite them, is a shared contempt for and hatred of the scapegoat. So the scapegoat unites them together in this act, in this ritual. Act of. And by the way, like, the scapegoat ritual almost always happened through a long process of. They would parade the scapegoat. In Greece, it's called the pharmacos. They would parade the pharmacos through the streets, whip them, mock them, all the things that remind you of the crucifixion, by the way, for days. And that was important because that gave the people a sense of catharsis and released all of the pent up memetic violence that they were aiming at each other. They can collectively aim at, at the single scapegoat mechanism. They expel the scapegoat, kill the scapegoat, do whatever horrible thing they do to the scapegoat, and then magically. Magically, in quotes here, right, because this is the false transcendence. They achieve some level of temporary peace and unity with each other. It feels good. What Aristotle talked about, that catharsis. So what ends up happening a short time later is that the scapegoat, almost always, always in ancient cultures, is worshiped. They'll build a shrine over the site where the scapegoat was killed. They'll do something like that because the scapegoat takes on a sacred power because it's the only thing that had the power to solve their problem outside of themselves. And that has the nature of a God or something that you worship. So a higher being that was able to somehow solve the problem is attributed, is projected onto the scapegoat. I know this is a little weird for people listening, it's a little hard to understand. But think about great figures in history that are not revered until after they die. I mean, this happens all the time. People that were assassinated, murdered, who began to sort of take on almost a sacred aura. I mean, we have myths throughout all of our stories, right? In Tolkien, you've got Gandalf the White comes back and he's sort of more powerful than before. This is just part of the human story. We have this sort of idea in our imagination somehow. And this may be a controversial statement, but I think what happened most recently, maybe with the death of George Floyd, it sort of had this sort of almost. There's been like sacred connotations that have been attached to him now. And, you know, I've seen him like, depicted as, like, as, like Christ."}
{"episode_id":"SW - #267 - 2022-12-31 - Luke Burgis - Revenge of the Scapegoat","start":3137.56,"end":3138.04,"speaker":"Jonathan Pageau","text":"Oh, yeah."}
{"episode_id":"SW - #267 - 2022-12-31 - Luke Burgis - Revenge of the Scapegoat","start":3138.04,"end":3183.1,"speaker":"Luke Burgess","text":"As an angel sacrifice. Right. And there's the element of, you know, uniting people around the world and building shrines. And there is a bit of that, like almost a process of deification is how Girard would describe it. Right. And deification is, I think, is more of in sort of the orthodox tradition. Right. The whole spiritual life is often described as a process of deification, but this is almost like a false deification which goes back to the false transcendence, where the real deification, right, being united, becoming more like God, becoming holy, all of those things is a real sort of positive sense of deification."}
{"episode_id":"SW - #267 - 2022-12-31 - Luke Burgis - Revenge of the Scapegoat","start":3184.3,"end":3213.48,"speaker":"Jonathan Pageau","text":"I mean, it's interesting, especially because a lot of people point out in the George Floyd story how he was a criminal, how he had done horrible things. And so in this theory or in this vision, it almost serves the purpose. It actually almost narratively and mysteriously, would function as a way in which it would even make it stronger, that he would then ultimately kind of unite people together and act as this new angel that appears, let's say, over this question, and I hadn't thought about it that way."}
{"episode_id":"SW - #267 - 2022-12-31 - Luke Burgis - Revenge of the Scapegoat","start":3213.48,"end":3250.49,"speaker":"Luke Burgess","text":"Yeah, I think Gaddafi did the same thing to people. Gaddafi, by all accounts, was not really a good man. I don't think he was a good leader. I think he had committed crimes. And one very well known Girard scholar, Mark Ansbach, I like his work a lot. He said, in fact, it's because of Gaddafi's kind of guilt that helped him become a better stand in for the guilt of everybody else, if that makes sense. Right. This goes back to the similarity thing."}
{"episode_id":"SW - #267 - 2022-12-31 - Luke Burgis - Revenge of the Scapegoat","start":3250.49,"end":3250.85,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #267 - 2022-12-31 - Luke Burgis - Revenge of the Scapegoat","start":3250.85,"end":3275.23,"speaker":"Luke Burgess","text":"It's almost as if because he's guilty, he can be an easier substitute or sacrificial victim for the guilt of everybody else in the country. And if you read. And he was literally lynched in the street, right? Like these horrific images. And if you read what some of the people said in Libya, one guy in particular said all of the evil has now been purged from our country."}
{"episode_id":"SW - #267 - 2022-12-31 - Luke Burgis - Revenge of the Scapegoat","start":3275.55,"end":3275.95,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #267 - 2022-12-31 - Luke Burgis - Revenge of the Scapegoat","start":3276.03,"end":3293.82,"speaker":"Luke Burgess","text":"Like a couple of days after he died. You just can't have a more sort of textbook example of that happening. And why do they have to get rid of his body? Well, because right away there were going to be shrines built to it, and they were actually, like, worried about that process of deification happening."}
{"episode_id":"SW - #267 - 2022-12-31 - Luke Burgis - Revenge of the Scapegoat","start":3295.74,"end":3341.33,"speaker":"Jonathan Pageau","text":"So here's a very difficult question. Does Girard talk about the manner in which. It seems, at least to me, that something similar happened to Hitler? It's like the Germans were able to put all their guilt into one person and. And to kind of absolve themselves to it. Not totally, but at least to some extent. And even the west in general, by making Hitler the one evil, one evil player, like the one that. The one person that is the cause of it all, it seems like there's something of that going on there, like where we. We just put all the evil in him and he's still, like, still today. He is the ultimate evil character, the one in which all evil kind of lands."}
{"episode_id":"SW - #267 - 2022-12-31 - Luke Burgis - Revenge of the Scapegoat","start":3341.33,"end":3497.32,"speaker":"Luke Burgess","text":"Let's Say, yeah, the personification of all evil, like, almost standing in for taking the place of a satanic figure or Satan himself. Right. Like, there's almost something. It's almost as if humanity told itself a story for a certain amount of time that we took care of Hitler ended in demise. We took care of the problem. We built these institutions. It'll never happen again. We built the memorials, and all of the evil has been personified in this one figure. Yet the scapegoat mechanism runs rampant throughout the world, even still. And part of the problem with mimetic violence and the scapegoat mechanism is the diversion of attention. I think mimesis in general has to do with what we pay attention to and what we focus on, what we become obsessed with. Because the only way that a scapegoat is made is if attention becomes focused in a group on a single individual through this kind of mimetic process which diverts us, which involves projection, which involves of all of our shortcomings and our own violence and our own sins onto this one person and that it involves a process of transference. And all of those things simply kick the can down the road and don't deal with any kind of structural problems, any kind of structural sin, our own propensity to do violence, which we need to remind ourselves of. So you could say that Girard had a very Augustinian or sort of dark view of human nature and sort of against sort of Enlightenment rationality where, like, oh, we just. We all get like, you know, we just read a lot of books and we discover these secrets about the world, and therefore, like, we can purge violence from our midst. It's like Steven Pinker 101, you know what I'm saying? And it's like not recognizing sort of these ancient forces that are still very much at work that now just manifest themselves in different ways. And because the ways they manifest themselves are different, we might not recognize them. You know, we're not usually in some parts of the world, but we're usually not literally, you know, murdering people and dragging them through the streets. We're just doing it in other sort of spiritual ways often. Right. Which, you know, the Gospels actually talk about that under the context of murder. So, you know, I think the scapegoat mechanism is just evolving and transforming."}
{"episode_id":"SW - #267 - 2022-12-31 - Luke Burgis - Revenge of the Scapegoat","start":3497.95,"end":3572.41,"speaker":"Jonathan Pageau","text":"Yeah, for sure. The cancel culture that we're seeing happening is. Definitely has some of the scapegoat mechanism in it. You know, the way that it. That manifests itself. It's like we need to find especially, like the hunt, almost like the hunt for someone to cancel. Like we need to find the next person. We need to purge the world of these two people. And if we do so, then we'll find some kind of paradise. And so then you have the other version, which I don't. Which I'd like to know what you think about that because, I mean, Jordan Peterson is kind of broad, brought out this new vision of Solzhenitsyn's, Solzhenitsyn's way of seeing this, which is the idea of, of self blaming, you could say, or of seeing our taking the sins on ourselves and that that could be the right transformational process to actually change the world ultimately. And you see that of course, like I said, in terms of the, the martyrs, how they're willing to die despite their innocence. You see it in terms of monastic practice where the monks will take the blame on themselves even for other people's sins, that kind of stuff, which I would never do. But it's like you see it happen in monasteries where, where the, the spiritual father would like actually take the blame for other people's things. And so I don't know if you, if, if Gerard has talked about that, if you've thought about that as well."}
{"episode_id":"SW - #267 - 2022-12-31 - Luke Burgis - Revenge of the Scapegoat","start":3572.89,"end":3732.41,"speaker":"Luke Burgess","text":"I have thought about that. And you know, that has to do with, again, with self sacrifice and with accepting certain injustices that are committed against you, perhaps even taking on injustices from other people without always seeking retribution, which I think Gerard says is the satanic lie that the retribution or the line from the Gospel, Satan casts out Satan. It has everything to do with that principle. That little bit of violence will somehow do good, that violence can do good. The self blame thing is the flip side of that. This is something I was reading Girard last night and I pulled up a quote. So I think this is relevant to what you're saying. I'm just going to read it. He said, since Christians have become aware of their failings in charity, of their connivance with established political orders in the past and present world that are always sacrificial. So basically, since Christians are sort of accusing themselves of their own failings and charity and have been part of sacrificial political orders in the past, and even now they are particularly vulnerable to the ongoing blackmail of contemporary neo paganism. That's a quote from Rene Girard. So there's a lot there to unpack. But one way that I interpret that is that because it's almost like the accuser, right? This ancient language of the accuser and the advocate. And when the accuser Accuses you of your own sins and shortcomings and failings with Girard is basically saying that the church, the Christian world is being accused of all of these things and has been for a very long time. Right. This goes back to, you know, that we care about victims more than Christ cares about victims. Right. Then they're sort of susceptible to the blackmail of neo paganism. Right. Which is sort of like holding is the accusation that because the history of Christianity has not been perfect, that therefore it should seed all of the story and all of the kind of writing to let's just elect a great president and he'll solve all of our problems or something like that. So there's something to be said about the self blame. Right. There's a negative sort of form of that, which I think which comes from the accuser."}
{"episode_id":"SW - #267 - 2022-12-31 - Luke Burgis - Revenge of the Scapegoat","start":3732.73,"end":3815.13,"speaker":"Jonathan Pageau","text":"Yeah, that self blame is different because it's a weaponized compassion. I've talked about this recently in terms of if you want to recognize the difference between true, let's say, taking on of sins or the true examining of yourself in order to see, you know, the good and evil going through your own heart. The difference between that and weaponized compassion seems to be exemplified in the story of Judas. When you see Judas, when the woman comes to pour the perfume on Christ's feet, Judas says, you know, you should give that to the poor. It's like that's exactly, that's exactly what we're talking about in terms of, you know, I will care for the poor. Right. That's, that's what I'll do. But in the story, what's interesting is like, it's actually I will care for the poor rather than worship the divine, you know, worship God. And so she's actually worshiping the Son of Man and he's saying, you know, you should give to the poor. But in, in the scripture it says, but what he was really doing was taking the money for himself. I think that that's usually when you can see it because you just have to watch people who will want to, let's say, accuse Christianity of all the sins and you, and then you just have to look a little bit and realize that it's, it's actually a power play to take to, to, to gain power for themselves. There's nothing authentic about it at all."}
{"episode_id":"SW - #267 - 2022-12-31 - Luke Burgis - Revenge of the Scapegoat","start":3815.37,"end":3824.41,"speaker":"Luke Burgess","text":"And, and the, the accuser. Well, just a really important point to make is that the accuser is always, is never the truth. Yeah, the accusation is never the truth."}
{"episode_id":"SW - #267 - 2022-12-31 - Luke Burgis - Revenge of the Scapegoat","start":3824.56,"end":3824.8,"speaker":"Jonathan Pageau","text":"Truth."}
{"episode_id":"SW - #267 - 2022-12-31 - Luke Burgis - Revenge of the Scapegoat","start":3824.8,"end":3898.02,"speaker":"Luke Burgess","text":"Right. Because the accuser in scripture and I guess, you know, in 2022, it can be weird for some people that hear these two guys talking about Satan or the Satanic principle. But, I mean, Girard identified the scapegoat mechanism with sort of the spirit of Satan. And what are some of the different ways that Satan is referred to, that Jesus refers to Satan in the Gospels? The accuser. Right. The father of lies and a murderer since the beginning. So the accuser is always lying. Right. There's always. There's always like some. Some element of lie there. It's not the whole. At the very least, it's never the whole truth. Yeah. Yet it's. It's very easy to believe. And I think that's where that spirit of accusation is. What's behind Cancel culture. And it's part of my personal. Just my personal examination of conscience. It's like, how am I being an accuser and how am I being an advocate? Right. The advocate is. Usually refers to the Holy Spirit in Scripture, who in my life is an accuser, who in my life is an advocate. What in the culture is. Is operating on the Prince, like, literally gets power from accusation. Because anything that. That derives power from accusation, you might say, like all of Twitter, is basically like this. Hope Elon Musk can solve that problem."}
{"episode_id":"SW - #267 - 2022-12-31 - Luke Burgis - Revenge of the Scapegoat","start":3899.22,"end":3899.94,"speaker":"Jonathan Pageau","text":"Is. Is."}
{"episode_id":"SW - #267 - 2022-12-31 - Luke Burgis - Revenge of the Scapegoat","start":3900.02,"end":3902.18,"speaker":"Luke Burgess","text":"Is certainly concerning to me."}
{"episode_id":"SW - #267 - 2022-12-31 - Luke Burgis - Revenge of the Scapegoat","start":3902.5,"end":3947.24,"speaker":"Jonathan Pageau","text":"Yeah, yeah, yeah. No, you're right. You're right. There's definitely something. And there's also the hip, the hypocrisy part of the accuser, which I think Christ points out quite a bit in his ministry, you know, where he sees the accusers in terms of the. The Pharisees. And he says that the accuser is often hiding his own. His own sin. And. And that in the case of Judas, that's definitely the case. Whereas Judas is accusing the woman of not caring for the poor, when in fact, you know, he just wants power for himself. And so there's definitely a lot of that going on in terms of the politics and also the. Yeah, Even. Even in terms of the. The fingers being pointed, you know? Yeah."}
{"episode_id":"SW - #267 - 2022-12-31 - Luke Burgis - Revenge of the Scapegoat","start":3947.24,"end":3993.98,"speaker":"Luke Burgess","text":"Yep. And, you know, that's. The story of the woman caught in adultery is, I think, the most memetically charged, aside from the crucifixion in. In the Gospels. Right. It's just. It's literally there's mimetic process of accusation that's taking place, and it's diffused by the only person in the story. This is the woman who was caught in the act of adultery. So we know she's guilty. Right. They drag her in front of the temple. In the Gospel of John, you've got these Pharisees saying she's guilty, breaking the law of Moses. She deserves to be stoned. And there's this memetic process of contagion. Everybody in the story is an accuser except her and other person. And Christ steps into the story as the only person who stands outside of the mimetic processes, the only person who's not susceptible to them."}
{"episode_id":"SW - #267 - 2022-12-31 - Luke Burgis - Revenge of the Scapegoat","start":3994.06,"end":3994.46,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #267 - 2022-12-31 - Luke Burgis - Revenge of the Scapegoat","start":3995.34,"end":4054.15,"speaker":"Luke Burgess","text":"One, He's a divine person and free of sin. So he's the only. In a sense, most people don't think of that story as him defusing the stoning as a miracle. But if what Girard is saying is true and that this is the mimetic process of violence that's been operative. It's the thing hidden since the foundation of the world. It's the way that. What humanity has always done. You could almost say that there's some kind of divine intervention where the only antimemetic. The only person not participating in the pattern of mimetic contagion in that story was Christ, which is the only reason he's able to diffuse it. And this is the reason that people are really scared to step in and stop. We don't really stone people in this country anymore. But people are really scared to step in and avert a cancellation or something like that. Because then they themselves get singled out."}
{"episode_id":"SW - #267 - 2022-12-31 - Luke Burgis - Revenge of the Scapegoat","start":4054.79,"end":4056.03,"speaker":"Jonathan Pageau","text":"Yeah. And they know nobody's scared."}
{"episode_id":"SW - #267 - 2022-12-31 - Luke Burgis - Revenge of the Scapegoat","start":4056.03,"end":4107.2,"speaker":"Luke Burgess","text":"Everybody just runs for the hills when something like that happens. So I've often asked myself, like, we don't give ourselves enough credit for having the power to. Because sometimes it just takes one person to be a smart subversive break in that process. And in the Gospel story, Christ totally reverses it. They drop their stones and walk away. And the reason it's one of my favorite sort of stories is because it's negative mimetic violence that's instantly transformed into positive mimetic desire or a positive form of mimesis. Because it says the elders, starting with the elders, they drop their stones, models of desire, and then one by one, the rest of them left. Right. So the elders dropped the stones, and the rest of them left. You know, it's possible to actually affect some positive contagion of desire and examination."}
{"episode_id":"SW - #267 - 2022-12-31 - Luke Burgis - Revenge of the Scapegoat","start":4107.76,"end":4140.19,"speaker":"Jonathan Pageau","text":"Yeah, but it's difficult. It's difficult because we are caught up in the mimetic desire ourselves. And so we also see that, you know, it's like the reason why you're afraid of being canceled is because, you know, you're not perfect. You've got. You know, everybody has things that you look back and you're like, oh, you know, I'm not. I definitely have sins in my past. So, yeah, it's difficult. But you're right, there are some people that seem to be able to, to do it. And, and when it happens, it's, it's very powerful. It's very beautiful."}
{"episode_id":"SW - #267 - 2022-12-31 - Luke Burgis - Revenge of the Scapegoat","start":4140.51,"end":4199.9,"speaker":"Luke Burgess","text":"Yeah. You know, it's. I don't know if the observer problem is the right way to talk about this, but we are ourselves. It's weird talking about mimesis and mimetic desire, mimetic contagion, because like at this very moment I'm being affected by forces that I probably don't even know. Right. And I'm very much like inside of the same story that I'm talking about, which makes all of these things somewhat dangerous, I would even say dangerous to talk, you know, not to talk about, but like to pretend or to operate under the illusion that we can achieve some kind of permanent, you know, abstraction or removal from them. Right. Like we're, we're embedded in these things. And like, one of the things I hope that when I, you know, walk in to go in my parish every Sunday, like, you know, for, for an hour, it sort of feels like I'm, you know, I'm no longer in the world. Right. And then you're totally right. And then within one minute of leaving, I'm like, you know, yelling at the guy who cut me off in the parking lot. Right."}
{"episode_id":"SW - #267 - 2022-12-31 - Luke Burgis - Revenge of the Scapegoat","start":4199.9,"end":4270.77,"speaker":"Jonathan Pageau","text":"Yeah. Yeah. Because I mean, it's, it's, it's like we're making, making this video. We're going to put it on YouTube, you know, it's going to get likes, it's going to get comments, it's going to get shared. These are the mimetic, these are all these mimetic things that are on steroids right now in terms of social media. And so it's definitely something that we are, we are part of. And it's difficult to pull, like you said, difficult to pull ourselves through. And we kind of hope that the Eucharist and, you know, participation in the, in the self sacrifice of Christ, if we do it, if we do it regularly and properly, that we, it can somehow at least, like you said, give us a different perspective, you know. Yeah. But then also noticing the times, I think, like, at least in my case, I think noticing, like you said, sometimes it still is an mimetic process, but noticing the times where I've been able to, let's say, give myself or sacrifice some aspects of myself for others and then seeing the fruits of that, you know, it's like, wow, that works. Like, it's not just, it actually really does do something, but then that can also be, that can also become a memetic, I mean, medic competition, you know, if you're not careful."}
{"episode_id":"SW - #267 - 2022-12-31 - Luke Burgis - Revenge of the Scapegoat","start":4271.01,"end":4318.51,"speaker":"Luke Burgess","text":"It's funny, isn't it? I, I spent a few years living in Rome because I was in seminary studying theology. And it's, it's a, it's an alarming thing when you realize that the guys that are participating in that process of formation, like, start competing and engaged in mimetic rivalries with each other in regards to how long they're in the chapel praying and who's praying on their knees and who's not and stuff like that. We can, literally, anything can turn into this if we're not aware of it and if we're not vigilant. Anything can be good. Right. I'm here trying to make this sacrifice and give of myself to the world and grow into virtue, and yet I can look to my right and my left and get totally distracted from like, what in the hell I even came here for in the first place."}
{"episode_id":"SW - #267 - 2022-12-31 - Luke Burgis - Revenge of the Scapegoat","start":4318.75,"end":4359.76,"speaker":"Jonathan Pageau","text":"Yeah. And I mean, Christ seems to be warning us about that. And it can help us understand some things that Christ says and talks about. The importance of secret. Right. The importance of doing things in secret. Because when you do things in secret, if you give in secret or you pray in secret, or you don't get the credit for it, then it's actually a, it can be a good healing mechanism or maybe a good, a good kind of position which you can find yourself where you can now see, you know, what's going on a little more clearly because you're, you're not getting any, you're not getting anything from what you, what you've done. So that's interesting to think about. Yeah. Listen, I think this has been a great, this is great conversation."}
{"episode_id":"SW - #267 - 2022-12-31 - Luke Burgis - Revenge of the Scapegoat","start":4360.32,"end":4368.57,"speaker":"Luke Burgess","text":"I, I appreciate it. We're having a, a more spiritual conversation than I, than I was. I like that. I, I, I appreciate that. Thank you."}
{"episode_id":"SW - #267 - 2022-12-31 - Luke Burgis - Revenge of the Scapegoat","start":4369.45,"end":4401.94,"speaker":"Jonathan Pageau","text":"All right, so I will just send everybody towards your, towards your book. It's called Wanting, and it has great. Peter Thiel gave it a great review and, and a lot of. I was really impressed to see how much it's gotten positive reactions. And I think getting people to think about these questions is important, especially with social media. The acceleration of social connection and the, the acceleration of contagions of these types of contagions is so, everything's so fast now and it can happen so quickly that at least understanding some of the mechanisms is useful. For everybody to understand."}
{"episode_id":"SW - #267 - 2022-12-31 - Luke Burgis - Revenge of the Scapegoat","start":4402.34,"end":4407.3,"speaker":"Luke Burgess","text":"Absolutely. Well, thanks, Jonathan. I really hope we can continue the conversation sometime. I appreciate it. Great."}
{"episode_id":"SW - #267 - 2022-12-31 - Luke Burgis - Revenge of the Scapegoat","start":4407.3,"end":4470.7,"speaker":"Jonathan Pageau","text":"Yeah, thanks for coming on. I hope you enjoyed this episode of the Symbolic World. The Symbolic World is based on a series of videos that you can find on my YouTube channel, Jonathan Pageau's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that it's quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course, leaving a review on itunes. Everybody knows that's the best way to get the podcast out there, to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon, the Pageot videos as well, and on subscribestar, all those links you can find on my website or in the show description. So thank you and I will see you soon."}
