{"episode_id":"SW - #391 - 2025-05-13 - The Controversy over - Christ is King -","start":0.16,"end":62.61,"speaker":"Laura Diaz","text":"Tucson, the Weight is Over Mediweight loss. They're officially open on North Oracle Road. That's right. No more counting down the days. You can walk in right now and start your journey to a healthier you. Hey, it's Laura Diaz from iheartradio and you can trust me. This isn't just another weight loss clinic. I know that because it's where I lost weight safely with real medical support. GLP1 medications. You can see them everywhere online right now. But the truth is your health shouldn't be a DIY project ordering these meds without the professional guidance. It can lead to dangerous mistakes, wrong doses, no oversight and serious risks at mediweight loss. I got the same medication but with a customized plan, weekly check ins and a licensed physician guiding me every step of the way. And the cost? The same as those risky online options. Tucson, your moment is here. If you're ready to take control, feel better and lose weight the right way, mediweight loss is ready for you. Walk in, get started and see real results. Call or visit mediweightloss.com to learn more and book your free consultation today. That's mediweightloss.com so a few weeks ago."}
{"episode_id":"SW - #391 - 2025-05-13 - The Controversy over - Christ is King -","start":62.61,"end":1052.52,"speaker":"Jonathan Pageau","text":"Now several weeks ago, a study came out which decried the use of the phrase Christ is king in certain contexts. The study was put out by where at least people that I know and am friends with were involved in this study. I didn't really know about the study until one day before when we sent me the video and the study saying that they were going to put this out, you know, decrying the use of the phrase Christ is king. When I saw it at the outset, I was very angry about the study because I thought that the purpose of the study, which was to decry the use of Christ is king in certain contexts in order to stop anti Semitism was going to backfire, that it wasn't going to do what you think it was going to do. I think that in the final analysis my interpretation was right. But you know, I have some sympathy a little bit for the reason why the study was put out. Not completely as you can imagine. So I thought that I would go through a little bit of the history and a sense of the symbolism of this notion that Christ is a king. We'll look at it, we'll explain it, we'll kind of trace a little bit of the history of where it comes from and how it developed. And then we will also look a little bit at the resurgence of the phrase Christ is king in popular Parlance, and try to evaluate a bit what it is that's going on here. This is Jonathan Peugeot. Welcome to the symbolic world. And so the notion that Christ is king is there, of course, in the New Testament. We find it right at the outset when the magi come to worship Christ. You know, they say, you know, they are coming to worship the. The King of the Jews that has been born. They saw his star in the sky, and so they're coming to find him and to worship him. And then several times in the Scriptures, Christ is called king. In the Gospel of John, one of the disciples says, rabbi, you are the Son of God. You are the King of Israel. This happened several times. Of course, the biggest moment when this happens is when Christ enters into Jerusalem and the people greet him on Palm Sunday and they call him King, you know, they call him Basileios, you know, which is the term for king. This is all through the Scriptures. And of course, it is reiterated then in the prophetic text. When we see Christ as the King of king and the Lord of Lords, who is sitting on the throne, there are also the moments where it's. It's darker or more ironic when Christ is being mocked as king, when Pilate is having him flogged and putting on his head a crown of thorns and a reed in his hand, and. And all the Roman soldiers are kneeling in front of him to mock him and calling him the king. Of course, the sign at the top of the cross where he is said to be the King of the Jews. So all of these images are there all through the Scripture. Now, the tradition, of course, of talking about Christ as king, the notion of Christ as the pantokrator, which is when you see icons of Christ, especially Eastern Orthodox ones, the ones that you see up in the dome, in the church, where Christ is dressed as a nobleman, he has a clavi, which is a kind of ornament on his vestment, and he wears a kind of toga around his vestment. He's holding a book and he's blessing. This is an image of Christ as king, as emperor, as a great leader. That is the representation of him in the book of Revelation as the King of the universe, as the King of kings and the Lord of lords. And so this representation is quite traditional. It's quite normal. The thing is that usually the way that we talk about it is not necessarily to say Christ is king. The phrase Christ is king is actually not particularly used. You can find it exceptionally. It's not something that is normally used. And the reason is because when you say Christ is King. Who are you, you saying it to? You know, when you celebrate Christ as king, it's more like a title. You know, we say Christ the King, Christ the King of kings, Christ the King of the Jews, Christ the King of, you know, the great, the great king. So when we do that, what we're doing is we're attributing a title to him and we're celebrating him with that title. And that is of course, the usual way that the term Christ is king is used. But what's interesting is that the phrase became more prominent or that notion of Christ the King in the west became more prominent in the 20th century. Because in 1925, the post the Pope with Pius XII started a. Was it Pius XII or Pius xi? I always mix them up. I'm sorry for the Catholics watching this if I'm mixing them up. The Pope started a feast in 1925 called Christ the King. And in that feast, of course, Christ as King is being celebrated more explicitly. But interestingly enough about that feast is that the reason for the feast was in some ways to combat excessive nationalism and to remind people after World War I, you know, after all, these European nation masquering, massacring themselves for a kind of nationalistic impulse to remind them that we all have Christ as king and that Christ transcends the national divide and that we have to be careful not to put too much of our love into our nation so that, you know, so that we remember that we have a transcendent king. We have a king in heaven, we have a eschatological king. So what's interesting then is what's going on now. You know, why is the phrase being used now? This is it, folks. This might just be the culmination of my life's work. Join me for the Symbolism master class this April 2025. During this course, I'll take you by the hand into the essentials and depths of symbolic thinking. Over six weeks and over 18 hours of lectures and Q&As in a concise and comprehensive way, I'll teach you everything about how I think so that by the end, you might see the world anew. This class will not only be an introduction, but also a deep dive into a way of seeing that cuts right through our secular dead end. It reconnects the ancient religious ideas with some of the most cutting edge notions of complexity developed today. As the world is shaking and changing at an increasingly rapid pace. Being able to read the patterns of reality will give you an anchor and a solid sense of what is up and what is down. In this class, we will talk about so many things, about heaven and earth, the sacred and the secular. The Bible, dragons, demons, fairies will explore the surprising value of conspiracy theories, how symbolic patterns are found in movies, in science, philosophy, art. We'll look at the relationship of symbolism to natural selection. We'll look at the basic patterns of the world of sacrifice, of the center, the margin, the masculine, the feminine, the mountain, time and space, left and right. It will be a synthesis of everything I've covered in the 500 YouTube videos that put out over the years, and much more as well now, all in a structure that has one purpose, which is to make you a master of symbolic thinking. This is your opportunity to get to the core of what symbolism is, to ask questions, to test out your ideas, and to make sure you have a strong foundation of the fundamentals. Plus, getting some hidden gems that I've never shared before. So don't miss out on the live experience and register today. And so there are certain political figures in the last few years that have bragged that they have brought back the phrase Christ is king and that they've done so in order to do two things. I think one is in some ways to remind people of their allegiance to a transcendent good. Again, you know, obviously that is part of it, but there's also another aspect, which is the idea of the exclusion of people that don't have Christ as king in this very context, of course, the exclusion of Jews from the statement. And this is of course, the aspect of the statement that is particularly offensive to the people who put out the study. Now, one of the reasons why I was annoyed with the study is because there's a problem. I mean, I can understand when some people are being annoying about it and being kind of jerks about the statement in the exclusionary way. The problem is that you can't avoid that. It is part of a statement like that, which is that just like every single identity, when you announce the allegiance of your identity, you are doing two things. You are both rallying people to it. You're saying, I'm telling you who my king is. And now all of you that recognize the same king as I, you will see that we are together in our allegiance to the king. But it's also simultaneously saying people that don't have an allegiance to this king will be excluded. So the problem, of course, is that every single act of identity is both inclusion and exclusion. Now, it's not particular to this case, not particular to the the case of Crisis King. You know, when I was a teenager, for several years, a few years, I lived in the United States, and I was going to a middle school in Wheaton, Illinois, where every Friday they would stand and they would say the Pledge of Allegiance. Now, when they stood together and they put their hand over their heart and they said the Pledge of Allegiance, one of the things they were doing was excluding me from that. And that was completely normal. It was completely normal that I was being excluded because I did not pledge allegiance to the flag of the United States, because I wasn't an American. I was a Canadian, I was a visitor. I was a stranger in their land. And therefore I stood up out of respect. You know, the teacher said, well, maybe you can at least stand and just stand out of respect, you know, not say the pledge, but show that you have respect for. For the. The allegiance that these people have towards their flag. And so that's what I did. I would stand up and. And in respect, even though I didn't pledge allegiance to it, but I was excluded. And that is part of every single statement. And so the phrase Christ is king does definitely exclude Jews. And, you know, and it, like I said, it's part of the Christian identity. Now, there are, of course, things in Judaism that exclude Christians. There are many practices in Judaism that exclude Christians. You know, a very simple one is just kosher. You know, the fact of eating kosher is both a rallying of people together in one, you know, together recognizing each other as, you know, sharing the same body, you could say. But then at the same time, it excludes, you know, if you invite an Orthodox Jew to your house, they will not eat your food, they will not eat with you. And that is a. That is a major act of exclusion. And that is just part, like I said, of how identity functions. You see the same in Islam or in any type of religious identity. It is both including and excluding. So then what? Right, so now we have a problem, which is that in the study that was put out, several, I would say most actually, clearly most of the people in the study were not Christians. And they are calling out and they are telling Christians to decide within themselves between those that are using the statement to include and to exclude. Now, I can be annoyed, and I'll be honest with you, I am annoyed with, not particularly a fan of some of the people that are using that phrase in this context, that are using the phrase to just exclude. There are people, by the way, in that group that aren't even Christian themselves who are just using it as a kind of annoying move to exclude other people. But I also think that it is not a very good move when you are not part of a group to try to, to shame them into deciding, you know, who gets to use the statement of allegiance. So, you know, it not particularly great. Now we have to say that, like I said, it's, it's quite ironic that originally in the 20th century, in relationship to all these questions of nation, that's the sense of Christ is king was the Christ. The King was used mostly actually to transcend nations. Now we're in this moment, let's say after a long time after World War II, we are now facing the problem of a kind of, you know, vapid globalism and people are trying to get a sense of more local identity. You know, there's a kind of return of the sense of nation. And I think that that's fine, that's a good thing. But always remember that if you say Christ is king, actually what you're pointing to is something beyond the nation. And if you try to use it only to restore some kind of national identity, that phrase has its own reality and its own life. And it won't do what you think it's going to do because it does point beyond our identities. And so these were just a few thoughts. I thought it was important to kind of think about it, to look at it and to realize that exclusion is part of identity. And we also have to be reasonable because, you know, especially as Christians, we are asked to love our neighbors, we're asked to love our enemies. And so when we say, when we call our allegiance to Christ, we are obviously excluding people from that. And that is completely normal. And we should not be ashamed of how it excludes people. But we should also remember that to always, if you're going to say that phrase, to always say it in the spirit of Christ, which is, which is the one who was crucified, which is the one who was willing to give everything for the salvation of the world. So hopefully this was a little useful in thinking about this. And you know, for me, this is the right after Pascha, for all of you, this is after Easter. And so I want to kind of end this video and tell you that, that Christ is risen. And if you love the way that we're talking about symbolism and you think this is very useful, don't forget that I am starting a symbolism masterclass. I am kind of bringing all of the symbolic ideas together into a 18 hour intense class that will start with an introduction, but will bring you all the way deep into symbolic thinking. We are starting that this week and so. So I'd love to see you there. Thanks. Bye. Bye."}
{"episode_id":"SW - #391 - 2025-05-13 - The Controversy over - Christ is King -","start":1053.08,"end":1114.16,"speaker":"Laura Diaz","text":"Tucson the weight is over. Mediweight loss. They're officially open on North Oracle Road. That's right. No more counting down the days. You can walk in right now and start your journey to a healthier you. Hey, it's Laura Diaz from iheartradio and you can trust me. This isn't just another weight loss clinic. I know that because it's where I lost weight safely with real medical support. GLP1 medications. You can see them everywhere online right now. But the truth is, your health shouldn't be a DIY project ordering these meds without the professional guidance. It can lead to dangerous mistakes, wrong doses, no oversight, and serious risks. At mediweightloss, I got the same medication but with a customized plan, weekly check ins, and a licensed physician guiding me every step of the way. And the cost? The same as those risky online options. Tucson, your moment is here. If you're ready to take control, feel better and lose weight the right way, mediweightloss is ready for you. Walk in, get started and see real results. Call or visit mediweightloss.com to learn more and book your free consultation today. That's mediweightloss. Com."}
