{"episode_id":"SW - #144 - 2021-02-27 - Fr. John Strickland - History of the West in View of the East","start":0.48,"end":31.74,"speaker":"Jonathan Pageau","text":"So, hello, everybody. I am here with Father John Strickland. Father John is a parish priest in the Seattle area in Poulsbo. I hope I said that right, in Poulsbo on the West Coast. He is also on his. He has a PhD in history and so on the side. He also writes a blog, he has made a podcast called the paradise in Utopia, and he is now publishing books. He's published a book called the Age of Paradise, which I've read, and his. His second volume, which. Has it come out yet? I think it's coming out soon."}
{"episode_id":"SW - #144 - 2021-02-27 - Fr. John Strickland - History of the West in View of the East","start":32.22,"end":35.9,"speaker":"Fr John Strickland","text":"Yeah, it came out in November. Age of Division, that's out there."}
{"episode_id":"SW - #144 - 2021-02-27 - Fr. John Strickland - History of the West in View of the East","start":35.9,"end":113.72,"speaker":"Jonathan Pageau","text":"So the Age of Division, which I'm reading at this moment. And I think so much of what he is hinting at, the things he's bringing to the fore, are extremely important at this time to help us understand history and a more global vision of Christian history. This is Jonathan Peugeot. Welcome to the symbolic world. And so, Father John, I had just read the first volume, I'm reading the second volume. I'm very excited to see you do the things you do. One of the frustrations that I've had is as I explored the Church Fathers and I explored the history of the East, I realized just how much was lacking in my own historical understanding and how so many movements that happen even in the west cannot be properly understood unless we have this more global vision of the east and the west together in this discussion, in this conflict. A mix of influences. And so maybe you can tell us a little bit about what prompted you to want to tell this, this narrative."}
{"episode_id":"SW - #144 - 2021-02-27 - Fr. John Strickland - History of the West in View of the East","start":114.52,"end":308.22,"speaker":"Fr John Strickland","text":"Yeah, yeah. Thanks, Jonathan. Well, so I. I was teaching university full time before I went off to seminary and became a parish priest. And that's my main work now, being a parish priest, but in Poulsbo. But. But I've always had this really, really strong interest in history and in the. The legacy of Christianity within the history of the West. I've always been interested in that. That's what got me interested in history initially. And so when I decided to study history at the graduate level, I got to a point where I really wanted to understand, as you say, globally, the history of the west from a Christian point of view. It was always dismaying to me to see how little attention was given to the role of Christianity in our culture and in the formation of our culture. And when attention was given to it, often it was negative. You know, the Crusades, the Inquisition, the witch trials, all those things. So I really wanted to learn about that, and then I wanted to tell the story and so in the past few years, I've had an opportunity to start writing these books that are a history of Christmas from its origins all the way up to the present, which is designed not only as a narrative that's interesting and just hopefully enjoyable to read, hopefully interesting just to learn about history. I think that's really important in itself. But I really wanted to contribute to our ongoing discussion we have today in America, Canada, the West, of where we are culturally and why we face so many problems culturally, as almost everyone would, you know, admit today, on the left or the right. And so my book series is itself titled the Rise and Fall of what the West Once Was. And it's a history of what I call Christendom, a word that I appropriate from its kind of medieval use. I don't like the term medieval. We can talk about that later maybe, but. But it's recognizable. So that term arose as a term defining Christian civilization. And I think that even though we live in a post Christian society today, it's still a post Christian Christendom. It's still a civilization that is fundamentally shaped by Christianity. And so my project, it's in four volumes. You mentioned the first two of those. I'm working right now on the third volume, the Age of Utopia. That should be out by the end of the year. And then the final volume will be on the 20th century. It's provisionally entitled the Age of Nihilism. This is an effort to understand how Christendom first of all arose and then over the course of time was changed and was altered into what we see today, which in many ways is post Christian. But it still has, as I say, by using that term, utopia, it still has a very strong kind of root in, or roots in the Christendom of the past. That's what I'm trying to do. Yeah."}
{"episode_id":"SW - #144 - 2021-02-27 - Fr. John Strickland - History of the West in View of the East","start":308.78,"end":407.78,"speaker":"Jonathan Pageau","text":"And I think that it's very. I was really excited to read the book because, you know, some people have seen that. I interviewed Tom Holland recently and he has a similar position in terms of his discovery that to what extent Christianity is at the core of our value system, is at the core of what we understand to be a person. You know, so many things about how we understand reality comes from Christianity and the fact that it has been so pooh poohed in the past and it's been kind of cast to the side. You know, it gives us an opportunity to now tell a better story. And what I love about your book is that, you know, Tom focuses mostly on the west and he himself kind of expressed how he's frustrated that he couldn't include the East. But in your series, that's really the story you tell. You tell this. This global story of Christendom, and not Christendom in the sense of just a kind of political dominance of the Christian emperors or Christian rulers, but rather this capacity to enter into a hint of the kingdom of God in the world through this profusion of Christian identity and Christian participation in the world. And. And so, like I said, I'm really encouraging everybody, definitely, to read the book because it gives you a narrative of history that we haven't had in the past. And one of the things you want to do, and maybe you can expound on that a little bit for us, is you want to reconnect the east and west story. You want to show us how there is an inevitable connection between the east and the west in the way in which even the Middle Ages developed."}
{"episode_id":"SW - #144 - 2021-02-27 - Fr. John Strickland - History of the West in View of the East","start":409.29,"end":517.72,"speaker":"Fr John Strickland","text":"Yeah. You know, there's two things you mentioned there that I think are really important, Jonathan. One is Christendom, as I define it, is not a political system. It's not a union of church and state or something like that, you know, the loss of which is, you know, lamented by reactionary or conservative Christians today. It's much more than that. The state inevitably becomes part of the scope of the Christian transformation of the cosmos, a world, but that's only part of it. And so I locate the origin of this civilization with a supporting culture, as I define it, that directs its members toward the heavenly transformation of the world. That's my definition of Christendom. I located it at the very beginning of church history, at Pentecost, actually, because I think it's right there in the Book of Acts and in other early Christian documents, which I cite in volume one, the Age of Paradise. And for three centuries, it was a subculture. It wasn't the dominant culture. It was a proto civilization. It wasn't a full civilization yet, but it was there from the start. Continuously acting in this world is exactly what is a traditional Christian cosmology or understanding of the world. Because I think that there's something we're missing in our contemporary modern debate about Christianity, and that is how very cosmologically affirmative it was and historically was in that first millennium that I talk about in the first volume. And it embraced the world. It tried to transform the world. It didn't reject it and run away from it. It really was interested in engaging it. And that's what we're missing, I think, a lot of the time today."}
{"episode_id":"SW - #144 - 2021-02-27 - Fr. John Strickland - History of the West in View of the East","start":518.2,"end":531.12,"speaker":"Jonathan Pageau","text":"Yeah. And I think it's it's very fascinating because people portray Christianity as this denial of the world and you know, it kind of this weird Nietzschean vision that Christianity is a kind of hatred of."}
{"episode_id":"SW - #144 - 2021-02-27 - Fr. John Strickland - History of the West in View of the East","start":531.12,"end":533.4,"speaker":"Fr John Strickland","text":"The world and you know, the naysayers."}
{"episode_id":"SW - #144 - 2021-02-27 - Fr. John Strickland - History of the West in View of the East","start":533.4,"end":589.37,"speaker":"Jonathan Pageau","text":"Yeah, exactly. But that, like you said, that is not what we see. There is this notion of self sacrifice. All of this is part of understanding that the Christian self sacrificial love is the zeitgeist of Christianity. But the fruits of that are these communities that are bound together in love and that kind of flow out into reality. You see how literally the saints died in certain places. And then geography started to transform around these saints relics and how the world itself, pilgrimage places, became new centers for civilization. Christianity reorganized even the space of the Roman Empire. Not just it obviously reorganized its ethics and its way of being, but it actually reorganized even the geography of the Roman Empire. I mean, Constantinople is the ultimate example of how Christianity itself reorganized the empire. It was the city, it was the Christian city."}
{"episode_id":"SW - #144 - 2021-02-27 - Fr. John Strickland - History of the West in View of the East","start":590.25,"end":774.79,"speaker":"Fr John Strickland","text":"Yeah, right. Yeah. I mean, absolutely. Jerusalem became the center of the world, you know, and understood in the Christian sense. Yeah. And that's why the Crusades were always focused on it so much. So we could talk about government, politics and how that's really not the center. It's an important part of the Christian, traditional Christian vision of the cosmos, but, or culture. But it's not the main center of it. It's like you say, it's the world. It's a world that's filled with, with the presence of a living God. It's a world that has been penetrated by the kingdom of heaven which is drawn near to it. What I call paradise, that experience of paradise. But the other thing you mentioned, and certainly I want to give time to this too, if you're interested in talking about it. Is that point that you noted that I'm trying to link east and west here. This is a history of the west for sure. Most of my work, certainly in volumes after volume one, like the one that just came out, the Age of Division, it's mostly a narrative about the West. So there's plenty about Byzantium and Russia there as well and will be going forward. But you know, it's really interesting if you look at the history, Jonathan, for the first millennium, you know, we in the west were so used to thinking the west dominates the west, you know, kind of leads the way, culturally speaking. Everything kind of comes from the west and, and if you go back in time, it's like an onion peeling an onion. You start to see that there's no, West. There is a West, but it's not really. It's not the center. If you go back far enough into the first millennium, you find the center is the East. And one of my chapters in the book Age of Paradise is called when the West Was Still Eastern. And I talked there about how for two centuries, the popes of Rome would. We think essentially, you know, the kind of symbols of Western civilization at that time were all recruits from the east, from Syria, and especially from Constantinople and eastern parts of the empire at that time. Famous, important fathers of the Church, theologians who contributed to our understanding of culture, especially what it means to be human anthropology and what it means to what the world is. Cosmology, such as Maximus the Confessor, they were Eastern, they came to the West. Maximus helped organize a council in Rome itself. And these are people that are just forgotten. You know, Gregory the Great, the Pope of Rome. I have a son named after him, actually. He was just a fantastic example. Having lived in Constantinople for a few years, he came back and became Pope of Rome. And he's recognized, certainly in the west by Roman Catholics, for instance, as the most important person of his generation and beyond. But he had a very Eastern understanding of the cosmos and the place of culture within the cosmos. But it's interesting to be recovered."}
{"episode_id":"SW - #144 - 2021-02-27 - Fr. John Strickland - History of the West in View of the East","start":774.79,"end":861.99,"speaker":"Jonathan Pageau","text":"I think there's such a polemic reason why we've come to learn history this way. Right, right. There's a. There's one of the. One of the. Let's say one of the tools or one of the weapons of the Enlightenment has been to paint this idea of the Dark Age, this idea of the Middle Ages as this dark, regressive, you know, backwards age. And usually what they mean is basically England and northern France, like, that's. That. That's kind of like it's France and England, basically, that they're talking about. Maybe Germany is the kind of. And it's only for a few centuries. And if you take into account Constantinople, the very idea of the Dark Age completely vanishes. There is no Dark Age. It's actually that Constantine sets his capital in the east, and then that capital becomes the cultural center for all of Christendom. And the influence of Constantinople reigns all. And even at the conversion of Charlemagne, you can actually see how Charlemagne takes on the tropes of Constantinople visually in terms of artistic history. You can notice how he takes on the imagery that he gets from Constantinople. And so, like, Constantinople had running water and had, you know, education and had all the things of a civilization. And so I think that the reason. One of the reasons why we don't know about it is a polemical reason, is that we don't want, we don't. That the secular, modern secularist doesn't like the idea that the Middle Ages don't exist the way that you portray them."}
{"episode_id":"SW - #144 - 2021-02-27 - Fr. John Strickland - History of the West in View of the East","start":862.71,"end":939.89,"speaker":"Fr John Strickland","text":"Yeah, you know, the term medieval is interesting. I'm actually writing about that in the age of Utopia as we speak. The whole concept of the Middle Ages, of course, as you say, is a polemical concept. It's a weapon of the Enlightenment. The term wasn't actually coined and then became kind of established in Western culture only after about 1700 during the courts of the Enlightenment. And it was really the product of the so called Renaissance. When first Petrarch, father of Renaissance humanism, likened the whole history, the thousand years that preceded him as a darkness, a cultural darkness that overcame the west from which he needed to escape. And his escape was into the seculum, into the secular, non religious, non Christian, unchristian kind of realm of the pre Christian culture of pagandom of pagan Greece and Rome and others after him coined this idea of light and darkness. And then this became kind of consolidated by Enlightenment. It really dismisses 1000 years of Western history. Yeah, that's effectively what it does."}
{"episode_id":"SW - #144 - 2021-02-27 - Fr. John Strickland - History of the West in View of the East","start":939.89,"end":1051.38,"speaker":"Jonathan Pageau","text":"And you can, it's, it's funny because in a way, if you look at the context, you can have some sympathy for Petrarch, like, because he's coming out of the plague. And so you can understand that here he is like, no, seeing these bodies dead, all these dead bodies and this whole breakdown of, of culture that's happening because of a disease and then projecting that back onto history for the, for a thousand years, you know, and so I mean, I can kind of have some, a little bit of sympathy for Petrarch, but I don't necessarily have sympathy for those who weaponized his vision in the Enlightenment. And you know, how can you look at a Gothic even, like, even in terms of the west, like how can you look at a Gothic cathedral and say Dark Ages? And I don't understand how that's possible. I mean, there was a breakdown in terms of these non Roman pagans who were, who are kind of taking over for a little while, but as soon as they become, as soon as they become Christianized, you see the transformation start to happen. And that's one of the interesting things that you explore, I think, in your book, is that on the one hand you're not afraid to show the dark side of some of the things that happen, even in terms of Constantine's conversion or Charlemagne and all of these figures that convert. And you can see that there's still some elements that they have to deal with that had to be transformed. But, but nonetheless you can point to actual fruits of the changes which occurred in their conversion, even if it was in total. So yeah, Constantine did kill his son, and that's a horrible thing. But in that change from a pagan world where it was absolutely normal to do that kind of thing, or this constant destruction of the hares and these horrible emperors that were doing monstrous things, you can nonetheless see the difference and you can see the transformation. Even if it's not, it doesn't bring us into the Holy of holies, let's say right away."}
{"episode_id":"SW - #144 - 2021-02-27 - Fr. John Strickland - History of the West in View of the East","start":1052.5,"end":1248.58,"speaker":"Fr John Strickland","text":"And it won't. Yeah, for sure it won't in this world. And I try to emphasize that, you know, the age of paradise, so called, is not an age when everyone lived in paradise and everything was, you know, just happy and beautiful and holy and, you know, good. No, there was darkness everywhere. I mean, it was darkness everywhere and there always will be darkness. As I understand it, as someone who reads the scriptures and thinks about the Christian revelation, seriously, I think they're always going to be that darkness that Petrarch spoke of, that Tenebrae in Latin, you know. But what's interesting there, Jonathan, is it wasn't just as I understand, as I do the research and think about it, you know, when Petrarch had this reaction to this kind of reaction to his culture, it wasn't, I think, driven just by the plague, the Black Death, which he did live through. One of his sons was actually perished as a young man from the plague. So he knew it quite well. But I don't think that's really the main thing. I think what's going on there, and this is what I bring out in the second volume, the age of division, is that once that disconnection between west and east took place, once the west no longer was rooted in Eastern Christendom, there's a real change, a real shift in the culture. And I do believe this is extremely important for understanding why we're dealing with kind of out of control abortion and why we're dealing with political correctness and all the other stuff that afflicts our modern culture today. Because that detachment from a civilization with a supporting culture in the east that directed its members toward heavenly transformation of the world. When that happened, a great pessimism began to seep into Western culture. You can see this in what I call the stavrocentrism or the cross centered culture of penitential pessimism. The rise of the doctrine of Purgatory, for instance, which I look at real closely. And the second volume, all of this, of course, following the Great Schism, I call it, the great division between east and West. And you start to see a culture that's very pessimistic. And I think, you know, Jonathan, I think that's really what was driving Petrarch's turn, almost desperate turn, because he was a smart, brilliant man and so enjoyable to read. His turn toward what is called the Seculum, the secularity, the secular world, a world that is spiritually untransfigured, untransformed, a world that exists only for its own sake. And that is the beginning. It's a flight from pessimism, the pessimism of the Christian culture of the west having become detached from the culture of the east for a few centuries now. That's really the beginning of what became the Renaissance and its humanism and the Enlightenment and the de. Liturgification of art, when. When art no longer had a liturgical role to play and it just became an end in itself. The Renaissance being the. The classic example of that."}
{"episode_id":"SW - #144 - 2021-02-27 - Fr. John Strickland - History of the West in View of the East","start":1248.9,"end":1260.42,"speaker":"Jonathan Pageau","text":"Yeah. And I think there's also this. You hint at it a little bit also in the book, and I have, like I said, I'm still in the. On the first 100 pages of the second volume. But, you know, the problem of."}
{"episode_id":"SW - #144 - 2021-02-27 - Fr. John Strickland - History of the West in View of the East","start":1262.2,"end":1262.32,"speaker":"Fr John Strickland","text":"The."}
{"episode_id":"SW - #144 - 2021-02-27 - Fr. John Strickland - History of the West in View of the East","start":1262.32,"end":1355.39,"speaker":"Jonathan Pageau","text":"Iconic classic controversy, it's something which people, especially as an artist, I take that very seriously. But it's something which is very important and people ignore. How Charlemagne and the Frankish court is meddled is mixed in with the whole question of the iconoclastic controversy. And the solution that the Franks gave and that the west ultimately kind of arrived to was something which didn't totally integrate theologically the image, which kind of said, we have these images, but we don't see them as liturgical. We don't see them as participating in this, in the reverence and the veneration and then ultimately kind of moving up towards the worship of God. And I think that that's like a little. I don't know if you talk about that, but I've always thought that that's a little seed which was already planted in the West. And then as the Renaissance came and then the Reformation came, there were no arguments. People didn't have St. John of Damascene's incarnational argument to be able to explain why we have this stuff in the Church. And so it kind of. This kind of fell flat by the time the Protestants arrived. No one, I think John Calvin, even in his when he talks about images, he doesn't even address St. John Damascine's argument. He doesn't talk about the Incarnational argument at all. So that was all the way back during the time of the iconoclastic controversy, where the excess of the east and the kind of. And the west, this strange mixture, created this problem, which just continued on."}
{"episode_id":"SW - #144 - 2021-02-27 - Fr. John Strickland - History of the West in View of the East","start":1356.19,"end":1485.13,"speaker":"Fr John Strickland","text":"Right. You know, the west never developed a really clear, coherent understanding of the image. You know, in the east, of course, with iconoclasm, they were forced to. And John of Damascus and. And Theodore the Studite came forward and articulated, as Fathers of the Church, articulated, what the image is. You know, and like you said, it's grounded in the Incarnation. It's grounded in traditional Christianity's understanding that the world is not disconnected from heaven, from God, from paradise, but the world is filled with the presence, sacramentally, especially and liturgically, the presence of heaven. And that's what the image and the theology of the image does in the east and in the West. Charlemagne's court, you know, we're talking Charlemagne for your listeners and viewers, I mean, it'd be like about 800. So this is still before the Great Schism, but it's about 800. This is going on. And his Frankish theologians, they didn't get that at all. They saw the image as being pedagogical, only as being something that's useful for teaching. And that's. That's fine. That's good. That's part of it. But as the fathers of the 7th Ecumenical Council in the east had said, it's good for teaching, but primarily, it bears witness to the fact that God became human in the Incarnation. The world, the cosmos, is not on its own living out its life for its own sake. It is now joined to heaven and to eternity. And that really is the break. I think that's it. And after that, you mentioned the Renaissance boy. I mean, you talk about what was going on in the Renaissance and Calvin's reaction to it. You look at what the Renaissance did with art, the humanists. I mean, our culture celebrates Michelangelo and Raphael and Titian and all these famous Leonardo. But if you look at these from a deep, historically deep point of view, it's just an aberration. It's so weird to see what they were doing with their art."}
{"episode_id":"SW - #144 - 2021-02-27 - Fr. John Strickland - History of the West in View of the East","start":1485.53,"end":1544.95,"speaker":"Jonathan Pageau","text":"Yeah, I agree. I mean, obviously I agree. That's why I'm an iconographer. And I had this interesting discussion recently with Catholic Thomas about this problem of nakedness in art and why in the west, they've kind of accepted that. And I really I see. To me, the Renaissance is a pagan move. It's a. It's a move towards a pagan thinking, a pagan aesthetic and pagan sensuality. And so, like you said, there's a sympathy for Calvin or the reformers who are reacting to this like you were reacting to a Rubens in a church with all this, like, naked, like, orgiastic flesh in the altar. And you're like, okay, so this is it. Like, this is what we're going to have in the church now. So there's a certain sympathy for. As you move into extremes, sometimes you can understand the reaction to something which is already excessive, and then it moves into another excess. And then after that, it's the history of the West. It's just from one excess to the other, from one extreme to the other, all the way into the, you know, into the utopian age of our."}
{"episode_id":"SW - #144 - 2021-02-27 - Fr. John Strickland - History of the West in View of the East","start":1544.95,"end":1545.35,"speaker":"Fr John Strickland","text":"Of the."}
{"episode_id":"SW - #144 - 2021-02-27 - Fr. John Strickland - History of the West in View of the East","start":1545.35,"end":1603.15,"speaker":"Jonathan Pageau","text":"Of the modern world right now. But I love. Like, to me, I'm really happy that you say that, because I've been kind of secretly, secretly thinking that the iconoclastic controversy and the relationship between Charlemagne and the conflict that happened and the wars of iconoclasm that happened at the time are one of the key moments in the definition of the west and the separation between the two, and how the problem of understanding the Incarnation and the transformational aspect of reality appears very clearly in that moment where even today, when I talk to Catholics and Protestants, sometimes, when I talk about the transformational aspect of what Christ brought and how we are called to be brought into God and to participate in the life of God. You know, like, the people, they don't feel good about that. They feel uneasy about it. But you see an example of that right there in Charlemagne's court at that time."}
{"episode_id":"SW - #144 - 2021-02-27 - Fr. John Strickland - History of the West in View of the East","start":1603.55,"end":1630.75,"speaker":"Fr John Strickland","text":"Yeah. And that's simply the doctrine of the Incarnation. You know, that's why the Orthodox east is very comfortable using the word therapy, theosis, or deification, when it talks about its understanding of salvation. It's not just, you know, release from condemnation, escape from punishment. It is, but it's much more, much more than that. It's participation in the life of God. And that's really central to it."}
{"episode_id":"SW - #144 - 2021-02-27 - Fr. John Strickland - History of the West in View of the East","start":1631.79,"end":1688.49,"speaker":"Jonathan Pageau","text":"I hate keeping this harp on Charlemagne. Maybe because I'm French is one of the reasons why I'm so interested in Charlemagne. But the fascination of that moment, to me is so important because you see even that as Charlemagne is distancing himself from the east and saying, I am the emperor. And he was named emperor after Irene's deceased husband, like, in the order of. He wasn't Like Emperor of the west, he was like, emperor after the Byzantine emperor. And so as he's distancing himself, he's taking on all the visuals of the. Of the East. And so you can. The Carolingian Renaissance is basically a kind of Westernizing of Byzantine imagery. And you see it in the, in the, in the ivories and the imagery and the mosaics. All of this at Aachen, like this kind of golden look that he's trying to imitate. So it's a weird. It's an interesting. Like, I'm separating myself, but I'm also being completely influenced by this society."}
{"episode_id":"SW - #144 - 2021-02-27 - Fr. John Strickland - History of the West in View of the East","start":1689.21,"end":1712.89,"speaker":"Fr John Strickland","text":"That's it. It's very strange. It's almost, you know, schizophrenic, because there is this total identification with the Byzantine example, the emperors of Rome or the Byzantine emperors. And Charlemagne now assumes that because he's conquered so much of the west and he wants to integrate a big, powerful imperial state. Now Pope of Rome has gotten fed up with the east because of iconoclasm."}
{"episode_id":"SW - #144 - 2021-02-27 - Fr. John Strickland - History of the West in View of the East","start":1713.05,"end":1729.92,"speaker":"Jonathan Pageau","text":"And it's Irene, I mean, the empress. I have sympathy for them as well. I would, like, what would you have done if you were pope? And then this empress is killing her own children and like, okay, what do we do here? Declaring herself emperor and like, okay, this is not going well."}
{"episode_id":"SW - #144 - 2021-02-27 - Fr. John Strickland - History of the West in View of the East","start":1730.32,"end":2132.42,"speaker":"Fr John Strickland","text":"Oh, it's intolerable. What was going on at the Byzantine court in the east was just intolerable over and over again. And it was heroic for the papacy to try to find, to stand up against that. And as I say, the papacy played a very heroic role in much of the first millennium and even beyond trying to correct mistakes that were being made by political authorities, especially emperors like that. But back to Charlemagne, what's interesting there is that on the one hand, he totally identifies, like you say, he builds his new temple in Aachen, famously built and modeled on Byzantine architecture. He assumes this almost Caesar of Papist kind of. He's almost like a priest. He couldn't, you know, he was really interested in theology. He had theology read to him. Charlemagne be sitting at his dinner table in his palace hall, and he would order his servants to read the City of God by Augustine to him while he's munching on his dinner. You know, I mean, that's. That's the mind that Charlemagne, that Charlemagne had. But his theologians, these Frankish theologians were so. I mean, they're like the first cultural activists, you might say they were shock troops of a new Western identity that is distinctly and by definition not Eastern, you see. And that's the break that's where it starts, of course, nothing's done in a single generation in history, but that's where it really starts. You start to see the formation of an identity we call the west, distinct from the east or the Greeks. So I think what happens after Charlemagne is you get this different culture which defines itself against the east, not with, but against the East. Then the Great Schism comes up a couple of centuries later, 1054 is the excommunication. Then after that, all these changes start to happen under the influence of the papal reformation of that time. You get Papal supremacy, you get the Crusade starting within about 50 years of the Great Schism. Beyond that you get doctrines like Purgatory, which projects the experience of paradise for someone living in that culture. Purgatory is this tremendously intimidating process of punishment after death, post mortem punishment that its effect on the culture of the west is profound. That culture becomes inherently, you know, very deeply penitential, pessimistic. The experience of paradise that I tried to document in the first millennium in my first book gets put off until after that. Purgatory, you know, plays out thousands of years, whatever a year is, and beyond this world. And so you get all these, you know, the, the, the paintings of Giotto, as beautiful as those are in the 14th century, those paintings are intensely, they're designed to create an intense reaction or response of sorrow and penitential kind of doubt and introspection that itself contributes to a growing pessimism. And so this tendency in the west after, after Charlemagne and the Great Schism is more and more to lose that incarnational culture that was so strong in the east and so strong in the west too, during the first millennium. But now after the Great Schism and that great division, it becomes much weaker. That's what happens with Petrarch and the, and the Renaissance, so called the humanists come forward and they say, you know, this is. And they're not, they don't put it this way, Petrarch almost puts it this way, but they don't quite put it this way. But what they do is they seek, they seek, they seek human fulfillment no longer in a world that's been transformed by heaven. They seek human fulfillment in a world for its own sake, a secular, so called secular world. And that's their contribution. That's why Renaissance painting is so naturalistic and so fleshy and so focused on the artist as genius. You know Michelangelo signing, you know the story about his Pieta, that famous statue of the Virgin Mary holding the dead Christ that gets put in St. Peter's he finishes the carving of it, one of his most famous works. And it's put, you know, for everyone to come look at. And he stands back in the shadows, we're told by contemporary account, to see what the reaction is, because artists are very, very competitive then and for commissions and all that. And some bumpkin comes in from the countryside and says, that's beautiful. Who did that? And some guy. Some bumpkin standing next to him says, I think it was a guy named Raphael. I don't know what he says exactly. It's not Michelangelo. Michelangelo recorded that he became infuriated. He went home that night and came back to the church with the hammer and chisel, and he chiseled right across the strap of the Virgin Mary's chest. This is the work of Michelangelo. And that's the. There had been autographs before that, but that's the origin of the artist's autograph. That's so necessary in modern art. You know, the artist is pushing the limits, has radical things to say. And to reveal Michelangelo's decoration of the Sistine Chapel. You talk about revolutions in liturgical life. This is a chapel with an altar, and over the altar you see the sea of naked bodies. Right. It's the Last Judgment, too. It's not even what you would see. The incarnational icon in the east was the Virgin Mary of the Sign, with Christ being born into this world from a human mother. Now it's the Last Judgment and all of its terror. You know, the famous creation of Adam in the Sistine Chapel, he modeled his image of God creating Adam. He modeled him on Zeus. If you go back and you look at statues of Zeus, this highway, you know, this. Like he's been to, you know, Gold's Gym or something, is really, you know, developed chast. And he just looks. With a white beard and all that stuff. I mean, that's just. It's beautiful in a worldly sense, but it no longer has any liturgical or sacramental significance at all."}
{"episode_id":"SW - #144 - 2021-02-27 - Fr. John Strickland - History of the West in View of the East","start":2132.5,"end":2146.98,"speaker":"Jonathan Pageau","text":"Yeah, there's so many things wrong with that painting. I can't even start. Like, why the naked. Like all the naked babies, and why is there like a naked teenager next to him? And it's just very disturbing. Michelangelo's paintings are very. Are very disturbing."}
{"episode_id":"SW - #144 - 2021-02-27 - Fr. John Strickland - History of the West in View of the East","start":2147.7,"end":2190.25,"speaker":"Fr John Strickland","text":"Look at Raphael. Think about, you know, the famous Sistine Madonna. You know, that's one of his many Madonnas, by the way, Raphael is writing about this in my new volume, the Age of Utopia. It's accounted by a contemporary, his name was Vasari, about the history of the lives of the painters. You probably know about it he said that Raphael was like a total womanizer and he would seduce his female models that were sitting as models for him. Modeling is a totally new thing too. When he was painting, they were modeling the Madonnas for him. But in the Sistine Madonna, he's got those two little, what are they? Angel thingies, I call them at the Botanas."}
{"episode_id":"SW - #144 - 2021-02-27 - Fr. John Strickland - History of the West in View of the East","start":2190.25,"end":2217.38,"speaker":"Jonathan Pageau","text":"Yeah, they changed. They had these figures in Roman art which were called putti, were like these little domestic gods, you know, like these little babies with wings. And then they somehow changed the cherubs into these putti. And so the cherubs which are these like flaming, you know, flaming glories of God with like multi eyes and wings became these cute little naked babies with wings."}
{"episode_id":"SW - #144 - 2021-02-27 - Fr. John Strickland - History of the West in View of the East","start":2217.7,"end":2293.97,"speaker":"Fr John Strickland","text":"You want to poke them in the belly like the Pillsbury Doughboy, and they become totally insignificant and powerless. And that, I think, Jonathan, is the sign of the shift in culture now toward a secular transformation of the world from a heavenly one. The heavenly powers, you know, the archangels, angels, seraphim, cherubim, meaning stand about the throne of God. You know, we can quote the Divine Liturgy. These no longer are relevant. So they become these two little bored looking, cutesy little angel thingies at the bottom of the painting. And that really becomes the image in Baroque painting, as you know better than I, of what an angel looks like. It's just a cute little powerless, unintimidating baby. Because there are no demons to worry about. Because man is autonomous, you know, that's Pico Delamere Dolla's argument in the dignity of man during the. During the Renaissance, that man is autonomous, he's in control of his own life now. And you just get this demunization, this diminishing of the heavenly presence in this world. And angels are now represented even as Christ. How do you pray to Christ when he's a naked little baby? You know, I mean, with his forgive me. But it's genitalia exposed. That's not a liturgical image anymore. Yeah."}
{"episode_id":"SW - #144 - 2021-02-27 - Fr. John Strickland - History of the West in View of the East","start":2294.93,"end":2424.59,"speaker":"Jonathan Pageau","text":"It's interesting though, is something that I've been thinking about in terms of art. There's something like, for example, Michelangelo's work. It never landed, right? It never landed. It never created a tradition. It never created. So nobody copied his images. Nobody copied those paintings and made them into other. Whereas I think that there's still an implicit thing in the Catholic tradition. There's still the possibility of. So there are still images which appear later, which become almost iconographic in their use, let's say. So if you have someone who has little saints cards with a Prayer behind it. There's something about that which, even though they don't have the theology to explain it, there's an intuition that people have about their connection to the saint and the way that say that these little saint cards that are cheap and you can buy at a little gift shop, the way that they're framed, even though they're still Western and they still have a kind of photo type realism to them, they've been sobered up, they've been brought into a kind of more frontal pose, all of these elements of iconography nonetheless kind of persist in this folk and a kind of intuitive folk world that continues to exist, even though in the big churches, in the high churches, there's all these diagonals and all this madness and all these floating vestments and all of this kind of craziness, you know, for the humble pilgrim and the little person who has a card of a saint in their house, it'll still look something like an icon. There'll be a little bit a tinge of a remembrance of that world because it is more connected to how we actually engage people. You know, you don't meet naked people and you, you can't, you can't pray. I mean, I don't know, like, have this like kind of sensual naked person in front of you and you're. It's supposed to. You can't look at them in the eye and then invoke them or, you know, ask for their prayers. Whereas these little saint cards, where you just see the figure looking at you with a bit of a glow in the back, it's kind of tacky, but nonetheless it has that. It has a little bit of the iconic memory does."}
{"episode_id":"SW - #144 - 2021-02-27 - Fr. John Strickland - History of the West in View of the East","start":2424.59,"end":2508.28,"speaker":"Fr John Strickland","text":"You're right about that. And I think that's just instinctive. It's maybe intuitive. There's also, of course, this revival of Eastern iconography, you know, that you see in a lot of Western churches these days. Yeah, but I think that's. That's what people are seeking. I think that that's what human beings were paid for, was a connection with heaven. And that's the way we make it. You know, we don't make it by looking at a fleshy image. Even if it's in a church, even if it's over an altar, it doesn't do any. It keeps us locked into this world, into the secular. It keeps us in the secular. And man was made for more than the secular. And so that's why people are trying, I think, especially today, to find a way out of this. I think it's really A cultural dead end, artistic dead end. I mean, look at the 20th century. Picasso, that disintegration of the human figure, you know, that just, you know, I think humanism as it was expressed by Michelangelo, like you said, he never. He never really created a tradition that followed him. I think humanism just spent itself by the 20th century. You know, it was seen more and more by, first Nietzsche, but then artists of the Dada movement and the Dali and the Surrealists and others. Picasso, for sure, it was seen as a counterfeit, as something that was just, you know, didn't have substance."}
{"episode_id":"SW - #144 - 2021-02-27 - Fr. John Strickland - History of the West in View of the East","start":2508.52,"end":2597.63,"speaker":"Jonathan Pageau","text":"And it's interesting because even if you look at the history, there's a little microcosm which happens in the Renaissance which people don't like to talk about so much, because by the end of the Renaissance, there was a movement called Mannerism. And you see it even in Michelangelo's late work, where it's as if this kind of glorious realism and this kind of glorious sensuality of the beginning of the Renaissance quickly turned into this strange exaggeration, the stretching of figures, the excess in color. And so you have this weird manneristic painting which happens at the end of the Renaissance, which is only broken by the Council of Trent and this kind of glorious baroque. But you almost see a microcosm of what's gonna happen in the whole story right there in the Renaissance. By the end of it, you have a disintegration of form. And. And then if you. If you take a bigger loop all the way into modernism, you have the same move which moves all the way down into. Because as you kind of explore the sensual aspect of. Of something, as you fall into the passions, those passions have no limit, right? And they start to turn into weird things, right? You know, the weird. You know, and that's. You can see that in the madness of pornography today, where it's like. It goes into all these weird little, like, fetishisms and stuff. And so it was already there, like, right in the Renaissance at the end of it. And then the whole modernism, like you said, you can see, like, by the time you get to Francis Bacon, you're like, you know, that, you know, a portrait by Francis Bacon was promised to you in Michelangelo already at the beginning."}
{"episode_id":"SW - #144 - 2021-02-27 - Fr. John Strickland - History of the West in View of the East","start":2599.87,"end":2605.15,"speaker":"Fr John Strickland","text":"Postmodernism. Yeah, Francis. Francis Bacon is a good. Good example of where this all goes."}
{"episode_id":"SW - #144 - 2021-02-27 - Fr. John Strickland - History of the West in View of the East","start":2605.31,"end":2625.05,"speaker":"Jonathan Pageau","text":"Yeah, exactly. Exactly. And so one of the things. Francis Bacon. No, he passed away, I don't know, a while ago. I think so. Yeah. A very dark figure himself. Like, he. He himself manifests a lot of the. Of the darkness of. Of what the nihilistic 20th century is, you know, in his. In his story as well, in many."}
{"episode_id":"SW - #144 - 2021-02-27 - Fr. John Strickland - History of the West in View of the East","start":2625.05,"end":2654.13,"speaker":"Fr John Strickland","text":"That's what. That's what the artist of the post Renaissance, post Michelangelo, chiseling autograph is all about, is self simulation, you know, driven to. To create, not to reflect heaven or anything else, but to be the center of creation and radical breaking from everything that preceded it. And sadly, that is, I think, just creates a maniacal kind of personality. The modern artist."}
{"episode_id":"SW - #144 - 2021-02-27 - Fr. John Strickland - History of the West in View of the East","start":2654.29,"end":2654.97,"speaker":"Jonathan Pageau","text":"Yeah, exactly."}
{"episode_id":"SW - #144 - 2021-02-27 - Fr. John Strickland - History of the West in View of the East","start":2654.97,"end":2680.49,"speaker":"Fr John Strickland","text":"But you look at traditional iconography, as you well know, Jonathan. I mean, the standard, the way of life for an artist of Byzantium was to fast. To fast, you know, to pray, to receive the sacraments on a regular basis, and then to hand on tradition through the image that has been already preceded you. And you don't radically alter that image."}
{"episode_id":"SW - #144 - 2021-02-27 - Fr. John Strickland - History of the West in View of the East","start":2680.73,"end":2754.62,"speaker":"Jonathan Pageau","text":"Yeah. And there's been an effort to. Now we have some iconographical Saints. You know, St. Andre has been recognized as a saint. You can get an icon of Andre Rublev. And so there is this. And he was a monk. His whole life was a transfigured life. And so it showed in his painting. So one of the things that I really like about the book is how you also. It's really what I like is that although you have a perspective, you're careful not to fall into polemics as well, where you show the promise. For example, like we talked about Charlemagne. You show the promise of Charlemagne, like how this could have gone, like it could have been. There are some positive aspects which could have gone well. And then showing how. No, this is how things happened. You do the same with Constantine. There's a certain amount of realism in the way you approach it. You show the positive aspects of the papacy, the negative aspects also, even of how the moments when Constantinople was in heresy and was completely off the chart. And so there. There isn't. It isn't just like a. It isn't just a. It's not a polemical work in that sense. It really is trying to tell the bigger story."}
{"episode_id":"SW - #144 - 2021-02-27 - Fr. John Strickland - History of the West in View of the East","start":2754.62,"end":2754.94,"speaker":"Fr John Strickland","text":"Right."}
{"episode_id":"SW - #144 - 2021-02-27 - Fr. John Strickland - History of the West in View of the East","start":2754.94,"end":2774.61,"speaker":"Jonathan Pageau","text":"So that people can have a East, west vision of this Christian culture, which if you just show one side of it, you lose out on so much of how the world ended up. And so, I don't know. Have you seen someone else do something similar to what you're doing? Because I haven't really seen that on the horizon."}
{"episode_id":"SW - #144 - 2021-02-27 - Fr. John Strickland - History of the West in View of the East","start":2775.09,"end":3030.14,"speaker":"Fr John Strickland","text":"I haven't. No, I haven't, Jonathan. That's. That's what motivates me, I guess, you know, is, you know, I mean, I love the West. I mean, well, we're Westerners, like we are. Yeah, yeah. I mean, I do. And. And I mean, I'm. You know, we were talking before we started. We were just chatting a little bit, and you mentioned something about, I think, some positive things about the west, science and such. I would. I would really be at a loss. I can't even imagine. I mean, I can, but without classical music, and I can't access classical music without modern technology. You know, I mean, I've listened to. I've listened to Tchaikovsky's Sixth Symphony, like, probably. Well, of course, that was his last. Let's do something early, like his. Whatever, his violin concerto. I've listened to Tchaikovsky's Violin Concerto 100 times or a thousand times more than Tchaikovsky ever listened to. Listen to it. I mean, that's one of the incredible things about modern technology is, you know, we can access things like that. I can just play that, you know, as I'm driving or working or whatever. And there's so much that's good. But back to your question. What's happened is that there really is. It's maybe polemical, it's maybe just an unconscious bias, but there is this sense of that there is no ease. Someone knows something about. There's a Russia, and it's always associated with a guy named Putin, you know, and that's kind of it. Maybe there's some ballet. Maybe, you know, there's Tolstoy. Right. That's kind of the end of it. And there's, you know, Star Trek didn't use a character called Chekhov or something like that. I mean, it's so minimalized and nothing's known about it. And that's what I was trying to do. A lot of people who are concerned with the issues of today trace those back, if they trace them at all. A lot of people just talk about them. I think that's why Trump was such a big deal, because people don't really want to think about history or the past or origins of anything. They just want to solve the problem in an immediate sense. But if people think historically about where this came from, I think it'd be interesting to do kind of a survey. But I think. I think probably the majority of people are going to say it's the sexual revolution. Yeah. 60s, you know, that stuff. Those who are maybe a little bit more like, you know, formed educationally, might say, oh, no, it's more like the Enlightenment did that to us. And then others might go further back, especially if they're Roman Catholics. They might go back to the Protestant Reformation. There's a brilliant book out there by a guy named Brad Gregory. He teaches at Notre Dame, called the Unintended Reformation. How a Religious Revolution. I forget how the rest of the subtitle, but it's essentially how the Reformation out of control and produced the pluralistic culture. Yeah. And it's really interesting. And some would say that's really when it happened. But what I'm trying to do is say, you know what, if you go back even beyond that, you find that it's really the great division that can be marked at 1054, although that's not really everything. Yeah. And Charlemagne. And that's really when we see the change that began to accumulate and lead to where we are today. And no one, again, to answer your question, to my knowledge, in the West, I don't know what they're doing in Russia or Greece. I mean, Jana Ross is a famous Greek Orthodox lay scholar, and he's written stuff about coming kind of with historical kind of insights into things. Some others have as well. But, no, there's almost. I mean, there's nothing that I know of that's out there right now. Tom Holland is someone that you mentioned. I loved his book Dominion. I. I really loved some of his other books as well. But, you know, he's. It's just not on his radar. And having grown up in Orange county, you know, I mean, at, you know, in the 70s, I was never told anything about the East. I mean, I wasn't told that there even was an Orthodox church. There was Roman Catholic and Protestant churches, and those are the two Christian traditions that are, you know, behind the civilization we live in. And I don't think anyone's doing that right now."}
{"episode_id":"SW - #144 - 2021-02-27 - Fr. John Strickland - History of the West in View of the East","start":3030.14,"end":3133.19,"speaker":"Jonathan Pageau","text":"No, I mean, I think. I think, like, I've seen some people. I was thinking while you were talking about if I. I've seen some people do that, but sometimes it's done in a way that's so polemical that it's almost just turns you off. Right. And so I think that it's important to be able to see, for example, in the conversion of the Northern people and to understand that there were some positive elements in the Franks as well. There was this desire to be Christian. And you can see it in the art, you can see it in the architecture that there is a positive element to it, but that nonetheless, there's a seed which is planted, and you can kind of see the seed being planted, and it starts to grow and grow and grow, and at some point, the fruits of that start to appear, and it doesn't mean that within that there wasn't also some. There weren't saints. There were saints there. There were people who were embodying this paradisal reality, even though kind of, let's say, the current was going against them, but that we can nonetheless notice that the change was planted quite early in the. In the history of the church and just kind of took form as. As time went on. And so it's hard to say because I'm a French person. And so, like, I don't like going against, let's say, my own. My own tradition. And that's why I also want to be able to see the. Also the energy of the north, let's say, is something which I think is. Is important because it also happened in Russia too. It didn't just happened in the. In the west, it happened both in the east and in the West. And so there are positive elements of that energy that came down from the north and created some of the great kingdoms, you know, the Norman kingdom of Sicily and all these kind of these magical places which have a lot of strength to them. But nonetheless, that seed was planted and you can't avoid it."}
{"episode_id":"SW - #144 - 2021-02-27 - Fr. John Strickland - History of the West in View of the East","start":3133.75,"end":3192.46,"speaker":"Fr John Strickland","text":"Yeah, no, you're right. And there was a lot that's really admirable about Frankish civilization and, and it spread in Anglo, Saxon and Celtic. You know, I end the age of paradise on an island of the furthest, the westernmost island of Christendom, which is Scalig Michael, you know, off the coast of Ireland with the Celtic monks there about the year 1000, praying. And the Celts, you know, had this tremendous, tremendously cosmologically affirmative piety that really is so consistent with everything that we see in the first millennium and beyond that. The papacy played heroic, a heroic role and really was trying to edify and increase the quality of Western civilization for centuries. When the Protestants came along, they were doing a lot and have done a lot for modern civilization, that's for sure."}
{"episode_id":"SW - #144 - 2021-02-27 - Fr. John Strickland - History of the West in View of the East","start":3192.86,"end":3226.11,"speaker":"Jonathan Pageau","text":"Yeah. And so, Father John, I want to thank you for your time and I really want to encourage everybody to go and get his book, his books now, and also check out the podcast, which is a kind of longer spoken version of some of the things that are in the book and also his blog on his website. I'll put all those links in the description so you can follow Father John in his musings and in his thoughts about history. So, Father John, thank you for your time and hopefully, you know, once I finish your next book and maybe the other one, we can have another conversation about how all this unfolds."}
{"episode_id":"SW - #144 - 2021-02-27 - Fr. John Strickland - History of the West in View of the East","start":3226.51,"end":3229.47,"speaker":"Fr John Strickland","text":"You bet. Jonathan. Yeah, thanks for having me. It's nice talking to you."}
{"episode_id":"SW - #144 - 2021-02-27 - Fr. John Strickland - History of the West in View of the East","start":3230.59,"end":3295.48,"speaker":"Jonathan Pageau","text":"I hope you enjoyed this episode of the Symbolic World. The Symbolic World is edited by Justin Ward and it is based on a series of videos that you can find on my YouTube channel, Jonathan Pageau's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course leaving a review on itunes. Everybody knows that's the best way to get the podcast out there to get it heard. And if you want to get involved, you can also support the podcast financially going to www.thesymbolicworld.com support or else on Patreon Pageau videos as well and on subscribestar. All those links you can find on my website or in the show description. So thank you and I will see you soon."}
