{"episode_id":"SW - #236 - 2022-06-08 - May 2022 Q&A","start":12.08,"end":5156.36,"speaker":"Jonathan Pageau","text":"This is Jonathan Peugeot. Welcome to the symbolic world. Hello, everybody. All right. Hope everybody's well. I. This last month has been completely mad for those who have been following me, there's been a lot of stuff going on. That's why I've actually made. I think I made, like, one less video this month just because Jordan Peterson asked me to come up to Toronto. I spent several days there with his. With his family. I hadn't seen him since 2018, which was. Which was crazy. And so we filmed some stuff at his house and with John Vervecki. And then when I came back, he asked me to come also to Montreal. I was doing an event with him in Montreal, which I turned out, turned out I was on the stage with him the whole time asking questions and stuff. So it was pretty wild. I'd never talked to so many people, like, like 1700 people. And so that. And everything that kind of came around, that more kind of interviews and people wanting to talk to me has made the last month quite. Quite crazy. And so. But, you know, everything is. Is all good. I hope everybody's well. All right, so let's start and see if we've got some interesting questions in the chat. Let's see. Do I have some announcements to make? Probably not. For those who are still waiting for God's dog, It is on the boat, is all I can say. It's coming to the warehouse. Everything is set up. We're just waiting for the books to arrive, and then we will. We will ship them. It's still going to take a little while, I guess. Everything just takes so much longer than what I had hoped for. And so I apologize for people who are waiting for the book. It's coming. We definitely will not make the same mistake for book two. We will make sure that everything is kind of set up and everything is ready before we move ahead and tell people either we're going to do it as a crowdfunding or however we're going to do it, we're going to make sure that we don't have people waiting for like, eight months before they get the book. So that's important. What else is there? And so. All right, let's go. So let's see. Simeon Andreas asks, what is the relationship between emergence and God's continual creation? And so, I mean, that's a good way to kind of understand it, actually, is that the notion that God is kind of holding reality together has to do with this continual manifestation of the logos of identity and of, let's say, things binding together towards their purposes. And so that is the way in which we could say that God sustains creation is through that very pattern. And so I think that that's the best way to understand it. So, Undying Nephilim. Nice name. Here's a question. Is there any positive use for AI or is it doomed to become some kind of modern idol? And so I think just like anything, there's positive uses. The problem is always hierarchy. The problem is always. You know, the difficulty with something like AI is that the amount of energy and effort it takes to bring it about makes it difficult for it not to kind of become a primary place for attention and doesn't kind of take up this. This central space. And so that's what makes it difficult to think that it won't end up becoming something like a. Something like an idol. So it's hard to know. And it's. Also, there's. Obviously, There are many AIs that are secondary and that are used for all kinds of reasons, which is totally fine if they're used as tools. It's mostly the very idea that AI is going to kind of solve our problems. It's going to solve our problems of meaning and a purpose. And, of course, the craziest ideas and the transhumanist idea that the AI is going to kind of transcend us and it's going to replace us in a certain manner. The fact that humans are even willing to go there and to posit such theories is pretty frightening. So Frederick Goferschmidt says, why does Jesus hold the sword in his left hand? So he's less likely to use it. That's funny. I mean, it depends. Usually we rarely show Christ holding a sword, by the way, sometimes you'll see in images of revelation, sometimes you'll see, like, a sword coming out of his mouth. And usually it is on the left side. And so if you have seen images of Christ holding a sword with his left hand, it has to do with the fact that the left hand, when Christ talks of the goat and the sheep, he says to the sheep, come clean closer. And to the goats, you know, move away. And so the sword is the one that separates. And so you can understand the left hand as being that which separates, and then the right hand is that which unifies. It kind of has this kind of, you know, this idea of coagulation and dissolution. I did it the opposite, though. Dissolution on the left hand and coagulation on the right hand. So. Yeah, exactly. So Undying Nephilim says, I've regretted my name choice for almost a Decade. That's hilarious, man. You know you are allowed to change your name online. That is something that can happen. But I get it. All right, so let's go into the. I'm gonna go into the questions now. So as people know, people who support me on Patreon for $10 or more get to ask questions in advance. And then people that in general on Patreon or on Facebook and the Facebook group can they follow this live and then this will be posted later. So those that come in live, they can ask questions in the chat as well. So that's a way for me to try to give as many possibilities to participate without the kind of craziness of being completely live, which is difficult to manage with all the people spamming and stuff. All right, so we'll start with questions that come from the website. So a riddle asks. At one of the small group meetings we talked about secrets and hiddenness versus disclosure. It reminded me of how people will cross their fingers behind their back when lying or make an oath they don't plan to keep. How should we think about the symbolic meaning of this actions? Would it be right to understand it simply as an inversion of the sign of the cross? No, I don't know if you could see it as the sign of the cross. I think that there's a few things going on with that sign. It's pretty primordial if you think about it. And so there are two things going on. One has to do with the. The fact that when you cross your fingers, you're not straight, you're crooked, your fingers are crooked and so you're hiding the fact that you're crooked. That is what's going on there. But then the other one, I think it also has to do with the X, the idea of crossing something out in order to remove it. If you have something you don't want, you cross it out like a name or something like that. If you put a cross on top of a name especially that's a pretty, I mean at least in the West, a pretty universal sign that it's you're. That you're eliminating it as a meaning making thing. So I think that that's probably what's going on there. If you know it's. It's definitely a very primordial gesture. So Mark asks, Greeting from Tbilisi says if you agree that theosis is the ultimate guiding star, does a theoretical understanding of symbology have any utility? And so, I mean, I think so. I think that just like anything, I mean you could ask that question about a Theoretical knowledge of. Of anything. Right? You could say. You could say something like, since the purpose of cooking is to eat good food, is a theoretical knowledge of recipes useful? And the answer is yes, of course. Not the purpose, it's not the goal, but it's something that can kind of help you along your way and kind of see things in the proper frame. So I think it's the same for studying theology in general. It's the same for reading the Bible. It's the same for having any theoretical knowledge that is related to the spiritual life. I think that for sure, symbolic understanding or at least symbolic perception can help you see the analogies and kind of give you that sense of wonder that can motivate you as well to take your spiritual life seriously. All right, and so Undying Nephilim wants to change his name to maybe Repentant Nephilim. That's awesome. You should do that. All right. So Jay Grubb says, could you comment on the symbolism of the compass point and how their associations flip between the northern and southern hemispheres, as do seasons. For instance, the north is associated with the cold, often with masculine, et cetera in the northern hemisphere, but in the southern, the association would seem to be the opposite. And so, yeah, I mean, I think that this is something. Now the thing you need to understand is that in the ancient world, the southern hemisphere was just not available. It was just. Was not accessible. You have to understand that, for example, or if it was, it was, very little was known about it. You know, it was very mysterious because in Africa, you would. First of all, you had the Sahara Desert, which separated Africa into two, really spaces, like two mass massive spaces. And so of course, there was some people. There probably were some people going down the. The coast of Africa to get different materials and slaves, but it was probably quite rarely. And then the news of that would make it back to. To the Levant or to, you know, to Europe or to other places with great difficulty and would come back kind of twisted with all these kind of legendary images, you know, of elephants and all these wild animals that they would see there. But I think that this image was actually captured mythologically in the idea that in the southern hemisphere, it's the Antipodes, and that people are upside down. And so of course, we can understand that. We find it funny now to think that people are upside down. But there really is a flip that happens, like you said, which is that when you cross the. When you cross the equator, the world flips upside down, and all of a sudden the seasons flip, you know, the orientation flips. And so I think that that's probably a kind of mythological capturing of some knowledge of how it worked when you would go down to the southern hemisphere, you know, and right becomes left, like we knew, seeing the Coriolis effect, like it flips to the other side. So, you know, I think that that's definitely something that that is going on. All right, so C. Streetle asks, if those who live by the sword are to die by the sword, can Christians serve in the military and law enforcement while strictly adhering to the teachings of Christ? Particularly if the state or political body has values at odds with the Christian values? What if the country fights a war of aggression or institutes a law that it enforced would violate Christian ethics? Do Christians in or considering these roles need to choose professions that are not as morally fraught roles that do not require violence to enforce the will of the state? How do we support the rule of law without being corrupted by the evils of our nations? And so, of course, this is a very difficult question. I think, for sure, Christians can serve in the military, but I think that in doing so, they obviously open themselves to certain dangers. I mean, everybody has certain dangers, but people who were in the military will open themselves to particular dangers. Of course, the idea of being in a position of expressing power, whether it's the police, whether it's someone who has a weapon and can apply their power on others, then these are the kinds of temptations that you will have. And so you have to be very careful to. Yeah, you have to be careful. And so when it comes to actually fighting in wars, at least in the Byzantine emperor, at least in the Orthodox tradition, there's a sense in which we understand that war is kind of an inevitable part of this world, and it is kind of a dark part of this world. And so this is usually represented by the fact that people who go to war have to go through some kind of purification. When they come back and want to commune, they have to confess. And I don't know exactly what it is, but they can't just go into church and take communion. They have to kind of go through a process of purgation. And so I think that that's an image of. It's an image of that, but for sure, I would say that on the positive side, there's an aspect of the military and the police which can manifest Christian virtues in terms of helping the weak, in terms of defending those that can't defend themselves. You know, in terms of serving, understanding what it means to serve in a hierarchy, you See that, you know, Christ talks about that when he talks to the Roman centurion. And he, you know, he actually. He actually says that the Roman centurion, because the Roman centurion understands Christ because he can see that he's in a chain of command, and that he can understand the way in which Christ can act in the world because he's in this chain of command. And he can kind of see it as analogous to the manner in which Christ can command the angels, you could say, in order to act. And so I think that that is also something which is probably useful. So. But you're right. And so I think that Christians are responsible in terms of unjust killing. They have a special responsibility to be careful of that. And you can see it in the story of the martyrs, where, for example, you would have Roman soldiers that are persecuting Christians and would kill Christians. Then suddenly one of the soldiers would see that this is unjust and would actually join the people getting killed and have this conversion and be killed with the martyrs, you know, and they would say that they were baptized in blood at that point. And so I think that there's also a call to be attentive to that. And if. And if your. Your country is doing things that are completely. That are completely wrong, then, yeah, you know, but I would hate to be in that situation because it's very difficult. All right, so in the chat, Frederick Goferschmidt asks, you once said that possibly Luther should have become a martyr for the Catholic Church. Are you saying it's wrong to leave your church if you believe they have lost their way? And so I think that. I think there's a difference, for example, between leaving a parish, like leaving a specific church, where there's some kind of breakdown, where there's, you know, evil pastor or priest, or there's, you know, these things happen. You know, they can definitely happen. You have abusive priests or you have dishonest, corrupt people in the hierarchy. And so I think there's a difference between that and, let's say, leaving the church altogether. And I think that that's the problem that happened with Martin Luther is that not only that he left his church, not only that he left the Catholic Church, but that he, in a way, started his own church and took upon himself the power to name priests and to kind of recreate a church on the side. And so I think that in doing so, he basically inaugurated fragmentation of the. Of the West. So that's what I think. But I do think that if you're in a church that is completely off the rails, and that is wrong or that is. Is bad. I think you should leave it. Definitely. So don't charge your. Don't start your own church, though. Just don't do that. And it's messier now. It's messier now because at the time of Luther, there was just one option. It was like there was just one church. And there. There are a few little heretical sects that would appear here and there. But now it's messier because there's like, you know, there's a million churches with a million denominations, which is an image of the problem itself and a breakdown. So. Yeah. All right, and so logos 85, back to the website. What is the symbolic significance of the ancient feminine goddess statue such as the. The Venus of Willendorf and the Sheila Neg? How do you respond to those who view the prime world of religion as primarily feminine based on artifacts such as these? And how does the Theodokos fit into this tradition? All right, let me say this. No one knows what those statuettes are. No one knows what they're about. They are an image of a lost memory. They are an image of a. Of something which is so completely cut off from us that it manifests itself as a total alien and becomes the space of every projection that you can imagine. That's the problem of losing memory. It's a problem of cutting the line. Cutting the line of memory, of tradition that binds you to the past. So people go and dig into the ground and find these dead bodies. These are dead things. And then they raise them up. It's a form of necromancy. And then they try to blow spirit back into it. And what they end up doing, it's always super subversive. It's always exactly what you said. It's like, oh, here's the primordial religion. It's what I want it to be. It's these feminine goddesses. You know, it's like, okay, dude, you have no idea what those statuettes are for. Let's. Let's. Let's speculate just for fun, you know, it's like, why do you think that those statuettes were. Were goddesses? Why don't you think that those statuettes were apotropaic? That is, maybe they were. Maybe they were gargoyles. Maybe they were magic monsters. And that's why they're so huge and fat and weird. And they were just these, like, these monsters that people used to protect themselves from demons. I mean, not saying that's what it is. I'm saying there's no more reason to think that these were apotropaic than to think that they were goddesses that people worshiped or to think that they were dolls that kids played with or to think anything. Like, who knows? Like, they have no idea. They find these dead things. And so apply this now to all the things people are always saying. You see the same, like people finding things on Minos. You know, they found these, like, snake goddesses. They don't know what they are. They find these women holding snakes. All right, okay. You have no idea. There's no tradition, there's no link. And so you'll see it like archaeologists are necromancers, like, constantly. And what happens with the necromancy is that they just project their fantasies. And so these types of statues have been used to kind of undermine Christianity. And, oh, take a question of what really was the primordial religion. Maybe it was this, this feminine goddess. You know, it's like, it's all. You have to see that. It's all narrative twist and it's all this. It really is a kind of magic trick that, that the necromancer is playing on you. It's like reviving these dead bodies with his own spirit and making it speak like a. Like a marionette, you know, to speak their own philosophy and their own ideas. So, yeah, don't get swayed by these archaeologists. They have no idea what they're talking about. Like, especially. I'm not saying if you find something that's related to a civilization that we have connection with, that there's a tradition, that there's a line that we have some memory of, but when you find something that's 30,000 years old in the ground. Yeah. Might as well be looking at aliens like you might as well be looking at, and you don't know what it is. All right, sorry. I have no. Like, I'm just not impressed by these things. All right. So Cormac Jones says in the life of St Martin of Tours, there's a story about a holy place where people gather to worship that St. Martin feels unsure about due to the vagueness of its history. Abstains from worshiping there, but doesn't forbid others to. Until, that is, one day he goes there and has a vision that the martyrs relics upon which it's built are actually those of a wretched thief. And the whole spiritual foundation of the place is a delusion and a lie. My question is, how likely do you think it is for false symbolic hierarchies to survive in practice when There isn't a Saint Martin around to expose them. What is their value to the people who participate in them. Said differently, how faulty can the test of time be and how much should we worry about it? So I think you shouldn't worry about it, but I think what it does, this story is particularly important is it shows you the difference between something like organizational hierarchy, which is important, let's say, the way in which the tradition kind of sets itself up with priests and bishops and buildings and, you know, and fittings and all this kind of stuff that manifests the exterior aspect of the hierarchy. But then the true hierarchy is a spiritual hierarchy. The true hierarchy is a hierarchy of saint. And this story shows us that it is ultimately the saint which is the root of the Christian tradition, and that the saint, if he shows himself to be a saint and he's recognized as having spiritual authority. Yeah. Can do things like that, can, let's say, see under the appearances and find the. The, like the corrupt worms and kind of pull them out. And so I think that that's what that. That story is about. There are other types of. Other versions of this type of story where saints are able to expose the hypocrisy and the lies that are in the external hierarchy. You see it in the story of Christ himself. Now, of course, we can't go too far and decide that because of that, the exterior kind of hierarchy of the church and its outer structures, that they're useless, that we should get rid of them and everything. Yeah. So. All right, so Joel G. Caesar says, do you have any thoughts on the conversation between Bret Weinstein and Bishop Barron? And so you're lucky that I listened to that. I listened to that yesterday, by the way. I'm supposed to talk to Brett Weinstein tomorrow. And so I really. Tomorrow morning I have to get up early and listen to our. To our podcast again so I can kind of go over to what we talked about. I thought it was interesting. I thought that it had similar issues that I felt I had with Brett as well, which is always the problem of postulating a moral order and not being able to know where it comes from. And so. But one thing that happened in the discussion with Bishop Barron is I think that to a certain extent, Heather and him. Is that her name? I think so. Sorry if that's not her name. That they. That they acknowledge that science doesn't have that answer. That basically has to come from somewhere else. And. And that as scientists, they're maybe not the ones to be able to say where that comes from. And so I kind of got a little bit of that sense. So that's interesting. It's interesting. But he's also kind of saying that I can't really think about this stuff. Like, I don't. It's not part of my. Part of my worldview. But at the same time, he's, he's gesturing to it. So it's a little bit of an issue, I think. So I'm. Let's see. Let's see how it goes tomorrow. I'm a little worried because I felt like our last conversation lasted three hours, and I didn't feel like we. We got very far. But let's see. We'll see. All right. So, Wedge. Young man asks, in a recent discussion between Jordan Pearson, Roger Penrose, the possibility of a cyclical universe was suggested. Do you think this theory is compatible with Christianity? A universe with no beginning or end? So it's very simple, guys. The beginning is not in the universe. The end is not in the universe. It's as simple as that. So you will never find the beginning of the universe in the universe, and you'll never find the end of the universe in the universe, just like you won't find the beginning of. Of anything in the thing itself. Right? The. The origin of something is not in the thing. I don't know what to say. And so it's like, that's why they'll never get to the Big Bang or whatever. That's why they'll never be able. That's why they'll come up with theories like this. That's why they'll have asymptotic, you know, definitions of time where, where time, you know, slows or time kind of moves and then doesn't reach the beginning and becomes like this asymptotal formula where it never reaches the beginning. So because you can't have the reason and the origin of the system inside the system, it's like that for everything. It's something that every level of reality, and it's ultimately like that for the whole thing. So. So, yeah, whatever. That's fine. Like, if you want to posit that, that's fine. But it doesn't mean that there's no beginning is no end, just mean that it's not inside, it's not in. It's a. It's. You could say it's something like an infinite beginning and an infinite end, you know, if you want to. If you want to say it that way. So. So, yeah, so I'm not impressed by these kinds of. These kinds of. These Kinds of arguments, especially. I'm not impressed by them. If people think that by making these arguments that they are somehow disproving, you know, the idea that universe has an origin, it's like. No, you're not disproving anything. That's what an origin is. Sorry, I'm a little. I mean, I need to calm down. All right. So Pneumaesh asked, the statue of Nebuchadnezzar's dream starts with the most precious metal at the top and goes down to lesser metals. Why is Babylon represented with the most precious metal? The other empires with the lesser, especially since Babylonian civilization has ceased to exist, whereas Persian and Greek and arguably Rome cultures still exist not though not as they used to. And so the important part of that has to do. So the idea of lesser metals is you have to be careful that it's not just about lesser. It is also about there's a relationship of precious, let's say, and malleable. And then there's a relationship between that and the lesser metals, which are less precious, but are also harder and are stronger. And so it's not just a simple positive to negative thing. So as you move down the hierarchy that gold is the most precious metal it offers, but is also soft. It's malleable. It doesn't. It's not hardened yet. And as you, as you move down, then, then the, the lower metals are. Are less pure, less. Let's say less precious. But then they're less rare as well. They're more common, they're bigger. Think about that. They're bigger and they also are more stronger. But then ultimately they're also in a way more fragile. And so that's. So the idea that, for example, the Roman Empire would kind of splinter and then create all these nations in Europe and that are. That are kind of independent. I don't see why that's an issue for you. Like, I don't see why that's a problem. The idea that, that Rome would kind of splinter into like multiple states just like it. Just like in the image of this statue with like the. The toes that are made of alloy that are. That are made of a mix of iron and clay. I think that, that you can understand that. So it's not. Yeah, it's not just like a simple positive to negative. So, yeah, that's the way that I see it. And so. And so it also has to do with time. Like, it's. Babylon is in a way, the first empire. You could say that it's kind of like the first memory that we have, you know, sometimes, you know, sometimes people make fun of the fact that in scripture there's, you know, we talk about that the Bible has that the earth is 7,000 years old. But it's like that number isn't totally arbitrary because our memory is about 7,000 years old. It's like after around 7,000 years old, we are not connected to whatever was there, like whatever civilization you can find before that. We just don't have any connection to it. It's like I said, it's like these little stupid statuettes that they find in the ground and that no one knows what they're for. But we do have a memory of Babylon. Babylon is part of the thread which leads us to today. But it's, it is in a way that first one, especially in terms of, in terms of like Jewish and Christian tradition. So, all right, and so let's see. Gideon Yu asks, says Christ is risen. Indeed he is risen. Greeting Jonathan from the materialist worldview. Prominent theory. A prominent theory of where our moon came from is a large space rock colliding with the Earth when it was still molten rock and knocking off a large part which then began to orbit the Earth and became the moon. On the other side of the materialist spectrum, you have the ancient alien type theory of how the moon is actually a giant spaceship in which the aliens came to our solar system. What symbolism do you see? In one theory, seeing meaning to state that the moon is just another piece of Earth and not that special, while the other theory treats it as something entirely foreign. It claims it would prove how humans owe all their intelligent technology to aliens if the lizard people would stop covering up the truth. Just weird questions, man. So, all right, I'm gonna try to find a nugget in that weird question because. So, all right, so the idea that the moon is like. The idea that the moon is like the feminine of the sun, right? That the moon is like a mirror, that it reflects the light of the sun, means that it is the second. It's the, you know, it's the, the second ruler of the sky. It's not the first one. It's the one that rules at night. And not only that, but it's also, let's say, the thing in the heavens that covers itself in darkness and covers itself it light. And so it moves from light to darkness. So it wanes between identity and non identity. And so, so you could see your little. The way you frame it is a good way to, to, to kind of frame it in a, In a kind of weird Modern way, which is that. Right. So on the one hand, it is. It is us and it reflect. It reflects. And on the other hand, it's dark. And it actually is an image of chaos and potential and. And strangeness. And so, sure, why not? You know, and so. So that might help you understand, at least understand why those two theories are there. But I'm sure that the one about the alien spaceship is a pretty marginal theory. I just. I just. I'm pretty sure about that. Maybe that's why it's dealing with aliens, too. All right, let's see if we have a question. So I'm going to move towards the Patreon questions. Let's see if there's a question in the chat that I can answer. Okay. What would be the connection with the blood and water that came from Christ's side and the conversion of the centurion? Would he have understood the Hebrew symbolism of the blood and the water? I don't know. I think that for sure, in terms of the. The centurion, there was like, a lot of stuff going on that I think made him realize what was happening. I think that part of it was probably the darkness as well, you know, that the darkness came while Christ was dying. And, you know, and it's. It's not super clear like, what that means, that there's water and blood that came out and, you know, I mean, what it looked like. So I don't know. I don't. You're right. I. I never thought about that before. Like the blood and the water and the centurion, why it is that. That would be the thing that made him understand. All right, Patreon Alexander says, I recently have become more fascinated by the crisis and collapse of the Roman Republic and the rise of the empire. Caesar's crossing. The Rubicon seems to be a true symbolism happens moment in history. In Lucan's epic poem Pharsalia, Caesar encountered the spirit of Rome as a goddess or bride in distress. When he reaches the river. Do you know of any biblical parallels to this or do you have any thoughts on how this story might fit into the Christian story? Thank you so much. I never thought about that. Well, for sure. I mean, for sure. The crossing of the river, you know, that really is a symbolism happens moment. And so you have to understand that crossing the river is just crossing identities and so crossing. So the Rubicon was the symbolic limit of the Roman territory, and the army wasn't allowed to cross the river in order to enter into Rome. And so for sure, crossing the river was manifesting Change and was kind of manifesting a, you know, it's like, if you want to understand a biblical symbolism of that, you can understand that like when Israel crossed the Jordan to take over Jericho, you know, that's similar to what Caesar was doing here is crossing the river to kind of conquer the land and so to kind of enter as, as a new leader. So that, that's what you see when the Israelites cross the, the Jordan. And you can also see a similar image when Constantine wins the battle on the bridge, you know, you know, it is an image of the crossing of the waters. You can understand it also as, as the flood, you know, and as Israel leaving Egypt and crossing the Red Sea. So like this crossing of the water is a marking of transition. But for sure, the story of, of Israel and, and Jericho is the best one in terms of, in terms of that. So. All right, so Drew McMahon asks. Hi, Jonathan. You've talked before about how laughing is a form of losing control. Is crying, weeping also a form of losing control? Or is it different? In scripture, Jesus cries. So I imagine it's fundamentally different. Thank you. So I think that crying is, it's funny because it is kind of interesting to think about the difference. Crying is definitely. It has to do with compassion. And so in a way it is a losing control, but it's not the same, especially crying out of compassion. It has to do with, let's say, something letting something from the outside affecting you when there's a manner in which you can have a cold heart. Right. You see that in scripture when the Pharaoh, for example, refuses to let the Israelites go, it says that God hardened his heart. And so you can have a hard heart and you can stop yourself from experiencing compassion. Whereas I think that in terms of crying, that that's different. You know, it's a good thing to think about. I probably need to meditate on it more in order to kind of understand it better. All right, so Hunter Newborn, so Davis, Florida asked in my question, make it. I don't know. I haven't been through all the questions. I think it's important to understand that there's a lot of questions at the outset, like 70 something questions, and I really reasonably can't answer more than 50. So it is possible that some of your questions don't make it so. Sorry about that. If, if that's the case, Hunter Newborn asks, hey, Jonathan, why does participation have to be in the church as we understand the church? Why can living through Christ in the world and in society not be the participatory context of praise. Do we not take communion when we eat the flesh and drink the wine? In life, not only in the church. Is the body of Christ not the people and the church? The people and the church, not then the world which we constitute. Can the cosmic mystery only give a hint of itself through participation in the church in the strict sense? I have not been to church since a teenager, now 24, but have only ever felt a glimpse of the mystery and of Christ living in and around me when outside the church. And he says, if you destroy my confidence in this position, I may find myself forced to go to church. So I'll try very hard to do so. No, it's simple. It's a hierarchy. You have to understand it as a hierarchy. And so you're right that there's a manner in which, let's say, the body of Christ or that the kind of. That the body of God fills up all of reality and we participate in that. And there are, like you said, glimpses, there are. There are signs, there are, you know, intimations of that in everything we do. And it is possible to a certain extent to find, you know, God hiding behind all phenomena and behind all interactions. But I think that for sure, the. The church that Christ instituted is in a certain manner, the culmination of that. And so it is a deliberate body of communion in love, and it is a deliberate body of celebration of the highest mystery and of participation, ritual participation in that mystery. Although I think you're right that, you know, you can have these intimations all over, I do think that to participate in a body, to stand next to people and to celebrate the same thing and to participate in the same mystery is, in a certain manner, is ultimately the kind of thing that holds the world together because it is attentive to the highest. And so if you participate in a sports team or in some smaller version of a group, you know, you can have these kind of intimations and kind of feel connected. But, yeah, ultimately things have to be aligned towards the highest good. I think so. Hope that helps. So, Champ Jans or Yance. Hi, Jonathan. Do you think the ancient and symbolic worldview you've been trying to convey to us is generally universal? Before the Enlightenment, scientific revolution, modernity. I ask this because I'm going to study great texts in college, and I would love to know if I can apply Matthews, the Language of creation and your symbolic insight to all other ancient texts. Some examples being Homer, Thucydides, Greek plays and other ancient poetry. Another ancient text, for sure. Definitely no No, I think that the analogical approach is the one that would have been pretty universal, I think, in all cultures. And so I think that it was maybe more implicit sometimes in the ancient text, because they would just imbibe it and live it. And so one of the advantages of our moment is that it's less. We have more difficult participating in it because we're a little alienated from the most participative aspect of symbolic living. But because of that, we actually are capable of explicitly understanding it more. And so it's a trade off. And it's a. And it's interesting because it's a trade off that I remember Matthew, my brother, talk about a long time ago where he was like, he was saying, if we kind of explicitly study symbolism, you know, what are we doing? Like, are we helping or are we making it worse? You know, And I guess we came to the conclusion that it was best to go this way. But that's a real question, right? So I think you're right. No, I think you can definitely. And I think you might, if you're able to really imbibe the right analytical thinking, I think that you might have some insights that a lot of people aren't able to have, you know, so that sort of thing. So Garrett Widner says hello. Jonathan, I was hoping you could shed some light on thorns as a barrier. Is this a thing? If so, is there such a thing as ascending past the barrier of thorns? Finally, do thorns have a different function based on where you stand in relation to them? Looking forward to more God's dog? Yeah, I mean, I'm not sure I understand what you mean. So, of course the thorns are a barrier. You can see it in scripture, the idea that God makes these thorns grow. But you can understand it, like, for example, like a great example of that. You see it in the Disney movie of Sleeping Beauty, where the thorns grow around the castle and become like this, like, protective, you know, structure around it, and that the prince has to come, and the prince has to come in order to be able to be let in to the thorns. And so if you look at my image of everything, you'll see that that's how I did it. I put the thorns as a band around, let's say, the. The garden as a kind of barrier. And so, you know, barbed wire is exactly that, by the way. That's what barbed wire is. And so, yeah, yes, ascending past the bearer of thorns would be a very good, let's say, story trope if you were going to use it. Mason asked, hey, Jonathan, is heaven in your brother's book and in your own work akin to Plato's realm of the forms? If not, how is it different? So it's definitely similar. I think the problem, the problem with Plato's realm of the forms is that it's more intelligences that are coming down from heaven. It's not forms. I don't think it's forms in the same way that he talked about it. It's more like active intelligences that are intelligent patterns that are causal. So that's why I think that the hierarchy of the gods, you know, this idea of a hierarchy of gods or a hierarchy of principalities is closer to how reality works than just the idea of forms. And also the duality of, like, just forms and, and let's say shadows or manifestations of those forms, I think is also a little simplistic in terms of understanding how it works. And if you understand it as a hierarchy of intelligent patterns, then you can understand how the patterns, lower patterns, embed themselves fractally in higher patterns. And so they kind of all fit into each other. And so that makes it. I think that that's a better. That's a better understanding. And so this is going to be a little technical, but so you could understand that as at a higher level, the forms that exist, the patterns that exist below, are indefinite. There's an indefinite amount of them. And so, and. But they all. They all fit inside the higher pattern. And. And they're held by the higher pattern. So it means that you don't have the problem of thinking, like, do the form of this or that exist? Like, does the form of these or that little details of reality exist because they exist by being held. They. They have lower and lower existence, let's say, by being held by higher and higher patterns. So a simple example would be like, you have a pattern of dog, let's say, and so how many species of dogs exist? And the answer is an indefinite amount of species of dogs. There's an indefinite amount, and there could be more, who knows? And there's also an indefinite amount of ways in which you could actually cut into the speciation of dogs in a certain manner that isn't arbitrary, but it doesn't totally matter because all the species of dog are contained in dog. And then you can keep going up and that dog and other animals are contained in higher categories. So there's an indefinite amount of them. And the way you could cut them up, it's not totally arbitrary, like I said, but you could cut them up in this way or that way, but it wouldn't matter because they're held up higher. And so you just keep going like that until you reach, you know, the divine Logos itself. And we realize that the divine Logos is hiding behind all hierarchies of being in all category structures. So I think that that's a better way to. To understand it and one which leads to less problems, at least, I think at least less problems. So hopefully that's helpful. All right. So Ethan B. Asks, regarding the symbolism of flowers in the last Q and A, I was wondering, is there a connection to what you had said earlier in the same Q and A about the highest form of sexuality being abstinence and submission to something greater than itself? A flower could be considered the apex of the plant's expression before sexual union. Is the offering of the flowers symbolic of that higher form of abstinence? I have to think about it. I'm not sure I totally see where the question is going. I mean, like, offering. I don't remember what it was that I talked about in the last Q and A about flowers. Is it about like, offering flowers to someone you love or something like that? Sorry, man. I feel like I'm going to let you down on this question. All right. So White Lawrence asks, in terms of participation, can you talk about the difference between music, video movies, video games, and painting? Video games seem to be more active and participatory than watching a movie, listening to music, or going to an art museum. However, I don't think that's necessarily means video games are superior form of art. Any thoughts? And so, yeah, video games are definitely participatory. And I think that video games are interesting, like, because they. They do end up strangely embodying like a symbolic structure, really, actually quite clearly, because usually especially like in a. Because in. In video games, there's always like a goal and then there's a frame which is like the level or the. You know, the. Or like the world itself has. Needs to have a limit because it's. It has to be bound. And. And then there's ways in which to reach higher levels. And so there's these hierarchies of levels that you attain. And so there's something. If you watch my video on Donkey Kong, I talk about that a little bit. And so it's definitely quite participative. Yeah, I think that there's something also that's kind of low about video games, and I'm not sure how that is. It seems like video games will always kind of remain in this more popular sphere. But maybe that sometimes is actually the place where more mysteries are hidden. Sometimes. You know, I always can joke, but it's like there's the reason why Dante wrote in. In Italian and Latin, and there's a reason why the Gospels are written in koine Greek instead of, like a more literary form. So, yeah, let's see if we got some questions in the chat that I want to answer. So you good to. Good. You good to get. You said that Christ said yes to God telling Adam if he ate the fruit of the tree, he would die. Was man always meant to die and resurrect? Did taking the fruit improperly make death bitter? So this is something that I've tried to explain, but it's like, I always feel like I'm on really dangerous ground when I'm talking about this, because what I'm trying to often hint at is that death and glory are like the same thing. They're made of the same stuff. It's just that one is the breakdown of the person and the other is like the ecstatic giving or the ecstatic overflowing of the person. Both of them seem to be made of the same stuff. And so the idea is that Christ restores glory through his death, you know, but that's. It's just when I say it, I'm like, I know people won't understand what I'm saying. It's very difficult to talk about that particularly. So hopefully people are kind of understanding what I'm saying. But we're. Yeah. All right. So Bob Briggs asked if in Father Stephen Freeman's book Everywhere President, he talks about the similar patterns between the version of the Theophany icon with Christ standing on two boards in the Jordan and the Anastasis icon. Yeah. Would you speak about this similarity in more detail? This has been a revelation for me, seeing St John the foreigner in the same position in both icons and what you and Lord of Spirits has taught me about the water being the abyss and. Or chaos. Yeah. So for those who don't know. So in the image of the Anastasis, which is the image of the harrowing of Hell, which is Christ going down into hell, he usually is standing on the doors of hell that are. That are broken. And. And sometimes the doors of hell are like in a cross. He's kind of standing on this cross. Not always, but often that's what it is. And so in the image of the Theophany icon, which is the image of baptism, you will also see Christ. Not always, but often. You'll see him standing on Similar pieces of wood that are below. And sometimes you'll see like, snakes kind of coming out from the side or snakes under the door, let's say. And so this, of course, really does have to do with the fact that to help us understand what baptism is, that it is a descent into death, into chaos, and that there is a relationship, definite relationship between Christ descending into Hades and you descending into. To death. Right. And so it's like we die with Christ and we're. When we're being baptized, we kind of descend into death. And you find it in the image, in the prayers that are told when someone is baptized in the Orthodox Church, you will find all these prayers which talk about, you know, the dragons that are in the water and is just like chasing away of the dragons and the. To the monsters that are in the deep. And that is what is happening. And so, yeah, they're definitely trying to help you understand the connection between baptism, theophany and between. Between the resurrection and the. The descendant. The 80s. All right, so Silas Allen ask, so how do you explain the difference of Christian theosis versus the noose versus other spiritual practices of opening the third eye? And so I think it's not. I think that they're not completely different from each other, at least in terms of. It doesn't express itself exactly in the same way. But you'll find in the Philokalia, in the text, the mystical text of the Eastern Church, you'll find the idea, it doesn't express itself as a third eye, like in the forehead, but it expresses itself as the eye of the heart. So it's not exactly the same, but it's similar in the sense that it's the idea of like a central heart, right? A heart in the middle which joins the two visions together. And so that's what I think the third eye is often referred to. It has to do with reaching an insight which joins opposites together in unity. You know, and so you could have a fractal experience of that where it's like you have these. You have two. Two things, and you're able to kind of see how they connect. You know, symbolism is something that. That is part of that. And so you have a little mini experience of insight. And that insight appears as the place where opposites join and become one. And I think that that's what the fathers mean when they talk about the eye of the heart, which is also this, like, central heart, but in a certain manner. In terms of Christianity, it's not just a. It's not just a mental exercise. Right. It's not just a. I mean, although I'm not suggesting that it's not just about knowledge in the most immediate sense. It really is also about, you know, concentration and embodiment, you know, and so maybe that's the difference, but it's definitely not, it's not completely unrelated. All right, so Dorothea says the pattern of losing your garments of skin, water, and ascending into heaven fascinates me. You mentioned biblical examples of the Rapture, but for us Christians, that should also be our baptism, I guess. And what about the story of St. Francis, gives up his clothes and goes naked into the world? I think in some stories the bishop covers him with his cloak, rises into the air as he receives the stigmata, and then on the same day by his sword, water sprang out of a stone. I never heard that story. And so, yeah, for sure. There's definitely a relationship with, I mean, baptism is something like that. You know, you, you, you Christ, especially the Christ baptism, Christ goes into the water and yours too, right? Because if you're Chris made it, especially in the Orthodox church, you're Chris made it on the same day. And so you, you go down the water, you come out, and then you receive the anointing from above. You receive the spirit which comes from above, the light which comes from above. And so it's like this joining of, you know, above and below, it's not exactly an ascension. And so, all right, Kevin Patterson says we use techne as garments of skin, but we receive techne from patterns above. So are the heavenly patterns using us as their body when they, when we wield techne also who creates those patterns? So you need to watch my, you definitely need to watch my talk on the Book of Enoch. You know, that's what it's kind of dealing with. And so, yes, you could understand it, you could understand to a certain extent that, that we, it's possible that we are participating in the bodies of these patterns, these higher patterns, when we are involved in technology. So we are technology, because it is an increase of power, can definitely be a kind of embodying of these patterns because it increases their power in the world. So let's find a simple example that is clear because let's say it's negative. And so, for example, you would have a pattern, a euphoric pattern, a pattern of euphoria pattern which is the capacity for humans to kind of move into a dizzy type of consciousness or a, lose some aspect of their consciousness. And so people develop wine as a, as a, related to a garment of skin. You Know, we have to remember that wine comes right after the flood. It's like it's related to that as well. And so, but then using technology, the past, or the pattern of euphoria, the pattern of drunkenness or whatever, that pattern wants to increase itself, wants to increase its body. And so we develop more potent forms of alcohol. We start to develop other types of things, and then we end with like cocaine or whatever. And so that's an example where you can see like a heavenly pattern which is using us to embody itself and to gain power through our attention and its capacity to kind of gather our attention. So you can understand that for a lot of, of. Of technologies. Hope that makes sense. All right, so Max Blaze asks. Hi, Jonathan. To discuss the difference between spiritual reality and say, pagan deity is Zeus, Thor, etc, and narrative characters like Captain America. Is this a qualitative difference or just one of scale and power of the spirits involved? And what does a narrative reality break? What point does a narrative reality break into the world? So there's definitely a difference between fictional characters and the, and the gods. They're not completely unrelated. But let's say Captain America doesn't have a. Let's say the body of Captain America is in the comic books and the movies and all of that stuff. And to a certain extent in the fans. He does find some kind of embodiment in the fans, but. But it's very limited. You know, I don't think Captain America has the capacity to change things or maybe a little bit, but very little in the world compared to the ancient gods. So the ancient gods were the patterns that manage entire aspects of society. And so they would have effective power and control over those aspects. People would worship them, people would sacrifice to them, you know. You know, people would. It's a name, their children, their, you know, their things in relation to that things would be dedicated. So it's not that there isn't a little bit of that of Captain America. I mean, people buy stuff with Captain America on it, but it's very limited. It doesn't become a. It's not a principality that. That actually manages. So I tend to sometimes think that seems like those little small, like kind of fictional characters that they. They become probably embodiments of higher patterns. You know, sometimes they're like aspects of Christ, you know, sometimes they're aspect of lower. Lower patterns, you know, like virtues and different lower patterns. So that's the way that I see that. Hope that makes sense. Sometimes when I say these things, I'm like, people are gonna Think I'm spewing total nonsense. All right, Anton Olanderson says, let's see if maybe there's a question here in the chat as well. So, Brandon Burns as How do we know Christ in our lifetime? Presumably thousands saw his miracles in person and didn't know him. Some disciples didn't recognize him after the resurrection, etc. I mean, you know him the way that Christ's. You know that the Christ in the scripture says that you know Him. You have to know him in the little ones. You know, you have to recognize him in the little ones. You have to discern his body in the Eucharist. And then ultimately you have to kind of see him as the source of all things and so see him hidden in all aspects of reality, you know, but in the. The faces of those that you love and that love you, that's where you mostly encounter Christ. And also to a certain extent, I think in, in relationship to authority, to a certain extent, which, which is that what we receive from above is an image of what we receive from higher up. Even so I think that those are the three places from. Well, not three, but let's say in the littlest ones, like hidden. The idea of seeing Christ in the littlest ones is an image of being able to see him in all things and hidden in the poor, hidden in those that are afflicted. That's the true test of a Christian, you could say. Yeah. And then any other places, I said, hopefully that makes sense. Anton Olenderson says, hi Jonathan, hope you're well. To me, there are two major patterns in the world today. It's the pattern of increasing control, I. E. The coming of the beast system. Then there's also the increasing popularity of paganism you age, which is vaguely uniting many spiritual beliefs in their worship and in their drug induced ceremonies. Do you think that those two patterns will ever unite? Will the ever ride the beast in that way? For example, I find that a lot of Ayahuasca promoters are also promoting crypto. Sorry if the question is vague, but I'd love to hear your thoughts. So I understand what you're saying. I think you're right. I think that there are these two patterns, you know the pattern. The second one is not just paganism and New Age, but it's just like fragmentation in general and the breakdown of narratives into multiple narratives, the breakdown of cults into many different gods and different things that are being served and worshiped and followed. And so you have on the one hand an image of absolute control and total authority and on the other hand, you have an image of kind of anarchic breakdown and anarchic influences. So I think that those two things are in a certain way, the whore riding the beast, that's already what it is because they both give each other legitimacy. You know, they give each other. It's a possibility. You. And so as the. It say, as the becomes stronger and stronger, then there's a need for the beast to be more powerful. So it's like as the anarchy grows and as people are idiosyncratic, then you need the methods of control to be stronger because it's like the system's not going to hold. You can't, like, you know, a is not a sustainable society, you could say. And so you need these. You need to kind of add control constantly in order to keep it holding together. So, yeah, so anyway, so that's, that's what I think. But, you know, in, in the Revelation says that at some point the beast kills the. You know, so seems like that's definitely what happened at the end of Weimar. And it's like, I'm not sure how it's going to play out because I'm really surprised, like you said, to notice that the very image, like the very, let's say, pattern of the horror is becoming authoritarian in itself. Right? This kind of weird imposition of idiosyncrasy. So I don't know, like, how far that can go. It's definitely, in a way, it's a little surprising to me, but yeah. All right, so. So Garcia says, how can we throw the ring back into Mordor? Other stories may magically seal or bind a technology evil being, but there is always potential for some. Someone to take it or release it. Guardians of the galaxy lock the stone away, only for Thanos to take it. But in Lord of the Rings, the ring is destroyed. Can you take away from these stories? So I think the image of the ring being destroyed is fine. I think it's okay. But I think that it's not the most Christian story. I think that the most Christian story is that the ring is transformed, you know, and that technology is ultimately transmuted into something which serves the highest good. So I think that that's actually, that's actually the image of the heavenly Jerusalem, which is, I think, the right image. But I don't know how that happens because it's just at this point, like, are you really going to throw the ring into the fire? Like, what does that. How would that even be possible? It's like the ring is basically a giant you know, network of satellites. It's like, it's so, it's so big, the ring is so huge and it's so encompassing that. Yeah, I don't see how you're gonna get. How you're gonna throw it in the fire. All right, so Mary Heather Howerton says. Hi, Jonathan. What is the symbolism of wind? I keep noticing it when I read the Old Testament, so I was curious. Thank you. So the wind, there's different types of wind, but you could understand it in general, the wind as just the invisible acting on the visible. That's the way to pretty much understand wind. And so you can see it like the, the wind of God that reveals dry land when the Red Sea is being separated. So that wind of God is very similar to the, let's say the, the spirit of God which blows on the water at the beginning of the, of Scripture and that ultimately participates in bringing up the, the. The earth. And so it's like it is this invisible action on, on potential. But the wind can also be something like patterns that don't find body. So sometimes it can have a negative aspect. You see that especially in the book of, of Kohelet, in the book of Ecclesiastes where it says, you know, everything is, is vanity of vanities. Everything is breath of breath. Right? It's chasing after wind, chasing after breath. And so this idea of these, of these, these flighty patterns that can't actually find body and just, you know, and so you can understand that as that's also a possibility for, for wind. So it depends on the context. But I think in general it has to do with. Of something that the invisible acting on the visible somehow. All right, so. Ll asks, I am new to the symbolic interpretation of the Bible and trying to get an understanding of how it's a description of, of the structure of reality. I don't want to misunderstand important things. I wonder if the theory of relativity and other laws of nature would be considered the word of God, since it's also a kind of description of the structure of reality. Are the laws of nature like the stories in the Bible, but in a different format. So maybe, I don't know, it's, you know, you know, the way that I. So I don't think that these laws, these laws of, of nature, the way that people think about it today, I don't think that these are, let's say, primary in terms of laws. People are going to find me weird to say that. I think that the, the, the structure of your experience is far more primary. And close to the word of God than the description of these like. Like super abstract physical laws. Because those super abstract physical laws, they are seen through the. The frame of your experience. So that's why the way to, kind of the way to understand symbolism is usually to stay or come closer to this embodied experience that you have and that the abstractions, they're not. There's nothing wrong with something like the theory of relativity. It's fine, it's helpful to make. To do certain things and to understand certain things, but it is. It is a lesser truth in the sense that it's less. It's. It's less important to you to know, right? So it's like, let's say. Let's say the law that. That if you fall, if you hit your head on a rock, like if you fall down and you crack your head open, you'll die, is more important than the law of that of relativity, than the. The theory of relativity. Does that make sense? Oh, that makes sense. All right. So Keenan Wang says, could you talk about the symbolism of envy? It seems almost like a second sin in Genesis after pride. Cain and Satan are both thought of as envious. Yes. And so. Yes, definitely. You know, definitely. So envy is related to pride in the sense that envy is thinking that you are owed something that. That what you do not have, you should have. And so it is definitely related to pride. So Cain thinks that he should have this or that blessing from God. He thinks that he's kind of owed that, but he isn't. And so that's what happens. And so you can understand the same. Similar in terms of Satan or the, the, you know, the evil one or the, the contenders that, you know, he thinks that he is owed something and that. That it belongs to him. Yeah. So that's the way that I would explain that. So, mid. Mid Ali Jonathan, what are your thoughts on Islam? My goodness, are Muslims Antichrist according to orthodoxy? And is the religion itself a heresy? So I think that the traditional position has always been that Islam is a heresy. You know, that's all I can say. So Russ Fro says, what is the symbolism of kissing? So, I mean, it has to do with expression. I mean, so when you speak, so what, your mouth is two things. It's like, it's where you. You, let's say, bring things inside you, but also how you kind of express. And so I don't think it's that surprising, you know, that we would have developed something like kissing. And so it's like I put my mouth on something to Signify my attention to it, my care for it. Yeah, you know, that's as close as I'm going to get with that. But it's probably very, very primordial. It's probably one of the most primordial images. Wish I had more insight on it right now. Well, I'll be thinking about it, that's for sure. So Christian cly says, Christ risen. Indeed he is risen. All the disciples followed Christ to the cross. Of the disciples, St. John is the only one who isn't martyred. In doing so, does him being the only one actually to actually follow Christ to the cross bear any significance here? Huh? That's a super interesting man. That is a super interesting idea. I never thought about that. I never thought about that. That the fact that. Because St. John. Well, wasn't he. How did he die? Wasn't he. So I'm not sure. Like, are you saying that not all the disciples died on the cross? I'm not sure about what you're saying. So Ajafka says, what is the meaning of moving far away to marry a foreigner? So there are different. There are different symbolism to that especially, it depends. Like, is it moving away and marrying a foreigner, or is it having a foreigner come to your land and marrying them? That's different. That's definitely different. So if you move away and marry a foreigner, then it usually means that in a way you are going to lose yourself to that land and that your children will. Your seed will be taken by the foreigner. Is a good way to understand that. Now, for example, in Proverbs, that tends that there's a. There's a warning about that, about doing that. But there's also a way in which that can be kind of flipped. And you see that it has. That also has to do with the end. So there's a sense in which. There's a sense in which at the end of something, you know, you marry the foreigner. And that it also becomes like a weird way to a weird moment of transformation where the world is kind of transformed. And there's a. So you see that in the story of Esther, like the story of Esther, man, that story. That's weird. It's a weird story where Esther marries the foreign king and is kind of hidden there and then reveals herself to the salvation of her people. You see that in the story of Joseph, right? So Joseph goes out and then when the world is about to end, like the famine is about to kill his family, then something happens, some like, flip that becomes. That is able to kind of preserve his own People. So that's the other side of marrying the foreigner. You see that in Christ becoming Roman, marrying Rome. Basically, you see the same sort of imagery. So it's a dual. So symbolism. So Daniel says. Have you read. Have you ever read the Brothers Kosov? What are your thoughts on it? Yes, I have read the Brothers Kov loved it. I mean, I. I think Dostoevsky is wonderful. His insights on the human psyche and human relations are quite profound, that's for sure. So Reuben Corve says you mentioned once that you had watched Terence Malik's A Hidden Life and thought it was a good example of a person attempting to show a person's life from the Christian point of view. Could you elaborate more on what you meant or perhaps talk about any of the notable symbols or ideas appearing in the story? Think especially about the scene with the church painter. If you remember, my wife and I watched this film a year or so ago, and it quickly became our favorite. And when we can watch and rewatch Anytime, man, that's good that you can do that. I can't rewatch that movie. Boy, that movie was intense. Like, it was really intense. And it was very difficult for me to watch because. Because it really manifests, like, one of the things that Christ says. That is, you know, the idea that there are. To understand it. Like, when Christ says, there are those who plant the seed and there are those that reap, and those that plant and those that reap aren't the same. And what that means is that the planting of the seed in secret, that's the. I mean, can you imagine? Like, that's the hardest. And so that movie shows you someone who is acting out of Christian virtue and is acting out of a Christian conviction that what, let's say the government is doing is immoral and against the kingdom of God. And because of it, he loses everything, you know, and. And he has no. He's. He's. He's despised by all, you know, and. And that his wife pays the price and his family pays the price and everybody pays the price for his virtue. It's like, man, it's tough to watch. But there are moments in the movie, though, like, there are these, like, moments where Malik shows the seed being planted, you know, where you can see, even in the frustration of the people accusing him, how they're transformed. Kind of secretly, they're, like, transformed in their inner parts, but you don't see the fruits of it. And so, yeah, it's really powerful, but it's hard. I find it very hard to watch because it was very convicting, you know, and you think, wow, what would. I would do? You know, because the other thing that he does, which is the hardest of all is that he also doesn't accuse. He doesn't. He doesn't decry, he doesn't accuse. He doesn't rail against the system. He just accepts the consequences of his actions. Yeah. All right. So Manuel Montiel says, have mass become a sort of toad of the sum? It seems there's a sort of religious impulse behind it, similar to wearing a crucifix. Yeah, for sure. That's definitely for sure. It's. It's a. It's become like. It's become superstitious in the way that we use the word superstitious. People wear it as a superstition, so. Which is not necessarily bad. Like, super. I actually don't find superstitions completely bad. They. They. They can. They serve a purpose, but it seems like that's. It's become that. Ross Bird says, hi, Jonathan. What is going on in Matthew 27 when it says that many bodies of saints were raised from the dead when Jesus died? The direct cause seems to have been Jesus's death, not his resurrection. But then it also says that the saints came out of the tombs and went into the holy city after his resurrection. Yeah, I know, man. I don't know how to touch that story, man. That's a. That's a. Yeah, I don't know what to tell you, man. That's. That's. That's crazy. That's a crazy story. And it's hard to really. It's hard to really. Like. Like, what does it mean? Like, the people that have just died or the people that died years ago or what? Like, what does it mean, man? It's a really tough one. Yep, that's a really tough one. All right. Sorry. All right. Anders Ralstrad said. Hi, Jonathan. To me, it looks like if we worship God, what we need will come our way, because our needs are transformed by worship. However, I don't understand how technology can come about in the new Jerusalem without man putting his own will over God's will. Any insight? And what. So in the image of the new Jerusalem, you really see that. That you can understand it. Like the. The outer wall, it says. First of all, it says that the. The kings bring their glory right into the. Into the. The city. And so there's a sense in which the outer part, you know, or the technical part or the outer part of the garments of skin, they become the expression of that which is inside. And so it's like we worship God and then God fills the world with his presence. And so then the bodily expression becomes the fully, fully an expression of. Of God. So how can I say this? It's like I always be. It's like when I say these things, I was. I'm always careful. It's like, no, this is something which happens all the time, right? This is something which, which happens all the time, which is that if. If the elements of. Of the glass are, let's say, attentive to their purpose and that they're bound together properly to their purpose, the more they are, the more the glass will be full of its truth. And that's true for any level of being. So the more that the elements that are part of that being are attentive to its purpose and to why they're there in the first place, then that will become an exemplary, the most exemplary example of that thing. And it will be full of the glory. It'll be full of glory of what it is that it is. So you can. Man, I feel like no one's going to understand this. So, I mean, think about it. Think about it like, okay, let's use a basketball team again. Let's use a sports team. So you have a sports team and the sports team that is the most attentive and that all the players are the most attentive to the purpose of the sports team. They are the. They're going to become the best sports team. They're going to be the one that represents the sport the best. They're going to be full of the glory of basketball and that all their gestures, they'll have less idiosyncratic gestures. They'll have less gestures which are. Which are going away from the purpose of what they're accomplishing. And more of them will. Will be towards that. And so the body, like their bodies, will start to manifest that purpose. They'll become embodiments of that. And all of them together will become like a glorious body of basketball. And so that's what the new Jerusalem is. But like, for everything, for the entire cosmos, where all things attending and looking up towards their source now become the fullest version of that which they are and their participation in that source. So that's why. So when you, when you think of technology, like, you have to be careful, it just means these external means. So I don't know, like what, you know, I don't know what the technology, what the technology is. It doesn't matter in a way. So you. Yeah, anyway, sorry, sorry, sorry. Sorry. Hopefully this is useful. Okay, so. All right. Okay. So Connor Mitchell asked, can you discuss the symbolism surrounding Greek fire, the secretive technology used to protect the Christian Roman Empire and its symbolism has any relevance to the issue of tech today? Yeah, it's a pretty powerful tool. Like, it was a pretty powerful. Those who don't know what the Greek fire was, was that the boats, the Byzantine boats would have kind of cannon. They don't know exactly what it was, but it shot something probably like oil or petrol or something, and then it would be lit, aflame and so the water would. Would burn. And so that's how they would take out enemy fleets, is that they would basically like light the ocean on fire, you know, lightly the sea on fire. And that way they, they became in like an impenetrable. It was very difficult to attack Constantinople from the sea. And so, I mean, if you want to understand, it's like that's, that's what war. Like, that's war, right? That's war. Setting, setting potential on fire. You know, that's what, that's what war is. So, so Anne Herrera said, just curious how you see therapists, therapy symbolically. Thanks. So, I mean, I think I see. I see therapists and therapy as a. They're trying to do something that let's say the religion used to try to do, which is a. Try to kind of remember people, to kind of co. Cure them, to bring them together. And so I'm not against some of the aspects of, of therapy. If you look at the way that the church fathers talk about in the Philokalia, you'll see that they use therapeutic, let's say therapeutic methods in order to. To kind of help people free themselves from their passions. There's a wonderful book called Orthodox Psychotherapy, which, which my dad loves, by the way. But I think that one of the, let's say the downside to that is really the fact that often in the modern kind of therapy session, there's a kind of narcissism because it's all about just you and about, you know, like, helping you become better. And there isn't the sense in which that happens through serving others and it happens through loving others. And, you know, sometimes, maybe some therapists, but a lot of it isn't like that. It's like it's just about, you know, yourself. And so I think that that can sometimes make it problematic, especially not just therapy, but especially like psychoanalysis, man. Psychoanalysis. I think. Not sure psychoanalysis really helps anybody or like ultimately because it is, it is such a It is such a kind of narcissism. So, like, a good example. Like, my dad is a psychologist, and so what my dad does, he's retired now, but what he used to do seems to do only couples therapy, because he thought, you can't be in therapy without someone you. You at least say you love. And so if you have a couple's therapy, then it's like the therapy is. Is happening in the communion of the two people. That's how the therapy is actually functioning. And it's not just happening within you and within your own thoughts and within your own, like, little idiosyncrasies. And so I thought that was a really good, good insight about how humans actually are healed. And so Anne and Herrera says, yes, preach. Well, I'm happy you like my answer, Anne. Oh, all right. Arie Fisher says, hey, Jonathan, if you're not going to make a video on Spider man, no Way Home, could you briefly outline your thoughts on the film? And so, Arie, I am going to make a video on it. And so. But I'm gonna probably make it a Patreon only video. I was thinking of doing that because it's actually May 31st, and I'm supposed to make my Patreon video today, but I'm not gonna make it today because it just. This month's been crazy. I'll probably make it tomorrow or the day after, and it will probably be about Spider man, no Way Home. So. So since you're asking that question, you'll be able to see it. And I will be writing. I'm. I wrote a. I wrote an article for Richard Rowland's book, the Sacramental Imagination, which he talked about on the. On our podcast, and he's kind of putting together. So I finished the article, I sent it to him, and part of it is also an analysis of Spider man, no Way Home. And so. Yeah, so look forward to that, guys. So Jacobus Roden is asking explain on the idea of God's right hand, left hand, in terms of angels and demons. So this is something that I really. I've mentioned this a few times on this. On. In my podcast, which is that in St. Gregory Venissa, St. Gregory Venissa talks about how every human is attributed an angel and a demon. And he says, you know, and it's basically like the angel on the right shoulder and the demon on the left shoulder, right. That you see in the. The cartoons. Right. You see that in the Simpsons or whatever they were in, like, Tom and Jerry. So you have these two influences, and he Also, interestingly enough, puts them in the same person in the story of San, Gregory of Nyssa, in the story of Moses. So he has this sense that the. The angel and the demon are. Are Aaron. So as Aaron is the helper, he's the brother, he's the sustainer. And so. But Aaron is the one who kind of gives advice. But Aaron in the. In the Bible is both sides, right? So he makes the golden calf, you know. But he's also like the one that. That kind of speaks in front of Moses. So he has these two sides to him, you could say. And so, interesting enough, St. Gregory of Nita puts this idea of, like a. Of a helper and separates it into two, which is like the demon and the angel. So that's super interesting to think about, by the way. And so you can understand it as like, the transpersonal aspect of you, that there are two extremes in, like, the transpersonal aspect of yourself, that which is beyond you, you know, and that you interact with. So you have an aspect of you, but that is beyond you, that you interact with, that is pulling you towards the good. And you have an aspect which is also pulling you towards fragmentation. And then you can imagine that there's a cosmic version of that. And that's the one that I was really excited to HEAR Father Steven DeYoung talk about, how the Church, Father St. Gregory of Nanzianzus, I think, is the one who said that the angels of the left hand are the demons and that they do the will of God despite themselves, that they are there to kind of scourge us, but that in doing so, they ultimately end up participating in our. In our salvation, mysteriously. And so I thought that that was interesting because it's like there's a microcosm version that St. Gregor of Nyssa talks about, and then there's this macrocosmic version, you know, that St. Gregory talked. The other St. Gregory talks about, and they, you know, they knew each other. So. So I find that very interesting. Definitely very interesting. So James Orange says, wouldn't the angel be pulling you towards total order tyranny if it were a true dichotomy? So, no, I mean, the hand of order, the hand, the right hand and the left hand aren't like order and chaos. That's not. That's not the right way to understand it. The left hand and the right hand are moving towards the inside and then moving towards the outside or moving up and moving down. And so in that way, they're not the same as just order and chaos. Yeah, but there is a negative aspect to the right hand. I've talked about it. Which is the, the, the negative aspect of the right hand is the possibility of pride and self sufficiency. You know, and the, the negative and the positive aspect of the left hand is something like the capacity to move out of yourself and to be able to adapt towards, towards the strange. Right. It's the fire. It's the fire of, of. Of Pentecost, you know, and it's also St. Paul when he talks about being all things to all people and, you know, being a shapeshifter, basically. But for sure, in terms of angels and demons, now it's clearly, you know, one is Zen, is positive, which will be up, and one is seen as negative, pulling you down. But like, like I said, it's like there's a mysterious way in which that participates in our salvation, at least according to St. Gregory. So. All right, so Charlie Longoria says hello. Jonathan, in the past few weeks in the United States, we've had this abortion controversy, a mash word of a baby formula, and now this horrifying and disgusting shooting at elementary school. I feel like these are connected, but can't articulate how and why. I was wondering if you had any thoughts on this. I don't know. I mean, they definitely are connected in the sense that they are all related to, let's say, the, the opportunity, the danger, the. The manner in which we deal with the future with, with children. And so they're definitely related and in that way, but that's pretty much as much as I can say, I think. Joe Kelly says my grandmother was on the board members that organized the Medior. The Medu. I can't pronounce this word. Medugor Peace Conference, which hosts the Marian visionaries in California every year. Mary, the Eucharist and the mysticism of these visions is the foundation that my family's faith was built on. And we are firmly rooted on the edge here in California. I was wondering if you could talk about the significance of Our lady of Guadalupe and the idea that the Tilma reconciles Aztecan symbolism with the Western symbolism of the Virgin Mary. And so I don't know enough about that. I don't even know what the Tilma is, so I probably couldn't answer your question properly. And so what is the tilma of Our Ladies of Guadalupe? The mantle, the cloak. So I don't know enough about that. That vision, I'm sorry to tell you. And so, I mean, if it reconciles Aztec and symbolism with Western symbolism of the Virgin Mary, Then I think that that's. That would definitely be appropriate because, you know, it's a vision that happened in Guadalupe. And so that might be. That might be something. But I don't know enough about it. So sorry about that. All right, so Bob Briggs says, love, Richard. I can't get enough of universal history. So. Yeah, cool. We just recorded an episode today on the Mongols on the. On Gog and Magog. So, man, that was something. Gets pretty dark because it's crazy stuff that happened at that time during the Mongol invasion. All right, guys, I actually got through the questions. Usually like this lasts about two hours. For some reason. I was able to get to 50 questions in less than that. So are there other questions in the chat that you guys can ask? Or if not, then we'll call it a night already. It might be a good idea because man tired. All right, guys, I think then. Then we will call it a night. It's good to see everybody. Glad to see. It's good to read your chat messages. Brad, thanks for showing up and. And stay tuned. We'll have videos coming, I hope very soon. The patron video, I hope by tomorrow or maybe the day after. And very soon. And we'll talk to you very soon. All right, guys, bye. Bye. I hope you enjoyed this episode of the Symbolic World. The Symbolic World is based on a series of videos that you can find on my YouTube channel, Jonathan Pageau's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by, of course, leaving a review on itunes. Everybody knows that's the best way to get the podcast out there, to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon, the Pageot videos as well, and on subscribestar. All those links you can find on my website or in the show description. So thank you and I will see you soon."}
