{"episode_id":"SW - #319 - 2023-12-22 - The Symbolism of Aliens","start":1.6,"end":841.25,"speaker":"Jonathan Pageau","text":"One of the most fascinating developments of the modern world is the notion of possible sentient extraterrestrial life living among the stars. This possibility, presented as scientific speculation, is attractive to those who espouse a materialistic worldview. Those for whom the ancient cosmology, in which there are meaningful patterns in the heavens, seems superstitious and absurd. But now these same people can nonetheless project their mythological thinking into those very heavens. You see, the frame of alien life is presented in scientific language. But as soon as we attempt to imagine these creatures and their world, all the ancient patterns of human consciousness come flooding in. This is Jonathan Pedro. Welcome to the symbolic world. In the ancient world, we find a universal pattern. The image of a center, an anchor by which we interpret the world. Our home, our family, our tribe, our temple, but also our own center of consciousness, our heart. As one moves further and further from this center, one finds all that is not aligned with our identity. The neighbor, that which we can still recognize first. But soon we find the stranger, the foreigner, and ultimately the barbarian, and even animality itself, the beast and the fantastical monster. As soon as we move away from that which we know, we fall into a space where things don't quite have identities yet are not accounted for within ourselves. And these possibilities will appear to us both in their positive or negative form, either as a dangerous, destructive chaos, or else as the promise of something more. So the ancient Greeks, for example, had in Delphi the the Omphalos, the navel of the world, just like the Romans had the umbilicus, from which all the distances in the empire were calculated. The Israelites had the temple in Jerusalem. Now, the further one moved away from this center, the more what was encountered appeared strange. Ultimately, on the edge of the world were found mythic races of monsters, giants, inversions like the Amazons, hybrids like dog headed shapeshifters of all kinds, you know, and ultimately fantastical beasts and sea monsters. But in the same unknown region was also found stories of great sages, the naked philosophers of the East. Untold bounty and treasure from faraway lands, and even the Garden of Eden. These patterns are not arbitrary, but they're the very shape of how we experience reality. Every day can be seen as a moving out of the home into an unknown future, where one can find both danger and opportunity. And the duality of what is foreign still inhabits the human experience. And if the monsters and treasures were once pushed out to the outer edges of the earth, now these same tropes are projected into the infinity of outer space. And so, instead of eliminating this mythological structure, we actually have a radicalization of it, where the impossible distances of our outer space have also wielded an infinite canvas for idiosyncrasy. Monsters, demons, but also angels or godlike beings who can offer mankind its future. These tropes are often understood by the creators of these stories, which is why many extraterrestrial stories want to connect the question of these faraway aliens with issues and problems with of immigration. Mikey the difficulty in the encounter of cultures. The negative encounter can take the form of the destructive power of a monster and invasions of the hordes of chaos, the infiltrator and corruptor of our world, an infection which contaminates us. All of these an image of the intrusion of death and the collapse of all we identify with. But the encounter can also be positive to the extreme. And the alien civilization can be used as a foil to humanity showing us up in some way, judging us. And here the aliens are either the higher, more technically perfect and enlightened beings, or else an extreme version of the noble savage, a purer people closer to nature. All of these are versions of the same reality, which is the the problem of facing and categorizing something yet unknown as it appears in the periphery of our experience and our imagination. How encountering the unknown inevitably brings about the promise or confrontation of change and difference, growth or dissolution. In that manner, stories of extraterrestrials are a direct continuation of ancient narratives of encounters with faraway people, trade with mysterious civilizations, the pillaging and invasion of barbarians. Or else they also recast the travel to the ends of the Earth, which are exemplified by, let's say, the legends of Alexander the Great, the story of Marco Polo, or even more recent literary versions such as Gulliver's Travels. This obviously has both political and psychological significance. We can imagine the traveler as a centered figure who then encounters a wealth of beings, each of them representing a specific aspect, a strong characteristic of human existence, which either shines light by emphasizing a specific that characteristic itself, or else acts as a foil to a particular human flaw. This manner of presenting extraterrestrials was particularly vivid in the Star Trek series, where the important alien races were portrayed with and emphasized human characteristic. The Vulcans were reason and logic. The Klingons were passion and aggression. The Ferengi were greedy and shrewd. The Borg was conformity and high thinking. This is not much different from the early Enlightenment science fiction works, such as Cyrano de Bergerac's comical History of the States of the Empires of the Moon. There's also an important relationship between aliens and technology. And we know this intuitively because the stories appear to us with all the trappings of science fiction. But this relationship is not happenstance. Rather, it is fully in tune with the very structure of our experience. Imagine our ancestors facing the chaos and danger of the natural world. In order to protect ourselves from that danger, and in order to take advantage of the opportunities of the outer world, we create layers around us. We have clothing which permits us to live out where there is more cold. We have houses that do the same as well. And all these practices which protect us. And in that manner, all technologies are a series of layers which permit us to live further and further out into greater and greater danger. The ship is the ultimate example of that. Both a kind of shell around us, but a vehicle which permits us to float on the watery chaos where the monsters lurk. Space travel is the modern version of the ancient mariner's tale who boldly goes where no man has gone before. The problem, though, with supplementing our power with technology and exploring the unknown with science, is that as we add layers and become bolder and bolder, we move out from further and further into that unknown. So the danger is also increasing. And so, although we are stronger, we are also more vulnerable. See, my access to a matchbook makes me able to start a fire without having to plan and think about it. But I've also lost the capacity my ancestors had to start a fire without those matches. The reliance on cleaning products protects me from germs, but it also makes my immune system weaker for the lack of exposure. Dr. Banks. Now imagine we move so far into the technical world, into that double space of opportunity and danger, that we discover something that could destroy us all. On a personal level, more psychological level, imagine that in your own self you travel so far away from home, so far from yourself, that you encounter something you could not foresee. A madness at the edge of your being, A chaos or evil so great that it can consume you. Face me now, or I will devour you. The Alien series of movies explores this conjunction between all these symbolic elements. The Alien from this famous series is an image of an encounter in the far reaches of space, of a chaos we could not foresee. A beast which defies all categories, which is constantly transforming, mutating the evolutionary version of a shapeshifter. The very name of it, the xenomorph, joins the notion of the periphery, the outside, with the shifting and changing chaos. The first Alien movie makes this not only about the edge of social cohesion, but but also the edge of reason and consciousness itself. So the alien is related to the nightmare, which is why the crew encounters this monster as an interruption of their cryogenic sleep. The creature, while joining many types of the humanoid monster, the aesthetic of demons and dragons also taps into the notion of the alien as a foreign body and parasite, having insect or vermin like qualities in its appearance. But the alien spreads itself by an actual parasite, which then infects its host and enters into it. In broader terms, the movies are constantly dealing with tropes of containment and evacuation of the foreign body. We even see this burning off at the end of the first movie. But while the alien plays with all the tropes of contamination, it is also the monster on the edge of the world, the dragon or the leviathan, this predator that will devour us if we wander too far away from the campfire. In the movie Prometheus, the unleashing of this foreign threat, the very existence of the alien species, is presented to us as a weapon for the destruction of mankind. Sometimes to create, one must first destroy. So imagine, if you will, the possibility of weaponized migration. This last example points to how, although the alien movie presents the negative aspect of this encounter from far away, it also shows us the other side. In several of the movies, the technological advantage presented by the alien is seen as a potential that is extremely desirable. Both in the first and the second movie, part of the drama occurs around hidden attempts in some camps to wield the power of of the alien. In the first movie, the Android Ash has a secret mission to bring the alien to Earth, linking the very technological being of Ash to the technical potential presented by the alien. There's also something of a flavor of ancient medieval demonology and angiology within these stories of aliens. We see this, of course, in how New Age people often link meeting with aliens to spiritual experiences. Encounters with angels. And many Christian apologists have also linked aliens to demon possession. Because demons are creatures out of the outer darkness, you could say both oppressing us, devouring us, but also infecting us and using our bodies to their bidding. We can see how they function in a similar manner as aliens. And like in Star Trek, demons are usually linked with certain excess of human characteristics. And so, just like the Ferengi, we. We have a demon of avarice, just like the Klingon, we have demons of passion and anger. We should therefore not be surprised to see that stories of alien objections, often discovered when people are brought out of consciousness into hypnotic states, would bear similar stories, similar images to stories of witches of demon possession. And the like. All of these patterns surrounding aliens dive deep into into the structure of our human experience. They're very useful in understanding how we perceive difference, how we perceive novelty, and especially how we interact with what is foreign and on the edge of our civilizations, our culture, our religious beliefs, and even our own personal being and rationality. You can often tell quite a bit from a person's politics and their basic view of the world by discovering which type of extraterrestrial movie they find most appealing. Is one attracted mostly to ET Or Close Encounters of the Third Kind? Or is it rather War of the Worlds and Independence Day? Or maybe, like me, you can see both sides of the question of what is strange and foreign. You can come to perceive both possible extremes as well. And hopefully through this discussion, I have brought you a bit further on that path. If you enjoy these videos and podcasts, please go to the symbolicworld.com website and see how you can support what we're doing. There are multiple subscriber tiers with perks. There are apparel and books to purchase, so go to thesymbolicworld.com and thank you for your support."}
