{"episode_id":"SW - #166 - 2021-07-19 - May Q&A","start":12.56,"end":9024.85,"speaker":"Jonathan Pageau","text":"This is Jonathan Peugeot. Welcome to the Symbolic World. All right, let's go. Here comes. Okay, people are coming in. So I'm gonna start with the Symbolic World website. As people know, people who kind of give $10 or more a month, they can ask questions in advance. And if you want other questions, best is to go into the super chats, because there's too many questions anyways. There's always too many questions. I never. There's always. I always. These Q and A's are getting longer and longer. Okay, so. So Fred C. Asks, can you explain the meaning of Mary normally wearing blue on the inside and red on the outside in icons? I've also noticed that it's sometimes inverted and the blue is outside, especially in the icon of the coronation. Is there any specific meaning to this? Now, the thing about that is that Mary, traditionally, Mary doesn't wear red on the outside and blue on the inside. Traditionally, Mary wears the royal purple on the outside. And then. Then we'll maybe wear blue, have blue or red on the inside. And this is at least an orthodox icon which she wears. But there has been like a. There's like a trope that came about, and. And I think that the trope has meaning, which is that that Mary would wear red on the outside, blue on the inside, and then the opposite for Christ, where he would have red on the inside and blue on the outside. And so I think that this is definitely something which at least has meaning structurally in terms of the. In terms of the inner and the outer and the inside. The. Let's say the inner and the outer, in terms of the right hand and the left hand. But it's very intuitive. And I've heard people try to explain it. It sometimes I'm not sure I completely agree with the way they explained it, but for sure, it seems to appear to us as a pattern which makes sense in the sense that Christ is open, is. Let's say, a public figure is out in public. And so I'll tell you often what people have said is that let's say Christ is divine and then manifests himself as. Manifest himself as human. And then other people have said, for Mary, she's human. And then she gets united. She becomes divine in her in theosis, like she's united with God. And so some people have said something like that. And so I think that that's okay. But it. But it definitely. Structurally, you can see that there's definitely a play on the inside and the outside. And so Christ is definitely more. Christ is someone who, especially in his Ministry kind of hides his divinity and then has like a. Let's say, has an outer. An outer. He's very outer. And then the Mother of God, she's secret. So there might be something to do with that. But I think there's. I think it's one of those things, like with color and with music, where it's sometimes it's almost all about. It's about pattern itself. And so it's not that it has a narrative meaning necessarily, but it shows itself as this flip side of opposites, you know, like a yin yang, let's say. So when you see a yin yang, I mean, that has more narrative meaning. But there is a sense in which you have an inside one and an outside other, and then the inside one and outside other. So maybe the yin yang is the best way to understand that. Like, you know, white.in a black. In the black shape and a black dot in a white shape in the sense of two opposites, but which are driven by the. The other. Something like that. Hopefully that makes sense and it's not completely chaotic, what I just answered. Okay, so Belial1234 says. Hi, Jonathan. I have a question about pride and how we're supposed to understand it from a Christian perspective. I know pride is a sin, but there is also the idea of having pride in one's own work. For example, is there something to be distinguished, or is it always wrong to have pride or be prideful? I also wanted to know what you thought about the contemporary worship of pride in the modern secular and progressive culture. Lgbt, et cetera, thanks in advance for answering my question. And so I think that. I think that. How can I say this? I think that pride as self sufficiency is definitely always wrong. I think that there are. You can have a kind of hierarchy of pride, but usually it would be things that are kind of beyond you. And so you can have a certain amount of pride in. Let's say you're in your. In your nation. You can have a certain amount of pride in the sense of being proud of being a Christian, being proud of being a Canadian, being proud of being a pageau, let's say, proud of the lineage that my father has given me, of that which has been handed to me. I think that can actually, if we see it in a proper hierarchy, it can kind of climb up towards a glorification of God. The difficulty is when this happens mostly is when you focus your pride on one spot and you think that there's something also about pride in something which is bigger than you. There's something about that which is also not. The problem of pride is self boasting. It's boasting. It's like self naming, and I mentioned this before, it's trying to give yourself qualities and not receive them from outside. But if, let's say you're, you're like proud of your country and then your country can honor you, right? So you're proud of participating in that country. And so in that participation, then you might receive honor from your country like a medal if you're a, if you're a warrior or some, some kind of recognition, let's say. And so then it comes from somewhere else. It doesn't come from yourself. The problem is always like this kind of self adulation and the worship of oneself and the worship of our own characteristics. So to be honest, I see that way more in the kind of modern pride movement, which is this idea that this is who I am, like I'm proud of who I am. So accept me the way I am. And it's kind of sense of, you know, it's like I decide what I am and you have to kind of accept it. You know, this idea of self naming. And you see that also in the weird kind of gender stuff that's happening, which is that the sense that it's like I'm the one who decides what gender I am. There isn't a sense in which I have to kind of submit to a higher pattern which is kind of beyond me and, and which, which is not which, which doesn't depend on my own whims and my own feelings and my own, my own thinking. So that's what I think about that. So, CR street, you'll ask, what is the symbolism of elopement? You mean like eloping? I think you probably mean like eloping in the sense of like getting married on your own. I guess that's what you mean. That's an interesting. I never really thought about that, but it's very interesting because there's something about that. For example, like the idea that you can elope in the west is, is actually a manifestation of the notion of consent in Christian, in the Christian tradition, in a lot of ancient societies, marriage was a thing of families only. It's like, you know, you, you know, you get promised to this other family and then the families kind of decide and they join it together for all these reasons of, you know, of land and wealth and whatever political reasons that you would join together. It's like they would make a good marriage for you. But in Christianity, there's a sense in which the final decision is in the people. Like the individuals, they have to say yes in order for a marriage to be valid, which was not the case in, like Roman times, like Scandinavian times, like a Scandinavian could take a woman and then there was no even question of whether or not she consented. There was no, there was no asking about that. Whereas in the, in the Christian tradition, they really developed this idea of the yes, which I think was based on the yes of the, of the Virgin Mary at the, at the Annunciation, where, where it's like she says, let it be done according to your will. And so I think that, that it has to do with that. And so, so the, the, the thing is that young people in, in the, even like in the Middle Ages or in the Old. A while ago could go to a priest and ask the priest to marry them, and the priest could marry them even without asking permission of their parents, because if they were, you know, if they were old enough in the sense that they could reproduce, then they could, they could get married. And so I think that that's, that there's something about that in this idea of eloping. So, you know, the idea of, you know, a man shall leave his family, you know, that the man and woman shall leave their family and become one, one flesh. There's something about that. But it's probably still best to involve your families in your union, just because it gives you a better network after that to kind of live with and it gives you a stability. It's a, you know, getting married without the permission or the, not the permission, but let's say the participation of your family is a dangerous thing, like you might, it might lead you into trouble. All right, so Bogdan says it seems that the Internet, rather than uniting people, has made our divisions more entrenched. People in different echo chambers often can't understand each other even when using the same words, like they're speaking different languages. Is this similar to the confusion of languages and the Tower of Babel? And if that event stopped the construction of the tower, could the Internet somehow stop the creation of the modern tower, the all encompassing global system? You've mentioned before? Not sure if I'm thinking about this right, but I have some intuition about it. Thanks for all your work. Yes, I think that that's right. I think that you can understand the Tower of Babel. You can almost understand it in the simultaneity. Obviously it's a story, so you have to understand it in a sequence of events where the builders make the tower, and then God confounds their languages and then they don't understand each other. But you could understand it in the sense that it's in building the tower that their languages get confounded. And obviously, narratively, it'd be hard to say that. But now, like you said right now, we have an intuition of how that is absolutely the case. That is, that in trying to create an identity which is all encompassing and too high, then what happens is because, you know, there is a sense in which people want to break down the competing identities, they want to remove intermediary identities, you know, like church affiliation. Covid did a lot of that, right, where they want to have just like one massive affiliation to this project. And so, but in doing that, people end up loop, you need these intermediary identities. And so people end up losing the things that hold reality together. And in the very building of the tower, they stop understanding each other and then the tower breaks down. So it's actually a pretty interesting moment to understand the Tower of Babel and to understand it not as some arbitrary thing. Because this is always the problem when we read Scripture, because when it says God does this or God says this, we somehow think that it's just this arbitrary God that comes down and does stuff. But that's not how it works. The will of God is manifesting the reality of the world. It's not separate. God is not separate from the world, kind of imposing some arbitrary will on it. But so. But it's actually manifesting the very pattern of reality in its proper and its full sense. And so understanding that in building the tower, then they would stop understanding each other is probably the best way to see it and the best way to understand what's going on right now. All right, so Pnuma asks, what role can imagination have in our lives? Usually imagination is frowned upon, especially in prayer. But besides creative endeavors, where can it be useful in our daily life? Perhaps constantly imagining a life that we don't have is detrimental to ourselves. But I think there is a positive aspect to imagination as well. I would say that this is definitely, especially in kind of the Orthodox Church. It's true that imagination, if you read the Fathers, like if you read the desert, let's say the Hesychastic Fathers, they really downplay the idea of imagination. And so they don't want you, like you said, in prayer, because, you know, like the Jesuits, for example, had this idea that you, you kind of imagine you're reading scripture and you're praying and you kind of imagine you tried to Picture the scene of the. Of the Bible and picture Jesus and picture the saints and picture Mary and stuff. And for sure, in the Orthodox tradition, this is not. This is not encouraged. I would say that so, so a good way to. A good way to maybe understand it is that imagination can be the place where the patterns can imprint themselves. And so there's something in the imagination of a positive aspect of the imagination that you see, for example, in the Orthodox tradition, in terms of the amazing, let's say, iconography that was produced, the amazing architecture, the beauty, the music, all of this kind of came about, but it wasn't. It wasn't about people trying to kind of think up of things that could be interesting, but rather a disposition for this imaginary. Imaginary. The imaginary or that. That capacity of the person to. To be available for the higher patterns that kind of imprint themselves and find bodies. So I think that that's really the, the. The role of imagination. But it's like that's in a strict, kind of really strict monastic sense. But I think that they're, they're. Despite the warnings of the fathers, I think that there is also room for kind of everyday imagination. I don't have a problem with fictional stories, although some, some monks might. I don't have a problem with fictional stories. You know, at the outset, I think that there's a danger in kind of giving yourself to fictional stories. But it's always these things where the thing that is kind of further away in the right perspective, can also be something which is bringing you back. I think that in our world right now, fictional stories, and you've seen that's why I interpret fictional stories on my channel, can be a little step on the ladder, bringing you back towards kind of a immediate perception of reality. So that's what I think. So, David Flores, can you talk about the way backgrounds are depicted in icons? Why are mountains depicted the way they are? And so, I mean, I don't know what you mean by backgrounds. If you mean like the fact that backgrounds are usually flat, like a flat color or gold, let's say. I think that. That this is something that has different interpretations. George Cordes has a pretty good interpretation of that, which is the way that icons are represented is to have a plane, a picture plane in the back and then have the figures in front of the picture plane so that the figures actually kind of come out towards you, rather than something like in the Renaissance images, where they tend to recede into the frame. So this is his explanation. I don't know if that is his. Is Reasonable. And in terms of mountains, usually mountains are represented in terms of the desert. So the way that the earth is often represented in icons is as a, as a wilderness and as a desert. This has to do, of course, with kind of like monastics and the kind of desertification that you need to accomplish, like this ascetic move that you need to do is in order to receive the, the, the kind of the holy, the, the divine light, let's say. So that's what, that's the way that I understand it. That's why the, the mountains are cracked, you know, often there are caves. That's the way that I see it. All right, so Rebecca asked. Hi, Jonathan, I'm really interested in the revolution trope that you have outlined in a few of your videos. The reestablishment of a new order that is in its turn continually renewed and conquered. It is easy to see how this has manifested itself in the sexual revolution, communist revolution, etc. But is this narrative relevant to the Protestant Reformation? Where Rebecca wants to get me in trouble is what's going on here? Is this why we now have so many Christian denominations that have splintered out in the last 500 years? And so, yes, I do believe, I do believe that the Protestant Reformation plays in the revolutionary pattern. And I do think that the fragmentation, the, the increasing fragmentation of the Protestant churches is a sign of this revolutionary pattern where churches are constantly in danger of someone rising up and making a new branch. And I think that this is something I've kind of hinted at before where I've said that I actually can follow Martin Luther to a great extent. If you look at his story and his anger towards the corruption and, and the kind of the, the superficial nature of some of the practices that were in the church. And you know, the, the abuse of the. What's the, what's the, what's the name of the. I forget the name of, of, of. Of it. Anyways, the, the, the, the. The abuse of the, of the, of the system. It's like penitentiary system. What's the name of it? Man, it's so bad. Sorry. Indulgences. Thank you, Susan Martin. That was very good. The abuse of the indulgence system. I could follow him. I sympathize with him. But then as soon as Luther names priests, and this is actually, you might. People think this is like a technical thing, like this is a technical thing, but it's not technical. It is very much the moment because Luther was a monk. Luther was a lay monk. He wasn't in the church hierarchy. He did not have authority given to him from someone else. This is the thing that's important. This is about pride. This is the problem of pride is that authority has to be given to you for you to act with authority in the world. Authority has to be received from someone else. Now it is possible for a prophet to appear without authority, coming from the hierarchy. And you see that in scripture all the time. A prophet rises up, right? The judges just rise up and then start to act. But the prophets, the judges are not the priests. And there's a difference. That is Luther. The way it should have gone is that like other saints in the church, like Saint Maximus the Confessor or other saints in the church who were persecuted by their own church, St. John Chrysostom was killed by the hierarchy of the kings. But you shouldn't be taking the authority that you don't have on yourself. And so Saint, saint. And so Luther should have, should have criticized the church, criticized the church, you know, and not necessarily look for martyrdom, but it's the moment where he decides that all of a sudden he has the authority to create a new church and to name, to name priests. It's like, I don't know where that authority comes from. I don't see it comes from himself or it comes from a prince, but that doesn't make any sense. And so at that point I pull out from like, I, I can't, I can't follow Luther anymore when that happens. Now, despite that, I believe that. I believe that the Reformation is playing a vital role in how the whole pattern is playing out. That is as, as the church, let's say, as the church moved away from quality, let's say, and it, with, through scandal, like, I'm not justifying the scandals, but through scandal, as it moved out of, of the higher aspect of Christianity, it acquired a lot of possibilities. And so there's a reason why the Western church evangelized the entire world for good or for ill, in terms of politics. But that's what happened. And so there's a reason why the Protestant churches is like actually in its fragmentation, kind of infiltrates every little aspect of reality and like finds itself in all these little corners of all in the world and all these weird little Protestant churches kind of find themselves everywhere. And I think that despite everything, I think it, that is actually part of this kind of filling up of the world. And like I said, I'm not justifying the Reformation, but I think that it's part of the story and it's actually going to surprise us. In the end, there's going to be a surprise where things are going to actually kind of come together. I don't know how, and I don't. I'm not advocating some kind of ecumenical delusion, but I think that in the eschaton we'll have a surprise. That's all I can say. That's all I can say. All right, so I need to take less time on each question or else. So Kingsley asks, can you speak to the pattern that exists where the higher a woman's intelligence, the less likely she is to marry? Do you see any solutions to this problem? Man, you guys really want, want me to get into trouble? All right, Kingsley. I mean, I think that this has something to do with the role of masculine and feminine. And, and I think that, you know, Jordan Peterson has pointed this out, which is just a, which is something which is kind of inevitable and is a, is a pattern, is that it's, it's, it's much more, it's far more difficult for a woman to kind of give herself to someone she considers her inferior in terms of, in terms of intellect, in terms of, even in terms of amounts of possessions, all these things. It's difficult for that to happen, whereas it's not so difficult through the other way around. And so what do I think would happen to those women in an ancient world? They would probably become actually amazing people. They would just not marry. And so there is definitely a trade off, but I think that, that probably people like these amazing abysses that you see in the Middle Ages or these saints that are just beyond anything, you know, the great saints in the church, I think that's possible that that's what was going on is that the only person they could give themselves to was to Christ. And so it's like, I'm sorry, you know, so I don't know, but I don't think, like, this is like a universal rule that always happens. There are exceptions all the time. This is just like a general pattern, you know, so, so, yeah, so. So someone in the, in the, someone in the chat says that my wife's smarter than me and we still got married more for marriage than just smart people are. Yeah, of course. So that's, that's definitely true. And so I don't want to reduce all the marriage to that, but it is a pattern that people have noticed. And I think that it, it kind of has to do with, kind of has to do with the natural roles of, of masculine and feminine and in the Bible, but also just in, in, in reality. Okay. So Luca Askovic asks the question is about the good or neutral dragons. What role do they play symbolically, not from a modern perspective, but traditional. Where can we place them? In Balkan folk belief and fairy tales, some dragons are helpless or men and protectors of farmsteads. They help fight off evil dragons. Yeah, the Basilic head of steel fairy tale. They help resurrect the hero with the water from the Jordan river and ultimately help him defeat the villain. Another story, a dragon king gives the hero a gift of unspoken language. And with it, he could understand animals, plants and rocks have. Dragons were thought of as great winged heroes of men. So, I mean, I think you have to understand it like gargoyles. Like that's the best way you can understand dragons or neutral dragons. You know, it's like on the edge of the church, you have these. Or St Christopher. Right, I've talked about St Christopher quite a few times. On the edge of the church, you have. You have monsters, and those monsters end up being able to defend you from bigger monsters. And so I think that that's probably. That's probably the best way to understand it. And so you could understand it. You could understand it like, you could. You could understand it more subtly, let's say. And think of how the. To think of how the. The. The. The Rome, let's say the. The emperor in Constantinople would hire a guard of Varangians to defend himself from other Northmen. And so he hired these pagans, right? So you can imagine these dragons, these strangers, that he hired them to become his guard. And so he could turn them against things that were of similar nature than the Varangians, which were the other Northmen who were, you know, which. Who were very difficult to stop. Or you could turn them against the Mongols, or you could turn them against other groups that were more. That were kind of difficult to manage. And so that could be a way to understand the idea of a neutral dragon or a dragon that can be turned as a defender like a gargoyle on a church. All right, so hopefully that makes sense to you. So from Mikal, by the fruits, you shall know them. It seems to me that your public speaking revealed itself to focus more attention than your icon carving. Do you see the symbolic world following a pattern to manifest itself as. As something like an orthodox version of Bishop Baron's word on fire or the Prageru. Look, I just. I am just doing things one. One at a time. That's how I'm approaching it. You know, it's like I am just being grateful for whatever opportunity appears and trying to fill it as much as I can without, you know, to. To put as much energy as I can reasonably into the things that I see. And so could that happen? For sure. I. I do believe that. That the symbolic world is participating in something that's happening. Maybe say it that way. I do think that there's something happening. There's like, there's like a movement. I don't know how to say. Say it. And, And I do think that this symbolic world, the symbolic world, not just the. Not just me, the way I'm doing it, but let's say as a. As a kind of change in the way people think, which encompasses a lot of other things as well. I think that that's the future. And I had a. I had an interesting conversation last week. You know, a priest that I really respect, he asked me, he said he was doing these zoom calls with a catechumen. And so I said. I asked him if. If I could kind of jump in and talk to the catechumens. And so it was really wonderful. It was wonderful for me because it was nice to see catechumens. And one of the, One of the guys, I hope you won't be offended that I'm using him as an example, but one of the guys was saying that he was doubting, like, his intentions to a certain extent for being a catechumen, because he said, I feel like I'm in some kind of, like, secret club and I feel like I'm part of the people who knows what's going on. And, you know, like, I'm. I'm there, right? I mean, I'm where it's happening. And. And he said because of that, he was actually wondering whether or not he was entering the church with the right intentions, which is. Which was actually, to me was quite beautiful in terms of his. In terms of his. In terms of his intentions. But it can show you that there. I think there's a lot of people that are feeling that. That it's like this is. There's something going on, like there's some kind of social change happening. And, And I think. And I do believe that the symbolic world, or all of which is around it is. Is participating in that. So we'll just take, you know, we'll take what we can, but I don't think I'm going to start. I'm going to stop carving icons. One of the things that's been amazing is that with like, your people support on Patreon and the different supports that I'm getting, I'M able, like I've hired someone part time for the work on the videos to kind of help me do the advertisement and do all that stuff. That's been really wonderful. She's been awesome. And I've also hired an assistant for carving. And so through that I feel like I'm able to then kind of accomplish more. And so like, like the support that people have been giving me has been really helpful to try to help me kind of just have more body. Right. To have more possibilities to, to move forward. The thing that's killing me though is the, is the email. I need to find a solution to the communication because sometimes like it's like it takes up, it takes up a whole day and I'm like, what did I do today? I just read emails and, and, and, and answered some and didn't answer others anyways, so. But I think I will continue to carve. I don't see that stopping. Okay, so Gardner Brothers, with the advent of COVID lockdowns and remote work, is the west moving towards a neo Gnosticism, a separation of body and mind? Body physical interactions and mind, soul working and attention going towards online endeavors with no physical basis. What's the Christian way forward? And I, yes, I do believe that's true. I do believe that, that there is a kind of in insipid Gnosticism which is there and the online idea and the kind of transhuman idea is also participating in this kind of weird Gnosticism. Like anybody who talks about the idea of uploading your, your being to a computer is definitely a Gnostic or kind of weird modern version of Gnosticism. And I see it as a danger. Like even myself, I see it as a danger. I'm trying. So I think that the thing to do is to kind of have the Benedict option kind of strategy that Rod Dreher talks about, which is to be deliberate about being involved in your local community. And so I've been really working towards finding more space to kind of be involved in my local parish and a few of the local parishes here and to see how even the things I'm doing on the symbolic world, how they can be helpful to kind of foster, let's say orthodoxy in Quebec and kind of help that in a more grounded way. And so I think that those are the kind of things you have to do. And I mean obviously if you have a family and you have kids, it helps because, you know, you're constantly reminded of this world because you, you're, you have interactions with people. I would say just don't stop having real interactions, real loving interactions with people around you. All right, Nelson? Justin Evans says, I feel uneven, uneasy when I hear people refer to their dogs as their children. It seems that the identity of a human child is being improperly attributed to an animal. There is an attempt to elevate the animal to the level the human. Yes. Is a dog treated like a, like a child, a chimera? Scientists creating chimera through genetic genetics. Can chimeras also be made through improper identity and acts of perception? It has to do with one, it has to do with equality. This is one of the problems of the idea of equality is that the idea of equality kind of infects the mind and then it starts to manifest itself in very strange ways. And so, you know, Plato saw this in the Symposium where Socrates. I think it's Socrates, I think it's Socrates who describes democracy and he talks about how the problem with, with democracy and the idea of equality, one of the fruits of that is, is that people will see, start to see their animals, treat their animals as equal. And you could imagine that, like veganism has something to do with that too. It's like a weird idea that people see themselves kind of at the same level as everything as, as everything. Like everything is just kind of flat. And so I agree, and I think it's also, it's also the fruit of people not having kids. Most people who, who treat their, their animals as children either don't have kids or, or sometimes because animals, a dog especially is absolutely. Most dogs are like more affectionate and more subservient than humans. And so it's a dangerous thing if you try to put all your kind of affection and authority into an animal because it actually will work. The dog will, you know, will be completely dependent on you. And so it can be a temptation for those who don't have children or who maybe don't. Not, I wouldn't say don't like their children or, well, I would say maybe aren't. Aren't willing to put in the effort needed to really connect with your children. So. But I don't have a problem with having a pet. I have a cat. I like my cat, I pet my cat. You know, it's, it's fine, you know, and I, and I don't want a dog, but it's mostly because of the trouble. But I, I have no problem with people who have dogs and, and connect with dogs as well. I would just say it's, it's mostly when people go all, all out and know You. I mean, people know the difference. Like, you know, people who treat their pets as if they're human and if they. As if their pet pets are their. Are their children. So hopefully I'm not offended. All you guys with the dogs. All right, so Blank says, hi, Jonathan, what is the symbolism of smoke, specifically smoking tobacco? You know, I've always wondered if, if. If there's something of smoking which has to do with burning incense. Like, I really, I really wondered if that's not part of its appeal, if there's something really kind of primordial about watching smoke rise up from your own mouth, that it's a kind of something that is so intuitively right, that it will. That, you know, that, that people are attracted to it. You know, I've always wondered about that, but that's usually in terms of smoke, like in terms of burning incense, for example. It really does have to do with this rising up of. Of. Of these rising up of intention up to the heaven, let's say. So it's like an offering up. It goes up to the sky, and it's, it's like a subtle offering because it. You can imagine that you have something physical, and then as you consume it, it becomes subtle, and then it rises up, right? And so you can understand that as stupid as. Right? Like I eat a sandwich, and because I eat the sandwich, then I can concentrate during the day, right? And so you take a physical thing, you consume it somehow, you burn it, you eat it, you know, you. You consume it, and then it becomes more subtle and participates in intelligence, you could say. And so I think that that's what for humans, that. I think that's what smoke has often meant in terms of. Especially the kind of smoke that goes up, the kind of offering of incense and all that. Um, all right, so, Jeff Young. So, Jeff, you have a really long question. I'm going to skip to the question part. So you basically talk about the idea of food, like, what is. What is food? And then you ask me what is eating? So have you written or spoken about this before or know of any other resources you can point me to? So, yes, I did write. I did write a. I did make a video. I think it's called Food Sex and Communion. And, And I go directly into the symbolism of food. So it's quite simple. Like, it's. Food is. Is in terms of being. Food is potentiality. And so you, you gather it, you know, you, you break down the identities of the food into potentiality, and then you bring them to you and you make them Participate in your being, and so they become potential for you. And so in one of the videos too, with my brother on symbolism, I forget which one I did too, he talks about how, like, we are food for cities, let's say, so human beings are the food of cities. And this, the city gives intelligence down back to the people who are being eaten by the city. And so it's like that. It's like you take matter, you put it into you, and then you impose intelligence on it. You impose pattern on it. And so that is really the best way to kind of understand eating in the basic sense. But then there's also another type of eating, which is. Which is actually the idea of the food from heaven. The food from heaven is different. You see that in Scripture, food from heaven is more like seed. And so it's actually getting pattern. And that seems to be more what communion does. Communion actually does. Does both at the same time. Sorry, Communion always does everything. But let's say in Scripture, the idea of like, mana, for example, this like food that comes down from heaven and condenses and is like a kind of a getting of seed or getting a pattern. And so that's a little different from the basic symbolism of eating. All right, so. So Josh the mover says the Orthodox mind seems to have sympathy for Protestantism insofar as Protestantism was protesting the sins of the Roman land church and condemning for them, and condemning and condemnation for them for not returning to the Orthodox Church. It seems that the very spirit of America echoes the Protestant movement in those fundamental motivations. As a Christian, Given the responsibility to be patriotic and loyal to one's nation, I don't want to fall into the pessimism of those who endemically, univocally call America the new Babylon. Is there any hope for America? Our current spiral seems to look a lot like what led up to Russia's revolution. But at least it had an Orthodox memory, which America has never had. Can Christianity still resurrect in a land that hasn't properly imitated Christ? So the answer is yes, Christianity can resurrect in a land that hasn't properly imitated Christ, just like Christianity rose in Rome or in Armenia or in all these places where it rose. And so I would say to be very careful. To be very careful that like Orthodox, the Orthodox who, who want to rebel against the American leadership, because American leadership is not Orthodox. This is a. This is, to me is. Is a. They're being extremely Protestant when they do that. It's like you're called to submit to your authorities, you know, insofar as they don't ask you to do something which is contradictory due to the teaching of Christ. And that's it. You know, the Christians who were in Rome and were worshiping and who were not worshiping, they weren't worshiping who were obeying Nero, who was the worst, most decadent, disgusting emperor that ever existed and who persecuted them, but they would still not feel like it was their role to break the rules or to kind of. To be these kind of political dissidents. And so that's what I think I don't. Not a big fan of, but I mean, I also think that America is the new Babylon, but I still think that you need to obey your authority. So just like the Christians obeyed the authority in Rome at the time when Rome was the Babylon. So. Okay, all right, so we are done with the symbolic world. So let's go into Patreon. Okay, so Neil degrade our man. Neil the Great. Are you there in the, in the, in the chat? I think he's probably not there in the chat because Neil, this is. Neil is the, the singer from Dirt Poor Robbins. And he's actually working on a really great little movie that he's working on. And, and I had the chance to kind of participate in some of the development of the screenplay. Obviously was, was his idea, but he kind of asked me some ideas about symbolism and everything. And it's going to be really good. I'm really excited to see it come out. So Neil asks, I think I speak. And they're also becoming, by the way, Drupal Robbins, I think, has become the official band of the symbolic world. Their last single is called Anthem to the Ends of the World, which is just. It's a great song. Just as a song, it's great. But some of the words in there are just. Are just like. I wish I could have phrased things that way. Let's just say it that way. So Neil says, I think I speak for everyone when I ask what the heck happened to the bow tie. This is the bow tie that, that I wore in Saskatoon. I still have the bow tie. And my, my son is actually probably going to go back to Saskatoon. I promised myself that I would wear the bow tie when I went back to Saskatoon, but because of COVID I haven't gone back. But my son might actually be going there for the summer to kind of work and participate in the great community that's there. And so he said that he is going to, he's going to wear the bow tie so that'd be cool. All right. Okay. So Charlie Longoria asked, how can I explain what an angle is to someone who is technically minded? My fiance is atheistic, agnostic, and I'm about to be Chrismated in the Orthodox Church next month. I. I'm sorry, I don't understand. She came with me a couple services, and she's noticing that orthodoxy very different from other forms of Christianity, and started asking what an angle was in the Orthodox Church. Oh, okay. I was like, you mean angel? I was like, angle, angle. What an angle? Like, especially because you said, how do you. How do you explain an angle to someone who's technically minded? I was like, actually, it's probably pretty simple to explain it to somebody technically minded because an angle is pretty technical. Okay. And so he says, I tried to explain it to her, showing her pics of seraphim and Cheraphim, but I think I ended up sounding mentally ill. All right, so how do you explain an angel to someone who's technically minded? Is that you explain it as the division of labor, if you want to go that way. So you. The military is the best way to explain an angel, which is that, let's say the general gives an order, but that order has implications that have to be worked out. And so those implications get worked out at different levels of a hierarchy by beings who then become the heads of other levels. And so the best way to understand angels is to understand how Moses set up the leadership of Israel with, like, heads of thousands, heads of hundreds, heads of tens. And so that's what angels are, is that they are. They are the distribution of the will of God into a hierarchy of being through beings, down all the way to you. And so the idea is that the way that people have talked about the world before, which is that it's like God and then flat, material, mechanical existence. That's just not the way that Christians have ever understood reality. That's not how any religion, anybody has ever understood reality until very recently. And so we understand reality as a. As a procession, a hierarchy of beings that process from the infinite down into the particular. And above us are angels, and they become messengers because they carry the message of God down to my specific reality, my specific context. And they also have specific functions, let's say, in the. Reigning over the cosmos, in the way that the world works. And. And so that's the only way to. To explain it. And. And I think that some people will really resist to that, especially people that have been used to this idea of, like, God and then everything else Below. But that's really how reality works. And like I said, that's how all organizations end up working. Like an organization that has just a leader and then everybody flat at the bottom, that organization will not work. There's no way that that will work properly. For an organizations to work, you need to have like a president and then vice presidents and then chiefs of departments and so forth and so forth down to the nitty gritty of the organization. And that's also how the world actually works. Not just our organizations, but the organization of the cosmos works that way as well. Okay, okay. So Garrett Widner, Garrett Widner asked what is the symbolism of the vinegar? People are continually offering Christ on the cross. Is this just meant as further insult or is there a deeper meaning or cultural cue I'm missing? Maybe I just don't like vinegar, but I interpret it as offering an intentionally worse version of his gift back to him. You gave us grapes, we made wine and let it go bad. Here you go. So the, so the way to understand it, the thing is that it's hard to talk about the crucifixion because it actually contains so much that it's difficult to completely full fill that. But let's say a way to understand the vinegar has to do with the idea of the end. Has to do the idea of reaching the end. And so the notion is. So you know how you drink beer and at the end of the beer there are the dregs, you know, you drink wine at the bottom, you know, there's. The bitterness is at the bottom. And so vinegar has to do with bitterness. Like this idea of something which is actually not palatable. And so it's a tasting of death is what ultimately I think it means. It means that he's ready to die. And so, and so like, so you can understand that they offer him vinegar in some gospels and he doesn't take it, and then after that they do, and then he dies. And so there's something about that. It has to do with a way to understand. It would be like drinking seawater is something, it would be another way that it could have been manifested, let's say the idea of the Mara, right, The, the bitter waters, the waters of chaos. And so that's what he's drinking. He's, he's, he's drinking the waters of chaos, you could say. And so there's a, there's an irony of course, like everything that happens in the, in the, on the cross is that you could say that he is drinking the bitter waters. And so he's dying. But you could also say that he's drinking the bitter waters and he's actually going to contain them. And so he's actually. So drinking the water, drinking the vinegar as the Logos is akin to filling up death with himself. Right? It's like he's actually taking death into himself and he's containing it. And so that's also kind of like the kind of irony that's happening on the cross across in terms of this idea of. Of the bitterness of the end. So, yeah, okay, so. So Bjorn Olson has a long question, says that he can. I can skip to the second part, so I will do that. Bjorn, Sorry. I can understand what you mean when you talk about the world existing through order, attention, or even hierarchy. But would it truly cease to exist if there were no one who has manifested the Logos to their full capacity? Or do you mean that there would be some kind of downward domino effect where in the event of the saints disappearing, no one would ever be able to reach that level in the hierarchy of the church again? In that matter, making the body of Christ disappear one upper level saints, bishop, priest at a time. I'm not sure I totally understand, so can you please elaborate on this notion? I can't make any sense out of it. And by the way, please bring your conversation and interviews to Spotify. Yes, that is happening, actually. And so. And so the person working with me has found I need to do that. Like there's something I need to do and it's going to work. So that will be happening very soon. So the thing is, one of the problems with these kinds of questions is that speculative questions have no value. This is like. I see this all the time. I see it like, people get caught up by atheists in these kinds of questions where they're like, what if there was a world, you know, where the birds were intelligent and the. The humans were stupid. Now then they ask some moral question based on this speculative, imaginary world. And so it's like the world you describe where it says, where no one has manifested the Logos to their full capacity. That's not going to happen until, if it happens, it's the end of the world. It's like, that's not the world. The world that's. That doesn't. So. But you could. So you could understand it that. Yes, you could understand the idea that as the saints diminish, then the light diminishes, and as the saints, as there are less saints, then at some point the world becomes prone to destruction. And so an image of that of course, the ultimate image is in the story of Sodom and Gomorrah, where it feels like the world is so completely corrupt that, I mean, it's in the time of no as well. So it feels like the world is so completely corrupt that it's going to fall apart, it's going to break apart. There will be. No. Nothing is holding it together. And the way that it's going to manifest itself is all kinds of. In all kinds of ways. Like people will rip each other to shreds, let's say the infrastructure will break down. So think about it this way. So if nobody's manifesting the logos, at least to a certain capacity, then what's the reason to uphold all these things, these dikes, these electrical system? All of these things need truth, need people who are honest and straightforward to hold them. So if nobody is manifesting logos at all, then the world is going to eat us. It's going to eat us by breaking apart, by the house falling down. It's actually going to fall apart. Like it's, It's. So that's the best way I can maybe explain that. I hope that that makes sense. All right, so Keenan Wang asked, how does the idea of sins of the left hand and the right hand relate to the idea that each of us has an angel of the right hand and an angel of the left hand? Smart guy, Keenan. In particular, what is the purpose of the angel of the left hand? The angel of the right hand remind us that we are one with God, while the angel of the left hand reminds us that we're human and separate from. From God, which seems to be both a warning and statement of our purpose as part of creation. So the angel on the left hand is a demon. Like, it's a. It's. They're definitely like angels and demons are the same type of being, but it's important to kind of distinguish them. And so the way that, the way that Father Stephen talked about this, in terms of St. Gregory, I think it was St. Gregory the Great who talks about the angels of the left hand in Job. And so the idea is something like the, the demon, let's say, is. Is helping you despite itself. And so it's, it's. So you can understand it like this. So you could understand it like the temptations you have, they are reminding you of something. And so they, the, the, the temptations and the accusations, they can drag you away, but they can also, if you're attentive, they can also be the sign to kind of turn. To turn the other way as well, to turn the right side towards, towards the divine, let's say. So you know how also this idea that. So, like, I mean, I don't know if you felt like maybe I'm the only one who felt it. Like, if you give in to your passion, like, like you consummate some sin, some excess, some something, then when that happens, there's like a weird moment after that, and there's like a weird moment that you can grab onto and that can actually help you to get better. You know, it's like, you can call it regret, you can call it a kind of sobering, you can call it a kind of little moment of, of being awake, you know, after whatever it is you, you, you've done or what, you know, you, you, you lie, for example. You know, you, you're talking to someone and you lie for no good reason to just make yourself look good or to, to avoid a problem or whatever. And so it's like you lie and then all of a sudden it like hits you. You, you realize that you've lied. And that little moment like that can actually be like a moment of salvation if you grab it, if you catch it and you hold on to, can be of great use to you. And so I think in that sense that's what the demon on the left hand, how it's participating in your salvation. And so I'm not saying that you should sin. Like, I'm not saying you should sin. I'm not saying it's good to sin. Like, please don't think that's what I'm saying. But I'm saying there's something about falling and this little moment of wake up that you get when you give into something and then that can, yeah, that's, that can be a really good, good moment. Yeah. All right, so Walrus King 14 says. Our church tradition teaches us that both the rabbis of Judea and the Church Fathers believe that the seven archangels of Heaven are each charged with protecting one of the known celestial bodies, the Son through Saturn. Do you have any good Christian sources on which Archangel. Archangel is charged with which body? All I can find is confirmation that the Church Fathers did indeed believe this. The only attempts to compare celestial bodies to archangels that I find are in laughably bad occultist block spot post. I'd never, I, I've never thought about that. Like, I've heard that analogy, but I've never thought about identifying the, the angels. And so I would be very careful. But if you do find like a credible source for that, you should send it my way because I'd be interested in seeing if. If there's something you can map onto the celestial bodies in terms of their kind of traditional meaning. Celestial spheres, let's say, in terms of their usual. Their kind of traditional meaning. That'd be really interesting, but I'm afraid I do not know. I've never heard that before. So Mirko says spiders as a symbol in mythic narrative. What do you think about symbolism in dreams? So, I mean, spiders can have several. Several aspects in mythic narratives, but I think that mostly a good way. The negative aspect of the spider, let's say, is usually it's a lot. It seems like more prominent in Western tales at least. And it usually has to do with something like. Like the. Like the dangerous feminine. Right. And so the spider builds a web, actually makes like a home for itself. And it's actually like a. It's actually like a. A traditional structure. It has a hierarchy. Like it's made like a wheel, let's say. But this home is like a trick. And once you. Once you kind of enter into the home, then you realize that you are kind of trapped and you get eaten. So. So I think that that's really like the negative aspect of the. Of the spider. And so what about symbolism and dreams? I mean, I think I've said this often before. I think symbolism in dreams is definitely possible. And I think that it's. That it can. That it can be helpful, but most of the time it's not. And it's most of the time kind of just like a kind of fallen. A kind of gibberish nonsense. So I would just be careful not to be too attentive to that. But if you do get an insight about a dream, then I think that it can be helpful once in a while. But I don't. You know, the church fathers really warn against dreams, even though they do believe that you can have a vision and dream. They believe that, but they warn that it's dangerous to pay too much attention to that. So, all right, so Dorothea asks a question. It says, the Book of Sirach says that a man's wickedness is better than a woman's goodness. Is there any way to explain this further without getting into trouble? So why. So someone actually wrote an answer and says, let's see what they say. So Romeo says, forgive my response. Just putting things in perspective. This is the full verse from Wisdom of Sirach. Do not look upon anyone for beauty and do not sit in the midst of women, for a moth comes out of garments and the evil of a woman comes from a woman. The evil of a man is better than a woman who does what is good, yet brings shame and disgrace. For a moth comes out of garments. And the evil of a woman comes from a woman. The evil of a man is better than a woman who does what is good, yet brings shame and disgrace. I would definitely have to think about that because I don't think I completely understand. I have to think about that. I never thought about it. It's kind of weird. It's a very strange statement. Shows you that I don't read the apocryphal books enough. I probably should read them more because I don't. I don't think I've ever even seen that verse or I know about it. Okay, so Julius Barst asks, my question is about whether the concession of God as perfect stands in opposition to dynamism. In other words, does perfection imply pure stasis? As if not and I assume not, how should one try to think about a non static yet perfect being being? How does one, while saying yes to immutability and changelessness still incorporate the livingness of God as complementary and not opposed his perfection? And so I think that the way to understand it is kind of like the way that you understand the. Understand divinity, understand the Trinity, which is. It's a nepora. I don't know what to tell you. It's like in the world there is both identity and change or identity unity and multiplicity, or identity and dynamism, let's say. And so the way that Christians seem to want to deal with that is to, Is to basically put them up all the way into God in an infinite matter in a way that is not completely resolved in language. It's not completely resolved in, in. In thinking and in. And in Logos, like in, in. In logic, let's say. And so, so it doesn't like there definitely is a sense of, of dynamism in the Trinity, but there's also a, a sense of perfect, you know, unity, let's say, in God and stasis in the sense of, you know, dispassion, right? In the sense that God is not subject to anything but his. That his own inner life, let's say. And so, but they're definitely like, in terms of orthodox Christianity, there isn't the sense that God is, is static and, and the idea that it's all this like this idea of the, like the Monad or the, you know, the, the one only kind of contemplating himself in perfect stasis. That's not the, that's not the vision of, of orthodoxy. And it's also a, it's a problem because when you conceive of God that way, it inevitably at some point leads to the, to the problem of seeing the world as somehow a kind of broken shell or a mistake, or that creation itself is, is somehow a kind of fallen thing or a byproduct or something. So why, Lawrence ask, why is faith associated with salvation? So, because, because salvation first of all happens through trust. And so trust is what makes you move. You could say you need trust in order to be bound to something. And so in order for salvation, in order for you to be healed or to be transformed, you need to trust. Because trust is actually the thing that unites multiplicity together. I mean, you could say love, but faith is another way to kind of understand it that seems to have more to do with intelligence, let's say. And so, so it's like. So you could see it. You could see it. You could see it as, you could see it as a doctor. Right? Even, even in terms of what's happening now with COVID And so a lot of people, let's say, who have a problem with what's going on or have a problem or are doubtful about the vaccine or doubtful about what's happening, it's about trust. It's not about thinking that medicine works or not, or that vaccine works or not. It's about, it's about trusting those that have power and authority and therefore giving myself to them. And so if you want to be healed, then you have to trust Christ. Like, you're not going to follow Christ. You're not going to try to be like him. If you don't trust him, you have to first trust, and then that out of that trust, the fruits of that trust are going to manifest themselves. But if you, if you try to follow a bunch of rules without trusting the goal or trusting the image that you're, that you're imitating, then it's not going to give you anything. You actually have to trust. That's how reality. That's one of the ways reality holds together. So I hope this makes sense. So Blake Payne says. Hi, my name is Cuthbert. I'm using my parents Patreon to post. Well, thankful to your parents to, to let your. To. To let you post. I'm fascinated by the symbolism of yin and yang. Is it accurate? I've heard a critique from a friend saying it overemphasizes the need for evil in the grand narrative as a necessary and equal opposing force. That if good gets too strong, evil must rise to meet, to keep a balance. She said it was Manicheistic. I can understand it. In terms of the balance of chaos and order. Are those uniquely different classifications than good and evil? Yes, I think you're totally right. I think that it's, I think that seeing it as good and evil or simply as good and evil is definitely a problem. The Yin Yang is, The Yin Yang is, is. It's just opposites. And so it's like heaven and earth. The idea that the world, the motor of the world is opposite, but the, the, it's not Maniche, it's not Manichean in, in several ways. One is that it shows that the motor of the one is the other. And so that's why there's a dot in the black, but there's a white dot in the black part and there's a black dot in the white part because it's showing how the, the relationship of opposites is actually a kind of co. Mutual, mutual relationship where one makes the other exist in this kind of dynamic unity. And, and one of the things that people forget is that the Yin Yang is a circle. It's in a circle. So you can understand it as just pure duality, but it's not pure duality because it's actually united together in a circular shape. So the unity of the Yin Yang symbol appears in its circular form and then within that unity you see the basic duality of heaven and earth kind of play itself out. And so eventually, least that's how I understand it. And, and I don't. I think the Yin Yang symbol is great. I don't have a problem with it. I think it's a quite, it's a quite powerful, it's a quite powerful image and it's, it's actually surprisingly universal. They. I've seen, I've actually seen versions of it, like ancient, they found these, like ancient, these ancient bowls that had Yin Yang symbols in Europe, you know, from like thousands and thousands of years ago. So I think it's a, I think it's a good symbol. You know, I wouldn't like. I think it's good, but it's not ours in the sense that it's. You can think, meditate on it, you can think about it. But like, I would be very wary if someone put a Yin Yang symbol in a church and tried to justify that to me. I'd be like, ah, you know what, that's not a good idea. Let's not do that. Let's just, let's just follow our own tradition, follow our own kind of, you know, it's not, that wasn't really. It's not a symbol that was given to us within the Christian tradition. But it, I think it has a lot of insight to offer now nonetheless. So G. Garcia says, I just wanted to mention psychopaths to increase the demand for anime analysis. It's like the modern Brave New World, but its own thing. I will see that if I ever make an analysis of an anime, it's going to be Attack on Titan because it's the only one that I'm watching. But very slowly, let's say, I think, you know, it's like I'm watching like two. One episode a week or something. Like two episodes a week. So it's not, it's not. Not going fast. All right. So Jason Lindsay asks, hey, Jonathan, what do you think is the solution to the problem of hybridization now that it seems like it's here to stay? Is there any way to channel hybridization into something good or like the Old Testament stories, is the real solution to completely destroy the hybrid monsters and stop mixing? As someone who has been obsessed and fascinated with hybrids for most of his life and has come to realize the existence of substantial danger of their existence, I'm really seeking an answer to this problem that does not result in accelerating it. So, okay, so hybrids exist like they, they, they, they, they exist. They've always existed. There are hybrids in the sense of, we have mules, you know, mules are, are, are hybrids. And so there a kind of hybridity. And so, and hybridity has a function. Like the, like the gargoyles have a function. They have a function in a way. Like the cherub has a function. That is the hybrid manifests the edge. It manifests the limit. So hybrids have a function. St Christopher stands on the side of the river and crosses people over. That's what the hybrid does. It's like a, it's a, it's a, it can act as a, as a buffer between two identities, right? So, you know, it's not, it's not, it's not, you know, it's like you have a, you have a country or you have a tribe, like, say a country or an empire. Say you have the Roman Empire, you have the Persian Empire. And in between, somewhere where they touch, people are going to intermarry and it's going to be. They won't know exactly which side they're on. They're going to be a mix of virgin and Roman. And that happens just naturally to show the limit right on the limit is our hybrids. Now the problem with what's going on now is two things. One is the fascination with hybrids. That is the wanting to make hybrids, the central thing we're attentive to. So hybridity has become the main narrative of the story. And it seemed, it's we. People act as if it's not an accident that happens due to identities. And so you can. So hybridization is something which happens naturally when two identities encounter each other somehow. But they see it as a value in itself and almost like as a virtue. And this is like weird. And you see it like, you pay attention, you'll see it like there. People act as if hybridization is a virtue. Virtue. And this is not. This is the problem. That's one. The second is the desire to make human hybrids, the desire to hybridize the human. And so what does that mean? That means bringing the hybrid into the intelligent space. It's like, it's like it really is then become the ultimate symbol of the, of the end. Because it's like, it's like it's the abomination in the holy of holies, right? It's bringing the abomination into the highest place. And so trying to make human hybrids is the ultimate tool for the destruction of our world. Like it's. If that starts to really manifest itself, it's going to be. It's. It's like you're going to count the days, people. It's going to be. It's going to be. That's it, you know. All right, so Angel Terpstra says, hey, Jonathan, I got a question. On your video on the symbolism conspiracy theory, you state that as Christianity falls away, infanticide and suicide of the elderly will appear. You maybe go into this and how it is related to pagan culture. And so, I mean, ancient cultures in different ways. So, so different practices. Like the Romans practice infanticide. The, the, the, the Scandinavians tend to practice a kind of elderly suicide or, or way to get rid of your elderly. And the Christianity sees in each person a manifestation of the Logos and sees also. It's like, this is why I say it's kind of like the proper hierarchy. So it's in its proper hierarchy, it tends to want to recognize even in the smallest thing, the seed of the Logos. And so that's why Christ says things like, you know, if you help the littlest of these, then I. You're helping me. Because it's harder. It's harder for most people to see, let's say God or the will of God. In that which is lower, that which is, which is not. In the prime of life, let's say in the prime of energy. And paganism, like I would say a lot of the paganisms, they, they worship the prime. Prime energy. You know, it's, it's. And you see it even in the neo pagans, right? They have this, they have a. They have the kind of worship strength and this, the kind of vivaciousness and this kind of, this kind of spirit of, of youth and of, you know, of energy. But that's, that, that has a problem because you're gonna die. Like, you're gonna get old. Everybody does. And so you have to actually be able to deal with the, with the, you have to be able to deal with that in a normal way. And so Christianity has the idea of caring for the weak, caring for those that are. Recognizing that they're weak. It's not like you're gonna make an infant. It's not like you, you understand that the elderly are weak and that they're approaching death. But there is a way in which there is a career for them. And so, but as Christianity falls away, it's just going to happen. It's already happening. I mean, infanticide, I think that even, even now it's just abortion, but I think that infanticide is just around the corner. And it's not going to be, it's, it's not going to take a lot of time because it. Before it becomes, if not officially accepted, then at least kind of, let's say, tacitly accepted. And same thing for the elderly. And so we're going to see, we're going to see a, we're going to see systems to make people feel like they, they've lived their lives. Now it's time to check out, and it's going to happen more and more. It's already, it's already there. So. All right, so. Hi, Jonathan. I'm struggling to see will and volition in the forms of things that aren't specifically related to personhood. What is the will and volition of the angel of the Cup? All right, I will humor you. I would say don't pay too much attention to the angel of the Cup. It's probably not worth your attention, but I mean, the will of the angel of the cup is that, that you have a good cup. It's not any more than that. It's not about, it's, it's just, it's just that the, the, the, the principle that is ruling the cup is that it be a good cup. You know, in the characteristics of the, of what a cup is. That's the cat's about as good as I'm gonna get for an answer on that. All right, so Norm Gulne says, I'm wondering if you could explore the connection between God instructing Moses to leave tassels on garments to serve as a reminder to follow his commands, and the fringe as a necessary remainder or something unaccounted for. In what ways is the margin allied to remembering rather than forgetting? And so you could understand that the fringe is a reminder of the multiplicity or the fragmentation. So when you see a fringe on investment, it reminds you of your own fringe. It reminds you of your own capacity to kind of fall into that breakdown. And so in that sense, the fringe acts as a frame for the order and it acts as a remainder that you reach the edge of the order. And so it can be the freak. The freak will remind you of what is normal, just like the fringe will remind you of the importance of the order of the vestment. And so because you won't take it for granted and so to leave a fringe can help you remember order. It can help you kind of understand the reason for order because you see what happens when it's not. When it kind of starts to fall apart. So Jason Gadawaltz asks, what is the symbolism of 11? I know, like, I don't think I, I understand that well enough. I know why you're asking and also because of the, the, the. The 666 Magic Square has. Has 11. 6 times 11. But I don't think I. People have tried to explain it to me, like mature would probably understand this way more. Like he, he would probably have a much better understanding of this and he could probably tell you. But I'm afraid that I'm not going to be. Have a good answer for that. For that. Sorry. All right, so Stephen Bishop asks, what does it mean that icons of Christ in Gethsemane often depict him without his outer garment? There seems to be a strong parallel without between Gethsemane and Sinai as Christ goes further up the mountain, leaving behind more and more disciples, just as Moses does. And also the Dnic mountain as Christ moves more clothing and closer he gets to the cross, reversing the, the garments of skin, etc. Am I seeing this correctly? I think you're right. I think that, that, that. But I think that it's two things. I think that it is on the one hand, and it's funny because after that Steve asked and if so, how does the Color symbolism of his garments play into it. Blue being his divinity and red being his humanity and iconographic color theory. So, yeah, so see, he's going to that, that like he's going to that. That definition that I told you about, which is the idea of blue as divinity and red as humanity that we talked about with the blue, red and red, blue with the Virgin. I kind of get it. I'm not totally sure about that. Okay, so let's say in terms of removing the garments, I think that it has to do with crucifixion. It has to do with Christ also accepting his crucifixion. So it makes sense that he would remove his garments in the sense of going up the mountain to Eden, like you said. But I think there's also something about trying to call to his crucifixion. But it's funny that I've never even noticed that I would have to look at those icons because it's like I never noticed that Christ isn't wearing his outer garment in that icon. So if that's true, you've like, taught me something really cool. I need to. Need to look into that. All right. Swords into Plowshares. Asks Jonathan, how does an understanding of the meaning of facing time in the fall alongside the meaning of an unprepared approach to knowledge of opposites, relate with the non. Dualism of the super cosmic, super cosmic absolute facing time in the fall? Well, I mean, I'm not sure I totally understand your question, but if, If I think I understand it, there's a sense in which duality is part of the world, right? Not dualism in the sense of, of like this, the. This, like inseparable. Like this. These absolute opposites. Let's say kind of like Manichaeism, like we talked about before. But duality is the motor of manifestation. That's why God creates heaven and earth and creates these two basic categories. And then, then it's like a. It's like a. It's like a one and a zero, right? It's the motor of reality. It's like on, off, on, off, on off. That's how a motor works. And so reality. That's how reality works too. It has like a. It has two modes, like two opposites. And then within those opposites, then, then that's how reality manifests itself. And so, but the idea is that of course that is not absolute. Like the absolute is beyond those opposites and is actually non dual. But, but duality is real. It's not a. It's not an illusion, the way that a lot of people tend to think about. I don't, I don't really dislike that. And so, and so you could say that the saint, Saint Ephraim the Syrian has a wonderful image of that in the, in the hymns to paradise where he says that if Adam and Eve had waited to receive the fruit from God rather than take it for themselves, themselves, then they would have seen sickness as someone who is healthy, but because they took the fruit for themselves, then they saw health as someone who is sick. Right? So it's like you could understand that if we had taken the fruit in the proper manner, then duality becomes an expression of, of something above it. But when you fall into duality, then you get trapped in these opposites and you get trapped in this, like, in a sense that inside, outside, you know how as soon as Adam falls, what does he do? He like blames Eve, right? He just like it's her. And so right away you see this, like this inside, outside. What does he do? He's afraid because he's naked. He realizes he sees now the world outside of him as dangerous right away. And so he's, he's, he's a slave of the, of the duality. He's already become a slave of duality because he sees the difference between inside and outside as completely, as an absolute state. And so that's the difference. That's the, that's the difference. But I mean, I say that, but it's like, it's not like I live in a non dual, continual non dual realization. So it's not like I, I completely understand it. We have glimpses of it, you know, so doggy boy says, I remember somewhere you talk about the symbolism, I think a baptismal font, how heaven is and earth is represented like a square base and a round top. No, that would not be a baptismal font. That would be a church, like a traditional Orthodox church. So it's evident that we're such a fractured moment in time that we explicitly talk about symbolism rather than just living it. Does this mean that in the designing of objects of worship, we're doomed to copy from specific periods where the symbolic intuition was more or less still intact? At least until we cultivate a more felt sense of the symbolic world. Were things more coherent in the past, and thus you can point to a chair and say, that's Jacobean. Whereas in the future no one would be able to point to anything from this moment and identify as such. I'm an apprentice food furniture maker and is wondering as an artist if you have any advice or sources that one can use to get a better understanding of this stuff, ornamentation and symbolic design elements, etc. Well, I mean, I think that on the first hand, like the difference between the relationship between a church being a dome on a square, let's say, and the style of a chair is quite different. And so there is in church architecture, for example, like in orthodox church architecture is like a basic pattern. And then within that basic parent there's also variability. And that variability is actually a function of the world. It's a function of multiplicity existing within unity. And so it doesn't mean that every church has to be a copy of every other church. The difference between a basic structure which is like a dome on a square and the style of a chair is quite different. And so a chair needs, you can see it this way. Like a chair has to have a balance for it to exist. Like it has to have four legs and let's say a back and armrests. Like these are things that a chair has. And depending what, like, obviously a more formal chair will have armrests. A less formal chair won't necessarily have armrests. You know, there'll be elements which will naturally be derived from what the purpose of the chair is. Like if it's supposed to be a camping chair, then obviously a lot of things can go in terms of the formality of the chair or the solidity, the stability. All of this is going to inform design. And so design is, it should be purpose driven. Like if you want to make a chair that will be in a waiting room for a, for in a medical establishment, and that chair will be different from a chair you make for a dining table. And even in terms of dining tables, one chair will be a chair that's made for like the table you eat around breakfast, like a little table that's in the kitchen and your actual table where you receive people, let's say in your dining room, all of this is what's going to inform the design. And so design should always be purpose oriented. And then you do have something like ornamentation. But ornamentation also has to be kind of like the glory of the chair or the glory that is added to the object. And, and usually that glory will be related to something else, but that's something else which makes sense to you in the sense that that's why let's say certain tribes, certain cultures will develop certain ornamentations. It's not a static thing, it's something with changes. But you'll still be able to recognize, let's say the difference between, let's say Tuareg ornamentation and let's say British ornamentation and in the Baroque period. And so, and so you just have to, there just has to be like a balance. And if you understand what ornament is, then you will also understand its role and you'll, you'll be able to place it properly. So if you have a chair that's too ornament, like let's say you make a super ornamented chair with like frills and gold and all of this, right? And then you, you put it in, in a, like a, like a barbershop. It's going to stay, it's going to be a freak thing, it's going to stand out. So you have to, things have to meet there, there. So if you make a very ornamented chair, you want it to be in a very formal setting and maybe a special chair in a formal setting. So that's kind of the, that's, that's how I see it. I don't know if that makes sense. I hope that makes sense. All right. Okay, so Romeo says, I want to know the symbolism of one sided love. Why would God permit this? And is there a role? Is there a role the one I love ought to play? Saving the girl, saving myself, giving up everything. Divine intervention. Sometimes I feel like I'm in a romance movie. Maybe Forrest Gump, something about Mary. Oh my goodness, this is. This my thorn man. I'm sorry. I was a coward and used to escape from my feelings and understandably no one fell into my lap. But, but since God came into my life, he transformed me and I now feel courageous with expressing my feelings and have, but with no difference. So it seems from my perspective, can symbolic understanding help me see possible paths? Am I a type of fool? Okay, so Romeo, dude, you use the word, use the name Romeo, you're gonna ask a serious question. Don't name yourself Romeo man. All right, so, so this is an, it's very important. Like let's say in terms of love, it says especially in terms of Christian love and especially in the way that you understand how love manifests itself in the church or in the body of Christ. There is proposition and reception. So this is actually true in the like, even in like the liturgy. So you have let's say the priest and then saying the prayer. And then you have the people who say amen, who say yes. And so you need both, you need for sure to have, let's say The, The. You can see it in different ways. You could see it as the man, let's say, proposing, right? Not necessarily proposing to be married, but proposing in general. Would you like to do something with me? Would you, you know, would you like to go out? Would you. We want to have coffee, like. And sometimes it doesn't have to be that much, but it's just like trying to talk to somebody and then watching how they react. And then you have to be attentive to the answer, right? You have to be like, attentive to the yes or the no or the maybe. Sometimes it can be very kind of implicit. But those are the two elements that have to kind of come together in order for union to happen. And it doesn't have to be sentimental all the time. Like we. The love stories. We always see it as like, just kind of like a. Kind of a passion or, or something that is completely sentimental. It doesn't always have to be completely sentimental. Especially as if you, like, if you ever get married and you'll see after a while, then it's not so sentimental anymore at some point just becomes like a. It becomes a more kind of settled union. And it's not as. It's not as. Obviously you don't have all the same butterflies you do, but I would say that that's. That's it. And so what can you do in terms of attracting the other person? And sometimes you can't. Like, sometimes you won't be able to. It's just. That's just how it is. It's a difficult reality. And so that will definitely. That can cause you to suffer. And that suffering, that suffering can be used as fuel if you're, if you're attentive. It can be used as fuel to be. Become a better person. To become a better person in terms. Just to make yourself more desirable to the other, to the opposite sex, but also make. Become a better person in a more spiritual way, you know, where that suffering can actually. That suffering of being rejected in love can become the type of suffering that can actually lead you into more spiritual attention, like more attentive attention. Attention to God and to prayer. And so it's like, I'm not. I don't want to dis. I don't want to just make this sound easy. It's not easy. None of this is easy. But, but, but I, I like. Yeah, that's. That's all I can say. You know, I would say. I would say for sure, for sure. The capacity to, to. To induce or to kind of bring about Desire in. In another person has more to do with you. Like, it has more to do with just. So if you. If you're free and you. And you are confident, not in a. Not in an excessive way, but like, if you have. If you're free and you. And you're confident, you know, and you kind of like what Jordan Peterson says, like you just stand straight and you look in front of you and you. You. You. You kind of go into the world, then that is something that will help to make you more. To make you more desirable. But. But there's no easy. No easy. There's no easy answer. And so. Yeah, and it's the same with the other side. Like, a woman can be. Find. Be attracted to a man and then desire to seduce him, you know, not necessarily in it. Not just like. Not in a. Not in like an explicit, necessarily vulgar way, but in subtle ways to. To kind of attract his attention and to kind of try to get that. That man to give his attention to her. And, And. And that also needs to be reciprocated or else at some point there's a. There's a limit, right? There's a limited. Which you have to kind of say, okay, this isn't gonna. This is gonna work. So, yeah, so good luck. I wish you the best, man. That's. It's a tough time. I understand. All right. So Enrico says there are a lot of numbers that seem to have meaning and are occurring all the time in scriptures. I often skip them and don't pay attention to them. Are there any good authors, book sources that read that, that deal with this? I know there is a lot of numerology and new ages stuff out there. I'm looking for something grounded and within tradition. I don't think. I'm not aware of a book that I would suggest to you that would be like a. Like a reading of numbers in scripture directly. I mean, it's out there, but I don't know if I the know of a book that I can think of like that out of my head. So I'm sorry about that. The problem with a lot of these books on numbers is that a lot of them just kind of. Kind of make it up. And so that's the problem with sometimes people who talk about symbolism is that just because you. Just because people say that something means something doesn't necessarily mean that it does. And so I find very. I'm often very unsatisfied with people who do number interpretations. That's maybe why I don't do it so much in My. On my channel. I mean, I do have. I feel like I have an understanding of. Of certain basic, basic number symbolism. But. Yeah. And so Susan Martin said some very nice things. Thank you, Susan. And then she asked if I read the works of Christopher Alexander, particularly his book A Pattern Language. Look, it is on my list. It definitely. You have. So many people have told me that I need to read that book. And so it's definitely on my list. It's. It's. I haven't, I haven't. It's in my Amazon shopping cart. Let's say I haven't yet gotten it or my. In my wish list or whatever. So, no, I haven't gotten it yet. But a lot of people have told me that I need to read his book. And then someone. And then she says it would be great to maybe having him in a video discussion. I don't know if he's still giving talks. I'm not even sure is he. I don't. Is he is still alive? I don't even know is he. If he's still giving talks, that'd be great. But I have thought that I would probably need to read a few of his books first. But both, like many orthodox people, including Andrew Gould. Who else? There was someone else. Benedict Sheehan. And several people have said, you need to read Christopher Alexander. And today I was actually, I was doing an interview with. With Rafe. What's his last name? He's a. He's a YouTube. He's a YouTuber, but he's also a parkour guy and he was asking me about the same thing. So. Yes. So you guys are all pushing me. I will read Christopher Alexander's book. I just need to find it. I always need to find a PDF version so I can listen to the audio because I don't read anything now that isn't. That isn't audio, pretty much. So. Connor says, when you come across people in the Old Testament who live for hundreds of years. Methuselah lived to 600 969. How are we supposed to understand this? Is it to be taken literally, symbolically, or a combination of the two? Did mankind lose the grace of such longevity at any particular point in history? I don't know what to tell you. It's like I would just take it for what's there. It's, you know, it's. The narrative seems to imply that there's a difference between before the flood and after the flood. And one of those differences is that people would edge up to a thousand years. And so you can see how that is extremely symbolic because a thousand years is kind of like plenitude. And so you can see how nobody reaches a thousand and everybody comes close to a thousand. So you can imagine that it's a sign of the fall, the fact that they don't go up to a thousand. They come close, but they don't. And so it's a sign of the fall, which then is increased in after the flood, where the, where life is shortened, far, far more shortened. And so you can see it as a continuation of the, of the, of the fall into the second stage. You could say. And so you could understand that, let's say when in Revelation it says, you know, that Christ will reign for a thousand years. That's what it's talking about. This is what. It's the type of symbolism that it's alluding to in the Old Testament, which is that. That. That men came closer to living for the millennium, but they didn't quite make it. So that's, that's what I think. So Scotty Thorpe asked, what is the symbolism of a light bulb? Why do we use it as an inter. Representation of an idea subtly asking about the noose? Yes. Well, I mean, yeah, that's what it is. It's like, you're right. Why do we see it as a representation of an idea is because that's how we experience having an idea or an insight. You know, we even say insight. It's like this idea of a seeing in or this flash. We experience it as a flash, as a spark, as a. As a glowing. They're. They're all. And light is definitely one of the greatest ways to represent that. And so the idea of the light bulb appearing above the head is pure genius. There's that. You know, it's so funny that I'm going to say this, but like cartoons, especially like the early cartoons, kind of like Looney Tunes cartoons and those, those kind of early cartoons, they're actually quite. There's a lot of symbolism in there and a lot of it. A lot of the tropes that were developed in those times, like that, for example, like a light bulb appearing above the head or, you know, these, These kinds of. Of tropes are really quite powerful in terms of. In terms of symbolism. Like even, you know, the angel on the. On the one shoulder and the devil on the other soldier, that really took a lot of. That really kind of took shape in these old cartoons. Yeah, there's quite a bit in there to think about. It'd be interesting to. To think about that. More. So Mika Mueller asked, what is the symbolism of psychedelics? I'm gonna start getting those questions all the time. Is this a totally new thing or an old battle we have forgotten? And you recommended orthodox reading on the matter would be greatly appreciated. And so it's like what's the symbol of psychedelics? It's, it's, it's pharmakeya. It's, it's related to, it's related to, to, to, to kind of to magic and to, you know, it's like I, how can I say it? It's like, I mean, if you listen to my videos recently, you'll see that I, I don't want to speak out, I don't want to speak against it completely because I have met people that have said they have in psychedelics kind of was a transition for them towards, towards the spiritual life. And so, so I could, I don't want to knock, knock it completely in the sense that I understand how people who are completely materialist could be jolted into seeing something more through this type of experience. But what I'm seeing happen now is rather people who see psychedelics as a, as spirituality itself or they see psychedelics as a kind of solution to the problem of meaning, or they see psychedelics as something which will bring about a spiritual transformation in the world. And if that's the case, then I would say absolutely not. I don't think that, that, that it will do that at all. It will participate in the breakdown is what it's going to do. Just like it did in the 1960s which brought about more chaos, more breakdown. Because if it's true that psychedelics can connect you to the invisible patterns or to the invisible world, then if you do that without being initiated, without being ready, then you won't, you won't be able to distinguish what you're seeing. Because in the world of patterns is also all the monsters are all there too, all the gargoyles. And so you go into a, if you take a psychedelic and then you, you end up facing a gargoyle but you don't, you don't have the capacity to differentiate an angel from a demon. And you, and you, and so you just go there wide eyed like a moron and then you end up having a massively bad influence, an intelligence impregnate, you know, kind of print itself on you in a, in a negative way. And so, so it's like I said, I, that's why I'm always careful not to like knock it completely because I, you know, like, who am I to say. And I also know that like I really have met people who have been, have had their first step on the road was through that type of experience. But like I said, I don't definitely don't see it. Anybody who talks to you in a way that they seem to speak as if this is some kind of solution to the problem, that's the wrong way to go about it. It's the wrong way. All right. So Chandler Turner says, what is the proper role of gnosis? I found that my spiritual but not religious peers are often seeking experience, whether through movement, practice, substances or meditation. I see in the world and feel in myself a hunger for this, but I don't know what its proper place is. So one of the, one of the funny things in terms of Gnosis is that Saint Irenaeus of Leon wrote a book, a famous book against the Gnostics. And his book is actually called, it's like treaties against the so called Gnostics. Because the contention of St. Irenaeus is that Christians are the true Gnostics. Christianity is true Gnosis because gnosis in a, in a Christian sense is an integration. And so knowledge in the biblical sense is like a sexual union. It's a meeting of heaven and earth. Whereas the Gnostics in the ancient sense had an idea that it's like an escape of reality. So you actually like escape, you have to escape your body, you have to escape reality, but you have to kind of rise up above it. And that is kind of, that is not at all what the Christians believe. And so the idea of, of seeking experience, you shouldn't be seeking experience, you should be seeking transformation and transformation. There'll be experiences that will come with that transformation. But the experiences are like, are these fleeting things that you can have and they'll go away. And if they don't lead, if spiritual experiences don't lead to transformation, then they're hogwash. Then they're, they're, they're nothing. But if you have little insights, little experiences in prayer or in practices and those, those experiences lead you towards deep, more towards transformation, to become a better person, to be, to be less prone to fall into your passions, into your, your desires, and that's the, that's the real beginning of a, of a path. And so I feel like a lot of people, especially like again with the psychedelics is like people are just looking to get the, the, the experience and they don't necessarily then embody, they don't embody a transformational path. And like I said, I've met people that have, and, and that's amazing when, if that, if that happens, like whatever brings you to, to, to, to actually look to Christ and to, to, to be transformed. And that's wonderful. But yeah, so I don't, I'm not. Most of the church fathers really speak very negatively about experience, nonetheless recognizing that experience is part of it. Like that saints have mystical experiences, they have states of ecstasy. All of this happens to the saints, but that's not what they're looking for. They're looking to be transformed and in love into the person of Christ. So. All right, all right, so we're done with Patreon. And so I'm going to go into subscribestar. So look at me, I started at 8, I'm gonna still finish at 11 is what's gonna happen. It's gonna be. Just gonna be a longer Q A is what's gonna happen. So. So XRD asks. An idea struck me while listening to your talk with Paul Kingsnorth. The enlightenment has been like Adam and Eve eating the fruit on a societal scale. Society was promised that reason would make us good without God. Yes, exactly. Comparable to the snake's promise of godhood. And since then we've been stuck in a further protracted fall with smaller falls within communism, sexual revolution, etc. Any thoughts of that? Yes, you're completely right. Your insight is absolutely straight on. It's, that's exactly what it is. And you could say that, let's say the, the pride in the garden, because it's a sin of pride that is happening. Right? The desire to take the fruit for yourself is also the pride of man in the enlightenment, you know, and it's like it, it's, it's tricky for people to understand because yes, like the human person is the jewel of creation and God made us into the highest aspect of creation. But it's something that we receive and it's something that we have to not take for ourselves or to kind of sit on our own, to sit on that reality and to think that that's the, the totality of everything. Because then that's the fall. That's always the fall. And, and you're right. And so you can see how it's funny because you see it like if you listen to, if you watch, if you read like Steven Pinker and all these people, I love how they talk about the counter enlightenment. I just love it because it's like there's the enlightenment and then there's the counter enlightenment. They don't realize how the entering into the duality Is what gave those two at the same time. Like one is a mirror of the other. You can't have one without the other. You can't have enlightenment without the dark side, let's say so. Especially in the way they phrase enlightenment, like this reason. Reason as light. And so here comes the dark side. Anyways, so that's kind of funny. All right, so we are, we are actually done with all the questions. Let me go into the super chats. Like, never ready for this, for the super chats. I always almost like, forget how, how to get into them. All right, here we go. Okay. Whoa. There are a lot of super chats. Oh my goodness. Did I just have a southern accent there? Okay, so here we go. So here we go. Steve, Steve. Steve Bedford for 5 USD. Thank you for your work. Jonathan, could you explain the symbolism of why only men can be priests? So you guys have to also not, not try not to put in the questions, like during the question period. That doesn't work really well. Okay, so could you explain the symbolism of why only men could. Can be priests? And so it has to do with the. It's a cosmic structure. So you understand that there's a function, like there's a function of male, of masculine and feminine. And it's akin to heaven and earth. And so there's a series of analogies that play themselves out. And so the priest in the analogy, let's say. So you think about it this way. You have heaven and earth, and then you have like God and the temple. Let's think about it in the Old Testament, if it may be easier for you. So you have God and the temple, and then you have the glory of God and the ark of the covenant. And then you have the ark of the covenant and the priest. And then you have the priest and the people, right? And so these are all masculine, feminine relationships all the way through. So you have God, you have, say God in all of creation. Then you have like heaven and earth or God manifesting himself towards. In God in heaven, manifesting himself towards the earth, then the temple. Again this dual relationship. Then the glory on the ark, male, female, then the ark, or the glory and the ark together towards the priest, male, female. Then the priest turns, become. Is male towards the people. And then the people are feminine. Okay? And so, and so the role of the priest, like in. Incarnated in the, in the, in the. Is masculine. And so because of that, then priests are masculine and the, the people or the, they, we, those, we play a, a feminine role in receiving and that becomes more Feminine. But then it, it keeps playing itself out, like in a family. Father, wife, you know, husband, wife, husband, wife and kids. You know, all of this keeps playing out. But it's, it's like, it's, it's that masculine and feminine are not, it's not a moral question. It's a, it's a structural reality that, that's how it works. And this is a structural reality which was carried into Christianity. So it's not just like people say, it's just a cultural thing. It's just, it's just, you know, it's not just a cultural thing. It's a structural, symbolic, cosmic structure. And so then, so it's not about. So it's like. So Christians have always believed that men and women are equal, let's say equal in value or equal in nature. But they do play a different role in structurally. And that different role structurally has a form. And that's it. That's the form that it plays. That's as good as it's going to get for me. So Louis Girard says, why did David slay Goliath with a sling instead of a sword or a spear? It has. So he actually did, he did, did a few things. He did. He actually also killed Goliath in part with a sword. But let's talk about the sling first. So the sling has to do with, so the sling has to do with something like using the margin against the T itself. And so, you know, I talk about this idea of like the, the, the monster on the edge. And David is also that, but in a different. Has a different type of symbolism to that. David is the youngest son. He's the last son. He's little, he's small. And so, so Goliath is big. And so there's something about that. So what he does is he takes these rocks and he puts them in a sling and he turns them, right? And so he spins and now the rock is on the edge. Right. It's, it's, it's like turn using the power of the periphery. And then finally the one that gets, that gets lost, like, like breaks free, goes off and then, then kills the, kills the, the giant. And so it, it's something about using the periphery against itself. Something about turning the, turning the. You know, I talk about how King David also has something of the fool who becomes king. And so there's something of that in what he's doing using this, this sling movement. And, and, and yeah, there's something about that. Okay, so John Schultz Barnes for 10 USD says I'm pressured to work to get the vaccine, man. Any advice on what to say to employees to explain 666 related reservations without sign? Sounding crazy, man. I don't know. I don't know what to say. It's, it's very, it's, it's tough. You're in a tough situation. I don't have like a, I don't have a straight up solution for you. I would say I don't think, like, this is something some people will disagree with me and like, I really don't think that, that the vaccine right now, the way it's presented to us is like, is exactly the mark of the Beast or something like that. That I think it's heading in that direction. I think that we're heading in that direction, but I don't think it's there quite yet. And so that's something to think about. And so I am definitely like, I can tell you guys here I am going to wait as much as possible and avoid it as much as possible and watch as much as possible. Just watch and see what happens and see how it plays out. But I don't. So that's all I can tell you. And so I don't know how. I wouldn't know. I don't. Not sure how I'd react to, to the situation, but. Sorry, you're in that, man. I'm going to, I'm going to put out my videos. Like the videos that I'm going to put out in the next, the next two videos are going to be trying to help people figure out that the relationship between, between the mark, the mark of Cain, the mark of the Beast, and the, the medical situation, like in terms of the idea of, of a poison that is a cure or the, the idea of a vaccine too. So I'm going to talk about that, but it's not. Yeah, man. All right, so Alex, Kara says sorry about my tech failure for $20. He says that. I'm so sorry. No worries, man. We, we got better now. Like now we had the actual microphone, which is much better. So, Grummeister, for $10 Australian, what is the symbolism of good omens? It seems to be something to do with no heaven and hell being a good thing. But I can't figure out. Oh, what you mean good omens? Like the, the, the series, the, the TV series. So, okay, so I can tell you what I think Gaiman was trying to do because I did watch Good Omens. I, I think what Gaiman tried to do in Good Omens was to, to resolve Opposites. That's what he was hoping to do. So you see, because you see it play out at different levels. You see how there's a. There's a sense in which. So if you understand. If you understand the angels, if you understand the characters is not necessarily angels or demons, but if you understand the characters and the way they present themselves, which is the angel as like a goody two shoes, that is like a fop. You know, it's kind of like is. Is not. Is not embodied. You know, it's just. Is a. Is kind of a. Yeah, it's a fop. I don't know what else to say. That's what he's like. And then this, like, kind of bad embodied, you know, let's say more rebellious type. And so it seems like what he's trying to do is to show how to kind of how those two can work on each other in order to come closer to the middle. And so he seems to play that all through the series. And he also seems to do it with the idea of like the witch hunter and the witch who actually kind of fall in love. And you can see it at different levels, how this. This kind of plays out. But. But ultimately, you know, I think that just like so many things, so many. Some of this stuff is that obviously, because it is dealing with heaven and hell and angels and demons, it is just like all of Gaiman's work. Let me tell you what the problem with Gaiman's work is, is that he acts as if he believes in principalities, but he doesn't. He thinks principalities are arbitrary. He doesn't actually think that the Lord of Dream is the Lord of Dreams. He thinks the Lord of Dreams is just some guy who happens to be the Lord of Dreams and he could change, like, he could be something else. He could be free from his own principality. It's like you could see it in the image of Lucifer, like his image of Lucifer. Gaiman's image of Lucifer is the most. Is the most absurd idea, right? It's like Lucifer decides that he's done with this and he's going to cut his wings off and he's going to be free from his own cosmic role. And it's like that's what Gaiman's work, all of his work is about. It's. He's a. He's a. He's a. He's a. He's a postmodern guy. He's a. He's a modern guy. He doesn't. He's a materialist, actually. He's a, he's a revolutionary. He's all that stuff. He doesn't believe that these principalities are real. And so, and so his work is fascinating because he seems to have a, he has some insights. Like sometimes I think that he has some good insights, but in the end those fall apart because he, he wants to treat principalities as idiosyncrasies, as idiosyncratic beings that somehow happen to be that. And it doesn't work. It sometimes makes for, for interesting stories, but it doesn't, it ends up falling apart. And so, so, yeah, sorry, I didn't expect me to myself to, like, go on a rant against Neil Gaiman. He's, he's still, like, his story's still, like, you can see. Like, I, I, I have read American Gods and I have watched Good Omens and I've read the Sandman series. So it's not like I'm, obviously, I have like, a weird attraction to what he's doing because I feel like he could come close to something, but he, he never really does. He just comes up to it and then here comes the materialist. Like, here comes the, Here comes the arbitrary nihilist in the story. So. Yeah. All right, all right. So how would you differentiate meekness versus being cowardly and weak? I've always had a problem with the word meek. I mean, I can't. How can I say this? It's like, I can't, I can't. You can know in yourself. That's the only way you can know, right? You can know in yourself if you're attentive. You have to be honest with yourself and be attentive to yourself. You can see whether or not you're acting out of, out of meekness or out of cowardice. It's, it feels very different when you do one or another. All right, so Mibla says, I recall hearing that a big influence on your wife, coming closer to Christ was the movie Braveheart. Could you expand on that? Love that movie. So, I mean, in the case of my wife, I think that what made her, would make Braveheart kind of part of her spiritual path was how she saw that Braveheart, that the, the, that William Wallace was completely dedicated to what he was doing and was willing to suffer for what he believed and what he, you know, what he wanted in. And he submitted himself to a higher goal. And so it's like that higher goal wasn't God, but you can kind of transpose that and understand how we compromise all the time. You know, be, you know, in our faith and we compromise for this dumbest reason. Whereas you. You can see in Braveheart this capacity to be fully given and dedicated. And I think that's what really touched her. Okay, so John Schultz Barnes says for $10. Any advice for someone? I think he just asked that question about the, The. The vaccine. Yeah, sorry. Maybe I'm. I'm like reading the same questions twice. Gabriel Torres says, to your knowledge, is there any symbolic meaning attributed to dead birds? I mean, it depends. Like, I know what. If I had a dead. If I would put a dead bird in a story, I would know what that would mean. It would mean like something like a. Like a fallen principality, you know, or like a. A failed principality. Like, if I put a bird. Dead bird in a story, that's what. That's what I would be alluding to. Like, it depends. Like, you could also imagine, like, let's say, shooting a bird, like, with a. With a gun, with an arrow. Could be. Yeah. Could be seen like a kind of. Like a kind of revolution or something in a story. I think I'm being confused in my. In the way that I'm doing this. Okay, so Alex Caris Vitalis says, I'm sorry about the mic failure. No worries, it's fine. V2 Zooey for 10 CHF says, I struggle to understand why you think the Christian story is inevitable. The world makes as much sense if we posit God's existence, but without positing the incarnation, the meaning would still be there. So there are two things. Like, I would say that when I say that, usually I do say that post incarnation is that once the incarnation has happened, the Christian story becomes inevitable. And this kind of plays itself out, especially in the west, where we have no other story. And so there nothing has happened. It's like we're waiting for the return of Christ. You could say so in this. In the Christian story. This is actually one of the great things about the Christian story, that in the Christian story, it sets up a pattern in which it tells you what the next thing is. Like, it tells you what's the next thing that has to happen for the story to change. And now. And so it actually sets that up. It's like it says. Because the thing about it, about the story you live in, is that you're not completely in control of it. Things have to happen. Like, things happen. People appear on the horizon. Like, someone has to come up. And so it's like you could say, for example, like, you could say. Like, you could say something like, what America needs to do is to change this or that or change this or that or change this or that. But unless there's someone who comes up, who rises up and has the presence and the authority and the influence to bring about that change, then you can blah, blah, blah all you want. It's not going to happen. And so imagine now that for the biggest story ever is you can say, well, we don't need Jesus. We could kind of get around him. We could do other things, but that's the story you've got. And so unless Antichrist comes and Christ comes back in the total way or in a small way, that's the story we're in. There is no other story that you can really participate in. It's like. It's almost like what I'm telling you is so immediate that I'm not sure everybody really gets it. It's like. It's as simple as saying that you could like the story of Harry Potter better than your life. You could think it would be great if you could live in Harry Potter land where you would go to Hogwarts and be. And become one of the students there. But that's not your life. That's not your story. You're in a story. You're in. There is a story happening. And even if you can try to like, try to imagine that you would like something else to be true, that's not what's there. And so, yeah, so I don't know, like to me, to me, I feel, I feel when I talk about this, like I said, is that sometimes I feel like it's so immediate. What I'm telling you is so immediate that I think it's. It. People can't see it. So. All right. Sorry about that. You too? All right. So MJ says, could you explain the symbolism of Baphomet and also the depiction of two angels kneeling before him? So I talk about this a little bit. I kind of allude to the symbolism of Baphomet in the, in the, the Montero video slightly. I don't know if I don't go into it completely, but you can understand it as. Can understand it as something which was projected into the imagination in the 11th century when the Templars were disbanded. Was it 11th or 12th? I'm not sure. Anyways, when the temple, the Templars were disbanded, there's an image that was kind of projected into the imagination which became like an image of the opposite of Christianity or the desacralization of Christianity. And so that image started to grow to a point where it started to be Actually taken up by people. Even though I don't think at first it. I think at first it was just a slander. It started to be taken up to a point where it became an ideal that was used in magical theory in the 19th century, obviously by Elifas Levy and by Crowley and by all of these occultists. And so what you see in the image of Baphomet is you can see the difference you get. So you can understand. It's like the difference between syncretism and synthesis. So Christ is an image of synthesis in which dualities are in the image of Christ. So it's like, I've talked about this, like the, the blessing finger in the book, the two eyes, the, the, the inner garment, the outer garment. This duality is there in the image of Christ. Christ. And you even have, let's say, if you think about the image of Christ with the four cherubs, you even have an aspect of hybridity in the corners, in the edges. But all of this is brought together in unity. And so it's an actual union of heaven and earth. So when the occultists say, you know, as above, whatever, it's like as above, so below, that's actually what Christ does. Like really, that's what Christ does. But their image, like an image of Baphomet, is actually an image of confusion. It's an image of hybridity, it's an image of monstrosity. And that's why it presents itself that way. And so Baphomet is a hermaphrodite, Baphomet is a half human, half man. So they see it as. The people who produce that say it as. It's a union of opposites, but they're. There are unions of opposites which are confused. Union of opposites. And there are unions of opposite which are synthetic. And, and that, that's the difference between Baphomet and Christ, which is why you could say that Baphomet is an antichrist image in a very strict and simple way, because it is the, it is, it is the difference between unity and multiplicity. Multiplicity in unity, in true unity and confusion and mixture on the other side. So that's what I think, and I think that the upside down pentagram is an image of that. So you, some of you have probably seen I did a video on the upside down Pentagram for patrons only. And in that video, that's kind of what I explained. It's like, what. Why is this upside down Pentagram? Because it has to do with this worship of multiplicity. And this kind of seeing, the unity of. In. How can I say this? To see unity emanating from multiplicity rather than, let's say, the other way around. So there'd be a lot more to say, obviously. All right, so, Brian J. For $5. Hey, J.P. what's the symbolism of celebration? Why do we evaluate the difference in meaning between, say, a baptism and a gender reveal party? Well, celebration is great. Celebration is about. Is a smaller version. It's like a little venerating or it's like little worship. It's not bad. It's good. The sense that you come together to recognize something which is worth celebrating. And so that's why we have celebration of saints the way birthdays, all of this is good. It's good stuff because celebrations are the way we are bind the way that we're bound together. So they're great. And what's the difference between baptism and a gender reveal party? I mean, it's just a, just a difference of level. Obviously a baptism is, is a higher than a gender reveal party, but I think that the fact that people do these gender reveal parties is, is a, is a. It shows you that the ancient celebrations which we've tried to evacuate because we think that they're meaningless and superstitious are nonetheless coming back in all these kind of superficial and secondary ways. But there's nothing wrong with a gender reveal party, but it's obviously on a very low, much lower level than something like a baptism, so. So Judex for $10 says, have you made a video talking about your St. Michael and the Dragon? Bought a T shirt, a sweatshirt, and would like to know more about what I'm wearing. I don't think I made a video specifically about St. Michael the Dragon. That could be an interesting video to make, actually. Could be. It could be. I mean, it's, it's. I feel like it's, it's so funny because sometimes like that, like, I feel like it's. It's like it's obvious what that's about. And so maybe that's why I don't talk about it. But it, I mean, it's just heaven and earth in the, in the sense of earth as chaos and then, and then heaven kind of, let's say, reimposing order on. On earth as chaos, let's say. But it would be maybe a good idea. Maybe that's something I could do at some point. So, Alex Karas for 20 years D. Without going into how differently we view symbolism in Western post Enlightenment, what do you figure is the best Way to explain to fundamentalists not to take Genesis literally, but instead symbolically that word, literal, man, it bothers me. Okay, so let's use another word just to help ourselves, because what. What do you figure is the best way to explain the two fundaments? Not to take Genesis scientifically, but rather to take it literally. Literally. I don't like that word because I don't use it. But literally just means what's written in the text. That's what literal means. Literal means literary. It doesn't mean scientific. This is also. I mean, I've fallen in that trap before, which is that I said there's no literal, but it's like literal in the sense of this neutral reality. Literal means what's in the text. So you really do need to take what's in the text in that sense. Like what's in the text is. Is what's. It's what's being told to you. But I think that to me, the best way to. To. To maybe help people understand that is that. Is to maybe help them see that by doing that, by trying to read genetic Genesis scientifically or historically in the way we understand historically now, like, as critical history, let's say, is actually to worship that. Like, you're actually. When you want to think that Genesis is a scientific text, it means that you actually worship science, because that text is obviously not that. And not only is it not that, but it's okay that it's not that. And the fact that you think that it's not okay, the fact that it bothers you that it's not a scientific description means that you have your priorities in the wrong order, because science is not God. So take what's there, actually, and just interpret what's there and don't try to bring it into a field that doesn't have room for. And the next thing is to show them just how much. Just to show them how much that story is like the source of all the other stories. And it's actually more like an origin story that then is causal to all the other stories in Scripture. I think that's maybe the best way to. To do it. All right. Okay. So, Dan, Diego de la Vega says, what are your thoughts on Nietzsche as a philosopher? I. I don't know Nietzsche. I. Nietzsche's one of those people that you kind of have sympathy for because he was dealing with really superficial Christianity, but you also don't have sympathy for because. Because he was. Because his. His. I think his vision is wrong. I think he's wrong, you know, And And I think that he is the. His. He bore the fruit of how he was wrong. Let's just say it that way. So Mika Harding says 5 USD. Is there a relationship between the snake of the garden and the concept of tantra or kundalini? I have no idea. I don't. I don't. I especially that whole kundalini thing never really interested me. I always felt like it was like it was fake, that kundalini stuff, because like, a kind of weird new age thing. All right, so radu chichi for $20 USD asks. You should look at. You should look into the relationship between the alchemical quest for the philosopher's stone and bitcoin, along with the metaphysical underpinning of it all. Interesting. I think about that. I definitely should think about that in terms of the relationship between bitcoin and the philosopher's philosopher's stone or bitcoin and the. And the Grail, maybe even. Definitely something to think about. I don't think I'm done with bitcoin. And so I need to find someone because Robert Reedlove. I really enjoyed my conversation with him. It was really great. But he was definitely a proponent of bitcoin. He was definitely sold to the idea. And so it ended up being more like. Like, you know, I was arguing with. Not arguing, but I was like, discussing with someone who is completely for it. And so it would be nice for me to find someone who is knowledgeable about bitcoin, has thought about it, and maybe is not. Is. Is more like, let's say, has a. Can. Can see different sides of it, let's say, or can. Can see the advantages and disadvantages of it and could be willing to talk about it. So. So hopefully, hopefully you can see. So Lisa Parrot says, hello, friends. Lisa, you just appear in the chat at this time. What's going on? How late is it for you? It's like super late for you. Did you just, like, wake up? Maybe Lisa just woke up. Maybe. Anyways, all right. Okay. So Brian K. For Five Valley says, could a new form of literally be found in the alternative alliterative and mythological symbolism of modern storytelling through exeges, parallel stories? I'm not sure I understand, like, what alliterative symbolism is in modern storytelling. I'm not sure I understand. I would say, like, also, I think it's important to understand that you really can't have a proper liturgy out of something which is fictional. And it's kind of understood to be fictional. It has to be a story that you can. That you can participate in in a very immediate way. So it's like the crowning of a king can have a liturgical aspect, you know, or even, even like the, the swearing in of a president is actually liturgical or a birthday party is liturgical, but that's because it's actually a participation in, in reality. Right? It's a, it's a, it's a, it's bringing in a pattern so that a particular moment participates in that pattern. But like forming liturgies out of fiction would not, would not have any, would not have, would, would, would be superficial. Like they wouldn't really connect all the levels together. So Marino Alexander says, what's the symbolism of mere bearing icons, specifically the Panagia? Why do we think of them as cross crying and usually not sweating or bleeding? Interesting. Well, I mean it does, it has to do with the idea of compassion. And so it's like you could understand that the compassion of the Mother of God is a perfume. Like it has a good odor. It's like a, it's a, it's a, it's a, it's a sacrifice. And so it's like offered to God. And so just like these sweet beer, these sweet odds oils were like, were used in a, in a kind of offering. I think that that's probably what's going on. So bing binger for $10 says. Hi. Hello, Jonathan. I was wondering, what are the comparisons between Gnostic Christianity and Freemason Luciferian religion? They seem similar in some parts, especially the Promethean aspect, I would say, at least. I mean the Gnosticism that I understand, it would be kind of the opposite of, of, of Nas, of like Luciferian vision or Promethean vision. At least the traditional Gnostics, they had a sense that they had to escape the world. But maybe like, maybe you're right. Maybe the idea of, of the Promethean project or the modern Promethean project, especially like the, the, the, the, the technology as supposedly creating a transhuman state, then in that sense I do believe that maybe it has something to do with Gnosticism. So yeah, so maybe there's a connection, but it's, it's not, it's not straightforward. I would say there's more a relationship between kind of Luciferian vision that you see today and the Enoch, like the book of Enoch. That for sure, in terms of the watchers and all that stuff like that is definitely very close. So Abraham Matthews for 100 INR says, Could you make a video or blog on your thoughts regarding Mr. Meo's video on Yahweh I don't know. I've never seen that. I'd have to check that out. Who's Mr. Mythos? I don't think I even know who he is. So. Paul Frolick. $10 for just $10. Thanks, Paul. Matt for 4.99 thoughts on Laying of hands. Traditionally, one with authority. Does this bishop, priest charismatically hands on one another? Yeah, it's. I mean, it's about. It's about. So think about it like. Okay, so think about it like you. You have. You have your pattern, you have your. Your will or your thoughts or whatever. And usually you. You embody that. How do you embody that? You usually embody with your hands. Like, the things you do. Most of the things you do are done with your hands. You work, you. You know, you greet people. All of this is. Is hands. And so hands are, let's say, the place where you transfer power to the world. And so it makes total sense that, that, that spiritually, like, that one of the ways that you can manifest the transfer of authority into the. Into something else would be by putting your hands on it, because that's what you do all the time. Like when you. When you're. When you're building a house, like, and you're hammering nails, you're transferring your authority into power of you with your hands to the. Like, manifest that pattern in the world. And so that's the same with, like, this idea of laying of hands. It's the. Yeah. All right, so, Mike, Larry, V for $5. What do you think will happen when we get rid of aging? Permanent liturgical celebration, hopefully. Preferably orthodox. I don't think that's going to happen, not in this world. All right. The golden thread for a hundred dollars. Oh, my goodness. When young, I thought eternity was infinite time. Clearly, it's qualitatively different than our time. It has implications for what it is like to be a bat angel principality. So it's. Even listening to Father Stephen. Can you expand on eternity and its relation to the ontology of divine beings? Where to read more? And so, so you. You kind of. You. You have to understand the way to understand eternity is something like, akin to the center of a space. So imagine that you have a. A circle, and the circle has a center. Right? So the center actually doesn't exist in. In the circle. The. The center is actually virtual. It's a. It's a virtual point. It doesn't take up any space. Right. It is. It's like an invisible point. Invisible in the sense that it doesn't have Dimension. But. But nonetheless it is the center. It is that out of which the circle emanates. And it's that out of which the circle. How can I say this? The circle is identified or finds its common place. So all the. All the spokes of the wheel, let's say on the circle, all the spokes, all the radii, the indefinite radii from the center to the. To the. To the periphery, all joined together in that invisible point that has no. That has no. No dimension. And so that's what eternity is to time. So eternity is the place where all time is resolved out of which all time finds its extension. But it doesn't have duration. It is without duration. And it's actually because it doesn't have duration that it becomes the synthesis and origin of all time. And so that's the best way to understand it. It's like you're not going to totally understand eternity, but that at least is the way that I can even approach it is to understand it in analogy to. To. To space, but in time now. So Darren, for $20 USD says, I've come to terms with Mater abandoning us. Moving forward. Have you ever considered bringing on a certain French Canadian professional skateboarder? I'd love to hear a normal person's thought about this. His two insane brothers. That's hilarious. So for people who don't know, my brother Dan, Dan Peugeot was a. Was a French Canadian professional skateboarder. So. So for several years he skated for some of the big companies in the US and he lived in Long beach and did the skater lifestyle. And he is now actually, now he's actually like a Pentecostal pastor near Vancouver and he's super involved. He runs a thrift shop to help kind of single moms and to kind of help the community there. He's great. I don't know if he'd even be interested in coming on my channel. It's like I should ask him. I should ask Dan if he'd be interested to come on my channel. I don't think he would be. I think he. I think. I don't know. I'd ask him. But as for Matthew, like I would say, don't totally abandon hope. You might. You might have some surprises. There might be some surprises. I can't promise anything, but there might be some surprises. All right, so Federal Libraries for $10 USD says, what is the symbolism of the will? That's a. That's too big a question, dude. That. I'm not going to answer that. Attend to 11. Sorry, federal libraries. And then he asked another question, which is, what is the symbolism of symbolism? And so the symbolism of symbolism is that it's symbolism. You're going to start getting crazy answers if you ask that kind of stuff at like 10 to 11. All right, Grubmeister for 10. For $5. Australian. Gnosticism, Hinduism and Zoroastrism, they try to achieve union with higher reality. What is that reality? So you can understand. Christianity also tries to achieve union with a higher reality. It's just that it doesn't. Christianity does it in an. You know, at least compared to Gnosticism, Hinduism is very varied. So it's difficult to say Hinduism, but, you know, does it through incarnate to an incarnational principle which contains the multiplicity, let's say, say. And so that higher reality is. Is. Is God or is non duality or is the. Is. Is the place where multiplicity is the infinite. Yeah, but I think God is the best way to talk about it. All right, let me just see. Because I see there are still some things coming in here. Let's see. All right, so. Okay, so two more questions on Patreon, Mr. J. I will. Let me do those right now. Two more questions on Patreon. So the fellowship of Bitcoin. Oh, my goodness. What does he ask? Is going to be about Bitcoin, do you think? I think so. Hi, Jonathan, thank you for all the great content. Can you talk a bit about the potential relationship between the alchemical quest for the philosopher's stone and the Bitcoin? Yes. I mean, maybe it's the same person who asked it on. On, on YouTube. I would definitely have to think about it. I definitely have to think about it. I think there is something there, but I. It's. It's foggy. It's very. It's foggy. Maybe because I don't understand Bitcoin well enough, but it's definitely foggy. But you. You put me on a path. So let's see where that leads. And let's see. And so Kenobi asked, okay, again, the symbolism of Baphomet. So, all right, so. So they ended up being answered all these. So Drew McMahon for 499. Is crying a form of losing control the way laughing is? Jesus wept. And so it depends. So it depends. So crying and laughing can almost can kind of be seen as opposite from each other, but obviously they actually do meet in a weird way. But you could. If you understand crying in the sense of compassion, then there is a sense in which it's a giving up of Control, right. And letting yourself be, be touched, let's say by suffering or the suffering of others, let's say. And so it's different from laughing because laughing is a, is a. Laughing is a kind of inebriation, whereas weeping is more of a. Is. Is an entering into. Like, at least that's how this. I'm just saying this like that. But that's, that's what I, that's what I perceive. Like when you cross, cry, if you cry, obviously you can cry for the wrong reasons, but if you cry for good reasons, like if you cry when you see, when you cry, when you meditate on, on. On the suffering of others, then. Or if you cry, if you. Yeah, I think that that's like an entering in. Even if you cry for your own suffering, if you do it, or if you cry for your own lack of, of capacity to, to embody. Let's say if you cry out of, out of being contrite, where you ask forgiveness and you cry because you see your incapacity to, to. To do the things you want to do, like your will is not following you, then there's a kind of entering in and it, and laughing seems to be a kind of distancing. At least that's my intuition, but you know, I need to think about that too. So. Frank. $10 USD right before Communion, I heard a prayer to the Holy Spirit for it to turn the bread into the body of Christ. Is the Holy Spirit the thing that helps us see multiplicity of objects part in unity? You could, yeah, you could kind of say that. You could, you could say that's a good way. That's not a. It's not a thing. The Holy Spirit is not a thing. The Holy Spirit is a person that's important to distinguish, but in terms of understanding that there's definitely a relationship. Like that's why God blows his Spirit in, into Adam in order to give him life as he's gathered the multiplicity into one. And that's why. But there's all. It actually seems to be like a dual thing. This is these, these dual. These. There are these, There are some of these symbolism that are like the two extremes at the same time. They're hard to think about. That's why actually the, the. This video on the Mark of Cain, because the mark does opposite things. And so the Holy Spirit seems to be, let's say something like you said something like unity and multiplicity. And so sometimes it appears as moving towards multiplicity and sometimes it appears as moving towards unity. And so let's say when Christ blows onto his disciples and then he says like go out into the. Go out. And then the same at Pentecost when the Holy Spirit descends on the apostles and then they start to speak in all these different languages. And so now then it seems to be like doing the opposite of what it does to Adam. But it's actually the same if you understand that it's that which makes unity and multiplicity come together, that the Holy Spirit does that. And so, yeah, that's as close as it's going to get. Cello guy for $5 five British pounds says is the vaccine in combination with COVID Vaccine. Vaccine, Passport. Example of a manifestation of the passport. The pattern of the mark of the beast. And so it's definitely coming very close to that. I think I mentioned that earlier in the conversation. It's coming close. I don't know if it's that yet, but it's definitely. That's def. It's like, it's like it's, it's really kind of moving in that direction. And so you'll see in my next videos about this, like I'm going to talk about this more explicitly, try to avoid using certain terms because, because YouTube. YouTube is gonna, is gonna hate me if I start talking about that stuff. So I'll just, I'll be careful. But if you guys are capable of listening and be flexible enough to see that I'm avoiding certain words just to, to kind of avoid being banned from YouTube, then then hopefully you'll understand. So does Christ pre incarnate have to be all the physical embodiments of God the Father in the Old Testament? I don't know. Like, are there embodiments of God the Father in the Old Testament? I don't think I usually the church fathers see all the theophanies as being Christ. You know, that's what I, that's what I see. So JP for $5, what is the symbolism of long hair on a man? Does it have anything to do with spilling seed? H. No, I don't think so. The, the long hair on a man at least like St. Paul seems to talk about long hair on a man as being problematic being. Because it's like a covering and so that's how he seems to see it. But there's also the idea of long hair in the sense of purity and not touching or not bringing the knife to not cutting. And so you see that in the symbolism of the Nazarenes. And so the, the, the Nazarenes would, would not cut their hair. And so that's why monks, Orthodox monks also have long hair. Has to do with a vow to, to, to not cut your hair or cut your beard because it's like you just, you're, you're, you're. It's like a, A kind of purity. So depends on the context, I think. All right, so I think this is going to be the last question, guys. So don't put in any others because it's. I'm pretty much done. I went. This is. I. It's like I put it at 8 and now it's 11 still. I always ended 11. I'm going to end 11 anyways. All right, so, Peyton Evans for $10 USD. Hello. I'm interested in the Sacrament of Confession and the healing power of a sincere apology. Do you have any thoughts on these things? I'm not well educated on Christianity. My apologies. So, yeah, I mean, the Sacrament of Confession is wonderful. It's a, it can really be. It can really be a healing process, especially if you have a. If you find a priest that is, that is attentive and that listens and take what you're saying seriously. It's a wonderful thing. And so, but you need to, you definitely need to be in the tradition, at least in the church, to be able to participate in that. But I think that if you're not yet, or if you're moving towards the church and you're not there yet, you know, it's. It's probably still possible to, to meet, to meet a priest or to meet someone who has some kind of spiritual authority and then ask them if they'd be willing to, to hear you in terms of. In terms of whatever it is that you have on your conscience. Like that might, that might be. Might be a temporary balm, let's say. All right, so normative for 1499 says interview Vin Armani on Bitcoin. No one has a more unique take on it. And so I made contact with Vin, actually, and we had a few exchanges on. On. On email and stuff. And, And I think for now he said he'd probably want to wait for a while before he had, because I think he's busy doing a lot of stuff. He's got a lot of stuff on his plate and a lot of stuff going on. So he said he'd rather not. He said that he really loves what I'm doing and that he's a big fan of. Of of what I talk about. And I've seen him talk about me on, on like, on Twitter and stuff. And so, So I believe him, but he said he'd rather, he'd rather wait. So we'll see. Who knows? Maybe one day. All right, so thank you everybody. This was, this is good. Sorry for the craziness at the beginning. Like 20 minutes of nothing. And so, so thanks for, thanks for all your attention. So, all right, I will log off and I will see everybody next month. Thanks, everybody. Bye bye. I hope you enjoyed this episode of the Symbolic World. The Symbolic World is edited by Justin Ward and it is based on a series of videos that you can find on my YouTube channel, Jonathan Pageau's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism. That is, it's quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by, of course, leaving a review on itunes. Everybody knows that's the best way to get the podcast out there to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon pageau videos as well and unsubscribestar. All those links you can find on my website or in the show description. So thank you and I will see you soon."}
