{"episode_id":"SW - #115 - 2020-09-10 - Masks as Veils","start":0.72,"end":1330.54,"speaker":"Jonathan Pageau","text":"With the continuation of the coronavirus situation, it has become mandatory to wear masks inside in several places. For example, here in Quebec, in all interior spaces, public interior spaces, we are required to wear masks. And if you don't, you can get fined, you can get arrested, and especially the place where you are can get fined. And that is, of course, a much better way to enforce something, but by finding the restaurant or the store in which you are not wearing a mask. So I think I've been really hesitating. People have been asking me to make a video on the symbolism of masks now for weeks. And I have been hesitating just because everything is still kind of developing and it's such a very broad symbolism. So you can see this video more as some thoughts on the symbolism of the masks in this particular context, what it can mean in this particular context. And. And we'll try to understand it together. Hopefully, in this particular video, you can use the comment section to give me your ideas as well. I'll try to be a little more attentive to the comment section so that we can further the thinking about this situation with masks and we can see how we can push it further. And maybe I'll make another video if that is necessary. This is Jonathan Pageau. Welcome to the symbolic world. So in order to understand the symbolism of masks in this context, we really need to be careful not to let our minds go too far in symbolic thinking, because we need to try to, at least at first, stay close to what is happening and. And try to see what is happening through a symbolic lens. And this symbolic lens does not exclude the explicit reason why the mask is used. This explicit reason is, of course, part of the symbolic reason. But at the same time, we also cannot avoid that symbolism through analogies and through narrative, you know, taking on different forms and, let's say, growing in its. Its emphasis. So I've seen people who have been focusing only on the narrative aspect of the symbolism, only seeing it in terms of a social narrative, a political narrative, a narrative of power between different groups. And there are other people who want to limit the symbolism only to the medical use and saying, there's no symbolism here, it's just medical. Even if it's medical, it's still symbolic because the patterns across the different levels are the same. And they are, of course, the same in terms of medical. So we'll look at that a little bit. Like I said, in order to start, we need to look at the very specific reason why we are being told that we have to wear masks and the Reason why we're told we have to wear a mask is one which is coherent with the use of masks, especially this kind of mask, which is more like a veil than a mask. The way we think of it, when we think of a mask, we usually think of wearing something which is manifesting something else. So let's say you wear a Halloween mask or you wear a mask, carnival mask, something which is. Which is a representation of something else, you know, on your face. This particular version of the mask is mostly to hide your face, is mostly to separate you from others. And so in that sense, it is more related to the symbolism of the veil. There is a relationship between the carnival mask and that type of mask and. And the veil as well. But let's. We'll try to stick close because this symbolism is so wide that it's. It's going to keep wanting to take us on all different kind of paths. So the explicit reason why we're told we wear a mask is because we need to be separated from each other, because we are. Because of the. Because of COVID Because it is said that, you know, we can infect each other. We put on masks in order to separate us from other people, so. So that we don't infect them, so that we're not infected. And the opinions on that will vary extremely. You know, you read people who are saying that it's effective. They were telling us it's not effective just, you know, a few months ago, and there were studies saying they were not effective. And then now they're telling us it's effective right now, and that there are other studies that say it's effective. In the end. In the end, that's why we end up going back to the narrative level, because the scientific information seems to be so varied and seems to change all the time that. That it's the. Or seems to. You seem to be able to pick in the scientific information that you need in order to. In order to be able to. To give the. The narrative that you want. But we can see even the n. The medical reason, we can see that it has a narrative function. And so we can think about it this way. We're told that we need to be separated from each other in order to not infect each other. And one of the problems that this has caused is, of course, a breakdown of the. Of all. Of society. Everything broke down. All economy, all meeting, all form of exchange broke down. And you can't perpetuate that breakdown forever. And so one of the ways. And so the mask ends up being A marker of protection. It's you separate yourself in order to protect yourself from others, to protect yourself from the disease. And so whether or not it is 100% effective, it also acts as a token. And it acts as a ritualized token to signify between people that I care about you and I care about your safety and I don't want you to get sick. And so it's as important as a narrative token which signifies the importance we're signifying to each other that we take this, this virus seriously and that we don't want each other to be infected. And of course, in terms of understanding that token function of something, it does have an effect. You know, it has an effect in a kind of. As a, as these waves of a pool can have an effect on whether or not we are. And it can help us understand some superstitions as well. You know, I've talked about how a lot of superstition isn't as silly as you think it is when you understand it as a token which for focuses your attention. And so if you do a token gesture to focus your attention, like let's say you're in danger and you knock on wood. Well, that attention to the situation, the recognition of danger, the act which will, which will recognize that you're in danger and you need to be protected, is already a movement towards avoiding the risk that you're facing. It's already a focused attention on the problem you're facing and which will help in terms of, on a greater scale. It will help in terms of how you're affected by the situation. So just wearing a mask is in part, you know, of course they give you the medical reason that it's there to protect you from each other. But it's a token reason as well, which is it's to signify and to attend to the fact that this virus is around and the fact that we're not infecting each other. That seems to be the function that it is playing. And all of this is related to the idea of separation and protection. Separation and protection are of course, the same thing. When you separate something from, from something else, you are isolating it to a certain extent and you are, of course, protecting it. Now we need to understand, this can help you really understand the veil in terms of the religious veil, the veil that is worn by women in certain traditions, for example, women in church, women in Islam, and also the veil that is there on the temple, in the. Or in churches. In Orthodox churches, there's a veil on the holy of holies which hides the holy of holies. And it is, of course, a similar reason in terms of narrative, which is that it is there to separate, to designate as other, and also to protect. So it's there to protect the inside holy place from the, you know, the secular. The secular profanation from the outside. That is the incapacity to recognize what is precious. But it's also there to protect the people on the outside from the holiness of the holy place. That is, to those people who aren't ready for something holy. Holy things can, let's say, they can be damaging to you. I shouldn't even say that right now. It's probably something, because that's like I just opened a huge door that would be. We'll need to talk about in another video. So hold on for that video, but let's keep talking about these masks and these veils. So there's an analogy between the use of the veil in terms of religious use and the use of the veil in terms of this medical use, both in terms of what it's doing, that is separating, isolating, protecting, and also the notion of attending. The narrative notion of if. When you put. When you create something like a veil or you have these gestures, the other gesture, which is also a form of attending, is of course, the gesture of putting, you know, Purell on your hand or washing your hands. They have all these bottles of Purell. You walk in, you squirt on your hand, you rub it, you make sure everybody sees that you're rubbing your hands with Purell, then you go in. And part of that is really a marker of attention. And it's actually very similar to going into a church and putting holy water in a Catholic church and taking holy water, putting holy water on your forehead, you know, or on your body, because it's a manner to attend. It's saying, I have entered a holy place, and now I am attending to the difference between the inside and the outside. And that is, of course, what you're doing when you're putting Purell on your hand. You're. You're marking to everybody and to yourself that you now need to attend and be careful in this space. And so it's even more that than it is about actually disinfecting your hands because, you know, everybody touches their face, everybody touches their mask. You know, there's. There's very. If you look at the way that it's happening in stores, you can tell that it has more of a narrative function than an actual medical, you know, scientific function, because people aren't trained in doing this anyways, I don't want to get off. I told you that this video would probably start to kind of shift in many directions. Now, in terms of a narrative function, this is going to be the tougher one. This is going to be the tougher one because it's going to seem like a stretch to some. But if I try to show you some of the analogies, hopefully, and also the other things that are happening in coordination with the use of these masks, then hopefully it will. Will help you to. To see what I'm talking about. Now, one of the important symbols of the veil has to do with the symbolism of the garments of skin. It has to do with the idea of the covering and the limit on the outside of an identity or on the outside of space. And so the veil acts as a transition between the inside and the outside. It's. It's kind of like a door. It acts as a transition space between two identities, inside and outside. And so because it acts as a transition, the veil is also a breakdown of identity. It is the place where identity breaks down. And so if you imagine it, for example, looking at the Islamic, the Islamic niqab, for example, can kind of help you understand this, which is that in the vision, the vision of the niqab is the. A woman belongs to her family, belongs to her husband, and she needs to be protected from the outside. And so we put a veil on her face and there is a breakdown of identity. When she's outside, you don't have access to her because she's preciously kept for her family. So there is. So the veil acts as an making anonymous. It makes the person anonymous to you. It makes that you can't own the person. Owning, in a very broad sense, in the sense of identifying and being able to name something, right? When you name something and you have someone's identity, you have some power over them. And so the making anonymous is a. Is a way to, let's say, hold off the outside and create this buffer space between identities. Now, when the woman who wears a niqab goes home, then she removes her niqab, and then she is known by her family. And in her family now she. Her identity is fully accessible and she's completely, you know, she's in a mutual relationship of identity with those that are in her family. And so you can understand how the veil acts as this transition between an anonymous identity and a fully revealed identity. Okay. And so one of the things, in terms of narrative, one of the things the mask is doing is also a form of breakdown of identity. And I know some people are gonna struggle with this one, but if we look at the other things that are happening in society, we can see that this is a move, there's a narrative happening. If you look at. Talk about how Covid needs to be, let's say, needs to be an opportunity to restart, right? An opportunity to reset the economy, to reset the way we do things, to start over. There is a lot of talk about discovering the new normal. And all of this talk is talking about using Covid as a reason to transition into something else. And so the wearing of the veils, the wearing of the masks, is akin to the breaking down of the statues. Those two things, the fact that they're happening at the same time, although they almost. They can seem narratively unrelated to people and they are analogical. The reason why we anonymize people, we break down their current identity, is the same reason why people are taking down statues. And the purpose is to enter into a new identity, to enter into something which will. A new established identity. An example of this, which is still there in Western culture, although maybe not as prominent as before, is, of course, the use of the wedding veil. And so a bride will put a veil on her face during her wedding. And that veil is a form of separating herself from the outside world. And it is, in fact, a form of a. You know, and people are going to hate this because it's so patriarchal, but it is a form of her putting aside her ancient identity, putting aside her. Her family, you know, moving away from her father and her mother and her family, her old story, and now entering into a new identity. And so when the bride comes to her husband, and then at the crucial moment, the husband removes her veil, he is the first one to see her. And that connection is supposed to become a bond. Like they bond and they create a new identity as the veil is removed. And so the veil ends up being a transition space between her old family and her new family, which. Which. Which will now create with their new husband. And this is something which is. Which is happening right now in terms of not just. Like I said, if it was just the mask, I wouldn't be saying this, but the fact that we have the mask and we have the breaking down of statues, we have the riots and the protests that have been lasting forever in the US the desire to, you know, if you look at what was happening in Portland, the desire to burn down, to defund the police, to defund systems of authority, to also break down. They were trying to burn down the court, the federal court there. And so you can understand in terms of a narrative, the desire to break down the current narrative and replace it with a new narrative. This, of course, does not mean that everybody who is wearing a mask and is wearing it for that reason, you know, most people are using the mask for the medical reason that is being said. But nonetheless, within even the medical, the medical narrative that is being proposed, all of this is kind of melding together into a narrative. And what is this world that we are. What is this new normal? What is this world that we're moving to, that we are going, that we need to prepare ourselves for? There are many aspects to it, but one of them seems to be identification. One of them seems to be a movement towards mass identification. And, you know, at first it was just. I was just seeing kind of conspiracy theorists talk about this, but now I'm seeing mainstream media start to hint at the fact that this new normal that we're going to move towards is going to be a. It's going to be a move from this ancient world of possible anonymous existence towards a full identification, which will be measured in terms of biometric, different biometric measures, whether it's going to be facial recognition or whatever method they end up using, whether it's going to be a, A, A kind of mark in the vaccine which will make you. That you can be scanned, you know, and you can be identified. And this will also make it possible for you to travel or to participate in different aspects of society. This is what we seems to. We seem to be moving towards. We seem to be moving towards a, a world of absolute identification where everything is accounted for. And so it makes sense that we would have this moment of breakdown because the breakdown is also painful. It's supposed to be painful when wearing a veil, wearing a mask is unpleasant for everybody. And it's unpleasant even when you think of, for example, the notion of the Islamic. The Muslim woman wearing a niqab, it's also supposed to be unpleasant for her. Why? Because they want the person to, when she gets home, where her identity is supposed to be strong and she removes the niqab, she has this sense of, like, freedom. She has this sense of, here I can be myself, here I can, I can exist freely. And so it's the same thing. You know, one of the reasons that I think it seems that we are kind of forced to wear masks, that, that these separation, even as the death count goes down, even as the, the, the cases go down, in Canada, at least where I am, the cases are going down. The death rate is going down dramatically. There's almost nobody. There's nobody dying anymore. We still will continue to have this use of mask and this use of separation so that we aspire for the new world, so that when the new world of identification, of absolute identification is brought to us, we will be grateful for it. We'll be, we'll be thankful that finally we are free to now embrace this new identity which is being presented to us. And so that is my. Those are my few thoughts on the mask and what is happening right now. Now, of course, there are many, many aspects which I'm missing because the, the mask and veils is one of the primal symbols, is one of the most polyvalent symbols and is one of the most difficult to comprehend because the covering is itself everything. Technology is a covering. And so all the symbolism of civilization, it can be reduced to this notion of covering. And so it's difficult to talk about it because it engages all of human action and human making and human sciences of covering in terms of technology and knowledge and everything. And so I tried to limit my understanding as close to what is happening right now. Hopefully it was helpful to you. But, but go, go, go nuts in the comment section and I'll be really happy to try to engage and maybe if there's some good stuff in there, we can make another video on the subject. So once again, thank you for your attention and I will talk to you very soon. I hope you enjoyed this episode of the Symbolic World. The Symbolic World is edited by Justin Ward and it is based on a series of videos that you can find on my YouTube channel, Jonathan Pedro's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course leaving a review on itunes. Everybody knows that's the best way to, to get the podcast out there to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon Pageau videos as well and on SubscribeStar, all those links you can find on my website or in the show description. So thank you and I will see you soon."}
