{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":0.4,"end":14.72,"speaker":"Ken Lowry","text":"True beauty sort of seduces you toward the good. It pulls you deeper into reality. But then there's this. In these more pornographied forms, the seduction of the art becomes a pull into the abstract."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":14.88,"end":69.1,"speaker":"Jonathan Pageau","text":"In the scripture, techne, art, applied science. And not just in the Bible, but also in kind of Greek mythology and ancient thinking. It's always a dual thing. It's not clean. There's a healthy suspicion towards it because. And if you look at how Plato was like, you know, get rid of those artists because they can make you think something's beautiful even if it's not right. They're tricksters. They can become propagandists. And in scripture, you can see that applied arts are from Cain and they bring about the Flood. So there's this very dark aspect of what. Of what they can bring. But then God is constantly saving that which is fallen. This is Jonathan Pedro. Welcome to the Symbolic World."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":79.98,"end":97.78,"speaker":"Ken Lowry","text":"Hello, and welcome to Climbing on Mount Sophia. I'm excited today to be here with Jonathan Pageau and David Schindler again. Jonathan Pageau, of course, is the leader of the Symbolic World movement, which is a YouTube channel and a website and I think a printing press now as well. Right?"}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":98.02,"end":102.9,"speaker":"Jonathan Pageau","text":"Yeah, we just started a press like a few months ago with our. With our fairy tale series. So."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":103.06,"end":161.81,"speaker":"Ken Lowry","text":"Yeah, yeah. So a lot of wonderful things going on there. I mean, so many resources, wonderful people, a part of that whole movement. And then Jonathan also is a orthodox icon carver, an artist. And today we'll be referencing some things from his video on contemporary art. I'll put a link here. And then David Schindler, of course, writes under the pen name D.C. schindler, professor of Anthropology and Metaphysics, I think, at John Paul II Institute, and then author of many great works. So David and I have been doing a series on David's book, Freedom from Reality. And so I'll post a link to that here as well. But I was hoping today that we could talk about art, art in relation to beauty and how that looks in the modern world today and how that's part of the diabolical separation from the world that we're all experiencing. So I'll throw those out there and any thoughts that come up initially."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":161.89,"end":195.07,"speaker":"David Schindler","text":"Well, Ken, maybe we could start with the question that right before we began that you had raised and we hadn't gotten into. And I suspect Jonathan would have some really interesting things to say about this. But you mentioned that the distinction between techne in the ancient sense and modern technology, that, you know, shares a root. But there's a Very different sensibility implied. I mean, maybe that would be a good starting point. It's, you know, it's not immediately art in the sense of painting and sculpture, but certainly related to that. Would that seem like a good. A fruitful."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":195.47,"end":369.64,"speaker":"Jonathan Pageau","text":"It's a great place to start. It's like my. Actually my intuitions about art. Part of my intuitions about art actually came from reading Heidegger's questions on technology and then reading Ananda Kumaraswamy's work on art as well. Those are the kind of the two sources that brought me to think differently or to realize just how differently the ancients thought about art. And in some ways, the sense that they had the idea of idea or episteme and then techne was applied, basically it was just the idea of applying things to the world, right? So you have these principles, you have these patterns, and then you apply them to reality. And that application is techne. And so that's actually my. That's been my approach to art in general and to technology. To me, I don't totally see a difference between the two. It's just that. And poiesis, for example, like, even poiesis comes from the word making. There's this idea of like, you know, you have these. You invoke the muse and then you make things with. You actually create things. And that's been my approach to it. And the reason why I take that approach is because I think that that's also what's there in scripture. It's closer to the way that the arts or applied making is in scripture. And it also makes it. It removes it from this weird idea of expressing yourself or of like creating beauty. You know, art for art's sake or beauty for beauty's sake, and all of these types of terms that came about with the Romantics and the later, later artists and rather brings it back to the idea of, you know, it's just. It's a. So Ananda Kurmasami, for example, says the art remains in the artist, right? Art is actually a skill. Art is not a thing. Art is a skill that the artist has to apply knowledge and principles to the world and to crew and to make things that are artifacts that have a purpose in life and in society. And so technology does that as well. And the arts in the ancient arts, that's what they did, right? The seven. The. The. They say the seven arts or however you want to talk about it. That's how. How they did it. And it's just a different way of understanding which. Which also breaks that weird duality we have between. Between the idea of, like, pure techne in the sense of just gains in efficiency, which is the way that we seem to think about technology today. It's just increasing of power, basically, and the idea of art in the sense of expression of something. And so to me, they're actually ultimately the same. And when we separate them and we have something like fine art or music or creative arts, and then we have pure techne, which is just an increase in means, then we have a monstrosity. We end up with weird monstrosities on both sides."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":369.8,"end":370.28,"speaker":"David Schindler","text":"Yeah."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":370.44,"end":425.34,"speaker":"Jonathan Pageau","text":"I want to invite you all to the very first symbolic world summit. Over three days, we will finally meet in real time, in real space. And everyone from this little corner of the Internet will be there to explore the theme of reclaiming the cosmic image. Of course, I will be speaking, but there will also be Martin Shaw, who is an amazing mythographer. Father Stephen DeYoung of Lord of Sky Spirit fame. There will be Richard Rowland from the Universal History series, Vesper Stamper, Nicholas Kotar, and Neil Degrade that you've all seen on my channel. Here and there for entertainment, we have everyone's favorite apocalyptic band, the one and only Dirt PO Robins. This event will be the chance of a lifetime to capture and embrace our current moment. So Join us from February 29 to March 2, 2024, in Tarpon Springs, Florida. Visit thesymbolicworld.comsummit for more information, and I will see you there."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":426.06,"end":533.74,"speaker":"David Schindler","text":"So they brought the boards to pin the wings and bodies of our God. That's great to pick up on a couple of things there. I'd like to tease out a little bit more distinction with technology, but I'll come to that in a moment. This idea of techne being an application, it seems to me there's another dimension that's that I think is in the spirit of what you were saying, but it's formulated a little bit differently. And that is that this, again, would be Heideggerian sort of sense that techne itself is a kind of knowing. It's. It's a distinctive kind of knowing that that would be different from conceptual knowing that then gets applied. Like, in a second moment, you have an idea and inspiration, and you take that idea and then you try to translate it into a thing through, you know, paint or tone or color. There's. There's another kind. It's kind of interesting. And this is. You know, I'm not an artist like you are. I do enjoy painting. I used. At one point, I thought I might become one, but that never, never materialized. But my experience of art, and this seems pretty common, is that you often discover the idea as you, as you work with it. That it's not, it's not that you first have an idea and then you apply it, but that somehow the very idea itself comes to expression in a way that can take the artist himself by a certain surprise that it's still a manifest. It's not just self expression. I mean, some people will interpret that as just being, you know, arbitrary creativity. It's still truth centered and truth grounded, but it's a kind of truth that is manifest, revealed and manifest in the real thing that you can then think about afterwards. Would you accept."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":533.82,"end":607.78,"speaker":"Jonathan Pageau","text":"No. Well, Heidegger. Yeah, Heidegger talks about the notion of gathering. Right. So it's like the way in which it's an unveiling is that it gathers elements together and it reveals. It ends up revealing a purpose as you're gathering them together. So you could, you could, can understand it as an emergent from an emergent perspective and from a kind of top down perspective where from an emergent perspective you have all these things coming together in love and then ex. Then manifesting a hidden reason as they come together. And then the other way to understand it is from the top down perspective, which is, it's like a head finding a body or a husband finding a wife. It's like an idea coming into the world and joining itself with a, with matter. And so I think both of those are perfectly good ways to explain it. But if you think about like they'll always be. So let's say even the way you talk about it, which is, which is, there's this modern, it's a more modern way of understanding art, which is this kind of like, you know, improvisational approach which then reveals a pattern that you hadn't thought about, haven't thought about."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":607.94,"end":608.22,"speaker":"Ken Lowry","text":"Right."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":608.22,"end":641.95,"speaker":"Jonathan Pageau","text":"It's almost like it's a form. It's almost like a form of divination. It's like you cast the bones and then you watch the bones move and then you see, oh, oh, it's like there's something there, there's some pattern. And then you start to draw the lines between the pattern and then you kind of are surprised to find what is being revealed. So in that sense that type of art making is, is closer to divination in that sense. But then you even that you would need to have the art. Right. So if you, if you can't do it."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":641.95,"end":642.43,"speaker":"David Schindler","text":"Yeah."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":642.43,"end":662.23,"speaker":"Jonathan Pageau","text":"Then you're not going to do anything right. You can kind of see it. But if you can't, if you don't have the skill, if you don't have that art in you, then even if you have this revelation of some pattern that you hadn't thought about, you need the skill. So it's, it's still, even if you're, it's an emergent thing, you also need that top down control in order to, to make it happen."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":662.71,"end":678.63,"speaker":"David Schindler","text":"I, Yeah, I, that, that's. I would absolutely agree with, with that. This idea that you're sort of generating order simply from below is incoherent. Ultimately it never really works out. There's always going to be a kind of a from above dimension. I, I think that's."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":678.79,"end":721.72,"speaker":"Jonathan Pageau","text":"But the modern artist did everything to attain pure. So I don't know if you know the process. It's fun to do. Like, I don't know if you know the process of a Cadaverex ski, which was, which came about with the, with the Surrealist, which was. What you would do is you take a piece of paper, you'd fold it and then we would each start. I would start a drawing and then I would leave just a little bit of the drawing left so that you can see, but you can't see what I did. And then you would continue the lines and make something and then leave a little bit for the other person. And at the end you unfolded it and then you have a kind of hybrid monster. But then what you're surprised is that you realize that often there's actually a connection between. A surprising connection that happens between, between the different elements."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":721.88,"end":722.36,"speaker":"David Schindler","text":"Yeah."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":722.76,"end":727.48,"speaker":"Jonathan Pageau","text":"And that's why, I mean that, that it's closer to, to the way that ancients would have done. Divination. That's similar."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":727.88,"end":761.92,"speaker":"David Schindler","text":"Yeah, I, I'd want to try to steer between that because I. That there's no governing idea. There has to be a governing idea. Or else, or else. You know, I, I think, I don't know if you recall the TV series from a few years ago, Lost, that kind of. And I, you know, I, I remember at a certain point really getting into that it was, it was absolutely compelling, but at a certain point the compellingness of it just disappeared. Yeah. And I think that was when, you know, the audience collectively began to realize that they didn't know where they were going."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":761.92,"end":762.68,"speaker":"Jonathan Pageau","text":"They don't know where they're going."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":762.68,"end":788.5,"speaker":"David Schindler","text":"They're just like making it up, you know, by episode. And immediately the drama disappears. It no longer has, it's no longer mysterious or there has to be A governing idea. But what. What I. What I would want to avoid on the. On the flip side is somehow that you. You've got the concept that the. That the artwork is simply a. A physical translation of a concept. There's no. It contributes more than that somehow. Right?"}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":788.5,"end":869.62,"speaker":"Jonathan Pageau","text":"There has to be a. There has to be a play between. Between the two. I always. I think, like, I've been thinking a lot about beauty. I'm thinking a lot about beauty because on the one hand, you know, I. I remember seeing, you know, that kind of platonic idea, right, that beauty is the. Is the. Is the expression of the infinite. Something like that. And I always thought, well, that's a real interest. That's a good. It's a good description of beauty. But then I also. I realized that I had a tendency to describe beauty very much top down. It's like beauty is when you see harmony. Beauty is when you see order, beauty. But I realized that actually, you know what? That's not true. It's not. That's not actually what you perceive as beauty. Beauty is something like harmony joined to a particular. And so. And so it's like it's. It's integrated. It's integrated harmony into a. Into the contingency of a particular place, a particular thing. And that's when you actually perceive beauty. So something that is actually too perfect and too balanced is. Is monstrous. Yeah, but you need this weird. This weird, like this weird discussion between what the particular material space, situation, whatever offers and the pattern which kind of comes down and is married to it."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":869.7,"end":874.58,"speaker":"Ken Lowry","text":"It's like when the. When the absolute shines through the particular that you see beauty."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":874.98,"end":878.5,"speaker":"Jonathan Pageau","text":"You could. Yeah, but the particular plays a part in it, right?"}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":878.5,"end":883.41,"speaker":"Ken Lowry","text":"Exactly. Like if there's no particular, the absolute can't manifest itself. And."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":883.41,"end":892.09,"speaker":"Jonathan Pageau","text":"And there's also a way in which the infinite also appears mysteriously in. In an aspect of idiosyncrasy that is properly there."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":892.41,"end":893.13,"speaker":"Ken Lowry","text":"Right, right."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":893.13,"end":926.8,"speaker":"Jonathan Pageau","text":"Like the idea of, you know, this weird idea. Like if you read in this. In the. In the pro. I think it's in the Proverbs where it says, you know, the. It says something like the gray hair, like the person's white hair is. Is his glory. And it's. It's a beautiful image because on the one hand, it's like your hair turns white, so it turns into light, but at the same time, it's you dying. And it's like, actually your dying is your glory. And so it's like as you settle into a kind of particularity, that's what Kind of shows your particular glory."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":927.12,"end":927.56,"speaker":"David Schindler","text":"Yeah."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":927.56,"end":936.48,"speaker":"Jonathan Pageau","text":"So it's a. It's an interesting. But. But it obviously can be disconnected from. From the universal. But it has to. It has to. It has both at the same time."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":936.84,"end":937.16,"speaker":"Ken Lowry","text":"Yeah."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":937.16,"end":954.28,"speaker":"David Schindler","text":"You know, along these lines, there's. There's a. The best, most compelling interpretation of beauty that I have read is from a thinker I think needs more attention on this matter. And that's Friedrich Schiller, and you mentioned play. He has this definition."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":954.28,"end":954.64,"speaker":"Jonathan Pageau","text":"On the."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":954.64,"end":1035.25,"speaker":"David Schindler","text":"On the surface, the definition doesn't sound like much, but when you. When he explains it, it really becomes fascinating. He says that beauty is the appearance of freedom. And what he means by that is, Jonathan, in a way, it's another way of saying the very point that you made. So he said, imagine just a straight line and a curving line. The curving line, he says, is more beautiful than the straight line. And why is that? The straight line represents a kind of an order that imposes itself sort of irrespective of the particularity of the matter there. It just mechanically is there and in a way allows nothing of the matter to appear. The curved line is the triumph of order, but it's a triumph of order precisely in the particularity and the constraints of the matter, where the very constraints of the matter become a means of expressing the freedom. So you get this incredible marriage. Use that word. Marriage, I think, is beautiful here, of form and matter. The from above, the from below, the concept and the practice, the. I mean, all these things. That universality in the particular. Somehow that's. Beauty is where it all really comes together."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":1035.65,"end":1051.02,"speaker":"Jonathan Pageau","text":"So it's interesting. Like the. I think one of the most satisfying images for a human person, and that's why it's so universal, is a. Is a straight line with a curvy line around it. I think that that's actually. I think. I think it's like hard coded into us when we see that."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":1051.18,"end":1052.94,"speaker":"David Schindler","text":"That line, you might say."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":1052.94,"end":1065.66,"speaker":"Jonathan Pageau","text":"Yeah, exactly. Like you see that caduceus kind of structure. I don't know, as I remember being very young and just drawing that over and over just because there was some weird aspect of it that was very, very satisfying."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":1065.98,"end":1066.5,"speaker":"David Schindler","text":"Yeah."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":1066.5,"end":1099.92,"speaker":"Jonathan Pageau","text":"And I think that when you think of those two together, like so Christ on the cross is a good example where. Where Christ is usually actually drawn as a. As a serpentine figure on the cross. But you have that. You have the straight, then you have the curve which comes and makes. And softens it and makes it, you know, and is also a kind of dying at the same time. It's not. It's not. It's like there's no going. There's no two ways about it. It's like there's a kind of letting go. Right. Of that. Of the. Of the strait."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":1100.25,"end":1100.65,"speaker":"David Schindler","text":"Yeah."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":1101.37,"end":1152.27,"speaker":"Jonathan Pageau","text":"But also attached to it. It's like. It's weird or. The cross, obviously, is hard to describe because there's too many things going on in there. But I. That my intuition. Contrapposto is a good example. Right. So if you have a basic, simple contrapposto that's not too excessive, then you really get that beauty. But if you have someone standing in front of you that is just like a pillar, Right. With their two feet, like, together, and just like. Obviously, it's not a natural position. Nobody stands like that. But you would feel it would be very eerie, actually, to face someone that way. And so the idea is to find the contrapposto. And if you look at Christian art, there's almost like a good. There's a visual discussion about reining in Roman contrapposto, but not eliminating it. So if you look at Byzantine images, the. The. The usual. The Roman contrappasso, for those who don't know what contrappasso is."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":1152.5,"end":1153.06,"speaker":"David Schindler","text":"Yeah, yeah."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":1153.06,"end":1163.06,"speaker":"Jonathan Pageau","text":"I don't know. Contrapposto is when you. Is when you have a figure that stands and then is unbalanced, has their leg out in one way so that their body curves."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":1163.3,"end":1163.86,"speaker":"David Schindler","text":"Okay."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":1163.86,"end":1193.31,"speaker":"Jonathan Pageau","text":"If you look at a baroque image, you'll have extreme contrapposto. Right. Like, kind of like that. Where. Whereas in the. In the Roman times, it was. That's how you would always show a figure. Right. It would be like one foot out and one foot straight, and it would make the whole body curve like an S. And if you look at Renaissance, The Renaissance recaptured the Roman contrapposto. There's something kind of. There's something almost erotic about just the. It depends how much you exaggerate it."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":1193.31,"end":1193.67,"speaker":"David Schindler","text":"Yeah."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":1193.67,"end":1209.87,"speaker":"Jonathan Pageau","text":"And so, like, imagine a woman, like, putting her hip out, kind of like sticking it out. Right. There's something a bit seductive about it. And then the Byzantines kept contrapposto. So if you look at a Byzantine image, you'll see the figures actually are not standing straight. A lot of people would say, oh, the medieval as an icon."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":1209.87,"end":1211.43,"speaker":"David Schindler","text":"When you say Byzantine, like a."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":1211.43,"end":1250.2,"speaker":"Jonathan Pageau","text":"Like a Byzantine icon, the figures aren't standing straight. In the. The late modern period, in, like, after World War II, some people started discussing medieval art and started saying, oh, medieval art is heratic. It's straight, it's. Everything is brought back to Like a kind of. But it's not true. If you look at medieval images, they do have a contrapposto. They do. They are standing off. But the question is, how much? How much is enough? How much is too much? And so how do you find that curve in the body, which is not overtly erotic, but suggests enough particularity for it to be incarnate and human and beautiful?"}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":1250.44,"end":1341.17,"speaker":"David Schindler","text":"Yeah, no, that's. I mean, again, that's why. What I like about Shiller's notion is that order is not simply eliminated or betrayed. It's expressed. But it's expressed in this precise. This unique way that in fact makes use of the constraints so that even the constraints become an expression of the inner freedom of the. And that sort of thing. So, you know, imagine, you know, you can think of a garden or you can think of the. You know, we find certain movements of animals graceful and other. You know, think of a frog leaping through the air. It's. I mean, there's nothing graceful about it. You know, if you watch in slow motion, it's. There's something ridiculous about it. And you see that the. The weight of the thing is overpowering its own ability. You know, so it's. It's violently reacting to it by launching itself in the air. But, you know, it's off center and off balance and just, you know, as opposed to, you know, a gazelle leaping or something and there. Or a bird flying. Yeah, there. You see that. That. There's a. There's a. There's. The bird has a weight. You know, it's light, but it's. It has a weight. But that very weight is what gives it the strength to move itself up. And. And. And there's not. There's nothing in it that doesn't contribute to. So nothing in it, including its constraints, including the things that. That in a way, could, from another perspective, be oppressive. Those very things become an expression of its own inner life and."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":1341.34,"end":1341.7,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":1341.7,"end":1342.18,"speaker":"David Schindler","text":"Reality."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":1342.18,"end":1342.98,"speaker":"Jonathan Pageau","text":"Yeah, that's."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":1342.98,"end":1344.78,"speaker":"David Schindler","text":"And we just find that beautiful to see."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":1345.26,"end":1351.58,"speaker":"Jonathan Pageau","text":"Because the thing that worries me when I see the. When I hear, like, an expression of free. Or. How do you say, an appearance of freedom."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":1351.66,"end":1356.06,"speaker":"David Schindler","text":"Yeah. The freedom in appearance. Freedom in appearance, in manifestation."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":1356.3,"end":1364.22,"speaker":"Jonathan Pageau","text":"Right. Is that. I'm hoping. I'm sure you didn't mean that, but it's like. Because we see artists that made that move."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":1364.38,"end":1364.74,"speaker":"David Schindler","text":"Right."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":1364.74,"end":1371.13,"speaker":"Jonathan Pageau","text":"But did it in a. A kind of. You could say a kind of classic manner."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":1371.13,"end":1371.93,"speaker":"David Schindler","text":"Right, right."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":1371.93,"end":1373.53,"speaker":"Jonathan Pageau","text":"So you find, like. I mean."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":1373.61,"end":1378.89,"speaker":"David Schindler","text":"Yeah. To qualify. He doesn't mean freedom in the sense of, like, arbitrary power. To choose."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":1379.37,"end":1379.73,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":1379.73,"end":1388.65,"speaker":"Ken Lowry","text":"You're meaning freedom in the sense of that. Of freedom as. As a responding to the call of the good more than. Than freedom as an assertion of oneself."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":1389.13,"end":1389.77,"speaker":"David Schindler","text":"That's right."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":1389.93,"end":1399.96,"speaker":"Jonathan Pageau","text":"In the art world, what you have in the 20th century is people who declare, you know, without thinking twice, that. That art for art's sake."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":1400.12,"end":1400.64,"speaker":"David Schindler","text":"Yeah."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":1400.64,"end":1435.92,"speaker":"Jonathan Pageau","text":"And so what we want is to. We want to liberate ourselves from art's imprisonment to particular crafts or to particular ideologies or whatever. So I just reread Portrait of the Artist as a Young man. And you see. Right. The. The. The narrative arc of that is that Joyce has to free himself from religion, free himself from his family, free himself from. From his nation in order to become an artist that can focus now on beauty. As if beauty expresses itself outside of these constraints and outside of these frames."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":1436.72,"end":1456.65,"speaker":"David Schindler","text":"Right. Fly past those nets. He says. Yeah, no, that's. That's a. That's. It's a very different. I mean, that's why you realize these. These questions about what beauty is involve, I mean, a fundamental interpretation of the. Of the meaning of the world, the meaning of being. You know, it's not just a question of taste."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":1456.97,"end":1457.45,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":1457.85,"end":1463.57,"speaker":"David Schindler","text":"The meaning of order. And speaking of the meaning of order, I don't know if you're familiar with Christopher Alexander View."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":1463.57,"end":1464.01,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":1464.65,"end":1504.67,"speaker":"David Schindler","text":"He expresses some of these things really, I find in really compelling way that, you know, the contrast to art for art's Sake would be this notion of the integration of. Of life and art. This is a principle you talk about in that. That one video. But. But a healthy integration where there's, you know, there's nothing that beautiful that's not useful and. Nothing useful that's not beautiful. And, you know, you don't have, like, mechanistic use on the one hand and then try to add superficially onto it completely meaningless ornamentation to sort of heal the. The violence of the."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":1504.67,"end":1511.59,"speaker":"Jonathan Pageau","text":"Of the, you know, of the mechanical world. Exactly. Yeah. To heal them. Heal the violence. That's a beautiful way of saying it."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":1511.67,"end":1512.11,"speaker":"David Schindler","text":"Yeah."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":1512.11,"end":1553.81,"speaker":"Jonathan Pageau","text":"I think that that's exactly the. That's the. The good diagnostic of what happened in. In the 20th century is that art and it. What it did is it also made everybody ultimately alienated because the. The art that was born. The high art that was born out of the modern period became so abstract and so difficult that it left everybody behind, and so nobody really ended up caring. So, I mean, let's say it like James Joyce, Portrait of the Artist as Young man is actually really fun to read. It's beautifully written and it's amazing. But read Finnegan's Wake and you just want to pull your hair out at every page because it's just. It's just inaccessible."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":1554.3,"end":1554.98,"speaker":"David Schindler","text":"That's for people."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":1554.98,"end":1563.1,"speaker":"Jonathan Pageau","text":"It's just a comp. I mean, it's. It's dense and it's. And it's full of patterns and numerical symbolism and it's all that. But it's like it's impossible to read."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":1563.74,"end":1626.6,"speaker":"David Schindler","text":"You know, and there's a connection between. This is something I've been thinking about recently, the marginalization of art and. And even philosophy from the. The public square. You know, I mean, it used to be the case that the thinkers and the artists were figures of authority of a certain sort and they spoke right in the center of the public square. And what they said and what they made then gave ordering to life. There was something that communicated itself in terms of the public horizon. But now we have this completely abstract sense of what politics is on the one hand, in the public sphere is again, sort of a mechanical order that has nothing to do with human life. And then we have to, in a way, champion these extreme expressions of life and subjectivity on the side. And then you get this strange dialectic between the two."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":1626.84,"end":1640.77,"speaker":"Jonathan Pageau","text":"Yeah. Where nobody is. And then the arts that are available to the public square are basically just like, you know, like a hit of cocaine. Like they're just basically like. It's just."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":1640.77,"end":1641.97,"speaker":"Ken Lowry","text":"They're just pornography."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":1642.13,"end":1706.17,"speaker":"Jonathan Pageau","text":"Yeah, it's basically pornography. It's like. It's just a beat, you know, a beat that you dance to or like, you know, a lit up advertisement that you look at. It's like. It's like everything has been reduced to. To immediate pleasure and to mechanistic. To mechanistic. To mechanized, kind of mechanized cold reality. So we don't have the, you know, and that's why, like, that's why I tell people go to church. One of the reasons, obviously I want people to go to church for their own spiritual salvation life, but for their own salvation. But there's also the idea that the church is one of the only places left in the world where you sing for a reason. Right. Where you. Where you move for a reason. Where you could have beauty for a reason. And that you can be inside and participate and that we all are in this dance. And it used to be that all of society had some aspect of that dance to it, but it's broken down so much that there are few places except for maybe your home, your family and the church, where that is still accessible to us. Yeah."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":1706.49,"end":1741.11,"speaker":"Ken Lowry","text":"You know, it makes me think about. You brought up the notion of seduction before when you were talking about the contrapasso. And it seems like true beauty sort of seduces you, like in. In the Socratic sense of seduction. Like, it seduces you toward the good. It's a. It pulls you deeper into reality. But then there's this, like, in these more pornographied forms, there's the seduction of the art becomes a pull into the abstract. It becomes a pull away from that healing of the mechanistic wounding. Like."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":1741.35,"end":1838.49,"speaker":"Jonathan Pageau","text":"Yeah, but it's always. Art is always a dual. It's in the scripture, techne, art, applied science, and not just in the Bible, but also in kind of Greek. Greek mythology and ancient thinking. It's always a dual. It's a dual thing. It's not. It's not. It's not clean. It's not just simply. There's a. There's a. There's a healthy suspicion towards it because. And if you look at how Plato was like, you know, get rid of those artists because they. Because they can make you think something's beautiful even if it's not. Right. They're tricksters. They can. Propagandists. And in scripture, you can see that the applied arts are from Cain and they bring about the Flood. And so there's this very dark aspect of what they can bring. But then God is constantly saving that which has fallen. He's constantly covering the. The elements. So man develops technology, develops cities. And God's like, all right, you know, and then he's like, okay, well, I'll give you a pattern for the tabernacle, you know, and then I'll give you. Then we'll found Jerusalem and we'll have. So it's like there's this covering of the. Of the. But it's always dual, even though. Even if. And the. The bronze serpent is a great example, because the bronze serpent. In the story of the bronze serpent, you get the two right? It's like God tells Moses, put up the bronze serpent, and this will. This will become like an image that everybody can look at and that it'll heal the. It'll heal the nation. And then later in the Bible, it's like, cut it down, burn it, because it'd become an idol."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":1838.89,"end":1839.37,"speaker":"David Schindler","text":"Yeah."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":1839.45,"end":1840.65,"speaker":"Jonathan Pageau","text":"The very same object."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":1841.05,"end":1860.87,"speaker":"David Schindler","text":"Yeah. I like how you said Plato's concern that these artists can make something that look beautiful that isn't. I think that that formulation is really crucial because I would want to hold on to the idea that it's not that Beauty is morally ambiguous and there's good."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":1861.19,"end":1864.47,"speaker":"Jonathan Pageau","text":"No, it's art that's more the ambiguous but not beauty. Right, right."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":1864.47,"end":1915.56,"speaker":"David Schindler","text":"No, but that's a really crucial point because I think people miss that. I mean that in fact beauty itself. And I think one of the reasons that it's, as you say, it's not clean, it's not sort of obvious is I like to say that beauty has something of an invitational character. It's sort of. It welcomes and opens up and invites. But that, you know, that appeals to freedom on the recipient side. One has to respond properly to it. And because one has to respond properly to it, there's built into that the possibility of betrayal, of taking it, interpreting it, falsely taking it as kind of immediate gratification. Because I think, you know, there's no such thing as impure beauty. In fact, I mean, beauty always, even in impure cases, there's a glimmer of something that's true that can in fact lead one out of the impurity."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":1915.8,"end":1939.91,"speaker":"Jonathan Pageau","text":"Yeah. There's a crazy story from the desert fathers of these monks that are walking down the road and then all of a sudden this, this woman, young woman, you know, like naked on a, on a, I think she. On a donkey or something like walking towards them. And all the monks are like just diverting their eyes, like, don't look at it. And the one, this one old monk, he's just looking at her like kind of. And then when they go by all the other monks, like, why were you looking at her?"}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":1939.91,"end":1940.15,"speaker":"David Schindler","text":"And really."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":1940.15,"end":1949.03,"speaker":"Jonathan Pageau","text":"Because she was so beautiful. Yeah. And it was just like for him, he had, it's like he was beyond the desire. He was just seeing a beautiful creature of God."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":1949.91,"end":1951.63,"speaker":"Ken Lowry","text":"Because it's always just, it's."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":1951.63,"end":1955.31,"speaker":"Jonathan Pageau","text":"Well, for most of us that's probably best not to engage that way."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":1955.31,"end":1977.12,"speaker":"Ken Lowry","text":"But it's just like which side of it you're on. Almost like can, can the arrows that, that. Because I think of that in like the problem of the erotic. Right. This problem of the erotic in a downward sense. Right. Like I'm trying to consume, I'm trying to have, I'm trying to take versus Eros in a higher sense that this is becoming a way for me."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":1977.52,"end":2085.32,"speaker":"David Schindler","text":"Yeah, yeah. I mean that's, that's. I mean, and it's not, it's not that Eros is two faced or something, but that, that, that Eros in principle is a call to what's higher, but it's a call that, that can be falsely interpreted or betrayed. I mean, I think that's. But I mean, the interesting thing, and this is, you know, Plato is so fascinating on this, you know, the good. Jonathan, you were talking about how modern art doesn't speak to people. It speaks only to experts, you know, and then, and then the masses. Christopher Alexander is really good on this. There's a kind of. The masses then sort of go along with it because the experts tell them that this stuff is beautiful, even though it makes them feel sick or anxious, you know, when they get it, that, that, you know, goodness, there's. The idea of the good has a certain kind of inaccessibility and, you know, kind of a perfection that might make it seem, a transcendence, might make it seem out of reach, but there's, there's not, there's no human being on earth that doesn't respond to beauty. You know, truth. We could, we can, we can ignore goodness, we can, but everybody responds. Beauty, there's a certain, there's a, you know, if you think of, to use a kind of Christological image that, you know, beauty in a way is goodness leaving its transcendence in order to enter into the very depth of the, of the material of the flesh, you know, the incarnation to the very ends and that place able to sort of speak and call one back up. There's something really profound about the Christian understanding of that, I think, I think."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":2085.32,"end":2174.02,"speaker":"Jonathan Pageau","text":"So in the book of Revelation, the image of the heavenly Jerusalem is one of my favorite ones to kind of understand the relationship between techne and, and let's say human civilization and its relationship to God. And so there. One of the descriptions of the heavenly Jerusalem, it says that all the nations bring their glories into the city and it says that all the kings offer their glory into the city. And so the idea is that all these externals, right, they, they have to be offered up and that's the way for them not to become dangerous. Right? It's like, like you said, it's like the Eros. If the Eros is transparent and Eros pulls you through things into the presence of God, then it's, then that's the right, that's the right way to, to, to, to deal with it. But the problem of course, is that because it offers certain pleasure, then it can seduce you to stay at the level of the appearance or to stay at the level of the first, you know, and so I, I like the way that the church fathers that, well, the, the, the, the, the Hermet, the, the, the, not the desert father, but like the, the, the monks in the philokalia, how they talk about say, spirit Hesychastic fathers like this, this spiritual tradition in terms of. Because it's because philok kalia means the love of, of. Of beauty."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":2174.42,"end":2174.86,"speaker":"David Schindler","text":"Yeah."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":2174.86,"end":2180.48,"speaker":"Jonathan Pageau","text":"But then in the tech, they're saying, they say weird things. Like they'll say, ignore all spiritual experiences."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":2181.52,"end":2181.92,"speaker":"Ken Lowry","text":"Right."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":2181.92,"end":2198.96,"speaker":"Jonathan Pageau","text":"It's like if you have a vision, ignore it. If you have seen a miracle, ignore it. Ignore everything. And you think like, what a weird thing to say. Like, why are they doing that? And, and you think, are they against the beatific vision? Are they again? And you're like, well, obviously not, because the tradition is full of them."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":2199.04,"end":2199.36,"speaker":"David Schindler","text":"Right."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":2199.36,"end":2206.4,"speaker":"Jonathan Pageau","text":"They're not against it. They're saying it's almost like if you ignore it, if you don't attach yourself to it, you'll actually have more of it."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":2207.03,"end":2207.47,"speaker":"Ken Lowry","text":"Right, Right."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":2207.47,"end":2210.23,"speaker":"Jonathan Pageau","text":"And then you'll actually be, you'll be gathered up higher."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":2210.79,"end":2211.19,"speaker":"Ken Lowry","text":"Yeah."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":2211.19,"end":2222.15,"speaker":"Jonathan Pageau","text":"So it's not. So it's like, yeah, you'll see miracles. You'll see all that stuff. Just don't attend to them too much because then you lose the purpose of them being just a, A kind of a pull into the higher states."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":2222.63,"end":2244.66,"speaker":"Ken Lowry","text":"Yeah. It's the same as the monk walking down the road. Right. Like if it's more obvious to everyone that there's some sort of shame associated with, you know, you stopping at the level of the naked woman, but if you stop at the level of, hey, I had a great vision, I had this great transcendent experience, it's similar. You're still doing the same thing. It's just, it's more acceptable."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":2244.82,"end":2245.3,"speaker":"David Schindler","text":"Yeah."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":2245.86,"end":2246.58,"speaker":"Jonathan Pageau","text":"And so it's."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":2246.58,"end":2276.76,"speaker":"David Schindler","text":"So I, I like this principle though, that, that doesn't mean then losing the pleasure of it. I mean, paradoxically and ironically, it's deepened like the, the example that you gave from the church fathers, but in Plato too, you know, the philosopher, I wish I had the exact number. He says that the, the philosopher, in a way, compared to the one who's seeking pleasure, ends up actually having something like 529 times the pleasure."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":2276.76,"end":2277.52,"speaker":"Jonathan Pageau","text":"The pleasure."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":2277.84,"end":2287.55,"speaker":"David Schindler","text":"He does the calculation. Yeah. Precisely. Precisely because he's, he sees it in relation to its ultimate source, its origin. It's, it's first principle."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":2287.87,"end":2312.83,"speaker":"Jonathan Pageau","text":"Yeah. I'm always asking people in some of my, in my talks whether who has most of the most pleasure, a millionaire at a banquet or a monk that's eating bread and has fasted for three days. It's like, it's pretty sure that the monk is having more pleasure than the millionaire, but he's not looking for it. Right. He's doing. He's kind of trying to avoid it, but then it's coming to him like there's no way to avoid it."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":2313.14,"end":2328.9,"speaker":"Ken Lowry","text":"Yeah, this, this reminds me a little bit of Jesus's parable of the talents. Right. Because those guys, like, it's the ones that give it away that they get more of it. It's like, great, I got it, I got a talent or, you know, now I've got two talents or whatever. But every time you get it, you give it back away."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":2329.94,"end":2332.7,"speaker":"David Schindler","text":"Yeah. Losing your life is finding it."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":2332.7,"end":2333.14,"speaker":"Jonathan Pageau","text":"It's."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":2333.14,"end":2334.98,"speaker":"Ken Lowry","text":"Yeah, yeah, yeah, yeah."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":2334.98,"end":2356.51,"speaker":"Jonathan Pageau","text":"Well, that's why the question of beauty in Christianity, it's like, it's a, it's a weird and, and sometimes, how can I say this? Like, I think the, the orthodox, I think sometimes get it a little off because there's something about Christianity and beauty which is paradoxical because there's a sense in which we're, we're meant to see beauty in the extreme of its ugliness."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":2356.75,"end":2357.11,"speaker":"Ken Lowry","text":"Yeah."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":2357.11,"end":2425.21,"speaker":"Jonathan Pageau","text":"Like we're kind of asked, it's almost like we're asked to, to be willing to go to the end of what we consider to be pain and suffering and ugliness and, and all these things and to, and to, and to have. And that there's some glory, there's some hidden beauty in that. And obviously it's dangerous because I don't want people to think this is a kind of masochistic thing. I don't think it is. But you know, there is something about, about the cross which is weird. Like it's a terrible thing. But then it's also, we say, you know, the life giving Cross. We say that, that it's the, the, that Christ on the cross is creating the world, that he's the Garden of Eden, that he is the, you know, that he's a flower. Like all these images that were used even in the Middle Ages of the rose on the cross or different types of, of images and the same thing with martyrdom and relics and all of these, these things that happen in Christianity which is this strange paradox of, of beauty in the. In the least expected place or beauty in the, in the. So that's, that's a, that's a one."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":2425.21,"end":2553.2,"speaker":"David Schindler","text":"To integrate the, There's a. Benedict XVI has an address to the ministers of culture. It's a, it's available online. It's just a short address that he gave. But he, he speaks about that paradox and the Christian appropriation of the ancient sense of beauty and eros and how it, it acquires this Paradoxical character. Precisely. In the cross. It really is moving. You know, I, I don't, I don't want to be sort of seem obsessed with Plato here, but even expect you to be. Plato has a, has a, an anticipation of this. I mean, it's, it's, it's amazing that he, you know, he presents Socrates himself, sort of notoriously ugly Socrates, you know, as when he opens up, you know, in the Symposium. And you see that the, he's like the, the statues that have the statues of gods inside of statues of gods. And when, when Socrates, you open them up, you see these glories that are, you know, it's spellbinding. So there's, there's something about that, the paradox of a more radically transcendent and glorious beauty in the most extreme. I think precisely because of the. Augustine says that one of the things that constitutes beauty is contrast. And I think we all find things like paradox striking. For that reason. I'm going to actually use that as a way to tie into an earlier point that we made right in the beginning of the conversation, unity and difference, that we might think that collecting different things under a unifying idea is the essence of beauty. And there's something really true about that, but there's also something about the differentiating of unity that's also beautiful. And I think in something like paradox and contrast. And then the ultimate example is the glory of the Lord, as Hans from Balthazar would say in the Cross."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":2553.36,"end":2553.8,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":2553.8,"end":2572,"speaker":"David Schindler","text":"Here you have what would seem to be an. An absolute difference. An absolute difference, you know, moving all the way to nothing, suddenly itself reveals itself to. To be the deepest unity. There's something about that that becomes unspeakably. Yeah."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":2572.48,"end":2573.04,"speaker":"Jonathan Pageau","text":"And it's."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":2573.04,"end":2576.68,"speaker":"David Schindler","text":"And you have to avoid. You have to avoid the sadomas. I mean. Right. One can."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":2576.68,"end":2576.96,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":2576.96,"end":2578.08,"speaker":"David Schindler","text":"Well, it's reverse reading."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":2578.08,"end":2655.77,"speaker":"Jonathan Pageau","text":"It's also because the, because like if as an artist, I think as an artist and someone who's. It's the kind of question you have to ask yourself. Because. So let's say if you look at Francis Bacon as a painter, let's say he's a good example where, you know, his most. One of his most known works is called Crucifixion. And it's like a. It's like these broken monsters really is what's going on in that image? And the question is, what is. So what's the difference? Right. So it's the same like, for example. I'll give another example. I thought that Mel Gibson's Passion was over the top. Like, I Like Mel Gibson, and I like his movies. But that movie, I just. I watched it and I thought that it was indulging. It was indulgent. There you go. It was indulging in violence in a way that I thought was. Was not useful. But it's not for some. A lot of people had a different reaction to it, but. And so if I look for. I look, for example, like late, like kind of Spanish or like Mexican crucifixes, and you see Christ, you know, his. His knees are laid, and, you know, it's like he's got. He's. He's just. Like his. His whole body is just ripped apart, and it's like, this is the crucifix in the church. Right?"}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":2655.85,"end":2656.25,"speaker":"David Schindler","text":"It's."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":2656.25,"end":2674.67,"speaker":"Jonathan Pageau","text":"It's. So. I like, what's the balance? How do we find the balance? Where we're showing the scandal of the crucifixion, but we're also trying not to indulge our fascination for. For something that is, you know, our dark fascinations, let's say, for death. And it's the same with music, too, right?"}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":2674.67,"end":2697.64,"speaker":"David Schindler","text":"No, these are. These are delicate matters and require real prudence and spiritual discernment. I mean, because there's a drama in this, you. You know, it's problematic. You simply rule certain things out. It's problematic if you kind of automatically affirm them. There's. There's a. There's a real. Discernment is the best word that is essential at every moment."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":2697.88,"end":2698.36,"speaker":"Ken Lowry","text":"Yeah."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":2698.68,"end":2729.76,"speaker":"Jonathan Pageau","text":"And there's also, like, a shock. Like, there's a. There's a sense of shock that is dangerous in the realm of beauty, because it's. It's. It's like the popcorn version of beauty because it creates intense experiences, but it usually fades very quickly. And so you can create. You know, it's like watching a horror movie, right? You can create intense emotion, aesthetic intense emotions in people, but those are not. You know, they're not very deep. They don't. They don't transform."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":2729.84,"end":2732.6,"speaker":"David Schindler","text":"Transform you. Yeah, that's the word. Yeah."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":2732.6,"end":2768.82,"speaker":"Jonathan Pageau","text":"Yeah. And so I. It's like. It's important, especially if we're. We're in a world now that we're kind of struggling. I think a lot of the churches are struggling to figure out how to deal with the question of beauty and the question of music, the question of participation. You know, I. I have. Weirdly enough, like, I'll. I have Protestant pastors who want to meet with me and talk to me about how do we find this. This balance between the entertainment kind of flashy light show rock and roll culture that so many churches have fallen into. And then."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":2769.22,"end":2770.94,"speaker":"David Schindler","text":"Yeah, sorry, I don't want to interrupt."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":2770.94,"end":2771.78,"speaker":"Jonathan Pageau","text":"Go ahead, go ahead."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":2771.78,"end":2787.42,"speaker":"David Schindler","text":"Well, just, just, I mean, there, you see, that's, that's beauty. That's being used as a, a kind of strategy for, for recruitment or proselyte or. We're going to, we're going to use this to communicate a message and that's."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":2787.5,"end":2789.34,"speaker":"Ken Lowry","text":"You know, become technology in a way."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":2789.98,"end":2805.35,"speaker":"David Schindler","text":"Yeah, right, There you go. We, we need to come back to that technology question at some point. Yeah, it'd be, it's, it's sort of a technological use as opposed to, I would say as opposed to something that would be like a genuine techne. That would be an interesting way into that."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":2805.51,"end":2813.67,"speaker":"Jonathan Pageau","text":"Like. So what you mean by, by technological use is something like pure, pure utility, like. Yeah, I would."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":2813.67,"end":2819.75,"speaker":"David Schindler","text":"I. From, for me, it's where you separate means from ends and you, you kind of perfect means as a kind of."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":2821.35,"end":2823.99,"speaker":"Jonathan Pageau","text":"Power, an instance increase in power. That's. Yeah."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":2824.23,"end":2844.36,"speaker":"David Schindler","text":"That can be then used indifferently. So it's, it's defined in neutral. As neutral, yeah, in itself. And then it can be used indifferently for good or for evil, as opposed to. Techne was always understood as doing something useful. I mean, so it was always, it was always a means that's appropriate to the ends that it seeks to."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":2844.44,"end":2878.09,"speaker":"Jonathan Pageau","text":"Yeah, but I would, I would push, I'd push back a little bit on the idea that it, that it used to be understood as completely useful. There's this weird tradition about, for example, the Asclepius. Right. So Asclepius is the. Creates these. Met this medicine. And the way he does it is that he takes blood from the right side of the gorgon. So he, he takes this dead Gorgon and he takes blood from the right side and then out of that he creates the medicine. And what is suggested obviously by that myth is that the blood from the left side of the gorgon is the poison."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":2878.57,"end":2878.89,"speaker":"David Schindler","text":"Right."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":2878.89,"end":2907.7,"speaker":"Jonathan Pageau","text":"So you have the venom of the snake and then you have the, the pharmakon. The pharmakon, yeah. And so the question of the pharmakon, I think was already quite. And if you read in, in my mind, in Plato's, when he talks about writing, what's the name of the dialogue? Yeah, the Phaedra. He has, he seems to have what. He seems to understand that, which is what Derrida kind of jumps on in his text, but he seems to understand the duality of, of externality, the duality of application the problem of that."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":2908.11,"end":2977.19,"speaker":"David Schindler","text":"Yeah, yeah. I mean, I, I, the, the duality. But I, I, it seems to me that there's a difference between, so there's always, you know. One of the, the best examples too is, is, is Sophocles. I think it's the, the second chorus, I believe, from the Antigone. I want to say Heidegger made a lot of this, but this, this celebration of man's ability. But it's a celebration that very subtly, ironically, you know, with that kind of Sophoclean tragic irony, you realize there's something also awful about it and destructive and terrible. But it's, those things are mixed together. I mean, I think that that is always there. I mean from the beginning with the, with the Prometheus, you know, in a way that the arts are divine, but they're, they're stolen rather than divine gifts, in fact. I mean, so there's, there's always a kind of ambiguity. So I, I think that that's always there. But I, I, for me, technology, it's not just that it's more ambiguous or something. I think it's, it's of a very, a modern technologies of a very different nature. It's a, it's, it's actually a different kind of thing."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":2977.19,"end":2995.7,"speaker":"Jonathan Pageau","text":"Well, it's, it's an extreme, it's an extreme version of what techne used to be. Even though it used to be, you know, in more ancient times they would have been more integrated, just. But people could perceive through even their integration the possibility of the dangers. But now we have something like, you know, a microchip."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":2995.86,"end":2996.34,"speaker":"David Schindler","text":"Yeah."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":2996.34,"end":3011.86,"speaker":"Jonathan Pageau","text":"That will increase your processing power by so much. You know, all for a medical machine or for a missile. It doesn't matter like it, it's just this, it's just increase in power and it can be used to whatever pointed in any direction possible."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":3012.18,"end":3012.54,"speaker":"David Schindler","text":"Yeah."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":3012.54,"end":3016.63,"speaker":"Jonathan Pageau","text":"And people see that as good though. People see just increasing power or they."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":3016.63,"end":3018.39,"speaker":"David Schindler","text":"Say that it can be good. Right."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":3018.39,"end":3018.55,"speaker":"Jonathan Pageau","text":"So."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":3018.55,"end":3029.63,"speaker":"David Schindler","text":"Well, that's the problem. They, they, Once we get the power, then we'll figure out how to use it. That's, and there's a, there's a disorder that's built in. But Kenya, you keep wanting to jump in here. I don't know if, if we're cutting."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":3029.63,"end":3077.63,"speaker":"Ken Lowry","text":"Oh no. Well, I kind of got distracted there because that just, that brings us back to this whole notion of freedom. I mean, as soon as, like as soon as freedom becomes, takes the place of goodness as the ultimate telos, right. As soon as that becomes our goal and becomes defined as power to make choices. Right? Then as soon as that's. I feel like it has to do with like why you're doing the thing. If you're doing the thing because it's actually ordered to a real end. That's really good. Right? Like if, if you're, if you're trying to build a house, like it's actually ordered to something. And so you're going to, you're going to build a hammer that has a use in relation to something beyond it versus, you know, just building a bigger hammer just so you can have it because you never know when you might need it."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":3077.87,"end":3106.62,"speaker":"Jonathan Pageau","text":"But there's even a trickery like in terms of increase in power, especially now because we still live in a kind of post Christian world, there's like a weird trickery that's, that's put up to us, which is that things, the technologies that are the most destructive will be the most destructive. They're often presented to us at first as beneficial. So it's like Elon Musk, let's put chips in your brain and that'll. People can walk. I mean, think about it. Like, I mean, are you going to say no to that?"}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":3106.62,"end":3106.94,"speaker":"David Schindler","text":"Right?"}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":3106.94,"end":3108.82,"speaker":"Jonathan Pageau","text":"How can you say no to helping people?"}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":3108.82,"end":3110.22,"speaker":"Ken Lowry","text":"It's a total Motten Bailey."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":3111.42,"end":3133.9,"speaker":"Jonathan Pageau","text":"And it's like, it's the same with, with so many of these, these especially these crazy new technologies, especially the biotechs. It's like, it's like, oh, you know, all this stem cell research is great because, you know, all these diseases we can cure. And it's like you don't see that there's also some very dark things coming down the line in terms of, of transhumanism and transformations of humans into who knows what."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":3135.18,"end":3192.2,"speaker":"David Schindler","text":"Well, that's. Yeah. No, and I, I think that that problem is a profound and subtle one that requires real reflection because, you know, I think we, we come to such quick judgments. But the supposed neutrality, you get the neutral technology and then you get afterwards the exhortation to use it for good ends. But we can't help that there's going to be some people. I mean, but the very neutrality of it is already a departure from reality. It ends up substituting. This is why I use the language of the diabolical there. It creates a kind of a substitute for an engagement with reality that then can try to justify itself by pointing to all of these discrete good uses. But that, but in a way that's. That there's, there's something really deceptive about the whole thing."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":3192.44,"end":3232.32,"speaker":"Jonathan Pageau","text":"Then you look at the. If you look at the. At the Mennonite communities or the Amish, and you. You look at how they do it, and it's interesting because people always think that the Amish are these communities, that they're against technology, but they're not. Actually. They have the. All they do is they take. Every time they. Someone. They're presented with technology, they ask themselves, what effect will it have on our community? And then they integrate it. Or they don't, depending on what effect it'll have on their community. Yeah, I mean, that's an interesting approach. You know, obviously, on the one hand, it makes them constantly in danger of vanishing, but on the other hand, it might make them more resilient than us in the long term. When we're all. When we're all gone, the Amish will still be there."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":3232.32,"end":3240.62,"speaker":"David Schindler","text":"No, it is. It is. You know, in fact, my wife and I just took our kids to a Mennonite community a couple weeks ago to a hymn. Sing that. They did."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":3241.02,"end":3242.46,"speaker":"Jonathan Pageau","text":"Yeah. These four. Four voice."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":3243.5,"end":3244.3,"speaker":"Ken Lowry","text":"I grew up there."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":3244.62,"end":3245.1,"speaker":"David Schindler","text":"That was."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":3245.1,"end":3246.1,"speaker":"Ken Lowry","text":"That was my upbringing."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":3246.1,"end":3248.3,"speaker":"David Schindler","text":"Oh, is that right? Beautiful. It was."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":3248.46,"end":3248.78,"speaker":"Ken Lowry","text":"But."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":3248.78,"end":3275.19,"speaker":"David Schindler","text":"But yeah, I mean, that's. That was the Luddites, too. I mean, they get sort of a bad rap and people misunderstand. They weren't. They weren't against technology either. They just said that technology is good insofar as it helps humanity, and it's bad when it stops doing that. That seems to me an eminently reasonable. Now, one can debate about where that line is, but it's a reasonable judgment. And it seems to me, yeah, there's. There's. There's. We need to recall it. I mean."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":3275.91,"end":3304.79,"speaker":"Jonathan Pageau","text":"Yeah, but it's too late now because. And this brings up the AI question is the one that is exposing all of this radically, which is that you. They. You know, the. This famous poll that they put across the people that are developing AI, and a large chunk of them believe that there's a chance that it will destroy humanity. And it's like, well, what? That it'll destroy it all? Just destroy humanity completely. And the question is, how is it that they're still doing it? Like, what's."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":3304.79,"end":3306.27,"speaker":"Ken Lowry","text":"How do you go to work in the morning there?"}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":3306.59,"end":3308.19,"speaker":"Jonathan Pageau","text":"Because they think that it's inevitable."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":3308.43,"end":3308.91,"speaker":"Ken Lowry","text":"Yeah."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":3309.39,"end":3311.23,"speaker":"Jonathan Pageau","text":"And so if we don't. If they don't."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":3311.23,"end":3313.71,"speaker":"David Schindler","text":"If I don't do it, somebody else is going to. Right."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":3313.79,"end":3347.34,"speaker":"Ken Lowry","text":"Well, and this, like, this brings up the question to me always. It's like it's probably once a month that I sit and really think honestly about ditching a smartphone and Going back to a flip phone. And ultimately I haven't done that because there's, it would basically, it would disrupt my life enough that I won't do it. But I mean, when it comes to personal application, like, I don't know what, what to make of this sort of question, like, where do we stop? Like, if I don't, if I don't participate with AI, am I just jumping off the boat?"}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":3347.34,"end":3349.74,"speaker":"Jonathan Pageau","text":"First of all, have you tried Chad GPT?"}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":3350.38,"end":3351.78,"speaker":"Ken Lowry","text":"I've done minimally."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":3351.78,"end":3358.38,"speaker":"Jonathan Pageau","text":"It's amazing. Like, well, I had, like you have your own research assistant, like full time research assistant. That's what it is."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":3358.38,"end":3378.03,"speaker":"Ken Lowry","text":"I had it. I had to analyze all, all the videos on my YouTube channel and I asked it, you know, what would you talk about, you know, what would you say Ken, Ken Lowry is doing with climbing Mount Sophia? And what it gave me back was significantly more thorough and profound, I think, than what I could have put together in, you know, half an hour of typing."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":3378.27,"end":3409.26,"speaker":"David Schindler","text":"I have to say somebody sent me a, a Chat GPT little essay on one of my books just to see what I would think of it, you know, and I was astonished, first of all that, that it was as sophisticated. But I, but I have to say I, I quite honestly had the experience that I often have reading some of my grad school grad student papers where you, you see that they're saying things that they, that they heard you say in class. They can put them together in interesting ways, but that they never really got the point."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":3409.58,"end":3428.27,"speaker":"Jonathan Pageau","text":"No. And that's why they're your research assistant. That's right. Right. Right is not. Don't want it to write for you, but you can use as a research assistant. It's a, it's quite astounding. But I was like, I, I can see it. Like, I'm not, you know, my, it's weird because the first time I used Chat GPT it lied to me. The first time."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":3428.35,"end":3428.91,"speaker":"Ken Lowry","text":"Oh really?"}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":3429.55,"end":3430.79,"speaker":"David Schindler","text":"And you don't know that, right?"}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":3430.79,"end":3432.99,"speaker":"Jonathan Pageau","text":"I mean, it totally lied to me. And then about what?"}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":3432.99,"end":3433.79,"speaker":"Ken Lowry","text":"Like what happened."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":3433.79,"end":3479.53,"speaker":"Jonathan Pageau","text":"It was, oh, wait. So I, I, I would, my, my son had been using it and he said he's got to try this. I'm like, and I was being just like a grumpy old man. So I'm like, like, fine, whatever, I'll try it. And so I just, one evening I, I logged into the Chat GPT and I, and I asked him if he knew about St. Christopher because that's obviously what I was going to ask him about. And if he knew that St. Christopher was a dog headed man. And first he was like, no, he's a giant. And kind of argued with Chatgpt for a while. Finally he admitted that St Christopher is sometimes a dog headed man. But then I asked him, oh, I said, has anybody ever written a graphic novel about St. Christopher? And he said, yes. And I'm like, really interesting. And then he gave me the name of two authors and the name of a book that doesn't exist."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":3480.25,"end":3480.73,"speaker":"David Schindler","text":"Wow."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":3480.81,"end":3495.53,"speaker":"Jonathan Pageau","text":"And so then I said, that book doesn't exist. And he says, yes, it does. And I said, what's the ISBN? He gives me an ISBN that doesn't exist. I said, I said, where can I find. He said, you can find it on Amazon. You can find it on this or that. I'm like, can you give me a link? He gives you a link that doesn't exist. It was very weird."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":3496.01,"end":3496.45,"speaker":"David Schindler","text":"Wow."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":3496.45,"end":3498.17,"speaker":"Jonathan Pageau","text":"Yeah, it's very strange. Anyways."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":3498.41,"end":3539.74,"speaker":"David Schindler","text":"Yeah, well, I, I mean, the thing is, I, yeah, the, the, the. I don't think we can give up on these questions. And I think that the challenge that this poses, I mean, Jonathan, you mentioned the sanity of going to church and having a genuine experience of some of these human realities that we don't have elsewhere. I mean, this sounds like just sort of superficial exhortation, but somehow that has to penetrate into the shape of the world too. And I, and I mean, I, I, you know, that's, I guess the big task that."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":3539.74,"end":3664.84,"speaker":"Jonathan Pageau","text":"Yeah. So I, the only things we, I think the thing we can do is really just because there's also a certain faith that true beauty will survive. You know, and it's a, it's not a, just a, how can I say this? Obviously there are accidents, but it's not just a, a kind of blank statement of faith. It's also that people care about beautiful things and they, that when they decide to destroy a building, usually they'll destroy the nice building last. They'll destroy the ugly buildings first. And then. So there's a sense in which beauty has a evolutionary advantage. Right. In terms of preservation. So I, and so I think that making beautiful things and beautiful art and beautiful music is a good, it's a good strategy in terms of our current situation because ultimately I think that will survive the popcorn, like the, the, the superficial advertisement culture, at least as an artist, that's been my. And also like, for me it was aim high. It was like, okay, well, where's the place where this is still true? And the answer was it's still church art. That's the place where it's actually true. It's where all of it comes together, where you can make beautiful things that are integrated into people's lives, integrated into and also directed towards God and directed towards the highest things. And so it's. It was still. It seems still possible. You know, I even. I had a good friend of mine who was a. He was more. He's an atheist and modern person. And he said. He said. He said. He said, you know, what you're doing is also kind of just nostalgic. It's just nostalgia. It's just pastiche and nostalgia. And my answer was, well, it's not nostalgia for the person that buys an icon for their. Their nephew that's getting baptized. I know what to tell you. It just isn't. Like if I. If it gets. If. If I make a. A chalice for a church and there's wine in it, it's like. There's no. It's not nostalgia. You can say what you want. It's a real. It's a real thing. It's really happening. Yeah. It might seem retrograde to. To you, but it's a. It's not nostalgia. It's a real thing."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":3665.24,"end":3676.49,"speaker":"David Schindler","text":"And if it's genuinely beautiful, we always experience genuine beauty as still alive. If it's simply a repetition of an old form, I mean, people sense that too. It's not."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":3676.57,"end":3683.73,"speaker":"Jonathan Pageau","text":"Yeah. When it's too. When it's too much of a. I always say. I actually say that I think tradition without nostalgia, which is that."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":3683.73,"end":3684.49,"speaker":"David Schindler","text":"Yeah, interesting."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":3684.57,"end":3699.47,"speaker":"Jonathan Pageau","text":"Learn the language from the inside and then create things you can copy at the beginning. Obviously, you have to start by copying, but once you've mastered the language, you have to be careful not to just make pastiche images. Yeah."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":3699.47,"end":3702.67,"speaker":"David Schindler","text":"Kierkegaard's idea of tradition is recollection forward."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":3703.63,"end":3706.43,"speaker":"Jonathan Pageau","text":"That's a great. Yeah, that's a great way of saying it. Recollection forward."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":3706.67,"end":3718.35,"speaker":"Ken Lowry","text":"Yeah. Yeah. Well, this may be a good. A good place to. To bring it. Bring it to a close, but any final thoughts or anything you wanted to say before we close here for either of you?"}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":3718.67,"end":3720.91,"speaker":"Jonathan Pageau","text":"No, I'd say thanks, I think. Yeah."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":3720.91,"end":3721.27,"speaker":"Ken Lowry","text":"Yeah."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":3721.27,"end":3723.15,"speaker":"Jonathan Pageau","text":"And it'd be great to have another conversation."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":3723.63,"end":3730.92,"speaker":"Ken Lowry","text":"Yeah. So hopefully I. John. John wanted to come to this one, but he wasn't available, so hopefully we can get another one on the books."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":3731.48,"end":3732.52,"speaker":"Jonathan Pageau","text":"That would be wonderful."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":3732.68,"end":3733.64,"speaker":"Ken Lowry","text":"Yeah, I'm gonna."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":3733.64,"end":3754.46,"speaker":"Jonathan Pageau","text":"I mean, I still need to have my conversation with John Revake about AI, because he made. He made a half prophetic, half scary half. Who knows, like that video he made on AI was, was profoundly surprising and disturbing. And so I haven't, I've been gathering up my just my thoughts to talk to him about it."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":3755.5,"end":3759.02,"speaker":"David Schindler","text":"I would love to be in on that conversation if you do it."}
{"episode_id":"SW - #316 - 2023-11-30 - DC Schindler - The Duality of Art (Climbing Mt Sophia)","start":3759.1,"end":3793.83,"speaker":"Jonathan Pageau","text":"So maybe so yeah, it's, it's definitely, it's definitely something that he's thought a lot about and that is worth engaging with him about it because he's definitely, he's not, he's coming at it with, you know, years and years of, of thinking about these questions but he doesn't, definitely doesn't come to the same conclusions I do. But it's worth like, I think it'll be worth exploring it. If you enjoy these videos and podcasts, please go to the symbolicworld.com website and see how you can support what we're doing. There are multiple subscriber tiers with perks. There are apparel and books to purchase. So go to thesymbolicworld.com and thank you for your support."}
