{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":0.8,"end":58.48,"speaker":"Richard Rohlin","text":"You have to celebrate Christmas. It's not just enough to believe that this child born of a Virgin was the Logos from before the ages, right? We can say we believe that all we want to, but if we don't act on that information in some way, and the way that you act on this information. Taylor Refer talks about liturgy and like, let's say he talks about the feast, the act of celebration as being like a song, right? So the song has a, a melody, like a. Think of like a little melody, has sequential moments, you know, all these different notes and everything. But, but really the beginning to the end of that song all happen in the same moment because it's a unit. So if you don't sing the song, then you're not actually, you have no way of participating in it in that moment. And if you don't celebrate Christmas, then the moment, this holy moment, right, this moment with heaven and earth, everything comes together into this point, right? That moment just passes you by and pretty soon you stop believing at all."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":70.08,"end":134.45,"speaker":"Jonathan Pageau","text":"This is Jonathan Pedro. Welcome to the symbolic world. So hello everyone. I am back here with Richard Roland for another episode of Universal History. As all of you know, Richard and I wrapped up a major course on Beowulf where Richard took us to through very convincingly why Beowulf is a Christian poem. And if you watch it, you'll see at the end I myself have a, like a mouth agape, like he. Just at the end, there's no doubt it just like all comes together. It's very beautiful. So, so you can still check that out, by the way, if you're interested. The, the course is going to stay on for sale on the website, so you can check that out. But today we are going to talk about Christmas, about the kind of how Christmas came together as a feast in the church, why it's so important, you know, why we celebrate Christmas the way we do today. And so it's going to be, it's going to be a great episode. Thanks for coming on, Richard."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":134.61,"end":295.56,"speaker":"Richard Rohlin","text":"Glad to be here. This is one of my personal, like hobby horses is, is defending Christmas. I'm a, I'm a, I'm a staunch veteran of the Christmas wars. For a little context about this, maybe some people remember if you were, if you are like a fundamentalist Protestant, especially living in the south of like the southern U.S. i like how Americans we say the south as this is the only south, but I guess, I guess people do that everywhere. But anyway. But if you're living in the southern US you might have been familiar like you Might have grown up in, like, the worship wars. Wars. So the worship wars was like the big kind of like, maybe you had this. Other places, too. I just didn't grow up there where, you know, it was like, do we do, like, a praise band or a piano and hymns or, like a piano and organ or. You know, there's kind of debate about this kind of stuff. Like, my family was in the trenches of all that stuff when I was a kid, but then as I grew up and eventually was on pastoral staff for several years, one day. One day somebody came to me very upset and said, well, somebody's put up a Christmas tree in the. Like, the foyer of the church. And I was like, well, it's December, so we do that every year. And it kind of. I was. I was totally flabbergasted, you could say, like. Like, very caught off guard. Why would this be a problem? And. But that kind of. That kind of initiated a multi year. I don't say struggle, but. But a period that I sometimes kind of refer to my wife and I refer to as the Christmas wars, which had to do with. Which had to do with some people, not all just at that church, but just like in our lives, et cetera. Really, really going hard trying to get people to stop celebrating Christmas. And it's the usual sort of stuff. It's a. It's a pagan holiday. It's. It's too Catholic, et cetera, et cetera. And so that is one of the things that caused me to, like, really dig my heels in and start studying. Actually, that was right before I started working on what eventually became a master's in essentially medieval literature. Yeah. But it caused me to. Yeah, like, that was one of the things that got me to start, like, really dig my heels in and be like, all right, well, if this is really a Roman Catholic thing, then, gosh darn it, I'm gonna understand why, you know. You know, as. As opposed to just say, oh, well, that's Catholic, so toss that. So, yeah, it's. It's a weird. It's a weird thing. Like, studying and sort of fighting for the celebration of Christmas is actually probably why I'm orthodox."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":295.72,"end":296.36,"speaker":"Jonathan Pageau","text":"Interesting."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":296.36,"end":342.31,"speaker":"Richard Rohlin","text":"In a weird way, that's like a part of my story that I don't think I've. I've ever shared before publicly. But. But, you know, that's one of the things that got me to, you know, really think about what it means to have tradition and what it means to celebrate. And there's a part of. There was a part of my Conversion experience. That was certainly intellectual. Right. But the much more important part was as we were converting as a family, especially for my wife, was the, was the embodied part of it. And for us actually really deciding we need to take not just Christmas, but like Advent seriously and, and do these certain things. And then later on Lent and Easter, like, deciding that we needed to, to, to find some way to make these times kind of special as a family and start participating in this in a more embodied way was a really important turning point for our family."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":342.71,"end":357.76,"speaker":"Jonathan Pageau","text":"It's interesting, I just want to say something, what you said. It's interesting because the, this holiday war that we see, it's, it's a strange place where secular atheist types and fundamentalists hold hands in their arguments."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":357.92,"end":363.96,"speaker":"Richard Rohlin","text":"And to be fair, not all fundamentalists, because the, again, the family that I grew up in, super big. Yeah."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":363.96,"end":378.2,"speaker":"Jonathan Pageau","text":"But like some fundamentalists, really very particularly strain of fundamentalists. Like, I know a lot of people that were in that camp, like anti. Anti Christmas camp when I was younger, they ended up moving towards Jewish holidays ultimately."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":378.2,"end":464.42,"speaker":"Richard Rohlin","text":"Yeah, yeah. That's one of the things we'll talk about a little bit later. And actually for people who want to go back to last year's video, last year we did a video, it was a sequel to the Groundhog Day video, where we looked at the four winter feasts of the four great winter feasts of the church and kind of talked about how those are fulfillments of Hanukkah or the festival of the rededication of the temple and the rededication of the temple of the cosmos. I'm not going to repeat myself on a lot of that stuff today because people can go back and watch that. But so all this to say this is like, it's a very, you know, passionate subject for me. So I'm excited to, to talk about it today. So we're going to do this in two parts. I want to talk about a little bit about how we got to have the kind of Christmas celebration that we have today, which is, which is understanding that everybody, you know, different families do things a little bit differently. Broadly speaking, there are certain things which, if you live in North America and you celebrate Christmas, there's certain things that you're, you're doing that you're, you're doing and you're doing them every year. And even if you're not doing them, you know, some of them specifically, they're all around you. They're in all of the Christmas movies, They're in all of the, like the, the, you know, you can't get away from it. The grocery store, the. The. The. The home improvement store, the. The mall, like, all these things. Right. You can't. There's certain things you can't get away from. So I want to kind of talk about how we got to that Christmas. Yeah. And. And then also look at some of the historical attempts to abolish Christmas."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":465.37,"end":465.61,"speaker":"Jonathan Pageau","text":"And."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":466.33,"end":523.84,"speaker":"Richard Rohlin","text":"And what. And then basically the second half of the video was talking about why that hasn't worked. Why is sticky. Is Christmas so sticky that we can't seem to help ourselves when it comes to celebrating it? So that's where we're going to go. All right, so I want to begin with just talking about the essence of the feast. This is, you know, in some respects, the most obvious part. And yet it's so. It's. It's weird because it's so obvious. Like, we constantly feel like every year, I mean, you know, six of my neighbors right now have a. Have a. Put, you know, keep Christ in Christmas kind of a thing out in their yard with a nativity scene and stuff. And it's great. I love it. You know, I really love just all the statues of Jesus and Mary everywhere this time of year. You know, it. It's great. And now I really am serious about that. We'll come to that in a little bit. But I think it is actually kind of this beautiful return to tradition that you see happen, you know, even in, you know, the Deep South."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":523.84,"end":529.6,"speaker":"Jonathan Pageau","text":"So, yeah, it's a. It's an unconscious return to tradition, you know, in very unsuspecting places."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":529.6,"end":792.75,"speaker":"Richard Rohlin","text":"And that has to do with that stickiness that we're going to talk about. But. But I just want to start with, like, the fundamental essence of the feast, which I think will help us understand why it is as sticky as it is. And that is. It's the. It's the ultimate expression of the pattern of the high becoming low. Right. And. And I know this is a pattern you talk about a lot. People who are. We were talking about this the other day, right. People who are, like, on this channel a lot or in the various discussions around this part of the Internet think about this pattern a lot, but this is the ultimate expression of this pattern. Right. And it. It. What it does is it manifests this pattern, you could say, like, more evocatively than almost anything else, except for the crucifixion. Yeah, right. Right. And so I just want to read something real quick. This is from, you know, know, this is from our festal hymns for the feast in the Orthodox Church. But this actually comes from. This is just a setting into verse of a mostly already metrical homily or oration that was given by St. Gregory the Theologian on the. On the occasion of theophany nativity, which, as I'm going to explain in a moment, used to be celebrated on the same day. So this, it says, christ is born. Glorify him. Christ comes from heaven, go to meet him. Christ is on earth, be exalted, sing to the Lord all the earth, and praise him in gladness, O people, for he has been glorified to the Son, begotten of the Father before all ages, and incarnate of the Virgin without seed. In these latter days, to Christ our God, let us cry out, you have raised up our horn. Holy are you, O Lord, stem and flower of the root of Jesse, you have blossomed from the Virgin, O Christ. From the mountain overshadowed by the forest. That's a. It's an image from the song of Habakkuk, which the church traditionally ascribes to the Virgin Mary. From the mountain overshadowed by the forest, you have come made flesh from her who knew no man. O God, not formed from matter. Glory to your power, O Lord. I behold a strange, most glorious mystery. Heaven, the cave, the terrific throne, the Virgin, the manger, a place where Christ lay, the uncontainable God whom we magnify in song. So this is like the. The really the. The. The key kind of the center of our celebration. And it comes from a much longer oration that St. Gregory gave on this feast. And he talks about a lot of things that are. I, I really encourage people to go and read this. You can find it in his festival orations. The excerpt I was just reading there comes from a book called the Winter Posca, which is just a really great kind of a reader written by Father Thomas Hocko back in the day on the various feasts of the winter season. And each chapter is maybe two or three pages, and there's 40 of them. So, yeah, it's just a really lovely little reader, but he talks about a lot of things. He talks about actually how should we celebrate the feast. Don't celebrate it like the pagans, that is, with drunkenness. We're going to talk about drunkenness specifically today because it comes up a lot, as it happens, in talking about historical celebrations of Christmas, but not to celebrate it as pagans, but instead of celebrated soberly as Christians, by Which, of course, St. Gregory means go to church, feed the poor. Right. And. And then, you know, yeah, enjoy yourself as well, but don't you know, don't engage in the kind of revelry the pagans engage in. Um, and there's a lot of beautiful themes in this homily, right? The high becoming the lowest thing. I mean, there's nothing weaker or less. Less powerful than a Jewish baby in the. You know, in the Roman Empire, Right. You know, this. You don't get any weaker, any poorer, any less significant than that. Right. The. On the. One of the other major images that we find in the ancient hymns, both in the east and in the west, is the. The uncontainable. The idea of the. Something that can't be contained. Being contained. Right. In the Virgin in a manger and so on. And then, of course, you know, for us as Christians, the. The deep significance which you'll find many of the church fathers talking about, of Christ being laid in a food trough. Yeah, right. As. As, you know, like, this is. I mean, it's very, very sort of evident eucharistic imagery, right? Foreshadowing, foreshadowing that. So."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":793.36,"end":796.36,"speaker":"Jonathan Pageau","text":"And then also images, like, really images of the tent."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":796.36,"end":796.48,"speaker":"Richard Rohlin","text":"Of."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":796.48,"end":803.6,"speaker":"Jonathan Pageau","text":"The tent of the. Of the Ark of the Covenant there in that. That text he wrote, like, between the cherubim and everything, like."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":803.6,"end":804,"speaker":"Richard Rohlin","text":"Yes."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":804.24,"end":813.16,"speaker":"Jonathan Pageau","text":"Understanding that there. There's a relationship between the glory of God descending in the temple and Christ being born out of the Virgin. Pretty."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":813.16,"end":927.73,"speaker":"Richard Rohlin","text":"Yeah, yeah. This is really important. I mean, this is the. The. I mean, like, the most common Orthodox hymn about the Theotokos is like the more honorable than the cherubim, Right? Well, to that. To understand why that's not just a nice thing that we say because we, like Mary, right. You really have to look at hymns, like this hymn of the feast, right, where we're saying, right, the Virgin becomes the cherubic throne, right? So like, the. The cherubim, they carry the throne. Well, but she's the throne, right? And that's why she's more honorable than. Than them, right? Because she's the throne now. And. And she becomes the throne in like, the most, like, earthy, literal way possible because she's. The baby is sitting in her lap, right. This is one of the earliest images that we have of the Virgin from the catacombs in Rome is. This is the Adoration of the Magi, right? And which is the. Which was originally, by the way, was originally the focus of the Christmas celebration in the West. We'll talk about. We'll talk about how. How Christmas gets kind of split out from Theophany and Epiphany in just a second. And then, of course, one of the other major themes, and again, I just suggest people come back and watch that video we did last year. One of the major themes here is the idea of the restoration of the Temple of the Cosmos. Right. And it's. It's sort of linked. It's ties to the Old Testament feast of a restoration or the Festival of Lights, what nowadays is called Hanukkah. So. So that being said, let me talk about the ancient Christian and medieval celebrations of the feast. So originally, Christmas and theophany, or Christmas and epiphany. Epiphany the west, theophany in the East. They have different emphases, but they're the same feast. And I'm just going to probably call it theophany the rest of our conversation, but I'm really including both. I mean, the differentiation of emphasis is very ancient. So theophany focus mainly on the baptism of Christianity. Epiphany focused mainly on the adoration of the Magi. Yeah."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":927.73,"end":934.49,"speaker":"Jonathan Pageau","text":"But there was also, like, I think that the idea of the early feast was something like the feast of. Of the Revelation of Light."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":934.65,"end":948.73,"speaker":"Richard Rohlin","text":"That's right. That's right. I mean, that's the earliest. That's the earliest thing. Like, it's the Feast of Light. Right. The Festival of Light. And of course, when St. Gregory is. Is. Is. Is delivering that festival oration, that's the occasion on which he's doing it. Yeah."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":948.73,"end":972.41,"speaker":"Jonathan Pageau","text":"Which is why, like, there's all. While those images come together. Right. The moment when Christ is first recognized in the world. So the magi, the baptism, but then also like the wedding of Kanah, for example, would be mentioned in those early feasts. And so, like, all these moments before Christ reveals themselves fully. The glimmer of light appearing in the."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":972.41,"end":1074.73,"speaker":"Richard Rohlin","text":"Incarnation, really, like everything culminating up to the baptism, that whole kind of episode, which is where two of the gospels start. Right. Two of the gospels just began at the baptism, which is. Which is an important detail. So. So, yeah, so originally this is all kind of one feast. And actually in Armenian, Christianity is still celebrated this way. Right. All on one single feast. What happens beginning in the mid 4th century is that the celebration of Christmas gets to sort of split out from Nate, from epiphany, theophany, into two feasts which are 12 days apart. And the reason for this is basically Arianism. So Arianism is the. It's the sort of, you know, the arch heresy as far as Christians are concerned. Right. It's this teaching that the Son was a creature, that he was not eternally begotten it's, that's not necessarily the teaching that Jesus wasn't God or Jesus wasn't divine, which is how some people will try to explain it sometimes. Because Arius actually did believe Jesus was divine. He just believed he was like a divine created thing. Like, like, like, like. Right. A God. Right. And, and of course, this creates poly, you know, polytheism and various other problems for Christian theology. One of the permutations of Arianism is something called apollinarianism, which is basically this idea that. And there are, there are a few different versions of this, right? But it's basically the idea that Jesus is just like a normal good person. And then at some point, and most people who believe this set at the baptism, that the Logos comes in and fills him."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":1074.73,"end":1077.29,"speaker":"Jonathan Pageau","text":"Right, yeah, we call it adoptionism sometimes."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":1077.29,"end":1090.78,"speaker":"Richard Rohlin","text":"Yeah, yeah, yeah, yeah, yeah. And, and a lot of these things, I mean, there was like adoptionism and then Arianism and then apollinarianism and a lot. But I mean, a lot of these things, like, intersect so much. It's not totally important for our purposes today to like, go sense out the individual."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":1090.78,"end":1102.14,"speaker":"Jonathan Pageau","text":"But the most important to say that what was, what became important for the Christians was to say that the incarnate Logos was incarnate from the moment of conception and not at, not at some later point during the story."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":1102.78,"end":1243.68,"speaker":"Richard Rohlin","text":"So that's exactly how this becomes, you know, if you go back and look at those, those hymns that I just read, right? There's this talking about how the whole focus is on how Christ that is born in the manger as being adored by the magi, right, Is already God before the ages, worthy of our adoration, right? And in this context, the gifts of the Magi, which is the big focus of Epiphany in the west, becomes emblematic, becomes the emblematic act of worship, right? This, this for the total giving up of ourselves, right? Where we have nothing to give to Christ but ourselves. And I'll just say on this note, there's a really wonderful series of like, prints. I think they were done as originally as like, postcards by an art nouveau artist named. I think it's Ezio Annechini and I probably got his name wrong, but he was an Italian artist and he did a series of. He did a series of like sort of postcard prints. We'll. I'll send it to Lisa later so it can put it up on the screen. Did a series of postcard prints of, of like the various titles of the Virgin, but one of them for the Mater Christi, the mother of Christ, he does the Adoration of the Magi. And it's one of my favorite images of the Adoration of the Magi because one of the things they have them doing is taking the incense. So you got the three gifts, gold, frankincense and myrrh. Was taking the frankincense and burning it in a sensor before the Christ child. And I don't know why I never thought about that before I saw that image. But of course, I mean, if you believe this is, this is God before the, you know, what do you do, you, what do you do when you come to a God, or even like an emperor for that matter? Right. You burn incense. Right. It's an act of worship, an act of veneration. And so it's. Anyway, it's a really beautiful image and very evocative in that sense. Right. So this is the big focus of Christmas. Right. By celebrating it. We're going to talk at the end of the video today about the importance of celebrating something. Why it's actually not enough to just think something. Correct. But you actually have to celebrate it. You have to embody it in some way. Right. Which by the way is something that everybody knows. Right. Even, even the sort of like the, the, the, the anti culture. Right. Knows this. Right. And that's why you have to have Pride Month and that's why you have to have celebrations."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":1243.68,"end":1247.64,"speaker":"Jonathan Pageau","text":"You need not, it's not just remove celebrations, you have to replace them with something that."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":1248.05,"end":1289.55,"speaker":"Richard Rohlin","text":"Right, exactly. Yeah. So what happens pretty quickly is, is that we start preparing for this great feast with a period of preparation. And so in the west this used to begin back on November 11th and in the east on November 15th. Either way, it's sort of a 40 day fast. In the west it was called St. Martin's Lent because it originated in the diocese of Tours in France. Um, so if you came to the Beowulf class, you will know I made a lot of jokes at the expense of the French. But today I have only good things to say about the French. So. So that's okay. Yeah. Well, it is Christmas, Jonathan."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":1289.55,"end":1290.39,"speaker":"Jonathan Pageau","text":"It is Christmas."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":1290.55,"end":1324.03,"speaker":"Richard Rohlin","text":"That's right. Yeah. I'm gonna have good things to say about Martin Kneupper as well. So there you go. Yeah. So. So if you go back and look at the 6th century councils in the west, starting in France, the, the Council of Tours and then kind of spreading around there, it establishes Advent and Christmastide as separate seasons. And it seems like this was because people have started to like pre celebrate a little too much. Right. Which is the thing we do in our culture now, we're like, well, Christmas is on the 25th, and we got to get all of the Christmas parties, the work Christmas party and the gym."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":1324.03,"end":1325.71,"speaker":"Jonathan Pageau","text":"Christmas party all in before Christmas."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":1325.71,"end":1369.83,"speaker":"Richard Rohlin","text":"Gotta get all in before Christmas. Right. Well, this is apparently a very old problem. And so, and so what they did is they established, they established these fasts as a way of making sure we were preparing properly and then also establish Christmastide, the time from Christmas to epipe theophany as being, as being a time of feasting. Right. And so this is kind of how it takes the, the general shape that it does. So for instance, the current Advent season on in the west, which doesn't start on November 11, starts on December 1 or like the first Sunday around there that, that dates back to the late 6th century when monks were required to fast for the first 24 days of December. And it seems like this was because they had been breaking into the Christmas ale a little bit early."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":1369.91,"end":1375.23,"speaker":"Jonathan Pageau","text":"That's right, yeah. They had their Advent calendar. Now that just has chocolate in it. Like, people eat chocolate every day."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":1375.23,"end":1379.39,"speaker":"Richard Rohlin","text":"I like the ones that have just like a little thing of a different Scotch whiskey in each of the doors."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":1379.39,"end":1380.15,"speaker":"Jonathan Pageau","text":"There you go."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":1380.79,"end":1412.24,"speaker":"Richard Rohlin","text":"Unfortunately, I can't participate in these. But, but I, I think it's a neat idea. So, but, so there's a basic rule of thumb for understanding why different cultures have different Christmas traditions. And that is the colder your winter is, the bigger deal Christmas is in your culture. Right. And that's, that's more or less true across the board. There's some exceptions to it. But. But put it another way, the colder your winter is, the more Christmas customs and traditions your culture will develop and like, the stickier those things will be."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":1412.32,"end":1414.72,"speaker":"Jonathan Pageau","text":"Yeah, because it's darker too."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":1415.04,"end":1415.44,"speaker":"Richard Rohlin","text":"Right."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":1415.6,"end":1419.84,"speaker":"Jonathan Pageau","text":"You have that sense of this dark moment when the, into which Christ is born."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":1420.53,"end":1490.55,"speaker":"Richard Rohlin","text":"And I've, I, I've heard some people say something like sometimes, well, the Orthodox are really going to celebrate Posca. They just don't know how to celebrate Christmas or something like this. But like, go, go to Ukraine, go to Russia, go to any of those, like, northern European countries where it gets very cold, very dark. Right. Go to even like Serbia and the Balkans. You'll find all kinds of amazing Christmas carols, Christmas traditions, stuff you've never heard of, stuff that's really similar to stuff you grew up with. So it really has a lot to do with the weather and particularly, like you said, the amount of darkness that you have, and I'll say a little bit Here about the connections between. And we said a lot more about this in our last video. So, again, go back and watch that, people. And the Groundhog Day video as well. But the connections between. The connections between, like, pagan solstice celebrations. And this is the thing to say. Everybody has a winter festival. Absolutely. If you have a winter. You have a winter festival. And I realize I'm talking kind of mainly about the Northern Hemisphere right now. I don't know what to do about that, but, you know, we can. Yeah, it's. Sorry, people in Australia. Like, I don't. I don't know what to say, but."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":1490.55,"end":1491.59,"speaker":"Jonathan Pageau","text":"Or in South Africa."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":1491.75,"end":1515.92,"speaker":"Richard Rohlin","text":"South Africa, or. Yeah, yeah, yeah. Right, right. But basically, like, as the. As the light recedes, right. You get to the deepest, darkest part of the year, and everybody has this deep cultural. It's sort of deeper than cultural, actually. Like, this really primitive sense that a festival is needed, that light is needed. Right."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":1516.48,"end":1523.36,"speaker":"Jonathan Pageau","text":"And we have to light a bonfire. We have to light. We have to light the fire. Like, it's just inevitable to think that way."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":1523.44,"end":1523.88,"speaker":"Richard Rohlin","text":"Yeah."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":1523.88,"end":1525.08,"speaker":"Jonathan Pageau","text":"We have to find the light."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":1525.08,"end":1525.48,"speaker":"Richard Rohlin","text":"At least."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":1525.48,"end":1528.64,"speaker":"Jonathan Pageau","text":"We have to, like, get some hope for. For the sun to come back."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":1528.8,"end":1536.59,"speaker":"Richard Rohlin","text":"And this seems to be the main reason for people rejecting the idea that. Chris. That Christ might have actually been born on December 25."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":1536.59,"end":1537.99,"speaker":"Jonathan Pageau","text":"Because it makes so much sense."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":1537.99,"end":1646.47,"speaker":"Richard Rohlin","text":"Because it makes too much sense. Like, that's too perfect. That goes together too well. Right. I would just say, like, you know. You know, who made the agricultural cycle, who made the seasons, Right? And. And so. So for me, it's. It's just. This is when life would come into the world. What else would it have happened? Right. When else would it have happened? And so a lot of. So all this to say, if somebody says to me, such and such Christmas tradition, you know, like, the Christmas ham or something like this, that goes back to this old Germanic pagan custom at Yule or something like this. Okay. All right. Are you coming over for dinner or what? Like, you know, let's. You know. Yeah, that's that. And really, that should not be a problem for us if you understand the way that these things work. Right. And so a lot of the traditions that we associate with Christmas had already started developing by the late Middle Ages. One of my favorites here is Carolyn. Right. And here I have to say something which may upset some people, but I don't mean to. All right? And that is that a carol is not the same thing as a hymn. Yeah. Nowadays, in, like, modern English parlance, when somebody says a Christmas carol, they just mean A religious song that you sing at Christmas time. Right. Or as a semi religious song that you sing at Christmas time. It's just like a Christmas song. That's what we mean by Christmas carol. But carols are not the same things as hymns. And in fact, carols were not sung in church until about the later half of the 19th century. Really? Yeah. Not sung it and Caroline. Not to be sung in church. Yeah, yeah."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":1646.79,"end":1648.23,"speaker":"Jonathan Pageau","text":"They're not liturgical at all."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":1648.23,"end":1716.29,"speaker":"Richard Rohlin","text":"They're not liturgical. And you've got to sort of think about. So actually, sometimes you'll find medieval bishops writing against the practice of caroling. This is a little funny to think about because I know that, you know, some traditions really love their, like, lessons in carol's service on Christmas Eve, which I think is awesome, quite frankly. And I'm not going to stop, you know, I'm not telling anybody stop doing that. But it's quite funny to realize that there are lots of medieval bishops, you know, in France and England and other places writing against the practice of caroling. Well, why are they writing against the practice of caroling? Because caroling is. It's a. It's a sort of a. It's a carnival practice. Right. You're going around from house to house and you're usually going with a keg or like a large bowl of very alcoholic punch, and you come up to the door of the place and you sing and then you offer the people at the house. You offer them a drink in exchange for like a gift of some kind. Right. This is caroling. And which, by the way, sounds like a great time. We try to do caroling every year just around our neighborhood. And, and, but I've never, like, been like, have a sip from the flask as well, neighbor. Like, maybe I need to bring that in."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":1716.29,"end":1719.09,"speaker":"Jonathan Pageau","text":"But make you more popular if you."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":1719.09,"end":1721.57,"speaker":"Richard Rohlin","text":"Yeah, yeah, yeah. Or less popular, depending on which neighbor."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":1721.57,"end":1722.25,"speaker":"Jonathan Pageau","text":"Depending on which."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":1722.25,"end":1744.91,"speaker":"Richard Rohlin","text":"Yeah, yeah. But. But anyway, my point is that, that, that all of that sounds awesome. Okay. But this actually helps explain the kind of the character of Christmas carols. Like, if you go back and look at some really old medieval Christmas carols, especially like medieval English carols, which is what most of us know. Sometimes they're. They're. Let's put it this way, they're not usually theologically explicit."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":1744.99,"end":1745.47,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":1745.95,"end":1781.71,"speaker":"Richard Rohlin","text":"They're. A lot of times they'll have be. Be something like, I saw three ships on Christmas Day or something like this. And there's a lot of metaphor. And it's. The way to think of it is a sort of a A lyrical veil over the mystery. Yeah. And why is the mystery veiled in this way? Well, it's because. It's because we're not in church, Right. And we're going around town and we're slightly drunk at this point. And also some of the things that they sang along with Christmas carols in the same setting were drinking songs. Yeah. Now I'm learning how much trouble. How much trouble am I allowed to get into?"}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":1782.11,"end":1783.35,"speaker":"Jonathan Pageau","text":"As much trouble as you can."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":1783.35,"end":1839.75,"speaker":"Richard Rohlin","text":"Okay, so I'll just say that there is a. There's a collection, like a 15th century manuscript that collects a bunch of Christmas carols, including one of my favorite medieval carols, which is called Adam Le I Bounded. We'll talk about that in a second. But it also has, like, songs about somebody's male member, the lyrics of which are. Are quite hilarious, actually. And, and the thing you have to understand is they're going from house to house and you're getting songs about, like, the Fall and Original Sin and Baby Juice is a Manger. And then also here's a, here's a funny, you know, body humor. Yeah. Like. Yeah, here's a dirty song. Right. That, that's, that's how carols were used. That's what caroling is. This is, this is the. Those are the only two registers anybody has in the Middle Ages. You're either, like, contemplating the mystery or it's body humor. And those are the two. Like, there's nothing in between."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":1840.23,"end":1843.39,"speaker":"Jonathan Pageau","text":"When would they carol? Like, when what date? What days do you know?"}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":1843.39,"end":1866.44,"speaker":"Richard Rohlin","text":"Well, so the, the, the thing that the church really tried to enforce is caroling doesn't start until Christmas night. After Christmas. Yeah, Christmas night. And then, and then you, you go, you go around caroling after that. And of course, eventually what happens is that the distinction between Advent and Christmastide gets kind of lost. And that's how we get the situation that we have today. But that doesn't really happen until the 19th century."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":1866.44,"end":1866.88,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":1867.36,"end":1876.68,"speaker":"Richard Rohlin","text":"And then, of course, this culminates. Eventually carols become a nostalgia thing. At least the ones that aren't about humor. Yeah, forget about those."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":1876.68,"end":1877.36,"speaker":"Jonathan Pageau","text":"Don't know them now."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":1877.36,"end":1877.76,"speaker":"Richard Rohlin","text":"They become."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":1877.76,"end":1879.36,"speaker":"Jonathan Pageau","text":"Those become the ones you hear at the mall."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":1879.44,"end":1883.2,"speaker":"Richard Rohlin","text":"And by the way, there were carols. I'll just say there were carols for other holidays too."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":1883.48,"end":1883.8,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":1884.36,"end":1907.84,"speaker":"Richard Rohlin","text":"Some very famous, very famous, like Ash Wednesday carols, Good Friday carols, even one carol for the circumcision of the Lord that I, that I managed to find. So there, there were like, historically there were other carols as well, but Christmas was Like the main time you went caroling. And it has to do with this. It has to do with this. The winter of it all, basically, right."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":1907.84,"end":1908.96,"speaker":"Jonathan Pageau","text":"You need a drink. It's like."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":1908.96,"end":1909.72,"speaker":"Richard Rohlin","text":"Yeah, you need a drink."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":1909.72,"end":1910.76,"speaker":"Jonathan Pageau","text":"Old and it's dark."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":1911.82,"end":1952.87,"speaker":"Richard Rohlin","text":"Yeah, yeah. So we also get things like the Christmas boar. There's actually a famous carol about this, the boar's head at Christmas, which is. Which I really love the use of, especially in Western Europe, the use of evergreenery, you know, like garland holly, evergreens, you know, fir trees, things like this. The use of this to sort of like sparse up the inside of the house, right. With like lice and evergreen, which is. If there's any aesthetic, which. Which is like identifiably Christmas, it would be lots of lights and just evergreen things everywhere. Right. And again, when most of the world is dead, except for these particular plants, right. That it's very easy to see why. Why that would be done. And."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":1952.95,"end":1964.55,"speaker":"Jonathan Pageau","text":"And also winter berries. Like, the idea of a winter berry is really important with Christmas because it has that light or that seed that's being preserved and you can still identify it even though everything else is dead."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":1964.91,"end":2097.85,"speaker":"Richard Rohlin","text":"Yeah, no, that's. That's a beautiful way to say that. And even things like mistletoe, which we. We know, like, as modern people, we know it to be a parasitic fungi, right. But fungus. But. But for medieval people, the mistletoe had all of these other connotations, right. You know, the, The. But also, like, it's a little poisonous. So it's. Yeah, but it's. It's. It's one of those interesting things. Go look at the way that mistletoe is used in medieval symbolism. That's a. That's a whole video, I think. So you have. You have all this stuff that comes in. Another very important element that should not be overlooked is the feasting of the poor. So this is a really important part of actually any Christian celebration. If you. If you want to be trad. And you want to go celebrate holidays in traditional ways, if you're not buying a meal for somebody else, right. Or. Or, you know, get a case of beer for the guy in the corner or something. You know, like, if you're not. If you are not actually feasting the poor in some way, then you are actually traditional celebrating traditionally. And so the way that it worked in, for instance, in medieval England is that there were certain days of the year, Easter, St. John's night, which is the summer solstice, and then. And Christmas, and specifically other days as well, but those three days, specifically when it was expected that the well to do members of the village or of the town would put out a feast for all of the poor people. Right. And it's sort of like come and get as much as you want of all the richest foods. Right. And this is a really important part of the celebration as well. And a lot of times when we talk, we think about like the social inversion aspect of some of these holidays. Like, like the boy Bishop feast or the, the Feast of the ass on January 14th. Right. Obviously the, there's. There they have a connotation of like misrule and things like this. And those aspects were always, always concerned for, for religious leaders, especially those of the more sort of uptight variety. But also a part of the whole idea of inversion is that poor people get to eat what the rich people have. And that's actually a really important dynamic within Christianity and a really important dynamic within the traditional observance of these feasts. Yeah."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":2097.85,"end":2116.53,"speaker":"Jonathan Pageau","text":"And that's still, like today we still have, you know, the kind of Christmas. I don't know how you say it in English, but you know, like the, to gather around food for Christmas, like you go to, you eat for, for poor people and making boxes for families that struggle and stuff like that's definitely still. Even in the secular world. It's a little attraction that's there."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":2116.53,"end":2339.64,"speaker":"Richard Rohlin","text":"I think every church that I've ever gone to as a member, both as a Protestant now as an Orthodox Christian, has done that for Christmas. And even the grocery stores get in on it. You know, it was like, here's a bunch of conveniently packed bags of food. You can just buy one and then we'll donate it to the shelter and things like that. So you know the rule about charity. There are two rules about charity. No, since nobody asked, there are two rules about charity. One is that the, the, the less, the closer the proximity, the better. Right. The more times my money changes hands. I'm not even talking about like, where is that money actually going? Because this doesn't actually seem to be a question that we're supposed to ask as Christians. I mean, be a little discerning about the charities you donate to. But Christ, you know, Christ says to give to every man that asks of you. Right? So not. But what is he going to do with it later? But, but anyway, but the, the more, the more times that that gift changes hands, right. Basically the farther away I have to be from my neighbor to give to him. Right. Though let's say like the less salvific it is, right. It Has a different effect on your soul. If you are personally, you know, giving something to somebody, you're looking somebody in the eye, you're seeing them as a human being. Right. It's. That's a very different thing than I just. I just gave some money to a. To a charity online, and now I'm covered. And I'm not saying don't give money to charities online. Like, do what you can't. Do what. Do what you can do. But. But. But maybe don't, don't underestimate the importance of. And this is just the real difference, you could say, like, between religious charity and something like government welfare is that there is a sort of a depersonalization that goes on. Right. That makes it, you know, never mind what the effect might be on the person who's on the receiving end. Right. But for the person, you know, St. John Chrysostom, lots of. Lots of famous homilies against, you know, wealth. There. There are no warnings to the poor in the Bible, you know, And. But one of the things that she. She, you know, to paraphrase, you know, what are you saving up for Hell, you know, kind of, you know, that kind of an idea. But. Yeah, but he talks a lot about this and says, you know, the poor man is there for your salvation, you know, so you can't neglect him. Right. So this is a really important part of the celebration of this kind of feast, and it's also a very important part of understanding the symbolism of Christmas. Right. The highest thing becoming the lowest thing. Right. That inversion, which is. Which is at the heart of charitable giving, works of mercy, but is also at the heart of the parts of the feast that make certain people itchy. Right. The inversion, like the social inversions and the revelry and things like this, all of that is actually part of the symbolism of the highest thing becoming low. So. And then, of course, you know, this inversion can take darker aspects. Right. Drunkenness, gambling, et cetera, that's always been a problem. And, you know, like, people in charge have always tried to sort of complain about. People complained about it. Yeah, for sure. Right. Always. I gotta figure out how to manage it. Right. So. And I just want to reiterate a lot of the things that we're talking about here. You know, you could go back and look at, like, Saturnalia as this time of inversion or something like that. A lot of things we're talking about here can just. Right. I think should be rightly understood as integrations of pagan solstice celebrations, and that should be fine. Right? If we understand the way that Christianity works, the way that Christ works, the significance of his coming into the world in the deep of winter, this should not actually present us with a difficulty."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":2339.88,"end":2354.94,"speaker":"Jonathan Pageau","text":"Yeah, I mean, I mean, think about it. Like, it's weird because also think about in the Middle Ages, the bishop complaining that, you know, people in the town got too drunk instead of mentioning how there were massive orgies, you know, like. Right, yeah, like the Saturn."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":2354.94,"end":2355.98,"speaker":"Richard Rohlin","text":"Everything's relative."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":2356.06,"end":2371.1,"speaker":"Jonathan Pageau","text":"That's right, everything's relative. So you can actually see how Christianity transforms these types of feasts to, like, to be able to give some room for a bit of messiness, to like, point it, but then point it towards a better path."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":2371.1,"end":2436.77,"speaker":"Richard Rohlin","text":"You could say, yeah, I'm going to talk a lot about Charles Taylor in a Second is a secular age, but he talks about these times of carnival as being like, the idea of, like, if you have wine and a wine, like wine aging in a wine skin and you don't, like, unstop it every once in a while, eventually it's going to explode, right? The gas is just going to build up and it's going to explode. It's the same kind of a thing here. Like, you do have to have a little bit like. Like you shouldn't get drunk. But then also there are times when people need to get drunk, right? Those are like the two weird, uh. That's the weird dichotomy that you find even in Scripture. Even in scripture, you find this. Right. You know that there are in Leviticus, right. You know, there's the whole, like. And if you can't go to the Jerusalem for this particular feast, then take the money that you would have spent on the trip and throw a big party for your friends and eat and be merry and get drunk before the Lord. Right. You know, and so, so it's, it's, it's a weird. It's a weird kind of a thing. And I think, I think that the, the balance the church has traditionally struck is that you always have. You always have people saying, knock it off, you guys. And you always have people sort of doing it anyway."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":2436.77,"end":2437.25,"speaker":"Jonathan Pageau","text":"That's right."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":2437.25,"end":2441.05,"speaker":"Richard Rohlin","text":"That seems to like. That seems to like, hit like a good kind of flexibility."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":2441.37,"end":2500.25,"speaker":"Jonathan Pageau","text":"And this is really, actually with this point is such a great point that you're making. And it's one that, that it's that people don't understand how traditional societies work because we tend to understand authority, as always, as absolute authority that has absolute reach. And so when we know that, like, you can't cross a red light we know that if you cross a red light, then you'll get a ticket. You know, they'll. They'll even take a picture of your license plate, and then you'll get a ticket by the mail or whatever. And so. But in a, in a traditional world, like you said, it's actually a. It's actually a dance, right? There's a dance, like you said, between different factions that create this kind of balance. It move that doesn't always remain the same. It kind of moves. Sometimes there'll. Maybe it'll be moments where it's a bit more puritanical, sometimes we'll be a little more permissive, and then it'll kind of slide back and forth between that. But that's the dance between exactly that. The balance is saying, yeah, knock it off, but then doing it to some extent anyways. Yeah."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":2500.25,"end":2506.49,"speaker":"Richard Rohlin","text":"The kind of people you always want to be careful of are the. Either like the puritans or like the total hedonists, Right?"}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":2506.49,"end":2506.97,"speaker":"Jonathan Pageau","text":"That's right."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":2506.97,"end":2515.77,"speaker":"Richard Rohlin","text":"Either one of those extremes is a really dangerous person. It's a dangerous person to have in charge of your church. It's a dangerous person to have in your life. It's a dangerous kind of a person to be."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":2515.93,"end":2516.49,"speaker":"Jonathan Pageau","text":"That's right."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":2517.61,"end":2544.74,"speaker":"Richard Rohlin","text":"There was a. Oh, I just had a very fun thought and then I lost it. But maybe I'll come back to it. But yeah, I think this, this element of the way that traditional societies worked is really important. And this is the, this is kind of like the danger of, of go, oh, there's a thought. All right, so this is the danger of going. And like just reading a whole bunch of canon law and then looking around at the people in your parish or your priest."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":2545.7,"end":2547.06,"speaker":"Jonathan Pageau","text":"Nobody's doing what's there."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":2547.06,"end":2645.13,"speaker":"Richard Rohlin","text":"What a bunch of terrible hypocrites. None of them are doing what's there because that's not, it's not really how that works. Right. And. But the thing that I wanted to point out is that the, the, the, the. When you talk about hierarchy, right, the bishops that the Church has canonized that we set up as being, this is the kind of person that you should be because they're like Christ, so you should be like them. If you go and look at the lives of the bishops the Church has canonized, one of the things that's basically universal among them is their care for the poor, right. That they were out setting out a feast out of their personal treasury, not just for the poor on certain feast days of the year, but every single day. Right. So they're the people who, who best embody the, the highest thing, you know, in this case the bishop. Right. The highest thing becoming the lowest. Right. And their ability to kind of do that. And, and so it's, it's this sort of, it's this sort of interesting. I mean, the other big secret that, that is kind of offensive to modern Christianity is that, is that I said, I said a minute ago, like there are no warnings to the poor in the scriptures. And if you look at the way that this has been, that this has been kind of the rigidity and the flexibility that we're just talking about, the way that's been enforced is it's the idea that the poor man is the man who needs the party and maybe he needs to get a little drunk, right? And then, but it's actually, it's, you know, it's the, it's the well to do person, you know, feasting with all his friends. He's the person who needs to be, who needs to be sober and celebrate more soberly."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":2645.13,"end":2645.45,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":2645.53,"end":2750.21,"speaker":"Richard Rohlin","text":"And one of the weird things that happens in this is, this is what Taylor calls like multiple, multiple speed Christianity. Right. And one of the weird things that happens, especially with Puritanism, is this idea that, no, there's actually only one speed and we have to hold the poor person to the same standard that we hold the rich man. And that sounds really egalitarian now, but it's not actually, that's not actually how traditional societies work. So. Okay. So kind of one of the things that I want to point out that is maybe a little different in the medieval celebration of Christmas, both in the east and the west, is the focus, especially on Christmas Eve. In specific, the focus on Christmas Eve on the retelling of the story of Adam and Eve. So if you go to church on Christmas Eve in the Orthodox church, you'll hear the reading of the opening narrative of Genesis, the creation of the world and the fall of man, right? That's the Old Testament readings for Christmas Eve. And this is where the sort of, there is some kind of different origins and really they're probably all true to a certain extent. But one of the main origins of the Christmas tree comes from the paradise tree, which would be set up on Christmas Eve, which is actually the day you're supposed to put up your Christmas tree, not the day after American Thanksgiving. Everybody. We sort of compromise and usually do it on St Nicholas Day in my family, but which is in a couple of days from when we're recording this. But, but, anyway, but, but Christmas Eve traditional day when the tree goes up. And. And because the idea is it's the Tree of Paradise as the Tree of Life, the Tree of Paradise. And it was. There's a."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":2750.21,"end":2754.05,"speaker":"Jonathan Pageau","text":"There's a Paradise tree tradition both in east and West. You said on the."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":2754.13,"end":2824.39,"speaker":"Richard Rohlin","text":"Well, the Paradise Tree, not so much. But I. What I'm saying is the focus that. That's really a Western European thing, but the. I'm. I'm just saying the focus on. The focus on Adam and Eve on Christmas Eve is a. Is the thing of both the east and the west. And it's something that. It's weird. We kept the paradise tree. Right. And actually became totally ubiquitous and the Western celebration of Christmas and in the east, too, everyone does Christmas trees now. This is great. I'm super pro Christmas trees. So, like, go cut down a fir tree, put it in your living room. God will be pleased. Like, do it. But, but, but. But it's. It's interesting because the. The liturgical focus, as far as I know, and I could be wrong about this, but the liturgical focus in the west on. On Genesis on Christmas Eve has kind of been lost. But it was really cool. In the Middle Ages, they would have Passion plays about Adam and Eve. And this is the main. This is the main. Let me put it this way. This is the main time of year when somebody in, like, medieval England would have interacted with a Genesis story. Not just, like. Not just like, seen a picture of it or, like, heard it read or something like that, but the main time of year that they would have actually interacted with it in an embodied way would have been on Christmas Eve."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":2824.71,"end":2826.95,"speaker":"Jonathan Pageau","text":"So they would. They would have, like, play."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":2827.19,"end":3008.1,"speaker":"Richard Rohlin","text":"Yeah. And a Passion Play for people who don't know is like a paraliturgical thing. It's not something that happens in the church, but it's. It's. It's the origin, by the way, of, like, the, like the Easter pageant or the Christmas pageant that maybe you did. I did lots of these growing up as, you know, as an evangelical. Yeah. And they're really cool memories. But. But that has its basis in the Passion Play. But the Passion Play was something that. It's not something that they did in the church. It's something that they did in, like, the village square. Yeah. And they had. They had them for. Obviously the name Passion Play, you know, implies passion type, but they had them for. But they had them for all the various feast days of the year. In fact, the Passion plays for the. For Candlemask, Groundhog Day. We talked about that last year were really really cool. They had, you know, like a woman from the village that they selected to play the Virgin Mary and she would be carrying a baby and the whole city would. Village would process with her up to the door of the church and she'd present the baby to the priest and all this stuff like it was, you know. And so again, these are sort of like par. Liturgical ways to participate in the feast. Okay, so. And then also just one thing to mention is that because Christmas is a day to go to church, first and foremost is all these other things. But the thing that makes it a holy day is the fact that you're having the Mass. That's the Mass in increased Mass. Right. So it was considered to be a very important day. So there are a lot of famous kings and emperors, including Charlemagne, who were ordained on Christmas Day. Yeah, right. It was just considered to be like the most appropriate day for this. This kind of an action. I said ordained, you see, coronation, ordination. Right. But coronation is. That is a holy order. That's a sacrament of the church. So. All right, so let me talk a little bit real quick about Christmas in the early modern period. So what's really interesting is that the Reformation period gives birth to both Christmas as we basically, as we celebrate it now in the Western hemisphere, but also to the general anti Christmas movement. Right. So like both of those things come out of the Reformation. So on the one hand you have, for instance, Lutheranism, Martin Luther, big fan of Christmas, which I take as a redeeming quality. And he sort of engineered the massive production of Christmas hymns and carols. And you can always tell a Lutheran carol from a medieval Christian, medieval English carol, because the medieval English carols are like really weird and have like a lot of. Of symbolism and things like this. And the Lutheran carols, because they're written as theologically explicit songs are. Are like very like obviously theologically explicit. And so it's. Whereas, whereas like the. The older medieval carols are kind of more riddling in nature. But this is when Christmas trees really become a big thing, probably related to that paradise tree like we talked about. And also just the general very ancient practice in that part of the world of bringing greenery into the house as part of the winter celebration."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":3008.5,"end":3012.5,"speaker":"Jonathan Pageau","text":"Are there any of the medieval hymns that are still active now?"}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":3013.3,"end":3023.87,"speaker":"Richard Rohlin","text":"Yes, there are. I've actually kind of put together a playlist of some of them, of course, all the ones that we. So are you asking about hymns or carols? Because again, that's a. I think carols."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":3023.87,"end":3024.95,"speaker":"Jonathan Pageau","text":"Like Christmas carols."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":3024.95,"end":3032.31,"speaker":"Richard Rohlin","text":"Yeah. Yes, there are A few. Probably the oldest one that people know well is Good King Wenceslaus."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":3032.47,"end":3032.87,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":3033.03,"end":3043.99,"speaker":"Richard Rohlin","text":"Which is about the, which is about the practice, by the way, feeding the poor at Christmas. Right, right. And one of my favorite songs actually. But there's, which is weird because it's not like."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":3043.99,"end":3045.99,"speaker":"Jonathan Pageau","text":"Yeah, it's like it doesn't talk about Christmas."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":3046.55,"end":3046.79,"speaker":"Richard Rohlin","text":"Right."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":3046.87,"end":3049.75,"speaker":"Jonathan Pageau","text":"Directly in the way that like Holy Night does, let's say."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":3049.75,"end":3145.66,"speaker":"Richard Rohlin","text":"Yes. Yeah. Well, it's on the feast of Stephen, which people used to know is the second day of Christmas, but Yeah, yeah, people used to know that better, but, but it's a very old carol I met. As far as other ones that are like, still in popular vernacular, I have a bunch of ones that I like a whole lot that are not necessarily well known anymore. Um, but Abby, let me think about this. Maybe I'll try to post some on the Facebook group. I put together a kind of like a pre modern Advent playlist and just tried to find like all the carols and hymns that I could find that had been written before a certain date. And I, I've got about 30 or 40 things on that list. And so maybe I'll, maybe I'll share that with, with everybody again. But some of them are like, well known. Some of them are, you know, obviously all the, all the orthodox hymns for the feast are all know, written in like the 8th century. So, you know, that's all squarely pre modern. But, but those aren't carols. Right. Okay. So Lutheranism produces just a massive amount number of Christmas hymns and carols. Christmas trees really become a big thing. Actually. Luther was big on Christmas trees, not so much on the Krach. Right. The nativity scene. And so what's really funny is eventually this is the thing about Christmas, the stickiness that we've been talking about. People don't get rid of Christmas traditions, they just add new ones. And so, so some people were like, no, you should do a tree, not a creation. And so everybody's like, great, we'll do both. In fact, we'll do a craze under the Christmas tree. See, See how you like that? You know? Yeah."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":3146.38,"end":3148.62,"speaker":"Jonathan Pageau","text":"Makes so much sense symbolically to have."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":3148.62,"end":3149.82,"speaker":"Richard Rohlin","text":"Right, right, it does."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":3150.46,"end":3155.59,"speaker":"Jonathan Pageau","text":"Hierarchy of Evan and angels of light, you know, and then at the bottom you have the Krish."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":3155.83,"end":3158.39,"speaker":"Richard Rohlin","text":"You put an angel or a star at the top. The same thing."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":3158.63,"end":3159.35,"speaker":"Jonathan Pageau","text":"The same thing."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":3159.43,"end":3243.67,"speaker":"Richard Rohlin","text":"Yeah. I, I, I, I love, this is why I love Christmas so much. And I think it was like my, one of my primary early, like symbolic, my early symbolic education really was just Paying attention to Christmas customs and things like I was talking about earlier, because everything about Christmas is so deeply symbolically intuitive. That's just really beautiful. So. And a lot of the trappings that we think of as kind of defining the American Christmas now were basically brought to North America by the Moravians, by the Pennsylvania Dutch and by these, these other groups. And so there were several continental Reformed churches, such as the Dutch Reformed, which did continue to celebrate Christmas. They celebrated as one of the five evangelical feasts which were Christmas, Good Friday, Easter, Ascension and Pentecost. And I have never understood. Maybe somebody out there wants to enlighten me, Pastor Paul or somebody else, why those are the evangelical feasts and not any of the other things in the Gospels that are also Christian feasts. The name evangelical. Usually when we say something is evangelical in a historical sense, we mean it's mentioned in the gospels, but so is transfiguration, Annunciation, et cetera. So I don't know why are the five feasts with a five year evangelical feast, at least back then for the natural Reformed, where. I'm not saying of anything about current practice, but where Christmas, Good Friday, Easter, Ascension and Pentecost."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":3243.67,"end":3246.67,"speaker":"Jonathan Pageau","text":"I think it's because Easter, Ascension and Pentecost, right."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":3246.67,"end":3247.75,"speaker":"Richard Rohlin","text":"That's all kind of one cluster."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":3247.75,"end":3252.39,"speaker":"Jonathan Pageau","text":"There's a coherence. You know how many days you can get it from Scripture? Pretty much, yeah, yeah, yeah, yeah, yeah."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":3252.39,"end":3254.59,"speaker":"Richard Rohlin","text":"That might be what it is. I think that's what it is because."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":3254.59,"end":3258.39,"speaker":"Jonathan Pageau","text":"The other dates you, you can't get from Scripture when to celebrate the other ones."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":3258.56,"end":3308.65,"speaker":"Richard Rohlin","text":"And this is basically where we get the, the general idea in American Christianity. And here I'm going to speak very broadly of kind of like the, the Christmas and Easter rhythm, if, if you know what I'm talking about, like this idea by which you have Christmas and that's a big deal and you have Easter, which is usually a really big deal. And then. But there's really nothing else of particular spiritual significance between the two other than, of course you're, you're just your Sunday observance, your Lord's Day observance. Right. That's. And which is how I grew up. Right. Where we really get into trouble though, Christmas wise, is when we get into the Puritans. Right. And so here I have to say some things that, well, they're, I'm just going to read what they said. Like, it's not fun. These were not fun people. I don't know how else to say it."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":3309.29,"end":3310.85,"speaker":"Jonathan Pageau","text":"Puritans are not fun people."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":3310.85,"end":3356.43,"speaker":"Richard Rohlin","text":"Not fun people. You can quote me on that. But I think they would have said they were not fun people. That's right. So I think it's okay. So the, the, the puritanical movement, and by, by this I mean English Puritans being a sect of, of English Christians who thought that the Church of England and the Reformation had not gone far enough in rejecting what they call pokery or papism. Right. And so, so they were really trying to like purify. So you had your Puritans who were like trying to purify the Church of England and the separatists who were like, we're out of here. Right. But they're really kind of the same movement. And then of course, my own ancestors on one side of my family, the Scottish Calvinists, and who also did not like Christmas."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":3356.43,"end":3356.91,"speaker":"Jonathan Pageau","text":"Oh, really?"}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":3357.07,"end":3374.47,"speaker":"Richard Rohlin","text":"Yeah, well, some of them. So John Knox famously said, supported the banning of Christmas on the grounds that it was superstitious. Various Puritan writers referred to Christmas as being the trappings of potpourri, the rags of the beast and so on."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":3374.55,"end":3375.35,"speaker":"Jonathan Pageau","text":"The rags."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":3375.43,"end":3477.39,"speaker":"Richard Rohlin","text":"Rags of the beast, yeah. So, so this is, this is actually a really important thing to think about, I think, because sometimes when people talk about this, they'll say something like, well, the Puritans didn't ban Christmas. Actually they did for a very short period of time from the, for about 13 years. It was actually illegal to celebrate Christmas. Like straight up illegal to celebrate Christmas in England. Talk about that in a second. But they'll say something like, well, they were, they were rejecting it. This is what people will say. They'll say they were rejecting it because of the over celebration and the tendency for people to over celebrate. So the thing that I kind of want to point out here is two things. One is, is there's always been people, you know, inveighing against don't over celebrate. But it had never been necessary to ban the holiday outright. Right. The other thing though is to point out that the act of celebration for the Puritans, the act of celebration itself was associated with superstition and specifically Roman Catholicism. Yeah, right. And this even has weird manifestations. One of my areas of, of study that I did like a whole project on in my graduate degree was actually the American Prohibition movement and the temperance movement, which I'm just really interested in for a lot of reasons. But one of the interesting things that you'll find if you go back and you read a lot of the early temperance literature, and I have, I've actually gone to the, the country's largest temperance archives to like, read through a bunch of the early literature, which. What you'll find is that. Is that there is a lot of, frankly, anti Catholic sentiment as a part of the literature of the early temperance movement. Because it's the. It's the German, Italian, Irish immigrants coming over here."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":3477.39,"end":3478.11,"speaker":"Jonathan Pageau","text":"They drink."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":3478.35,"end":3539.52,"speaker":"Richard Rohlin","text":"Who drink. And that's causing the problem. Actually, it was actually probably the saloons that were causing the problem, not the beer gardens. But that's a different conversation. We can talk sometime about the symbolism of going from we all get together as a family to have some beer and we're sitting at a table looking at each other to I'm sitting at a bar facing a bartender. That's important. Important shift that happens there as part of the Industrial revolution. But anyway, different conversation for a different day. The thing I want to. I want to really emphasize, though, is that all of the stuff like the celebration, the drunkenness, but then also like the Mass and the liturgy. Right. The high things and the low things about the feast day for the Puritan, that was all a package and it had to all be rejected. And so this leads to the outright banning starting in 1645. Then again in 1647. There they passed an ordinance in England abolishing the feast of Christmas, Easter, and Whitsund, or Pentecost, abolishing Easter as well. Like which people always forget about that."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":3539.6,"end":3540.08,"speaker":"Jonathan Pageau","text":"Wow."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":3540.08,"end":3567.27,"speaker":"Richard Rohlin","text":"Always forget about that. And that remains in force until the Restoration in 1660. In fact, there was a really fun kind of a popular song. I wish I remembered to put the lyrics in my notes for this talk. But there was like a kind of a fun popular song celebrating. Because now we know, you know, that Charles has had, you know, Charles has come back, Charles ii. Because now we know when Christmas is. Yeah, yeah. And so there have been. Because there have been like, a lot of underground celebrations and things like that."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":3568.47,"end":3572.55,"speaker":"Jonathan Pageau","text":"Like, think about it today, if we said, I mean, they did it during COVID some."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":3572.55,"end":3573.51,"speaker":"Richard Rohlin","text":"Right, Right. Right."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":3573.59,"end":3576.55,"speaker":"Jonathan Pageau","text":"Here they're like, you can't celebrate Christmas this year."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":3576.55,"end":3608.61,"speaker":"Richard Rohlin","text":"And it's like, yeah, what's up? Yeah. So, yeah, this is like this. This was all a package deal. The Puritans believed that by Persia and the liturgy and the iconography of the papal religion, they would also be able to usher in an era of moral improvement. Right. And that's the kind of. The thing that's a continuous theme of people who want to get rid of Christmas is that by doing so, we'll make. We'll become morally better as a society. Right. That it's that Christmas is associated with excess, or it's associated with corruption, like decadence of some sort."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":3609.17,"end":3615.49,"speaker":"Jonathan Pageau","text":"Which is funny because, like, it's just interesting because that's the danger of the feast. You know, it's like."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":3615.49,"end":3615.81,"speaker":"Richard Rohlin","text":"Right."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":3615.81,"end":3653.3,"speaker":"Jonathan Pageau","text":"You think people don't get drunk at weddings. Right. Do you think people don't get drunk at funerals? Do you think people don't. You know, it's like when you gather together to celebrate something, it has. There's a kind of ecstasy there. There's something going on which is both very positive but also dangerous. And so you kind of have to navigate that line so that it doesn't fall into. And it also is a revealer. It reveals it. You know, the feast can reveal the nature of a group and reveal its quality, you know, because if it gets out of hand, then it. It also is showing something about the nature of that communion."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":3654.42,"end":3689.36,"speaker":"Richard Rohlin","text":"Yes, that is a really important note. The other. The other thing is that when you. When you try really hard to repress this. Yeah, right. That it. That it will pop up again, but it'll pop up in some really dangerously excessive way. That's right. Right. In the same way that, you know, the. If you. You could have Christian liturgy or you can have the occult, like, pick, like, you know, like. But. But there's a liturgical impulse in human beings that they. That, you know, everybody has to participate in something. So this is also, like."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":3689.44,"end":3716.43,"speaker":"Jonathan Pageau","text":"There's so many things about it, like social dancing, for example. Oh, yeah, Great example of that. Where it's like. It's like, can you be at a. At a feast where you dance with someone else's wife? Can you. Is that possible? And then what? Can. Can you maintain the order and the right. The right ordering in that kind of. That place that could reveal your. Your darkness, let's say."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":3716.51,"end":3719.47,"speaker":"Richard Rohlin","text":"Yeah. Yeah. Can I tell you a joke?"}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":3719.47,"end":3720.27,"speaker":"Jonathan Pageau","text":"Yeah, go for it."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":3720.27,"end":3897.3,"speaker":"Richard Rohlin","text":"This is a joke that we baptized as a Baptist growing up, we told about ourselves. So it's. It's not intended to be cruel. How Baptist? So it goes like, how Baptist am I? How Baptist are you? I'm so Baptist that we don't play Old Maid in the front of the house, because if somebody drives through by at 50 miles an hour, looks through the window, sees us playing cards, they'll assume we're playing poker. If we're playing poker, we're gambling. If you're gambling, you're fornicating. We all know that fornication leads to premarital dancing. That's a marriage. Yeah. Anyway, just. Yeah. Oh, it's A joke that we kind of told about ourselves. But, but I think there's really something to that social dancing is, which is something I was not allowed to do growing up. And then I married a wife, my, my wife who, who loves dancing. And so we, you know, so she sort of like introduced me to it and it was just like, man, it was, it was a weird moment. The first time that I danced to music, it was bizarre. And the reason it was bizarre, I discovered two things. One is I really like dancing, but the other is that I suddenly realized what music was for. Like, I, I, I grew up, I was a violinist and I did a lot of like Irish fiddle music, like jigs and reels, which are just dancing now, dancing. But I'd never danced in my life. And so my wife and I, we used to do like, we got really into folk dance at a period and we did a bunch of Scottish country dance. And the first time I like danced to a, a, a, a reel, but I was actually doing the reel. Suddenly everything about the music clicked into place for me and it was just this very bizarre moment of realizing that, that like there was a whole half of me that was dead. And then it just came to life and it was, it was just very, it was very strange. So yeah, all this to say there was this period, you know, a relatively short period, but a pretty infamous period, and it really scarred English society for a long time where it was actually against the law to celebrate Christmas. And of course, the real irony in all of this is that the direct descendants of Puritans will now fight vociferously to have a nativity scene in a public space. That's right, right. To, to, to fight for the use of Merry Christmas instead of just Happy Holidays and so on. And I, and, and it's because there's the stickiness about Christmas. Like, you can do whatever you want to, but Christmas will win. Eventually. It will win. And plenty of other people have tried to get rid of it since the time of the Puritans. We could talk about, I'll talk about something in a moment. But of course there's like a modern manifestation of Puritanism that is sort of like the political correct, the PC woke culture, right? That, that, that tries really hard to get rid of Christmas or to change Christmas or to like reimagine it in some way. I mean, think about any modern TV show. It's been a thing in American network television for decades that you have to have a Christmas episode, right? And so one of the things that you'll see in more recent TV shows is that whenever the Christmas episode comes around, they have to do more and more to kind of like, recontextualize what Christmas means, but they can't get away from doing the episode right."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":3897.46,"end":3927.96,"speaker":"Jonathan Pageau","text":"And Christmas, man, Christmas aesthetics, they are powerful. You cannot get rid of that. Like, just. It's weird because even, like, even the. The. Even the. All the efforts of all the marketing companies to reduce it and to remove the Christian part of it and to stylize it and to do that is just feeding it. Like, you cannot get rid of. Of the Christian, The. The Christmas, like, visuals, the smell, the. The music. It just."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":3927.96,"end":3928.24,"speaker":"Richard Rohlin","text":"You."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":3928.4,"end":3932.24,"speaker":"Jonathan Pageau","text":"There's no way now, like, imagine trying to. To get rid of that."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":3932.64,"end":3933.08,"speaker":"Richard Rohlin","text":"Yeah."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":3933.08,"end":3933.72,"speaker":"Jonathan Pageau","text":"Just impossible."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":3933.72,"end":4121.7,"speaker":"Richard Rohlin","text":"Yeah. So actually, you mentioned the smell. I wanted to make sure I didn't forget to mention this. So. Because New England. New England specifically, other parts of the US Were founded. Were. Were settled by different people, many of whom were like, had no trouble with Crispus at all. But. But New England was settled by Puritans and separatists, Right. And one of the really interesting things there is that at some point in the history of New England, it was before the American Revolution, they. The towns in New England would actually hire mint sniffers. They were called mint sniffers. So the job of a mint sniffer is to walk through the village or walk through the town on Christmas Day and sniff the air and make sure nobody's cooking Christmas foods on Christmas Day, man. And you could be, like, really severely punished, really severely punished for celebrating Christmas, you know, at that particular time. So. And at that time, like, the whole idea of Christmas celebration, again, like, that's something that German immigrants at the end of the street might be doing, but good Puritan families were participating in that. So to kind of get up to modern times, the early 19th century is really a renaissance for Christmas celebrations in the Anglosphere. And this is for two reasons. One is the Oxford movement, which is basically this. It was like a movement within the Church of England to kind of return to, like, a more patristic basis for the tradition. It's kind of when Anglo Catholicism as such sort of develops into full flower, right? And kind of right along the same time, you had a guy named Charles Dickens, and I know they made a movie about him couple years ago or something called the man who Invented Christmas, which I actually did not see because I hate seeing movies about historical figures that I like or I know a lot about because I'll just get angry, especially now. It's like now, right maybe 20 years ago. Yeah, yeah, yeah. I just don't. I didn't know what they're going to do, but. So I don't know if the movie was any good or not, but it's. It's like, you know, there's something about the title there, the man who Invented Christmas, which is like, a little cheeky, but also. Also, it's not totally wrong. Right. Like I said, Christmas had been pretty. Had taken a pretty big hit in the 17th century, and it was being celebrated in England again. But also it was. It was still like. There was just a lot of every year, like, kind of like hand wringing around the celebration of Christmas and et cetera. So. But this really between the Oxford movement and they're trying to go back and basically revise, revive the medieval practices of these feasts. And then Charles Dickens coming along and writing A Christmas Carol, did a ton to revive traditional celebrations of the holiday, focused especially on the ancient theme of charitable works at this time, which, again, is a very important part of traditionally celebrating Christmas. And to this day, I mean, you say what you want to say about Americans, but to this day, it remains this time of year that we are the most likely to give to charity, even people who don't think about or give anything to the poor the rest of the year on Christmas, there's suddenly this generosity that our hearts will open up, you know, a little bit more than they were open before."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":4121.86,"end":4137.7,"speaker":"Jonathan Pageau","text":"Yeah, it's interesting that Dickens. I. It's funny because now, I never thought about that, but I think about now that it's called the Christmas Carol. Yeah, it's a secular, you know, it's not directly Christian. It. It kind of floats around the themes, like what you described about the Christmas carols."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":4137.78,"end":4241.12,"speaker":"Richard Rohlin","text":"That's exactly why it's called a Christmas Carol. And it's. It's. It's so interesting because there are, of course, references to people going to church, references to Christ, references to, like, the theme of the day, the little babe in the manger who makes the lame walk and, you know, et cetera. Right. That's all in there. But you're right, it's not a liturgical story. It's not just a retelling of the nativity narratives from the Gospels or something like that. It's this sort of thing that's happening around the church, right around the church, and specifically throughout the life of one man. And it kind of creates this really. I think. I think what is so genius about the Christmas Carol? I mean, we should do a whole video just on it. Is that it? We're going to talk in a moment about these idea of, like, sort of knots in time. Right. Which is really what a feast day is. And the Christmas Carol takes that idea and runs with it because it ties Scrooge's entire life together over the course of one Christmas to the next. Right. Which. Which becomes like, a really powerful way of thinking about our own lives. Right. You know, where were we on this feast day? What person were we on this feast day? You know, so in the United States, like I said, Chris, Christmas was really seen more as more of an ethnic holiday, which meant that you actually had whole communities that just didn't celebrate Christmas, which is kind of unthinkable now until about the late 19th century. And it really starts to be celebrated in the late 19th century thanks to the works of poets like the guy whose name I'm forgetting right now who wrote the. Was originally called a visit from St Nicholas. Twas the Night Before Christmas, you know, that poem. And then which. Which. Which really basically kicks off the whole idea of gift giving at Christmas in the United States."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":4241.12,"end":4248.08,"speaker":"Jonathan Pageau","text":"Yeah. And joins the. The feast of St. Nicholas with Christmas. Because I always wondered, like, when did that happen? At some point for us, it's crushed together in the west."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":4248.08,"end":4248.92,"speaker":"Richard Rohlin","text":"Yeah, yeah."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":4248.92,"end":4251.08,"speaker":"Jonathan Pageau","text":"St. Nicholas and Christmas is the same. And then you've."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":4251.08,"end":4251.88,"speaker":"Richard Rohlin","text":"You like."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":4251.88,"end":4262.03,"speaker":"Jonathan Pageau","text":"I had a Romanian priest in our parish for a few years, and he was really annoyed that we gave gifts at Christmas and was, like, really trying to, like, make sure that we give our gifts, you know, on St. Nicholas Day, which."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":4262.03,"end":4262.75,"speaker":"Richard Rohlin","text":"Oh, that's so fun."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":4262.75,"end":4267.23,"speaker":"Jonathan Pageau","text":"He didn't succeed, though. Like, nice try. It's too. Now it's too deep. Like an art."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":4267.23,"end":4317.4,"speaker":"Richard Rohlin","text":"Too deep. Yeah, yeah. You can't. You can't undo it. And then there was also Harriet Beecher Stowe, who wrote Uncle Tom's Cabin, which is, I guess, a little infamous now. But anyway, she also wrote a story, I think it's called A Christmas in New England, which did a lot to kind of popularize the celebration of Christmas. And, like, the whole focus of A Christmas in New England. Right. Is on this sort of, like, immigrant community within New England that's celebrating the holiday and that other people kind of get involved and participate in it. And so, yeah, so in the 18, late 19th century is really when Christmas takes off in the United States. And this culminates in its declaration as a federal holiday in 1870. And it's important to note that for Americans, that wasn't even a holiday. Great. Christmas wasn't even a holiday. After the time, and it's totally unthinkable now, but, like, George Washington didn't celebrate Christmas."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":4317.4,"end":4318.6,"speaker":"Jonathan Pageau","text":"Worked on Christmas. Yeah."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":4318.6,"end":4360.08,"speaker":"Richard Rohlin","text":"Like. Like, he didn't just work on Christmas. He fought b. He attacked the Hessians, who were Germans on Christmas because they were celebrating. And it was like. That's like his famous, like, crossing the Delaware attacks. The Hessians, one of the most important victories of the American Revolutionary War, worked because the Americans weren't celebrating on Christmas Day. And the. And the Hessians were. Right. So it's like these various, like, very interesting kind of history there in our early status as a early time as a nation. And then Christmas kind of developing more and more versus this immigrant thing, and that now it's totally universal. And so there's a lot more that we could probably say about the symbolism of the holiday. I kind of run out of time here to talk about the use of, like, Santa Claus as a marketing image."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":4360.24,"end":4360.68,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":4360.68,"end":4364.32,"speaker":"Richard Rohlin","text":"Or Coca Cola specifically. And also, I think it's important."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":4364.32,"end":4375.04,"speaker":"Jonathan Pageau","text":"I think this is an argument that people use a lot, is that in some ways, you know, Santa Claus today was made up by Coca Cola. And I really. I resist that to some extent."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":4375.04,"end":4376.08,"speaker":"Richard Rohlin","text":"I agree. I agree."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":4376.16,"end":4399.38,"speaker":"Jonathan Pageau","text":"You know, I think that the. The character of father Christmas and St Nicholas were there in the 19th century. You see the characters and then they kind of get fused into one. One. One character, which is our modern Santa Claus. But. And then. And then the marketing companies kind of jump on that. And, you know, Coca Cola did simplify the costume, let's say, in terms of the white band and stuff."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":4399.38,"end":4404.3,"speaker":"Richard Rohlin","text":"Right. And made it, let's be honest, like, a little more palatable to some people. Right. Like, well, less."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":4404.3,"end":4405.3,"speaker":"Jonathan Pageau","text":"Less of a bishop."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":4405.46,"end":4412.26,"speaker":"Richard Rohlin","text":"Right, exactly. Some guy with a crozier and a bishop's miter. Like, that's not gonna. That's not gonna play in, like, post. Yeah, exactly."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":4412.26,"end":4414.86,"speaker":"Jonathan Pageau","text":"Like post Puritan. Puritan America."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":4414.86,"end":4415.3,"speaker":"Richard Rohlin","text":"Yeah."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":4415.48,"end":4467.17,"speaker":"Jonathan Pageau","text":"Um, but. But nonetheless, like, they stumble onto all this. Amazing. This is why when you talk about how Christmas is so sticky, it's like, you know, people. I did a video on Rudolph the Red Nosed Reindeer, which is basically. Was made up by, like, what was it? One of the big department stores in the United States, and it was given out at Christmas as a gift to people buying at the department store to get people into the store. But they stumbled onto true things. You know, there's something about how symbolism happens, and I think in the symbolism of Santa Claus and the way that we think about the sleigh and everything, all of these. These are very powerful images that. That. That even though marketing companies came up with them or brought them up, it doesn't really matter if we recognize in them some images that have weight, and the fact that they're remembered means that there's. There's some actual weight in those images."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":4467.87,"end":4508.48,"speaker":"Richard Rohlin","text":"Yeah, I'm a huge sucker for Santa Claus movies in General. Miracle on 34th street is a really. There are two remakes. They made it twice, and both versions are quite good. I think there's also. There was an animated film about Santa Claus. Like us. Santa Claus is like a family dynasty that came out a few years later called, a few years ago, rather called Arthur Christmas. And it's a really interesting movie. It does a lot of sort of interesting things, like tries to subvert the Santa Claus symbolism at the outset and then shows all the problems that that causes. And then by the end, things have to kind of revert back to the traditional pattern. And I haven't seen it."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":4508.48,"end":4509.12,"speaker":"Jonathan Pageau","text":"I should watch that."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":4509.12,"end":4548.57,"speaker":"Richard Rohlin","text":"Yeah, it's interesting. I would love to know your thoughts on it. It's an interesting one. But, yeah, I think that it's one of these weird things because actually the Soviet Union, of course, tried to also abolish Christmas, and when they did, they just replaced it with a winter holiday, and they had a. They had Old Man Winter, you know, who looks. Who's dressed exactly like Santa Claus. Right. And he's the one that brings you to the presents now. You know? You know, and it's. There's something about this, right. All of the attempts actually to revive or. Or create competing wizard holidays in the secular world around us today, going back to the French Revolution. My favorite one is the. Do you guys. Do you have, like, the Three Kings cake? Is that something that you do?"}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":4548.57,"end":4549.33,"speaker":"Jonathan Pageau","text":"Yeah, we do that here."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":4549.33,"end":4576.83,"speaker":"Richard Rohlin","text":"Yeah. Yeah. So that's a French thing. It's not something that I grew up with, but it's a French thing. So you'll get a kick out of knowing that during the French Revolution, they renamed the Three Kings cake to the Equality Cake, which is amazing because the original story about the three kings is that you have, like, the highest thing becomes low, and then the high thing comes down and venerates the thing that's become low. That was, you know, like. And then it's like, you know, a quality cake. It's all perfectly. It's all perfectly even."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":4577.07,"end":4580.71,"speaker":"Jonathan Pageau","text":"And they don't put. They don't put the seed. I imagine they don't put the seed in there. They don't."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":4580.71,"end":4582.55,"speaker":"Richard Rohlin","text":"I assume not, because it's like, hey."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":4582.55,"end":4585.63,"speaker":"Jonathan Pageau","text":"Someone gets someone special if he finds the seed. Can't have that."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":4585.79,"end":4589.63,"speaker":"Richard Rohlin","text":"You get the guillotine if you find the seed cake. Yeah."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":4589.71,"end":4593.63,"speaker":"Jonathan Pageau","text":"Anyway, like, in Quebec, we. Like in French. In. In. In Quebec, we."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":4593.63,"end":4593.99,"speaker":"Richard Rohlin","text":"Yeah."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":4593.99,"end":4596.19,"speaker":"Jonathan Pageau","text":"Santa Claus, we call him Father Christmas."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":4596.51,"end":4596.99,"speaker":"Richard Rohlin","text":"Yeah."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":4596.99,"end":4598.95,"speaker":"Jonathan Pageau","text":"Like, that's how. And that's a."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":4598.95,"end":4600.87,"speaker":"Richard Rohlin","text":"That's a Papa Noel or something."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":4600.87,"end":4601.51,"speaker":"Jonathan Pageau","text":"Papa Noel."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":4601.51,"end":4601.87,"speaker":"Richard Rohlin","text":"Yeah."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":4602.43,"end":4615.55,"speaker":"Jonathan Pageau","text":"And that's like a. That there's this whole character that appeared in Western Europe and in France that had the. Had the hat and was very similar to the way that we understand Santa Claus now. So it's like all these characters get fused."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":4616.03,"end":4779.4,"speaker":"Richard Rohlin","text":"Yeah. It seems like it's a thing that. That has to happen, you know? Yeah. So I want to. There's a lot more we could say about this, but there are a few things that I want to point out that are, like, really beautiful to me about all of this that we kind of been talking about. And then I'm going to give you what I call my midwit defense of Christmas. All right, so the first thing is just to say that kind of against the general detractors of Christmas. Right. That Christmas is actually not our most over commercialized time of the year. We're always over commercialized. Christmas is the only time of year that we notice it. Right. Because, you know, if you think about like all the kitsch and like the $1, you know, like the bargain bins and stuff at Target or Walmart or whatever, like those are there all year, you know, but only at Christmas do you notice it and get irritated about it. Yeah. I think it is a really beautiful time where the sort of, let's say the soft iconoclasm of American religion gives way to not just like putting up nativity scenes with statues of Jesus, Joseph and Mary, like in your house, in your yard, in the village square. Right. But actually defending that practice in the court of public opinion, which is really something to think about. Um, and it's also the time of year, like I mentioned, by the. By the numbers, we're the most generous. Right. It's the one day a year that even confirmed heathens will show up to church. So I was a pastor, and I'm from a family of pastors. And I get that there's always something in you that wants to complain when somebody shows up on Christmas Day or Easter or Pascha, and you haven't seen them in a year. Yeah. You know, it's like, oh, so now you're here. Right. But. But like, you could also flip that around, though, and think about the fact that there's something so potent about this day that even the most confirmed heathen will still show up to light a candle, right? They'll still show up to a midnight. Like, they'll still come to church with their kids. Like, they take their kids to church the one day a year. There's something really special, something really potent about. About this day. So I want to kind of explain that. I'll give you what I call my. My midwit apology or. Or defense of Christmas. And I call it a midwit. Some people know I'm a big fan of, like, the. The format of the midwit meme, right? And so, you know, the, the. I'm sure we can put one up here on the screen or something. But, you know, the idea is this is you have like a really dumb person at one end and a really smart person at the other end, and there's a bell curve in the middle and a bell curve in the middle. That guy's the midwit. Um, so in this case, the meme is the really. The really simple person who says, celebrate Christmas because it's Jesus birthday. Right? And then at the other end, you have the saint who says the same thing, Celebrate Christmas because it's Jesus birthday. And for a lot of people, and I'll. I'll go as far as to say probably the majority of the people watching this video. That is enough. That is enough. But for all the people kind of like in the middle there."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":4779.56,"end":4780.68,"speaker":"Jonathan Pageau","text":"The source people."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":4781.24,"end":4986.6,"speaker":"Richard Rohlin","text":"Yeah, the source has people. Yes. We need, like, a little more kind of an explanation or understanding of why we're doing the things that we're doing. And, and again, as I said to me, this is a really important. This really important thing. So I'm going to read some little bits and kind of talk through some bits from Charles Taylor's work, A Secular Age, which is one of the most important books that I think anybody could read right now. And what's amazing is that a lot of the ideas that I have really benefited from here on the symbolic world. Listening to your videos and conversations over the last several years, I first encountered in Taylor, and then when I saw your videos, I was like, oh, somebody else is talking about that same thing, right? And it was just a really, I don't know, validating a certain way. So he talks about basically this idea that there are three kinds of time. For Medieval man, there are three kinds of time. And the. The first one is the. In. In one of our previous videos, I refer to this as the difference between Kronos and Kairos as two kinds of time. But Taylor says there's three. Right. So there's. First of all, there's. There's Kronos, which we could refer to as was what. What Taylor calls homogeneous or empty time. Right. Which for modernity is the central form of time. Yeah, right. History as a series of accidents. Right. In the philosophical sense, like history as a series of accidents. Cause and effect and just sort of this cause and effect in an endless chain with no particular meaning to it. Right. And then the second kind of time is what we could call chirotic time. And so chirotic time would be time filled, being filled with meaning. So Taylor says that the time of carnival, for instance, is chirotic. That is, the timeline encounters chironic knots. So you have this straight line and then suddenly you get kind of like a knot where everything gets kind of snarled up and bended together and moments whose nature and placing calls for reversal, followed by others demanding rededication and still others which approach parousia. So this is his Shrove Tuesday, Lent, Easter. Right. So Shrove Tuesday, that's Mardi Gras, right. Is this a great moment of carnival or reversal followed by Lent for rededication and then Easter, which is like Parousi of the coming, where they're revealing. So there are. Now, there are chirotic knots in the stories we tell about ourselves in our time. Revolutions themselves are understood by their heirs and supporters as such chirotic moments. You think about whatever country you live in and. And the. The important political moments or like revolutions that you've had. In my case, like the American Revolution becomes this huge kind of chirotic moment where the actual details and timelines about George Washington and Benjamin Franklin and the founding fathers and July 4th and all that stuff is less important than all of those things kind of being gathered together in that particular moment. It says nationalist, for historiography is full of such moments. But what has changed is that around which these moments gather. So in the pre modern era, the organizing field for ordinary time comes from these higher times. So the higher times are basically two sources. So if you think of ordinary time as like secular time, I know that the word secular can mean various different things here, but for now, we'll just call it this sort of homogeneous chronological time. There are kind of two sources for that meaning. And one is what is eternity, right? Eternity sort of breaking into ordinary time. And then the other is what Taylor calls like the great time."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":4986.84,"end":4987.24,"speaker":"Jonathan Pageau","text":"Right?"}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":4987.4,"end":5135.79,"speaker":"Richard Rohlin","text":"And this is. This is like. Is say like Mythical time. This is like when all the important stuff happened to make the way the world that it is today. Right. So if you're, you know, living in like a pre, like, like a Stone age civilization or something, the great time is like when the gods were on earth, walking around among mortals. Right. You know, for the Christian story, the great time is really the gospel, right. The gospels, when Christ was here on earth, right. When he's establishing these things. And there's this idea that Taylor really develops, the way that you have the horizontal dimension of secular time, but also these vertical dimensions where eternity and where. Or. And the, and or the great time kind of break into that secular time. And you could say like the more pronounced that happens, the bigger the not becomes. Yeah. And this is what makes these relationships. And it's really a three way relationship between homogenous time and, and, you know, like our mythical history and then eternity. Yeah. The more relationships there are, the bigger than it becomes. And this is actually what gives time meaning. And there's a famous line in Hamlet, and I'm still waiting for all the symbolic, real people to have like the big Hamlet moment. So maybe it'll happen. Because Hamlet is a tremendously important, one of Shakespeare's most important plays. It's a tremendously important work of literature because it's, it's one of the things that Hamlet is grappling with is the, is the sort of the great disenchantment and the, the Passover from the ancient world into the modern. Right. It's, it's not for nothing that, that Hamlet has just come from, you know, university, you know, in Germany at the birthplace of the Reformation. He's just come from university in Germany at the birthplace of modernity. Right. He's coming back and he's trying to apply these modern understandings to this, these encounters with the world that are just wild and insane. His father is a ghost and his mother, you know, and a big cuckold, like all these things. And Hamlet eventually goes insane, like trying to kind of keep it all together, you know, and you know, get stabbed in a duel and everything else as well. But, but I mean, the, the kind of. The point. You know, this is one of the big things that the, the, the play is wrestling with. And, but there's this line in there where he says the times are out of joint."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":5136.11,"end":5136.67,"speaker":"Jonathan Pageau","text":"Mm."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":5136.67,"end":5291.54,"speaker":"Richard Rohlin","text":"The times are out of joint. Which has kind of become like a, like a phrase. But this is what it means. It means that he, he's. He's. He's, uh, he's not just saying the condition of Danish society at this particular time is lamentable. That's not what he means. He means that things aren't fitting together in the proper fashion anymore, as they do in times which are closer to those bordering paradigms of eternity and of the sacred time. And it's. It's interesting. This comes relatively soon after his. He's having a discussion with Marcellus, and Marcellus says, you know, that ghosts and goblins don't dare walk the earth on Christmas Eve, you know, on. So hallowed and so gracious is the time. Which, by the way, you know, this is. Is Hamlet a Christmas story? Well, if Die Hard is a Christmas story, Hamlet is definitely a Christmas story. But anyway, so the thing with Christmas is that it's one of these moments, and the other moment really is the. The crucifixion, which is something that. That. That Taylor also identifies that the crucifixion and Christmas are these two moments where there's a complete. Like. Like the relationships that kind of keep all of these things related to each other are like the most complete. Right. The symbolism matches up the most. Right. You could say. And because of that, these moments become extremely sticky or the knots become, like, really, really tangled and. And it becomes almost impossible. Becomes almost impossible to disentangle those things. And so what people try to do is sort of cut the Gordian knot and just like cut right through it and say, no more Christmas. Right. But. But it. But it. Christmas has this tremendous regenerative quality to it. And I think it's because it's the moment when. It's the moment when the great time and eternity and chronological time. I mean, it's really important that Christ was born in Bethlehem. We know more or less the day, we know more or less the year, but it's really important that God enters history. Because the other option is that you have with the situation that the Greeks had, which would be chronological time and then eternity, like the world of ideas, but there's nothing to kind of bridge the gap between them. So what they end up coming up with is the idea of time as being sort of sempiternal, which is constantly, constantly progressing, basically, time with no beginning or no end. Right. Like, always change but never fulfillment. Right. And. But in Christmas, we get this. We get this. This fulfillment of all of these things and all of the sort of. The vertical and the horizontal dimensions of time come together in this warp."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":5291.86,"end":5292.7,"speaker":"Jonathan Pageau","text":"Yeah, yeah."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":5292.7,"end":5293.22,"speaker":"Richard Rohlin","text":"Which is."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":5293.22,"end":5323.01,"speaker":"Jonathan Pageau","text":"Here's in the story itself, like we mentioned, obviously, we don't want to go through all the Christmas symbolism, but there it is, the tree with the. With the nativity set, you know, at the bottom of the manger. Whether it is the angels singing down to the shepherds, you know, they're. They're just countless. Or it is these. These wise men that come from afar. Like, all of the symbolism of Christmas is about this intersection in the story itself, not even accounting for what it is, what it's actually doing for us at that moment."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":5323.33,"end":5492.75,"speaker":"Richard Rohlin","text":"So this is my. Just to wrap this up, this is my argument for why you have to celebrate Christmas, right? It's not just enough to believe that the child born of a virgin was the Logos from before the ages, right? We can say we believe that all we want to, but if we don't act on that information in some way, and the way that you act on this information. Taylor talks about liturgy and like, let's say he talks about the feast, the act of celebration, as being like a song, right? So the song has a melody. Like a. Think of, like a little melody, has sequential moments, you know, all these different notes and everything. But. But really, the beginning to the end of that song all happen in the same moment because it's a unit, right? So if you don't sing the song, then you're not actually. You have no way of participating in it in that moment. The moment just passes you by, right? And if you don't celebrate Christmas, then the moment, this holy moment, right? This moment when heaven and earth, everything comes together into this point, right? That moment just passes you by, and pretty soon you stop believing at all, right? You stop really thinking. I mean, there. You know, there's. There are certain organizations that will do, like, polls to see, like, what's the state of belief, you know, and like, year after year, if you look at this, one of the questions on there is. Is true or false. Jesus Christ is the greatest being ever created by God. Right? And so. And that's. So it's one of the questions on the survey and. Horrible question every. Well, yeah, it's. It's definitely a leading question. Right. But. Yeah, but what happens is that every year or every four years when they do the survey, that number goes up by 10 or 15%. Yeah, right. Where people are just sort of like, sliding into Arianism. Right. And, you know, there's a lot that could be said about the state of catechesis and theological education in churches in America today, et cetera, et cetera. But really, the thing that we need to do is not just put Christ back in Christmas, but Put the mass back in Christmas, right, To really keep the feast, to keep the celebration. And you can keep it at every single one of these dimensions. You can go to church and contemplate the mystery. You can wake your neighbors up at 9 o' clock at night and sing them songs and offer them booze. You can do all of this stuff. You can participate in all of these dimensions. And if you do, you'll be more of a human being than you were. But if you do, you will also be able to draw closer to Christ and closer to your neighbor. Right? And that actually, without these things, what ends up happening is that time just becomes. Does every. Does anybody remember Covid? Right, with all the celebrations taken away, like, like, what happened? Time."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":5492.75,"end":5494.71,"speaker":"Jonathan Pageau","text":"What happened during COVID Exactly."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":5494.87,"end":5499.67,"speaker":"Richard Rohlin","text":"Time just becomes this long, kind of like. Like undifferentiated, linear."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":5500.16,"end":5500.48,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":5500.64,"end":5513.44,"speaker":"Richard Rohlin","text":"You know, passage. And. And nothing there. And there's no memory. Right? There's no memory. There's no participation. So that's the Midwood explanation. The easy one is, it's Jesus birthday. Why wouldn't you celebrate it? So."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":5514.4,"end":5522.88,"speaker":"Jonathan Pageau","text":"All right, Richard, that's great. Thank you so much. And don't forget, everybody, by the way, that Richard will be there at the Symbolic World Summit. So if you want to."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":5522.88,"end":5533.37,"speaker":"Richard Rohlin","text":"I have so many crazy things planned for the Universal History panel. I mean, I'm really gonna. I'm gonna really, like, just not restrain myself even a little bit. We're gonna get into some really fun, weird stuff. So."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":5533.69,"end":5557.09,"speaker":"Jonathan Pageau","text":"So I can't. I definitely can't wait. So, everybody, thanks again, Richard. I wish you a merry Christmas and likewise. See you in the. In the. In the new year. If you enjoyed these videos and podcasts, please go to the symbolicworld.com website and see how you can support what we're doing. There are multiple subscriber tiers with perks. There are apparel and books to purchase. So go to the symbolicworld.com and thank."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":5557.09,"end":5558.25,"speaker":"Richard Rohlin","text":"You for your support."}
{"episode_id":"SW - #320 - 2023-12-30 - Richard Rohlin - The Universal History of Christmas","start":5558.89,"end":5613.79,"speaker":"Jonathan Pageau","text":"I want to invite you all to the very first Symbolic World Summit. Over three days, we will finally meet in real time, in real space. And everyone from this little corner of the Internet will be there to explore the theme of reclaiming the cosmic image. Of course, I will be speaking, but there will also be Martin Shaw, who is an amazing mythographer, Father Steve Steven DeYoung of Lord of Spirit fame. There will be Richard Rowland from the Universal History series, Vesper Stamper, Nicholas Cotar, and Neil Degrade that you've all seen on my channel here and there. For entertainment, we have everyone's favorite apocalyptic band, the one and only Dirt Poe Robbins. This event will be the chance of a lifetime to capture and embrace our current moment. So Join us from February 20th 9th to March 2nd, 2024 in Tarpon Springs, Florida. Visit the SymbolicWorld.com summit for more information. I will see you there."}
