{"episode_id":"SW - #221 - 2022-03-01 - Fr. Silouan Justiniano - Icons and Contemporary Art","start":0.32,"end":149.34,"speaker":"Jonathan Pageau","text":"What you're about to see is a discussion that I had with Father Silouan Giustiniano. Father Silouan is a hieromonch. He is also a priest in the Orthodox Church, but mostly to us, he is really an artist. In my estimation, Father Silouan is one of the most important artists, visual artists, in North America today in the sense that his understanding of traditional iconography, his attention to detail, his mastery of color, his. His capacity to bring in strains from different traditional arts, but also from contemporary art, into a sacred art, which is powerful and is present while also being very traditional. And I think that he offers us a vision of what North American Orthodox sacred art could look like. But not only that, I believe that he can also point us to a direction in which sacred art can be a model even for secular art, gallery art, but also popular art as well. And so in our discussion, we talk about visual art. We talk about the traditional doctrine of art as was formulated by an art historian, Ananda Kumarasamy, at the beginning of the century. And so we go through much of contemporary art, modern art, and also how it connects to iconography. And so it's a very rich and. And powerful discussion, and I'm very happy to be sharing it with you today. This is Jonathan Peugeot. Welcome to the symbolic world. So what I want to do is, I definitely want to talk about. I want to kind of revisit the conversation we had a few years ago that I didn't. That I didn't record. Well, this one should be good because I know what I'm doing now. And so that's what I mostly want to do. And I want people. I want you to talk about your art and your approach. You know, I had Aiden Hart on, and I had other. Other people. And I'm trying to kind of create communication channels between secular art world and the sacred, sacred art. And it's working. Like I. I'm getting. It's crazy. Like, the people that are reaching out to me, it's not like in the secular art world, and the amount of catechumen that are coming in from the."}
{"episode_id":"SW - #221 - 2022-03-01 - Fr. Silouan Justiniano - Icons and Contemporary Art","start":149.34,"end":253,"speaker":"Fr Silouan Giustiniano","text":"Art world, that's very important. Man, what you just described, like, the bridge or like the conversation beginning, that's. That's like. It's been a need that has not been addressed at all, at least in the Anglophone world, as I have come to. To understand what has been happening in, like, you know, late 20th century, you know, 21st century. Like, orthodoxy, unfortunately, has a treasure of things to offer, but it tends to suffer from isolation or a insularity that is counterproductive. And one of my concerns for many years has been how do you engage in that conversation with nuance, but without compromise? And it's a hard one. It's a hard one. And sometimes I think I got it grasped, and then it slips out of, you know, out of control. I don't. It's hard to engage it. But one of the key factors that I have found that, like, helps to deal with the problem is having a cognizance of the historical paradigm of fine art as we have come down to understand it since the 18th century. If we come to an understanding that something shifted in terms of what was, what we tend to in our community call the traditional doctrine of art from that to the fine art paradigm, then you have a better sort of, like, feel to, you know, to place things into and to come up with better answers, I think. Because if you don't have that, then you're more muddled, it's more confusing."}
{"episode_id":"SW - #221 - 2022-03-01 - Fr. Silouan Justiniano - Icons and Contemporary Art","start":253.16,"end":268.28,"speaker":"Jonathan Pageau","text":"So maybe we can start with that. Maybe you can lay that out for us. I mentioned it a few times on the channel, but I would really love to hear your take on what happened. What is the change between the kind of traditional vision of the arts and the fine art paradigm?"}
{"episode_id":"SW - #221 - 2022-03-01 - Fr. Silouan Justiniano - Icons and Contemporary Art","start":269.08,"end":456.63,"speaker":"Fr Silouan Giustiniano","text":"One thing that I think is important to keep in mind is that we could become a bit too abstract in sort of like, isolating this idea of the traditional doctrine and in separating it from, like, historical developments that occurred. And I'm mainly primarily thinking of, like, you know, the industrial revolution, the development of the middle class, the development of capitalism, you know, all this technological advancements, and, like, the paradigm shifts in terms of, like, government, political. All these things played a factor in creating the environment in which the change occurred. So traditional doctrine of art, as you've mentioned multiple times in your lectures and like, in your channel, basically you're dealing with a functional art. You're dealing with symbolism that is not separated from function. And it is aspects of, or an understanding of beauty that is not separated from function either. So it is an art that is meant to address both physical and spiritual needs. And the art that we're talking about, in a way, did not make a stark distinction between sacred and secular spheres as much as we tend to. Okay, so you could have courtly art that used what we consider to be a sacred theme, or vice versa. And you. Stylistically, there were no distinctions between how you would depict things in the church and how you would depict them in the court or in the folk context in the village. They were more closely linked, you could have levels of refinement of that art. But ultimately it was an art that was geared towards, way that I would put it. Some people might not like the idea because it comes from a 19th century art critic. It's an ideistic art. The idea comes first, so to speak, and then you embody that idea with representational forms. But the representation is not confined to an empirical assessment of nature. It's not based on an empiricist understanding of mimesis or imitation of nature. So Kumaraswamy would at times use a phrase, I think that derives from Aristotle, Art imitates nature in her method of operation or something like that. So in other words, art in this case is mother Nature or actually is God creating. Okay, so, so, so it touches on the idea, the Christian idea that the Lord has specific, like divine wills or a paradigm. And then he actualizes this paradigm in his creation. When he, he names it, he calls it to being. And they are created based on this idea. Yeah."}
{"episode_id":"SW - #221 - 2022-03-01 - Fr. Silouan Justiniano - Icons and Contemporary Art","start":456.63,"end":460.27,"speaker":"Jonathan Pageau","text":"And so the art would be something like there's a purpose for the."}
{"episode_id":"SW - #221 - 2022-03-01 - Fr. Silouan Justiniano - Icons and Contemporary Art","start":460.27,"end":461.39,"speaker":"Fr Silouan Giustiniano","text":"Yes, exactly."}
{"episode_id":"SW - #221 - 2022-03-01 - Fr. Silouan Justiniano - Icons and Contemporary Art","start":461.39,"end":468.01,"speaker":"Jonathan Pageau","text":"That purpose is now embodied in embody. Yes, it's embodied embodiment is, is, is aimed at, we could say."}
{"episode_id":"SW - #221 - 2022-03-01 - Fr. Silouan Justiniano - Icons and Contemporary Art","start":468.01,"end":682.62,"speaker":"Fr Silouan Giustiniano","text":"Exactly, it's embodied meaning. Okay. And so, so that's, that's a very important thing. And that's always plugged into a metaphysic because prior to philosophy as we understand it, philosophical questions, metaphysical questions were dealt with in a traditional society in terms of symbolism. And so the art that was created used a symbolic language in order to convey the cosmology or doctrinal meanings that they held to be valuable for the health of the community or for the overall ordering of the community. And so that has to also be kept in mind. So there was no separation between religion and art. And so, and there was no such thing as art as expressive of individualist ideas. It was expressive of metaphysical doctrines or the meanings that the community held to be of pivotal importance for its well being. And so that's one abbreviated understanding of a more traditional vision of more traditional. Yes. And also bear in mind that this was also. The artist worked within a continuity of traditional forms and an iconology. So all traditional forms are iconological insofar as the meanings are contained in specific compositional formulations that convey these specific meanings. And of course, you could never escape yourself insofar as like you will always handle these forms in what, in a way that is unique to yourself. So that you could trace stylistic differences within a traditional culture. But the stylistic differences Are the accidents, not the essence of the art, as Kumar Swami would put it. You know, so anonymity tended to be the norm where the artist didn't sign the, you know, the art and it wasn't really looked at for the sake of deriving some biographical understanding who the artist was. And so these are all important distinctions and they help to create the contrast between traditional and post 18th century paradigm. After the 18th, you know, during the 18th century, we have to keep in mind we have the development of aesthetics as its own discipline, as a discipline within the realm of philosophy. And of course, this aesthetics is like a. Is pertaining to things of sense, but it was like a philosophical inquiry as to what that could be in terms of a form of cognition. And so it was analyzed philosophically. And of course it also had to deal with the judgment of taste. And so how can we explain our cognition of what we consider to be beautiful and. Or along those forms of inquiry, you have what is considered sublime. Okay, so you have like Edmund Burke's the Inquiry into the ideas of the. Of the Beautiful and the sublime. And then you have the Critique of Judgment by, by Kant. And then you have, I forgot the, the initiator of actually the term aesthetics, the German Baumgarten, I think it was, that started. You could, you could correct me if I'm wrong, but I forgot."}
{"episode_id":"SW - #221 - 2022-03-01 - Fr. Silouan Justiniano - Icons and Contemporary Art","start":682.78,"end":683.46,"speaker":"Jonathan Pageau","text":"I'm not sure."}
{"episode_id":"SW - #221 - 2022-03-01 - Fr. Silouan Justiniano - Icons and Contemporary Art","start":683.46,"end":687.02,"speaker":"Fr Silouan Giustiniano","text":"I don't know that actual last name, but I think he was one of the first ones."}
{"episode_id":"SW - #221 - 2022-03-01 - Fr. Silouan Justiniano - Icons and Contemporary Art","start":687.26,"end":689.18,"speaker":"Jonathan Pageau","text":"It makes sense that it's a German, that's for sure."}
{"episode_id":"SW - #221 - 2022-03-01 - Fr. Silouan Justiniano - Icons and Contemporary Art","start":689.42,"end":721.01,"speaker":"Fr Silouan Giustiniano","text":"Right, right, right. It was like Germans were like d. In the forefront of our history too. So that's right. So then you have, you have that development plus also the development of the museum, which is very important. And one of the things that people forget is that the museum was partly developed as a consequence of the French Revolution. You know, the. There were museums before then, if I'm not mistaken. Austria's, if I'm mistaken. Because they were the development actually from the Cabinet of Curiosities."}
{"episode_id":"SW - #221 - 2022-03-01 - Fr. Silouan Justiniano - Icons and Contemporary Art","start":721.33,"end":726.85,"speaker":"Jonathan Pageau","text":"Right, Exactly. Yeah. The cabinet makes total sense. That's what museums are, cabinets of curiosity."}
{"episode_id":"SW - #221 - 2022-03-01 - Fr. Silouan Justiniano - Icons and Contemporary Art","start":727.01,"end":902.32,"speaker":"Fr Silouan Giustiniano","text":"So, so you would have like all this like whatever a king or prince considered to be worthy of his curious attention, you know, chemical things like, you know, like archeological things like relics, precious objects, jewelry, you know, whatever. I mean, they would have this as a chamber where they could and pass their time study manuscripts. They would have there. And then it was, it was pretty all inclusive. It wasn't as like, you know, as demarcated as we have it. In museums now. And it was a place where you could invite people that you respected to go and talk about these items. But then that developed into a public form later on. And it takes off really in, like, the French Revolution, because they basically face the dilemma, the estheticians and people who value this works independent of their political or religious implication. They were like, well, we don't want it. Because they were destroying all this stuff. Right. It's like it's French Revolution iconoclasm. Right. So they're destroying this as, like, representative of the old regime world. Right, exactly. And so. So then they decided, I forgot who it was, like, called up the attention. All right, we can't be destroying everything, so what are we going to do? So basically, they decided to actually move these items to a museum in a gallery space that became independent or was meant to be independent of any ideological, political implication. And so the excuse was we are putting these here because of their aesthetic value, not because of its religious or political value. So it was an attempt to inoculate the artwork from its religious and political content and to. And to have it be. That's sort of like an example of a social way in which the theory of the autonomous artwork begins to take hold. Right? Yeah. And so then what you have in the fine art context is the idea of the autonomous work of art. You have the idea of the artist as independent from any patrons, like, demands. It takes more and more hold of that, you know, that becomes more and stronger as we go along and move on. From the 18th century on, you have the beauty as a form of taste, as different from beauty as a theophany of the divine. You could perhaps find, in aspects of Romanticism, traces of that. Because I think one of the things that you have to keep in mind, sorry to, like, you know, digress, is that a lot of these things are distortions of Christian doctrine."}
{"episode_id":"SW - #221 - 2022-03-01 - Fr. Silouan Justiniano - Icons and Contemporary Art","start":902.32,"end":902.92,"speaker":"Jonathan Pageau","text":"That's right."}
{"episode_id":"SW - #221 - 2022-03-01 - Fr. Silouan Justiniano - Icons and Contemporary Art","start":902.92,"end":927.53,"speaker":"Fr Silouan Giustiniano","text":"Yeah, exactly. And so. So you do have aspects in which perhaps a Romantic painter considered beauty and the sublime. The sublime, by the way, is the experience of grandeur in nature where you feel your limitation and you experience awe or your utter, like, weakness in the faced by the forces of nature. Yeah."}
{"episode_id":"SW - #221 - 2022-03-01 - Fr. Silouan Justiniano - Icons and Contemporary Art","start":927.77,"end":930.25,"speaker":"Jonathan Pageau","text":"Standing at the top of a cliff feeling that."}
{"episode_id":"SW - #221 - 2022-03-01 - Fr. Silouan Justiniano - Icons and Contemporary Art","start":930.25,"end":1270.88,"speaker":"Fr Silouan Giustiniano","text":"Exactly. So it's different from beauty insofar as beauty is something that is more that you could handle that like. Or is more. Is closer to you. And so Burke would say, like. Like the soft curvature or, like, soft skin and things like that that we all usually associate with the sensuous. And it's not Threatening to us. It's actually comforting for us as compared to the sublime, which is like actually a storm. The cliffs, you know, in the Alps or, you know, or the ominous feeling of like, you know, a forest, you know, where you're like small and you're like surrounded by this like, you know, in determinacy or like you're, you're. You don't know what's going to happen when you enter it, you know. And so it's related to horror or terror and things like that. So it's like the, it's related to the idea of the divine as the all terrifying, you know, the numinous notions of like Otto, what's his name, that guy that wrote the ideas of like the, of the numinous. Anyway, so these are like vestiges of Christian ideas, you could say, that are still playing out in like a post enlightenment context, but they are then channeled in a different direction. And they mainly become channeled through an individualistic form of expression. And that takes off on the Romantic period. But we have to call in mind also that the Romantic period is a rebuttal of rationalism of the Enlightenment. And so what they do is, okay, we cannot go to religion in its usual traditional forms. So we're going to actually. The subjective becomes a realm through which. And the imagination becomes the venue through which we actually very privately encounter the divine. And so we are going to rebuttal. The limitations of rationalism is mechanistic and kind of like, you know, cold approach to reality. Its limiting approach to reality in a way that it emphasizes they thought like emotion as related to the spiritual and mainly being an alternative to the religious communal context as you would have it in traditional religion. And so, so then that became the seedbeds of what would eventually become the ideas that gave ground or the foundation for the 19th century Subjectivist tendencies that lead up to abstraction. And so what am I missing? I think there's. So you do have. Getting back to the whole thing about bridging the conversation between orthodox, the orthodox context and the art world. I think some of the narratives that we've used in the past have been too simplistic in terms of creating too stark of a dichotomy between a Christian worldview and a. What we think of as a secular worldview. What I mean by that is this. Because what could happen is we create this like box, okay? These are the ideas that gave rise to this forms. So then it becomes difficult to see exceptions to the rule or to like actually see how even within the post 18th century context, you still have vestiges of religion, vestiges of the spiritual, you know what I'm saying? So what we need to do, in my opinion, is to find a theological way of teasing this out, to discern these tendencies that you cannot do away with because we're all human beings. And although the main current might be an anti religion occurrent, or it might be a current that like actually contradicts a lot of the aspects of orthodoxy, nevertheless, human beings are human beings and they will even inadvertently aspire towards the divine or aspire towards a humanism that is Christian within that context. And I think you've done some of that in your critique of some social, social, how do you call it? Popular art? You know what I'm saying? Like, and you're doing exactly that with the way you're like revalorizing, what is it? Graphic novel. Yeah. Because for example, I don't know if you're familiar. I'm sure you are. The only thing that I heard about, you know, art treating it philosophically or as a critique from a Christian perspective was Francis Schaeffer, how Shall we then Live? For example. Yeah. As Protestant theologian, you know, very famous for his like, critique of like Western civilization and like. But the problem is that it became too simplistic and the artwork then either was. It fell under like, you know, he would deprecate it as either nihilistic or existential or like, whatever, you know, or anti Christian values. And so. So the artwork was not approached as a thing you experience in a participatory way or an opportunity for communing with embodied meaning, even with it outside of the realm of like a traditional context or Christian ecclesial life. But rather it was considered to be purely a channel for a worldview. And if you didn't like the worldview, then you dismissed the artwork."}
{"episode_id":"SW - #221 - 2022-03-01 - Fr. Silouan Justiniano - Icons and Contemporary Art","start":1271.17,"end":1291.89,"speaker":"Jonathan Pageau","text":"Yeah, that's why the art downstream from Chafer is just propaganda. It's just, it's really very shallow that all those Christian movies that you see, you know, are. Are very weak and they're weak in their structure, they're weak in their narrative, they're weak in their, in their visuals. And they, they're just basically a vehicle for a message. Basically."}
{"episode_id":"SW - #221 - 2022-03-01 - Fr. Silouan Justiniano - Icons and Contemporary Art","start":1292.05,"end":1338.3,"speaker":"Fr Silouan Giustiniano","text":"Yeah. So getting back to what I was saying about the whole issue of the beautiful, like, like you've pointed this out in some of your lectures about how you have now like the complete separation between function and beauty, but in the fine art paradigm. So the fine art paradigm is usually, you know, you have sculpture, painting, poetry, architecture, Dance, for example, music, you know, so these are all different categories or different realms or practices, disciplines within the larger paradigm of the fine art practice. But the thing is that after the 60s, as you know, but, but beginning like in the very big, you know, the 20. The 19th century."}
{"episode_id":"SW - #221 - 2022-03-01 - Fr. Silouan Justiniano - Icons and Contemporary Art","start":1338.3,"end":1341.46,"speaker":"Jonathan Pageau","text":"Already in the. Yeah, already in the, you know, with."}
{"episode_id":"SW - #221 - 2022-03-01 - Fr. Silouan Justiniano - Icons and Contemporary Art","start":1341.46,"end":1354.09,"speaker":"Fr Silouan Giustiniano","text":"The, with, with the shot, for example, which, you know, I hold dear. Although he's infamous, you know, for. Because of a specific reason. And these are explained. He basically critiqued the fine art paradigm."}
{"episode_id":"SW - #221 - 2022-03-01 - Fr. Silouan Justiniano - Icons and Contemporary Art","start":1354.09,"end":1360.41,"speaker":"Jonathan Pageau","text":"So this, for people who don't. This is Marcel Duchamp. You can look him up if you don't know who he is. He's very important where we are today."}
{"episode_id":"SW - #221 - 2022-03-01 - Fr. Silouan Justiniano - Icons and Contemporary Art","start":1360.57,"end":1485.27,"speaker":"Fr Silouan Giustiniano","text":"Right. So he basically then like created like, he was like the initiator of a questioning of the finite paradigm. So contemporary art, as we know since the 60s, okay. With pop art, you know, neo data, conceptualism, all these things, even aspects of like minimalism, you know, all these, like, actually all these movements tend to be anti aesthetic. Yeah. They're not concerned with notions of beauty anymore. Okay. And so, so we have to keep in mind that as well. So, so he is an initiator of that, that tendency. Because he says, okay, art till now has been retinal because he's basically critiquing the 19th century tendency of like, for example, the impressionist and post impressionist. You look at nature and then you have, you have a sensation or you filter it through your temperament. And then what you produce, although independent from nature, is an autonomous object, nevertheless is based on your sensations. Right? And so he says, well, but even that has an aspect of idea because they are actually experiencing a sensation. And then ideistically. I'll get back to that. But this is a connection between modern and traditional art. Yeah. They are ideistically then translating this sensation. So he said, forget about the sensation, he says, you know, because art is its own thing, it is a conceptual framework. And we're forgetting that. And we're so getting trapped, wrapped up in our sensations and beauty and the whole institution of fine art that is not allowing us to actually address what art is or could be the ontology of art, so to speak. And so he begins to explore that. Okay. And then that opens up a whole can of worms, you know, that lead into like, you know, the rabbit holes that we, you know, of course would not be inimical, you know, we would not agree with."}
{"episode_id":"SW - #221 - 2022-03-01 - Fr. Silouan Justiniano - Icons and Contemporary Art","start":1485.27,"end":1512.21,"speaker":"Jonathan Pageau","text":"But yeah, well, I mean, just the situation of art now, you could say, like the situation of postmodern, the art the most fascinating Thing about Duchamp is how he was totally recuperated by the system. And actually, and actually his ideas, it's like now there's a massive Guggenheim Bilbao that is like this multimillion dollar complex to house all the children of Marcel Duchamp and how expensive all these art pieces are."}
{"episode_id":"SW - #221 - 2022-03-01 - Fr. Silouan Justiniano - Icons and Contemporary Art","start":1512.53,"end":1574.8,"speaker":"Fr Silouan Giustiniano","text":"Yeah. And so the thing is that he then also inadvertently opened up the avenue for the expanding of the aesthetic, because now people do similar things and they're looked at for their aesthetic value. Or even most people go to the museum and look at his fountain for aesthetic values. You know what I'm saying? And so it's like, so, so, you know, so things are like all over the place. You know, it becomes more and more like an amoeba of like, you know, phenomena. No, no. And it's like you don't have a. Let's call it an imaginal, like, horizon, so to speak. Like, in a traditional context, the imaginal horizon was very specific based on metaphysical assumptions, and it ordered based on this. Metaphysical assumptions. First of all, by default, it was man's relationship to the transcendent, the divine, the gods or whatever. And then based on that, then how do we shape our lives? Yeah, based on the heavenly pattern, as above, so below."}
{"episode_id":"SW - #221 - 2022-03-01 - Fr. Silouan Justiniano - Icons and Contemporary Art","start":1575.92,"end":1580.08,"speaker":"Jonathan Pageau","text":"But the stories and the art would also be grounded from below through function."}
{"episode_id":"SW - #221 - 2022-03-01 - Fr. Silouan Justiniano - Icons and Contemporary Art","start":1580.08,"end":1580.48,"speaker":"Fr Silouan Giustiniano","text":"Yes."}
{"episode_id":"SW - #221 - 2022-03-01 - Fr. Silouan Justiniano - Icons and Contemporary Art","start":1580.48,"end":1602.72,"speaker":"Jonathan Pageau","text":"That is the fact that you have objects that have to have a function in the world would. Would connect heaven and earth, basically. Whereas with contemporary art, because you've unmoored the ground even, and now you. You also unmoored the top. You just have this amoeba. It's a great way to explain it. Just have this free floating, chaotic. Exactly. That is just a kind of expression of variation itself. You could say."}
{"episode_id":"SW - #221 - 2022-03-01 - Fr. Silouan Justiniano - Icons and Contemporary Art","start":1602.72,"end":1722.75,"speaker":"Fr Silouan Giustiniano","text":"Yeah, so have. Now, it's like a. Another way of putting it. It's like, you know how like you have foam and foam is composed of this little tiny, like bubbles or like, you know, you know, of. They're like little cells composing this. So you can imagine the art world right now as foam composed of all these little like, bubbles which are like, you know, the, the like they're independent, semiotic, like fields of me. Like so. So each artist has to invent his own, his own symbolism or his own semiotic, like, you know, interpretation of reality or how he engages with the social, cultural sphere, or if he's addressing aspect of like, ontology, how he like, interprets our humanity or whatever. And so, so then when you encounter it, you're at a loss because you don't you don't. You're not part of the same imaginal horizon. And so what is hard for most people is that by default, if you're gonna engage with that, you have to become versed in history, you have to become versed in art theory. You have to become versed in the specific work of the artist and how he actually plays into this whole foam of cross fertilized meanings. And that's a very hard thing to do. It's like ultimately is an interpretive, critical act that is very difficult to engage with, but it's sort of like its own. It's like it's its own. For example, I like to compare these. I have to use this contrast, I think, from a Christian perspective, in order to that perspective, there is a tendency, we think, that it's easier for a person to go into an orthodox church and to understand what's going on than to go to a museum and understand what's going on. Okay. There is a sense in which this is true and it's not true."}
{"episode_id":"SW - #221 - 2022-03-01 - Fr. Silouan Justiniano - Icons and Contemporary Art","start":1722.91,"end":1736.51,"speaker":"Jonathan Pageau","text":"Yeah, I think it's true in the sense that, let's say the. It's ramping up is as difficult. That is, you have to. You have to kind of gain a worldview, but once you have it, then everything lays itself. It falls into place coherently."}
{"episode_id":"SW - #221 - 2022-03-01 - Fr. Silouan Justiniano - Icons and Contemporary Art","start":1736.75,"end":1762.88,"speaker":"Fr Silouan Giustiniano","text":"Yes, yeah. But my thing is the initial encounter is. Initial encounter is difficult because if you are not versed in the iconology, you have to learn that language and you will have intuitions that are perhaps more immediate because, you know, they, they are using. We are using forms that are universally relatable human faces. Exactly."}
{"episode_id":"SW - #221 - 2022-03-01 - Fr. Silouan Justiniano - Icons and Contemporary Art","start":1763.2,"end":1766.56,"speaker":"Jonathan Pageau","text":"Like these things are all right, right. Deeply connected to our experience."}
{"episode_id":"SW - #221 - 2022-03-01 - Fr. Silouan Justiniano - Icons and Contemporary Art","start":1766.72,"end":1791.87,"speaker":"Fr Silouan Giustiniano","text":"Yes, yes. And so in that sense it is more accessible. But there is a similarity, although not one to one similarity of like the challenge of actually immersing yourself in the theology, in the cosmology, in the symbolic structures and patterns, for you to be able to interpret what it is that you're seeing in a more in depth way. Yeah, and so, so that's."}
{"episode_id":"SW - #221 - 2022-03-01 - Fr. Silouan Justiniano - Icons and Contemporary Art","start":1792.51,"end":1812.52,"speaker":"Jonathan Pageau","text":"And there's a difference too. Like there's a difference because. Because there is this hierarchy in the language and there's a communal aspect to it and there's a notion of kind of bringing you up towards higher worlds. Let's say the effort you put into learning the language will lead you up towards virtue, will lead you up towards home."}
{"episode_id":"SW - #221 - 2022-03-01 - Fr. Silouan Justiniano - Icons and Contemporary Art","start":1812.52,"end":1813.52,"speaker":"Fr Silouan Giustiniano","text":"Exactly. And that's my."}
{"episode_id":"SW - #221 - 2022-03-01 - Fr. Silouan Justiniano - Icons and Contemporary Art","start":1813.52,"end":1842.02,"speaker":"Jonathan Pageau","text":"Whereas in the contemporary art world you just nihilistically move from bubble to bubble and it's like this infinite and you have to kind of get used to idiosyncrasy as an experience. It's like, sometimes you think that people that go into museums get some kind of coherent experience, but they don't. They just actually are used to idiosyncratic, let's say, collage. And they actually see that as a reflection of the real, which is a deeply nihilistic."}
{"episode_id":"SW - #221 - 2022-03-01 - Fr. Silouan Justiniano - Icons and Contemporary Art","start":1842.18,"end":1853.06,"speaker":"Fr Silouan Giustiniano","text":"Deeply nihilistic act in itself that actually relates to what I was doing, which parallels away what you were doing when you were in art school."}
{"episode_id":"SW - #221 - 2022-03-01 - Fr. Silouan Justiniano - Icons and Contemporary Art","start":1853.46,"end":1876.65,"speaker":"Jonathan Pageau","text":"So maybe that's a good time to back up a little bit, because we kind of jumped right into the conversation, which is great. But maybe you can tell people a little bit about your own story. That is how you kind of moved into the contemporary art world and then moving out of the contemporary art world into iconography and ultimately trying to find ways to maybe bridge the language as much as is reasonable."}
{"episode_id":"SW - #221 - 2022-03-01 - Fr. Silouan Justiniano - Icons and Contemporary Art","start":1877.05,"end":1965.12,"speaker":"Fr Silouan Giustiniano","text":"Yeah, yeah. How should I frame this? I grew up as a Protestant. My parents were Pentecostal. And so throughout my youth, I pretty much struggled with that because I didn't really, you know, I didn't really want to be part of it. But eventually, through the grace of God, I had to confront what I really believed. And that was during my undergrad, during. I went for one year at the Maryland Institute College of Art in Baltimore. And there. That was a reality check, because then it really became, like, confrontation between worldviews. Yeah. Me talking to people and, like, you know, like, for example, I took for granted the existence of the soul. And I would go to a party and talk to people that, like, were totally denying the existence of the soul. I'm like, you must be crazy. And then I stepped back and I said, all right, I'm trying to argue for something that I'm, like, rejecting in my parents. Yeah. What does that mean about, you know, what do I really believe? You know what I'm saying? And so that precipitated a whole process of, like, you know, at that time, I, like, I encountered for the first time, like, that little treatise by Vasily Kandinsky. Considering the spiritual in art. That was like, a big eye opener, because I didn't really know that there was a slice of the modern art world that dealt with spiritual matters. Right. You know, they question what that means, but, you know, but it leads an."}
{"episode_id":"SW - #221 - 2022-03-01 - Fr. Silouan Justiniano - Icons and Contemporary Art","start":1965.12,"end":1977.32,"speaker":"Jonathan Pageau","text":"Effort to, like, like. And Kandinsky. Yes, a lot of these. These artists were actually. Were actually spiritualists, were involved in theosophy and all these kind of fringe spiritual things. But it. But it wasn't Just pure materialism."}
{"episode_id":"SW - #221 - 2022-03-01 - Fr. Silouan Justiniano - Icons and Contemporary Art","start":1977.32,"end":2082.61,"speaker":"Fr Silouan Giustiniano","text":"That's exactly, exactly. So. So then, you know, moving forward, I decided to commit my. My life towards following Christ and his gospel. And. But that was before I came to Orthodoxy. My dad bumped into an Antiochian priest in his high school with the high school where he was working. And then that precipitated a conversation. My dad told me about it. I went to visit the Antiochian Church. And that was my first instance of, like, actually looking at a liturgy and, like, the incense and the icons, and I couldn't really. I was. All I know is that I was like. I was digging it, but I don't know, I couldn't really put my finger on it intellectually. It took years for me to, like, actually piece it together. But I was like. I would go to the. To the Bible studies Wednesday nights in the Protestant church where we attended, and I was like, I want to go to liturgy this Sunday, man. I mean, I want something more like, you know, experiential, you know. Anyways, so eventually when I went to grad school, then I became Orthodox, I was received into the church. And so during undergrad, I was doing, you know, abstract expressionist kind of work. And then towards the end of my undergrad, I. I shifted focus and I started to do more like geometric based work from collage compositions that I would put together. So. So which relates to what you were saying about the fragmentation thing. Right. So I would take clips from magazines and, you know, and evocative, kind of like suggestive kind of like imagery, and then combine it in a. In a grid, like structure. And then I would execute it in oils. Then."}
{"episode_id":"SW - #221 - 2022-03-01 - Fr. Silouan Justiniano - Icons and Contemporary Art","start":2082.61,"end":2084.81,"speaker":"Jonathan Pageau","text":"That is in the mid-80s. Right."}
{"episode_id":"SW - #221 - 2022-03-01 - Fr. Silouan Justiniano - Icons and Contemporary Art","start":2085.29,"end":2087.93,"speaker":"Fr Silouan Giustiniano","text":"This was in the no, man, no."}
{"episode_id":"SW - #221 - 2022-03-01 - Fr. Silouan Justiniano - Icons and Contemporary Art","start":2087.93,"end":2089.21,"speaker":"Jonathan Pageau","text":"90S. Sorry, mid-90s."}
{"episode_id":"SW - #221 - 2022-03-01 - Fr. Silouan Justiniano - Icons and Contemporary Art","start":2089.61,"end":2092.73,"speaker":"Fr Silouan Giustiniano","text":"Yeah. This was in 1994."}
{"episode_id":"SW - #221 - 2022-03-01 - Fr. Silouan Justiniano - Icons and Contemporary Art","start":2093.29,"end":2093.73,"speaker":"Jonathan Pageau","text":"Okay."}
{"episode_id":"SW - #221 - 2022-03-01 - Fr. Silouan Justiniano - Icons and Contemporary Art","start":2093.73,"end":2193.09,"speaker":"Fr Silouan Giustiniano","text":"Nine. 96. I went grad school. Combination of Death of the Author, a critique of Greenbergian modernism, and the ideas of the Simulacra. Baudelaire. Yeah. And the pivotal influence for everyone at the time was Gerhard Richter. Yeah, I was looking at, like. So I was. I was basically doing what you could call conceptual abstraction. And it was related to pop, too, because given that he was a critic of the author, it was predicated on appropriation. So I was taking images from popular culture, fragments of photography. I would even photograph a TV screen of garbled channels. And then I would put these images together to resemble computer screens. But it had a dimension of illusionism because it was photorealistically executed. And it had a connection to geometric abstraction. So it was both geometric, organic, illusionistic. It was sort of like impure painting, impure abstraction, which was the critique of Greenberg, because Greenberg had this idea that for painting to become his true self or to modernism was sort of like a gradual progression towards the culmination of the true identity of painting. And part of it involved, like, the rejection of illusionism, the inherent properties of painting as flatness, and so."}
{"episode_id":"SW - #221 - 2022-03-01 - Fr. Silouan Justiniano - Icons and Contemporary Art","start":2193.73,"end":2201.25,"speaker":"Jonathan Pageau","text":"Which ended in absolute nonsense. It ended in, like, rolls of canvas with, like, splashes of color on it."}
{"episode_id":"SW - #221 - 2022-03-01 - Fr. Silouan Justiniano - Icons and Contemporary Art","start":2201.25,"end":2559.21,"speaker":"Fr Silouan Giustiniano","text":"Exactly. Right, right. So I was. I actually. I was into color, and so I was playing with all these ideas. But the thing is that. And by the way, digression, which I think I have to mention, my professors at Hunter College, where I was going for graduate school, we're a very interesting school. They were colorists. If you look it up, you know, they're like. They're considered the Hunter Color school. Right. So it influenced my work, but I was also rebelling against it. Yeah. Because there was. I used this very thin stripe, kind of, like, surface for my images where it created an optical effect. The images hovered, so to speak. And so because I would put contrasting colors, hues like green, red, orange and blue. And so given that they were put together in very close proximity in stripe, like forms, structure, it would create a hovering effect and a vibration. But this was partly related to what Sanford Warrenfeld was doing. He was the chair of the art department at Hunter, and he had a course called the Color Seminar that I took that was very important, and I derive a lot of good influence from that. But I. I thought that their approach was too scientistic. And it was still part of, like, the continuation of what was happening in the late 19th century with Seurat and like, the color theory that was happening at the time, that you could. You could say that they are a current form of that or they continue closely related to that history. And my. My advisor. My thesis advisor was Robert. Robert Swain. And he also did work based on color. Very much about finding a system, a color system based on the color wheel. And so he has, you know, developed a color system that he very systematically arranges. He's got like 400 and maybe like. I don't know if it's 400, 4000. I mean, thousands of colors that he has arranged and he has a. Systematically numbered. In his studio, and he moves these around in, like, to create compositions. And like. So to me, it was like, you guys are too crazy. Too scientistic anyways. But that was partners. Yeah. So there was the environment. And so. But at the same time, I Was, like, really appreciative, as to me, they call that painting based on Warrenfeld's, like, theory. They called it presentational painting. Instead of representation, it was presentation. Right. Presentation of a color phenomenon. Yeah. And to me, that was very evocative, very. And. And has a lot of potential because in my view, it's presenting a phenomenon that is offered to us by God. But the. The. These painters are, like, actually focusing on it and bringing it to you so you could experience it. And to me, that dimension, getting back to what we were saying about how we could interpret something as having a theological implication, although people who did it might not even have that in mind. To me, if you look at that work along those lines, you could actually interpret it in a very fruitful way in any case. So I was surrounded by all this stuff, and I was doing sort of like a. Partly a critique of that and partly going along with the spirit of the times in terms of postmodern painting, conceptual painting. And my thesis was a look into the mechanics of visual pleasure. So given that I was by default always interested in the spiritual dimensions or dynamic in modern art, I was continuing to do that. So my view was part of the fine art paradigm is you're redeeming things by decontextualizing them. You bring them into the realm of art, and by default, is a higher context in this cultural sphere. Okay, so you experience it as somehow, insofar as it is no longer part of the real world, it is higher. Right. So. So. So in my mind at the time, I was, like, taking all these advertisements, decontextualizing them, putting them in a context of geometric abstraction, which was, by default, in its history, related to aspirations towards the transcendent, and creating what I called a pseudo spirituality within the realm of contemporary painting. And I was using fragments of visual, fragments of culture that, in my view, were materialistic spiritualism, if that makes any sense. Because when you look at advertisement, they use, for example, they use color, light, notions of purity, and they try to exalt the object they're selling towards almost making it into a saint, almost, or make it putting it in the realm of the transcendent. So I was basically using that kind of reference material, bringing it into painting and questioning aspects of the transcendent value of painting and how ultimately, if it is a commodity object, it is playing into the whole pseudo materialistic spirituality of the market. That was, in my mind, part of what was going on. But that was at the same time of me becoming orthodox, finding out about monasticism. And so There was a transition that was taking place and I was getting closer to the probability of entering into the monastic life. And I was like, playing with the idea and I didn't know. Meanwhile, I finished up graduate school. I was."}
{"episode_id":"SW - #221 - 2022-03-01 - Fr. Silouan Justiniano - Icons and Contemporary Art","start":2559.53,"end":2584.07,"speaker":"Jonathan Pageau","text":"I'm just one question. Like, at any point, did you experience a kind of schizophrenia in the. Let's say in the contemporary art world and this movement towards orthodoxy? I say that because I was experiencing that during my degree in art, which is at some point I was doing these things here, and I was doing these things here, and I was. And it was just ripping me apart. Like, I don't know if you had that experience yourself."}
{"episode_id":"SW - #221 - 2022-03-01 - Fr. Silouan Justiniano - Icons and Contemporary Art","start":2584.07,"end":2650.35,"speaker":"Fr Silouan Giustiniano","text":"Yes, yes, that was definitely part of it. I mean, because it was, you know, not to be, you know, not to down or the Protestant. Protestant brethren out there. But. But I was like, at a time, I was like, thinking to myself, you know, the art world is like Protestantism. It's like you have different. Different denominations of, like, of doctrines. And me participating in this, it's like I'm like, in another. I'm trying to, like, come up with, like, ideas that. Like, for what purpose? I was asking myself. I mean, I have the orthodox faith, and so that already is all encompassing. It's like everything is. Is. Is put in order. There is a structure of meaning that, like, I don't need to be re. Reinventing the wheel, but meanwhile I'm doing this artwork that it predicates always reinventing the wheel, because you have to always come up with an idea that moves the ball ahead somehow."}
{"episode_id":"SW - #221 - 2022-03-01 - Fr. Silouan Justiniano - Icons and Contemporary Art","start":2651.39,"end":2652.27,"speaker":"Jonathan Pageau","text":"Whatever that means."}
{"episode_id":"SW - #221 - 2022-03-01 - Fr. Silouan Justiniano - Icons and Contemporary Art","start":2652.51,"end":2717.08,"speaker":"Fr Silouan Giustiniano","text":"Whatever that means. Right. So. So then it's like. And then I was in a dilemma. It's like, do I want to just create beautiful objects for people to be gratified and. But what does that really mean? And even if I come up with good ideas, are they even that good or helpful in the ultimate goal of our existence here in this world? And so then when I. When I looked at things in terms of, like, priorities, I was like, well, in terms of priority, I have to say that a liturgical art is by default higher than the paradigm that I'm experiencing. I was thinking in graduate school, because it. It leads man towards his intended ultimate goal, the ultimate good. And it's more all embracing because this is functional, is symbolic, it's got aspects of beauty, but is not solely predicated on beauty and is leading man towards God. So what else should I. I mean, why. Why would I do anything else? Right."}
{"episode_id":"SW - #221 - 2022-03-01 - Fr. Silouan Justiniano - Icons and Contemporary Art","start":2717.16,"end":2723.56,"speaker":"Jonathan Pageau","text":"What you're saying is so interesting because that. And I think this is Going to lead us towards the way in which we can bring some of this back in."}
{"episode_id":"SW - #221 - 2022-03-01 - Fr. Silouan Justiniano - Icons and Contemporary Art","start":2723.91,"end":2724.15,"speaker":"Fr Silouan Giustiniano","text":"Yeah."}
{"episode_id":"SW - #221 - 2022-03-01 - Fr. Silouan Justiniano - Icons and Contemporary Art","start":2724.15,"end":2775.6,"speaker":"Jonathan Pageau","text":"What it feels like is that there's an aspect of a lot of the contemporary art world and a lot of modernism which is almost like a hyper focusing, as you said, let's say, a hyper focusing on color, like a hyper focusing on the sublime. A hyper focusing on these different aspects of experience. And whereas the liturgical experience has it all there. Right. And so it's like, if you think there's no sublime in communion, you're not paying attention, my friend. Like it's there. And. And if you think that, you know, if you think there isn't beauty, all of these things are there. And so. But there's a possibility, interesting possibility, to look at these hyper specializations in almost as like these in their heresies, but see how they can they teach us something about that aspect also. Right. It's like the work on color that was done in the modern. The modern era is something that the ancients didn't have access to, which is, yes, amazing work."}
{"episode_id":"SW - #221 - 2022-03-01 - Fr. Silouan Justiniano - Icons and Contemporary Art","start":2776.06,"end":2970.23,"speaker":"Fr Silouan Giustiniano","text":"This is important, what you're saying is very important, that we have to, I think, as orthodox Christians, learn how to engage with the contemporary art world in an honest way, but in a more nuanced way, I think, taking into consideration exactly what you're talking about. For example, I was looking at Donald. I was looking at a doc, not a documentary, an interview of the daughter of Donald Judd, who was interviewed for the occasion of some big exhibition of his work. He's one of the greatest minimalists, right. Or he probably wouldn't have liked that term. But in any case, and as they're talking to her, they have this footage of like some of his sculptures. And it dawned on me the guy was total empiricist. He was like totally non religious atheist. And I was looking at his work and I was beginning to notice myself tracing his ordering structure and experiencing myself in a way contemplating the ordering system that he brought into this and how sometimes you almost grasp it, but then it slips out of your grasp. And I'm like, this has. You could analyze that in a way that actually you could do an interpretation that is exactly what you're saying. Looking at this hyper approach to cognition or our mind's capacity to order reality in a way where it brings out of the viewer a contemplative experience of an object that in a way serves as a parallel to prayer. It is a gathering experience because you become aware of like, you know, how, like you have seen Dionysus, the Arabic God, he's got the linear prayer and then the circular prayer and then the spiral prayer. Right. So I think some works can be seen in partly, even if inadvertently, even by people who don't even believe in God. They create a situation in which you become aware of your capacity to have a higher level of cognition. Yeah. And to me, that is like the same thing with the color painters that I mentioned that I'm indebted to from Hunter Kylo. And so I think that's an important thing to keep in mind, because if we just always approach it as this work is illustrative of this false idea or illustrative of this decadent period in history, or illustrative of a worldview that is destructive to man. It's like the reality is, as orthodox Christians, we have been given the capacity to see Christ in everything, and we have to not forget that the Logos is always playing in fields and places that we don't expect he's playing. And so let's just look for him and have more of an openness to not ignore when things are clearly spiritually destructive, but also realize that things are not always so. So starkly, you know, black and white, you know."}
{"episode_id":"SW - #221 - 2022-03-01 - Fr. Silouan Justiniano - Icons and Contemporary Art","start":2970.23,"end":3069.06,"speaker":"Jonathan Pageau","text":"Yeah. And the way the Christians, what they did to Roman art, they did exactly what we're talking about, which is that there's a. There's a say in Roman and in Hellenistic and Roman art, there's a kind of. There's a kind of glorious human that is. That is put on in front of us and that that tendency seems. Tends to become excessive in the sensuality, in the kind of sexual aspect of it and, and, or even in the extreme of the warrior. Like there's these extremes that appear in Roman art in the desire to kind of. To lift up man. And so the orthodox Christian said, okay, we can take that. You know, this is our, this is our. This is the stuff we've got to work with. That's fine. Let's work with that. And then keeping all the positive aspects of Roman art, but then taming them, you know, reorienting them, having some contrapposto, but not the excessive one we see, you know, both in Roman and in the Renaissance, post Renaissance time, having, you know, emphasizing this kind of beautiful, beautiful face or these kind of simple, beautiful faces, all of this is something that we ended up bringing back in, you know, and so you can trace Roman art right up to the, up to the post Iconoclasm work. Like if you look at those carvings, I love those ivory carvings that come after Iconoclasm. I mean, all the tropes of Roman art are there, but they've all been reoriented. The clothing has all the same form, but all the sensuousness is kind of tamed in. And so why couldn't we do that again, like you said, with some of these powerful modern contemporary artists that have been. That have been investigating some aspects of human experience?"}
{"episode_id":"SW - #221 - 2022-03-01 - Fr. Silouan Justiniano - Icons and Contemporary Art","start":3070.26,"end":3091.14,"speaker":"Fr Silouan Giustiniano","text":"That's a very interesting problem, and it is one that I think is unavoidable and important. One of the things we have to remember is I think we have to take this back, Jonathan, to the revival. And I think we are heirs of the revival of icon painting and the sacred arts in the Orthodox Church."}
{"episode_id":"SW - #221 - 2022-03-01 - Fr. Silouan Justiniano - Icons and Contemporary Art","start":3091.36,"end":3128.77,"speaker":"Jonathan Pageau","text":"Okay, that's really important to understand that the iconography almost died. Like, it didn't die, but it came very close. People tend to think that orthodox iconography is just this thing that blazed on for since the beginning of the church, but that's not true, right? Starting in the 18th century, 19th century, and then by the early 20th century, it's a trickle, like it's almost gone. And so we have to understand that we are the children of a revival in the post war period of iconography, and we are the heirs of that, for all good and ill that it had within its seed, you could say, right?"}
{"episode_id":"SW - #221 - 2022-03-01 - Fr. Silouan Justiniano - Icons and Contemporary Art","start":3128.77,"end":3198.51,"speaker":"Fr Silouan Giustiniano","text":"And that's the important thing, because I think it hasn't been until recently that the problematic dimensions of the revival have been considered. I know when I first became Orthodox, it was by default the work of Ouspensky and Kantoglou, for example. It was considered by default to be the authoritative traditional perspective on iconography. And they have served a very important cathetical role in bringing people to a cognizance of the importance of traditional iconography. But at the same time, it has suffered from oversimplification, the way people have taken their thought. And also they themselves, I don't think addressed or were as honest. No, that's not right to say they were not as upfront about how important their modern context was to them, being able to even frame the questions that we framed."}
{"episode_id":"SW - #221 - 2022-03-01 - Fr. Silouan Justiniano - Icons and Contemporary Art","start":3198.51,"end":3240.39,"speaker":"Jonathan Pageau","text":"But do you think maybe they were actually just unaware? Because often not we are unaware of the frame in which we say things. We exist. And that frame becomes apparent, you know, as time goes on, then we can look back and say, oh, okay, this is what was going on. And so I think that we don't have to blame them in any way, but also understand that they were doing a monumental, insane work that we need to be eternally grateful to them for. But that in that desire to lift a mountain, they were bound to frame things a little off, to make some mistakes, to overemphasize certain things. This is what's bound to happen."}
{"episode_id":"SW - #221 - 2022-03-01 - Fr. Silouan Justiniano - Icons and Contemporary Art","start":3240.63,"end":3268.97,"speaker":"Fr Silouan Giustiniano","text":"But you know what, to give credit to Ouspensky, remember that article I wrote about his. I mentioned where he, in one of his lessons, mentions Matisse. So he was aware of how the icon played into modernism, and he referred to Matisse in a positive way when he was teaching his students. So, you know. Yeah."}
{"episode_id":"SW - #221 - 2022-03-01 - Fr. Silouan Justiniano - Icons and Contemporary Art","start":3268.97,"end":3277.05,"speaker":"Jonathan Pageau","text":"You also mentioned how close he was to Maurice Denis and that whole kind of neo Catholic art, modern neocatholic art that was happening in the early 20s."}
{"episode_id":"SW - #221 - 2022-03-01 - Fr. Silouan Justiniano - Icons and Contemporary Art","start":3277.05,"end":3283.49,"speaker":"Fr Silouan Giustiniano","text":"That was the context. That was totally the context. And, you know, what was that article? The Autonomy of the Icon?"}
{"episode_id":"SW - #221 - 2022-03-01 - Fr. Silouan Justiniano - Icons and Contemporary Art","start":3283.81,"end":3284.69,"speaker":"Jonathan Pageau","text":"Yeah, I think so."}
{"episode_id":"SW - #221 - 2022-03-01 - Fr. Silouan Justiniano - Icons and Contemporary Art","start":3284.93,"end":3367,"speaker":"Fr Silouan Giustiniano","text":"Where I basically tried to show the parallels between the symbolism of the 19th century that was articulated by Maurice Denis and how it. Pretty much. I mean, it's. When you look at. When you hear him speak and then you hear Ospensky speak or Cantoglou speak, you're like, oh, right. So they're coming from the same attitude towards the capacity of painting to embody something more than meets the eye that is related to an inner experience of nature. But in the case of Ouspensky and Kantik Lewis, given that they're orthodox, they place that level of cognition above mere feelings. They place it in the realm of the noetic apprehension of things. Anyway. But I say that to say that we have to look further into the interesting convergence that existed as, you know, as the revival was happening between the revivalists and modernism. And so if we look at that honestly, then we realize that we cannot escape our own moment. And just like the iconographers of the Byzantine period felt like they were in continuity with the Hellenic past. Yeah."}
{"episode_id":"SW - #221 - 2022-03-01 - Fr. Silouan Justiniano - Icons and Contemporary Art","start":3367,"end":3369.88,"speaker":"Jonathan Pageau","text":"With the Roman. They felt completely like they were continuing Roman art."}
{"episode_id":"SW - #221 - 2022-03-01 - Fr. Silouan Justiniano - Icons and Contemporary Art","start":3369.88,"end":3423.54,"speaker":"Fr Silouan Giustiniano","text":"Right. And so they did not see. See themselves as, in any way or form breaking away from it. They saw them as. They saw themselves as take, like you described, taking aspects, revalorizing them for the purpose of ecclesial function. And so similarly, what we need to do is take whatever it is within our context, revalorize it, and re. Employ it for the function that we have liturgically as iconographers. Right. So. But the thing is this. And this is where I think it's important to make a distinction between iconology and stylistic form, because the iconology is a more complicated matter, because in a way, you're dealing with formulations, visual structures that convey specific semiotic meanings. If you want to call it that way. Yeah. I'm not be. You know, I might not be using that."}
{"episode_id":"SW - #221 - 2022-03-01 - Fr. Silouan Justiniano - Icons and Contemporary Art","start":3423.54,"end":3424.54,"speaker":"Jonathan Pageau","text":"Being technical about it."}
{"episode_id":"SW - #221 - 2022-03-01 - Fr. Silouan Justiniano - Icons and Contemporary Art","start":3424.54,"end":3435.91,"speaker":"Fr Silouan Giustiniano","text":"Yeah, yeah. But. But what I'm talking about is the formal aspects of the icon that are in the realm of experiential connection with the art object. Yeah."}
{"episode_id":"SW - #221 - 2022-03-01 - Fr. Silouan Justiniano - Icons and Contemporary Art","start":3435.91,"end":3438.47,"speaker":"Jonathan Pageau","text":"So color, line, form."}
{"episode_id":"SW - #221 - 2022-03-01 - Fr. Silouan Justiniano - Icons and Contemporary Art","start":3440.39,"end":3449.83,"speaker":"Fr Silouan Giustiniano","text":"So all these things either will complement, augment the iconology, or it will actually work against it. Yeah."}
{"episode_id":"SW - #221 - 2022-03-01 - Fr. Silouan Justiniano - Icons and Contemporary Art","start":3449.83,"end":3450.71,"speaker":"Jonathan Pageau","text":"Distract us from."}
{"episode_id":"SW - #221 - 2022-03-01 - Fr. Silouan Justiniano - Icons and Contemporary Art","start":3450.71,"end":3478.18,"speaker":"Fr Silouan Giustiniano","text":"Distract all attention to itself. Right. So. So the key is to. There is, in that sense, a lot of freedom within the formal dimension. Because by default, when I'm, like, going to paint something, I have to start making decisions. I have to. It is a false understanding that traditional iconography is predicated solely on mechanistic, slavish copying of older prototypes. Yeah. Okay. We use."}
{"episode_id":"SW - #221 - 2022-03-01 - Fr. Silouan Justiniano - Icons and Contemporary Art","start":3478.18,"end":3483.07,"speaker":"Jonathan Pageau","text":"Well, there are some people that do it that way, but it's a dead end. Exactly. It's definitely a dead end."}
{"episode_id":"SW - #221 - 2022-03-01 - Fr. Silouan Justiniano - Icons and Contemporary Art","start":3483.3,"end":3532.24,"speaker":"Fr Silouan Giustiniano","text":"Yeah. So there is a value in it in the training process. But eventually what we want to do is that actually create works that come from a living experience of the prototypes that we are handling. The final work has to be a witness to our living encounter with what it is that we're depicting. And if it is not, then we are not actually witnessing to the continuing life of the Holy Spirit in the church. Yeah. And what we're doing is that we're creating environments that counter our call to spread the gospel. Because people are gonna look into their churches and they're gonna be like, all right, so these people are like, they're stuck in the Middle Ages, and they just want to just basically perpetuate this, like, romantic, like, you know, idea of nostalgia. Right."}
{"episode_id":"SW - #221 - 2022-03-01 - Fr. Silouan Justiniano - Icons and Contemporary Art","start":3532.8,"end":3535.68,"speaker":"Jonathan Pageau","text":"That's not like we want. I always say tradition without nostalgia."}
{"episode_id":"SW - #221 - 2022-03-01 - Fr. Silouan Justiniano - Icons and Contemporary Art","start":3535.68,"end":3536.56,"speaker":"Fr Silouan Giustiniano","text":"That's my. Exactly."}
{"episode_id":"SW - #221 - 2022-03-01 - Fr. Silouan Justiniano - Icons and Contemporary Art","start":3536.56,"end":3537.44,"speaker":"Jonathan Pageau","text":"That's my motto."}
{"episode_id":"SW - #221 - 2022-03-01 - Fr. Silouan Justiniano - Icons and Contemporary Art","start":3537.69,"end":3544.41,"speaker":"Fr Silouan Giustiniano","text":"No, because tradition is that one thing also goes into the fact that something is old doesn't mean that it is traditional."}
{"episode_id":"SW - #221 - 2022-03-01 - Fr. Silouan Justiniano - Icons and Contemporary Art","start":3544.41,"end":3650.2,"speaker":"Jonathan Pageau","text":"No, exactly. But also I want to bring something up just like. Because I think we're right there. Is that what I've said until now is something that I believe in all the things that I've said. But I think there's also a caveat, which is that I also notice another tendency in the kind of the world of iconography, which is a desire for the experience of novelty itself. The desire to be titillated, you could say, by novelty. And I think that there are some iconographers that want to use this freedom that we talk about to. Let's say what we were saying until now makes total sense if we are focused on the basic idea we mentioned at the outset. So it's like, I can integrate this or that aspect of Matisse if my purpose is to create objects with a specific teleology that are there to exist within the communion of the Church, that are there to not call attention to themselves in a disproportionate way, all this stuff. But the flip side is also true, where there's also some iconography that I'm seeing around that seems to want to almost idolize the novelty that as if the idea of wanting to be in line with the traditional forms is somehow useless. It's boring, it's not interesting. And even that language of saying, like, we want to make it interesting, we want to make art that is contemporary in a very kind of vague way. And so I think it's inevitable we're going to make art that's contemporary. But it seems like we always have to subject that to the ultimate purpose and the participation in the life of the church and the liturgy and all of that. So I don't know if you have any thoughts on that as well."}
{"episode_id":"SW - #221 - 2022-03-01 - Fr. Silouan Justiniano - Icons and Contemporary Art","start":3650.28,"end":3746.82,"speaker":"Fr Silouan Giustiniano","text":"I think that is always the thing to keep in mind. It is a crucial point to not, like, ignore, because I agree. I mean, there are. And I encountered this myself because the temptation is that I don't want to do this because it's boring, because it's been done so many times that like, you know, after a while it's like, how many times are you going to do it? You know? But the reality is it serves a function and you have to do it. But. But then at the same time, it calls you to be more creative if you're. If you're sick and tired of like, you know, looking. But be creative in a way that is a service to the community, not a self indulgent. Yeah, I want to have some fun. So. So you have to, like you're saying, keep in mind the telos, the function, the purpose of what it is that you're doing is ultimately, as I like to say, for aiding people's process, their struggle towards deification. And if that is kept in mind and you're using your discernment and you are actually harmonizing with all the various voices of the tradition, then you will produce something that is authentic and something that is within the spirit of the church that will have a creative dimension to it, but it's not going to be like excessive in its affirmation of either yourself or the art objects for its own sake. And so that's so. But My. My. My contention, my. My fear is on the other side of the same coin that you're."}
{"episode_id":"SW - #221 - 2022-03-01 - Fr. Silouan Justiniano - Icons and Contemporary Art","start":3746.82,"end":3747.58,"speaker":"Jonathan Pageau","text":"Yeah, yeah, yeah."}
{"episode_id":"SW - #221 - 2022-03-01 - Fr. Silouan Justiniano - Icons and Contemporary Art","start":3747.9,"end":3792.56,"speaker":"Fr Silouan Giustiniano","text":"Which is. Which is. Let's not. I think Aiden Hart has also pointed this out. Let's not be scared. And in being scared, like, bury our talent in this very crucial process of creative discernment, in the creative process. On top of what we've been saying about the viability of using things that have come out of modern painting, I think it's also important to not ignore the parallels that exist between the iconographic tradition and other forms of traditional art. For example, Persian manuscript illumination."}
{"episode_id":"SW - #221 - 2022-03-01 - Fr. Silouan Justiniano - Icons and Contemporary Art","start":3792.64,"end":3793.12,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #221 - 2022-03-01 - Fr. Silouan Justiniano - Icons and Contemporary Art","start":3794.16,"end":3833.09,"speaker":"Fr Silouan Giustiniano","text":"The work of the Indian miniaturist, like the Rajput painting and, you know, Bahari painting and things like that, and the Tibetan taka tradition, for example, the. The Chinese and Japanese painting traditions. And when you really start looking at this, you realize, okay, man, this is my hubris speaking. Right? I look at some of our icons, and then I'm like, come on, we have to. We have to step up. We have. We got to do something better, man. And so I'm like, you know, but."}
{"episode_id":"SW - #221 - 2022-03-01 - Fr. Silouan Justiniano - Icons and Contemporary Art","start":3833.09,"end":3879.25,"speaker":"Jonathan Pageau","text":"I think, like, I think that anybody. When we look at your icons, I think this is like, my greatest compliment, maybe not my greatest one of my compliments of your work, which is that when you look at an icon, one of your icons, for most people, they get just this sense of wonder and beauty. And then for someone who knows is like, I know where he's pulling these threads in from, but they don't. They're like a tapestry. They don't. They don't. They don't call attention to themselves as threads. Like, they don't jar. Like, you see, I've seen some kind of. Very kind of subversive type of icon painting, you know, where you. It's like, well, not subversive, but like. But it just looks like a Japanese print. Like, it's just a Japanese print with a halo."}
{"episode_id":"SW - #221 - 2022-03-01 - Fr. Silouan Justiniano - Icons and Contemporary Art","start":3879.25,"end":3879.53,"speaker":"Fr Silouan Giustiniano","text":"Okay."}
{"episode_id":"SW - #221 - 2022-03-01 - Fr. Silouan Justiniano - Icons and Contemporary Art","start":3879.53,"end":3923.64,"speaker":"Jonathan Pageau","text":"I mean, yeah, it's kind of interesting. I mean, somewhat interesting, but I definitely wouldn't put that on iconostasis. But there's a way to. To pull in some of the patterns in Japanese print. Some of the composition, some of the line work, for example, that is subtle enough to not call attention to itself as a. As a weird string that's poking out of the tapestry, but integrates itself in a way that creates that sense of wonder. I've watched people like Father Shiloh, like, I've never told you this, but I've watched people stand in front of your icons, and I watch Them and they just. They go into a trance. They're just like standing there and they just look at it, and you're trying to figure out what's going on in their mind, like, what's happening. But I don't think they even know. Like, most people don't even know what's going on."}
{"episode_id":"SW - #221 - 2022-03-01 - Fr. Silouan Justiniano - Icons and Contemporary Art","start":3923.64,"end":3949.9,"speaker":"Fr Silouan Giustiniano","text":"But I think that. I think touches on what we were saying before about the importance of form having an effect that is experiential, that people will not necessarily. You cannot codify it or quantify it in a semiotic way. Yeah. You experience aids the function of it. Can aid if you can."}
{"episode_id":"SW - #221 - 2022-03-01 - Fr. Silouan Justiniano - Icons and Contemporary Art","start":3949.9,"end":3950.94,"speaker":"Jonathan Pageau","text":"Yeah, there you go. That's great."}
{"episode_id":"SW - #221 - 2022-03-01 - Fr. Silouan Justiniano - Icons and Contemporary Art","start":3951.02,"end":4042.86,"speaker":"Fr Silouan Giustiniano","text":"Can aid to augment the function of the Akan as a support for contemplation. And that. And what I like to say is that this contemplation embraces both feeling and intellect. And when I say intellect of, of course we mean like what I'm saying. Right, right. So. So. So you have. You have the doctrinal message that elevates you intelligibly, but you are also experiencing through aesthetic. Through the aesthetic form, also an elevation that puts you in the frame of mind that contributes towards stillness, towards a contemplative entering into a participatory connection with the work. And so. And so this. This, I think I partly have. I'm indebted, I believe, from looking at modern painting, because to me, like, okay, for example, like Ad Reinhardt, man. Yeah. I mean, some of Rothko's painting, some of even Kenneth Nolan paintings. I mean, Kenneth Nolan, it's like bordering on getting a little bit too. Factors. Yeah. You know what I'm saying? But in his best moments, you're encountering a color experience that you're like, how did this guy come up with this vision? And it puts you in, like, you're saying, a zone, you know? Right. So. But this zone has to be actually brought. It has to be something that brings you towards the ultimate. Like it's a vehicle for higher things."}
{"episode_id":"SW - #221 - 2022-03-01 - Fr. Silouan Justiniano - Icons and Contemporary Art","start":4042.86,"end":4046.98,"speaker":"Jonathan Pageau","text":"Not for the zone is not enough. It has to be the service of God. Exactly."}
{"episode_id":"SW - #221 - 2022-03-01 - Fr. Silouan Justiniano - Icons and Contemporary Art","start":4047.39,"end":4167.03,"speaker":"Fr Silouan Giustiniano","text":"No, no, totally, totally. But that's the key. But that is very important because otherwise, I think my concern is that unfortunately there is. Perhaps I'm exaggerating. Maybe not. You tell me how you feel about this. There is a tendency of using iconography for philanthic purposes. What I mean by that is, given that orthodoxy has experienced trauma after trauma historically, collapse of Constantinople, Turkish, the communist revolution. You know what I'm saying? All these various instances that have contributed to it's like stifling, constantly beaten on. The tendency is then for people. And also other issues of. Like during the Turkish yoke, for example, like, the patriarch became an ethnic leader, so the Ottoman authorities used them as a legislator of these specific ethnic group. Then Orthodoxy became closely linked to your ethnic identity. And also the whole issue of patriarchates throughout the history of Orthodoxy have inculcated a sense of, like a ethnic identity and the almost like undiscernable or undifferentiable, like, you know, connection between ethnicity and Orthodoxy. Right, but that's problematic. Yeah. And it seems to me that in the realm of iconography, what happens is that local churches tend to fixate on specific forms visually that they deem to be appropriate in embodying their sense of ethnic identity. Yeah. And my advantage is, I'm not Greek. You're not part of Russian. I'm not Puerto Rico never had a patriarchy. Right. Or America, you know. Right. You have the oca, but then there's. That's a work in progress. Right?"}
{"episode_id":"SW - #221 - 2022-03-01 - Fr. Silouan Justiniano - Icons and Contemporary Art","start":4167.03,"end":4167.47,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #221 - 2022-03-01 - Fr. Silouan Justiniano - Icons and Contemporary Art","start":4167.47,"end":4177.23,"speaker":"Fr Silouan Giustiniano","text":"Like the autocephaly and things like that. So. So we are in an environment, or I am in an environment as you as well. Like, we live in a world that is more."}
{"episode_id":"SW - #221 - 2022-03-01 - Fr. Silouan Justiniano - Icons and Contemporary Art","start":4178.93,"end":4181.89,"speaker":"Jonathan Pageau","text":"You have less of that. Of that temptation, you could say."}
{"episode_id":"SW - #221 - 2022-03-01 - Fr. Silouan Justiniano - Icons and Contemporary Art","start":4181.89,"end":4182.33,"speaker":"Fr Silouan Giustiniano","text":"Exactly."}
{"episode_id":"SW - #221 - 2022-03-01 - Fr. Silouan Justiniano - Icons and Contemporary Art","start":4182.33,"end":4183.49,"speaker":"Jonathan Pageau","text":"Have that less of that temptation."}
{"episode_id":"SW - #221 - 2022-03-01 - Fr. Silouan Justiniano - Icons and Contemporary Art","start":4183.49,"end":4251.19,"speaker":"Fr Silouan Giustiniano","text":"So we have access to all this wealth of visual reference material that we could use as a means to strengthen, uplift, make iconography more flourishing. And instead of thinking that if I don't do it this way, then I'm betraying my nation or I'm betraying the church, because I have such a close. Like, I make such a close connection between ethnicity and religion, you know. So I think it's important to emphasize that iconography is not Greek iconography, it's not Russian iconography. You know, one of the problems that Ospensky and Kantoglou had when they were having their conversation, the letters they wrote to each other was, all right, what are we going to consider to be the classical form? The best to follow? And of course, Kantoglou thought it was Cretan, you know, folk like, you know, 16th century Greek works. And while, you know, it was the, you know, the 15th or 16th century, you know what I'm saying?"}
{"episode_id":"SW - #221 - 2022-03-01 - Fr. Silouan Justiniano - Icons and Contemporary Art","start":4251.19,"end":4251.63,"speaker":"Jonathan Pageau","text":"Russian."}
{"episode_id":"SW - #221 - 2022-03-01 - Fr. Silouan Justiniano - Icons and Contemporary Art","start":4251.63,"end":4379.73,"speaker":"Fr Silouan Giustiniano","text":"Right? Russian stuff. And so they didn't agree. But the thing is, iconography is not set in stone. We follow a tradition, and the tradition is there to keep us focused on primary concerns, meanings that we are trying to embody through the iconographic tradition, that kind of graphic form in music. Similarly, you know, and so architecturally, similarly so we have this variety of things that forms aesthetic tendencies that we have received, that we have to work with, that we don't cast out because they work and they already serve as a context where people come in and they already know what they're inhabiting. And so we are to take this and elevate it more and more, more and more by our putting our contribution not out of like some like selfish, kind of like, you know, self anger, dicing purpose, but as a service to the community. And so that means that your talent, my talent, Eden Hart's talent, you know, Corda's talent, Toro's talent, whoever it is around, we have been given a very unique capacity and we use it for the service of the church. We have to use it for the service of the church. But to try to somehow stomp it because we interpret it as being self assertion or buying into the self expressive theory of modern art. I don't think it's that simple. I think there is room for the uniqueness of the person. And this is one pivotal critique that I don't think has been addressed, has been made before with the work of Kumanaswamy. Because Kumanaswamy was excessively Platonic. Yeah. And his notion of tradition was predicated on the Hindu Vedanta philosophical tradition, which completely denied the importance of the hypothesis."}
{"episode_id":"SW - #221 - 2022-03-01 - Fr. Silouan Justiniano - Icons and Contemporary Art","start":4379.81,"end":4384.09,"speaker":"Jonathan Pageau","text":"Yeah. Of the person. There's no sense of the person in Advaita Vada."}
{"episode_id":"SW - #221 - 2022-03-01 - Fr. Silouan Justiniano - Icons and Contemporary Art","start":4384.09,"end":4479.21,"speaker":"Fr Silouan Giustiniano","text":"And so for him, when he sees as the tendency in traditional art towards anonymity, he interprets it from a Vedanta's point of view. Yeah. An excessively Platonic view where like, we will shed our bodies and we will shed our personalities and we will identify ourselves with the one and. Or the Atman, the self with a capital S. And so all the illusions that the suffering caused because of us constructing this false notion of self will be done away with. And we have bliss. No, we like Saint Maccarius the Great, I think it is. And his Mahomilies is, you know, St. Paul remains St. Paul, St. Peter remains St. Peter. All the saints remain who they are, but they reach their true identity in Christ without completely losing their person. And so that's an important distinction to make. And I think the contemporary place in which we find ourselves today as iconographers is one in which we have to make that. That distinction and clarify that in emphasizing the personal dimension of iconography is not buying into self angry dicing. Self expression in individualistic sense, if anything, is a way of rebuttaling tendencies that could be excessively Platonic or excessively Hindu that have come through the amazing help without him even realizing of people like Kumar Swami."}
{"episode_id":"SW - #221 - 2022-03-01 - Fr. Silouan Justiniano - Icons and Contemporary Art","start":4479.21,"end":4520.62,"speaker":"Jonathan Pageau","text":"Yeah, and I think that it's like. It's similar to the. When we talked about, in terms of national imagery, that you just have to find a balance. There's a balance. Like, we love Russian iconography, we love Greek iconography, we love Serbian iconography, Georgian. It's beautiful. It has its wonderful particularities that we celebrate. And maybe the same also in the sense of great iconographers who have some particularity that we celebrate. We just have to find the balance between understanding how that coexists with this move towards unity. And it really is the Christian story in the end. It really is this balance of unity and multiplicity which we find already in the trinitarian theology and ultimately in the way the Church exists."}
{"episode_id":"SW - #221 - 2022-03-01 - Fr. Silouan Justiniano - Icons and Contemporary Art","start":4521.34,"end":4616.35,"speaker":"Fr Silouan Giustiniano","text":"Is the story of Pentecost, because, you know, it's a continuing Pentecost. I think that's. That Aidan Hart has put it before one of his articles where, like, each nation has something to contribute. Each nation is united in Christ. They don't lose their identity. But the catholicity of the Church presupposes that it is the healing of the confusion that happened in the Tower of Babel. And so we all come together and even if the, you know, each person has a flame on top of their head, right? Each. Each apostle, right. So it's like individual tongues of fire, but they. They still is still the same Holy Spirit. There's diversity of gifts, but the same spirit. So. So similarly, with different temperaments, different capacities, artistically, these are prophetic is, you know, the prophet prophesies, like St. Paul says, but their spirit is not taken away from them. They still have. They're cooperating with divine grace. And so we are to cooperate with divine grace. And that means that whatever is healthy, good will flourish. And what is not good, that we could put aside, we will for the service of the Church. But the individual and the. The temperamental uniqueness that each person or nation offers is for the wealth, like the wealth of the Church. And so it makes manifest and witnesses to the catholicity of the Church in the Holy Spirit."}
{"episode_id":"SW - #221 - 2022-03-01 - Fr. Silouan Justiniano - Icons and Contemporary Art","start":4616.51,"end":4668.44,"speaker":"Jonathan Pageau","text":"I think that was an amazing way to end our discussion with that last encouragement. And so, Father Silouan, thank you so much. As you know, I love. I love your work so much. And I think that for people who don't know, I have one drawing from Father Silouan. We did an exchange several years ago of a drawing which is One of my favorite things in the world, it's in my living room now. But I'm also very fortunate to be able to receive hopefully soon an icon from Father Silouan. And so I'm really excited to. I'll show everybody when I receive it. So I would say go to his website, we'll put a link in the description to the work he's doing to his articles. He is a shining light in the world of American iconography. But honestly also I think in the iconography in the world period. And so Father Silouan, thank you for your time and thank you."}
{"episode_id":"SW - #221 - 2022-03-01 - Fr. Silouan Justiniano - Icons and Contemporary Art","start":4668.44,"end":4684.59,"speaker":"Fr Silouan Giustiniano","text":"Thank you for giving me the opportunity. We tried to do this a while back, but I'm glad we finally got it and it's been actually providentially, actually worth the wait because it was a good conversation. And thank you for giving me the opportunity."}
{"episode_id":"SW - #221 - 2022-03-01 - Fr. Silouan Justiniano - Icons and Contemporary Art","start":4685.07,"end":4746.91,"speaker":"Jonathan Pageau","text":"I hope you enjoyed this episode of the Symbolic World. The Symbolic World is based on a series of videos that you can find on my YouTube channel, Jonathan Pedro's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that it's quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course leaving a review on itunes. Everybody knows that's the best way to get the podcast out there, to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon the Pajo videos as well and on subscribestar. All those links you can find on my website or in the show description. So thank you and I will see you soon."}
