{"episode_id":"SW - #035 - 2019-04-16 - Santa Claus and the Tooth Fairy Exist","start":0.48,"end":62.68,"speaker":"Jonathan Pageau","text":"On this episode of the Symbolic World podcast, I will be playing for you a discussion about in what manner it is that beings exist, using the example of Santa Claus and the tooth Fairy, that example that so many atheists use to make fun of religion. I wanted to show the manner in which beings that are not the usual beings that we encounter in everyday life, in what manner that they exist, and how this relates to how cities or how any form of, let's say, larger or higher being can exist. What's funny about this particular podcast is that in December I was surprised to discover that Akira the Dawn, who is a lo fi DJ in California, I believe, made a song out of my video called Obviously Santa Claus Exists. It was quite a catchy song. In fact, what I will do is at the end of the video, I will put in a version of the song so that you can get a sense of what he put together. It's quite funny. So please enjoy."}
{"episode_id":"SW - #035 - 2019-04-16 - Santa Claus and the Tooth Fairy Exist","start":76.04,"end":79.64,"speaker":"Jonathan Pageau","text":"This is Jonathan Peugeot. Welcome to the Symbolic World."}
{"episode_id":"SW - #035 - 2019-04-16 - Santa Claus and the Tooth Fairy Exist","start":90.53,"end":241.4,"speaker":"Jonathan Pageau","text":"So one of the arguments we hear coming from the new type of atheist is run something like this. When I was a child, I believed in Santa Claus. When I was a child, I believed in the tooth fairy. But then one day I grew up and I realized that Santa Claus doesn't exist. I realized that the tooth fairy doesn't exist. And in the same manner, one day I grew up and I realized that God doesn't exist. And usually God in this type of formulation is referred to as something like a sky daddy or a sky fairy, something disparaging in that manner. Now, I've always found that line of argumentation rather funny because to me it seems completely absurd to say that Santa Claus doesn't exist, because obviously Santa Claus exists everywhere at Christmas, there are guys who dress up as Santa Claus. There are Santa Claus decoration, ornaments, we have stories, we have songs, we have all these things which celebrate Santa Claus. And so it is. It is. It is patently absurd to say that Santa Claus does not exist. Now, there are certain things that don't exist, for example, square circle or dry water. Now, those things are impossible. They do not exist. But Santa Claus definitely exists. Now, the question we need to ask is if Santa Claus exists, in what manner does Santa Claus exist? And I think that asking oneself that question of how it is that Santa Claus exists can maybe help certain people understand the manner in which we say that God exists. That is, there are things that exist that are not at the level of my coffee cup, you know, that are not at the level of my pencil or at the level of a rock or at the level of a concrete thing that you can hold in your hands and say, this is it. There are things which exists at different levels of being and that, that don't have as contained, let's say, contained bodies, okay? And you can say that about concepts. It's like love exists, but you can't."}
{"episode_id":"SW - #035 - 2019-04-16 - Santa Claus and the Tooth Fairy Exist","start":241.48,"end":243.08,"speaker":"Jonathan Pageau","text":"You can't put it in a bottle."}
{"episode_id":"SW - #035 - 2019-04-16 - Santa Claus and the Tooth Fairy Exist","start":243.08,"end":560.36,"speaker":"Jonathan Pageau","text":"You can't put it in a box, but it still exists, okay? And actually, let's say Santa Claus exists in a much more immediate manner than something like love, because we know what Santa Claus looks like. We know what his purpose is, what he does. We, you know, we know, we have stories about him, we have songs that celebrate him, and we have events which celebrate him as well. And so it is obvious that Santa Claus exists now. Now, the thing is that what people tend to struggle with is to understand that beings are not obvious. It's not that obvious. What. How to contain a being. So you, for example, you have parts. You have hands and fingers. You have, you know, you have toes, you have eyes, you have hair, you have all these different parts, okay? There is something, your being, your personhood, which holds all those things together, which makes us see that those parts are you, okay? And there are. You can even add things to you which make us see that, participate in your person. You can get a tattoo, a woman can wear makeup. You can, you know, I can also cut my beard in a certain way, which participates in my person. I can even put on clothing, a certain style of clothing, which at some point will participate in my being. Even though it's not completely attached to my body, it's still part of who I am as a person, okay? So I have these parts, and there's something which brings those parts together, okay? Now, Santa Claus is. Is the same thing. First of all, he has elements of his person which manifest his being. Who Santa Claus is. We all know who Santa Claus is. We all know, you know, what, what, what he represents, what his purpose is. And those. But his body, let's say Santa Claus's body is just not as contained as your body. It is actually a lot bigger than your body. And so there are parts of Santa Claus are the images of Santa Claus that we see in Walmart, that we see in movies, that we see in different songs, different stories. Just like your picture which appears online, or your picture that's in your telephone or in some family album on also is an extension of you, right? When people see the picture, they recognize you and they come into contact with you like so, too, Santa Claus has parts. So when you. When a guy dresses up as Santa Claus in your mall, he is manifesting Santa Claus, right? He is a part of Santa Claus to the extent that. That he's participating in the being of Santa Claus at that moment. Okay? Now, Santa Claus is actually a great example because you can actually speak to Santa Claus. Now when you go into the mall, you sit. You know, if a child goes to the mall, they sit on Santa Claus's lap, and then they speak to Santa Claus. What will they do? They will tell Santa Claus. The Santa Claus will ask them, oh, my young child, oh, what would you like for Christmas? And the child will answer, what they want for Christmas. And Santa Claus will find some story about how, you know, he's gonna try to get that child his gifts for Christmas. Okay, so the child is speaking to Santa Claus. And that's really important to understand. The child is not speaking to Joe, to the Joe under the costume who's put on the fake beard. She isn't speaking to him. She's speaking to Santa Claus. And it also isn't Joe that is answering. It's Santa Claus that is answering. Because Joe is not gonna tell the little child about his recent divorce or about how his girlfriend left him with his best friend and how he's in the ruts right now, and that's why he's taking the stupid Santa Claus job for Christmas. He's not going to say that. No. He's going to smile, he's going to laugh, and he's going to tell the child about what gifts they're going to get for Christmas. If Joe starts to tell the child something else, starts to talk about something else, about maybe his new car. You know, he just bought this new car and he's making his car payments, the child will no longer recognize Santa Claus. That person, Joe, will cease to be a body part of Santa Claus. Now, you can write a letter to Santa Claus. You can write a letter, Santa Claus, North Pole, put it in the mail, send it to Santa Claus. And you know what Santa Claus is going to answer. And it isn't Martha sitting in the post office, you know, typing out the letter. She's not the one who's actually answering. She is manifesting Santa Claus. Okay, you can do the same thing."}
{"episode_id":"SW - #035 - 2019-04-16 - Santa Claus and the Tooth Fairy Exist","start":560.36,"end":562.72,"speaker":"Jonathan Pageau","text":"You'Re doing to Santa Claus. I can do to you."}
{"episode_id":"SW - #035 - 2019-04-16 - Santa Claus and the Tooth Fairy Exist","start":562.72,"end":598.57,"speaker":"Jonathan Pageau","text":"I can say, when you answer my question, I can say, well, it's not you that is answering my question, right? It's your mouth that that's answering my question. But Is that true? Is it your mouth that's answering the question? No. Your mouth is the tool by which you are answering the question. And so, too, the disguised Santa Clauses that go to the mall are the tool by which Santa Claus manifests himself in the world. Santa Claus is a being that's pretty coherent. You can. He has a personality."}
{"episode_id":"SW - #035 - 2019-04-16 - Santa Claus and the Tooth Fairy Exist","start":598.73,"end":600.25,"speaker":"Jonathan Pageau","text":"He has a way of speaking."}
{"episode_id":"SW - #035 - 2019-04-16 - Santa Claus and the Tooth Fairy Exist","start":600.49,"end":614.89,"speaker":"Jonathan Pageau","text":"You can engage with Santa Claus and Santa Claus will answer. And this is not. This is not just imaginary, because you are not that contained as you think you as a person."}
{"episode_id":"SW - #035 - 2019-04-16 - Santa Claus and the Tooth Fairy Exist","start":615.13,"end":618.09,"speaker":"Jonathan Pageau","text":"You can be possessed by all these different ideas."}
{"episode_id":"SW - #035 - 2019-04-16 - Santa Claus and the Tooth Fairy Exist","start":618.09,"end":1198.2,"speaker":"Jonathan Pageau","text":"You can be influenced by all these external influences. And even in your mind, you can. You are not as centered as you think. You have all these different kind of crazy personalities that can pull you in different directions. So why do you think that you, as a person, exist? Right? There is something. There is a total way in which those elements are pulled together into a consistent being. If it wasn't so, we'd say you're schizophrenic, or we'd say you're crazy. If you're not crazy, there's something pulling those elements together so that when I ask you something, right, you answer me. I recognize you in that answer. Okay, Now I want to tell you a story about the tooth Fairy, because the manner in which the tooth fairy exists is also very interesting to help someone understand what exactly it is we're talking about when we talk about spiritual. Spiritual beings and how they can exist in the world. Now, my daughter, you know, I grew up in a. In a kind of Protestant home. And so in my house, we didn't believe in Santa Claus the way that other families did. So I kind of kept that, let's say, habit. And so in our family, with my kids, we don't. We didn't. We didn't tell them that Santa Claus existed in the same manner that their uncle existed or their aunt or whatever. We. We treated it as a game, something to celebrate, something to tell stories about, something to have fun with and celebrate and enjoy. We did the same with the tooth fairy. So I never pretended that there was an actual physical fairy that came into my child's house to put a tooth under her pillow. But we did talk about the tooth fairy. We talked about the tooth fairy, and we talked about the story of the tooth fairy. And I would kind of joke around with them and say, oh, the tooth fairy is going to come and bring money, put money to your pillow. And I. And I thought that they knew that. That physically, the physical cause of the 2 of the money getting under the pillow was me, you know, but then when my daughter. I forget how old she was. I think she was like seven or eight maybe. One day she. She lost her tooth, and she was going to put her tooth under her pillow. And then I. I said something because I wasn't being careful at all. And I said something, you know, to the effect of how I had to make sure I don't forget, you know, to put the money into the pillow and something like that. And then she looked at me, you know, with these eyes, like I had. Like she was devastated because I had. I had kind of ruined the magic, I guess, you know, of what kind of how other families do it. And she looked at me with those eyes and she said, what? She said, the tooth fairy doesn't exist. And then I looked at her, and I realized that, you know, I. Maybe I hadn't been careful enough and that she really had entered into this, you know, full throttle. And so I thought for a second, but it didn't take me very long to. To ask her a few questions to kind of help her understand what was going on. And I said. I asked her, I said, why do you think that, you know, I would put money under your pillow? And my daughter said, well, because, you know, I lost my tooth, so, you know, you put money on my pillow. But obviously, that is not direct causality. There's no. Why would you put money under a pillow because of a tooth? I said, why would I. So I asked her, I said, why would I put money under your pillow because you lost your tooth. Because, I mean, obviously that's not. That's not that an immediate thing. It's not. It's not that obvious. And then she said, well, you're doing it because of the tooth fairy. And so that's what I asked her. I said, so what you're saying, what you're telling me, is that the reason why I put money under your pillow is because of the tooth fairy. So the tooth fairy is making me put money under your pillow. And she looked at me, and it's so funny because you think, you know, seems like even adults don't understand how that works, but she totally got it. She totally understood what I was talking about. And I just saw she had this smile on her face. It's like she had just discovered a little mystery of how the universe exists. And then it was really fascinating because I don't remember why, but for some reason, she had to do the same. Like, I think someone of her friends or I forget who had also lost her tooth. And then she was the one who was going to put the money under the pillow. And she was so excited, like she was so happy that she could be the one putting the money under the pillow for the tooth fairy, you know, and realizing that it was because of the tooth fairy that she was doing that. So I think that can help people understand how beings function, what it means for something to be a being, what it means when we talk about the notion that certain cities have certain personalities, that certain cities have certain elements which make them unique, make them special, something. And you can then understand why in the Bible we have this notion of the angels of different cities, how different cities have different angels, because a city can say something, a city can speak coherently, can say things which make you recognize that it is that city which is speaking to you. Okay? Now once again, you, you obviously cannot take it at the first degree. You have to un. You have to be able to pierce the mystery of understanding how these beings, you know, stack up in a hierarchy and how, you know, how you are also made of parts, just like a city is made of parts. And your uniqueness is no different from, from the uniqueness of a city which has its own personality, its own way of speaking. And you can hear a city speak. You can, you know, just not, it's not, it's not, it's not a superstitious thing at all. Just like you can hear a country speak, just like you can hear higher level beings, you can, you can, you can encounter them. You can encounter them and, and hear them, okay? Just like you can encounter Santa Claus in the mall by looking at Joe, who's dressed up as Santa Claus. You are, in that moment encountering Santa Claus. You are hearing Santa Claus, okay? And you'll say, you know, that's just silly. That's just absurd. But you do that all the time. When you encounter a police officer or you encounter a judge, or you encounter any official representative of a city or of an entity, that judge is not going to represent to you his own personal proclivities. And when he does that, we're in trouble. Some people are seeing that happen now, seeing how the judges, instead of just manifesting the law, they're inserting all their, as much as possible, their opinions into what they're saying. But in a normal, functioning world, let's say if a city holds together, if a country or a state holds together, the representatives of that state are there to manifest to you the will of that state based on its identity, its constitution, its laws. And so when you hear a judge speaking, you are actually speaking to the city, the state that you are encountering to a certain extent. When you pray to a judge, you are praying to the state which the judge is supposed to manifest. And the judge's answer is the answer of the state. There is no other answer besides that. Right? You can maybe appeal to a higher level authority, but it doesn't matter. Even if you appeal to a higher level authority, you are appealing to something which manifests the state more and more purely. The law of the state more and more purely. Okay, and so you can pray to the angel. Man, some people are gonna freak out at this. But you can speak to the spirit of the United States and you can hear the spirit of the United States speak through its representative, through its images, through its, through both its cultural images, but also its formal legal representatives. That is just how the world works. And so atheists, seriously, Santa Claus exists, you know, the tooth fairy exists. There are beings that exist that exist different from a rock. So, alright, I hope that helps you understand. If not, leave all your angry atheist comments below and all your. Your silly superstitious accusations below. But I have to say that I would make the effort to understand because it is possible that it is not me who is making a fool of myself. And so, yeah, I'll talk to you guys soon."}
{"episode_id":"SW - #035 - 2019-04-16 - Santa Claus and the Tooth Fairy Exist","start":1199.72,"end":1255.66,"speaker":"Jonathan Pageau","text":"Thank you for listening to the Symbolic World podcast. As you know, this podcast is for now based mostly on my YouTube videos which I am transferring into audio form format. Please go ahead and visit my YouTube channel. There are more videos there on different subjects that I'm not going to put into audio. And please share this to your friends. I know a lot of people know about the YouTube content, but not so many people know that this is also a podcast. So share it to your friends, share it on social media. And if you can, feel free to support this financially as well by going to my Patreon page, which is Peugeot Videos. Strangely, you can go there and you can support it at any amount that you want. A month for all the patrons. I do a monthly Q and A live Q and A in which people can ask questions in the chat. And I try to have a more personal connection with people. The YouTube comments have become difficult to follow and to answer. I'll see you soon."}
{"episode_id":"SW - #035 - 2019-04-16 - Santa Claus and the Tooth Fairy Exist","start":1257.5,"end":1262.78,"speaker":"Jonathan Pageau","text":"One of the arguments we hear coming from the new type of atheist."}
{"episode_id":"SW - #035 - 2019-04-16 - Santa Claus and the Tooth Fairy Exist","start":1263.1,"end":1264.91,"speaker":"Jonathan Pageau","text":"When I was a child, I. I."}
{"episode_id":"SW - #035 - 2019-04-16 - Santa Claus and the Tooth Fairy Exist","start":1264.91,"end":1267.95,"speaker":"Jonathan Pageau","text":"Believed in Santa Claus. When I was a child, I believed."}
{"episode_id":"SW - #035 - 2019-04-16 - Santa Claus and the Tooth Fairy Exist","start":1267.95,"end":1271.03,"speaker":"Jonathan Pageau","text":"In the tooth fairy. But then one day I grew up."}
{"episode_id":"SW - #035 - 2019-04-16 - Santa Claus and the Tooth Fairy Exist","start":1271.03,"end":1281.27,"speaker":"Jonathan Pageau","text":"And I realized that Santa Claus doesn't exist. I realized the tooth fairy doesn't exist. And in the same manner, one day I grew up and I realized that God doesn't exist."}
{"episode_id":"SW - #035 - 2019-04-16 - Santa Claus and the Tooth Fairy Exist","start":1285.67,"end":1298.4,"speaker":"Jonathan Pageau","text":"I've always found that line of argumentation rather funny, because to me it seems completely absurd to say Santa Claus doesn't exist."}
{"episode_id":"SW - #035 - 2019-04-16 - Santa Claus and the Tooth Fairy Exist","start":1299.12,"end":1301.84,"speaker":"Unregistered: Akira the Dawn","text":"Because obviously Santa Claus exists."}
{"episode_id":"SW - #035 - 2019-04-16 - Santa Claus and the Tooth Fairy Exist","start":1302.48,"end":1322.25,"speaker":"Jonathan Pageau","text":"There are Santa Clauses everywhere at Christmas. There are guys who dress up as Santa Claus. There are Santa Claus decoration, ornaments. We have stories, we have song. They've all these things which celebrate Santa Claus. It is patently absurd to say that."}
{"episode_id":"SW - #035 - 2019-04-16 - Santa Claus and the Tooth Fairy Exist","start":1322.25,"end":1344.18,"speaker":"Unregistered: Akira the Dawn","text":"Santa Claus does not exist. Obviously, Santa Claus exists. Obviously Santa Claus exists. Obviously Santa Claus exists. Obviously Santa Claus exists."}
{"episode_id":"SW - #035 - 2019-04-16 - Santa Claus and the Tooth Fairy Exist","start":1347.46,"end":1392.92,"speaker":"Jonathan Pageau","text":"There are certain things that don't exist, for example, a square circle or dry water. Now, those things are impossible. They do not exist. But Santa Claus definitely exists. The question we need to ask is in what manner does Santa Claus exist? And I, I think that asking oneself that question of how it is that Santa Claus exists can maybe help certain people understand the manner in which we say that God exists. There are things that exist that are not at the level of my coffee cup. There are things which exist at different levels of being."}
{"episode_id":"SW - #035 - 2019-04-16 - Santa Claus and the Tooth Fairy Exist","start":1393,"end":1395.08,"speaker":"Unregistered: Akira the Dawn","text":"Obviously Santa Claus exists."}
{"episode_id":"SW - #035 - 2019-04-16 - Santa Claus and the Tooth Fairy Exist","start":1395.16,"end":1398.68,"speaker":"Jonathan Pageau","text":"And you can say that about context, love exists, but you can't."}
{"episode_id":"SW - #035 - 2019-04-16 - Santa Claus and the Tooth Fairy Exist","start":1398.68,"end":1400.52,"speaker":"Unregistered: Akira the Dawn","text":"Obviously Santa Claus exists."}
{"episode_id":"SW - #035 - 2019-04-16 - Santa Claus and the Tooth Fairy Exist","start":1400.52,"end":1404.44,"speaker":"Jonathan Pageau","text":"You can't put it in a bottle, you can't put it in a box, but it still exists."}
{"episode_id":"SW - #035 - 2019-04-16 - Santa Claus and the Tooth Fairy Exist","start":1404.44,"end":1406.76,"speaker":"Unregistered: Akira the Dawn","text":"Obviously Santa Claus exists in a much."}
{"episode_id":"SW - #035 - 2019-04-16 - Santa Claus and the Tooth Fairy Exist","start":1406.76,"end":1409.56,"speaker":"Jonathan Pageau","text":"More immediate manner than something like love."}
{"episode_id":"SW - #035 - 2019-04-16 - Santa Claus and the Tooth Fairy Exist","start":1409.88,"end":1411.8,"speaker":"Unregistered: Akira the Dawn","text":"Obviously Santa Claus exists."}
{"episode_id":"SW - #035 - 2019-04-16 - Santa Claus and the Tooth Fairy Exist","start":1411.8,"end":1419.39,"speaker":"Jonathan Pageau","text":"We know what Santa Claus looks like, what his purpose is. Now the thing is that when people tend to, to, to struggle with, is."}
{"episode_id":"SW - #035 - 2019-04-16 - Santa Claus and the Tooth Fairy Exist","start":1419.39,"end":1424.87,"speaker":"Jonathan Pageau","text":"To understand that beings are not obvious."}
{"episode_id":"SW - #035 - 2019-04-16 - Santa Claus and the Tooth Fairy Exist","start":1426.55,"end":1435.99,"speaker":"Jonathan Pageau","text":"It's not that obvious how to contain a being. So you, for example, you have parts."}
{"episode_id":"SW - #035 - 2019-04-16 - Santa Claus and the Tooth Fairy Exist","start":1436.15,"end":1439.39,"speaker":"Jonathan Pageau","text":"You have hands and fingers, eyes, you."}
{"episode_id":"SW - #035 - 2019-04-16 - Santa Claus and the Tooth Fairy Exist","start":1439.39,"end":1468.88,"speaker":"Jonathan Pageau","text":"Have hair, you have all these different parts. And there is something you being, your personhood, which holds all those things together. Now, Santa Claus is the same thing, but his body is just not as contained as your body. It is actually a lot bigger than your body. Hearts of Santa Claus are the images of Santa Claus that we see in movies, that we see in stories."}
{"episode_id":"SW - #035 - 2019-04-16 - Santa Claus and the Tooth Fairy Exist","start":1468.88,"end":1471.85,"speaker":"Jonathan Pageau","text":"Just, Just like your picture which appears online."}
{"episode_id":"SW - #035 - 2019-04-16 - Santa Claus and the Tooth Fairy Exist","start":1472.09,"end":1474.09,"speaker":"Unregistered: Akira the Dawn","text":"Obviously Santa Claus exists."}
{"episode_id":"SW - #035 - 2019-04-16 - Santa Claus and the Tooth Fairy Exist","start":1474.25,"end":1476.41,"speaker":"Jonathan Pageau","text":"Your picture that's in your telephone or."}
{"episode_id":"SW - #035 - 2019-04-16 - Santa Claus and the Tooth Fairy Exist","start":1476.41,"end":1479.17,"speaker":"Unregistered: Akira the Dawn","text":"In some family house, Obviously Santa Claus."}
{"episode_id":"SW - #035 - 2019-04-16 - Santa Claus and the Tooth Fairy Exist","start":1479.17,"end":1482.97,"speaker":"Jonathan Pageau","text":"Exists, is an extension of you."}
{"episode_id":"SW - #035 - 2019-04-16 - Santa Claus and the Tooth Fairy Exist","start":1483.29,"end":1485.29,"speaker":"Unregistered: Akira the Dawn","text":"Obviously Santa Claus exists."}
{"episode_id":"SW - #035 - 2019-04-16 - Santa Claus and the Tooth Fairy Exist","start":1485.29,"end":1487.61,"speaker":"Jonathan Pageau","text":"When people see the picture, they recognize."}
{"episode_id":"SW - #035 - 2019-04-16 - Santa Claus and the Tooth Fairy Exist","start":1487.61,"end":1491.05,"speaker":"Unregistered: Akira the Dawn","text":"You and they come into contact with Santa Claus exists."}
{"episode_id":"SW - #035 - 2019-04-16 - Santa Claus and the Tooth Fairy Exist","start":1491.69,"end":1518.74,"speaker":"Jonathan Pageau","text":"So too Santa Claus has parts. When a guy, guy dresses up as Santa Claus in your mall, he is manifesting Santa Claus. He is a part of Santa Claus to The extent that he's participating in the being of Santa Claus at that moment. If a child goes to the mall, they sit on Santa Claus's lap, and then they speak to Santa Claus. What would you like for Christmas?"}
{"episode_id":"SW - #035 - 2019-04-16 - Santa Claus and the Tooth Fairy Exist","start":1519.06,"end":1528.28,"speaker":"Jonathan Pageau","text":"The child will answer her what they want for Christmas. And Santa Claus will find some story about how, you know, you're gonna try to get that child his gift for Christmas."}
{"episode_id":"SW - #035 - 2019-04-16 - Santa Claus and the Tooth Fairy Exist","start":1528.28,"end":1537.56,"speaker":"Jonathan Pageau","text":"So the child is speaking to Santa Claus. That's really important to understand. The child is not speaking to Joe under the costume who put on the fake beard."}
{"episode_id":"SW - #035 - 2019-04-16 - Santa Claus and the Tooth Fairy Exist","start":1537.64,"end":1538.04,"speaker":"Jonathan Pageau","text":"She."}
{"episode_id":"SW - #035 - 2019-04-16 - Santa Claus and the Tooth Fairy Exist","start":1538.12,"end":1539.56,"speaker":"Jonathan Pageau","text":"She isn't speaking to him."}
{"episode_id":"SW - #035 - 2019-04-16 - Santa Claus and the Tooth Fairy Exist","start":1539.8,"end":1541.88,"speaker":"Unregistered: Akira the Dawn","text":"Obviously, Santa Claus exists."}
{"episode_id":"SW - #035 - 2019-04-16 - Santa Claus and the Tooth Fairy Exist","start":1541.96,"end":1543.56,"speaker":"Jonathan Pageau","text":"She's speaking to Santa Claus."}
{"episode_id":"SW - #035 - 2019-04-16 - Santa Claus and the Tooth Fairy Exist","start":1545.4,"end":1545.82,"speaker":"Jonathan Pageau","text":"Obviously."}
{"episode_id":"SW - #035 - 2019-04-16 - Santa Claus and the Tooth Fairy Exist","start":1545.89,"end":1547.41,"speaker":"Unregistered: Akira the Dawn","text":"Obviously, Santa Claus exists."}
{"episode_id":"SW - #035 - 2019-04-16 - Santa Claus and the Tooth Fairy Exist","start":1547.41,"end":1549.33,"speaker":"Jonathan Pageau","text":"And it also isn't Joe that is."}
{"episode_id":"SW - #035 - 2019-04-16 - Santa Claus and the Tooth Fairy Exist","start":1549.33,"end":1558.73,"speaker":"Unregistered: Akira the Dawn","text":"Answering, obviously, Santa Claus exists. It's Santa Claus that is answering, obviously, Santa Claus exists."}
{"episode_id":"SW - #035 - 2019-04-16 - Santa Claus and the Tooth Fairy Exist","start":1558.73,"end":1577.5,"speaker":"Jonathan Pageau","text":"It is obvious that Santa Claus exists. If Joe starts to tell the child something else, the child will no longer recognize Santa Claus. Joe will cease to be a body part of Santa Claus."}
{"episode_id":"SW - #035 - 2019-04-16 - Santa Claus and the Tooth Fairy Exist","start":1583.9,"end":1585.78,"speaker":"Jonathan Pageau","text":"Now, you can write a letter to."}
{"episode_id":"SW - #035 - 2019-04-16 - Santa Claus and the Tooth Fairy Exist","start":1585.78,"end":1628.54,"speaker":"Jonathan Pageau","text":"Santa Claus, put it in the mail, send it to Santa Claus, and you know what Santa Claus is going to answer. And it isn't Martha sitting in the post office, you know, typing out the letter. She's not the one who's actually answering. She is manifesting Santa Claus. The same thing you're doing to Santa Claus, I can do to you when you answer my question. I can say, well, it's not you that is answering my question, right? It's your mouth that's answering my question. But is that true? Is it your mouth that's answering the question? No, your mouth is the tool by which you are answering the question."}
{"episode_id":"SW - #035 - 2019-04-16 - Santa Claus and the Tooth Fairy Exist","start":1630.14,"end":1632.22,"speaker":"Unregistered: Akira the Dawn","text":"Obviously, Santa Claus exists."}
{"episode_id":"SW - #035 - 2019-04-16 - Santa Claus and the Tooth Fairy Exist","start":1632.3,"end":1634.94,"speaker":"Jonathan Pageau","text":"The disguised Santa Clauses are the tool."}
{"episode_id":"SW - #035 - 2019-04-16 - Santa Claus and the Tooth Fairy Exist","start":1634.94,"end":1637.82,"speaker":"Unregistered: Akira the Dawn","text":"By which, obviously, Santa Claus exists."}
{"episode_id":"SW - #035 - 2019-04-16 - Santa Claus and the Tooth Fairy Exist","start":1637.82,"end":1641.26,"speaker":"Jonathan Pageau","text":"Santa Claus manifests himself in the world."}
{"episode_id":"SW - #035 - 2019-04-16 - Santa Claus and the Tooth Fairy Exist","start":1641.42,"end":1643.3,"speaker":"Unregistered: Akira the Dawn","text":"Obviously, Santa Claus exists."}
{"episode_id":"SW - #035 - 2019-04-16 - Santa Claus and the Tooth Fairy Exist","start":1643.3,"end":1646.3,"speaker":"Jonathan Pageau","text":"Santa Claus is a being that's pretty coherent."}
{"episode_id":"SW - #035 - 2019-04-16 - Santa Claus and the Tooth Fairy Exist","start":1647.1,"end":1649.11,"speaker":"Unregistered: Akira the Dawn","text":"Obviously, it has a personality."}
{"episode_id":"SW - #035 - 2019-04-16 - Santa Claus and the Tooth Fairy Exist","start":1649.11,"end":1662.23,"speaker":"Jonathan Pageau","text":"He has a way of speaking. You can engage with Santa Claus, and Santa Claus will answer, this is not just imaginary, because you are not that."}
{"episode_id":"SW - #035 - 2019-04-16 - Santa Claus and the Tooth Fairy Exist","start":1662.55,"end":1666.63,"speaker":"Jonathan Pageau","text":"Contained as you think you as a person."}
{"episode_id":"SW - #035 - 2019-04-16 - Santa Claus and the Tooth Fairy Exist","start":1666.79,"end":1685.36,"speaker":"Jonathan Pageau","text":"You can be possessed by all these different ideas. You can be influenced by all these external influences. And even in your mind, you are not as centered as you think. You have all these different kind of crazy personalities that can pull you in different directions. So why do you think that you, as a person, exist?"}
{"episode_id":"SW - #035 - 2019-04-16 - Santa Claus and the Tooth Fairy Exist","start":1685.84,"end":1686.16,"speaker":"Jonathan Pageau","text":"Right?"}
{"episode_id":"SW - #035 - 2019-04-16 - Santa Claus and the Tooth Fairy Exist","start":1686.16,"end":1699.85,"speaker":"Jonathan Pageau","text":"There is something, There is a total way in which those elements are pulled together into a consistent being. If it wasn't so, we'd say you're schizophrenic, or we'd say you're crazy. If you're not crazy, then there's something."}
{"episode_id":"SW - #035 - 2019-04-16 - Santa Claus and the Tooth Fairy Exist","start":1699.85,"end":1703.13,"speaker":"Jonathan Pageau","text":"Pulling those elements together so that when."}
{"episode_id":"SW - #035 - 2019-04-16 - Santa Claus and the Tooth Fairy Exist","start":1703.13,"end":1708.97,"speaker":"Jonathan Pageau","text":"I ask you something, you answer me. I recognize you in that answer."}
{"episode_id":"SW - #035 - 2019-04-16 - Santa Claus and the Tooth Fairy Exist","start":1709.21,"end":1722.57,"speaker":"Unregistered: Akira the Dawn","text":"Obviously, Santa Claus exists. Obviously, Santa Claus exists. Obviously, Santa Claus exists."}
