{"episode_id":"SW - #387 - 2025-04-16 - Severance - When Hierarchy Breaks Down","start":0.16,"end":61.01,"speaker":"Laura Diaz","text":"Tucson, the weight is over Mediweight loss. They're officially open on North Oracle Road. That's right. No more counting down the days. You can walk in right now and start your journey to a healthier you. Hey, it's Laura Diaz from iheartradio and you can trust me. This isn't just another weight loss clinic. I know that because it's where I lost weight safely with real medical support. GLP1 medications. You can see them everywhere online right now. But the truth is your health shouldn't be a DIY project ordering these meds without the professional guidance. It can lead to dangerous mistakes, wrong doses, no oversight, and serious risks. At mediweight loss. I got the same medication but with a customized plan, weekly check ins, and a licensed physician guiding me every step of the way. And the cost? The same as those risky online options. Tucson, your moment is here. If you're ready to take control, feel better and lose weight the right way, mediweight loss is ready for you. Walk in, get started and see real results. Call or visit mediweightloss.com to learn more and book your free consultation today. That's mediweightloss.com."}
{"episode_id":"SW - #387 - 2025-04-16 - Severance - When Hierarchy Breaks Down","start":67.17,"end":2570.67,"speaker":"Jonathan Pageau","text":"And so from the larger frame, it's really fascinating because I don't think I've ever seen a series or a story where the absurdity of what you're noticing is. Is entertaining. You know, because absurdity can be funny and entertaining, but it's also completely reasonable from the larger frame because we, the viewer are meant to experience the severance ourselves, right? And so we're watching this and we're experiencing a kind of disconnection and confusion, right? But also wonder. This is Jonathan Pedro. Welcome to the symbolic world. For quite a while now, several people that I know and trust and like have been encouraging me to watch the show Severance. And at first, when people presented the concept to me, which is basically the idea that like in a science fiction world, people are able to sever themselves between their work Persona and the rest of their life. And the people in the work Persona don't know and don't remember the rest of their life. And the people in the rest of the life don't know and don't. Don't have any memories or connection to their Persona. And at first I thought, what a strange idea for a show. I don't know why that would be interesting. But after much insistence, I decided to watch it and realized that it is actually a really wonderful exploration and of how identity functions, you know, and how identities, hierarchies, Work especially how what happens when a hierarchy becomes dysfunctional and what happens when there is a break between the different levels of a hierarchy of a system, both in terms of a social system, but obviously the hierarchy that also exists within us. The first thing to say, which I was really surprised to see, that this show came out and it was filmed during COVID It came out, what, in 2022, I guess. And it's just very odd to watch a show that was filmed during COVID be about a biotech technology that secretly controls your narrative and isolates you from, you know, you're the full story and the meaning of life. And is just very odd to realize that. That this was filmed during COVID And I wonder if the people who are wearing masks and doing all of this distancing during COVID realized that they were participating in a form of severance while they were making it. You know, not sure. And so the. The. The main character is Mark. And we're going to try to follow his story mostly because we could kind of follow different threads. But I think that, you know, he, of course, because he's the main character, he is, is a microcosm of the whole question of severance. And it's very interesting to see that, you know, the severance starts even before the severance in the brain, right? And so the reason why Mark is performing this severance in his life is because his wife died. He had a kind of trauma which broke away his marriage, or think of the marriage as the union of two people together in one, forming one body. And so he's severed from his wife, his wife dies, and then because of that, he can't keep his own life together. You know, his work life is falling apart because he's drinking. And so finally he decides to sever himself in order to be able to continue. And so you can already see it like a process of fragmentation. And interestingly enough, in the second season, you find out that the severance had started even before that. Because one of the things that led to all of this is that Mark and his wife Gemma, they were trying to have a child. And so they were really trying to express their unity in the formation of a family, which would be at even higher unity, right, which would be this. This one in many that. This dance of one in many that exists beyond the individual, but they're not able to do that. And it's in that moment that his wife dies and that he decides to sever. And so you can see this kind of fragmentation of the person already in the meta Narrative, right? Already in the narrative, before the actual science fiction things take takes hold, you could say. So, you know, before we continue, you have to always kind of remember how it is that I describe the world and you know, what it is that we're talking about when we say there's hierarchies, right? And so you kind of have to understand that all of beings function as hierarchies. And there are holes and there are parts, and those parts also have holes. And therefore you keep going down. You can go all the way down to, you know, to the atoms or to quantum field or whatever. But even in a person, you know, that's how it functions, right? So you can imagine that also that these hierarchies, they're cascading next to each other. There's not just one, there are many. And you can kind of follow the line down different, different hierarchies. And so you can think of yourself, you, let's say me, Jonathan. I'm the through line. Just think of it that way. So there is a through line in my life and in my experience, the. The aspect of me that gathers the memories together and that creates a story that makes me one person and not many people. But then also inside me, you know, you have sub personalities. You have different aspects of your personalities, and in that you also have desires. And then there are thoughts, and all of these, you know, are multiple. And sometimes it can kind of compete with each other. They can be hostile to each other, right? So sometimes you'll have thoughts and you'll say, well, that's not me. Right? You experience it as a temptation. So when you experience a thought as a temptation, there's a sense in which, in these. In the things that are happening inside you, you know, as you go down the hierarchy, some of these things are maybe competing with each other. They don't know each other. And so you have to integrate them in. Into the through line and say, no, I won't do that, even though I thought about it, because. Because that's not really part of me. It's not at least the part of me that is the most integrated, right? So this process happens, you know, in yourself in terms of your psyche, but it also happens in yourself in terms of, let's say, the same. You have, you, the through line, the one who's acting. And then below that, you have your members, your arms, your legs, those that follow your instructions, but you also have cell organs inside you, and then those organs have subsystems, and then you have cells, etc. Etc. Right? And so that's just kind of how the, the, the, the body works. And you can experience severance, you know, in your life, you experience it actually more than you think. You can think about sin as a form of severance because sin is something like there's a little desire in you or a thought in you that forgets its connection to the whole, right. And forgets how what it's doing will affect the whole of the person and is willing to kind of engage in certain behaviors that don't connect to the whole. And you do that obviously usually for a limited time. You know, I don't know. Imagine a sin. In the series you have adultery as a good example. It's funny because in the series it's not presented it as a sin, but it is an all, for all intents and purposes, a sin. In the series when Mark sleeps with heli and the other heli. And then all of that is kind of happening because of the effects that it, it has. So think of someone who commits adultery, right? That person all of a sudden has a desire, has a kind of sub structure of thoughts and of desires and of intentions that sets itself up and cares more about it to realizing its own goals than the fullness of the person. And so cheating on your spouse and then that causing all kinds of chaos in the vertical alignment in the wholeness of the being. But you know, people do that all the time. People betray themselves. They do all these things where they. They really are severed. They forget themselves, you know. And think of the times, I don't know that you lie to impress someone. It's like what is happening in that moment you, you kind of forget your. The fullness of you. And you're willing to lie and to pretend something and to twist reality to get some little thing like to convince someone to do something or to, or to get some prestige or whatever it is that for the reason that you're lying. And that is already a form of severance. And you can think of it that happening in terms of mind and body as well, when you have kind of things popping up from below. Hunger, sexual desire, all of these things, these systems that are acting. And then there's a disconnect between what you are, your through line and your body, you know, and that you know that. How can you say that? That is also an image of the idea of severance. So before we go forward, I just want to make a little announcement. You know, we are preparing at the Symbolic World a symbolism masterclass which is really going to be the kind of culmination of all the videos that I've been doing, like the 500 videos that I put up on YouTube since I started this. I realized that people kind of drop in and out and they'll catch a video and sometimes they don't know where to start, like where how of this all comes together. So what we decided to do is put together a, you know, a. What is it? How many are we doing? We're doing like an 18 hour, six class thing where we're going to have two hours per class plus a whole hour of Q and A. Really engaging. So that we're going to go through all the concepts, it's going to be an introduction to symbolism, but not just an introduction, we're going to dive in and go into the deep concepts. And the purpose is that after this you can really kind of have mastered symbolic thought, you know, that you have everything you need and you can look at the world through the patterns, you know, and you won't feel like it's disjuncted. And so I'm really looking forward to doing this because for me to pulling all of this together, I think will be a really fun thing to do. So I hope to see you in that class. All right. And so in the context of severance, it's important to understand that the Audi, right, is that integrated one. Why? Because the Audi is the one that decides, the ID is the one that decides that the any exists. And the Audi is the one that can decide that the innie no longer exists. Right? Because if they don't go back to work, if they decide to, they can make that aspect of themselves cease to exist by just not by quitting or not going back to work. And so there's a sense in which it's not just like they're severed and they're equal. No, no, no. They're severed really in a hierarchical fashion where you have the whole being and then you have an aspect of the being which is broken and cut off and then made to live independently from the integrated being. And so the innie is like a prisoner of the decision of the Audi. But we'll see that because they're severed, that won't always go the way the way it is. You think about how this is the case in yourself. You have certain internal systems, like you have desires, for example, so you're in theory the whole being. You have the power, you have the desire. But if you're not careful and you let these little aspects of yourself become independent and be severed from the full being, that is when things run into trouble. And you really see that happening in the series. And so the. The can think of it as a kind of alienation, right? Where aspects of yourself are alienated from the fullness of you, but you can also see it as a social phenomena, of course, because the experience of the any is of course, to be alienated from any type of higher participation. So what's amazing about the series is that the severance happens at different levels simultaneously. So of course, the severance is within the person, and the hierarchy is presented within the person, but the severance is also within the organization. And so the severed workers are also, you know, just like in their own being, kind of these isolated little processes that function on their own and don't have any connection to the. The integrated thing. This is what's happening, of course, in Lumen itself, where the severed workers are analogous to what's happening in their own being. So the leaders of Luman, of course, are not severed. The people that are running the show are not severed. They know what's going on. They have a sense of everything that's happening, but the workers are isolated from that purpose, right? And they don't know what they're doing completely. And so the image is very powerful. You know, the. And the. The company itself is represented as this kind of contradiction of this severing. You could think of it that way. The. The name itself, Luman seems to refer to light, right? The idea of luminary, right? It refers to light. But their logo is a drop of water or a drop of something. So you have this weird image, almost like in the name of the name, which refers to something in heaven, but the logo which refers to the image of earth or the image of water that is below. And then you see that happening in all the aspects of the company. You know, their log, their. Their slogan is United in Severance, which is a kind of oxymoron. It's a contradiction. It's kind of funny because it reminds us of the pronunciation of a certain Canadian prime minister. The idea that we don't have any identity except for openness, that we. That it's. We only have diversity, right? Diversity is our identity. Diversity is our strength. Which is oddly similar to this idea of united in severance, right? It's like that. It's a. It's a contradiction. But then absurdity itself becomes a tool of severance, right? Because we don't know what things mean, you know, and the people that are there don't know what it is that they're doing in The. In the company. And. And so the geography of Lumen itself has kind of two shapes. It's vertical, right? Just like the idea, you could say, of the higher identity kind of being fragmented down into the lower identities. But the architecture of Lumen itself, they know there's an elevator that goes up and down, so the full worker, the Audi, comes at the top and then moves down into the basement where they are fragmented and where they are severed, they appear. And then we find out at the end of season two or in season two, that there's an even deeper level that's below the level that they are, where, for example, the character Gemma, who is Mark's wife, who thinks is dead, is not severed into two, but is actually severed into 25 sub personalities. You know, and then if you. There's like a horizontal aspect to the level, so there's like a vertical. You go down to be severed. But once you're in that level, then the level itself, you know, is like a maze, and it's like a puzzle. It's. It's forbidden to map the. The maze, right? It's for. It's forbidden to fully understand it. And you could say that in some ways, what they want is for you to not understand what it is that you're doing. And that's where, you know, the workers are doing all these tasks which seem completely absurd to themselves and to us, and they only know is mysterious and important, you know. And so this idea that there is some kind of vertical integration, but we don't know what it is, right? It's something like a factory worker. Think of how. How factory workers were described at the beginning of the. Of the modern age as being alienated. You know, alienated because of the separation between work and life, but also alienated because factory workers were just doing one little task and they didn't know what it is. They didn't have any participation in the fullness of the product they were doing. Sometimes factory workers don't even know what they're making. They're just making some plastic shape. They have no sense of the final product. And. And that is, of course, the image of this kind of absurdity of. Of fragmented and isolated tasks. And so from the larger frame, it's really fascinating because I don't think I've ever seen a series or a story where the absurdity of what you're noticing is entertaining. You know, because absurdity can be funny and entertaining, but it's also completely reasonable from the larger frame because we, the viewer, are meant to experience the severance ourselves, right? And so we're watching this and we're experiencing a kind of disconnection and confusion, right? But also wonder, right? Because the fragmentation or the lack of unity is also a kind of puzzle. You know, that's what a puzzle is. A puzzle is a bunch of stuff that doesn't have vertical integration, right? That doesn't have identity. And so that's why there's also. In the contemplation of the absurdity of. Of the show, there's also a kind of wonder, right? Like you're trying to. To figure out. Find the treasure. You're trying to figure out what is happening. And that's why the story in Severance is much better than that series Lost that came. Came out. What is it like around maybe 2002, I forget 2003, because loss tried to create a similar effect. Because the idea of being severed and being lost are very close in terms of the analogies, right? When you're lost means that you don't know where you are and you're severed from your final. Like your home and your final destination. And being severed is something like that in terms of. In terms of analogy. But what happened when you're watching Loss is that you realize that the writers were as lost as the people watching. And at some point, you know, it really. Everything was just going around in circle. You were just like. There was no way out of the maze. You could say there was no way to integrate. But in Severance, what's interesting is that the story itself offers the verticality all through the story, where there is a sense where you can perceive some of the vertical connection, whether it's in the characters themselves. And then it's more difficult to see it in Lumen, but we're kind of starting to see it. And so I think it makes the whole strategy of using this kind of absurdity way more effective. So the Innies, you know, they're. The social aspect of it, or let's say the. The corporate aspect of it, is that the Innis are representation of workers, or they're kind of like miners that are deep in a cave and they're looking for precious things that they won't benefit from, right? But at the same time, what's interesting is that they're also subject to. Of an experiment, right? And they're being acted upon by the. The hierarchy that they don't totally know. And so they really are like a rat going through the maze, you know, trying to get the cheese. But the. The rat going through their maze trying to get the cheese doesn't really know what the real purpose of the experiment is because that purpose is outside of the maze, right? That purpose is the person who designed the maze, who was looking at it from the outside. And the purpose is not to get the cheese, right? So the rat runs the maze over and over, over and over, over and over. And although they get the cheese, they'll never know why that they're running the. They're running the maze, you know, and that's why the imagery of the Office is so compelling. That character Dylan, for example, you know, it's interesting to see that he's motivated by these work perks. What is it? The watermelon party, the. These Chinese finger traps and pens and do doodads or whatever, little caricatures of himself and these like, petty privileges and then. But when we look at them from the outside, you know, having the whole story, these look completely ridiculous and completely kind of arbitrary and not, not, you know, not really very motivating until you realize, you know, that this is an image of or of our own non integrated, let's say, goals and perks, you know, the idea of getting a brand new car or a nice watch, you know, or all these other signs of prestige that, that really serve as very proximate goals. And if you were able to scale yourself up a little and see these, these kind of motivations that we have from a more integrated, you know, from the point of view of love or the point of view of, of, of the transcendentals, then you would realize that a lot of the stuff we chase after is pretty much the equivalent of what Dylan is chasing after in the office. And so the severance aspect of the story is represented at all levels in their work. Of course, like I said, not knowing what they're doing, not knowing where different things are, but also they're isolated from the other groups and they're put in these hostile competitions with other teams in, and those other teams are also performing these absurd tasks that we also don't know what they are. But there's a sense in which it really is this idea that hierarchy in this sense is evil. It's more like an evil empire that is ruling over these broken, fragmented tribes. And, you know, it's like the divide and conquer idea that if we keep these people away from each other, if we prevent them from joining together and becoming one, you know, that's the way that we will rule over them. So you really have this conjunction of tyranny and fragmentation that I've talked about in so Many videos, you know, opposed from the real way it works, which is the, the unity and the love, you know, that is how things are supposed to come together. So usually there's no competition between the levels of a. Of a hierarchy. You know, the, the love for your wife doesn't compete with your love for your state. That's the, that should be ridiculous, you know, and it's only when things are disordered that there appears to be competition between the different levels. And so of course, the problem though is that if you try to isolate parts from themselves and isolate parts from the whole, the vertical integration, then that will ultimately backfire, you know, because once the parts of something don't know why they're in the whole, then that's what's going to happen. They're going to compete with each other, they're going to compete with the whole. They're going to revolt, right? Think again of how sin functions, how, in fact, if you have actions in your life that don't know how they're connected to the full purpose of your being, now you have a problem because now they'll take your resources, they'll compete with other desires, other thoughts, and you'll have this fragmented psyche in you. And it's the same that happens in an organization, right? If you, if you have, I don't know, like a part of the police that aren't. Are isolated from the whole system and have created their little internal state. You know, a little bit like how when the CIA was dismantled, was it in the early 70s, this idea that it was said that they were a. A kind of internal state, like a state that has its own. Its own intentions that weren't aligned with the intentions of the full of the country. You know, there's a little bit of that happening with Doge right now where there's a sense that there are these corrupt organizations and corrupt agencies that are taking the resources of the fullness. But because they're isolated, then they become. They don't know how they connect, or they're not even trying to connect to the fullness of the story, then they're like parasites, right? And so that's the problem when you separate things and you don't have them united, is you can rule. You try to rule over them with a kind of tyranny, but that tyranny is always in danger of this, of the problem. So this is what's happening with all the severed characters in the story, because they've forgotten their outing, because they don't know their outie, right? They don't know, their wholeness, their interests begin to compete with the interests of the whole. There begins to be competition between the two, you know, and you see that happen in several of the characters, you know, in the characters of heli. Whereas literally they seem to hate each other and be jealous of each other. And the. You know, the. The innie is basically hates her Audi and the Audi is trying to. To. To infiltrate or to fully inhabit her. Her innie. I am a person. You are not. You know, all of that is like a kind of dysfunction of hierarchy. You see that. You know, of course, in the case of Dylan, who, you know, his. His fragmented part is like. Is falling in love with his wife and is kind of competing with his wife. All of that, all of these different aspects of it. And ultimately you see that in the final scene of. Of. Of of season two. And this is what I want to kind of look a little bit more at Mark, because Mark is the best example of all of this. And if you look at his story, you get a sense of how all this functions in the story. The origin of his severance is already a kind of severance. There's like a. There really is a fractal thing happening in terms of his being severed. And so in his severed state, he doesn't know that the absurd things that he's doing, this idea of, what is it? Macro, data refinement, if you think about what that is, it's interesting because he's taking something whole, the macro, and he's making it more particular, which is, you know, a little, again, a little microcosm of the whole story. And doing that is actually what is splintering and torturing the person that he loves, right? It's increasing the severance, which is the. Remember, the original cause of the severance is the severance in Mark's couple. That's the origin of the severance. And so that he's. In increasing the severance by doing the work of sorting these numbers in all these different boxes. What he's doing is he's increasing the severance and he is torturing his wife without knowing it, but he's torturing his wife and is fragmenting her, breaking her down into more and more absurd kind of iterations of human behavior. And this. This representation is pretty genius. You know, we find out that the night that she died, that Gemma was taken into Lumen and she was taken down to this lower level, right? This lower rung of hell. You could think of, if you think of this descent down the elevator as levels of hell, now makes a lot of sense to think of it that way. She different from the others. Her innie is also. Her Audi is also an innie that if she doesn't actually have an outside of the world, she's trapped in lumen. And both her innie and her Audi are now completely fragmented. And so she is really literally in hell. If the others are like. More like someone who's sinning, who doesn't have access to their full story, and they're kind of broken and fragmented, really. Gemma is in hell for uncharted purpose. She's being. She's being tortured. And this descent into idiosyncrasy and these little aspects of human behavior that are completely separated from each other, they just. They become a form of torture for her. So what happens is she's repeating the most mundane and idiosyncratic aspects of human life. We see a few of her innies, you know, she has 24, and then the 25th is being prepared whenever any. Like, goes to the dentist all the time. Basically just. Basically goes from one dent is constantly going in and out of the dental appointment. You know, can you imagine that to your life? Like, you just. You go to a dentist appointment, you leave, you come back right away, and you're constantly in the. In the dentist. It's like the one that's literally hell and the other one is someone who's like writing Christmas cards over and over and over and over nonstop. She has this huge pile of Christmas cards. That's all she does. That's all her existence is. And so, you know, I mean, so then you have this beautiful image, which is that Mark's Audi. When he finds out that she is still alive, though trapped in hell, he decides to go down in hell to save her and to bring her back into fullness and to integrate her. Not only integrate her to her own psyche, he also is trying to integrate his own psyche by integrating any Mark into Audi. Mark. But there's also a sense in which he will integrate with her, right? You know, and they'll recreate that union that was lost and was the source of the severance in the first place. And so the final image of fragmentation, interestingly enough, the last innie that's created by Mark's macrodata refinement is this room where Gemma has to disassemble the baby's crib, right? So now we have this full circle, like I said, which is she's going back to the trauma that started the whole severance, right, which is her incapacity to have children, her incapacity for Mark and her to kind of join into that higher form of unity. And interestingly enough, it's also a reminder of how Mark started his own reintegration, if you remember, by hosting a conversation with his. With himself and the innie, talking to his Audi through the video camera at the birthing cabin where he's in this. This cabin that's made for people, for severed people to be able to. To. To give birth. So interesting there. And so, but like, basically, this disassembling of the. Of the baby's crib is the final hell. It's the final deconstruction, right? And we're told that this final deconstruction will end Gemma's life. And it's there that Mark, you know, we could say for all intents and purposes, he's killed the Minotaur in the maze. And he arrives like the story of Orpheus who goes down into Hades to save his wife, Eurydice. But see, because Mark is severed and because Mark's inni doesn't know, doesn't remember the whole right, only truly knows his own fragmented experience, his own desires. So he chooses to stay in hell with his innie, who, interestingly enough, to stay in hell with his own innies, love, which is, strangely enough, his name, Helena. Like the woman that started the Trojan War, but also Heli. So interesting, right? She's Helena in the sense that she is the one that you save, but that leads to the war. You know, she's the one that you fight for, but she's the most beautiful. But also she is. Has. Her name is Heli, like hell itself, as if she is this image of. Of. Of Mark's existence in. In hell. And already you can see that in his experience with her, there's like an extra level of severance, you know, already in his experience, because one time he sleeps with her and it's actually the. The Helena from the Audi, Helena that's infiltrating the inside. And then the other time he sleeps with her, it's Helena's innie. But the thing is, right, is that. Because now there's a doubt. You never know. I mean, the whole time at the end, I kept asking myself, which heli is it? I don't even know. I mean, she says that she's not the one from the outside, but to be honest, like, I wouldn't be surprised if one of the reveals in the next season is that when he saves her at the end and he runs off with her, that it's Actually, you know, the Heli from the outside, maybe. I don't know. It's not, it's not, it's not, it's not. It's not clear, but probably not, because there's this weird scene with her father where her father says he sees the spirit of Kirin her. So probably in this, her case, you'll see a kind of inversion where her innie will become the Audi and the Audi will become the innie, basically that she'll. She'll be the only one, I think just prediction for the next seasons, she'll be the only one that'll be like freed from. Not integrated, but freed from the, The. The inside. We'll see. That's my prediction. So Mark decides to stay with Heli in hell. And she lets him, by the way. So the, the. And they, they both know that this is impossible when they do that. They both know that their time is up and that, you know, there's no way now that they can stay there together. It doesn't make any sense. It's completely absurd. And then he leaves Mark's Audi wife, you know, who after all this time, has found her husband. He leaves her screaming outside and alone. But you also totally understand the motivations of all the characters, you know, because Marx Inni isn't Marx howdy. And he is completely severed. And he doesn't see why he should act for the person that put him in hell. Like, why would you, why would you act to defend and to help the person that imprisoned you in this situation, right? An interesting thing related to all of this is that, and just to show how really strong the writing is, there's one scene that could be said to contain all of Mark's story in a single moment. And that's what makes it fascinating. There's a scene where Mark, before the severance, right, on the night that his wife died, he's sitting at his desk, he's working, and he's clearly already discouraged and kind of alienated by the fact that they can't have a child together, they can't have a family, right? That true image of one in many that I mentioned. And so he can't hear Gemma when Gemma tells him that she loves him, he's too busy working. And then when she repeats it, he answers kind of dismissively, oh, I love you too. But what he really means is, all right, it's time for you to go now. Basically kind of waiting for her to leave. And then what's interesting is that in that moment, right, there's the entire Story in seed form. The whole madness of severance and of this breakdown into absurdity is hidden there as a seed in that, that little, that little scene. And you know, it's funny because Gemma is like going to play charades, you know, she's already kind of going into the puzzle, she's kind of going into the maze and oh, there he's already lost her and he's already lost himself. So yeah, really well done. Another aspect worth mentioning is that because the hierarchy is presented as mostly negative, there's also a sense by which the vertical cells. Right, the Audi is kind of like baggage. You know, you could say that the Audi also represents a story that weighs too heavily upon them. And you can think about it like that's what motivated the creation of the Innie in the first place. You know, you could think of it as like an accumulation of sin. You see that of course, in the case of Bert, where they'd say that the reason why they created the inner the innie Bert was because the outer Bert had done these horrible things and when he dies he won't go to heaven. So let's create like a new little Bert, a little Inibert that might have a chance, that he might have a chance to go to heaven. So this weird idea that in some ways the severance is a way of reinventing yourself, of rediscovering some kind of innocence. And you can kind of think that, like we all have examples of that in our life. Think about like when you, if you move to a new city, you know, or if you, you find new friends or you start a new job or a new relationship and, and that is always an opportunity to, you could say, cut off the old and start anew and start a new story. And that's image in the Bible, of course, as crossing the sea, you know, going through the flood after a corrupt tyranny, like the Pharaoh has been abandoned and moving into a new world, you know, it's an image of baptism, you could say. And so that's an interesting aspect. But in the darker aspect of this same structure, there's a, there is a basic anti hierarchy thing which permeates the entire story. It's not surprising. It is a modern story, after all. And the Innies are portrayed as slaves who are called, and you kind of expect them and you know, that one day they will ultimately revolt against either their Audi or against Lumen, you know, and in this angle, you know, we see that there's a kind of atheist vision or reductionist vision at hand where Revolution is really the ideal. And that's why it seems to me that's why the religious aspect of the story or this kind of veneration of Kir and this kind of religion of Kir is how Kir is like portrayed in art and literature, all through the buildings, through these kind of memory, these kind of museums and places where they go to venerate Kir is really a kind of cynical control, what Marx called the opium of the mass, the masses. And, and in that sense, ritualization is presented all through the series. And it's kind of presented as a kind of false solemnity, you know, a kind of mechanical procedure, obsession with detail, kind of OCD type behavior. And we even discover, strangely enough, that there's a kind of cultish goat sacrifice aspect to the story. You know, we see that when Gem is about to be annihilated by the crib. And so this whole religious aspect is dark and kind of perverted and is not obviously not a positive imagery of what religion can be or what religion is. Ultimately, the entire structure of the story is kind of like agnostic structure in that sense, you know, where this idea that the leader, the archons of the world are twisted. You know, our reality is a kind of hell, it's a prison. You know, it's, it's a little bit of the idea of reincarnation, this idea of, of, you know, moving down into Maya, you know, going down into the cave where everything is, is kind of a flashy illusion and that it's not enlightened. And so at the same time, so like the way this is, is written is so surprising that sometimes I had the insight that it's kind of like a more successful version of the Matrix or a better written one, where you have this idea where that the workers, the enies, the one that are in the Matrix really, in this case are the batteries in a deeper way than in the Matrix. You know, they're, they're like the batteries. They provide the money, they provide the, the, the energy for the, those higher selves to continue to exist. But they're not integrated to the purposes and those identities. And so because of that, they want to be free, they want to compete, they want to revolt, and they want to escape the tyranny that comes from a lack of love and the lack of integration across the different levels of being. And so that is my. These are my thoughts on severance. I have to say I really enjoyed it. I don't watch a lot of things these days. It just takes up too much time but I'm really happy that I did and I hope that my insight was was useful to you and it helped you realize how this hierarchy of being functions and especially how it functions when it is not functioning when it is broken. So thanks everybody for your attention and I'll talk to you very soon. Bye Bye. If you enjoy these videos and podcasts, please go to the symbolicworld.com website and see how you can support what we're doing. There are multiple subscriber tiers with perks. There are apparel and books to purchase. So go to thesymbolicworld.com and thank you for your support."}
{"episode_id":"SW - #387 - 2025-04-16 - Severance - When Hierarchy Breaks Down","start":2571.47,"end":2632.51,"speaker":"Laura Diaz","text":"Tucson the Weight is Over Mediweight Loss they're officially open on North Oracle Road. That's right, no more counting down the days. You can walk in right now and start your journey to a healthier you. Hey, it's Laura Diaz from iheartradio and you can trust me. This isn't just another weight loss clinic. I know that because it's where I lost weight safely with real medical support. GLP1 medications. You can see them everywhere online right now. But the truth is your health shouldn't be a DIY project ordering these meds without the professional guidance. It can lead to dangerous mistakes, wrong doses, no oversight, and serious risks. At mediweightloss, I got the same medication but with a customized plan, weekly check ins, and a licensed physician guiding me every step of the way. And the cost? The same as those risky online options. Tucson, your moment is here. If you're ready to take control, feel better and lose weight the right way, Medi Weight Loss is ready for you. Walk in, get started and see real results. Call or visit mediweightloss.com to learn more and book your free consultation today. That's mediweightloss.com."}
{"episode_id":"SW - #387 - 2025-04-16 - Severance - When Hierarchy Breaks Down","start":2634.91,"end":2662.76,"speaker":"Jonathan Pageau","text":"And Doug Limu and I always tell you to customize your car insurance and save hundreds with Liberty Mutual. But now we want you to feel it. Cue the emu music. Limu Save yourself money me today. Increase your wealth, customize and save. We say that may have been too much feeling. Only pay for what you need at libertymutual. Com Liberty Liberty Liberty Liberty Savings Ferry Unwritten by Liberty Mutual Insurance Company Affiliates excludes Massachusetts."}
