{"episode_id":"SW - #187 - 2021-10-27 - The Fall of Loki (Into the Multiverse)","start":0.16,"end":940.57,"speaker":"Jonathan Pageau","text":"The last episode of Marvel's Loki took on a surprising, thoughtful look at the problem of opposites. Of course, the entire series was about the challenges and opportunities of two unlimited variability on one side and absolute control and linearity on the other. And this whole problem, of course, culminates into the last episode, but to my own surprise, was brought into an almost theological realm as the entire climax of the series became a play on on Adam and Eve in the Garden of Eden, facing the puzzle of the serpent. So we will explore the final episode and just the general tendency in both the MCU and DC to move towards this trope of the multiverse in their storytelling. Just a warning, this video will contain an infinite amount of spoilers by the this is Jonathan Pageau. Welcome to the symbolic world. The Loki series is, of course, one of the assets setting up Marvel's Phase four story layout, of which one of the major themes seems to be the exploration of the multiverse idea here. The Adam and Eve motif in the Loki series, which appears for all intents and purposes and at the genesis of this multiverse in the mcu, is certainly not something which is accidental. The multiverse idea, or the notion of an infinite variability on identities, is one which has been explored both by Marvel and DC in their comics long ago and even in some recent movies, for example, enter into the Spider Verse movie, for example. But this now takes an increasingly important role in in the social narrative, which is itself obsessed with difference and variation, and so is being taken to the next level in these franchises. So both Marvel and DC seem to be set on diving into this multiverse notion in their next slew of projects, though, creating this vision not only within their stories, where we discover the clashing of infinite universes, which contain infinite versions of every character or event, but also creating something like a meta version of this concept, in which all of the previous movie iterations of Batman or Spider man, for example, were simply a glimpse into this multiverse of variability all along. So Marvel is actually taking this one step even further. What they're doing is they're introducing this multiverse idea through a multitude of means and disconnected stories. First, we saw this as feints, actual feints, in the last Spider man movie, for example, or or in WandaVision. And now we see that as an explosion in Loki as this cosmic mistake in the next Spider man movie. And just as a basic question on variation in the recent what if series, so the Loki series presents its own take on the multiverse, starting first with the vision of a tyrannical and bureaucratic System of Control. The tva, or Time Variance Authority, watches the, quote, sacred timeline for breaks. The the breaks can happen anywhere and at any time, and so the TVA can travel to any point in time and any part of reality. These breaks are caused by variants, variants which spawn entirely new timelines and theoretically entirely distinct universes, which are rapidly pruned by the TVA in order to preserve the unity of the timeline, prevent chaos which would ultimately lead to a war, and between the different timelines as they one day become aware of each other through a character named he who Remains. That we'll look at a little later. So in the series, a variant of Loki is the main character at the outset, though like so many franchises these days, the spotlight and narrative arc will gradually shift to another variant of Loki, a female version named Sylvie. Usually these variants are pruned with their timelines, but these two Lokis, through their usual trickster characteristics, succeed in avoiding this. And ultimately they team up to find out what is at the source of the tva and with a plan to destroy it or maybe take over in the usual Loki style. Sylvie, interestingly enough, has been able to avoid detection from the TVA by hiding and living at the end of different worlds, at the edge of cataclysms where all will die. The two Lokis, even in the series, fall in love at some point, an event which is deemed extremely dangerous for the timeline, but also seems to us narcissistic and little more than unnatural. But we will later understand what this is about in the final episode of the series. So in this final episode, both the Lokis go to the very end of everything, the end of time and space, we could say, where all these prune variants are sent to be devoured by a cosmic void monster named Alioth. Passing this cosmic death, both Lokis find this medieval looking castle in which lives he who Remains. All of this is set up like a kind of ritual or initiation where they have to go past this monstrous guardian. And then, upon entering the castle, they are offered a test, something both Lokis would desperately want in exchange for them leaving. Though they remain untempted after that they meet he who Remains. And the first hint of a biblical reference is of course, that this character introduces himself to them while eating an apple. He takes both the Lokis up an elevator to his office at the very top of the highest tower. The top of the mountain, we could say, brings them into paradise. He who Remains, or the remainder we could call him, explains the story. In his own life on Earth, he became a kind of bridge between worlds, that is a variant of himself, was a scientist who discovered that there were infinite universes stacked like on each other, with infinite variants of everything that existed. The different variations of himself started to communicate with each other, at first helping each other, but because they were infinite versions of themselves in infinite universes, of course, some of these variations were dangerous and wanted only to conquer the other universes. This led to a multiverse war where entire realities began to attack each other. So this particular variant, the one in the Loki series, discovered a monster, a monster which was made from the very tears in reality. And this monster devoured time and space. And so it was weaponized by he who Remains to isolate a single continuous timeline and end the multiversal war. So it's first off, very interesting to see a few of the images that are being played out in this narrative. To begin with, he who Remains is already an interesting notion in himself, a kind of remainder of the process of history, an anomaly which does not fit into the story, who is somehow outside the story. And because of that, this remainder was able to bridge different realities, a kind of shapeshifter, and not a shapeshifter in his own person, but in the very possibility of his being being stretched out into infinite variation. So bridges are, of course, always in between spaces. They're always these remainders that are in between two identities and are very ambiguous. For on them can cross, of course, traitors and scholars, but also armies and weapons. The remainder, or the undefined, can both guard a treasure or devour you. And this is related to the numerous stories of monsters guarding treasures or mysteries of some sort. Now, of course, he who Remains is akin to the serpent in the Garden of Eden, both as he is presented in the story, but also in his role. For the serpent is also something like the remainder, that is this twisty shapeshifter which appears on the edge of a coherent identity, the reminder that any system is never perfect and fully contained. I mean, we often wonder why the serpent is in the garden in the first place, if this garden is supposed to be paradise. In Loki, this cosmic creature, Alioth, the void monster made from the tears in reality, is in many ways a version of this remainder as well an extension of he who Remains, similar to how the cosmic Leviathan in the Bible story is an extension of the serpent in the garden. And so he who Remains is both a kind of anomaly and a bridge between worlds, but ultimately becomes the tyrant over reality. We already see how he embodies two extremes in his own person. The two extremes of the Edge, we could call it so in disguise, he who Remains. He presents the two Lokis with a choice between two extreme. So it's not exactly good and evil, like in the Tree of the Knowledge of Good and Evil in the Genesis account, but it is very similar. He presents them with the option of stifling order or cataclysmic chaos. That is, either the two Lokis become the new tyrants and continue to maintain a single sacred time by killing all the variants, a timeline where all is already known and of course just playing itself out, or else they kill he who Remains and let the timeline split into infinite variation, which will ultimately lead to a multiverse war once again. And so this gambit, these opposites, can be seen through several positive and negative angles, which are actually explored in this final episode, not only through the Lokis, but also through through secondary characters like Mobius and Ravonna Renslayer. These opposites appear as free will versus fate and a kind of predestination, accepting a lie to preserve an institution versus exposing the truth and risking total chaos. In the case of the Lokis, it is important to understand how they become an image of Adam and Eve, because they are two sides of a single being, like Eve was taken from the side of Adam. And these two are also a male and female variation on loci. In this case, we can understand the conflict and love between them as a primordial situation, which also echoes the capacity of our own different parts as a single person. Your thoughts and your body, or your rational and your emotional side, however you want to frame it, your different parts, to be able to unite these different opposites and unite the fragmentations within you into one. So the serpent, of course, finds pleasure in dividing them, in making them believe that there are only two options, the two extremes of reality. Either absolute tyranny or anarchy and chaos. He pits them up against themselves as opposites, saying, for example, that Loki is one who cannot be trusted and Sylvie is one who cannot trust. And even in their exchanges, Loki presents himself as the one who wants to wait and reason things out, and Sylvie as the one who wants to act before the opportunity is gone. And so they are at an impasse. The impasse is of course, bound up in the dualism presented to them from the outset, the same duality we see in politics and popular discourse, this slavery to extremes and to irreducible opposites, which in the Christian terms is called the world of the Fall. This is the Manichean world of absolute inside, outside, male, female control, freedom and so many other opposites in which balance and middle road cannot exist. Now, of course, the solution to the problem is actually hidden in the story, not made explicit or detailed, but hinted at in the character of the Lokis. The solution to the opposites is something like faith and love. You see, if only they could surmount their own selves, their own idiosyncratic fears and desire, and rather trust each other. So the solution is to trust, but also to love. And not love in the kind of sentimental idea we have of it, but love in how these two variants of Loki could be united together into one without eliminating their variability. In this frame, the possible love between Loki and Sylvie no longer seems to be so weird and unnatural, but rather becomes an image of how unity and multiplicity can coexist without either eliminating variance and difference, or falling into a mire of chaos and conflict. So the solution to the problem posed by he who Remains is trust and love. But just like in the Garden of Eden, our protagonists rather fall into blaming, into mistrust and blinding desire. So, surprisingly enough, here as well, like in the Garden of Eden, it is the Eve character which consummates the act and murders he who Remains, sending the world into both an insane chaos of variance and a subjugation to the tyrannical variants of he who Remains. So the series, of course, ends on a cliffhanger where Loki has been forgotten by his friends and so is set back adrift in a world where he does not belong, a world that does not recognize him, a world where hope is lost. And so, in the end, despite all its faults, the Loki series presents an interesting play on the very ancient story of the Fall and its consequences as a pendulum swing between the extremes of tyranny and chaos, both in society and in our own cells. But in general, we need to be attentive to the multiverse story arc in these upcoming projects, as they will also engage in this duality. And it is difficult to know at this point if they will continue to promote anarchy, revolution and the supremacy of desire, as we have seen dominate in cultural production since at least the 1960s, or rather, if they will use this multiverse narrative as a call for safety, call for control and uniformity, a call to eject variants and scapegoats, reflecting the clear new direction in which our culture is appearing on our horizon at this very moment. Hopefully, they would be able to find that middle ground we all desire, but sadly, it might be too late for that at this time. So I hope you enjoyed our heavy metal variation on the symbolic world opening it was made by a band called Skies Turn Black. I hope you enjoyed this episode of the Symbolic World. The Symbolic World is based on a series of videos that you can find on my YouTube channel, Jonathan Pageau's YouTube channel. You can also get involved through There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description and so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course leaving a review on itunes. Everybody knows that's the best way to get the podcast out there to get it heard. And and if you want to get involved, you can also support the podcast financially going to www.thesymbolicworld.com support or else on Patreon the Pajeau videos as well and on subscribestar. All those links you can find on my website or in the show description. So thank you and I will see you soon."}
