{"episode_id":"SW - #019 - 2018-10-15 - New Media Pundits - The Ragtag Heroes of an Upside Down World","start":0.32,"end":72.28,"speaker":"Jonathan Pageau","text":"I'd like to welcome you to episode 19 of the Symbolic World podcast. In this episode, I will be playing for you a talk that I gave last year at the Students for Liberty organization in Vancouver, Canada. The event was organized with Jordan Peterson and Bret Weinstein and I, and I gave a talk on the new media pundits and how they are these ragtag heroes in an inverted world. And so at the end of the talk, we also did a Q and A which has become somewhat infamous for diving into the question of whether or not science is grounded in religion or whether or not science is the highest in the hierarchy of knowledge. And I will play that for you next week on the next episode of the podcast. But for now, please enjoy my discussion on the Inverted world. This is Jonathan Peugeot. Welcome to the Symbolic world."}
{"episode_id":"SW - #019 - 2018-10-15 - New Media Pundits - The Ragtag Heroes of an Upside Down World","start":82.98,"end":2799.76,"speaker":"Jonathan Pageau","text":"So, first of all, I'd like to thank Students for Liberty to invite me tonight. Well, actually it's this afternoon to just speak to you. Just a first question. Who actually knows has ever even heard of me in this room? Okay, that's like about maybe one quarter. So my thanks is because it came at an opportune time because I was getting a bit worried that like my little 15 minutes of fame were going to be spent on talking about Pepe the Frog. And so it's actually happy to be here. For those who don't know what that means, you'll get to understand that as my talk goes on, About a year ago, everybody saw what happened with what I guess would call the pronoun gate with Jordan Peterson. And before that, I was a pretty apolitical person just living my life. And I had met Jordan Peterson because I had heard some of his talks. And it was like a year before I'd heard some of his talks. And his ideas connected so much with mine that I was just excited by what he was saying. And I, and I got to know him and we, we became friends. And all of a sudden this thing hit. And here I was watching someone that I knew all of a sudden watching someone that was one of the most authentic and genuine people I had ever met, being dragged in the mud, being slandered, you know, being called a Nazi when he was, for the last 30 years of his life, he spent his time fighting the spirit that could lead someone to become a Nazi. And it was really mind blowing. And what it did is it opened my eyes all of a sudden and I started to see things. I guess you would say that I was red pilled, to use the word, that all you young whippersnappers use there. And all of a sudden I started to see the, the network of manipulation of ideas that was at least in some strands of the media. And I started to see how so many of the stories were ideologically driven. I mean, obviously I'd kind of seen that. Most people have kind of noticed that in the back of their mind, or noticed it, you know, in the periphery. But then I was being kind of thrust into it because someone I knew was actually going through the process of being dragged through this. And so what happened is during that crazy time, for some reason, Jordan asked me to do an interview on his channel. And so because in life I'm an icon carver, I'm someone who's interested in symbolism in general. That's what connected me with Jordan. I couldn't help but interpret what he was going through through the lens of symbolism. And so we did this video together called the Metaphysics of Pepe. And then, since then, it's been absolutely insane. Jordan is, is not his fault, but he dragged me down into this rabbit hole and I've just been kind of following through and doing what I can to speak forthrightly, let's say, and to say things, to notice what's happening and to talk about it. And so it became obvious to me that even the cbc, even like the big media organizations, they were in a very strange situation. But also in general, like this, the kind of mainstream media, you know, it was coming to a point where they would give you the news in two minute segments, you know, clickbait articles, and they would just draw the line real straight in a short article so that you knew exactly what to think, exactly how to see the world. And as all of this was going, and maybe through what Jordan was going through, I started to notice this whole crew of people coming out of Internet culture, this whole group of people. And then I was, you know, people were putting, are putting out these one hour, two hour, three hour podcasts and it was this, just this mirror reflection of the bait, you know, the clickbait two minute segment. And people were paying attention. People who are listening to, you know, the most listened to podcast in the world is three hours long. So the idea is what. So hopefully this talk I'm going to try to trace using images and stories, try to help you to understand how is it that we came to the spot where we're in right now, how it is that we have. Most people have this strange feeling that the world is upside down. How did that happen? How is it that people who are trying to say reasonable things Are being treated as if they're crazy, marginal, completely off the track thinkers. So as someone who's interested in symbols and in symbolism, I'm someone who's attentive to stories. I see patterns. I look for patterns in stories, and I look for patterns in how things emerge. And one of the reasons that made me want to get involved and to start to speak out and to become, I guess, socially involved Is because I started to see patterns, we could say patterns of the end of something. There are things that happen when something ends, whatever it is, Whether it's a human life, whether it's a friendship, whatever identity you can imagine. There are certain things that happen, and those things can be traced. You can see what that looks like, and they can be compared at different levels of manifestation. And so I know that saying that that way is very abstract. So what I'm gonna. I'm gonna try to give you an example of a world and show you how that works. And hopefully you'll be able to see what it looks like right now. And so when you're trying to give an example of a metaphysical structure, like, my rule of thumb is the best. The first thing you need, the first example you use is to use superheroes. It's like rule number one. So that's what I'm gonna do. I'm going to take you through the weird story of Superman and show you how that world develops and how it works and how it's an image of any world, really. So let's take this idea of Superman. First. Superhero. It's a great idea, right? Alien being comes to the earth from a destroyed world, has all these superpowers, becomes a hero, has a really nice, neat costume. And so very simple, basic idea. So I want you to imagine this idea as, let's say, a spark or a golden ball that's being dropped in a pond of water. It's an idea. You drop this golden ball into a pond of water. So it's like this idea Superman is dropped into the collective imagination. So what happens is there's these waves that start to grow out of that contact between that spark and the world. That spark and the pond. And the waves start to grow out of that contact, and the rings get bigger and bigger. So you put out a comic book every month for, like, 20 years. What do you do? Right? You take that basic idea and you expand it. Superman. What's superman? Oh, Superman. Is this. Okay. So he fights this big evil thing. He, you know, he protects us from this other thing, and then his relationships start to Develop. His relationships start to become more complex. But at some point, you run out ideas, right? I mean, there's so many things you can do. So that would be like, it's the end of the golden age of Superman. So what do you. What do you do? You eat the apple in the garden. You. Maybe because you're bored, right? You're bored. You know, you. You feel like you've seen it all. You need to see something more. And so you eat the apple, you become self conscious, and you find a way to stand up. And then look at this from the outside, to look at this idea from the outside, and you say, okay, well, so we have Superman. So what if Superman was a girl? So we'll have Supergirl. Then what if Superman was, like, a little boy? So you have Superboy. Then you keep going, and then all of a sudden you're like, what if Superman was a dog? And so it's like, yeah, we have super dog Crypto the superdog. And usually in any human process, by the time you reach dog, you're, like, scratching at the limit. Okay? You have to pull back. There's a reason why dogs are the guardians of hell. It's not arbitrary. So you have to pull back. But you don't. Maybe you can't. You don't know how. So you keep going. And then by the time you reach, like, Streaky the super cat, you're finished. And that's a real thing, by the way. Streaky the super catch. And then after a while, like, you have. You have, like, Superman had this, like, town of miniature Kryptonians in his, like, lair. And then he had this, like, huge army of, like, bad Kryptonians who were his enemies. And then he had, like, an army of robots which looked exactly like him, which were flying around the world and, like, saving the world, like, as much as he is. So it's like, you know, it's like the world is drowning in, like, Superman. At some point, Superman is, like, just one amongst all these super things, all these idiosyncrasies. And it comes to a point even where, like, all the superheroes are just the knockoffs of Superman, and they get more complex and more subtle. And then we look back and we see Superman and, like, how boring is he? Like, he's just so obvious, like, so straightforward and boring. There came came a time when even his superpowers became so, like, precise. He was a super ventriloquist. And then, like a. Like a. A super hypnotist. And he could, like, move planets and go Back in time and like, you know, go through dimensions and it's like, what the, what do you do? There's, there's nothing left to do. You have filled the Superman world to its limit. There's nothing left to do. And all these idiosyncrasies are there on the edge. And you have to think of it. I'm really describing a world. Do you guys know how in the Middle Ages they described the world? That's exactly how they describe the world. If you've ever seen a map of the world in the Middle Ages you had the center of the map, usually it was Jerusalem. And then all the continents would flow out of that center. And then on the edge of the world. What was on the edge of the world? All these idiosyncrasies, people with just one leg, people with heads in their chests and like all these monsters that were like absurd self referential things and idiosyncrasies that existed on, on the border of the world. And once you get to that end, there's not much left to do. But there is only one last thing that can happen when you reach the edge of a world. And that's the opposite. The end of an identity is its opposite. So what's the end of the Superman world? The end of the Superman world is Bizarro Superman. He's an upside down Superman. He does everything upside down. So everything Superman does, he's like a mirror reflection. And he's like the edge of the Superman world. And on the medieval map, at the edge of the world, there were the man eating monsters, the cannibals are on the edge of the world, or the upside down world, the world where the Amazons live, where the women are warriors and the men are barely there. And so that's, you know, there's a reason why we are where we are now. And Marx knew this, right? Marx, he knew, in identifying his story of emancipation, he knew that the end of emancipation is not equality. The end of emancipation of the classes is the tyranny of the proletariat. That's not the same thing. So if the end of Christianity is the Antichrist, if the end of Superman is bizarre. Superman, that's how the world works. And it's only after you've reached that upside downness, then things are finished and then the world has to reboot. So what do you do, what do you do when you get there? Well, let's look at the Superman story. What do you do? So imagine now again that ball that falls down into the water and makes these waves. As the waves go out, they become more and more and they begin to fragment and they begin to break apart, and then finally they dissolve. Okay, so what can you do? The only thing you can do is you dive back into the origin, you go down into the water, and you find that golden ball, that first spark, you pull it out of the water, and you start the cycle again. So in terms of marketing, we call that rebooting the franchise. And in terms of, let's say what Jordan Peterson says, he calls it going down into the water and saving your dead father from the belly of the whale. And that way you avert a total apocalypse. You restart with the origin, you create a new hierarchy based on the basic elements of what created that thing in the first place, whatever it is. Just using Superman as an example, you create a new hierarchy and you prune all the things which are too idiosyncratic, which are too odd and don't, you know, are too much on the margins, and you come back to something that. That brings it together. So a lot of you might think what I just described is weird because using stories, a lot of you more rational engineer types are going to struggle with what I just said. So I'm going to give you one last example of this process, but I'm going to give you one that is as technical as I could think of. Now, imagine you're in a large room, and there are 1 million buttons in your room. And your job is to sort the buttons, right? And your job is to sort the buttons between two bins. There's a green bin and there's a blue bin, and you have to sort the buttons. So you start. Start sorting the buttons. See a green button, put in the green bin. See a blue button, put it in the blue bin, you keep going. And once in a while you see a button that you're not quite sure, or you're not quite sure exactly where it goes, but it doesn't matter because you've got a million buttons to sort. So you just ignore it. You keep going, keep sorting the buttons. I don't know how long it would take you, probably years to sort the buttons. And then you keep going, and then you see another button that doesn't totally quite fit. And then maybe one time you see a red button, you're like, what exactly is that doing there? But no, I mean, it doesn't matter. You just keep going because you've got so many to sort. And at some point, you come to a time, let's say to a time where you have 1000 buttons and you can't sort them anymore. All of them don't fit. They're some kind of weird blue, green or green blue, or they're too dark or they're too light, or maybe they're just red or yellow. And you don't know what to do if you don't have a way to handle exceptions. If you don't have a category in your system, which is just exception, you're in serious trouble, because a thousand buttons is still a lot of buttons. And then those buttons are the ones that are screaming at you. Sort me out. So what do you do? Well, there's a few things you can do if you don't have a category called exception. One thing you might do is you might create 1000 bins for the 1000 buttons. One button per bin. That would be a nice way to do it. Maybe we need 100 bathrooms in every building and we'd be fine. Maybe you're such a crisis that now these 1000 buttons are screaming so loud that you start to question the very categories that you use to sort the 999,000 buttons. And you start to say, well, actually, maybe there actually isn't a difference between blue and green, because I've got a thousand buttons and they're neither. And then suddenly every idiosyncratic possibility, every exception, becomes this new reference, this new inverted center. And that's what's happening right now. We are at. I won't say it that way. Let's say that our civilization is running out of gas and we are seeing some very strange phenomena because of that. And what we're seeing is the last gasps, let's say, of the whole modern project of emancipation control that came through the West. And in your history classes, most of you, they will have not said emancipation control. They will have told you emancipation. Most history classes, even today, they will tell you that the whole modern project, from the Renaissance to the Enlightenment, all of that is just a series of emancipations where people are freeing themselves from the control of. Of the church, the aristocracy, and then, you know, the control of religion in general, et cetera, et cetera. But in fact, each of those emancipations has a shadow control to it. Each liberation was accompanied by an equal centralization of power. The humanism of the Renaissance brought about the beginning of realpolitik. In Machiavelli, those two things happened at the same time. The Reformation brought about the first nation states, the first borders. Those two things are just two sides of the same coin. The French Revolution brought the Emperor Napoleon and down the line, all the revolutions and tyrannies of the 20th century. And just now, finally, the Arab Spring that everybody told us. The Arab Spring, the Arab Spring, it's amazing. And I was sitting in my couch saying, you nutjobs, what do you think is going to happen? And then suddenly everybody doesn't understand why there's this attempt to create a new caliphate. It was right there. You should have seen it coming. It's always the same story. And now we've reached, you know, if that project of emancipation were a Pareto distribution, and now we all know because of Jordan Peterson, what a Pareto distribution is, if it was that we are reaching this point where it goes up, strikes up dramatically, we've reached the singularity of emancipation control because it's no longer just to be freed from the church, from the state, you know, from these social hierarchies, but the desire to be freed from offensive words and microaggressions, basically, to be freed from any ambiguity, not only in fact, but in intention. The desire to be free, not only from your violent words, but your violent thought thoughts towards me. And the last upside down contradiction which appears in this project is that we've seen this crazy upside down hierarchy of victimhood where the person who can accumulate the most minority, the most marginal identity, who can tell the most stories of being the victim, now becomes the victim, the unquestioned emperor of all. And this leads to its own upside down absolute authority, which legislates differences, which wants to reprogram your implicit thoughts to make sure that we bow down to this new hierarchy, not only in action, but in thought. You cannot get more extreme than that. And the Internet, that great promise of absolute freedom, right, that's what they told us. The Internet is going to be the most freedom that anybody has ever seen in the history of the world. And now we are finding out that from search to email to social media, it is also a system of control, where all your interactions are recorded forever, it seems, and can be searched through, through algorithms and bots in order to manage even your private relationships. We have no idea how far that will go. But when Zuckerberg is boasting about creating a mind reading social network, we should all be very afraid at how our systems of information, which promised us the greatest liberty in the history of humanity, is actually becoming a tool of ideological control, the likes of which humanity has never seen in its entire history. And I'm not saying that either emancipation or control are bad things, it's themselves. It's only when they are taken to their extremes. When they are seen in their extremes, it's only when the head of the serpent has reached its tail and the thing you wanted turns into the very thing it's very opposite. And you don't even realize that it's happening. And that's what we're seeing around us right now. You see one of the things that happens at the end of a process. When you reach the end of something, there's a fight between something being complete and something being coherent. That's the story of the buttons. That's what the story of the buttons is about. But it's also the story of, I don't know, drinking a nice craft beer. You drink your beer and then you come to the dregs. What do you do? Do you drink the dregs or do you not drink the dregs? If you don't drink the dregs, did you drink the beer? And if you do drink the dregs, well, you go through the bitterness. We're seeing that being played out. We've seen it already been played out in modern times. That is either a desire to arrive at a world where everything is ordered and all is logically structured. Purity and perfection, no exceptions. The margin is cut off. And that was Nazism. Or else we have a desire to create a world without margin, without hierarchy, where all are included and all are equal. No exceptions. And that was communism. And both ideas are absolutely murderous. Those two realities, the complete and the coherent, they're real ideals, right? In a way, they're the two basic poles of being and they just can't be brushed aside. But we're meant to live in the middle of those two opposites. We're meant to mediate the. Those two opposites. But when we see those two opposites rear their heads again in the world, well, it's just one more sign that the world is falling apart, falling apart and solidifying completely at the same time. And it's very odd, but I know that everybody here can get examples in their mind in a second of how those two things are happening at the same time. And the only solution, the only solution is to dive, is to dive into that dark place to find. To get that golden ball. Find the seed, the thing which both binds us together and opens up unto growth at the same time, which binds us together, but also opens up into variability and. And difference. So who. Who does that? Who can do that? Who can dive down into the waters and find that now there's a story of Gilgamesh and Enkidu Gilgamesh was the great Mesopotamian king of Uruk. And he was a tyrant in his own way. And his tyranny was only balanced out when he united himself like a brother to Enkidu. And Enkidu is the wild man. He's the savage, half beast, half monster. He came out of the forest to confront Gilgamesh in his abuses. And it's the union of those two opposites which creates a viable civilization. So one day, the king drops his ball and his mallet into the underworld. But it's not the king who goes to get it. Rather, it's the beast hybrid, Enkidu, who descends into death and finally returns after much travail and the help of the gods, with the ball. So it is the hybrid, it's the monster, it's the trickster who gets the ball. It's the thief Aladdin, who finds the lamp. Bilbo has to become a thief before he finds the Arkenstone in the cave of the dragon. You see the marginal trickster character, right? That character is the character that uses these limits, uses these ambiguous, idiosyncratic things. You know, he's a shape shifter. He changes shapes, he's disguised. He uses these in between spaces of the world to get what he wants. He uses inversion to reach his goals. But at the edge of the world, at the end of the world, when the world is already upside down, what is a trickster to do? Well, the only thing that the trickster can do is to restore the center, is to put the world back on its feet. When the Greeks made a bloody mess of the Trojan War and the whole thing is sealed with rape and infanticide and sacrilege, secret trickery. It is then, paradoxically, the trickster himself, Ulysses, who himself is the one who came up with the solution of the Trojan Horse to enter into Troy. It is that very trickster who is now able to go back home and restore order in his house in Ithaca. So we can see it in the stories. It's there in the stories. We notice the pattern. But it's difficult to know what that looks like in real life until you see it happening before your very eyes. And right now, we're seeing it happen before our very eyes. Everybody has noticed this strange group of pundits, we could call them, who are all coming up from the margin, quite literally, you know, from the margin. They're rising out of Internet culture and they are usurping television and mainstream media with, like, with guerrilla tactics and with searing laughter. And it's been really fascinating to Watch them come up. And what's strange is if you look at that group of people together, they're like, they're a seriously ragtag bunch of folks. If you look at them as a group, they're the type of people that would never, in a normal world, seen as together. And it's hilarious. Like, I never thought the end of the world would be so funny. So when you see, like, you know, like liberal, gay, married Dave Rubin spend an hour talking to evangelical conservative Steven Crowder, like, what is happening? You have orthodox Jew, you know, like argument assassin Ben Shapiro, who is on the podcast of like a weed smoking MMA fighter. And they talk for three hours and it's like, what is going on? And they're not fighting. They're actually having a civil discussion. What about Sargon of Akkada and Joe Rogan? Sargon is like, he's a glorified troll. He comes out of Gamergate and like, here he is on the most popular podcast in the world. And we're listening. Andy Ward, we're like, listening. And it's crazy. And, you know, and it's not just happening online in those strange media figures rising up. It's also happening in the public. It's like, strange, like, all of you, strange group of people. Like this strange group of people that somehow feel like they're on the same side for some reason. And in any normal world, they wouldn't be. Like, in what world does an evangelical pastor become all excited about a discussion between Jordan Peterson and Camille Paglia? Like, that doesn't seem like it should happen. Or like some Catholic college student comes up to you and he's talking about, you know, this, he's talking about the political commentary of a Satanist, like sticks and hammer 666. And you're like, this world should not exist. You just want to tilt your head in despair, but you, you can't because you're laughing too much. So even myself, I jumped into the fray. It seems I started making these YouTube videos this year on symbolism and how it connects to the modern world. And I mean, I'm an orthodox icon carver at the base. I mean, I spend half of my days literally in the Middle Ages. And you know who's supporting me on Patreon? Atheists. Like, what is happening? Like, I went, I was kind of browsing through the people who were supporting me on Patreon. And this one guy, he's supporting my channel and Gad Saad at the same time. Like, Gad Saad spends half of his waking hours making fun of religion. Like, how is that even possible? And the main, like, and the mainstream media, they have no idea what's happening. Like a bunch of headless chickens. They're running around. They don't even know that their heads have been chopped off. And they're running around and they're bumping into everything and just leveling their usual insults. And they have no shred of forethought to notice that the world is upside down. And they end up calling Jews Nazis, and then they end up calling gays homophobic. And they're like, calling people, you know, who themselves are or married to immigrants and minorities that you're xenophobic. It's absolutely mad. Like I said, you just can't. You can't. You just have to laugh. You can't stop laughing. So in trying to find the best archetypal story, let's say, to describe this process, like, how is it that this crazy, marginal group of people are coming together? Like, I had a few ideas. Like, the first idea that I thought of was the story of King David in the Bible. But in the story of King David, when David was the secret and hidden king, king, and no one knew that he was the king yet, you know, the actual King Saul became this tyrant and a very disturbed figure who was, like, trying to, like, raise dead people. Just very disturbing person. And he's trying to, you know, like, kill David with his lance. So David ended up hiding in a cave and he gathered this ragtag group of thieves and debtors, and he had this like, crazy band of guys. And then he sometimes even pretended that he was fighting for the other side. He pretended that he was fighting for the enemies of Israel while secretly he wasn't. So David was the first LARPer. But in the end, I mean, oh, David also, at some point, he acted. He acted like he was a crazy man. Then he's dancing naked, like just nutty stuff, you know. But at the end of the story, he restores the. The kingship and he restores the ark to Jerusalem. And from that time on, Jerusalem became the center and the, let's say, the focus point of the country until today. But of all the ancient stories, the best is Robin Hood. I mean, there are numerous versions of Robin Hood, but the basic thread is the same. So the true king, Richard the Lionheart is away, and his feckless brother, John Lackland has taken over. I mean, and John Lackland, he's a resentful guy. Like, he knows that he shouldn't be king. So who's seen the Disney version of Robin Hood, right? That's the best Prince John ever. The first snowflake, like he's sucking his thumb and calling for his mom. And in that story, the noble spirits, they have to become thieves and outliers. They have to disguise themselves. The sly man becomes the hero. Then they hide in the margins, they hide in the forest. And when you see them, they are this, like, ragtag bunch of peculiar characters, people who probably wouldn't have fit together in any other circumstance. You've got the enforcer, Little John, and you've got the clergy, Friar Tuck guy and Will Scarlet, and Will Scarlett is Milo, by the way. And these new media pundits, these people I'm telling you about that are coming up in the media, this new ragtag team, this new band of merry men, they have a laughter and a kind of brash boldness, which is the only answer when you're facing an offended lady who's clutching her pearls. How is it like, the left is offended all the time? I have this, this image of resetting the movie Footloose at Yale on Halloween and having, like, Kevin Bacon in a sombrero, like, trying to, like, loosen up the new Puritans. So what is it that unites this new group of pundits, like this ragtag team of merry men? What is it that they're carrying, coming, bringing out of the dark corners of the Internet and alternative media? Well, it's speech, of course. Freedom of speech, opposition to political correct tyranny. But in its best moment, it's also truth. A desire to work out what's true, even though it can be painful. At least willing to put out your arguments against your opponent in an honest debate or discussion and not try to shut down whoever disagrees with you. Now, since the last year, I've been kind of making videos and doing events with Jordan Peterson. And there are those who have characterized me as like the Jordan Peterson sidekick. And it's like, that's fine, there are worse things to be in life. But to be honest, there's a whole lot of things that I disagree with with Jordan. Like there's a whole lot of basic premises that we don't necessarily eye to eye. But there is a reason why, why I have aligned myself with his project, a reason why I aligned myself with him even before this crazy pronoun gate. And that is because he aligns speech and truth with purpose and virtue. And when you put those together, speech, truth, purpose and virtue, what you have is logos. Logos is the Greek word for word, logos. The word is the basis of the Western tradition. It means word, but it also implies truth and reason, reason in both ways that we use that word, like reason, as the purpose of something. Like the reason why he's wearing a crown is because he is king, but also reason in the sense of logic. You can see the word logos in the word logic. Logos in all its fullness, I believe, should be the rallying call of this new ragtag bunch of heroes. Now, you know Jacques Derrida, the famous postmodern critic, he saw that as the main crux of the West. He called it out. He said that the center of the west was logos, and he used that to decry the west as being logocentric. But he only saw the logos as this imposition of power, the imposition of a center of meaning through a kind of logic, violence on the margin. But we have to understand that logos, reason, purpose, is the reason why there's anything at all, is the marker of any identities, any object, anything has a center which holds it together. It could be a pen, it could be happiness, could be anything. It's what hold the multiplicities of those things into what makes you see it as one. That's the logos. And so logos is not only the center of meaning, but it's also the mediator of all these differences, the mediator of all the opposites. And so, as the mediator of these extremes, the mediator of the two poles, but also all that's in between. That's what's. It's what rallies what is fragmented and idiosyncratic into a common purpose and a common goal. But it's also what preserves multiplicity and variation within the horizon of that center. So, for example, like when Justin Trudeau says something like, diversity is our strength, we can see that he's only calling one side of the coin. He's calling for completeness without thinking of coherence. Diversity without unity is not strength. In fact, it is the very definition of weakness. And the call to unbounded diversity is an invitation to the other extreme, the pendulum. Those two things coexist. It's a call to the other extreme to manifest itself, extreme coherence and purity. And what was it that they said in Charlottesville? Blood and soil. You will not replace us. And unity without diversity is also not strength. It is brittle, and eventually it shatters. None of this is helping. So my call is that true logo centrism. What Derrida derided is diversity in unity. It's the need to bow our idiosyncrasies to the common person to a common good, and also know that that common good will not swallow all of our particularities into absolute conformity. Logocentrism is balance. I even dare to go as far to say that logocentrism is love. And that's why I think that as this new media uprising, these new media pundits continue to flourish, all of those that rally around them commit themselves to speech, to truth, but also to purpose and virtue. I think that logocentrism is the best name for that. And it's the best name, first of all, because to use that name will annoy the hell out of postmodernists. It will drive them absolutely insane. And we can have just a bit more laughter, let's say a few more waves of that. But also plunging into the waters in the strange hybrid amphibious forms that we've all taken, finding that golden path, finding the truth, the purpose of our lives, of our families, and walking on that path of logos, we will become upright, forthright and active participants in our own lives and in our own, our community and in our country, and whatever it is that can rally that rallies us together. And I believe that that's the the only way to get out of this mess. So thank you if you enjoyed this."}
{"episode_id":"SW - #019 - 2018-10-15 - New Media Pundits - The Ragtag Heroes of an Upside Down World","start":2799.76,"end":2805.08,"speaker":"Jonathan Pageau","text":"Content and our exploration of symbolism. Get involved. I love to read your comments in the comments section below."}
{"episode_id":"SW - #019 - 2018-10-15 - New Media Pundits - The Ragtag Heroes of an Upside Down World","start":2805.56,"end":2807.36,"speaker":"Jonathan Pageau","text":"Please go ahead and share this on."}
{"episode_id":"SW - #019 - 2018-10-15 - New Media Pundits - The Ragtag Heroes of an Upside Down World","start":2807.36,"end":2815.48,"speaker":"Jonathan Pageau","text":"Social media to all your friends. And also please consider supporting us financially on Patreon. You'll find the link to the Patreon page in the description below."}
