{"episode_id":"SW - #325 - 2024-02-02 - JP Marceau - Recovering the Metaphysics of Symbolism","start":0.08,"end":46.38,"speaker":"Jp Marceau","text":"So I had this love for still the physical, especially physical science that I was trying to use in my studies. I was talking with you to try to get more into the symbolic worldview. I was also talking with John Verci about the cognitive science side and also in general he was great on the physics side. And I was always trying to bridge mainly between you and John. I would say it took several years. I would often like run arguments by you and by him and try to see if I can make something through this. I developed, I think pretty carefully a path from materialism all the way to the symbolic world and even up to the more, let's say, esoteric debates in symbolism, like how is it exactly that the world exists in. In Christ and how is it that the world exists through human consciousness? And like all of these more esoteric kind of questions."}
{"episode_id":"SW - #325 - 2024-02-02 - JP Marceau - Recovering the Metaphysics of Symbolism","start":57.82,"end":58.94,"speaker":"Jonathan Pageau","text":"This is Jonathan Pet."}
{"episode_id":"SW - #325 - 2024-02-02 - JP Marceau - Recovering the Metaphysics of Symbolism","start":59.16,"end":61.48,"speaker":"Jp Marceau","text":"Hello. Welcome to the symbolic world."}
{"episode_id":"SW - #325 - 2024-02-02 - JP Marceau - Recovering the Metaphysics of Symbolism","start":72.12,"end":150.82,"speaker":"Jonathan Pageau","text":"So hello everyone. I am very happy to be here with JP Marceau. JP for those who have followed the channel for a very long time. You've seen him on the channel for years. He was the editor of the Symbolic World blog. He's really been a partner in kind of developing a lot of the symbolic world ideas. And we're going to launch a course where he's going to be giving a class called the Metaphysics of Symbolism where we're going to look at the relationship between metaphysical ideas and the symbolic world as we kind of present it. And also his take on it. I'll be part of it to some extent. He'll be doing part of it alone. And we're also announcing that we are going to publish a book on the same subject by JP and so I'm really happy to see all this coming together. He's just been such a great help all this time to help me think through because he has such clear thinking, more than I do. I get kind of. He has a very kind of clear thinking. We've been doing a French podcast for years now that you can Also find on YouTube. If you just write Jonathan Peugeot Francais French, you can find the, you can find the podcast and we'll put a link in the description. So jp, it's good to, to. To see you and I thought maybe we could start with you telling people a little bit how you came to this, you know, what, what your. What your story is. Because it's pretty interesting."}
{"episode_id":"SW - #325 - 2024-02-02 - JP Marceau - Recovering the Metaphysics of Symbolism","start":151.14,"end":439.28,"speaker":"Jp Marceau","text":"Yeah, for sure. Thanks. I never told it on your channel. Basic background was really into science during my teenage years. I had been raised Catholic in, in Quebec. Classic practicing family but when I was a teenager, drifted away from the faith, mentioned science as one of the. The excuses, let's say, to make my parents stop bringing me to church. But I was still interested by questions of meaning. I think these questions pop up naturally if you push, let's say, the scientific worldview far enough. I was just not very impressed by the philosophy that I had seen when I was younger, let's say, in high school or CEP that we have here in Quebec. So I decided to study math and computer science in university because I was mainly interested in mathematical logic and theoretical computer science. There's all kinds of cool theorems you can prove about certain formal systems. What they can and cannot prove gives you sort of an idea of how far you can push knowledge in some areas. So anyway, I was really interested by that. But I think like many people with this basic scientific education, what I ended up sort of inheriting as a side effect was a materialistic, traditionistic worldview where I guess you spend so many hours, like trying to do problems where you reduce things to their constituent bits that at some point it sort of became normal for me to just see the world as particles moving about and even people. It was hard for me to see people as something else than just complex sets of particles that evolved randomly through natural selection, to have complex behaviors, but fundamentally it's just reducible to particles. And yeah, I just had this basic kind of worldview where it was hard to find meaning in my ontology and also epistemologically in terms of what we can know. I was really drawn to mathematics because it seemed like you can have sure knowledge of things in mathematics. That wasn't the case where that wasn't the case for the philosophy courses I had before. Mostly people were just doubting everything in philosophy. That's what I thought back then. But at least in math I could prove stuff. So maybe it's not obvious how I can talk about meaningful topics in mathematics, but at least we seem to be going somewhere because, like, we seem certain of what we're doing. But even then in mathematical logic, I tried to take as many courses as I could early on to see the proof of Godel's incompleteness theorems. And now when I saw the proof, I saw that, well, I guess even in math you can't be that sure of what you're doing. I had heard about Godel's famous theorem that no formal system that is coherent will be complete. And I had heard about it. But typically when you have these really cool sounding theorems in Math or physics, when you actually get to them and you see all the postulates that are required for them, they're actually not that cool. But in that case, that was true. It was really as devastating as it sounds. So what ended up happening is, okay, I had this worldview where I saw everyone as just bits of matter, where it was hard to find meaning in that. And my knowledge, like my access to knowledge in the world that used to be mediated by mathematics, even that was destroyed by Godel's theorem. So I was a bit. A bit adrift. Like, is anything worth doing, really? I wasn't doing that bad. It sounds more depressing than it was. It just was great. But I thought, if everything is meaningless anyway, I might as well think about it to make sure that I'm not screwing this up somehow. So I decided to do a master's in the philosophy, especially about reductionism, to try to see if something was wrong with my worldview. Is reductionism wrong? And can we talk about meaning and good and evil somehow? Can we recover that? I had no expectation at all that it would work, but I thought, well, if everything is meaningless anyway, as might as well try. Well, there's literally nothing to lose. So during the course of my master's, Jordan Peterson popped up onto the scene. And as soon as I heard him talk about meaning and good and evil in terms that I hadn't heard before, I decided to look into it. And through that I also stumbled upon you. I think I started. I think I started contributing to your Patreon as soon as."}
{"episode_id":"SW - #325 - 2024-02-02 - JP Marceau - Recovering the Metaphysics of Symbolism","start":439.44,"end":443.04,"speaker":"Jonathan Pageau","text":"Right away. You were one of the first people that supported me."}
{"episode_id":"SW - #325 - 2024-02-02 - JP Marceau - Recovering the Metaphysics of Symbolism","start":443.04,"end":463.49,"speaker":"Jp Marceau","text":"Yeah, that's crazy, because I knew you were doing something interesting and I wanted to talk to you because I didn't really understand what you and Jordan were doing, to be honest. But I wanted some kind of access to try to dive into it. And I had lots of time because I was doing my master's in something related. And one of the first things we talked about was zombies, because you were having you."}
{"episode_id":"SW - #325 - 2024-02-02 - JP Marceau - Recovering the Metaphysics of Symbolism","start":463.49,"end":466.85,"speaker":"Jonathan Pageau","text":"It was an existential question for you. It wasn't just a theoretical question."}
{"episode_id":"SW - #325 - 2024-02-02 - JP Marceau - Recovering the Metaphysics of Symbolism","start":467.25,"end":676.95,"speaker":"Jp Marceau","text":"Yeah, exactly. I think, I wonder how common of a thing that is. Like, obviously it's present in the common imagination because there's lots of zombie movies and books and so on. But basically, if I think back about this period of my life, while I was studying abstractly nihilism and materialism, during the day in my studies, I would spend like all night long exploring the same topics, symbolically having zombie nightmares. So, like, for literally, like all night Every night for about a year, I had, like, zombie nightmares. It. It's. It again sounds worse than it is. Like, actually, what ended up happening after a while is I sort of figured out what was, like, going on. Like, because initially if you just wake up every time you have such a nightmare, like, you'll never sleep. So at some point I sort of understood that it was just like. And just yet another zombie nightmare. So, like, even if I would get eaten or someone, I wouldn't actually wake up. I would just, like, I knew that I would just start another dream, but it never stopped. So, like, there's just this endless cycle of zombie nightmares. But I ended up getting rid of my zombie problem in part thanks to you and John Vervaeke. It was really a series of steps. First in my studies, I was looking at specifically arguments against materialism and trying to find alternative ways of framing the world. At that stage, specifically, I had seen enough arguments against materialism in philosophy that I could drop materialism and adopt pet psychism. At the time, I felt that was a nice, easy bridge to make. And then from there started to dive into some. And, yeah, what I should say is as soon as I did that, the zombie nightmares started to go away. Like, they were cut down. I don't know, 50, 90%. To a good extent, they started to go away. I still had them, but it was less frequent. And then next step was diving into a little bit of classical metaphysics, especially with regards to virtue ethics. Okay, if there isn't just matter in the world, if people aren't just particles following blind laws, is there like, also some kind of good and evil that we can talk about? It's not immediate. Just because you're not a materialist doesn't mean that you'll necessarily have an ontology that allows you to speak about good and evil. But through classical philosophy, I was able to find good arguments for that. Things you can find in Plato and Aristotle, but also new arguments coming from cognitive science. Some of the things that John Vervicki and Jordan and you talk about. So. So a big thing for me was realizing that in general, perception is something that we practice. And it's not just our moral perceptions that we need to practice and improve. It's just our perception of everything. It's something that we know from developing infants. Initially, infants can't really see. It's something they really have to practice. And when you know that this happens in infants, you can start to pick that up also in yourself. An example I always come back to is Brazilian Jiu jitsu or like, any complex sport, really. Like, if you look at it initially, you won't see anything. Like, you'll just see chaos, basically. Like, you know, okay, at the beginning of the fight, two people, like, are standing up, and at the end, there is one person that's obviously losing and is snapping out. But you don't see really what happened in between. You don't have the perception to make out the pattern from the multiplicity of moves going on."}
{"episode_id":"SW - #325 - 2024-02-02 - JP Marceau - Recovering the Metaphysics of Symbolism","start":677.19,"end":697.83,"speaker":"Jonathan Pageau","text":"I've literally had that experience that we talked about it where I'm watching a match and then all of a sudden the people that are there are cheering, and I'm like, what am I? There's not. There's nothing happening. I don't see what's happening. Like, they know that now the person is in the right position to do this or that, but I have no idea. I'm just looking. And then, like you said, at some point, one guy loses, and I'm like, what the hell just happened? I don't know what I. What. I would just watch."}
{"episode_id":"SW - #325 - 2024-02-02 - JP Marceau - Recovering the Metaphysics of Symbolism","start":699.03,"end":793.56,"speaker":"Jp Marceau","text":"And. But. But if you practice the sport and you discuss it with others, and you also, like, have a habit of watching it, eventually you start up the patterns, like a child do is learning to see objects. You learn to see moves in jiu jitsu. And the same thing happens with more abstract truths as well. That's basically what happens with, I think, moral truths. There's even this good theory, I think, by Jonathan Ait and a few of his colleagues about moral foundations theory. He says that it's kind of like with visual perception, let's say there's all kinds of photons hitting our eyes. There's all this multiplicity. But it takes time for us to turn that multiplicity into coherent patterns to make out the world. In the same way, we seem to have basic moral intuitions that we use to make up more complex moral judgments. Like, we have disgust. That is a very basic emotion that protects us from pathogens and dangerous substances in general. But it's also a moral emotion that we end up exacting to reject certain injustices or, let's say, ideas that are also pathogens for our tribe and this kind of stuff. So I think there's good theory where you can see how there's these basic senses that we have to perceive initially, just chaotic multiplicity in the moral realm. But as we grow up and we try to practice our moral perceptions, we end up being able to perceive more and more complex patterns."}
{"episode_id":"SW - #325 - 2024-02-02 - JP Marceau - Recovering the Metaphysics of Symbolism","start":794.71,"end":818.47,"speaker":"Jonathan Pageau","text":"But it's important to say just. Just as you as you go through this, that understand that what's important to understand in what you said is that it makes the analogies real. That when we use the analogy, for example, if we say, you know, that. That this person is a parasite on the system, that the analogy between. And even the mechanism by which we recognize a parasite, let's say, coming towards something dirty, something that."}
{"episode_id":"SW - #325 - 2024-02-02 - JP Marceau - Recovering the Metaphysics of Symbolism","start":818.47,"end":818.95,"speaker":"Jp Marceau","text":"That is."}
{"episode_id":"SW - #325 - 2024-02-02 - JP Marceau - Recovering the Metaphysics of Symbolism","start":818.95,"end":825.55,"speaker":"Jonathan Pageau","text":"That is dangerous physically, is the same mechanism that we use to then see the moral or societal parasite."}
{"episode_id":"SW - #325 - 2024-02-02 - JP Marceau - Recovering the Metaphysics of Symbolism","start":827.23,"end":937.79,"speaker":"Jp Marceau","text":"Yeah. And also having this continuum of. When you understand that perception is something you need to practice not just in morality, but also even just to perceive very basic objects, it makes it really hard to reject moral realism on the basis of varieties between different nations or groups or tribes. For instance, because if you were to look also at developing infants, like, they also can't really see the world. Like, they're. They're very confused. It takes a long time for them to be able to perceive, like, faces and objects and pick things up and, like, it's something we need to practice. The same way that if, like, you're just starting to do jiu jitsu, you won't perceive what's happening yet, you'll be confused. And it's going to take longer for you to perceive jujitsu moves than to perceive, like, basic objects when you're an infant. Like, in the same way, it's going to take, like, all of your life to improve your moral perception. And still then, like, you probably won't be able to see everything perfectly unless you become a saint. So it's not surprising that different cultures disagree about, like, how they perceive morality. It just like. So these kinds of ideas were able to destroy my moral relativism. And immediately when that happened, my zombie nightmares were again cut down by like, 50 or 60 or 90%. So at that point, I was starting to have, like, way less zombie nightmares. I still add some, but, like, it was very manageable. I honestly thought it would just stay like this forever. But because I was supporting you on Patreon, we had, like, these regular chats and we became friends. And at some point I asked you, like, what would you do? Like, if. If you were in my position where, like, okay, you were having a zombie nightmare right now, like, you're the. You're the main character in a zombie story. Let's see, what do you do? Like, what's the. What's the solution? How can I get out of this? And we ended up working through it together."}
{"episode_id":"SW - #325 - 2024-02-02 - JP Marceau - Recovering the Metaphysics of Symbolism","start":938.83,"end":940.51,"speaker":"Jonathan Pageau","text":"Do you remember what the solution was?"}
{"episode_id":"SW - #325 - 2024-02-02 - JP Marceau - Recovering the Metaphysics of Symbolism","start":940.59,"end":1029.18,"speaker":"Jp Marceau","text":"You don't remember? Yeah, I Remember what it was. Actually, we also further improved it, I think two, three years ago on the French podcast. But the initial solution was it took us a few iterations to figure something out, but the basic idea we came up with was to do what Jesus would do, because, like, zombies are. You've talked about this on your channel before, but zombies are a parody of the Christian resurrection. They're really a parody of the. The Christian worldview, specifically the Christian apocalypse. Because zombies come back to life, but they don't have this glorious body. They just have this decaying body. They are all together, but rather than being in communion, they just, like, follow their impulses in the same direction. They look, let's say unique and special, but it's only superficial, really. The only, like, all want to eat is the same thing. They eat brains because it's the last remnant of meaning in a materialistic universe. They're trying to destroy the only thing that doesn't fit quite right in the materialistic worldview. Like, even if they try to deny it. So anyways, there's all these parallels between zombies and Christianity where zombies are trying to basically destroy the ancient meaning systems. And there's also the key, I think, in Jesus's story against this again."}
{"episode_id":"SW - #325 - 2024-02-02 - JP Marceau - Recovering the Metaphysics of Symbolism","start":1031.18,"end":1031.58,"speaker":"Jonathan Pageau","text":"To."}
{"episode_id":"SW - #325 - 2024-02-02 - JP Marceau - Recovering the Metaphysics of Symbolism","start":1032.22,"end":1134.6,"speaker":"Jp Marceau","text":"Trample down death by death. So Jesus, even today, like in the Eucharist, he lets us eat him, but doing that, he actually eats us the same way that He. He let us kill him 2000 years ago in a way that would bring us into his story to make us saints. So there's this key inside of Christ's story. And we could go deeper into many details. Like what we do, especially during the Eucharistic liturgy, is the exact antidote to the demeaning crisis and the zombie crisis. Because zombies, they just groan. They can't make sounds. But we sing when we're in the church. Zombies just like, jumble up to eat stuff and destroy stuff, thinking only about themselves. But we're in church, we're praying for one another. We're being thankful towards the same thing rather than just consuming everything for ourselves. So there's all these parallels you can make to see how Christianity is the specifically participating in liturgy is the solution to the zombie problem. And what we came up with was, okay, then what you would need to do is like, somehow let yourself be eaten by zombies. Like, you would have to do something like spiritual. Find some way in your zombie universe to become a saint, and then you let yourself be eaten by zombies to save even the zombies. And when we worked through that, then My nightmares disappeared. I never had one since then. The only times I add some after were when I would explicitly be trying to write about my experiences for others. But I never had this again for myself. The. The dreams just went away."}
{"episode_id":"SW - #325 - 2024-02-02 - JP Marceau - Recovering the Metaphysics of Symbolism","start":1134.76,"end":1143.92,"speaker":"Jonathan Pageau","text":"Yeah. And what's crazy about that is that we kind of. We did came up with this, like a story, almost like a narrative about the idea of a."}
{"episode_id":"SW - #325 - 2024-02-02 - JP Marceau - Recovering the Metaphysics of Symbolism","start":1143.92,"end":1144.24,"speaker":"Jp Marceau","text":"A."}
{"episode_id":"SW - #325 - 2024-02-02 - JP Marceau - Recovering the Metaphysics of Symbolism","start":1144.24,"end":1181.21,"speaker":"Jonathan Pageau","text":"A saint, like. Like that. That get. That remain that lets himself be eaten and then wakes up truly, let's say resurrects. Truly doesn't come back as a zombie, but comes back as a. As a kind of glorious being in the zombie story. And it's weird because it seems like that's a story that should exist, like somebody should write it, you know, that the idea. Because I don't think that exists. The idea of a zombie that wakes up from his state and. And retrieves, you know, a kind of. Even a. A better level of consciousness that they had before. So, you know, it's out there, folks. Whoever does it. You know, if you don't do it, I'll. At some point I'll write it myself. Just because that story has to exist."}
{"episode_id":"SW - #325 - 2024-02-02 - JP Marceau - Recovering the Metaphysics of Symbolism","start":1182,"end":1287.24,"speaker":"Jp Marceau","text":"Yeah. I think the closest I've seen is Warm Bodies. It was made into a movie, but there was also a book from futures ago. But the zombie doesn't come back to a glorious body. Let's say it comes back to the like, same kind of existence. And there's like, interesting, I think I say, facets of the Christian story you can see in that movie and especially in the book. Like in the book, there's almost a baptism scene. At some point, the zombie, he's starting to wake up basically out of love for one girl because he ate the brains of his boyfriend. But he ends up slowly developing feelings towards that girl. And he saves her, spends time with her. And through this attraction, he becomes more and more human. But at some point, he has to make a kind of confession. And there's a kind of baptism scene in front of a church when it's raining. And he's washing his mouth from blood because he just ate someone, but he didn't want to. Anyway. There's this progression and the zombie ultimately. Spoiler alert. Shut. Shut this down if you don't want to read the book or watch the film. But at the end, the zombie comes back to normal human life by sacrificing himself for that girl. So he has to basically wrap himself around her as they're getting shot. And he has to drop in a building, I think, and he's thinking he's going to die during that, but eventually drops in a pool. So again, there's this water baptism thing. And then when he comes back, like, he sees that he's bleeding, so he's become human again. So, like, you can see glimmers, I think, in popular culture of this solution. But as you said, I don't think anyone has come up with the full narrative arc so far."}
{"episode_id":"SW - #325 - 2024-02-02 - JP Marceau - Recovering the Metaphysics of Symbolism","start":1287.4,"end":1304.12,"speaker":"Jonathan Pageau","text":"Yeah, yeah, yeah. Well, that's part of the. That part of what's coming over the hill, let's say, on storytelling. You know, it seems like it's a perfect story to tell. So, so basically that was the. That is kind of what healed you. But that also kind of. That involved going back to church. It involved getting married. Like, your whole life changed, really."}
{"episode_id":"SW - #325 - 2024-02-02 - JP Marceau - Recovering the Metaphysics of Symbolism","start":1304.75,"end":1376.81,"speaker":"Jp Marceau","text":"Yeah, yeah, yeah, yeah. I think as soon. As soon as I worked out the, let's say, moral layer, as soon as I could see that, okay, I have a metaphysics where it's starting to be possible to talk about good and evil. Then I started going back to church. I was brought up Catholic. I had done my sacraments when I was a child. So I just came back and eventually, like, found a really good parish here. There's sort of this blessing in disguise that we have here. Like, in Quebec, the church collapsed so much that the people who are left are actually, like, really trying to do it for the right reasons and, like, it becomes really clear examples of what to follow. So found a really great parish here, pretty quickly got involved with different groups. That really helped me found the woman that I married and now that I have a son with. And yeah, as you said, this intellectual path really followed also a concrete, embodied path in a community that I was lucky to find. So, yeah, this big path of transformation and no more zombie nightmares, no more nihilism."}
{"episode_id":"SW - #325 - 2024-02-02 - JP Marceau - Recovering the Metaphysics of Symbolism","start":1378.41,"end":1442.74,"speaker":"Jonathan Pageau","text":"And so that has helped you in some ways, because one of the things that I've been impressed by you is that the fact that you really have studied philosophy quite a bit and you've talked about a lot with John Ri, with several people that are in this. In this sphere. And so you've been able to talk about symbolism in a more technical way, using more philosophical language. And that is what the book is going to be. And that in some ways is what the class is going to be to help people have more precise language or even a language that is closer to the ones that you'll hear in university and stuff. Because both Matir and I, Matthieu, developed really his own language, which is very powerful and beautiful. But I also recognize that some people, when they try to explain it to their friends in school, they struggle to find the way to link it. And I have the same problem. People accuse me of being imprecise, of not using the right words and not knowing the right words. And so I'm really happy to see this as a possibility to help bolster the case. So maybe you can tell us a bit about what the thesis is and what it is you're hoping to accomplish with it."}
{"episode_id":"SW - #325 - 2024-02-02 - JP Marceau - Recovering the Metaphysics of Symbolism","start":1443.46,"end":1511.75,"speaker":"Jp Marceau","text":"Yeah, so I'm trying to aim the book specifically for people who were sort of in the position where I was 10 years ago, where you're in the course of an education focused on science and you're developing this sort of materialism as a result, and you're wondering if there's another solution. And for, I think, people of this kind of character, the arguments as they're sometimes presented will be a bit too fast. Like, phenomenology didn't work for me. Like, either it wouldn't click or I would sort of understand what you were saying, but I think it was going too fast, and it was gonna make me drop some of the value that I saw in physics and math. Like, there's stuff that I just, let's say, loved too much still in that scientific worldview to be able to drop it too quickly. With phenomenology, I know that ultimately, like, you can recover physics from phenomenology, but at first it does feel like you're abandoning something that you really love. So, as you said, I'm glad you're."}
{"episode_id":"SW - #325 - 2024-02-02 - JP Marceau - Recovering the Metaphysics of Symbolism","start":1511.75,"end":1517.19,"speaker":"Jonathan Pageau","text":"Doing that, because I don't have. I don't have, like, a specific love for physics myself. So it's good that you. That you're doing."}
{"episode_id":"SW - #325 - 2024-02-02 - JP Marceau - Recovering the Metaphysics of Symbolism","start":1519.04,"end":1721.84,"speaker":"Jp Marceau","text":"And as you said, what ended up happening is like, okay, so I had this love for. For still the physical, especially physical science that I was trying to, like, still use in my. My studies. I was talking with you to try to get more into the symbolic worldview. I was also talking with John Veriki about the cognitive science side and also in. In general, he was great on the. The physics side. And I was always trying to bridge mainly between you and John, I would say, and it took several years. I would often run arguments by you and by him and try to see if I can make something. Most of our conversations, you and I, Jonathan, were in private for Patreon chats with John. All of my discussions are public on my channel or on his channel. But basically, as you said, through this, I developed, I think, pretty carefully a path from materialism all the way to the symbolic world and even up to the more, let's say, esoteric debates in symbolism, like how is it exactly that the world exists in Christ and how is it that the world exists through human consciousness? And all of these more esoteric kind of questions. You can get there pretty quickly with phenomenology. But as I said, this was too much for me. So I go, I went at it very slowly and I tried to document it in, in the book. So the main thesis is that we're in a meaning crisis because of materialistic reductionism. I use the zombie myth to talk about it and then I try to. The way that I try to do it, to go slowly, as I said, is I try to show like within science itself, there's no good way anymore to be a reductionist. This is like a 19th century view of science. It doesn't work. Not only can you still have your science, including your physics today, by going toward non reductive materialism, non reductive naturalism, sorry, you'll even have like a better science, a better physics to love. So I'm trying to really like give something to materialists so they don't have to drop anything. They actually just add something better. So that's the first part of the book where I try to take people from materialism to non reductive naturalism, which is really just classical metaphysics. Like if you read, let's say what classical metaphysicians wrote using Aristotle or Plato in the last few centuries, you'll see something that owns really well, modern non reductionist naturalism. And in the book I go through it carefully, but there's arguments really coming from both the top and the bottom. There's all kinds of arguments that popped up in philosophy and cognitive science about the impossibility of reducing the mind to matter. And even like in general, the idea that there are those emergent properties that you can't reduce to lower entities. So it shows up in chemistry, in biology, and the most obvious case is with consciousness. Like, you won't find many people now in philosophy of mind or cognitive science who think that the mind is just a matter of particles or neurons, let's say. So there's this problem coming from the top, but there are also problems coming from the bottom in physics where like things always get iffy when you talk about quantum stuff, because people like can defend easily New age ideas about."}
{"episode_id":"SW - #325 - 2024-02-02 - JP Marceau - Recovering the Metaphysics of Symbolism","start":1721.84,"end":1726.04,"speaker":"Jonathan Pageau","text":"Yeah, I know, I never talk about that stuff just because I know what the problem that it brings."}
{"episode_id":"SW - #325 - 2024-02-02 - JP Marceau - Recovering the Metaphysics of Symbolism","start":1726.04,"end":2209.3,"speaker":"Jp Marceau","text":"Yeah, but there's a real problem for people who want to be materialist there. Because like, if you're a materialist and you want to reduce things down to particles, like, you have to be able to talk about those particles, but like, you're going to enter into New Agey territory pretty fast because it doesn't look like what you see down there is stable particles. You can see fields and you can mathematize them. And there's interesting stuff to say, but it's definitely not stable particles. At best it's probability fields that you can quantify. But as you do that, you're starting to go towards stuff that is closer and closer to the prime matter that the classical metaphysicians talked about. And another problem coming from physics is that, and that's something coming from physicalists themselves is like, there's no. We don't know what physical entities are like. Even by nature. Physics doesn't tell you what its entities are, it tells you how they behave. Like it only gives you equations. And even if physicians tell you like the mass and charge of the electron is this or that, all that means is that if you put such and such values in an equation, you'll get this and this behavior. But you actually never know what physical entities are in physics. So like, if you try to reduce things down to particles, let's say, and you're a materialist, you're in big trouble because it doesn't look like what you have at the bottom are stable particles and you don't even know what is their nature. You know, how the waves behave, let's say, but you don't know why or what they are fundamentally. So there's like these big problems if you want to be a modern naturalist of like, there seems to be irreducible stuff at the top and there also seem to be something like trimatter at the bottom. But that's perfect if you just consider Aristotle and Plato and the whole classical metaphysical tradition. Because in that worldview, what you have at the top are irreducible forms and what you have at the bottom is prime matter. And the world exists in a hierarchy between them. The classical metaphysicians didn't quite use the words that John Vervicke uses for that. But I think it's great terminology of emanation top down and emergence bottom up. I think that's a great way of explaining it. From potentiality, things emerge. But if you just add this bottom up emergence, it would be impossible to explain why things cohere. So you also need this top down emanation of Forms, these patterns that allow potential to cohere into actual entities. So that's the first part of the book. Like how you can retrieve a classical worldview where you not only have this ontology of, like, matter and form in a hierarchy, but you also have forms that have to do with vices and virtues. Like, you can recover what I said earlier about perception, the fact that, okay, you learn to perceive objects, but also vices and virtues, so you recover a sense of good and evil. You're already starting to leave nihilism behind. You're not quite up to Christianity yet and a full solution to the zombie problem, but at least you're not a nihilistic materialist anymore. And what I like about doing it this slowly is that there's nothing that the scientist loses at this stage. Like, it's just positive. Like, you basically take the entire science that the scientists add, but you take his ontological hierarchy and you just make it a bit bigger so that what he adds makes more sense, but it doesn't have to drop anything. So that's the first part of the book. And then the second part of the book, what I do is I tried to go further by saying, okay, Christianity is still the full solution. I can't justify Christianity fully using arguments coming from naturalism or materialism. I think if you could fully justify Christianity using something lower, you would actually be reducing Christianity to something lower. I think the way that truth works in general is you have to rather try to seduce people into something higher. So what I try to do is a lot like what Lewis did in his book Miracles. But I do it for modern naturalism. Now. I say if you take the pattern of the Incarnation now and you try to see the ontological hierarchy, you try to see the natural world in the light of the Incarnation, the natural world actually makes more sense. And it's the same way that any new theory is advanced even in science, like the way that Newton, for instance, advanced his theory of relativity was exactly this. He came up with new axioms that people thought were crazy. By the way, people thought Newton was proposing something occult because he was proposing a force that acted as a distance, whereas everyone back then was a mechanist. People thought that everything was just basically billiard balls and things pulling and pushing against one another. So people thought there was something material explaining why we're attracted to the earth. But because Newton said it was just a force acting at a distance, people thought he was insane. But because he was able to seduce them, they actually ended up agreeing with him because he Said, okay, just, I know it doesn't make sense from your standpoint, but if you grant me what I'm proposing, then you're going to have all that you have right now and more. So he basically ended up seducing people and now we think nothing of it. Of course gravity, of course force is acting at a distance. But I'm trying to do the same for the Incarnation. I'm trying to say, okay, like the incarnation seems crazy, like it seems to be too much from a naturalistic standpoint, even a non reductive naturalist. But actually I think that if you take the Incarnation, you'll be able to get all of what you had before and more again. So I'm trying to seduce people into it. And we talked. I'm, I'm making use of much of the stuff we discussed a few years ago related to miracles, especially the miracle of the Incarnation. I think it just makes so much sense of even the experience I had doing mathematics when I was a student because. And it just blows my mind anytime I think about it. Let's say if I try to prove a theorem, let's say even something basic like the Pythagorean theorem, I'm taking an abstract truth that exists outside of space and time. Like even if there was no physical universe, the Pythagorean theorem would still be true. And yet when I'm thinking about this, somehow all of my neurons are assembling to host this immaterial truth. So there's this crazy bridge that happens in human beings when we ponder eternal truths. And I think the world makes more sense if it's made for this. Like if at its root, like this bridge is just an image of the bridge that happens in the Incarnation, where the creator of the forms and matter comes and embeds himself into that great hierarchy. So that's just one example. But you can find so many, let's say, aspects of nature, aspect of this ontological hierarchy that you find in non reductive naturalism that are better explained if you take the Incarnation as the key that ultimately I think like people should be seduced into the story of the Incarnation. And mythologically also what this does is a solution to the zombie crisis. I opened the book with like a solution to. I opened the book with the zombie myth to explain our reductionistic, materialistic standpoint. But as I also said earlier, ultimately is the Eucharist itself, sacrifice. That is the full solution to the zombie problem. And I want to invite people into that story. I want to seduce people into the story of The Incarnation, I think I provide a solution to the zombie problem. And also in metaphysics, I give people something that makes more sense than just non reductive naturalism. So that's the main thrust of the book. I try to take people from materialistic reductionism to classical metaphysics where they're not nihilists anymore, where good and evil exist. And then I try to take them all the way into the story of the incarnation where like all zombies are vanquished."}
{"episode_id":"SW - #325 - 2024-02-02 - JP Marceau - Recovering the Metaphysics of Symbolism","start":2209.78,"end":2273.37,"speaker":"Jonathan Pageau","text":"All the zombies are vanquished. I mean, I think it's exciting because it seems like it's also just the right moment for that to come out because we have all these people, all these surprising moments, like Ayaan Hirsi Ali who's says he's a Christian. She's literally, I've heard that she's, there's gonna, there's a debate organized between her and Dawkins. Like they're gonna actually debate that all of a sudden. So the, the, all of these things happening. You even have people like Brett Weinstein who are also kind of moving in a direction saying, oh, this isn't working anymore. This is, in some ways this is over like this world, this kind of 19th century thinking is done. And so it's a, it's a wonderful time. Jordan Peterson's next book is called We Struggle with God. And he's going through the Bible and he's doing a similar thing to what you're doing, which is he says, says by the time people finish reading this, there'll just be no room for atheism anymore. So this is a perfect time for all this to come together. So how do you see the course going through, going with this? Like how do you see the class coming together?"}
{"episode_id":"SW - #325 - 2024-02-02 - JP Marceau - Recovering the Metaphysics of Symbolism","start":2274.17,"end":2363.27,"speaker":"Jp Marceau","text":"Yeah, good question. Basically the more, the, the more advanced topics I decided to keep for the course, I want the book to be more general public, let's say. So there's to go into some of the more niche symbolic world topics. Like, I think it's important for people who are really interested to know, like what distinguishes this symbolic world metaphysics from let's say perennialist metaphysics or universalist metaphysics. I think it's important to try to see more precisely interesting stuff like how it is that the world exists in, in Christ, how it is that the world comes to exist through human consciousness. But I don't think it's necessary to go into those topics for a general audience that is just trying to get out of nihilism. So basically my approach was to take the course as an Opportunity to dive deeper into more advanced topics that I think will be interesting to the symbolic world audience. People who have some background in symbolism. But I also cover everything that is in the book. So if someone just wants to work through the arguments carefully in a setting with other people and ask questions, I think the course is going to be a great place to do so. And for people who want more, who want stuff that is not going to be in the book, if people want to hear more about the more difficult aspects of symbolic world metaphysics, the course is going to be a great place to delve into those topics."}
{"episode_id":"SW - #325 - 2024-02-02 - JP Marceau - Recovering the Metaphysics of Symbolism","start":2364.4,"end":2437.9,"speaker":"Jonathan Pageau","text":"So this is, I mean, to me, it seems like an exciting thing. I. And I know because I can see that. I mean, I see it. I see that people have questions, let's say, that I don't necessarily have. And so they have issues because they're trying to connect kind of the symbolic thinking with other aspects that are not the ones that I either know or that are, let's say, in the forefront of my mind. And so this is really important for people who have those kind of specific questions and people who are also, you know, we all have. We all have our strength and our capacity to do certain things. And, and I'm really grateful that you're there to also provide some. A little more technical specificity to how this works and trying to say, you know, try to work it out in a more detailed way. It's useful for everybody, especially people that are in the symbolic world kind of thinking and kind of roaming around that, that way of seeing the world. But they also are in university or they're in grad school and they, or they even some, some people, like, they even have positions in universities and, you know, they, they're starting to think that way, but they're struggling sometimes to justify it to their peers and to be able to explain it to the people around them. So this is a very useful thing you're doing."}
{"episode_id":"SW - #325 - 2024-02-02 - JP Marceau - Recovering the Metaphysics of Symbolism","start":2438.3,"end":2496.56,"speaker":"Jp Marceau","text":"Yeah, I think now is also a good time to do it because it's still close enough to me. Like, I can tell that, let's say, as. As Christianity in the symbolic worldview becomes more second nature to me. Like, it takes more thought to put myself back into the shoes of a reductionistic materialist. So I can. I can feel that it, like it could slip, like, in 10 years, it would be much harder for me to write the book than it it was now. And I think the same thing is going to happen to a lot of people. Like, ideally, if the book can save time for people who are at the point where I was 10 years ago. That's great. And then they can forget about it and move on to just like seeing the world symbolically. But yeah, as you said, I think now is a good time to do it. If there's lots of people going through this transition, if I can save them a lot of time, I think this is great. And it would be harder to do at some point as more and more people see the world this way, it's going to be harder to document the transition exactly how it works."}
{"episode_id":"SW - #325 - 2024-02-02 - JP Marceau - Recovering the Metaphysics of Symbolism","start":2496.8,"end":2582.22,"speaker":"Jonathan Pageau","text":"Yeah. Because, I mean, our prediction, both my brother and I's prediction, and I think Jordan Peterson told me he had a similar insight when he wrote Maths of Meaning. He said, you know, in 25 years, everybody's going to think this way and no one will know that they've changed the way they think. And so I think that for those of us that are at the outset of this and are kind of helping to instigate the change, it's useful for us to be clear on what's going on. As we notice it kind of infuse the backgrounds of people's minds and change the worldview slowly. So wonderful stuff. I will be there in the class, folks. I'll be there, not in every single episode, but I'll be there at the beginning, maybe a few times during it. And I'll definitely be there at the. At the last class to kind of. To wrap it all up. So I'm looking forward to seeing people there and to. And to follow along and, you know, this year, like. How can I say this? Like, everything now, Covid after Covid ended, things are kind of starting to consolidate, I feel, you know, we have the symbolic world press now. We're going to start to publish not just my works, but also works of people like Jean Philippe that are in the symbolic world and that are thinking about this and that have really worked out some aspects, so both fiction and nonfiction. So it's a. It's a great time to, to, to jump in and to get involved. We did the Beowulf class. It was massively successful. And I think we'll see something similar with this class as well. So people sign up. The class is. What did we say the first date was going to be? We just."}
{"episode_id":"SW - #325 - 2024-02-02 - JP Marceau - Recovering the Metaphysics of Symbolism","start":2582.54,"end":2586.3,"speaker":"Jp Marceau","text":"The 24th. Yeah, the 24th. January 24th."}
{"episode_id":"SW - #325 - 2024-02-02 - JP Marceau - Recovering the Metaphysics of Symbolism","start":2586.3,"end":2600.37,"speaker":"Jonathan Pageau","text":"So January 24th is the first class sign up. We'll put a link in the descriptions. Of course you can sign up and we'll have questions there. It is a mix of lecture and interaction. And we're looking forward to seeing you guys there."}
{"episode_id":"SW - #325 - 2024-02-02 - JP Marceau - Recovering the Metaphysics of Symbolism","start":2600.93,"end":2603.37,"speaker":"Jp Marceau","text":"And the book is going to be ready for the summit."}
{"episode_id":"SW - #325 - 2024-02-02 - JP Marceau - Recovering the Metaphysics of Symbolism","start":2603.37,"end":2615.29,"speaker":"Jonathan Pageau","text":"Basically, that is the plan. The plan is to have a pre launch at the summit. So if you come to the summit, you'll be able to get early copies of the book and then after that we'll have more official launch."}
{"episode_id":"SW - #325 - 2024-02-02 - JP Marceau - Recovering the Metaphysics of Symbolism","start":2615.29,"end":2619.19,"speaker":"Jp Marceau","text":"So good stuff. Perfect. Thanks, Jonathan."}
{"episode_id":"SW - #325 - 2024-02-02 - JP Marceau - Recovering the Metaphysics of Symbolism","start":2619.19,"end":2619.83,"speaker":"Jonathan Pageau","text":"Yeah, thanks."}
{"episode_id":"SW - #325 - 2024-02-02 - JP Marceau - Recovering the Metaphysics of Symbolism","start":2619.83,"end":2620.47,"speaker":"Jp Marceau","text":"Thanks, Hugh."}
{"episode_id":"SW - #325 - 2024-02-02 - JP Marceau - Recovering the Metaphysics of Symbolism","start":2621.27,"end":2676.32,"speaker":"Jonathan Pageau","text":"I want to invite you all to the very first Symbolic World Summit. Over three days, we will finally meet in real time, in real space. And everyone from this little corner of the Internet will be there to explore the theme of reclaiming the cosmic image. Of course, I will be speaking, but there will also be Martin Shaw, who is an amazing mythographer, Father Stephen DeYoung of Lord of Spirit fame. There will be Richard Rowland from the Universal History series, Vesper Stamper, Nicholas Kotar, and Neil Degrade that you've all seen on my channel here and there. For entertainment, we have everyone's favorite apocalyptic band, the one and only Dirt Poor Robins. This event will be the chance of a lifetime to capture and embrace our current moment. So Join us from February 29 to March 2, 2020 24, in Tarpon Springs, Florida. Visit the SymbolicWorld.com summit for more information and I will see you there."}
