{"episode_id":"SW - #071 - 2019-11-09 - The Meaning of the Ice Cream Licking Challenge","start":0.48,"end":850.14,"speaker":"Jonathan Pageau","text":"So in the last few weeks, there's been some strange videos appearing online, strange articles talking about people who are spitting or licking or, you know, doing all kinds of disgusting things into public food, food that is in the supermarket and then putting it back on the shelf. And so it is a. It's a pretty disgusting subject, but I thought it would be important to talk about it because it seems to represent a lot of things about our society and a lot of things. Things which help us understand how religious people are and what, let's say, our modern liturgical actions look like. This is Jonathan Peugeot. Welcome to the symbolic world. So not very long ago, there was a video which showed up online of a guy who was spitting into a. Into some tea, iced tea, and then putting it back on the shelf. And this was just one more video among several videos where we could see people. People licking ice cream, putting it back on the shelf. There were. There were different videos of people doing that. And the question became, why on earth would anybody do that? And, of course, the first reason, let's say the immediate reason, is because they want to be famous. They just want to attract attention. They want people to look at them. But there seems to be another reason behind that, or let's say a symbolic reason why this particular action is taking place right now. And so what is going on here? Now? One of the things I've been telling you guys about for quite a while now is the question about the symbolism of the edge and the symbolism of what it means to come to the end of identities. When identities come to their fringe, what does that look like? And. And one of the things it looks like is mixture, where two identities are mixing together, or there's confusion of identities, or there's confusion of integrity, we could call it. And this is exactly what is happening now. People who want to defile food, which is, you know, a bucket of ice cream or something, is a. An impulse towards mixture, an impulse towards confusion, an impulse towards the mixing of identities. And so you have a bucket of ice cream which is pure, let's say, because it's in a container, it's closed. It's also being sold. And by licking it or spitting into it or whatever, what you're doing is you're defiling it. And this action of defiling ends up being. Making it impure. And you would wonder, why would anybody do that? But that is exactly why. What the fringe looks like, that is exactly what the edge looks like. We have a mixture of, you know, a blending of gender identities, a blending of different cultural groups. All these things are happening on the edge. And so one of the things I tried to help people understand is that the way the human person functions, we function through analogies. We function through meaning. And so we can't help for these meanings to bleed out into other phenomena. And so if on the one hand, we encourage, let's say. Let's say something like multiculturalism, on the one hand, you know, the value behind that will also, let's say, leak out onto other phenomena. And this idea of wanting to make something impure or wanting to destroy its integrity is a. Almost like a ritual version of it. And what we're seeing by people doing this publicly and filming themselves, putting it online is a mockery or a kind of. You could call it a caricature of a magic action or a ritual action or, you know, a kind of curse or blessing, a way to affect the world. Because what it's doing is. It's actually affecting the world. Now, when you watch a video like that of someone who is. Who's doing that, what it's doing is. It's. It's. Not only is it breaking the integrity of the actual object that they're. That they're interacting with, but it's also breaking the integrity of our actual trust in the manner in which society works. Because now the question that is going to be asked is, has anybody else done this in the supermarket? And so I've. I've tried to explain this before, but you can actually see it happening in the. The. In this action is that when you start to confuse, you know, this type of mixture, this type of confusion of identity, like I've said so many times, it is inevitable that it will exist on the margins of society, you know, on the margin of societies, on the margin of yourself, on the margins of anything. There is a place where identities start to mix, where there's exceptions, where there's inversions, where all of this is going to happen. It's just an inevitable aspect of this, of an ontological hierarchy, of a hierarchy of being. Now, the problem happens when we make that fringe into a value or we try to bring that fringe into the center. Then we can see the. We can see what it can do. And here we can actually see what it can do. Because not only does it represent the, let's say, confusion of identities, what it's also doing is. It's creating a social breakdown. It is announcing a social breakdown where the implicit rules in which we function as a society, you know, all holding to the same ideals, is now being put into question. You know, because we usually trust. We realize to what extent our whole society is based on trust and based on this trust that we all share certain values in common. But when such actions are shown, you know, in public, what it's doing is that it's undermining the trust that we have in the fact that we actually do hold these same values. The idea that someone could do that, all of a sudden you're wondering, well, if I go to a restaurant, if I go to a store, any of these types of normal activities we do, are they being undermined by someone who wants to defile it, by someone who wants to spit into it or lick it or whatever? And we saw this a long time ago. I remember seeing some images of this pop star, Ariana Grande, I think it was, who was licking donuts and then photographing ourselves. The impulse to do that has to do with what we could call the. Could call something like the great Whore. You know, this image that we have of the great prostitute in Revelations or in these types of. In this type of imagery is the prostitute or the whore is an image of absolute mixture. You know, the idea that there is no purity in the. And so for, let's say, a pop star like Ariana Grande, who has embodied that type of imagery, it is not surprising that she would engage in such behavior. And if you look at also the kind of people that are doing this, not in all the videos, but in some of the videos, the type of people that are doing this, spitting into mouthwash or licking the ice cream, you will see that some of them seem to embody that fringe. Seem to embody that confusion of identity as well. And so it seems that that is not surprising at all. We saw another version of this in a video of a person who is licking a toilet seat in an airplane. And everybody was surprised. Anything. But that's not surprising. That is the ultimate image of the great whore. The idea of licking the toilet seat, that is wanting to. All the world, all the residue, all the. All the. Everything you want to bring into yourself or you want to put yourself into everything. So it could be one way or the other, the symbolism ends up being the same. You know, you can't tolerate purity, you can't tolerate even cleanliness is the. Is a kind of simple version of it. But the idea of integral identity actually bothers you. You want to miscegenate, you want to. You want to create mixture. You want to create some kind of impurity so that there is no pure identity. There is no. There is no identity which can hold, you know, and so it's interesting to see that this is happening. And I think that if you look at some of the, what happens in these articles, it's very fascinating because you can see that the, the, the reaction is the opposite. And so although a society usually is based on trust, when these types of things start to come from the fringe and move into the common space, then the reaction is you're going to create more protection, you're going to, you're going to create a lockdown. You know, you saw these images of policemen standing in front of ice cream, ice cream containers. And then you saw people locking down the, the freezer so that you have to actually go get help in order to access the food. And so this is, it's important to understand that, that the human person has to exist in a certain balance between identity and, and potential or confusion or, or let's say, exploration. Once you push too hard in one direction, the result isn't, can never be a total collapse in one direction. The result will end up being this pendulum which swings. And so the further people push in the, in the direction of confusion and polluting and breaking down identities, the pendulum will also swing the other side where there's going to be a clampdown on identities, a clampdown on protecting the integrity of things. And so we have to be very careful, we have to be careful on both sides not to pull the blanket too hard on our side, because like I said, the pendulum always swings. A human person is made of those two extremes. And so you can't pull too hard on one side as well. And it shows me as well to what extent our society is based on trust and that we cannot take for granted the implicit so structures which hold us together. It reminds me very much of a story of a moment when I was in Congo. And in Congo, you could really feel like it was a society that is always on the verge of breaking down, that is always on the verge of erupting into a kind of civil conflict or conflict between the different tribes and everything. And I was really struck one day by my professor, the person who was teaching me the local language in Congo Lingala. He mentioned something to me. He said, when you go to someone's house, it is very, you know, you can give them a Coke or some kind of a drink, and that's extremely polite, but people will never offer you water. And if you drink water at someone's house, you can only drink water at someone's house that is extremely, extremely close to you that you would never offer water to people or you would never ask for water in someone's house, even of a friend. That's just a, let's say that's not your very, very immediate family. Because there is this lack of trust, there is this lack of basic understanding of what it means to ask for a glass of water. And so you get a closed Coke bottle that you open yourself, because now you know what has happened to this bottle. You know that no one has done anything to it, or that it wasn't taken from a polluted source, or that it wasn't, you know, you know that it. Nothing was done to what you are getting. And so I really do think that that's something that is worth thinking about and always remembering to what extent our society holds on faith, holds on these implicit, hidden things that we all trust that we have in common. And to watch how as we move further and further out into the fringe, how we're seeing these bonds fray. But we're also going to see the other side, which is the clampdown. So I hope this was helpful to understand this strange phenomena that we've been seeing. And I will see you soon. I hope you enjoyed this episode of the Symbolic World. The Symbolic World is edited by Justin Ward and it is based on a series of videos that you can find on my YouTube channel, Jonathan Pedro's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course, leaving a review on itunes. Everybody knows that's the best way to to get the podcast out there, to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon Pageau videos as well and on SubscribeStar, all those links you can find on my website or in the show description. So thank you and I will see you soon."}
