{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":0.24,"end":65.98,"speaker":"John Vervaeke","text":"We define maturity as, as leaving home. And of course, that's very problematic for the millennials because many of them are still living at home and many of them know that they're not going to have a home. Well, I'll be more careful. They're not going to have a house. They know that my son is going through that right now. He's living with me. He knows. And he's like, he's working full time. High school biology teacher. That used to be the kind of job that you could build a home and family around. And he's still living with his dad. And that's hard on him. This, this is part of it. There's a sort of a double whammy on these, on these kids because first of all, they're not allowed to be homesick because of the cultural thing, but then they can't fulfill the cultural thing because the culture is basically giving them the finger when they try to do it. And the Philippines are saying, oh, no, no, no, you want to leave home, not for you. Right. And I'm worried that there's already a powder keg of resentment and then these machines are going to disenfranchise, I mean, economically, even more people, and the resentment is going to become like, murderous."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":66.3,"end":66.78,"speaker":"Paul Vander Klay","text":"Yeah."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":78.38,"end":81.98,"speaker":"Jonathan Pageau","text":"This is Jonathan Pedro. Welcome to the symbolic world."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":88.28,"end":88.52,"speaker":"Catherine","text":"Foreign."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":93.4,"end":299.49,"speaker":"Paul Vander Klay","text":"And as you can see from the other four people on the screen, we are going to talk today about the conference coming up in May, the quest for a spiritual home that's coming up in May18 to 21 in Chino, California. Chino, California is about 40 miles east of Los Angeles. Chino, California has its own airport, the Ontario Rio Airport in California. And so you can fly directly there. Tickets are available and there's a link below. But when we were talking about setting up this conference, as many as you can see, Catherine is involved in this and Catherine set up the Thunder Bay Conference. We very much wanted this to be in continuity and to continue the conversations that we began in Thunder Bay. And we had an offline meeting where we agreed on the topic, the quest for a, a spiritual home. And so I thought in. As we move towards this conference, I thought it would be helpful to sort of continue the conversation online, which will sort of give us a little bit of a bridge to then getting to the conference. Some people noted that at the Thunder Bay Conference, the, the title of that conference was Consciousness and Conscience. And some people noted that we talked a lot more about consciousness than we talked about conscience. And so some people have suggested this will probably have us sort of fill out the card that we left unfinished in Thunder Bay. So those of you who might not know who all is in this circle, Jonathan Peugeot is obviously here. John Vervake as well. Catherine was our moderator in Thunder Bay, and she will also moderate in Chino. And John Van Dank, who has worked with me a lot with the Estuary program, is located in Chino. And it's his. It's his church that is giving us the facility to host the conference. And John is setting this up. And I thought John would be an important voice because in a lot of ways, a lot of John's whole life story has been a quest for a spiritual home. And. And I would, you know, don't want to speak for John, but John and I have spoken about this a lot, that in a lot of ways, John is still sort of a restless wanderer in his quest for a spiritual home. Taking some time on the Camino pilgrimage in Europe, and he'll share a bunch of different things as things progress. I thought maybe we would begin with Jonathan and John because I think both of them have been doing a lot of work that I think is very much in continuity with the idea of a quest for a spiritual home. John, of course, has his After Socrates series, which has been coming out on his channel. Jonathan has been involved in the Exodus series on Daily Wire with Jordan Peterson, the kinds of conversations he usually does, and also a lot of travel. So maybe a way to get into this, John and Jonathan, would be for you two to sort of give us a little update on what you've been doing and how that begins to prompt your thoughts on this idea of a quest for a spiritual home and what we'll be talking about in Chino. Either of you can go first."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":299.73,"end":498.53,"speaker":"Jonathan Pageau","text":"Sure, I can go first. And so, I mean, I think that the idea of searching for a spiritual home is something which is. It's a. It's endemic to the situation of being a postmodern person, of living, you know, in the suburbs, of growing up deracinated. I myself, there are some advantages in some ways to being kind of a wanderer. I grew up in several cities. My parents moved a lot when I was young. My know, I lived in the Canada and the US and. And then I lived in Africa as an adult. And so in some ways, I am an outsider. Just generally there's an advantage to that because you can also be a translator when you're an outsider. You can kind of. And Paul, you. You've noticed that in the. What I'm doing is that in some Ways I talk symbolic world, but I'm always bridging between the two. I keep moving between the world of the kind of scientific, materialist world that I criticize, but I move from that and I try to point people into a more embodied experience. But it means that I also have the same issue that everybody has, right? I have the same issue that most, that I even I criticize about the modern world, which is, you know, I have the difficulty of being, of feeling fully part of something and to be kind of fully integrated into, into a spiritual home. And so, you know, becoming Orthodox, for example, was in some ways part of searching for that. But in order to become Orthodox, you almost also have to deracinate yourself. And you also have to be able to be willing to experience the strange and to. And to kind of be able to, you know, tame a new world and reintegrate a world that isn't obvious and isn't easy. And so the one thing I can say about finding a spiritual home is that as contemporary people, we have to be deliberate about it. We can't. It doesn't just happen, you know, like some, maybe some 16th century village where you go to church, you have the parish, you've got your, the priest there who's been there forever, and you. Everybody goes to confession and everybody participates and you know what the celebrations are. And you know, at Christmas we have this local tradition or whatever. All these things are pretty much gone for us. And so we have to be deliberate about it. And so for, for me, in some ways it's difficult and it's, and it's very, it's hard not to still have alienation, but it also makes whatever connection that I have very precious. And I, you know, I, I grab onto it and I, and I feel like it's transformative. And so I went to Mount Athos as some of, you know, in the past few weeks. And you know, that was a mix of those two things where I'm in Mount Athos, everybody, you know, I'm in church with people who are singing in Greek for three hours. And in some ways you just feel this weird, surreal experience of not knowing what's going on and not kind of knowing. But at the same time, I was able to feel connected to the Orthodox tradition in ways that I never experienced before. And so I come back very much re enlivened in my own practice, in my own prayer life, in my own faith. So, yeah, so I don't know where I'm going, but I would say that's where I am that's what you asked. Where are you? That's kind of where I am in that. In that respect."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":499.65,"end":745.76,"speaker":"John Vervaeke","text":"So I am reflecting a lot on the quest for a spiritual home of all of three of the key elements, quest, spirit and home. So around home I'm doing something that might catch you totally by surprise. I'm doing the cognitive science of home. What goes on there? What is this sense of belongingness? What's. Why is it. How does it link up to issues of orientation, navigation? And so I'm thinking about that and making use of also looking at some indigenous cultures who feel at home in the world without having housing. And that may help to bridge to what Jonathan was talking about. What is it like to be. Definitely. They definitely have home. They definitely have home without house. And that's very interesting because we seem to have the reverse. We seem to have houses without homes. And by comparing and contrasting that, can we bring out what it is home is doing for us and sort of building towards a proposal that. And this is built on something Jonathan said at the conference about. He was talking about like meals and how they sort of level up. I'm trying to take. How does. How do we exact up. And that's part of perhaps the spirituality. How do we exact up what you might call physical home into spiritual home? And what does. What's spiritual about that? Spiritual home? And this has sort of two things. One is a broader. I've been making a broader argument. I did it at. When I was at Ralston and I've done it really. I've released that talk just yesterday, the talk I gave at the Consilience Conference about leveling up and about how the possibility of a deep or a strong kind of transcendence, which is not just psychological improvement but the psyche is transcending and aspect levels of reality are being reliably disclosed and arguing for that and. And trying to mesh that understanding. And again influenced by Jonathan, the idea of faith as this sense of being able to level up, if I could put it that way. And so I'm working on that. And then what has been really consuming me for the last two weeks, I'm preparing a video essay for the end of the week at which this recording is happening on the scientific, the philosophical and the spiritual significance of the GPT machines and what do they mean for us, my goodness, all those. And what. And how that might intersect with our sense of being at home cosmically. Because I. One of my things I'm going to argue for. I'm not going to argue for it Right now I think there's a deep connection though between cosmic at homeness and spiritual being spiritually at home. And part of the quest is how to weave those together and how to exactly physical home into that. So that's sort of where I'm at and when I'm wrestling with. And it's. And I. I got to spend 8 hours yesterday walking and talking first with just Jordan hall and then with Jordan hall and Christopher Master Pietro around to this. And I've been working on this specifically what does it mean for us now that these machines are emerging and, and trying to cut through? There's a lot of bullshit on both sides about these machines that have to be cut through very carefully. And then we're going to face, I think, some reliable decision points. And I think those decision points are really going to be bound to the normativity of home. Do we want to, do we want to still have a home in the universe? As a question, I know that sounds like bizarre that we should even ask that question, but we, I'm going to argue it when we get to Chino. We're facing that question. So the quest is very much a quest. It's not just the questioning, you know, the questing and the questioning. It's also the facing. Facing peril in really important ways. And so that's where I'm at right now."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":745.92,"end":748.64,"speaker":"Paul Vander Klay","text":"John, Catherine, you guys want to throw anything in there?"}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":749.28,"end":957.24,"speaker":"John Van Dank","text":"I have given a little bit of thought to what I might bring to the table as a participant in this conversation. I'm somewhat self conscious in part because Paul keeps referring to me as the old man. I'm somewhat conscious of my age and I would like to think of myself as representing the boomers and perhaps make some attempt to redeem the boomers. But the other thing that my life experience has pointed out is that there is no such thing as a linear trajectory in the long view. There's a lot of ups and downs and two steps forward and one step backward and three steps forward and two steps backward and. And so there's that feature. Yes, I have some experience with a quest in the sense that I actually walked the Camino de Santiago, which is a traditional pilgrimage, which was originally thought of in the olden days as very much a quest to achieve a spiritual end and reach a spiritual destination. But it was also clear that for the Camino at least, the focus was as much on your daily place to sleep as it was the final destination. So there is a sense in which some of our focus on the quest for a Spiritual home cannot be the final destination, but all the stops in between. And so that's one thing that I would like to focus on a little bit. I would also like to contribute in some fashion, and I don't really know where or how these things will all come up in our conversation, but the fact that I've had a bit of a aha moment kind of a time in my life and something became particularly clear and, and I'm kind of intrigued by what Jonathan said earlier about how. How this stuff doesn't happen automatically. You have to almost position yourself even for an aha moment or a particular revelation. So I have a couple of stories that pertain to that I would like to have the opportunity along the way to perhaps say something on a more procedural knowledge kind of line about how Estuary works. And that's, of course, something that I have been busy with for. For several years now, together with Paul, to try and. And figure out how to make that happen on the ground and what are the mechanics that actually make that come alive and make it work. So there is some procedural things that I would like to bring to the table. There are some things that I would like to say about my relationship to my rather conservative church and how it becomes in some fashion an anchor for my mental meanderings, my myopic mental meanderings, and that it provides me with a sort of a reference point from which to judge whether I'm still in touch with reality and. And what does it take? And how did that church, you know, obtain the right in my life to. To be that anchor? And. And that is actually a story all by itself. And so, yeah, that's probably some of the stuff that I've been thinking about, some of which may be meaningful in our conversation. If it doesn't all come up, that'll be fine as well."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":957.48,"end":1123.39,"speaker":"Catherine","text":"Catherine, I have a few thoughts, I think, at the forefront of my mind. I just think about the feedback we got from the first conference and how helpful people found it. I was talking to somebody about a month ago who watched through the series online, and she said that the. The word that described it most for her was luxurious. She found it to be emotionally and spiritually luxurious to just listen without feeling like behind every point there was this pressure to go out, and now there's the 10 things you have to do, like, here's a thought and now go forth and change the world and be a new person. But there was just room to really talk and really unpack and really work through and see people processing in real Time. So I think at the front of my concern is the hope that we can continue that pattern, to continue the really privilege of being able to take time to really unpack things thoughtfully and do it together. So that's my first thought, is I hope that that pattern can continue. My second thought is in line with what you were saying at first, Paul, that my thought in the initial conference was it would be nice to see how each of you consider consciousness differently and then to see how that might lay itself out in a moral, ethical pattern. So since this is what consciousness is, therefore what would your conscience lead you to? What should the ethical implications of that be? And I think that lines up really nicely with this theme of a quest for a spiritual home, because that's all very active, it's all very much instantiated. How do we do this? How do we live this? And again, it might not land with like, here's the 10 things to go do, but is there a sense that we can get of the pattern of how that might feel? Talking about rituals and rhythms and how do we go about this? In a way, like John said, that's a process. It's not just where we land at the end of the trail, but the stops along the way. That's the second thought. And the last thing I've been thinking is since this theme came up, I've mostly been looking at it from the one side. You know, this idea that we want a spiritual home, like a, a structure in which we can rest spiritually. But there's a flip side to that too, which means that if you have a spiritual home, you're going to be instantiating a spirit within it. And so I think a good question is, what kind of spirit do you want to be patterning within the home that you're creating? Because it's this double sided thing where you will create space for your spirit and other people's spirits to rest, but you also are then going to be participating in some eternal pattern. And so being conscious of what eternal pattern it is that we want to be instantiating. I think that's the flip side of the conversation that I hope we get around to at some point as well."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":1123.71,"end":1134.56,"speaker":"Paul Vander Klay","text":"Maybe picking up on where Catherine left off, thinking about what happened at Thunder Bay. Now John wasn't there, but the other."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":1134.56,"end":1135.56,"speaker":"John Vervaeke","text":"Four of us were."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":1135.8,"end":1147.96,"speaker":"Paul Vander Klay","text":"What, what for you are you hoping for from this conference, either in continuity with or perhaps a pivot from."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":1148.2,"end":1149.96,"speaker":"John Van Dank","text":"There will be paintball for Jesus."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":1150.12,"end":1153.72,"speaker":"Paul Vander Klay","text":"There will be paintball for Jesus. Yes. And it won't be raining."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":1154.39,"end":1227.52,"speaker":"Jonathan Pageau","text":"I. I really enjoyed the conference so much in, you know, because there is something. And we talk about home or talk about the sense of. Of. Of connection, you know, and I think that being in the same place together was definitely a great added value to. To. To. For the conversations to have a different flavor to them. And so I really definitely enjoyed that. So I think that I'm looking forward to a continuity of that, you know, and I think in some ways the. The theme is perfect already. Like just the things that. That John Revae said, I've got like. It's just buzzing, you know, I wish the conference was tomorrow so we can talk about all those things because it's just like there's. There's so much conversation. There's so much. There's so many things to tap into and to think about. So by the way, I'm speaking to Jordan hall as well about this question soon. And we're going to do it more from the principality angle of it. And you know, the question of agency over us also this kind of these patterns that act on us. So it all kind of ties in. But I think that, you know, the. I think that being in the same place will be very fruitful to continuing these discussions."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":1227.52,"end":1228.28,"speaker":"Paul Vander Klay","text":"Anyone else?"}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":1228.28,"end":1318.2,"speaker":"John Vervaeke","text":"I mean, I want to echo what Jonathan said. I'm hoping for a continuity of the, like the spirit of that previous conference that was just. I. I think luxurious is very apt. That's how I experienced it. And I felt, you know, we all got to places we couldn't get to individually, and for me, that's the criterion of success. And I. I'm expecting. I think I'm reasonably expecting that's going to happen again. So I'm looking forward to that. I'm hoping that this topic does a little bit more of bridging to people who are not religiously oriented. I mean, we made. This isn't a criticism of the previous conference because it was a learning experience. Right. But making sure that was one of the reasons we chose this title. In fact, we chose it collectively, all of us. We worked together to. It was a product of distributed cognition, you might say, but something that would bridge very deeply between people who are religiously oriented and those who aren't religiously oriented. Because I do think that question is now we being able to cross that divide so that we can meaningfully and deeply work together, I think is now even more pertinent than it was four weeks ago. And so I think making sure that we properly tend to that bridge, I think is something I would like to see, given A priority at this conference."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":1318.68,"end":1534.01,"speaker":"Paul Vander Klay","text":"I also think one of the things that I very much appreciated about the conference was again to be in person. Even though for many of you watching this, the primary mode of connection you have with especially three of us is our images on flat screens and our voices coming out of speakers. And you might in fact be listening to us in your home, you might be listening to us in your car, but the, the opportunity, the opportunity to knit something else together. And, and for me, as, as we, we think about how we will spend the time over Friday, Thursday, Friday, Saturday and Sunday in Chino, to me a priority is to make a space so that more knitting together can be done. Not, let's say, oh, you get a chance to do a selfie with one of the speakers, but you get a chance to, you get a chance to make at least. I like John Van Dank mentioning the Camino. You get at least a chance to have a manse to locate for a brief overnight with a group of new people and find out what that means in terms of the bonds and bridges and connections and growth that can happen in there. One of the, one of the aspects to this is that Grim Grizz tells me there are still 15 spaces available at the campground. So those who would like to camp for this, and truth be told, I'm not going to camp because I'm speaking and it's a little hard to prep for a speech if you're kind of up to your neck and other people camping. But part of me is really wishes I were camping because I know from, from growing up, church, camp outs and camping with friends that living together in a way that we often only do when we camp outside is something that facilitates and prompts the kinds of connections that will, I think, facilitate the quest for a spiritual home. And even though of course, you know, you get to watch myself or Jonathan or John on YouTube, it's the, it's actually there's always churn with these, these, these sort of false relationships with screens. You listen to Jonathan for a while, then you listen to Paul and listening to John and then you're over here this other channels and, and the, this is an opportunity to build some other relationships that are, can actually go deeper. And in my experience, it's those friendships, friendship relationships which actually transform us more than you know, oh, I listened to Paul Vanderklay for three years on YouTube. You know, that's, it's the face to face, belly to belly, nose to nose stuff. And this is an opportunity for that. And then the, the Overall speeches, both what Jonathan said and what John said already and what John and Catherine have already said, that sort of teases me. But I think that sort of opens up sort of the micro fissures."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":1535.85,"end":1536.21,"speaker":"John Vervaeke","text":"In."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":1536.21,"end":1563.21,"speaker":"Paul Vander Klay","text":"Our settledness to allow new growth and transformation to take place. And I think we had a beginning of that in Thunder Bay and I think we'll have opportunity for more of that in. In Chino. I, I've sort of directed this so far, me asking questions, but I don't want to leave it in that manner. I don't know if any of you have questions or challenges or, or something you want to throw out to, to prompt this."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":1564.01,"end":1652.02,"speaker":"John Van Dank","text":"I just thought it might be helpful to throw out the fact that the way the three of you have in the past few years engaged in conversation with one another models a certain style and a certain openness and a certain to worldliness that. That's very admirable and very enjoyable and it has that sense of lingering that Catherine was talking about. But we would like that model to translate into an underground experience also, which means that it would be pretty much ideal if it could be orchestrated that a goodly number of people that normally hang out at John's channel or at Jonathan's channel would, would also be represented at the conference. So that there can be a little bit of a mixing of these three demographics which I'm sure are a little bit different from one another and, and kind of symbolically represent, you know, in which the three of you symbolically represent how three different ways of looking at the world and three different ways of talking about things can actually be practiced on the ground in Chino. That would be my super goal and, and I would be just delighted if, if that could be realized. Which means that I would very much like John, your people, and Jonathan, your people to also come to Chino in the, in similar numbers to what, what. What is coming from. From Paul's channel."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":1652.66,"end":1659.83,"speaker":"John Vervaeke","text":"So I agree. That's great. What should I be doing? I mean, I'm going to promote this video on my channel and promote the conference."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":1659.99,"end":1662.23,"speaker":"John Van Dank","text":"That may be all it takes. That may be all it takes."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":1662.23,"end":1681.19,"speaker":"John Vervaeke","text":"I didn't want to do it earlier because it, I mean generally I found you don't want to be that far from the event or people just don't do much about it. They just, they, they. I'll mentally file to do that and then nothing happens. But I think we're close enough now. I'm really happy to like promote this on all my platforms and promote this."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":1681.19,"end":1682.43,"speaker":"John Van Dank","text":"And mention airline Tickets."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":1682.43,"end":1682.99,"speaker":"John Vervaeke","text":"Mention airline."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":1682.99,"end":1683.27,"speaker":"Paul Vander Klay","text":"Mention."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":1683.27,"end":1685.95,"speaker":"John Van Dank","text":"Airline tickets will get more expensive if you wait longer."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":1685.95,"end":1686.87,"speaker":"Jonathan Pageau","text":"Oh, yeah, that's true."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":1687.03,"end":1701.69,"speaker":"John Vervaeke","text":"I'm actually, I, I was supposed to get mine yesterday, but I was with Jor, so I'm gonna. Taylor and I are trying to coordinate so we can fly in together. Taylor Barrett and I. So he was also at Thunder Bay. So. Yeah, I'll. Yeah, I'll scare people too then."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":1701.69,"end":1732.3,"speaker":"Jonathan Pageau","text":"Yeah, that. But for sure that, you know, John, to your point, Van Dun. Van Dunk. Sorry, that. To your point, in terms of having all these people come together, I for sure, at the Thunder Bay conference, it was amazing to see the variety of people that had come, you know, and it was, it was very interesting. And then also to notice people in the group, you know, create bonds with each other and discuss all across all kinds of, of interesting lines. And so I think we'll definitely see more of that in this, in this conference."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":1732.78,"end":1772.02,"speaker":"John Van Dank","text":"And then I have a question from Catherine. Catherine, when you saw the tickets being purchased, was there a pattern among the people who paid for the tickets? That there were just a lot of women who paid for the ticket or was there, or were there actually a lot of women who showed up at the conference? I find a pattern right now is that I see the name of the person who buys the ticket and a lot of them are female names. So either we're going to have a whole bunch of women and girls at this conference, or else they're buying tickets for their loved ones and it's going to be a bunch of guys that are going to show up. You want to speak to that, Catherine? What do you think is going to happen?"}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":1772.74,"end":1809.74,"speaker":"Catherine","text":"Sure. I found that there were quite a few couples that came and so often the wife would or girlfriend or partner would go in and, you know, sign up and it would all be in her name. And there were quite a few single ladies as well. There were quite a few women at the conference and I was pleasantly surprised because I tend to think of our corner as being a little more nerdy and a little more male oriented. It's that more cognitive, thinky, talky space and not as much of the hands on. But there were quite a few women at the conference and I'm really hoping a lot of them will come to this one as well because I really enjoyed meeting so many of them."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":1810.06,"end":1814.94,"speaker":"John Van Dank","text":"We had a few women sign up for Paintball for Jesus, so be prepared, guys."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":1815.1,"end":1818.58,"speaker":"Paul Vander Klay","text":"We didn't have any women at, in paintball in Thunder Bay, so."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":1818.58,"end":1821.58,"speaker":"Jonathan Pageau","text":"Oh, really? So I didn't remember if they were women or not."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":1821.58,"end":1821.94,"speaker":"Catherine","text":"Yeah."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":1821.94,"end":1822.78,"speaker":"John Vervaeke","text":"So interesting."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":1823.34,"end":1860.37,"speaker":"Paul Vander Klay","text":"Well, it is interesting to me how, yeah, YouTube is a very male oriented space, but I've noticed with our estuary meetings too, here in Sacramento, more and more women have been coming. And it's interesting to me how. It's always interesting to me how they sort of reshape the conversation and the dynamics in the room. And so, and I did notice that at Thunder Bay that there were a good. What percentage were women at Thunder Bay? Did you do run any math, Catherine?"}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":1860.77,"end":1865.57,"speaker":"Catherine","text":"I didn't, but off the top of my head I would have said maybe 30%. Yeah, there's quite a few."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":1865.57,"end":1866.05,"speaker":"Jonathan Pageau","text":"Quite a bit."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":1866.05,"end":1866.45,"speaker":"Catherine","text":"Yeah."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":1866.53,"end":1867.09,"speaker":"John Vervaeke","text":"Yeah."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":1867.57,"end":1950.91,"speaker":"Paul Vander Klay","text":"And, and I think that's a, you know, especially given the. I really liked what I mean this, this home thing John really sparked with awakening from the meaning crisis when he talked about domicide. And, and John, also this time when you talked about, you talked about those who aren't in. Those who are not currently. See, language is harder. Those are not sort of currently residing in a particular religious house, let's say. And I, you know, I know people look at me and say, well, he's a minister, so he's doing this one thing. But you know, as a, as a minister, I, most of the people I actually work with are sort of religiously homeless. And as you often mentioned, John, those, those numbers of the nones, that's been one of the, one of the very interesting demographic realities. And, and so this, you know, part of what I think we've seen with the ongoing rise in globalization, affluence, transportation, is that many people, they are placeless. I don't know, I don't know any of us in this, you know, Jonathan mentioned he grew up in how many different places, I don't know how, how many places you've lived, John? I've lived."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":1950.91,"end":1953.03,"speaker":"John Van Dank","text":"I'm an immigrant. I'm an immigrant for starters."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":1953.19,"end":1991.31,"speaker":"Paul Vander Klay","text":"Yeah, the dank is an immigrant. Catherine, she's got a very interesting story in terms of growing up all over the place with a religious family. So I think, you know, especially seeing women in this context. Women are, you know, women are often homemakers in many ways. Men tend to be distracted, foraging doers and women are often centering. And so I'm really happy to see this, the beginning of what I think is probably more of a demographic balancing, I think probably a maturing of this conversation in community hope."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":1991.31,"end":2020,"speaker":"Jonathan Pageau","text":"So I know for sure that a lot of the people that come in, kind of meeting crisis types that come into the churches, they end up being guys and then you just have these crazy lopsided churches with like. Like in my parents. That's what's going on. You know, it's. It's all this, like, wave of, like 20 guys, you know, like, coming in and then just a few ladies. Hopefully that balance out in general will balance out in terms of, you know, people kind of. Kind of entering into these conversations."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":2020.16,"end":2063.36,"speaker":"John Vervaeke","text":"Well, maybe this brings up. I don't know if it is or not. Maybe I'll be able to connect it. But I'm also interested in. I'm interested in the. The other side of this. I'm interested in home sickness and how is that related to what's going on? I have the book that I'm not. I have not yet started reading it about. At the beginning of the first half of the 20th century, homesickness was considered a major thing because of the rate of immigration into North America. And it was taken very seriously. And then there was a sort of cultural shift in which being sort of economically nomadic became recommended, and then homesickness with. Looked on as a kind of weakness."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":2064.72,"end":2067.2,"speaker":"Paul Vander Klay","text":"And I mean, what book is this, John?"}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":2067.44,"end":2069.12,"speaker":"John Vervaeke","text":"Pardon me for a second. I'll go get it."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":2069.46,"end":2083.62,"speaker":"Paul Vander Klay","text":"Sure. You know, I. I lived part of another interesting little facet of this corner. The first conversation I had with Jonathan, we dug into, you know, your journey in Africa, and you talked about the fact that I didn't know you lived in the States for a while."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":2085.22,"end":2096.32,"speaker":"Jonathan Pageau","text":"Yeah, my father studied. He was a. He studied at Denver, Colorado, at a Baptist seminary there. I forget what it's called. And then he. I lived in Wheaton. My dad was Wheaton grad school when."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":2096.32,"end":2097.68,"speaker":"Paul Vander Klay","text":"Oh, that's the title of the book."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":2097.84,"end":2099.04,"speaker":"John Vervaeke","text":"Yeah, Homesickness."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":2099.04,"end":2101.12,"speaker":"Paul Vander Klay","text":"Susan, what's. Who's the author?"}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":2101.6,"end":2284.44,"speaker":"John Vervaeke","text":"Susan? An American History. So this is not. This is not an analysis like, of the phenomenon, like, like under unpacking its cognition or. Or its phenomenology or anything like that. It's an attempt, though, to understand why we shifted culturally from recognizing homesickness as a significant and real thing that people had to be helped with, to. No, no, no. If you're homesick, you're just immature. You haven't grown up. You failed to launch. And my. Part of my. I. This is only a weak hypothesis, but part of my thinking is this is a contributory factor to the meeting crisis that we. Right. Is that people are in some sense experiencing domicide homesickness, but they're not allowed to articulate it that way. And so they're thrashing around in other ways of trying to Articulate it. And so, you know. And of course, this goes back to ancient themes of, you know, Augustine. You know, we're restless until we find a home in God kind of thing. But I'm particularly interested in the clash between these two normativities that seem to be both spoken about in our culture, as if they go really happily together, when, of course, they don't. Home. Right. Family values. Nebulously useless phrase because, you know, the Manson family had family values, so I don't know what that. Yeah, it's dependent on the quality of the family and the type of values, but there's that. But then we. We push a culture that emphasizes. Right. Like I said, economic being an economic nomad. And those two are like. And, you know, Etterstadt has made a very good argument in how the west really lost God is that it's the rise of individual people. Living alone is the most. The thing that is most powerfully correlated with loss in belief in God. Take that for what you want. I'm not making a theological claim. It's just a straight demographic argument that when people lose extended deep homes, they lose a sense of why, a sense for God. I'm trying to speak as neutrally as I can here. Yeah. Right. And so I'm trying to also wrestle with how, like, we should. We should recognize that these things are actually in a profound tension and they have a lot to do with people's spirituality. And, you know, that, you know, and this overlaps with the number of close friends, people's. Has. Is reliably declining also each decade. And so there's. There's something here about, I think, a vacillating, unstable framing of home in our culture that is also a significant contributor to a lot of the other things we're talking about. Yeah."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":2284.52,"end":2291.16,"speaker":"Jonathan Pageau","text":"But it's interesting because when you say home, and especially you presented it home in some ways as part of the orientation mechanism."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":2291.32,"end":2291.8,"speaker":"John Vervaeke","text":"Yes."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":2292.04,"end":2325.62,"speaker":"Jonathan Pageau","text":"And so, you know, and so what happens in it, even without realizing, you know, you have this value hierarchy which says something like, you go to college and then wherever you can get a job. Right. That's where you go. You just move there, and then you make a life there. It's just a normal. It's like a normal thing. You leave your home, you go to college, you maybe you find your spouse there, and then you find a job, and then you go to that place. And so that this is just a normal way of functioning shows you part of the Orient, the orienting mechanism itself."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":2325.62,"end":2325.9,"speaker":"Paul Vander Klay","text":"Right."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":2325.9,"end":2356.3,"speaker":"Jonathan Pageau","text":"What it is that that's Making us make decisions. And then the. Let's say, the downwind from that is it is a general destructuring of these intermediate. Not just family, but just intermediary structures of cohesion, like, you know, your clubs, your boy scouts or whatever. All these things hold us together because the economic. The economic vector becomes the only thing that really matters. You know, making money, accumulating things. Yeah. And those things buffer us."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":2356.3,"end":2356.5,"speaker":"John Vervaeke","text":"Right."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":2356.5,"end":2373.54,"speaker":"Jonathan Pageau","text":"And they're. The technical part. The technical aspect of the thing that we have. It's the. They're all kind of extensions of each other. Right. Industrialization, these computers, these machines, these things, they kind of buffer us from each other. And then they also become our orientating, our orienting mechanism themselves."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":2374.18,"end":2402.21,"speaker":"John Van Dank","text":"The thing that you don't hear very often from preachers is. And I'm not really totally speaking as a preacher, but certainly as a person from a church perspective is that if you find yourself in a church that seems like a good fit, a place where you feel comfortable, a place where things are said the way you think they should be said, and where the programs and the projects pretty much line up with your priorities and perspectives, then there is a good possibility that you may be in the wrong place."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":2402.21,"end":2434.44,"speaker":"Jonathan Pageau","text":"In that sense. Yeah, in the sense of a kind of complacent. Because a home is not it actually. It's difficult. Right. It's like being in connection with your parents, your family, your siblings that have been grading you for your whole life, that there's been these little things accumulating. It's a difficult thing. It's not easy. Or these online communities are easier because it's all people. You know, it's like. I like being with John Revaeke. You know, I. I chose him as a friend. He's not, he's not just someone around me that's getting on my nerves because they live in the neighborhood. You know, it's. It's a different type of."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":2434.44,"end":2434.8,"speaker":"John Vervaeke","text":"Of."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":2434.8,"end":2435.68,"speaker":"Jonathan Pageau","text":"Of reality."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":2436.4,"end":2514.76,"speaker":"John Vervaeke","text":"Well, this goes to a point that I want to bring up. I'll bring it up in my talk, but also my foreshadow it a bit here. I think we shouldn't be talking about home in isolation. I. I want to argue that there's a home horizon access axes instead, and that that is what we're trying to. And we even got it a bit with the quest motif in there. If, if home is orientation and Stenberger and other. Not Stenberger, I got the wrong name. The guy who wrote the orientation book, I'll remember it. But if that, you know, if home is your Original, not just temporal, but like in origin, like an origin point on a map. Right. If, if home is your original, your origin for orientation, it's, but it, Right. It also has to be in relationship to horizon in an important way. And it's interesting that home has this. I mean this was part of what Brian Walsh was arguing way back when, when I met him on the train and read his article. Right. That home is also a place where we're, where it's a symbolic machine for world view attunement and it's designed to orient us to the horizon in some fashion."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":2515,"end":2522.68,"speaker":"John Van Dank","text":"And so you said, John, that thing that you just said fits very well with the idea of the pilgrimage. Where there is a destination."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":2522.76,"end":2523.32,"speaker":"John Vervaeke","text":"Exactly."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":2523.64,"end":2557.1,"speaker":"John Van Dank","text":"There's a destination and there is these different places where you can spend the night. But the thing that is most reassuring on the Camino is those little yellow conch shells that tell you that you're still on the right path. And, and, and, and they, they, they are noticeable from the beginning to the end and they give you an orientation of kind of where you're going. But they most definitely are not a place where you can spend the night because they're just a little, tiny little marker. They're just a little marker. But, but they are, as a whole, they are the most reassuring thing on the Camino."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":2557.1,"end":2589.55,"speaker":"John Vervaeke","text":"Well, that's exactly it. Like, so I'm interested in the, in cultures that do not have houses and yet like some of the Australian indigenous cultures, like they, they, you know, and they have the dream lines and, and such. And so they, they found a way of, of not being bound to this or that. But nevertheless they have a way of working, orienting towards the horizon because they're all, they're, they're moving around a lot. And I think that that's, there's something to be learned from them. I don't know what it is yet. I'm still working on this."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":2589.63,"end":2664.68,"speaker":"Jonathan Pageau","text":"There's, there's definitely in the, I think in most religious traditions there's a weird tension between a kind of home and self alienation to a certain extent. Like asceticism can be understood as a type of conscious alienation. And, and I think Jordan Peterson really captures it in the ways he talks about it. You know, it's like on the one hand you need enough home to give you that anchoring, oriented, orienting mechanism. You don't want too much because then you just, you know, you just kind of run around in circles and you, you, you become too comfortable. And so you see ascetic practice and pilgrimage is a good example. Seems. And you see that in a lot of the monastic, especially the early monastic authors, where, you know, they went to the desert, you know, they, they went out and put themselves in horrendous, difficult, lonely situation because they were, they, they could see the horizon. They knew that they also had to de. Anchor themselves in order to move towards the horizon. And so I'm not saying that's what we should do. In some ways now we have too much of that. Like we have too much de anchoring and we don't have the stable orienting mechanism. But it seems for sure there always has to be a discussion between those two, those two sides."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":2664.68,"end":2756.01,"speaker":"John Vervaeke","text":"Well, I'd like to bring that up too at the conference because I want to talk about the two great. Well, I consider them the two great home myths of the West. One is Odysseus and the return to home, and one is Abraham and the going to a new home. And, and, and you know, the Greek and the Hebrew orientations there. And what does that mean? Because that's part of what I mean by the, the home horizon polarity. It's like this is Abraham going away from home to anew and this is Odysseus trying to get back. Right. And we have these two great. And so that's what I mean about, I think when we're talking about home, we're actually talking about a polarity between like something where we are grounding and then somewhere where like this is assimilation and this is accommodation or something like that. And I think that plays out in the, you know, that our notions of the sacred also have that polarity in it. We talk about the sacred is that which makes us most at home. But then there's the numinous. Right. That is also deeply horizontal. I don't want to say horizontal because that word doesn't mean what I want it to mean, but horizonal. Right. In a really, really powerful way. And so, I mean, this is a, this is a way of saying that I think sacredness and the home horizon polarity are also deep interpenetrating with each other in important ways. And that's why we have these, these. And it's interesting that the west has these two myths. It's holding on to both of them in a profound, in a really profound way."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":2756.33,"end":2802.95,"speaker":"Jonathan Pageau","text":"Yeah. Well, think about, think about the, the craziest image is obvious. I mean, to me at least, the craziest image is what's happening now. Like for me, we're entering Holy Week in the Orthodox Tradition. And so we have this image of the cross, which is obviously the most alienated possible, is like, everybody hates you, your people, that everybody. Everybody's betrayed you. Everybody hates you. And then Christ is on the cross with this thief, and he says, you know, today you will be with me in paradise. Right. He says that's home. Right. Paradise is the home of homes. It's the place. It's the cosmic home, you could say. Best way of saying it. But then he says that in a moment where basically everything that he can imagine is falling apart. So it's like that. That paradox is captured in a crazy way in. In that story."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":2803.51,"end":2811.67,"speaker":"John Vervaeke","text":"Well, I want to pick up on that, too. I mean, because Jesus in a couple of the Gospels says he doesn't have a home. Yeah. It doesn't have a home."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":2813.11,"end":2818.47,"speaker":"Paul Vander Klay","text":"And so have holes and birds have nests, but the Son of Man has no place to lay his head."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":2818.79,"end":2819.67,"speaker":"John Vervaeke","text":"Yeah, yeah."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":2819.67,"end":2820.95,"speaker":"Paul Vander Klay","text":"And he uses Son of Man."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":2821.47,"end":2821.75,"speaker":"John Vervaeke","text":"Yeah."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":2821.75,"end":2823.55,"speaker":"Paul Vander Klay","text":"That's not insignificant to that quote."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":2823.71,"end":2865.74,"speaker":"John Vervaeke","text":"Yes, I was, you know, going to pick up on that. But it's so. And. And the Buddha says very similar things. And so again, I. I'm already doing what I want to do. I want to problematize this as much as we possibly can and then wrestle with it, because I think it is a deeply, deeply problematic thing, but I think it's also a deeply, deeply human and deeply, deeply needed thing. And like I said, I'm worried that we're about to face something that is going to be as if you took the invention of alphabetic literacy, the printing press and the telegraph and released them all at the same time. They won't make the same impact that these machines, these new machines are going to make on us."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":2865.9,"end":2866.38,"speaker":"Paul Vander Klay","text":"Yeah."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":2866.86,"end":2882.31,"speaker":"John Vervaeke","text":"And, you know, and that the printing press is, you know, the Protestant Reformation, the religious wars, it's like, wow, it's going to be bigger. So. So I like, I want to, like, I want to really wrestle with this. Really, really deeply. Like, take it to its depths and crack it open as much as you can."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":2882.71,"end":2885.35,"speaker":"John Van Dank","text":"Will people leave the conference in a panic? Yeah."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":2886.07,"end":2927.53,"speaker":"John Vervaeke","text":"No. No, that's not what I want. I want people to leave the conference with a profound sense of discernment that will allow them to address this. That's what I most want people to have. And I don't think that answer is going to come from me. I think it's going to come from all of us and all of the people who come. Just like, that's what came out of. Like, that's what came out of thunder Bay. Right. It wasn't any one of us. I'm really hoping that I'm sort of placing my faith in that the spirit will be able to engender there will give us some disclosure about how to orient ourselves right now."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":2927.53,"end":2928.41,"speaker":"John Van Dank","text":"And I like making."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":2928.49,"end":2929.81,"speaker":"Jonathan Pageau","text":"You don't know. I don't know."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":2929.81,"end":2930.17,"speaker":"John Vervaeke","text":"Right."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":2930.25,"end":2999.53,"speaker":"Jonathan Pageau","text":"Like what is happening. I mean I have my kids, they're young so they're more. They just, it's. They, they're. They're. It's seeping into them really fast. It's like I don't use Chad GPT. I'll be honest, I tried it for like 15 minutes, got bored with it. But my kids, they unders. They can see like what this is and they intuitively just go straight to it. And, and so, and then every conversation now every other conversation I have is, is someone telling me about that in church, in anywhere I go. It's. That's what everybody's is. Is talking about. And so I think John, you're right. Like this is what. There's an explosion happening before our very eyes. And it's funny that I didn't, I didn't link it to. I was thinking more about the problem of, you know, the problem of, of the relationship between technology and intelligence and, and, and how humans fit in that. But I didn't realize or I didn't think about the question of home and how in some ways it's, it can blow us out of the. Like it just blow up our, our parameters for what we consider to be and even like what our place is, you know, because I didn't. Because that's what it is ultimately it's like what's our place?"}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":2999.85,"end":3076.55,"speaker":"John Vervaeke","text":"Think about the irony the Enlightenment was which was Promethean and said no, no, human beings are all what history is all about and the telos and now the Enlightenment has betrayed us because it might put us in the hands of non humans in a powerful way. And the one thing that sort of tutored us about how to live with beings beyond us, religion has been undermined by the history. So we're sort of like oh right, maybe we aren't ultimate. And oh no, what do we have as a resource for dealing with that question? Well, stuff we've been taught for four centuries to not really believe it. And I'm not advocating a return to religion because I think this is going to have an impact on religion like the printing press had on religion. Religions are not going to be untouched by this. They're going to be profoundly challenged. And I would argue Even transformed by this. But nevertheless we like this is in some sense. I hope I'm not misunderstood. I hope people will also wait before they jump on this until they've seen my video essay. But I think this is ultimately a religious question. These machines. Yeah, really profound way. It's about what is our place in the cosmos and is it the place we have believed it to be for quite. For several centuries. Right."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":3077.03,"end":3150.78,"speaker":"John Van Dank","text":"I really appreciate your. You're talking about it as a. As a wrestling and an attempt to discern these different dynamics. And it's going to be fall on in some degree on Catherine. I think to find we. We're going to have to together find some kind of a balance between the individual presentations that will be forthcoming from each of you and then some conversations that will take place amongst yourselves. But Paul and I have already talked about how we definitely would like to make room for people in their own small groups and conversation groups to. To be able to wrestle with these questions on the ground themselves, amongst themselves and to kind of see a pattern emerging that they can do that henceforth. In other words, that this is not a one of kind of thing where, you know, we're going to go to Chino and we're going to try and solve all the world problems, but rather that we, you know, we. We not only have a sense of what are the issues, but we also have a sense of how can we process the issues along the way down the road. So that's going to be part of the goal, I think for this conference. We have to make sure we leave enough time for that to take place."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":3151.18,"end":3220.44,"speaker":"John Vervaeke","text":"I think we have to give that a priority. I mean, I think I would hope that one of the things that comes out of the conference is people have a guiding sense of what it is to exemplify being able to feel at home in the world in a way that is not fantasy or spiritual bypassing or all the other temptations that are going to arise for people right now. So yes, very much like don't tell me what you believe, tell me what you practice. It's got to get into where people will see realize for themselves in these groups. Like what can they practice that will be like the best possible way of responding to this Kairos. I have no doubt that we're now in a Kairos. This is a Kairos just absolutely pivotal one of it could be. It's not crazy to say this could be the biggest turn in history. And so we are here now and we have to try and we have to try and Help people as much as we responsibly and best can you very much. John, I totally agree. I don't want this to just be talking about it. That's the time for just talking about these things is passing."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":3221.08,"end":3225.48,"speaker":"Paul Vander Klay","text":"Catherine, you wave your hand if you want to get words in edgewise, and I will make sure I make space for you."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":3225.48,"end":3281.11,"speaker":"Catherine","text":"I got a few words to start. Sneak in. John, I really liked what you were saying about the need to complicate things first before we try to answer the questions. And so two things were coming to mind as you guys were talking. One was the image of sort of Odysseus and Abraham, these two versions of spiritual quests. Something that struck me is, now you guys can correct me, but it seems to me that those appear to be more masculine versions of this quest. But the feminine version of the quest is how do you maintain the home? Which is a different type of quest, even though you still stay in the same spot. Usually, although not always, if you leave, it's usually the feminine role to reinstantiate the home, to rebuild the home. But often the story is there's a home to come back to. And usually it's some feminine element maintaining that space."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":3282.1,"end":3308.38,"speaker":"Jonathan Pageau","text":"In Odysseus, that's clearly the case. Penelope is a wise trickster, you know, holding off all these. These suitors and, and kind of actually making and unmaking the home. Right. She's weaving and unweaving and she's kind of leaving the. The. The home in a kind of flux in order to prevent a new seed, like a new identity of taking over. It's a pretty astounding imagery that's used in, in. In Ulysses."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":3308.46,"end":3317.66,"speaker":"John Van Dank","text":"Sarah also has a rather unique story in Abraham's homecoming. Perhaps not exactly as admirable as Penelope, but it's a story just."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":3317.74,"end":3320.46,"speaker":"Paul Vander Klay","text":"Well, Sarah and Rebecca are both under threat."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":3320.7,"end":3321.42,"speaker":"John Van Dank","text":"That's true."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":3321.58,"end":3349.12,"speaker":"Paul Vander Klay","text":"Because, you know, it's interesting that Abraham sojourns. He's got to go into Egypt. And so in a sense, Abraham commits domicide when he says, oh, that's my sister. And I think there is a lot of domicide that happens out of fear of self preservation. And, you know, one of the things, as you guys were talking to there, there's a lot of class element in this. I often reflect. So I have a cousin who is just a few. A few months different than myself."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":3349.68,"end":3350.08,"speaker":"Jonathan Pageau","text":"He."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":3350.16,"end":3416.23,"speaker":"Paul Vander Klay","text":"His family was blue collar. My family was, you know, my father's a preacher. We moved around. He stayed put. He's a welder. So he works with his Hands. I'm a pastor. I work with my words and my mouth and, and I look at the shape of our lives in your hand and my hands, I've, I've lived in. He's lived in the same town his whole life. And you know, that's, that's a piece of this, this too, that, you know, people. John, I really. John Vervecki, I really like that, that, that homesick idea because, you know, it seems like 30, 40 years ago people would brag, oh, I'm a citizen of the world, in a way, saying, I'm rootless. I get married on a pretty beach someplace. I dine with high status people over in this area. And there's almost a flagrant celebration of rootlessness. And so I don't know, Catherine, if you wanted to continue with your point."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":3416.87,"end":3516.94,"speaker":"Catherine","text":"Well, I actually want to jump off what you were saying because that leads into my second point. When John was talking about the homesickness, the book that came to my mind was Andrew Sullivan's book, Far from the Tree. I don't know if you guys have read it, it's a fat one. But essentially it's a number of interviews where he talks with people. He was a gay man, he grew up in a conservative home, felt very much like he was the fruit that fell far from the tree. And so it's a number of stories with people who are far from the tree. So he interviews criminals from families that aren't criminal, geniuses, people with particular disabilities, particular abilities, anything that exceptionalizes them and separated them from their home. But what made that come to mind was because it's such a. I feel like that has become more the ideal now. So in the past, you had the homesickness, you, you missed home, you wanted to be there. But now it seems like most of modern culture, people are encouraged to define themselves in opposition to their home. And so being far from the tree isn't experienced as a hardship, although it may actually existentially be experienced that way. But we don't culturally define it that way. We culturally define that as your true identity, which is understood in opposition. And I wonder how much that dynamic, if we could explore that and engage with that, might answer some of this domicide that we have. Because I just see that as sort of the inverse of the book that you're reading. John."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":3517.82,"end":3628.1,"speaker":"John Vervaeke","text":"Yeah, I was very. Thank you for saying that. I think you said it better than I did. I'm very interested in that. That. Yeah, we've got this. We got this. We got the loss of homesickness as A positive, and it's now become a negative, as you said. And we, in fact, we define maturity as people, as, as leaving home in an important way. I, I think that was very well said. And of course, that's very problematic for the millennials because many of them are still living at home and many of them know that they're not going to have a home. Well, I'll be more careful. They're not going to have a house. They know they're not going to have a house. They know that my son is going through that right now. He's living with me. And he knows. And he's like, he's working full time. High school biology teacher. That used to be the kind of job that you could build a home and family around. And he's still living with his dad. And that's hard on him. I mean, I try to not be here as much as possible so he can feel like it's his place. I'm sorry, he's very helpful for that. But, but like this, this is part of it, right? So there's a double, there's a sort of a double whammy on these, on these kids because first of all, they're not allowed to be homesick because of the cultural thing, but then they can't fulfill the cultural thing because the culture is basically giving them the finger when they try to do it. And the Phillips are saying, oh, no, no, no, you want to leave home. Not for you, not for you. Right. And, and so, yeah, I mean, I think I'm worried, I'm worried that there's already a powder keg of resentment and then these machines are going to disenfranchise, I mean, economically, even more people, and the resentment is going to become like, murderous."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":3628.58,"end":3737.13,"speaker":"Paul Vander Klay","text":"It's interesting. You know, we talk about transformation and in, in, let's say, wisdom oriented, you know, we want transformations. I think, John, that really gets into your both because you transform from something, but that really much more gets into the horizonal aspect too, because you want to transform into something that is, you want to transform actually into. You've talked a lot about this in your work, John. You know, who, who you are to become. There's that, that's, there's that second self that you talk about. And, but, but there is a, there is a necessary domicide that happens in transformation. Jordan Peterson, I think, talks about that well, too, in terms of. There's something that has to break in order for something to be reformed. And Jonathan, your point too, about every Thanksgiving, one of the things that goes through the culture, especially sort of the. The Zoomer class culture, those of us who are citizens of the world, oh, I have to go back home for Thanksgiving. Oh, I have to endure my racist uncle or my. My henpecking mother or my withholding of approval father. And I mean, we have all of these cultural memes around this. Very much an anxiety and even an anger in some ways, with respect to home. And John Verveki, what you just said. And then if you sort of get trapped in home now, and this just coming out of COVID where, for example, I had three of my adult children back into the house for the beginning of the pandemic, at least. And so there's. There's a lot going on in this space."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":3738.09,"end":3744.09,"speaker":"John Vervaeke","text":"But here's something that I like. Again, I'm trying to not give away all the secret sauce, but."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":3744.09,"end":3745.09,"speaker":"Jonathan Pageau","text":"Yeah, yeah, for the."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":3745.09,"end":3748.29,"speaker":"Paul Vander Klay","text":"For the conference, John, tease them."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":3748.29,"end":3748.89,"speaker":"John Van Dank","text":"Save some."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":3749.29,"end":3772.23,"speaker":"John Vervaeke","text":"Because, I mean, there's another myth. There's the Odyssean and the Abrahamic. And yes, Catherine's right, we should pay attention to the feminine side of those myths. So that's a very good point. But the. There's Plato's myth of anamnesis, that when you get the. The most. The most significant anagogate is also an act of deep remembrance. Right."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":3772.23,"end":3772.47,"speaker":"Paul Vander Klay","text":"And."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":3772.47,"end":3811.78,"speaker":"John Vervaeke","text":"And. And that your. Your highest aspirational fulfillment of transformation should bring you into the deepest acceptance of your finitude and mortality. Right. And so I. I think Plato is wrestling with the tension that we're bumping up against here, and he's saying, it doesn't have to be like this tearing. There is a way in which we can find. Right. There's a way in which we both. And this sounds like a paradox even to say it, we can reach for the horizon as we are gathered very, very deeply back into home. And that is also something that I want to propose as something we need to. Is that."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":3811.78,"end":3812.3,"speaker":"Paul Vander Klay","text":"Definitely."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":3812.3,"end":3867.65,"speaker":"Jonathan Pageau","text":"I think it's great. Memory is. I mean, we talked about memory. We talked about that in our last discussion. Sorry, it's not online yet. So, like, memory seems to be part of that question. Like, because I think of the story of Joe, of Jonah and. And the fish. You know, how God tells Jonah, go, go here, right? So he's telling him to leave home and go to this other place. And he. He doesn't want to. And then because of that, he finds himself in death, right? He goes down, but then when he's in death, it's actually connecting the two together that makes it work. He says, I Remember God? I remember the holy place. I remember the temple. I remember, you know, the, the, the. This holy place which is his home spiritually. And because of that, then he's willing to, to move. It's like this idea that if you're connected in memory, then you can go far because you don't lose yourself completely. You, you have this anchor and then you have the, the capacity to see the horizon."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":3867.81,"end":3918.55,"speaker":"John Vervaeke","text":"And, and that reminds me of the psychological research around secure attachment, right? That it's the person who has actually the, the child that is actually properly religio to the parent that actually is capable of exploring. And when you're reading the adult attachment literature, they, they're very sort of critical of the dependency myth. You shouldn't be dependent on anybody. But they're saying, no, no, no. Human beings actually explore most when they are deeply connected to somebody else that is original for them in the way I'm trying to use it. And so that is also. That to me is also, you know, holds open the possibility that we have within us ways of being, ways of becoming that can address this tension, this problematization that I've also been pushing on. I'm giving away. I feel like I'm giving away too much."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":3918.55,"end":3945.19,"speaker":"Jonathan Pageau","text":"All right, so. But then I have to tell you that the whole question of home is pressing on me right now because I, it's. It's actually past the time that I should go back with my family and help with dinner and do all that stuff. You know, the time got changed last minute and I'm like, wait a minute. So, so I actually have to go and leave and leave all of you and, and, and give my last invitation to everybody who's watching this to, to come join us in Chino because I, it's going to be a lot of. It's going to be a lot of fun."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":3945.43,"end":3948.47,"speaker":"Paul Vander Klay","text":"All right, go ahead, Jonathan. I'll close out after you're gone."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":3948.47,"end":3950.15,"speaker":"Jonathan Pageau","text":"It's good to see everybody. Bye Bye."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":3950.15,"end":3950.51,"speaker":"Paul Vander Klay","text":"All right."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":3950.51,"end":3952.39,"speaker":"John Vervaeke","text":"Bye bye. Take care, Jonathan. Bye."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":3952.39,"end":3952.63,"speaker":"Paul Vander Klay","text":"Bye."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":3952.63,"end":3953.51,"speaker":"John Van Dank","text":"Bye, Jonathan."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":3953.59,"end":3979.35,"speaker":"Paul Vander Klay","text":"No, I think, I think, John, you're giving us a, you're giving us a real. You're giving us some, some good hors d' oeuvres in terms of what we're going to want. Because when you start unpacking this, you begin to realize that this, I mean, quest, as, as we talked about quest is. It's not just a. It's not just a. Oh, there's a destination here. I have to get there."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":3981.03,"end":3981.39,"speaker":"John Vervaeke","text":"Right."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":3981.39,"end":4047.22,"speaker":"Paul Vander Klay","text":"I'm not exactly sure of the destination either. And, but there's a, there's a pull and a push that, that are coming along and we've talked about home and I think probably as with Thunder Bay, we won't be able to fit all of the words in one short weekend. But you know, the question is all, the question is also going to be, well, what on earth do we mean by a spiritual home? Because in this, I really like the language you gave it, John, in terms of it being horizonal, because that's going to sort of leave an empty space for understanding spiritual. It's not just emotional, although it is that, but it's orienting and it's active and it's moving. But it's also, you know, horizonal. I really like that word, John. That's, that's really helpful. Just want to say that Solomon, Andrew Solomon. S O L O M O N not Sullivan. When I heard you say that before, Catherine, I looked it up. Andrew Solomon. Far from the tree. Any other. I don't want to have too much conversation without Jonathan here, but I don't also don't want to truncate anything that needs to be said."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":4047.54,"end":4051.13,"speaker":"John Vervaeke","text":"I'm not going to say anything more more that would be valuable to other human beings."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":4054.49,"end":4056.49,"speaker":"John Van Dank","text":"Well, let's hear some nothingness then, John."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":4060.01,"end":4066.17,"speaker":"John Vervaeke","text":"I, I, I feel Jonathan's lack very, very significantly. Yeah. Yeah."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":4066.17,"end":4082.89,"speaker":"Paul Vander Klay","text":"So any, anything else? Any detail things. So this will come out on our various different channels. Ticket links will be below and I'll share those with all of you to include with your, your on your channels as well. There still are tickets still available. There still is camp sites available."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":4084.25,"end":4123.78,"speaker":"John Van Dank","text":"The only crunch is I am not 100 sure that Jonathan's trip to St. Andrew's Orthodox Church can accommodate many more people because I think he's going to be addressing the group about the icons that are in the church. And I'm not sure that it's easy to move around with, you know, more than 100 people in, in that church. And so I'm just thinking about the specific logistics. I hope to ask them about that, but that, that if you really want to participate in that particular feature on Sunday, you better get your name on the list. So that's all I can say about that."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":4124.02,"end":4128.82,"speaker":"Paul Vander Klay","text":"All right. Anything else? Anyone? Catherine, you're, you're okay to travel to the United States?"}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":4129.88,"end":4133,"speaker":"Catherine","text":"I think so. I don't think it's been lifted quite yet, but I'm sure it will."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":4133,"end":4134.84,"speaker":"John Van Dank","text":"No, no, Today, Today, Today."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":4136.04,"end":4136.6,"speaker":"Catherine","text":"Good to go."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":4136.6,"end":4140.76,"speaker":"John Van Dank","text":"He signed the thing that the emergency has been officially lifted."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":4141,"end":4141.56,"speaker":"Catherine","text":"Perfect."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":4141.56,"end":4154.92,"speaker":"Paul Vander Klay","text":"Catherine is Free to move about the country. Good. Well, thank you all for your time and we look forward to get your tickets below. We look forward to seeing many of you at in Chino, California coming up in May."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":4155.4,"end":4157.96,"speaker":"John Vervaeke","text":"Please come everyone. It's gonna be, it's gonna be amazing."}
{"episode_id":"SW - #283 - 2023-04-26 - John Vervaeke and Paul VanderKlay - The Quest For A Spiritual Home Conference Warmup","start":4160.36,"end":4242.79,"speaker":"Jonathan Pageau","text":"I'm really excited to announce that we have just put up the new Symbolic World website. This new website, you know, marks the return of the blog, Symbolic World blog, the return of the reading list and also a brand new symbolic world community which is accessible and will be hosted directly on the website. This community community can be accessed by anybody who subscribed to the Symbolic World. For those who are who were already subscribed and supporting us at different level of patronage, either through PayPal, Patreon or subscribestar, all you need to do is put in your email address, you will get a reset link for your password and you are in. And for everyone, everybody else, it seems like a good time to join the Symbolic World to access all these new things. Things. We're also offering a few new gifts to everybody who subscribes, even at the level of free subscriber. Just to thank everybody for all the support you have given us all through all these years. And I have to say it's just beginning. We will soon be announcing new courses. You know, Richard Roland is preparing a course on Beowulf. There are all these new projects, the new Snow White project, God's dog and the symbolicworld.com will be the place to, to follow this and to get news and you know, some, a few peak sneak peeks at what is coming in the future. So thanks everybody's support and like I said, we're just starting."}
