{"episode_id":"SW - #238 - 2022-06-28 - How Christ Saves His Father From the Underworld","start":0.08,"end":955.51,"speaker":"Jonathan Pageau","text":"So if you've watched Jordan Peterson videos, you have most definitely heard him talk about the Pinocchio story. And usually Jordan tells a very touching version of that story where he encourages people to go down into the belly of the whale to save their dead Father. And he sees this as an image of how the Father represents the past. The Father represents that which came before you. And in some ways, it is always dead. And we need the sun. We need an actualizing principle which goes back into the past or back into that which has been given to us and makes it live again, makes it, adapts it to the current situation. And Jordan usually uses the image of the story of Osiris and Horus with Isis and set as kind of the mythological backdrop for this story. But. But I've also noticed that a few times I've seen Jordan struggle to understand how this story jives with the story of the death and resurrection of Christ. He seems to see the story of the death and resurrection of Christ as a kind of flip inversion of that, where it is the Father that resurrects the Son. And I've seen him struggle to kind of understand that. So I thought. I've been thinking for years to make this video, but for some reason I'm just doing it now. So I thought we would look at the manner in which Christ saves his Father from the underworld, how ultimately, not only he does that, but it is what we could call the ultimate version of that story. And it also restores the notion, the difference between the fallen Father and the true Father, or the Father that is the source of all things. This is Jonathan Peugeot. Welcome to the symbolic world. So the manner in which Jordan caught on to this story, I think, is. Is very powerful. And he is able to gather a lot of insight from his interpretation of the myth of. Of Osiris and Horus and also the story from Pinocchio. So there's a sense in which the Father is dead, the Father is the past. The Father is this stuff that's been given to us, this tradition that comes before us, but that somehow is not living and breathing. And so the manner in which you make it living and breathing is by paying attention. That's why Jordan talks about this notion of the eye of Horus as being this attention which gathers all this past, all this potential into actuality and makes it alive, makes. Brings it together in a way that can be acted with, acted on, acted within. And he, of course, views the story of Pinocchio as one of the most beautiful versions of that, because Pinocchio in a manner, is made by his father as something which is not fully a boy. And by going down into the belly of the whale, going down into death and saving his own father, he, at the same time becomes a real boy, becomes a real person. And, of course, there's much to learn from that in terms of understanding how, you know, if we're able to give meaning, bring together that which has been handed down to us, make it actual, then it will also be the source of our own capacity to exist in the world and our own capacity to kind of to be something. And so. But like I said, one of the issues that Jordan has had is seeing that this doesn't seem to be the case in the story of Christ. Like, why is it that Christ dies? Christ is the one that dies, you know, goes into death, and then his Father is the one that resurrects him. And so the way in which we need to understand this is because we have to look at the greater tradition, we could say, in order to properly understand the story of the resurrection of Christ, how it connects to this particular strain of storytelling, we have to see the whole thing. And so in the Christian story, there's something which is hinted at, of course, in Scripture, but is elaborated in images and in a more story form a bit later in the story of Christianity. And it's something that we call the descent into Hades or the descent into death. We see a narrative version of that in the Gospel of Nicodemus. We see versions of it in the icon of the Anastasis that we call where we see Christian going down into death. Now, in this image, what we see is we don't see Christ going down into death, only as the one that is the victim. But now we see the inverse of that, which is that the secret thing that's happening on the cross, when Christ is sacrificing himself, he is ultimately secretly a victor. He is the one. That's why we have this idea of Jesus Christ victor. If you've seen a cross, a Greek cross with it says, you know, Jesus Christ Nika, which means Jesus Christ the victor. So what we see in this image, in this icon is we see Christ going down into death. And what he's doing is he is saving Adam. He is actually saving Adam and Eve. And this is the version of the Pinocchio story that the Christians have, which is that in sacrificing himself, Christ is ultimately saving his Father. Now, not his heavenly father. He is saving his fallen earthly father by doing that. There are many things that are going on one of the things that's happening is we're noticing that, how can I say this? Adam in the story of Scripture is seen as, let's say, the source of all the problems because he is the one that ate the fruit of the knowledge of good and evil. Adam and Eve are the ones that started this whole problem, the problem that Christ is coming to solve. And so by saving Adam, he is in a manner, saving all the fathers. He's not just saving his own father, he's saving all the fathers and he is covering for his father's lack by his own self sacrifice. Now, of course, you can see how this fractally applies to your own life, which is that we, as people, we can cover for the sins of our parents. This is an image that we see in the story of Noah, for example, where, you know, Noah, at the end of the flood, he finds himself drinking and drunk in his tent. And you see his sons, one of his sons comes and makes fun of him, you know, in the tent and laughs and tells his old, his brothers about what's going on. And the two, the other two brothers, they come in and they walk backwards and, and they cover their father. Now this is one of the things that we can do, which is to walk backwards and to cover the sins of our father. And so how do we do that? We do that by seeing the sins of our father. But instead of blaming our father, instead of blaming our parents for all our problems, we rather cover their sins. We cover their sins by our own transformation. We cover their sins by our own self sacrifice. That is, my father was a jerk. My father was a bad father who didn't care for me. Well, I am going to cover the sins of my father not by blaming him, not by accusing him, but rather by becoming the father that he wasn't. By taking care of my own kids. And by doing that, what I'm doing is I'm actually honoring my father and mother. I'm honoring my father in a way that is not naive. Right? I know that my father had all these sins, but I'm doing it in a manner in which I'm going to represent. I'm going to manifest something else and cover over his sins. And so this is, of course, this is of course, one of the things that the story of the resurrection is revealing to us. So what we see is that Christ going down into death and doing exactly what Pinocchio did, going down into death to save his father. He is saving all the fathers. He is, he is bringing this story to its Limit, let's say he is showing the totality of what this story is, which is that he is saving the Father of all Fathers. The very first man, the one for whom you could blame all the problems of all humanity on if you wanted to. That is the one that he is saving. And by doing that, he is, in a manner, reactualizing Adam. He is himself becoming the new Adam. And he is, let's say, creating a new origin as well for all of us. Now, that is one of the things that happens in that story. Now, the other thing that happens in the story is that it is also helping us understand that the notion that the Father, that God the Father represents tradition or dead tradition, is not of the right way to understand trinitarian theology. The idea of understanding the. The Father as the dead Father or the dead tradition, the dead law, all of these types of interpretations, which are completely accurate, which are very insightful, is about Adam. It's about the manner in which everything in Adam which is fallen and it is this dead letter, this dead law, all of this. But what it does is that it is true that in the story the Father resurrects the Son. So the Son goes down into death to save his Father, and then he is resurrected by the Heavenly Father. So what does that mean? What is that referring to? And so there is a manner in which the Father is the source of you. Quite simply, it's not just the idea that he is the dead letter or the dead tradition that brought about you. He is the living source of all things, and he is the living source of you. And so you could say that the Heavenly Father is the one that will resurrect you. If you sacrifice yourself to save your dead Father. If you sacrifice yourself to cover the sins of your Father, then you will be lifted up by your Heavenly Father. The Spirit of the Father will lift you up. And so this is, of course, I think, a good way to understand how there is a clear distinction in the Christian tradition between the fallen Father and the Heavenly Father. And that the heavenly Father is the true Father, is the source of all things, is that which everything leads to. And so it's not just that we as the sons, let's say, or that Christ as the Son of God, ultimately is there to actualize the dead stuff that's in re. Actualize the dead stuff that is in the ground, although that is something that Christ does. Every time Christ says, you know, shows the meaning of the law. Every time that Christ says, this is the root, you know, this is the all of the law is contained in this, you know, all the laws contained in love God and love your neighbor. What he's doing is he's actually breathing life back into the law. He's showing how the law is not just a bunch of stuff you do, but that there's a principle, there's a core, there's a logos. And behind all these rules, which if you find the logos, if you find the principle, will illuminate the rules and will also make the rules secondary to that logos. That is, of course, definitely something that Christ is doing. But the actualization of this dead past, or the actualization of the dead man or the dead law, all of these things that Christ is doing has to be rooted in something else. It has to be rooted in heaven. It has to be rooted in the source of all good. So it's not just about, you know, actualizing it for whatever reason. It's actualizing it towards the good, towards the source of all good. And so this is why, you know, Christ is always saying things like that he doesn't do his own will. He doesn't do. Because you could actualize the past in a very manipulative way. You could look at these laws and these things, this tradition that has been given to us, and you could try to steer it in a way which is only to manipulate it toward your increase in power. And you see that happening all the time. That's how tyrannical systems come to be. That's how people twist things, twist what you've said, twist what they read in order to bring about their own agenda. But Christ can only actualize the dead Adam, resurrect the dead Adam, you know, in the name of the ultimate good, in the name of the Heavenly Father. So you can see the difference between this idea of the source of all things, the Father as the source of all things, and the dead Father, which is indeed what you see in the way Jordan interprets it as this kind of dead, you know, this tradition, or these things that have accumulated, or all these things that we've received from the past that are fallen and need to be remembered in order to be brought back together. But without the notion of a heavenly Father, then this idea of just paying attention and of, let's say, remembering these dead things could be done in a way that's manipulated, but you need it to be pointed towards the highest good and the image of the source of all things, that is the Heavenly Father, and is, of course, the ultimate version of that. And so I think it's really important to understand that because if you try to interpret the Father, the God the Father, in the notion of the Christian Trinity as this dead tradition, then you're going to run into many, many problems. You're going to run into the fact that that's just not what it is and that's just not the way it's presented in the Christian tradition. And so you'll have to force it, you have to twist it in order to make it that. But if you do understand Adam as being exactly that, then it all kind of comes together and you don't have to twist the tradition in order to bring about this story. You don't have to make the notion of God the Father say something that no Christian theologian, no Christian thinker would ever have said in the past. And so I hope this is helpful both in showing how I think the insight that Jordan takes from the story of Pinocchio and the whale and the story of course Osiris and Horus is really wonderful and is really helpful for us today. But that there is of course a Christian version which also includes the notion of the source of all good as being that for which the Son acts in healing, in resurrecting and you know, bringing shedding light on the meaning of the things below. So I hope this was useful for everybody to kind of understand and talk to you very soon. Bye bye. I hope you enjoyed this episode of the Symbolic World. The Symbolic World is based on a series of videos that you can find on my YouTube channel, Jonathan Pedro's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course leaving a review on itunes. Everybody knows that's the best way to get the podcast out there, to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon, the Pageot videos as well and on SubscribeStar, all those links you can find on my website or in the show description. So thank you and I will see you soon."}
