{"episode_id":"SW - #081 - 2019-12-18 - The Inevitability of Ritual","start":0.4,"end":109.23,"speaker":"Jonathan Pageau","text":"So one of the things we hear in the modern world, we could say it really is a modern phenomena, is this idea that there's somehow something weird about rituals that, you know, you hear it in that we want things to be informal. We want things to be natural and that somehow rituals are artificial. We have this idea, you know, everybody has heard some Christian come up to them and try to convert them and say something like, you, you know, what I believe isn't a religion. What I believe it's a relationship, right? I don't like religion. I'm spiritual, but not religious. I want a relationship with God or a relationship with the universe. But this whole idea of ritual and liturgy, all of this is somehow inauthentic, you could say, and that there's this kind of raw authenticity that we can get to. And so hopefully we can look at that. And I'm going to try to show you guys that in fact, rituals are inevitable. This is Jonathan Pageau. Welcome to the symbolic world. There really is this idea of like a pure. This idea of like pure unadulterated relationship, right? This idea of pure connection, this notion that, you know, you can be. And that is related to being informal. And so we get this idea that somehow intimacy is informal, that, that, you know, to be able to."}
{"episode_id":"SW - #081 - 2019-12-18 - The Inevitability of Ritual","start":109.23,"end":109.59,"speaker":"Announcer","text":"To."}
{"episode_id":"SW - #081 - 2019-12-18 - The Inevitability of Ritual","start":110.12,"end":816.18,"speaker":"Jonathan Pageau","text":"To walk around in your underwear and your belly out. That if you're. If you can do that with someone, it means that, oh, yeah, that's real intimacy. You know, it's like the more informal you get, the more that, that's. That that's intimacy. But that's not. That is. That's a strange misunderstanding of how human relationship work. In fact, human interaction is inevitably ritualistic, and we need to understand that. If you want a way to understand it, to simply try the opposite, right? Try to do the opposite of how usual human relationships work and you'll notice just how ritualized our behavior is. You know, I've given the example before to people that, you know, if you think that you are not constantly engaging in ritual behavior, try this, right? Try just staring at someone for like three minutes nonstop and see what happens. You know, that person will become extremely uneasy, right? Try, try to, you know, I don't know, try to. If you're. As you're talking to someone, try starting to pick your nose, let's say, and see. See what happens as you're talking to them with your finger up your nose, right? We don't realize to what extent are our inter. Human interactions are coded and are ritualized. You know, when you speak to someone you, you look at. You look at them in the eye, but you don't look at them in the eye for too long. You look at them in the eye. Then you kind of look somewhere else and you look at them in the eye. There's this rhythm of looking. There's also a rhythm of exchange. You know, you have to say something for a little while and then stop and then let the other person speak. And there's a kind of dancing that appears in our relationship. That rhythm, you know, is a ritualized reality. There are all kinds of other rituals that we have. We say hello, we shake people's hands. We, you know, you don't speak to someone if you're. You don't stand behind someone in order to speak to them. You stand in front of them in order to speak with them. And the thing that's interesting is that I know I can already hear some of the arguments that people will have is to say something like, yeah, of course. Yeah, okay. We have these social standards, these social manners in which to interact. But they're natural, like they're based on reality, right? So if you stand behind someone and you speak to them, then they won't hear you as well. They won't be able to see your facial expression. And so. And that's why we stand in front of people. And, you know, it's like it's normal to extend your hand to someone. Shaking someone's hand, you know, it's related to a gesture of goodwill. It's showing that you don't have something in your hand like a knife or something that you could hurt them with. You know, saying hello is the same. You know, you put your hands out, you're showing that you're not there to hurt them. It's like all of these are meaningful and they're related to reality. And so the answer is, of course that's true. Of course it's true that all these mini rituals, the ritual of looking, the ritual of this rhythm of speech, you know, also the, the, the, the. Even the. The question of space between people, there's a. There's a certain. Different cultures have different amount of space that you're allowed to be in depending on who you're with. And although it changes with cultures, there is a universal reality, which is that there are different spaces in which you can be in relation to someone depending on your level of familiarity with them. You know, all of this is analogous to sacred space, to sacred rhythms, in terms of chanting, in terms of procession, all of these are the same. And what's funny, especially for the argument saying that these rituals are natural or that they're meaningful. It's like, well, so are the religious rituals, right? You know, in a church, the actions that you pose are related to the reality of that you are facing. So everything we do in church is not arbitrary. It's not arbitrary rituals. The rituals are exactly the same kind of rituals that you have in interaction with your friend or with a stranger. And so when we are in church, we do things like bow, we bow before God. We bow before something which is higher than us. And what that is is acknowledging your position regarding someone else. But we do that even amongst ourselves, right? We bow our head like men, you know, so you see someone, you bow your head. What do you think you're doing when you're doing that? You're saying, I'm not putting myself above you, I'm recognizing you, I'm bowing my head to you, I'm recognizing you as I'm kind of putting myself under you to a certain extent. But it ended up being, if the other person does the same, it ends up saying like, we're together, but in church we bow to God. We also bow to the priest, the priest bows to us. And, and then we do things like kneeling, all of these. Making yourself lower is in relationship to something, to elevate something higher. You know, we do things like, we do the sign of the cross. Like if you're bothered by the sign of the cross, but you're not bothered by hello. It's like, why does this, why does the sign of the cross, why is that strange that as you are engaging in something sacred, you would make a gesture with your hand? But, but it's not strange that if you're engaging with another person, you're making a gesture with your hand. It's like there's nothing strange about either one of them. They're just manners and they're natural manners, like the sign of the cross. I mean, I could go in, I wouldn't want to go into the symbolism of the sign of the cross, but maybe I'll make a video about that. The sign of the cross is completely coherent in terms of centering yourself, placing yourself in relationship to God, but also bringing, gathering your, gathering your, yourself, let's say, into, into your heart. We can go into that later. But it's the same for all the rituals. And you know, like, I, I, I've talked to you about this before. This idea of standing together, looking in the same direction, all looking at, at, at, at, at the altar, all looking to that sacred space at the same time, singing at the same time, reciting at the same time. You know, that's a very powerful thing to say words with other people at the same time. What do you think that does? It's not arbitrary. It's a manner to bring ourselves together into the same vision, into the same line, confessing things together. All of that is completely coherent communion itself. The ritualized eating is a hyperversion of all of us sitting around the table, eating from the same food. And all the, you know, this idea that if you're able to sit around a table with your family and everybody speaks in turn and everybody is respectful of the other person and everybody is also leaving food for the others. All of these are ritualized behaviors that we totally understand. And you only know that you can only realize that it's ritualized behavior when you have someone who does the opposite. If you have someone who comes to your house and is arrogant and is a jerk and, and sits at the table and just starts grabbing things, putting them on their plate, starts eating with their mouth open, is talking while they're eating and is being arrogant, is taking up all the room and not letting other people speak, you'll realize just how ritualized your proper dinner is. And so communion, where we all come together to the same cup, to the same table, and we eat and drink together, right in our desire to be united into Christ. It's the same as the, you're not the same. It's like I said, it's a million times more. But it's the same structure as you gathering around the table with your family and eating together in a manner in which to show your unity. Not to show, but to participate in your unity as a family. So it is very important. Another aspect which is important to understand is clothing, for example. And so one of the things that you hear, especially in certain kind of non denominational Christian context, is that, no, no, like, you know, they would never want their person in front to be wearing a vestment, to be wearing a, you know, like, oh, who does he think he is? You know, he's trying to separate himself from the others. He's trying to wear this thing that separates him. No, the pastor just dresses like everybody else. You know, he wears a shirt and ripped jeans and you know, he's got his hair kind of messy and sits on the side of the stage and it's like the. Do you think that that's not a ritualized behavior? Do you think that rebellion, it doesn't have a pattern. Rebellion has a Pattern. Informality also has a pattern. Even as you move towards the informal. It's part of the meta pattern. Just like that's why I keep talking to you guys about monsters and death and all of this. It's all part of the meta pattern. And so if you think that being informal is, isn't, doesn't have a structure, it totally has a structure. Because we recognize someone who is acting informal, we recognize them right away. I keep joking about how it's like I can recognize a punk from a mile away, and he's being a rebel, but he's following those rules. He's following the pattern of what it means to be a rebel, what it means to be a punk. And so to sit on the stage with a ripped shirt, with a T shirt and ripped jeans is also ritualized behavior. The question is, what is it patterning? Like, what reality is it patterning? Is it patterning something which is there? It depends why you're in church. Like, are you in church to worship God? Are you in church to recognize that there's something above you, that we're all going to gather together in reverence and in honor of the thing which is above us in order to unify us? If that's what you're doing, then maybe wearing ripped jeans and a T shirt and sitting on the side of the stage and having your hair all messy, maybe that is not symbolizing that. Maybe the ritual you're engaging in is not the right ritual, but it's still a ritual. You can't avoid it. And like I said, if you are a pastor and you're the center of attention and everybody's looking at you, what you do and what you wear is going to be meaningful by the very fact that. That you are the center of attention. You cannot avoid it. You cannot avoid manifesting meaning if you are the person towards which everybody is turned. Now the question is, what meaning are you manifesting? What ritual are you participating in? What pattern are you engaged with? If you engage in a pattern which tries to negate the reality of what you're doing, which is that everybody's there and everybody's there and everybody's looking at you because you're in the front, you're the one who's supposed to interpret the Bible or tell, speak the word of God, but you want to act in a manner which denies that it's a kind of schizophrenia. It's a kind of. The worst thing that it's not always, but the worst thing that can happen is that you are actually eliciting that in people like you are going to be just like the rock star also has everybody's attention but then their behavior has. As everybody patterns their behavior on the rock star is to elicit, you know, the, let's say the lower side of our patterns. We could call them, you know, the more libidinal. The more libidinal dancing, the more libidinal patterns rather than. Rather than a waltz, rather than something which is beautiful and elegant and you know, which manifests how the world can fit together. So. So anyways, I'm really hoping that that is a little hint at how rituals are inevitable. I hope you enjoyed it and alright guys, I will see you again soon."}
{"episode_id":"SW - #081 - 2019-12-18 - The Inevitability of Ritual","start":817.54,"end":882.54,"speaker":"Announcer","text":"I hope you enjoyed this episode of the Symbolic World. The Symbolic World is edited by Justin Ward and it is based on a series of videos that you can find on my YouTube channel, Jonathan Pedro's YouTube channel. You can also get involved There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course leaving a review on itunes. Everybody knows that's the best way to to get the podcast out there to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon Pageau videos as well and on subscribestar. All those links you can find on my website or in the show description. So thank you and I will see you soon."}
