{"episode_id":"SW - #040 - 2019-07-06 - Explaining Elisha and the She Bears to Joe Rogan and Douglas Murray","start":0.56,"end":722.51,"speaker":"Jonathan Pageau","text":"On this episode of the Symbolic World podcast, I'm going to play a video I made in response to a podcast between Douglas Murray and Joe Rogan. In the podcast, they made fun of some stories in the Bible, especially the story of Elisha and the she Bear. And so I tried to show its coherence and also to show how we need to be careful with these ancient stories when we mock them. Looking at them at first glance, we can often miss the deeper meaning and the deeper understanding which it contains. This is Jonathan Peugeot. Welcome to the Symbolic World. So in this discussion, Joe Rogan and Douglas Murray start talking about the. The idea of wool and linen and how it's so, you know, disturbing that in the Old Testament you can't mix the two types of cloth. By the way, for those who want, you can check out. I actually made a video on that subject trying to explain why it's important. So you can check that out. I'll probably put a link of that down below in the description. But that's not what I want to talk about now. What I want to talk about is the story of Elisha, which was the book where the guy called upon the she bear to kill the children who were mocking his baldness. Do you know about that one? No. My favorite, especially as a bald guy in that story, Elisha with Elijah, who is his master. There are two prophets, and Elijah is going to go away. And in order to go away, they cross this river, they cross the Jordan river, and then Elijah is taken up into heaven, and. And as Elijah is taken up into heaven, then Elisha receives these garments of Elisha and receives a double. Take a double portion of the spirit of Elijah. And these garments are these woolly garments, these hairy garments that the prophets wore, let's call them these garments of skin. And so Elisha gets these garments, and with the garments, he hits the Jordan and the Jordan separates into two. And then Elisha crosses over. And then on the other side, as he's moving about, I think it's the second story. There's a story just before that, but the second story after that is this story where a bunch of yous come up to him and they start to mock him, and they call him Baldy. And they're saying, hey, baldy, get out of here, Baldy, get out of here. And because of that, Elisha turns to them, gets angry, curses them, and. And then these two mother bears come out and they devour all these young men. It says devour 42 of them. So I can understand Joe and Douglas if you ever listen to this? I can understand why you find that story strange, but I would say you have to be very careful. And I hope that. You know, I think this podcast was a bit old, and I think now that you've been listening to Jordan Peterson a little bit more, hopefully you'll have a little bit more reserve when you start making fun of these stories. And so I am going to explain the story to you now. To understand the story, just like most stories in the Bible, you have to understand the patterns. You have to understand that this story of Elisha and the she bears is a repetition of patterns which were there before their repetition of. I will show you one of the examples of this pattern. Now, Noah, he comes to the end of a world, you know, and Enoch is taken up into heaven, just like Elijah is taken up into heaven. And after that, Noah has to cross an expanse of water, just like Elisha had to cross the Jordan. Noah doesn't use the garments of skin of animal skins, but he has a boat full of animals, which is symbolically very similar. And so Elisha uses these garments of animal skins to cross over the water. And so what he's doing is he's actually in this moment of transition. He's crossing over to a new world, a new beginning, you could call it. But in the new beginning, in this transitional space, a lot of things can happen. A lot of crazy things can happen. And when Noah crosses over after that, there's a story where just after he crosses the flood, Noah takes his clothes off, gets drunk, and then he's lying there naked in his tent, and his son comes in and sees that he is naked. And then he goes to tell his brothers. Now, what's implied in the story is that he's making fun of his father, or he's criticizing his father for being naked in the tent. And then because of that, the son of Noah who saw him is cursed. And he becomes like a cursed people in the world. And you think, huh, well, that's strange. Well, you can see, first of all. You first of all have to see the pattern. Now notice the pattern. Elisha crosses the waters with these garments of animal skins. Then when he's on the other side, he is criticized for something that he lacks. He's criticized for his nakedness. In this case, the fact that he's bald, the fact that you can see his head. And so this notion of criticizing, exposing the nakedness of someone, this is an important theme in the Bible, the idea that when you do something, certain things that you can do will Expose someone's nakedness, will expose their vulnerability, will expose their weakness. And the danger in doing that is there's a process, there's a pattern by which that will then turn against you, and that will create something like a curse against you, the curse of the mother bear that comes out and eats them. You can really imagine it as this kind of grumbling feminine energy that comes up and then devours you like. Like a sea monster coming out and eating Jonah. Or, you know, this idea of the. Of this chaos kind of pulling you down, let's say. And so that's what it refers to. Now, the reason why it's she bears, the reason why it's animals has to do with this idea of covering and this idea of the animal skins, the idea of the animals in the ark, this idea that we cover ourselves with, let's say, these animal desires that we have around us, they act as a way to protect ourselves in the world. Everybody understands that. So, you know, you're hungry, you have sexual desire. All these things are there to help you survive in a difficult world, but they're also the thing that can pull you down, you know, so if you let yourself go too much to your hunger, then you become fat. You become, you know, you're taken over by that passion. If you let yourself get taken over by your sexual desires, then you become obsessed with that and you lose your focus. You can get a disease. You. You know, everything about letting yourselves go to these passions that kind of eat you up and drag you. And so the danger of exposing someone else's nakedness, of exposing someone else's lack, is that then you will become. You will be eaten by the thing that you are criticizing them for lacking. And so you see that the children criticize the nakedness of. The nakedness of Elisha, and then they're eaten by these animal passions that you could imagine, that they're eaten by Elisha's garments of skin, those skins that he used to cross over, those skins that he used to survive in the world. Now, you still, I know a lot of you will think, what does it mean? What are you talking about? What is this? What does this have to do with anything? Well, we are going through that right now. We are experiencing exactly this story of Elisha and the 42 ewes are being eaten right now. It's called the MeToo movement. Some people in Hollywood, some actors, thought it took it on themselves, and Hollywood in general, to criticize certain behaviors, to poke at the nakedness, at the weaknesses of others in high power and then what happened? Those very people who accused others of that weakness. Then all these women appeared and started to say, yeah, but you too, you are guilty of the thing that you're accusing me of. And those people got devoured by their own weaknesses. And so that which we hide, we have these sins, we have these passions that we hide for a reason. There are many reasons why we hide our passions. One is so that society can continue. One is that because we're ashamed of them. One is that because we're trying to, hopefully trying to get away from these passions. But when you expose someone else's passions, then you run into the danger that those passions will then devour the person who's criticizing, you know, and you see it. It's so funny because it's a trope that everybody understands. We've seen it. We've seen even people, for example, we've seen the gay lobby use that exact structure. They'll say things like, if you criticize homosexuality, if you're openly critical to people who are gay, it probably means that you secretly have that desire in you and that you will give in and be eaten up by that desire. And then they can point to different conservative pastors or priests or whatever who are found in some gay orgy or something. And so that is the structure of this story. And I think. I think it's something that once you understand the pattern, you can see, first of all, the pattern itself repeats itself in the Bible. There are other places where the same pattern repeats itself. But then once you understand what it means, then you can understand that knowing this pattern can avoid a lot of problems in your life. And so I would say to all of you, just before you casually mock a story in the Bible, be very careful, because there's probably actually certainly more there than what you thought at the outset. Thank you for listening to the Symbolic World podcast. As you know, this podcast is, for now based mostly on my YouTube videos, which I am transferring into audio format. Please go ahead and visit my YouTube channel. There are more videos there on different subjects that I'm not going to put into audio. And. And please share this to your friends. I know a lot of people know about the YouTube content, but not so many people know that this is also a podcast. So share it to your friends, share it on social media. And if you can, feel free to support this financially as well by going to my Patreon page, which is Pageau videos, strangely, you can go there and you can support it at any amount that you want. A month for all the patrons. I do a monthly Q and A, a live Q and A in which people can ask questions in the chat, and I try to have a more connection with people. The YouTube comments have become difficult to follow and to answer. I'll see you soon."}
