{"episode_id":"SW - #099 - 2020-05-01 - Mediating Purity and Trade in a Pandemic","start":0.64,"end":911.99,"speaker":"Jonathan Pageau","text":"As we watch this pandemic spread, and we watch also the reaction to the pandemic from different governments, from different organizations, we are seeing a true symbolism happens moment. And often symbolism also happens in a world where symbolism seems to have been forgotten. And because it is forgotten, there actually might be a tendency to go into extremes and to manifest the extremes of different aspects of symbolism. And so one of the questions that has been coming up has been the question of borders, the question of purity, the question of exchange in terms of the economy and in terms of dealing with other people and trying to find the balance between the two. So we're going to look a little bit once again at the symbolism of these different terms and try to understand how it is we can avoid falling into excesses. This is Jonathan Peugeot. Welcome to the symbolic world. And so we have all accepted, it seems that all the governments of the world and all the different societies seem to have accepted that the solution to this problem is to emphasize borders. It is to create borders at every levels of reality and especially at the personal level. Now when you see how people are emphasizing, a lot of people have wondered why is it that people, people who are more left leaning in their politics, are, seem to be emphasizing more the personal border that is self isolating, whereas people who are more right leaning seem to not want to emphasize that so much and rather emphasize creating a border at the state level or at different communal levels. Now this is not that difficult to understand. Now if you are someone who is pretty pro state or pro globalization or pro, you know, as the left leaning people in politics tend to be, then you, you, you realize even intuitively, without necessarily thinking about it, that there is a danger of, of clamping down at different levels of identity. And you don't want that because you want the state, you want the government level to be the strongest. And so in order to do that, the best solution is to bring the border down to the radical individual, right down to as close to the individual as possible, so that you are actually working to your advantage and you are disassembling the intermediary steps. So it is possible to use this kind of clamping down of the border to the individual to, to break down all the intermediary organizations. We have churches, we have businesses, we have all these intermediary identities that exist between us and, let's say, the state. And in this time of pandemic, when borders are reappearing and everybody is moving into a sense of purity, there is an intuitive fear that people will back down, will come down into ethnical identities, ethnic identities or religious identities, you know, even. Even in terms of businesses or in terms of community groups or whatever. It is rather what they want, even like I said, it's not necessarily planned out for everybody. What they want is to break, bring the, the identity down to the individual so that the state level will have the most freedom to act and to impose its laws and to oppose its power. And it actually might open up a. A growing of the state level. It might give power to government that we had never seen before, as we are all isolated in our houses and the government is putting in measures of social distance distantiation, using cell phones to geo. Localize people, you know, using vaccines to tag people. We've seen discussion about that with Bill Gates. All of this is bringing down to the individual and wanting to emphasize the state is running a very dangerous risk of creating a tyrannical state. So we need to be attentive to that and to be cautious. But the problem is that because a virus is in a way. A virus moves in all kinds of ways. The other solution, which is to all come together or to come together in communities, it might make the virus, it might emphasize the virus. Now that is of course a problem, but we're not even sure if that. Which one is going to be the best solution because as they tell us, everybody is going to get this or most people are going to get this. And so is it better to clamp down on the individual, increase the state, or is it better to. To get come together into communities so that as communities we have the resources and the power, let's say the comfort and the strength as communities to deal with the fallout of that, then the death that this is gonna bring. Cause obviously people are going to die one way or the other. And so this is something we need to be attentive to. The other thing we need to be attentive to is that we used to live. Just a few months ago, we lived in a world of globalization, of global trade, of tourism, of openness, of diversity. All of these things were the values that were being espoused by our governments, especially here in Canada. It would became almost a caricature. And so now what we're seeing is this, this clampdown. But we also. And the clampdown is kind of absolute. And there is a compassion element to the clampdown. There is a. There's a desire to climb down because of compassion and because of this. It almost seems like the. Now the question of being open to the exterior because one of the Aspects of being open to the exterior is, of course, trade. We need to never forget that. And so as we clamp down in our smaller identities, we are going to be reducing trade now. We are going to be reducing the things that come from the outside. We. One of the things that comes from the outside, no matter what level you are dealing with, is food. Food comes from the outside. Food is an integration of potentiality into your body. And so it is something. It is a. Food is something like something that needs to break that to be broken down into a kind of potential or chaos. You put it into your body and then it becomes your body, right? So it's taking from the outside and constituting your body from it. And that's the same with trade. You exchange with a stranger in order to receive things from them that you will integrate into your identity, that you will bring into yourself. It could be objects, you know, it can be all kinds. It can be services. All these things are related to being in contact with the outside now because we don't. It's as if we moved from an extreme of openness and openness to trade, globalism, all of this stuff. And now we've moved into an extreme of closing down. We run the risk if we're not careful of destroying trade. And trade is also life. If you do not have the resources you need to continue, you are going to die. One of the. And because in the other opposite side, we had made ourselves completely dependent from the outside. And it's not sure that we have solutions to deal with this problem. One of the issues we're seeing here now in Canada is that usually people who were picking fruit and picking the vegetables and the farms were all coming from the outside, were all immigrants from South America mostly. And so now what are we going to do? If we cut off this potentiality, then we do not have the capacity, the potential to. To feed ourselves. Is that what's going on? So we need to be attentive to this symbolic swings because as people are unaware and they, they. The problem with symbolic. The problem with swings and the problem with a lack of symbolic understanding is we almost become slaves to the symbolic process. And so as we move from openness into this purity. I told you in my late last videos that one of the problems is that people forget the other side as they move into a moment of purity. They can't even. It's like they're another person. It's a whole other aspect of their person which is being made awake and they can't even remember what it Was like to be the other person. And so because of that, now all of a sudden, the other person becomes dangerous, evil or whatever, and they don't realize that you need to always have this balance between the two. And so if we look only to the purity side, into protecting ourselves from our. From the virus, and we completely ignore. Out of a desire, you know, out of this radical swing of the pendulum, we completely desire the necessity for trade and the necessity for receiving things from the outside in order to be able to sustain ourselves, then we are also going to die. We're going to die from an excess of purity. That is not impossible. That that's what allergies are. Allergies are excesses of purity. That is, your body is not able. Is always wanting to fight off everything that comes from the outside and is incapable of discerning what is needed from the outside and what isn't. And so we definitely need to be attentive to that as we move forward. But I would say be attentive to what is happening, to what is happening to yourself. Those of you who have kind of developed some kind of symbolic thinking and. And you will see how the analogies that I try to portray for you, how there is an analogy between the biological reality of dealing with foreign bodies and dealing with viruses and things coming from outside, there's an analogy between that and the social level. And we're going. And there's an analogy between that and the spiritual level. And so if you notice, for example, now all of a sudden our governments are telling us to start wearing masks and to. To. To. To protect ourselves. In pondering the reality of the face mask and understanding why is it that you need to wear the face mask, on the one hand, to protect yourselves from the outside, and on the other to protect the outside from you, is going to help you understand why is it that we have veils, for example, in the temple, in the tabernacle? How the reason that there are veils in the temple or the tabernacle or the reason why in scripture and in many traditions, people ask women to wear veils is exactly the same reason at a different level of reality, of course, as why people are asked to wear face masks. That is, on the one hand, and it really is. It really goes both ways. So in the temple, one of the reasons why you want the temple to have veils is to, on the one hand, protect from the outside. That is, protect from the profanation from the outside, protect from strangers who are not meant to be in the mystery, from denaturing the mystery. So you're protecting the glory of God from the outside, but you're also protecting the world from the glory of God. As I've showed you in my video on the coronavirus and the relationship, the pandemics and the relationship in the Bible, when the Ark of the Covenant moves out into the foreign land, it causes disease. And so you need to protect the outside from the ark as well. The glory becomes the disease once it is on the outside, this movement between glory and death. And so we need to also be aware of that as we understand why it is that symbolically, why it is that now suddenly we're being asked to wear these face masks and how all of it is just always a continuation and a playing out of the patterns of reality. So I'm going to try to be making a few more videos on this subject as the situation moves forward. And, uh, if you want to ask questions, I'm not gonna talk about this exclusively for sure, but be sure to tune in to my Q and A this month and hopefully we can deal with some more questions that people might have on this subject in the Q and A as well. And I would say, please, if you can also subscribe to the Clips channel, I will put a link to the Clips Channel in the description. A lot of the content, strange content that you've never seen, things that come from interviews that I've done, are all kind of being brought into the Clips Channel. They're doing a great job and it's, you know, short, you know, 5 to 10 minute, even 2, 3 minutes to 10, 15 minute clips on, all organized by subject. So thanks everybody for your support. Stay safe, stay aware, don't stay too safe, Be attentive to what's going on and I'll see you very soon. I hope you enjoyed this episode of the Symbolic World. The Symbolic World is edited by Justin Ward and it is based on a series of videos that you can find on my YouTube channel, Jonathan Pageau's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course leaving a review on itunes. Everybody knows that's the best way to get the podcast out there, to get it heard. And if you want to get involved, you can also support the podcast financially going to www.thesymbolicworld.com support or else on Patreon Pageau videos as well and on Subscribestar. All those links you can find on my website or in the show description. So thank you and I will see you soon."}
