{"episode_id":"SW - #180 - 2021-10-19 - Christianity Rebukes the Powerful","start":1.28,"end":1061.9,"speaker":"Jonathan Pageau","text":"So my last video on the. The question of Christianity not being revolutionary got quite a bit of reaction. A lot of long comments, people who didn't totally agree with what I was saying. Maybe I didn't totally formulate it right in using the word revolutionary. Some people maybe didn't under. I tried to explain what I meant by revolutionary, which is basically the idea of lower aspects of reality trying to take from above. But nonetheless it got quite a bit of reaction, even some. I even saw a reaction video which was very, very critical of me in manners, which were a little bit excessive. More than a little bit, let's say excessive in the sense that the person didn't seem to really engage with my argument, but rather engaged with his imagination about what I was saying and what I was implying. So, you know, for anybody who's been following my work for quite a while, you know that I don't think that I'm not a. I do believe in the problem of tyranny. I do believe that, you know, in my video about the. The number of the beast, all these types of symbolism, of the difficulty of hyper masculinity in the sense of the desire to impose order too much the Tower of Babel. I've talked quite a bit about the problem of authority. And so. But I thought, it made me think that maybe it'd be a good idea to look at the way in which Christ himself criticizes the people that are in power, the people that have authority, and how the way that he criticizes them is actually another version of how Christ fills the hierarchy and how Christ is there to manifest the fullness of the entire, you know, spread of being and also show us the reason for why sometimes it is laid out in a hierarchy. And so anyways, we'll look at that and I think it'll be interesting. This is Jonathan Pedro. Welcome to the symbolic world. So the interesting thing is that Christ, like many prophets is, you know, like some of the prophets in the Old Testament, is constantly criticizing those in authority. He actually doesn't criticize the worldly authorities. There is nowhere in scripture where he criticizes the Romans, but he does criticize both the spiritual authority and he also criticizes rich people, people who have a lot, and people who are lenders or that, you know, that lend money to. To others or that incur debts from other people. And so he definitely criticizes those people. And so I thought it would be a good idea to look at that and why it is and how it is that he criticizes that, you know, not just in terms Of a. Not in terms of sentimentalism and this kind of get offended and, you know, this the type of sentimentalism and easy thinking that people get into just being offended at structures. Christ has a lot of things which are so offensive. That was one of the reason for my last video, was actually to maybe not flinch on how offensive some of the things Christ says. And in the past, maybe people would have been more offended by the times in which he criticizes the powerful and the rich. But today people get more offended. And at the times where he shows the way in which authority comes down and the way in which authority can sometimes be very severe if the bottom of the hierarchy doesn't participate in the whole process. But it's very fine to look at the other side as well. And that's what we're gonna do. So the best way to understand most of the criticism that Christ has. There are basically two types of criticism. And both of those criticisms are showing how those that are above in any hierarchy, whether it's a hierarchy of spiritual, spiritual authority, whether it's a hierarchy of power in the terms of material power. The criticism that he poses is anything that stops the flow of things moving from above, down below. Or another way to see it is he criticizes any time in which that which is above and that which is below doesn't connect together. And so one of the biggest criticisms that Christ has is hypocrisy. And we have to understand how hypocrisy is, is exactly that. Hypocrisy is a separation of heaven and earth. It means that you hold ideals and then you don't embody those ideals in the world. The biggest criticism that Christ has of the Pharisees is that they are hypocrites. That they hold these very, very high ideals about the law, about how to practice spiritual life. And then they do not embody those ideals in the world. And so you can see that even in the text, in Matthew, where Christ. Someone mentioned that in the comments, which is that Christ first says to the people, follow the Pharisees because they are the legitimate authority. They are sitting in the seat of Moses. There was a tradition according to which there was an. There was a. There was both a written tradition and there was like an oral authority. So there was a priestly authority which came down from Aaron. And you can see that in the hierarchy of the priests that would have served in the temple, but that there was also with something you could call like a prophetic tradition that was actually handed down. This is the way the early Jews understood It. And it was seen as related to the. Called the seat of Moses, which is that there was another type of authority of teaching which was transmitted from Moses all the way down to the Pharisees, and that the Pharisees were the ones who held that seat. And so it wasn't. It really is Christ saying that the Pharisees have some legitimate authority in Jewish thinking, Jewish spirituality. And then what's funny about that is he tells people, you know, you need to follow what the Pharisees say because they're sitting in the seat of Moses. And then right away he goes and says, but don't do what they do because they're hypocrites. And then he goes on a rant. He goes on a huge rant where he just is just attacking the Pharisees for not embodying the things that they say. So there are two things. One is hypocrisy in the sense of, let's say, going down, you could say, so, not embodying the so. So saying one thing and doing another. That's one form of hypocrisy. There's another form of hypocrisy which is maybe more subtle, which Christ criticizes, which is kind of going the other way around, which is the incapacity. The Pharisees have to see the hidden aspect of the law. That is, they attach themselves to the letter. They can see the rule, but they don't see how that rule connects to heaven and is actually manifesting a spiritual principle. So then he criticizes how, you know, you. You follow these little rules, but you don't understand the spiritual principle of what it. That even those rules are trying to manifest in the world. It's a different kind of hypocrisy. But it's also, once again, the problem of how the Pharisees were incapable, were unwilling to connect heaven, incapable and unwilling to connect the spiritual element and the physical element in those two ways. And so then the other way that Christ criticizes the powerful is the question of being rich. And so this is something which you'll see coming later in the Christian tradition. You'll see some people like St. John Chrysostom, who says that Christ basically revealed the reason for which there are rich people and poor people. That Christ revealed the reason for which there are powerful people and that they're. That they are. Are weak people is so that those above care for those below. And that the reason for the rich is so that they care for the poor. That is the spiritual reason for why rich people exist. And so when they don't do that, then they are actually perturbing the very structure of reality. They're preventing reality from functioning properly. They're preventing the waters from above to descend down into the world and feed the world. And so when the rich hold their belongings to themselves and then don't send them down the hierarchy so that everything gets filled up with this, with, with, with the riches, then they are preventing the world from functioning properly, from connecting that which is above and that which is below. You can see it, of course, in the story of the rich man and Lazarus, where you have a rich man who sees a problem and so you can understand the poor and in, in very much in a kind of feminine way in which the poor presents a problem, presents a need, presents, you know, an emptiness, let's say. And the purpose of that which is above is to answer the question, is to solve the problem, and it's to fill the emptiness with presence when the rich doesn't care for the poor, that they're not doing that in the sphere of reality in which they participate. And so you, you see the rich man walking out of his house. He sees the poor man on the ground, you know, with nothing, with no food, begging. But he ignores it. He ignores the question that is being posed him, and he refuses to answer it. He refuses to answer the prayer, you could say. And so God answers the prayers God sends from above. Like Christ says that God will take care of your basic needs. That just like, you know, just when Christ talks about the birds and the birds and the flowers in the fields, that, that God does send down the blessing so that those that are below receive from above and are able to be filled with what would come from above. And so when the high person, the authority, or the, or the rich doesn't do that, then they are refusing to act fractally, you know, as an image of God in the world, because that's their role as powerful people, is to represent, let's say, that which is above towards that which is below at a smaller level. And so their responsibility is to give and to care. And yes, also, especially in terms of political authorities, they're also there to discipline and also there to, let's say, make sure that things work right. But that one's usually a lot easier, right? It's a lot easier to clamp down your authority on those that are below and make them do the things you want. But you also, that has to be done in a spirit of, of attending to the needs of those that are below. So you can imagine that it really is like those that are above are fractally like fathers towards children and those that manifest themselves as below them in whatever capacity that is, it's their responsibility to care for them, to make sure that their needs are met, to make sure that they are also able to kind of come into a body and be a healthy body that manifests this, this kind of pattern of heaven. And so in the teachings of Christ in Christianity, like there is no room for revolution. There is also no room for like laissez faire capitalism. I'm sorry to tell you guys, there's no room for the idea that it's not the rich person's responsibility to care for their workers, that it's not the rich, it's not the boss's responsibility to try to make sure that he can, let's say that he can fill the needs of the people that he works for. You know, this kind of capitalist idea that if something's not profitable, you just fire a bunch of people and you don't think about it. You know, that is also not the Christian way of seeing. Because the idea of making a lot of money is not the first reason for, let's say, the relationship between the rich and the poor. And so there is a way in which no matter how it happens, no matter whether it happens privately or through public means, there is a way in which the responsibility of any Christian nation or any Christian group to care for the poor, to send down that which they have so that they can, it's actually a blessing to do that. And so doing that actually is something which is making you in the image of God in that moment. And of course there is nonetheless a way in which we are all poor. And then that's also why Christ really emphasizes the image of poverty. Because let's say in comparison to God, we, we are all like the poor. And so we can also meditate. And seeing the way that the poor are, the way that the poor need, the way that the poor have nothing and need to receive from above, then we can see that there's a mystery in there, which is that we are all like that, that we all should be like that, that we should all, all give away our pride and stop thinking that we've got it covered. So stop thinking that we are the ones, we are self originate and that we are responsible for our successes and realize that even as people that are more fortunate, that all that we have, we receive from above. So we also always need to keep the attitude of the poor in relationship to God and to the extent that then we are fortunate, to the extent in which we are rich, not necessarily just in money, but in skill, but. But in authority, in capacity, all these things that we have, the talents that God gives us, we need to then be able to make them fruitful. And one of the ways to make them fruitful is to, let's say, make them flow down the hierarchy. Make others participate in that which you have. Whether if you're a businessman by employing people is also a way you can do that. But making sure in your, the way that you treat your employees and the way that you consider your employees that you're doing it in a manner that reflects the love of God for others. And you can't, as a Christian, see people as just numbers and just a bunch of numbers on a ledger that you can cut or remove or, you know, do whatever just because. Just because it's not financially feasible for you to act one way or the other. And so I think that there are some people, I mean, I guess because people can't think out of the box in the good way that is, that they think that just because I'm telling you Christianity is not revolutionary, that I'm somehow like a right wing, laissez faire capitalist. I'm not. I don't believe that. You know, I'm not saying that I have political solutions to how it is that the poor need to be taken care of, but that is definitely a responsibility that Christians have and that they need to constantly be aware of. And especially for us in the west, in which we are very powerful and we have much riches, then we specifically need to look for opportunities to give to the poor and to help those around us that appear to us as lacking or struggling or not having enough and being in a position of need. We need to make a specific attention to do that, you know, not just for some moral reason, not just because if you don't, you're a bad person, but really because when you do that, you are actually participating in the way that God acts in the world. You are being the image of God in the world when you do that. So it's actually an opportunity to do that, to be a generous person and to give is an opportunity to really participate in the life of God. But the criticism that Christ has of the rich is accurate because it's very difficult, right? It's very difficult when you have a lot to make that flow down. It's very difficult to not want to think that it's owed to your own skill and to your own, to your own success and want to hold that for yourself. I mean, it's nearly impossible. But those that succeed in that, they also participate in the kingdom of God and they participate in the life of God. And so this is my little, my commentary on that. Hopefully it's a good balance to my last video about how Christianity isn't revolutionary. I really do believe that Christianity shows the proper way in which any type of hierarchy should exist because they end up being inevitable. So I think that that's the best way to understand it. And, and even in terms of political revolutions, I've often said, and I do think that although there is, I cannot justify, let's say, the peasants for killing the king, I can understand, you know, if the king doesn't care for his people. You know, I'm not saying that killing the king is, is morally right or that it's, it's good. But I also, I don't make the king innocent of what happened. It's one of those situations where scandal must happen, you know, woe to those by whom it happens. But sometimes it's going to happen, especially if, if the, the relationship between heaven and earth isn't the proper one, that at some point the earth grumbles. You see that in scripture, you know, you see the Israelites grumble in the desert all the time because they're not getting what they want. And then, but it's funny because they grumble and then God gives them what they want. So there's this interesting relationship of God being annoyed that of the grumbling of the people, but then nonetheless answering their grumbles. Anyway, so that's an interesting aspect as well to understand, to understand sometimes how that happens in practice, you know, and how the lady that annoyed the judge, right, you have this image in, in scripture of the lady that, that was pestering the judge and that somehow sometimes that is how we need to act towards God. And that's how we also, how the problems of the world kind of manifest themselves to you as this pestering that you need to answer. But it is our responsibility to, to answer properly in love to those needs, to those emptinesses that we can perceive in the world. And so thank you everybody for attention. Thank you for your support. I know that for some of you this has been a strange month in terms of my website and in terms of participating because you're not able to log in. And so I'm. I hope that it is been fixed and I hope that it's continuing to be fixed. One person said that in order, if you can't log into the website. One of the things you should do is that you should that you should accept the cookies. So if the website asks you to accept the cookies, then it will help you to log in. And so I don't know anything what that totally entails in terms of technical stuff, but hopefully that works for you. So I thank you for your support, sorry for the chaos and I'll talk to you very soon. Bye Bye."}
