{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":12.16,"end":78.97,"speaker":"Jonathan Pageau","text":"This is Jonathan Pedro. Welcome to the symbolic world. All right. And so everyone, I am very happy to be here with Peter Boghojian. All of you will know him, you know, if you're kind of in the conversation of meaning and of, you know, the problem of woke culture and how to react to it and how to kind of save our Western society. He's now affiliated with the University of Austin. And we met in London last year. You know, it wasn't during arc. It was around, I think. No, it wasn't during arc. It was before. We had a bit of a conversation about religion. And we both were very critical of a lot of the postmodern stuff because of how religious it is. And the surprise in the discussion with Peter was wondering, well, if you think that, why then do you like religion and so. Or why do you not critical about against religion itself? And so we thought it would be a great opportunity to continue the conversation. So, Peter, thanks for coming on."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":79.05,"end":83.01,"speaker":"Peter Boghossian","text":"Thanks, Jonathan. Thanks for having me. I think we met at an unheard event, didn't we?"}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":83.01,"end":97.67,"speaker":"Jonathan Pageau","text":"Yeah, that's right. That's right. It was. Yeah, I forget. It was. That's actually the showing of your documentary. Of the documentary about Mike Nada's documentary. Yeah, yeah. About the whole paper, all the papers that you wrote with Lindsay. And it was a great documentary."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":98.71,"end":165.26,"speaker":"Peter Boghossian","text":"The Reformers. Yeah, Mike did a great job. And then in that conversation, let's see. We were both kvetching about the new religion and the architecture of the new religion. And I think I said to you, well, if you realize that's a problem, why don't you realize that your religion is a problem? And the question is a version. It has an old. As I told you, it has an older pedigree in the literature, but it's a version of John W. Loftus's Outsider Test for Faith. And the idea is that you want to look at your religion as an outsider, as you and I are outsiders to these religions, as a Muslim, as an outsider to, you know, Pentecostalism. And they see speaking in tongues is silly. I gave a talk about this years ago, the Easter Jesus, the Easter Bunny and other Delusions. Just say no, by the way, at that talk. The original title of that talk was supposed to be Jesus, Muhammad and Other Delusions. Jesus, Muhammad, the Easter Bunny and Other Delusions, just to say no. But the university made me take out Muhammad, but it was fine to keep Jesus in there."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":165.5,"end":355.24,"speaker":"Jonathan Pageau","text":"Of course, we all know that's the case. Everybody pretends to be open about Islam, but is really just Scared is what it is, you know. And so I think that the importance, like the first thing to talk about is to see also, you know, when we. When I talk about religion, I think we're in some ways, at the outset, we're thinking about it a little differently. Like, for you, it seemed religion is like things that you believe, let's say, that are often somewhat extraordinary, that that kind of, you know, that constitute the group. You know, I see religion at the outset as like the word implies, as the thing that binds us, right? And so for me, religion is an extension of many other aspects. So religion isn't like a freak thing that exists completely on its own, but it's an extension of binding. And so it's an extension of the manner in which we recognize that multiplicity joins into unity. So if you. If you have a nation, you need a way for you to know that you're a nation and not just a bunch of strangers. There's something not just know, but participate, right? It's not just like a mental knowledge. You have to have ways to know and participate in the fact that you exist as one. And that will, even in terms of nation, will end up looking like what we tend to think think religion is. Right. You'll have Washington D.C. with monuments that remember the people that founded it. People will go on pilgrimages. They'll. They'll go see these monuments to, like, participate and remember. We'll have parades, we'll have. We'll have, you know, pledges, we'll have a flag and songs. All these things that are there to help us know and celebrate in the unity we participate in. And so I see that scaling at every level of participation from the. Actually the. The person first of all, then the family, then communities, cities, churches, clubs, basketball, you know, teams, sports teams, they all have a way in which we need to know how to be together. And so that's why the ritual of a church to me is the highest level, because it tries to bind us into the highest thing. It tries to bind us in the highest thing we can imagine. But a sports team will look religious too. It'll have a mascot, we'll have uniforms, we'll have songs and ways to know that this is our team and we're kind of rooting for it. And so that's, to me, maybe that's the big difference at the outset, which is why, just to finish on this, which is why when I look at the woke thing, I can see that it's religious because it's a mode of binding that has Celebration ritual, you know, that has all of those things. But it's. But it is perverse, right? Because you can have manners of binding that are perverse, right? You can have a street gang. The street gang will have rituals, will have initiation, will have a name, costumes, all of that. But it leads you towards something that is actually dangerous for the other, you know, for the other beings that exist in the world."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":355.88,"end":426.58,"speaker":"Peter Boghossian","text":"Yeah, I guess I'm not buying the thing that binds us. And the reason I'm not buying that is that I think that it either doesn't capture the nuance or it's missing something fundamental in that when I think about religion, I think about the reference to it has truth claims. Sports teams don't have truth claims. And so if you recognize the truth or not, you. If one recognizes the truth claims of other religions as silly and one recognizes the trappings behind that, then it's unclear to me why, if one is reasoning honestly, why would one recognize the truth claims of one's own religion as, I don't know, not epistemically sound? So I guess I'm not buying the binding thing because there has to be, like Hannah Arendt talks about how to have an ideology means you must believe it's true. Right? I mean, there's a truth component to that in which there's not. To a sports team, you adjudicate those like, I know nothing about sports."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":426.58,"end":446.59,"speaker":"Jonathan Pageau","text":"But no, there is a truth claim that in sports. What I mean, it's a little different, but you have to accept the identity and the rules of the sport. You actually have to accept those as being true relative to the sport. They're not true in an absolute sense, but they're true relative to the sport. Right."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":447.15,"end":457.07,"speaker":"Peter Boghossian","text":"Those are conventions. Those are. Everybody knows that. Those are arbitrary conventions. And they. I wish I knew more about sports. I could, you know, give us soccer."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":457.79,"end":461.63,"speaker":"Jonathan Pageau","text":"But they're not completely arbitrary conventions. They have a power."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":461.63,"end":464.99,"speaker":"Peter Boghossian","text":"No, I mean, you can't bring a chainsaw on into a boxing match."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":464.99,"end":465.31,"speaker":"Jonathan Pageau","text":"Right?"}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":465.31,"end":467.11,"speaker":"Peter Boghossian","text":"So. But those, those rules."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":467.11,"end":510.21,"speaker":"Jonathan Pageau","text":"No, you wouldn't, you wouldn't make a sport of someone, I don't know, someone like rubbing the side of a table for two hours. Like, there are certain things that capture human attention that are object and that you can't, you can't. Actually, there's a scale. There's a. There's a scale of relevance in sport. But all sports have aspects in common which make them sport that are true. Like, then you don't care about them. Right. You. Yeah, you can make a sport out of something completely ridiculous that nobody would actually love. But if you make a sport that has the right amount of, of excellence and competition, there's a way to know who's winning. There's all of these things that are necessary for a sport to exist. So there's variability, but there's still a bound, there's a boundary to variability. So you could say."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":510.37,"end":513.29,"speaker":"Peter Boghossian","text":"Right, right, yeah, so, so let's say."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":513.29,"end":520.85,"speaker":"Jonathan Pageau","text":"You could say, so I'm a Christian, I want to be careful not to like, freak people out. Like, I am very much a Christian."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":522.61,"end":524.21,"speaker":"Peter Boghossian","text":"What are they going to be freaked out about?"}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":525.57,"end":602.53,"speaker":"Jonathan Pageau","text":"That might freak out some of the Christians is to say that in order to bind yourself at the highest level, right, the way that, that, that unites the most elements together, there's a, there's a certain amount of variability which is possible, but that amount of variability is limited to the fact that we're binding ourselves to the highest thing. So like you said, binding yourself to a sport and binding yourself to the infinite source of all things, that, that gives you a mode of being that encompasses all other modes of being, which is what religion tends to do because it offers, it offers identity, it offers morality, it offers ways to, to come together in marriage, in death, etc. Etc. Etc. That it, that it, it also has a type of variability. So like, a good example would be the Flying Spaghetti Monster. Like, the Flying Spaghetti Monster is actually an impossible religion. Like technically it's an impossible religion because it doesn't have the characteristics necessary to bind you. Okay, something real. But, but Islam is sufficiently, like, although I disagree with some of the tenets of Islam, it's sufficiently structured so that it can do that. And if it, and if someone said, well, replace it with the, the Flying Spaghetti Monster, then it wouldn't exist as a religion."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":602.69,"end":656.84,"speaker":"Peter Boghossian","text":"Okay, so there's a lot going on in this conversation. So I suggest before we go down or explore other topics, we need to disambiguate some terms, talk about some things. So Wittenstein talks about what you're talking about in terms of the commonalities among sports and calls them family resemblances. So their resemblances. You could have a, I don't know if you could have a sport for rubbing a table. I guess you could have a sport for anything you wanted to. And again, you have ways to adjudicate, you have conventions. But the difference with religion is you're not making truth claims. I mean, you're saying that we agree. If you get the. Again, I'm just making this up. If you kick the Ball through this net or whatever. You throw the ball in this net at a certain number of feet, you get two points. And then I can't remember where it is. I think it's three points in basketball. Who the hell. I have literally no idea."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":656.92,"end":657.64,"speaker":"Jonathan Pageau","text":"No big deal."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":657.8,"end":727.26,"speaker":"Peter Boghossian","text":"Okay, so something like that. But we're talking about specific things. We're talking about linguistic propositions. So sentences in which communities agree that belief in those is fundamentally constitutive of what it means to belong in the community. For example, there being histor and historical Jesus. Now, I know some people consider themselves Christians who don't accept the historicity of Jesus. I mean, that, that's. I mean, I couldn't care less what how people saw. I mean, I really, in that sense. So it's not a moral question or even a political question. It's in the broader sense. I think if you were to ask the overwhelming majority of Christians, they would say to you, yes, you have to accept that Jesus died for your sins and he was crucified, etc. Which basically Muslims don't believe. I don't know. Many Christians don't believe that. They don't know that Muslims don't believe Jesus was crucified. But that's just parenthetical. So the difference is the things that bind us. Lots of things bind us. You can cook a meal and bind us. But that's very different from a truth claim."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":727.42,"end":918.5,"speaker":"Jonathan Pageau","text":"Right? So what my. Like, I. You're right that there is a truth claim aspect to religion, but I do think, honestly that in the life of the world, that has always been a secondary thing to the participative reality of religion. Which is, what I mean is that even the truth claims, the truth claims. The reason why we find the truth claims important is because of what they offer downstream. Right? So there's a downstream thing in the truth claim. So it's like, it's not just like I just have these arbitrary truth claims. I believe in certain things because they offer a world in which I exist. And that world has characteristics. And so the, the Christian story, for example, of the teaching of Jesus, the death and the resurrection, the cross becomes a model for. For being. And so. And then it, it becomes the structure of our world. It structures our perception, it structures our morality, it structures our ethics, it structures what we care about. It does all of that downstream from the truth claim. Right. And so I understand. So it's like, it's so you could have all kinds of arbitrary truth claims. You could say, well, you know, I have a truth claim which Is that Jesus's sandals, you know, were one inch thick. It's like, well, what? Who cares? That doesn't mean anything. It has no reason. But if I say I have a truth claim, which is Jesus died and resurrected from the dead, that it's because it offers a world that is different from if that wasn't the case. And that world happens in, like I said, in participation. So you go to church. The church is at the middle of the town. It's the highest building. Everybody can see the steeple of the church with the cross above it. And then they all gather there together to manifest their unity. They celebrate the things that brings them together. Birth, death, marriages. All of these things happen in light of that, of what the truth claim offers. And so a simple example is that, let's say in many, many, in most societies before Christianity, there was no need for, to say I do. There was absolutely no need to. It's like you're getting married, it was decided for you. You bring the people there and the woman had absolutely no say in what. Like, in the marriage is like a man takes a wife and some guy just, they just decide that that's her and they come together and they get married. And there was no need to ask for the willing acceptance of that responsibility of the people. Now Christianity comes, offers the cross as an example. And now in that frame of willing self sacrifice, the, the, the husband and the wife now in a Christian marriage have to say that they are willing to take this other person as their, as their husband or as their, as their bride. So it's a little example. But what I mean is that the truth claim is not. Is it offers a world in which to live. And that's the most important because like I said, who cares about truth claim? Like, there are all millions of truth games I could have that they don't offer. They don't offer me anything."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":919.94,"end":928.58,"speaker":"Peter Boghossian","text":"So, so I wrote down what you said. So it's. The truth game is important because of what it offers."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":929.14,"end":929.7,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":931.22,"end":934.18,"speaker":"Peter Boghossian","text":"So you're talking about the consequences of the truth claim."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":935.3,"end":975.81,"speaker":"Jonathan Pageau","text":"The reason why that truth claim is important, not whether it's true or not. That's another question. But, but the reason why a certain truth claim is important is because of what it offers, right? Like I said, there are millions of truth things I can make, but there's one truth claim that, that will, I don't know, like, that will offer me something, right? The truth claim about how to make, you know, how to, to make a certain type of medicine is more important than the truth claim that there's a, you know, like a half an inch piece of rubber that fell on the ground next to me. That's also a truth claim, but it doesn't offer me anything. And so I don't have to posit it in an important place. I don't have to lift it up as above others in that way."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":976.29,"end":997.96,"speaker":"Peter Boghossian","text":"So, so I'm trying not to import any new words into the conversation. So you're saying that one should. And I want to relate this back to the idea of binding to make sure I understand. You're saying that there are certain truth claims which yield greater binding. Well, let me stop there. Is that right?"}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":998.6,"end":1035.81,"speaker":"Jonathan Pageau","text":"Well, that's necessary. Like in terms of care, first of all, in terms of care person, in terms of attention, certain truth claims necessarily bring about more binding because they're things you care about more than others. There's a hierarchy of care in a person, in a community or whatever. And so the truth themes of a community are binding in care. Right. So, you know, that's why we claim, that's why we elevate the founding of a nation, because that founding of that nation is the reason why we exist as a nation. We don't talk about what George Washington ate for breakfast."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":1037.33,"end":1059.53,"speaker":"Peter Boghossian","text":"So, so if something, if a truth. So again, I'm, I'm repeating this only back to you because I want to make sure I understand it's important because of what it offers and the thing that it offers you. Would you believe in even if it didn't offer you anything? Should you believe it if it offers you nothing?"}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":1059.77,"end":1079.3,"speaker":"Jonathan Pageau","text":"Well, I wouldn't care about it. It's not that it wouldn't. I wouldn't care about if you said, if you told me, hey, Jonathan, there's a piece of rubber on the ground in Syria on the corner of these two streets. I would say, oh, oh, I'm going to forget that now. I'm going to forget that now because you know what I'm saying?"}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":1079.86,"end":1110.84,"speaker":"Peter Boghossian","text":"Well, I guess I'm thinking about a lot of things that are populating my head in the conversation, thinking about this idea of Islam, of submission and submitting because it's true, independent of its benefit for you, independent of paradise afterward, there's just submission because that's the will of God. And so I'm not contesting or repudiating any concept of benefit as like."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":1111.16,"end":1192.68,"speaker":"Jonathan Pageau","text":"But it's an interesting. First of all, it's actually an interesting question because in Islam we don't say God is love. In Christianity we say God is love. And you know, how can I say this? Like that might even afford me the possibility of understanding the hierarchy of, of goods that present themselves to me in a different way that a Muslim will, will be able to understand and that will, that will offer a world to me, you know, and that that world has a shape. And we can compare worlds, right? We can, we can compare the world of someone who believes for example in Zeus, let's say what that world looks like, and the world of someone who believes in the monotheistic God or the God, the God of the Bible, let's say, or, or et cetera, et cetera. Right. You can also have a world where someone for example, believes only in reason. And you can see what that world for because we, we have an example of it. Like we have the enlightenment and we have what that gave and we can see what that does. And, and that's, that's part of this. So it's like there are truth claims that are different than other truth claims in that sense, especially about the highest aspect because it's a, it's like a, it's an anchor."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":1195.72,"end":1205.32,"speaker":"Peter Boghossian","text":"Would you believe something if. Are you comfortable with all of your, your Christian beliefs?"}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":1206.52,"end":1308.81,"speaker":"Jonathan Pageau","text":"Am I comfortable with all my Christian beliefs? That's an interesting one. I would say like most people there is a hierarchy of comfort with the hierarchy of Christian beliefs. Maybe that's a good way to understand it. It's like, because the purpose, like I said. What, what's imp. One of the reasons why I'm saying this is that the way that we live in the world is about trust and about where to go mostly and less about truth claims. Right. I believe there's nothing, I think truth games are important. Like I think that they, that they're part of this. But. So there are things about Christianity which I see as being absolutely necessary and absolutely world giving, you know, and, and so I do believe that. But as you go down the list of what all kinds of Christians believe, there's certain things which seem either irrelevant to me or kind of shady. And then I'm like eh, you know, either I think it's not interesting or I, or I don't believe it or I'm like well just whatever. And then maybe one day I'll have more work conflic evidence on this or that, but it doesn't, doesn't matter that much because like I said, I don't think most of our lives are about making sure our truth claims are accurate. Most of our life is about knowing where to go and what to do and how to be. That's the thing that's most important. And I'm not. I want to be careful. I'm not saying the truth claims aren't important and that making sure things are accurate isn't important, but it's downstream from the other because the one, the one of how to be, where to go, how to. Where to look, how to exist. It makes you care about certain truth claims and not care about others. And so the truth claims are downstream from the direction."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":1308.81,"end":1322.13,"speaker":"Peter Boghossian","text":"You could say, would you follow a path if it had the binding element to it and you thought it made your life better, but it wasn't true?"}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":1323.81,"end":1374.64,"speaker":"Jonathan Pageau","text":"Well, it depends if I could know that it wasn't factually true. Yeah, right. That's a little, that's more complicated because even the factually true to me is complicated. It's a little complicated because there are different levels of factuality. And so the question is always what level of factuality is necessary for you to believe something is true? And there are, there are certain. What I mean is that there are forensic descriptions to a police officer, right? And so it's like, here's a fact sheet of all the things that happen at a crime scene. And it's like super detail and it's whatever. Right. And then there's the. Then there's the I think my wife loves me. That I think my wife love me is a truth claim. But I don't have the forensic. I can't access the forensic better."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":1374.64,"end":1381.4,"speaker":"Peter Boghossian","text":"My. My wife loves me. Because you would be an inerring if you said, I think my wife loves me."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":1382.56,"end":1388.24,"speaker":"Jonathan Pageau","text":"Yeah. What do you mean? Sorry? Well, no, I trust, I trust my life."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":1388.24,"end":1391.48,"speaker":"Peter Boghossian","text":"My wife loves me as opposed to I think my wife loves me."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":1391.48,"end":1394.88,"speaker":"Jonathan Pageau","text":"But I would. That made something like, I trust my wife loves me. How about that?"}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":1395.36,"end":1401.12,"speaker":"Peter Boghossian","text":"Well, no, because your feeling of trust, you'd be, You'd. You'd be infallible with that."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":1401.28,"end":1411.99,"speaker":"Jonathan Pageau","text":"Well, trust would, would be that there's a sufficient amount of, of, of stickiness between that's a my trust and the facts."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":1412.31,"end":1416.15,"speaker":"Peter Boghossian","text":"Yeah. So you can just eliminate the my trust or I think my wife loves me."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":1416.15,"end":1428.71,"speaker":"Jonathan Pageau","text":"My wife loves me. Yeah, but I could be proof. I could be proven. There could be a moment where things happen and then I don't. That is definitely possible. So I think that that's, that's the case."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":1429.51,"end":1434.15,"speaker":"Peter Boghossian","text":"So can I ask you a personal question? Yeah. Are you monogamous?"}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":1434.61,"end":1434.93,"speaker":"Jonathan Pageau","text":"Yes."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":1436.37,"end":1446.85,"speaker":"Peter Boghossian","text":"Okay. So if you found out that your wife was cheating on you with multiple men and women and going to these crazy orgies Would you want to know that that's true? If it."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":1446.93,"end":1456.69,"speaker":"Jonathan Pageau","text":"Yes, I would definitely. And I would also. It would also cast a dispersion on. On the idea that she loves me and it would be good reason to divorce her."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":1457.89,"end":1464.72,"speaker":"Peter Boghossian","text":"Okay, so you, you want to know things that are true even if the consequences of those things are negative to your own life?"}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":1465.36,"end":1489.67,"speaker":"Jonathan Pageau","text":"Well, of course. I mean, I think that, that. I think that's right. But it's always about the level, right? It's always about the level of truth. So someone could come and like, exactly. Like someone could come and tell me some rumor, right? It's like, oh, you know, oh, someone told me that they saw your wife talking to this guy, you know, and that guy's really a player. So you should be really worried, Jonathan, about your wife. That, right."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":1490.15,"end":1496.35,"speaker":"Peter Boghossian","text":"What people tell you is so benign imagination was just so different from what."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":1496.35,"end":1534.76,"speaker":"Jonathan Pageau","text":"My imagination would have called, whatever. What I mean is that, that I could, I could. There could be a rumor. There could be things that if I was. If I was. If I didn't trust her, right. Lead me to doubt that she is faithful to me, that she loved me. But I'm careful to make sure that the barrier is sufficient, right. In order to break that. Because, because you can always go into like, micro details and find reasons to, to. To disprove, especially if it's trust. Like, man, trust is something that, that needs a kind of. A kind of directionality to it."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":1534.76,"end":1554.45,"speaker":"Peter Boghossian","text":"And the reason for your. The reason that you and I realize I have to be incredibly careful and precise with each word. So if this is not just accurate, but precise, let me know. The reason that you believe the main propositions of your religion is because you think that they're true."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":1556.93,"end":1586.24,"speaker":"Jonathan Pageau","text":"It's first of all because I believe what they afford. And then secondly, that I believe and I trust that. And secondly, that I believe they're true. And it's the same with my wife, by the way, which is the reason why I think my wife loves me is not because it's because it's true, it's because it's important. And then secondly, it's true because if it wasn't important, I wouldn't care about it. You wouldn't have to ask me. You would not even have to ask me that, whether or not. And so it's the same with faith."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":1586.24,"end":1593.57,"speaker":"Peter Boghossian","text":"Like, if it wasn't true, it would be irrelevant. Would it afforded you or would it. I don't know. I'm asking."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":1593.73,"end":1611.61,"speaker":"Jonathan Pageau","text":"No, it would obviously, if it becomes, if it becomes untrue like untrue in the sense of. That there's a disjunct between the trust and the. The. The factuality of things. That the factuality of things are disconnected from what I trust. Then. Then obviously, then that would break. Like, it would break. It was like. It's like a separate."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":1611.61,"end":1612.77,"speaker":"Peter Boghossian","text":"That assumes you'd know it."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":1613.97,"end":1618.21,"speaker":"Jonathan Pageau","text":"That. That I would. That I would find that out, let's say. Yeah. That would find out that my wife is cheating on me, let's say."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":1618.41,"end":1618.73,"speaker":"Peter Boghossian","text":"Yeah."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":1618.81,"end":1620.57,"speaker":"Jonathan Pageau","text":"Then that would break the link."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":1621.45,"end":1647.13,"speaker":"Peter Boghossian","text":"So it would seem to me, you know, and I. I think I'm misunderstanding. Misunderstanding you. Because I just don't. I don't see how this could be true. I rephrase that. I don't think. I don't see how this could be the case. It wouldn't. It have to be like, you. You would have to believe that they're true. And then other things would come downstream of that. The benefits. Because of what it is."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":1647.37,"end":1650.81,"speaker":"Jonathan Pageau","text":"The benefits come first. They come before the true."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":1651.13,"end":1652.49,"speaker":"Peter Boghossian","text":"Because the benefits are."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":1652.65,"end":1692.68,"speaker":"Jonathan Pageau","text":"There are millions of things that are true, Peter, that I don't care about. There's like an indefinite amount of things that are true that I don't care about because they don't offer me a world. But there are certain things that do offer me up possibility. And. And those are the ones I care about. So the. The value comes first. Right. And then the. The. The. The truth of it come second. Because if. Because think about it like, if I found out that my wife is cheating on me, and now I'm. Now I'm. Now I. Now I hate life. Now I'm. I'm mad, I'm sad. Everything falls apart. Because the value that it was. That offered me was. Was the reason why I cared for it to be true in the first place. I still want it to be true. Right."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":1692.84,"end":1716.39,"speaker":"Peter Boghossian","text":"Because we gotta introduce you to the idea of compersion at some point, but that's a conversation for another. Another day. So. Okay, so I'm still trying to make my. I'm still trying to make my. Wrap my head around this. So are you saying that the benefits of what you get lead you to believe it's true?"}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":1717.83,"end":1718.87,"speaker":"Jonathan Pageau","text":"No, I'm not saying that."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":1719.27,"end":1720.07,"speaker":"Peter Boghossian","text":"Oh, okay."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":1720.47,"end":1726.07,"speaker":"Jonathan Pageau","text":"What I'm saying is that the benefit of what it offers makes you see the value of it."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":1726.48,"end":1728.4,"speaker":"Peter Boghossian","text":"Okay, That I can see. Yeah, totally."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":1728.48,"end":1730.4,"speaker":"Jonathan Pageau","text":"And then it makes you see why you should care."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":1731.04,"end":1732.8,"speaker":"Peter Boghossian","text":"Okay. That. I got that."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":1732.88,"end":1735.6,"speaker":"Jonathan Pageau","text":"That's. Participate in that."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":1735.92,"end":1736.88,"speaker":"Peter Boghossian","text":"Okay, I got that."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":1737.04,"end":1741.04,"speaker":"Jonathan Pageau","text":"All right. And then. Okay, let me give you Let me give you."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":1741.2,"end":1743.88,"speaker":"Peter Boghossian","text":"But keep going, keep going with the string because I'm, you know."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":1743.88,"end":1759.24,"speaker":"Jonathan Pageau","text":"And so, and so, and so then there are certain elements of that that have to do with what you would call factuality at certain, at different levels. And then those have to connect. Like there has to be a certain amount of connection with factuality. Of course."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":1759.88,"end":1780.61,"speaker":"Peter Boghossian","text":"And the connection there is this a kind of. I don't mean it pejoratively, but a God of the gaps. It's like is this. That gap keeps getting smaller and smaller. So that at some level the factual accordance means that the activity is tethered to reality and that. It's true."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":1781.81,"end":1926.95,"speaker":"Jonathan Pageau","text":"It's true. Okay, so let's, let's. It's. There's a, say this like, there's a scale of. There's like a scale that you need in order to know that you want to engage, that you want to participate in it. That's what I. That's what I'm seeing. It's. Understand that it's about participation. So if I. Right. So I trust that the sidewalk near my house is going to hold me up. Right. I trust that. And I actually, I don't think about it. I actually never think about it. I just walk on the sidewalk. Right. But it is possible that something could happen. Sure. That would force me to question that. And the thing is, is that there's, there's actually a scale of that and it act. And some people will be triggered really fast about, about the trust of the sidewalk. And some people will. Will be triggered too late and then that it'll collapse and they'll fall into the hole. And so, and so the person that is triggered really fast, they'll be, they'll be, they'll be afraid, they'll be super cautious. They'll be really careful and maybe most of the time they're, they're avoiding something which is not a problem at all. And the person that. Right. So there's a, there's a scale. So it's. This is the same thing with the religious thing. Like in the sense that, you know, if you, if you're an American, right, And you think it's good to be an American because you trust the foundation of America, then people, what they're going to do and they do now is they're going to start to say, well, what about this? What about Thomas Jefferson's sins? What about Thomas Jefferson's slavery? What about this and this, this. And some people will start. Will say, well, if Thomas Jefferson had slave, therefore America invalidate, right? And other people will say, well, no, I need, like, you know, I would need. I would need to know that, like someone I don't know, like, that the, The. The very principles of the, of the. The whole thing are completely erroneous in order for me to abandon my allegiance to America. But all of that is like. All of that is like. And so it's the same with religion. So someone will say, you know, do you believe in the truth of resurrection? And the truth is, I would say yes. And then someone would say, but what if I could show you that resurrection is impossible? And it's like, it's like, okay, you. Can you do that? Like, can you show me that resurrection is impossible? And what does that even mean? Like, I'm not sure. What are you talking about?"}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":1927.35,"end":1966.25,"speaker":"Peter Boghossian","text":"I think that's really interesting. So let's follow with that. That's a really good point. And I hear you. So let's follow that up. So instead of someone saying to you, I can show you that resurrection is false, let's say that, I don't know, some archaeologist went on some dig somewhere and they found this ancient library. And in this ancient library were nearly perfectly preserved scrolls that were like, ha, ha, we perpetrated a great hoax. We, you know, the, you know, whatever that Jesus did, you know, so what if. Would you still believe then?"}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":1966.49,"end":1982.37,"speaker":"Jonathan Pageau","text":"Okay, so what if someone in 500 years went back into our old Internet archive and was able to get into 4chan and discovered that there are like insider CIA people that are saying that we're run by lizard people."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":1982.45,"end":1983.09,"speaker":"Peter Boghossian","text":"Okay."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":1983.17,"end":1988.69,"speaker":"Jonathan Pageau","text":"And that they have a whole account of it, like 500 page books about how. Run by lizard people."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":1989.01,"end":2007.62,"speaker":"Peter Boghossian","text":"All right, so I see, I. I understand you and I hear you, and I think that that's your. And if I'm out of, you know, if this is. If this is too harsh, let me know. I think you're looking for a reason to maintain the belief."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":2008.98,"end":2056.62,"speaker":"Jonathan Pageau","text":"You think? Well, yeah, because of what it affords me. Of course I'm looking. Not looking for a reason to maintain my belief. I'm suspicious of people who try to take it away from me. First of all, suspicious about their intention. Just like, Just like the guy who comes to me and says, you know, I saw your wife talking to this guy. It's like, I'm suspicious about your intentions. Like, what is it you're hoping to accomplish by casting this doubt on me that those, These are. That's the thing. So it's not that I'm looking for reason to maintain belief, because when I'M walking on the sidewalk. I'm not looking for reason to maintain belief, but if someone, like, if someone's trying to cast doubt on. If a crazy guy comes up to me and says, the sidewalk is made of Jello, the sidewalk is made of Jello, and then I'm going to be like, well, sorry, I walk, not you."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":2057.01,"end":2068.65,"speaker":"Peter Boghossian","text":"Yeah, that's because you have, you have no reason to. But if you were walking down, down the, the street on the sidewalk and a couple of people just vanished like they sunk into the sidewalk, it turned into some like sci fi super, then."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":2068.65,"end":2070.29,"speaker":"Jonathan Pageau","text":"I would definitely not speak."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":2071.17,"end":2079.21,"speaker":"Peter Boghossian","text":"That would be very reasonable. Rational, rational thing to do. So, but, but in these instances, let."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":2079.21,"end":2106.52,"speaker":"Jonathan Pageau","text":"Me give you an example today. Like, okay, today, right? It's like there are people that fake miracles all the time. The people that lie about miracles. There are people that lie about healing. There are people that lie about all kinds of stuff. And every time I hear a story of someone getting healed or someone, some miracle or whatever, like, I'm like, well, you know, I don't know. I, I, I don't necessarily have an opinion on it now. It doesn't mean, it doesn't mean that I don't believe that miracles are possible or that healing is."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":2106.52,"end":2120.65,"speaker":"Peter Boghossian","text":"That's fascinating to me. So why should, on a scale from 1 to 10. So if 1 is. No way, Jose. 5 is maybe 10 is absolutely. Why should your default be 5? Your default should be like 1.1."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":2120.81,"end":2125.85,"speaker":"Jonathan Pageau","text":"What do you mean default should be 1.1? That I should immediately believe people's claims?"}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":2126.49,"end":2168.07,"speaker":"Peter Boghossian","text":"No. So if we have a scale with 1 being this is BS. 5 being maybe it's possible. 10 being this is absolutely true. If someone tells you about some miracle they've seen, I don't understand why you're defaulting to 5 instead of defaulting to 2. Why is your default. Maybe my default would be, My default would be 1.0. Like if the scale is 0 to 10, it'd be like 0.1111. But I would still be docastically open. You know, I'd be open, open to that, given sufficient evidence. But why would your default be 5? Why would you say maybe?"}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":2168.63,"end":2181.19,"speaker":"Jonathan Pageau","text":"Well, because I've experienced miracles. Because I've seen people. I've seen it. Like, I've seen people have someone pray for them and then, then they go to the doctor and the cancer's gone. Like, you know, if you, how do."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":2181.19,"end":2185.27,"speaker":"Peter Boghossian","text":"You know that's causal? People spontaneously remit from things all the time."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":2185.83,"end":2196.72,"speaker":"Jonathan Pageau","text":"That, that's, it's not how, how do you. Okay, how do you establish causality between meaning and events?"}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":2196.96,"end":2197.52,"speaker":"Peter Boghossian","text":"Evidence."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":2198.4,"end":2202.08,"speaker":"Jonathan Pageau","text":"There's no way to establish causality between meaning and events."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":2202.56,"end":2241.55,"speaker":"Peter Boghossian","text":"Well, there actually is. The Harvard prayer study, for example, has the largest end. I can't remember. It's like someone will look it up, but like 1,600 or 1,800 something people in which they had double blind placebo control groups about people praying for other people. And then they, After I think cardiac events and then they looked at that and there was no statistically significant difference. In fact, the people who got prayed for actually did it slight, Slightly more, slightly worse off. But like you can just invoke the tools of science to figure that out. If praying for someone caused cancer to go away. I mean, we've studied it and it's just not true."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":2241.95,"end":2264.26,"speaker":"Jonathan Pageau","text":"Yeah, well, I don't. Then I say this. I, I really struggle to see how you could study that. And the reason is because prayer is not a. Prayer is not a mechanical process that you just put someone, you just put two people in a box and say, no, don't pray for him."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":2264.26,"end":2265.66,"speaker":"Peter Boghossian","text":"No, that's 100. Right."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":2265.66,"end":2266.26,"speaker":"Jonathan Pageau","text":"Pretend."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":2266.26,"end":2266.94,"speaker":"Peter Boghossian","text":"No, you're right."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":2267.02,"end":2277.03,"speaker":"Jonathan Pageau","text":"Put a wall between you. Like you pray in secret and then you try to test. No, you're right. It's as if you said right, you know, Anyways, I just find it."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":2278.55,"end":2298.39,"speaker":"Peter Boghossian","text":"You're absolutely correct. That's why it's essential that you have a rigorous methodology. You get people who actually believe. I think, if memory serves me correctly, they recruited from Catholic churches, among other churches. But you get people who genuinely believe, who are churchgoers. You get a large n. In other words, a large number of people in the sample."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":2298.71,"end":2306.35,"speaker":"Jonathan Pageau","text":"You find you don't believe at all that prayer can help someone recover. What? You believe in the placebo."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":2306.35,"end":2307.83,"speaker":"Peter Boghossian","text":"You mean intercessory prayer?"}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":2307.99,"end":2309.75,"speaker":"Jonathan Pageau","text":"Like, do you believe in the placebo effect?"}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":2309.75,"end":2311.99,"speaker":"Peter Boghossian","text":"Wait, wait a second. You mean intercessory prayer?"}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":2311.99,"end":2314.47,"speaker":"Jonathan Pageau","text":"Yeah, like someone praying for someone else that could help him heal."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":2314.55,"end":2319.79,"speaker":"Peter Boghossian","text":"No, I think it's total nonsense. It's absolute nonsense. It's complete and utter nonsense."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":2319.79,"end":2322.39,"speaker":"Jonathan Pageau","text":"Do you, I mean, do you think, do you think that, do you think."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":2322.95,"end":2323.91,"speaker":"Peter Boghossian","text":"Hasn't been very important."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":2325.67,"end":2327.43,"speaker":"Jonathan Pageau","text":"You think a placebo effect is real?"}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":2329.06,"end":2338.98,"speaker":"Peter Boghossian","text":"You wouldn't get the placebo effect with intercessory prayer. You'd get the placebo effect with people praying for themselves. Okay, you may get the placebo effect."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":2339.62,"end":2343.78,"speaker":"Jonathan Pageau","text":"If you trust your doctor. Does the placebo effect have more effect on you than if you don't."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":2343.86,"end":2363.2,"speaker":"Peter Boghossian","text":"Hold on, let me Finish the thought. You may get the placebo effect. If people in your immediate circle were around you praying for you, and you had that. But there is no placebo effect. If you find people who are genuine believers, you show them pictures, you introduce them to this person, and they go off and they pray, then there's no contagion there."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":2363.28,"end":2366.64,"speaker":"Jonathan Pageau","text":"Okay, so what do you think the placebo effect is?"}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":2368.8,"end":2376.4,"speaker":"Peter Boghossian","text":"That's another question from. We have data on this and it doesn't work."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":2377.04,"end":2378.24,"speaker":"Jonathan Pageau","text":"Placebo effect doesn't work."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":2378.24,"end":2429.91,"speaker":"Peter Boghossian","text":"No, no, no. Intercessory prayer. So then my question to you becomes my same question as I asked you before, which is, you know, about going back, we find some scrolls. So I've given you another example. So you said you've seen miracle in your life and someone prayed for. And I asked you how it's causal. So I've given you another reason to at least pause or have doubt. And that has given you no doubt. And so my comment to you would be, it seems to me, I like you, you're a nice guy. I think we get along very well. And it seems to me that you're looking for a reason to hold the belief like those reasonable. Like, if you looked at that from any other proposition I gave you, like, people would say, okay, well, maybe that gives me a reason to doubt. Maybe I should be more epistemically questioning."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":2429.91,"end":2451.86,"speaker":"Jonathan Pageau","text":"Yes. I mean, I definitely. How can I say this? I definitely doubt. I definitely have doubts when I hear certain stories about people healing miraculously. Like, I definitely do have doubts about that. But I also see the manner in which of meaning and a connection to meaning."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":2452.1,"end":2452.66,"speaker":"Peter Boghossian","text":"Yeah."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":2452.66,"end":2458.7,"speaker":"Jonathan Pageau","text":"Does have an effect on health. Like, and that I see, I see, I see it all the time."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":2458.7,"end":2467.7,"speaker":"Peter Boghossian","text":"Yeah. That's different. That's different from an objective claim of someone praying for someone else and then them. The spontaneously remitting from some cancer or something. That's a different claim."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":2468.87,"end":2493.43,"speaker":"Jonathan Pageau","text":"It's not a completely different claim in. Because it's related to the way in which things like speech, things like care, things like attention are related to healing. Right. So they're not disconnected. Like, the human being finds healing in connection to meaning. Right. Maybe that's a good way to think about it. And that. And that it is possible."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":2494.55,"end":2495.35,"speaker":"Peter Boghossian","text":"Talks about that."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":2495.89,"end":2541.34,"speaker":"Jonathan Pageau","text":"Yeah, yeah, yeah. But I mean, so there's a way in which meaning. And so prayer. The prayer is an invocation of participation in. In higher meaning. That's in one aspect of what prayer is. It's calling upon something which is higher than us. Right. And then asking it to act with meaning down on the being and that it's like it's a reflect and it has. I mean, in some ways it's a reflection also of the care of the people. Right. So it's not. It's not a cold thing. So the, the. If you pray for someone, usually it means that you have some kind of love for them, like you care for them and that you're going to give attention to them."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":2541.5,"end":2555.16,"speaker":"Peter Boghossian","text":"Would you believe that that prayer would heal people if there was no God? The meaning alone in calling upon. It's the very act of calling upon something higher, even if that higher thing doesn't exist."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":2557.64,"end":2595.85,"speaker":"Jonathan Pageau","text":"That's an interesting question. Because in my. The way that I understand it is that it is because of meaning. That I believe in God is because I see that meaning stacks vertically and moves up towards unity. That I believe that. That there are meanings that transcend me. And therefore. And those meanings are active. Like they're not just data. They're. They're agent. Like they, they're agentic. They act down on us. And so for me, the question about meaning and the question about God is the same. It's the same question. So it's a complicated. It's a complicated question to answer."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":2596.17,"end":2633.57,"speaker":"Peter Boghossian","text":"So if there were no God, if you could. I'm watching an amazing show right now that I highly recommend called Dark Matter. Love it. One of the best shows I've seen in years. It plumbs the no financial association with the show. I'm telling you this for a reason, but it's like a subgenre of science fiction, parallel worlds. Let's say that you go to a parallel world and one of those worlds had a God and the other world didn't have a God and the world without a God, people are praying, they're calling upon the higher meaning. It's intercessory prayer on behalf of someone else."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":2633.57,"end":2633.97,"speaker":"Jonathan Pageau","text":"I don't."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":2633.97,"end":2635.05,"speaker":"Peter Boghossian","text":"Cancer, alcoholism."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":2635.21,"end":2647.21,"speaker":"Jonathan Pageau","text":"I think this is why. Because you don't agree with what a God is like there. That the world would not exist without. Without a God. The world can that if you believe in God."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":2647.29,"end":2652.77,"speaker":"Peter Boghossian","text":"That's a totally different. That's a totally different question. I'm happy to explore that with you. I mean, we could do that right now."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":2652.77,"end":2653.45,"speaker":"Jonathan Pageau","text":"Well, why not?"}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":2653.61,"end":2654.65,"speaker":"Peter Boghossian","text":"How would you know that?"}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":2656.75,"end":2700,"speaker":"Jonathan Pageau","text":"The way to know it at a lower level, let's say at the start, is to realize that. That the. The whole is always more than the sum of its parts. And you see that happen. So you see that every being has a third being. So it's like there's you and I, and then there's. There's a relationship. And that relationship has a. Has a kind. I mean, it's. It's in our. In this case, it. It's transient to some extent, but it's also real. Right? And so this is true about all groups. Like, all groups have something that pops up above it, which becomes an identity, which, which, which. Which relates people together. And that identity is causal vertically. Right? It binds. It's. It's a. It binds that group together. It."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":2700,"end":2705.52,"speaker":"Peter Boghossian","text":"Okay, I'm. I'm with you so far, but I don't understand. I'm not a God in terms of."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":2705.52,"end":2717.23,"speaker":"Jonathan Pageau","text":"A God, That's a God. So. By the way, I don't. That. That is a God or an angel. Use whatever word you want. It is a active agent that binds multiplicity together into unity."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":2717.79,"end":2732.51,"speaker":"Peter Boghossian","text":"So you're not talking about. You're not talking about a cosmological thing. You're not talking about Aristotle's Prime Mover. You're not talking about the Alpha and Omega, the beginning of the universe. Like, you're not talking about the, the Atman, the breath. You're not."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":2732.51,"end":2765.14,"speaker":"Jonathan Pageau","text":"I mean, but the hierarchy of God culminates into the Absolute. Like it has to, because you can see it happen at every level. And at some point, whether or not the absolute. I understand why some people struggle to see the absolute as personal or agentic. I understand why that's part of some philosophies. But there's a sense in which you can see it kind of scale up. That's why all the traditions have these kind of hierarchies of gods, right? It's like you have little gods and bigger gods, and these gods can hold other gods."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":2765.22,"end":2768.3,"speaker":"Peter Boghossian","text":"Just in Taiwan, I saw. I saw. I was fascinated."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":2768.3,"end":2796.36,"speaker":"Jonathan Pageau","text":"Like that. Yeah. So, I mean, for the same reason that we have, like, you see that there's a person, right? There's a multiplicity in me, and I'm held together. And then that I can hold together in a family, and then that family can hold together in a city, and then that city can hold together in a nation. And all those levels have a form of. Of binding, right? And a form of agency because they command us how to be together and continues to scale. And I'm still."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":2796.68,"end":2815.91,"speaker":"Peter Boghossian","text":"I'm with you. I'm. I'm with you on the scaling. I'm with you in the binding. I'm with you. So let me just ask so I can understand. So you. If a meteor came and smashed the kill, literally everybody on Earth. Would, would there, would there be a God?"}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":2817.19,"end":2836.55,"speaker":"Jonathan Pageau","text":"That, that's a, that's a hilarious idea. Like, it's one of those things where I. If you believe that the world lays itself out in meaning. Yeah, right. Then to just say, well, if something wiped out the meaning, magic making agent of all of reality."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":2836.79,"end":2837.27,"speaker":"Peter Boghossian","text":"Yes."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":2837.27,"end":2850.87,"speaker":"Jonathan Pageau","text":"Would God still exist? Which because you don't believe the world functions with meaning, you think it's just arbitrary causes, things bumping into each other. So you have to meteorite that hits the earth and kills all the agentic. Agentic beings that we know."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":2851.19,"end":2851.67,"speaker":"Peter Boghossian","text":"Yes."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":2851.67,"end":2867.11,"speaker":"Jonathan Pageau","text":"Because you don't believe that there's actually a story and that there's actually meaning. So to be consistent, I can't answer that question because I actually believe the world lays itself out in hierarchies of beings and in hierarchies of stories, that this is how it functions."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":2867.27,"end":2880.55,"speaker":"Peter Boghossian","text":"No, no, no. There's only. To be consistent, there's only one answer to that question for your belief system. To my belief system, there's I think two, possibly three. But to yours you'd have to say that's not possible."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":2882.23,"end":2885.51,"speaker":"Jonathan Pageau","text":"That what's not possible for the meteorite to just hit the earth randomly."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":2885.75,"end":2888.31,"speaker":"Peter Boghossian","text":"Yeah. Wouldn't you?"}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":2889.91,"end":2905.14,"speaker":"Jonathan Pageau","text":"Well, okay, is it possible? I mean, there is there. I mean, there's obviously a sense in most traditions and in Christianity too that this world will end, that that's part of the story."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":2905.62,"end":2906.02,"speaker":"Peter Boghossian","text":"Right."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":2906.02,"end":2916.1,"speaker":"Jonathan Pageau","text":"And that the, but the ending of this world is not the ending of the world. Like in the sense that there's a new world that emerges from the end. Right."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":2916.1,"end":2941.61,"speaker":"Peter Boghossian","text":"But not that it's programmed into the telos or subspecies eternitatus at the, you know, under the watchful eye of a trinity, this, these events unfold. But just Sol man, big meteor dude came down from freaking who knows what, Alpha Centaur, whatever, wherever it comes down and just like kills everybody. What a bummer that would be."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":2943.13,"end":2947.05,"speaker":"Jonathan Pageau","text":"But yeah, but that's what, that's what I mean. What I mean is that I'll never."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":2947.05,"end":2948.89,"speaker":"Peter Boghossian","text":"Get my black belt in jiu Jitsu. That's."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":2952.06,"end":3018.53,"speaker":"Jonathan Pageau","text":"Okay. So we could, I mean, we could obviously do it at a smaller scale. That, that, that makes sense. Right. Because tragic things do happen, you know. That is definitely true. But I think you're right that I would, I would tend to think that. Because I believe agency and intelligence are actually an aspect of being. Like they're actually of reality. And, and I think that humans, at least to our knowledge. Right. Play a specific role in that, in that cosmos. Like we Humans seem to be, at least, like I said, as we know to be, being that is both intelligent and incarnate. And so we, We. We have that. That kind of. That place. And so we seem to have an important place in the universe in that sense because we are. Are the universe knowing itself, where the universe is where we are. Basically the capacity for being to analyze itself, to know itself and all of that. And so the idea that just a random destruction of all humans. I think you're right that I don't think that that can happen."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":3018.93,"end":3019.41,"speaker":"Peter Boghossian","text":"Okay."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":3019.41,"end":3031.19,"speaker":"Jonathan Pageau","text":"I think that the end of all things can happen, but I don't think. I think that it would be. It would play itself out in a story because I think stories are part of, Of. Of the. Of reality."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":3031.43,"end":3053.51,"speaker":"Peter Boghossian","text":"Yeah. So I'm trying to. I'm trying to. I'm asking these questions because I'm trying to figure out what you believe, and I'm trying to have it make sense to me. So. And I'm trying to do so. And I'm really sincere when I say this with a hermeneutic of charity. So what is your view on the origin of the universe?"}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":3055.2,"end":3057.28,"speaker":"Jonathan Pageau","text":"What is my view on the cosmological."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":3057.28,"end":3061.2,"speaker":"Peter Boghossian","text":"Yeah, I mean, do you think. You think God created the whole shebang?"}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":3062.56,"end":3071.68,"speaker":"Jonathan Pageau","text":"I think. I think that the origin of the universe is in intelligence. And I. So I, I would say yes, I believe that God created the world."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":3073.12,"end":3082.56,"speaker":"Peter Boghossian","text":"Oh, okay. Let me ask you a total curveball question. I put this out on. I was thinking about this. I've been thinking about this for a long time."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":3083.49,"end":3090.29,"speaker":"Jonathan Pageau","text":"Let me just say that, is that I believe that the origin of the universe has to account for the intelligence that it contains."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":3091.57,"end":3108.69,"speaker":"Peter Boghossian","text":"The origin of the universe has to. Oh, so it can't be a chance mutations, a chance evolutionary mutations that yielded this with some, I don't know, I guess, perturbations in the system. But that yielded consciousness as it's currently manifest in humans and animals."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":3110.23,"end":3175.63,"speaker":"Jonathan Pageau","text":"Whenever you. Whatever. Chance mutation. Selection is not chance. Selection is the perpetuation of being. So if being has a tendency to perpetuate itself, let's say, then it has certain qualities which are. Which are already close to intelligence, like to whatever we think intelligence is, you know, because autopoiesis is not a. You know, it's like there's a difference between an autopoetic being and just a, you know, a rock falling to the ground. Like there this is. This is a qualitative difference that has to be. So even if it's transmutation, the selection process is in no, there's in no way. Chance is always to the perpetuation of being. The selection is so God. Like you could say that. I, I remember, I think it was Jordan Peterson, actually. He was the first one I heard him say that. He said God is that which selects. And I thought that's an interesting idea at least about the notion of how to help people understand what we mean by God. Let's say."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":3176.43,"end":3194.9,"speaker":"Peter Boghossian","text":"Yeah, in that sense you mean selecting. So I think it's funny, it's harkening me back to being in time by my Heidegger. I haven't read Heidegger in a long time. Never really a sure answer. Actually, my translation test for a master's degree was, was in Heidegger. I'm like, oh no."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":3198.74,"end":3204.34,"speaker":"Jonathan Pageau","text":"That'S crazy. I think they didn't like you. I think they had some disdain towards you."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":3205.06,"end":3224.83,"speaker":"Peter Boghossian","text":"So that's probably more true than you know. Okay, so. So you're using being in that sense as opposed to or adaptive organisms. So you're using a kind of philosophical or even theological sense of being as this thing that's revealing itself in the world."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":3224.83,"end":3235.67,"speaker":"Jonathan Pageau","text":"But even the adaptive organism, think about it like there's. We take, we take. How did we take for granted like that being perpetuates."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":3236.55,"end":3239.27,"speaker":"Peter Boghossian","text":"Well, let's, let's say that like why."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":3239.27,"end":3241.19,"speaker":"Jonathan Pageau","text":"Does, why does life fight entropy?"}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":3242.07,"end":3245.51,"speaker":"Peter Boghossian","text":"Oh, well, that's a different question. Hold on, let's, let's go back to your other question."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":3245.51,"end":3247.59,"speaker":"Jonathan Pageau","text":"That's not a different question. It's the exact same question."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":3247.91,"end":3258.39,"speaker":"Peter Boghossian","text":"But okay, like why does. Hold on. Then I have to shift my consciousness and say that question. Because this is a, this is so many things. I'm trying to limit this."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":3258.39,"end":3259.55,"speaker":"Jonathan Pageau","text":"Yeah, yeah, sorry, sorry."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":3259.55,"end":3310.63,"speaker":"Peter Boghossian","text":"No, no, no, you're good, you're good. So, so if you, you know, if you could rewind the clock and we evolve slightly differently and for example, we were kind of appendage bearing. I don't know if you play Starcraft, a long time ago, the Zerg, you know, these like insectozoid creatures that went on and they were in different bodies and one claimed to be the Christ and he resurrected. You wouldn't need humans in their current incarnation in their current physical forms. Right? Like you could have the same intact theology etc with beings that look quite different. You're looking at me like that's a."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":3310.63,"end":3412.45,"speaker":"Jonathan Pageau","text":"No, but I'm looking at you. I think it's hilarious because you think that the fact that humans, the way they are became conscious and intelligent is just this arbitrary thing. It could have Been something else, but we don't have an example of it being something else. You have no way to speculate the idea that, that insects in the form of insects with exoskeletons or whatever could become self knowing beings in the way that humans are. Right. And so, and, and, but I want to be care, I want to be, I want to be cautious, like to not sound like I'm just anything. Right. It's like you could say so let me what it feels like when you're asking me that question, right? That I say like I see a telos. Let's say in, in that's exactly what I'm. Where I'm going, I see a teleson animal. So I say there are animals that fly and those animals do not have to be related biologically in order to reach flight, but in order to reach flight there are certain characteristics that they have to have in order to fly. So tell me, well, what if it was a slug but it became really advanced and then it flew? And I'd be like well no, because slugs don't have what it needs to fly. And so if you propose some arbitrary being that has all these characteristics and you say well what if that was the being that became the self conscious intelligent being? I'm like well whatever. It's like that's a, that's a. To me that's, it's as irrelevant as saying what if slugs could fly? Well if they could fly they wouldn't be slugs, they would be something else, I guess something that would have wings that have some kind of extension that could push against air. Like it's not like anything can be anything."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":3413.01,"end":3440.63,"speaker":"Peter Boghossian","text":"Sure. So the purpose of the thought experiment was. It was not a roundabout, but it was a way to see if I could figure out without asking you directly. So I'll ask you directly the telos that you're thinking about the current five fingers and toes and the way we look with the hair on top of our head and male and female etc. Although that would be debated recently."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":3441.99,"end":3446.19,"speaker":"Jonathan Pageau","text":"So that's maybe because we got rid of that frame that held everything together."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":3446.19,"end":3463.23,"speaker":"Peter Boghossian","text":"Yeah, well, I know that's, that's a totally another conversation. That's the substitute, the substitution hypothesis. So, so you think that the way we are right now is there's a kind of necessity in that, a biological and evolutionary necessity, I think to the function."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":3463.23,"end":3514.6,"speaker":"Jonathan Pageau","text":"I think so. I think that it's not that there isn't variability. Of course there's variability, but that variability is limited. Just like all the time we talked about variability is that there's a variability of things that can accomplish something, but it's not indefinite. And so I think that the way that humans. How can I say this? This is also why the ancient thinking they would see a human as microcosms, right? And that's why they say something like that man is the image of God. Like, even the way that man is made, like his part, the fact that he stands straight, the fact that his head is above the fact all of these aspects of even the way that human is made is related to, is not arbitrary. It has to be within a certain amount of variety to be the case."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":3514.76,"end":3531.51,"speaker":"Peter Boghossian","text":"It's not arbitrary evolutionarily because if we were subject to different evolutionary pressures, we would look differently. And I guess I'm asking if we look differently, considerably different, differently, would the same theological precepts still be operative in the. Your paradigm?"}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":3533.35,"end":3548.25,"speaker":"Jonathan Pageau","text":"It's like, I really, I just. It's funny how I hate these questions because I think it's also because I'm a really a realist. Like, I'm a realist in the sense that I'm like, why are you speculating about worlds that don't exist? In order to help you about the world that exists."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":3548.49,"end":3622.71,"speaker":"Peter Boghossian","text":"I'll tell you exactly why I'm doing. I'm doing that so I can see, I can figure out the limits of the belief and how your beliefs cohere together in some kind of a system. So the purposes of the questions, they're not gotchas, they're not trick questions or anything. They're ways for me to figure. It's kind of like coherence testing for beliefs. And it gives me a better idea. It's. The other thing is, it's a way for me to listen to what you believe. And sometimes if you ask somebody a question, you know, people won't give. And I'm not saying you won't do this, but people won't give you a direct answer to the question. And so what you'll have to do is you'll have to tease that. That out. Like, for example, if I said so the way that we've evolved now to look like we do with five fingers, five toes, is that evolutionarily this, is that a necessity? Or if conditions were different, you know, it's pre. Adamant of, no, I have to be before pre advent of brain 10,000 years ago. But if conditions were different, you know, different sun for sort of the different sun."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":3623.47,"end":3656.1,"speaker":"Jonathan Pageau","text":"That's hilarious like this. I mean, I think this is probably again like why? I really, I believe the meaning is part of the world. It's like there's a coherence to the way the world is like the, the distance of our sun to the earth, that all of these things are the fine tuned, whatever reality that makes it possible for us to exist. You know, so if you posit a world with three suns and you think, well, what if we evolved on a world of three suns? Like, well, I. Would we evolve on a world with three sons? Like, would we evolve in a world that's not the exact one that we're in?"}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":3656.5,"end":3706.73,"speaker":"Peter Boghossian","text":"So the, the only reason that we can look at these things and say, you know, wow, this is extraordinary, is because if those initial conditions weren't the same, there'd be nobody there to say, wow, this is extraordinary. Of course, right. So. But that doesn't mean. I was at an Indian restaurant many years ago and the guy didn't speak English that well. And he asked my friend, my buddy Steve, he said, what is the meaning of meaning? And I thought that was such a great question. But in other words, I'm saying that because the sentiment is there. We're looking at the situation which we find ourselves and we're saying, oh my God, this is miraculous. There's life, et cetera. Yeah, but you're only saying that because. We're only saying that because it's an easy pitfall to fall into. Because if the conditions were different, there'd be no one there to say it."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":3707.45,"end":3709.53,"speaker":"Jonathan Pageau","text":"That's right. There would be no one there to say it."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":3709.77,"end":3710.09,"speaker":"Peter Boghossian","text":"Yeah."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":3710.09,"end":3713.37,"speaker":"Jonathan Pageau","text":"And so there would also be no one there to not say it or to."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":3713.93,"end":3715.97,"speaker":"Peter Boghossian","text":"Well, that's the fallacy of there'd be."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":3715.97,"end":3717.05,"speaker":"Jonathan Pageau","text":"No one there for anything."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":3717.61,"end":3726.33,"speaker":"Peter Boghossian","text":"Right. That's the fallacy of fine tuning. And so then we infer from that that it's been fine tuned. The universe. That's. Victor Stenger wrote a great book about that, the Fallacy of Fine Tuning."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":3726.49,"end":3745.09,"speaker":"Jonathan Pageau","text":"Well, we don't. How can I say this? Like, we don't. Like, we infer from that that it's fine tuned. How can I say this? Like. Yeah, we see that meaning and purpose. Yeah. Right. And patterns."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":3745.25,"end":3745.81,"speaker":"Peter Boghossian","text":"Yeah."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":3745.97,"end":3765.21,"speaker":"Jonathan Pageau","text":"Exist. They don't exist in the same way that things exist, but they exist in the, in the manner in which they, they bind elements together. Right. So we notice, for example, that bats fly and birds fly and butterflies fly and all these things fly. And so now we have a category called flying."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":3765.45,"end":3765.77,"speaker":"Peter Boghossian","text":"Right."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":3765.77,"end":3766.89,"speaker":"Jonathan Pageau","text":"Which is a purpose."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":3767.21,"end":3767.61,"speaker":"Peter Boghossian","text":"Right."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":3767.85,"end":3784.5,"speaker":"Jonathan Pageau","text":"It is a telos. You could say something like, well, there is no telos. But if we still recognize it like the, the telos is not in the thing. The telos is in the way that we recognize it as sharing something in common, but towards a purpose."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":3784.82,"end":3795.78,"speaker":"Peter Boghossian","text":"And so the talos would be. Maybe talos wouldn't be the right way to look at it, but it would. Those were adaptations to enable reproductive success."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":3796.5,"end":3798.18,"speaker":"Jonathan Pageau","text":"But they have a coherence to the."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":3799.14,"end":3800.18,"speaker":"Peter Boghossian","text":"That's 100%."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":3800.34,"end":3804.74,"speaker":"Jonathan Pageau","text":"They have a coherence that resembles itself across space sheets."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":3805.62,"end":3809.86,"speaker":"Peter Boghossian","text":"Right. That's why we can. You can say that speech utterance. And I understand it."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":3809.86,"end":3831.61,"speaker":"Jonathan Pageau","text":"So you could say that that's an. So that's an objective pattern that if certain constraints are placed on certain things, then they will yield certain results that, that, that, that bring a being into a certain telos. But you. But it's hard. So what I would say is that that telos pre. Exists."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":3833.21,"end":3839.21,"speaker":"Peter Boghossian","text":"Well, I was right up with you toward the end. I was almost going to agree. What do you mean, what do you mean pre exists?"}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":3839.65,"end":3865.57,"speaker":"Jonathan Pageau","text":"What it Pre exists because it is independent from the multiple instantiations of it. It's, it's. It's independent. It's not dependent on the instantiations. Right. Because they are from different species and therefore they attain something we recognize as a pattern of being. That pattern of being. It's not dependent on, on the, on the, on the multiple effects that happen down here. Is that. Is it."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":3865.65,"end":3874.6,"speaker":"Peter Boghossian","text":"Okay, So I guess I'm unclear. So, so why. I don't understand where being keeps coming into this. What do you mean by being?"}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":3875.72,"end":3898.49,"speaker":"Jonathan Pageau","text":"What do I mean by being? In the case of what we're talking about, we're talking about something which is. Something which perpetuates itself. Like, especially in terms of biology. Like, that's a really. That. I think that's a good way of thinking about it. Right. Something that's, that's, that's autopoetic and that is agentic. That has. That acts on other things."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":3900.09,"end":3906.17,"speaker":"Peter Boghossian","text":"Right. So would a mollusk be a being?"}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":3906.41,"end":3928.84,"speaker":"Jonathan Pageau","text":"I mean, to some extent it's a lower being. Right. That's. That's how it's traditionally understood is that there is a hierarchy of beings in terms of how much. How. Let's say gentic. They. They are and how. Say how conscious also, I mean, that's not. There's a relationship between consciousness. It's not exactly the same, but there is a relationship. Okay."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":3929.16,"end":3938.52,"speaker":"Peter Boghossian","text":"And so now relate that to me so I can understand. And then I, I have to go relate that to me so I can understand to the flying Thing related to flying thing."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":3938.52,"end":3945.16,"speaker":"Jonathan Pageau","text":"So, yeah, you have a bunch of. Okay, so you have. You have a bunch of stuff, Right? Right."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":3946.04,"end":3952.58,"speaker":"Peter Boghossian","text":"They're gonna be like 10 people on the Internet who think this is the greatest ever. And everyone else is gonn. These guys talking about."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":3954.02,"end":3977.46,"speaker":"Jonathan Pageau","text":"Okay, so. All right, so you have. You have a bunch of. You have a bunch of stuff, right? And there's a way in which that stuff enters into patterns. Okay, does that. Does that make sense? Right, that makes sense. All right. Okay. And so what you notice is that. And those patterns, they. They kind of cohere, multiplicity into one. Okay, does that make sense? All right, so that means."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":3977.54,"end":3982.68,"speaker":"Peter Boghossian","text":"Because I'm thinking about in terms of flying, butterflies, bats and. And so birds."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":3982.68,"end":4027.67,"speaker":"Jonathan Pageau","text":"So that what I'm positing is that that pattern is an objective reality. It's not objective in the same way that it's objective like math is real. It's real. Like math is real. It's real. Like, proportions are real. It's real, like relationship between, you know, the ordered relationships are real. Okay? And that's agent. It's agentic in the sense that it binds things into it for reasons, for purposes. And so the beings, they come to something that you recognize. You see a pattern which is called flying. And that pattern is independent from the constituents because all these different constituents reach the same thing that have nothing to do with each other."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":4027.83,"end":4029.83,"speaker":"Peter Boghossian","text":"What do you mean, independent of the constituents?"}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":4029.99,"end":4043.08,"speaker":"Jonathan Pageau","text":"What I mean is that there's no biological continuation between. Well, I mean, maybe very, very far back, but, like, there's no biological continuation between a bird and a bat and a butterfly."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":4045.4,"end":4048.04,"speaker":"Peter Boghossian","text":"Right? They were adaptive and they adapted to."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":4048.04,"end":4054.36,"speaker":"Jonathan Pageau","text":"Adapted in a manner that is a type of pattern that you can recognize as having coherence."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":4055.48,"end":4056.44,"speaker":"Peter Boghossian","text":"We totally agree."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":4056.76,"end":4099.89,"speaker":"Jonathan Pageau","text":"Right. But yeah, so that is. How can I say this? Like, now take that, right? That type of thinking, and you apply it to groups of people, for example. And then you notice that there are agentic patterns that run through groups of people, right? And that those have a type of coherence and you can recognize it across. Right? So you can know what war is because there are people in. In Papua New guinea in war, and there are people in America in war, and there are people in China in war, and they're all manifesting a single pattern that is. That is coherent and is. And is agentic because nobody's controlling it. There's no one in the war that is."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":4099.89,"end":4101.81,"speaker":"Peter Boghossian","text":"Okay, I am with you. I'm with you. I'm with you."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":4101.81,"end":4103.89,"speaker":"Jonathan Pageau","text":"That's. That's what A God is Peter."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":4106.37,"end":4107.89,"speaker":"Peter Boghossian","text":"Okay, now you lost me."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":4108.13,"end":4153.89,"speaker":"Jonathan Pageau","text":"How did I lose you? Okay, so, so have. You have a form of. Double form of. Let me use now more religious language. You have of transcendent agency. Right. That is coherent and that. That binds groups of people into behaviors that none of the people control, but that is nonetheless plays itself out with a purpose that nobody can fully hold on to and that you can recognize across different spheres. And so that's what someone would call the God of war. That is what the ancients."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":4155.49,"end":4157.97,"speaker":"Peter Boghossian","text":"You've really stretched the semantic range."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":4159.89,"end":4181.81,"speaker":"Jonathan Pageau","text":"At all. Now I'm talking about little gods. Like, these are little gods. These are the angels, these are the demons. These are the gentic beings that we see run through our society, you know, and we see, recognize. So we can see that someone is possessed by a certain type of agency and they no longer have control of their being. And so we say they're possessed by a demon."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":4181.97,"end":4203.77,"speaker":"Peter Boghossian","text":"Okay, So I could, for the purpose of conversation, I could completely adopt the language, the worldview, the structure. I could do that. I could make that little, little, little shift. Okay, I got it."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":4204.33,"end":4208.53,"speaker":"Jonathan Pageau","text":"Okay, so now. So now what the difference between that world, right?"}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":4208.53,"end":4208.97,"speaker":"Peter Boghossian","text":"Yeah."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":4208.97,"end":4234.41,"speaker":"Jonathan Pageau","text":"Have a world, let's say world, a pagan world, where you have multiple agencies. Some of them represent aspects of reality. Right. So like. Like desire or war or you know, craftsmanship. And you see them and then some actually represent groups of people. Right, Right. We have the local God. That is the principality that holds our. That that's the reason why we're a tribe and not just a bunch of strangers. Right?"}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":4234.41,"end":4234.73,"speaker":"Peter Boghossian","text":"Right."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":4235.45,"end":4251.79,"speaker":"Jonathan Pageau","text":"But the problem with these gods, right, is that obviously they don't all want the same thing. And so they fight with each other. Conflicting. Not only. Not only the gods fight with each other, but then the tribes and the groups fight with each other."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":4252.51,"end":4253.15,"speaker":"Peter Boghossian","text":"Okay."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":4253.39,"end":4289.39,"speaker":"Jonathan Pageau","text":"And so you see. But it actually has, like, in practice, it's not. It's not to say that the religion causes the war, is that the. The agency that's running through them is in competition with the other. And so you can experience that inside yourself, the same thing, right? So you have lust and you have this other desire and you have hunger, you have things that you have pride. You have all these things that are running and you can recognize them across people. So it's like if I experience lust, I can see that when you experience lust, it seems to be similar. And so I can recognize God."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":4289.39,"end":4289.95,"speaker":"Peter Boghossian","text":"I hope not."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":4289.95,"end":4295.43,"speaker":"Jonathan Pageau","text":"I hope not. Only now when we're together, you know, like."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":4297.83,"end":4306.29,"speaker":"Peter Boghossian","text":"We have an end of this conversation. Very soon. Keep those breaks away from you, baby."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":4306.29,"end":4359.64,"speaker":"Jonathan Pageau","text":"The whole thing is a point of situation. Okay, so let me get through. So you have this world where there. And so then what, what. What happens is that at some point you realize that there is something which can bind all of those together. And so we can't. So maybe we can to some extent disagree to what that is. You know, and so we'll say being. We'll say I am. Right? So God in the Bible says I am. That I am. So I. I am being itself. All right. So being itself seems to align all of these different agencies together or the infinite. So we say God is infinite. God is. Is all this all knowing. All, all, all. Like it's just all. And so we have it. We. We can notice that we have to bind all of these multiplicities into a top unity."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":4359.64,"end":4362.76,"speaker":"Peter Boghossian","text":"Why can't the thing that binds be an evolutionary impulse?"}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":4363.88,"end":4365.32,"speaker":"Jonathan Pageau","text":"But I don't even know. What do you mean?"}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":4366.04,"end":4370.12,"speaker":"Peter Boghossian","text":"Well, the impulse to survive, for example, why couldn't that be the thing about it?"}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":4370.52,"end":4379,"speaker":"Jonathan Pageau","text":"So let's say the perpetuation of being. I like survive is a weird thing because it's, you know, the. Can I say."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":4379,"end":4380.56,"speaker":"Peter Boghossian","text":"Okay, okay, because."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":4380.56,"end":4421.73,"speaker":"Jonathan Pageau","text":"Because, you know, because anyways, that say the perpetuation of being seems to perpetuate. Right. And so I think that that's not a completely bad way of seeing it, you know, And I think that the question is what. How can I say this? What makes that the most possible at the most levels on the longest stretch of time? And I think that. That if you look at the very immediate things, a lot of. I think a lot of the, of the kind of simplistic, I think Darwinian things is usually they look at it at a very short scale. It's like just this one. The reason why they perpetuate into being is because I. Trying to scale it. I know it's hard for."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":4422.05,"end":4426.21,"speaker":"Peter Boghossian","text":"No, I just. It doesn't seem to me to be a very parsimonious explanation."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":4426.69,"end":4427.41,"speaker":"Jonathan Pageau","text":"What do you mean?"}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":4428.37,"end":4448.83,"speaker":"Peter Boghossian","text":"Well, I mean, you can just. It's kind of thinking adjunct to Occam's razor. You can. Why would you posit anything beyond it seems like it's orienting itself towards another ontology or another metaphysics or something supernatural. When you have naturalistic explanations, given the framework and the paradigm that you've just."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":4448.83,"end":4498.94,"speaker":"Jonathan Pageau","text":"Explicated, you don't have natural frameworks. And the reason why is because the evolutionary type biologist, and you see that in Dawkins too, because when he gets into the world of Means he's like, well, I give that up. I'm not going to talk about memes. I'm the one who came up with the term memes. But I don't understand how they function. I don't understand the reason why they're there. I don't understand how they bind reality together. I don't understand how they perpetuate being. I don't understand any of that stuff. And so you have this problem because humans don't also. Beings that are higher than us also try to perpetuate themselves. Nations are autopoetic. Nations are agentic. Nations try to defend themselves from other beings. They act analogously to, to, to beings at a lower level. They're act like big cells."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":4498.94,"end":4503.26,"speaker":"Peter Boghossian","text":"And so I never, I never think about Heidegger. But isn't being only found in beings?"}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":4504.54,"end":4505.18,"speaker":"Jonathan Pageau","text":"Is what."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":4505.5,"end":4507.54,"speaker":"Peter Boghossian","text":"Isn't being only found in beings?"}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":4507.54,"end":4518.68,"speaker":"Jonathan Pageau","text":"Well, it's found incarnated, you could say, in beings. But it, but it nonetheless calls, right? It calls, it calls towards something, right? It calls towards unity and maybe the."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":4519.56,"end":4537.96,"speaker":"Peter Boghossian","text":"Yes, okay, so I guess at an individual atomic level, I can. Atomistic level would be a better way to think of it. I get the. And I can use the beings. It gets more difficult for me, and maybe it's just a lack of my imagination."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":4538.12,"end":4558.65,"speaker":"Jonathan Pageau","text":"Peter, the reason why this is important is because, is because you have no way of accounting for religion. Religion is a universal thing that is there in every culture from the beginning of time until very recently. And you don't have a way to account for it except to say that it's something bad that we should kind of get rid of. And it's going to say, I don't think."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":4558.65,"end":4560.21,"speaker":"Peter Boghossian","text":"No, no, I don't think we should get rid of that."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":4560.45,"end":4605.04,"speaker":"Jonathan Pageau","text":"What I mean is that, is that this is the problem. Like, because there are modes of unifying beings together that transcend the individual level. And if you can't, if you don't have a system that accounts for it, then you just. Then you say religion's a mind virus or whatever type of thing that a lot of the. I'm not saying you said that, but let's say, yeah, so it's like that. It's a mind virus. You think, okay, that means that you can't see the analogy between, let's say, a religious service and a religious procession and the cohesion of cells together in a, in an organ. And how there's a type of. There's a, there's a, There's a way in which they come together. The multiplicity moves in."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":4605.04,"end":4608.8,"speaker":"Peter Boghossian","text":"Yeah. So just. Just to be clear with my sense, then I really do have to go out."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":4608.88,"end":4609.44,"speaker":"Jonathan Pageau","text":"All right."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":4609.52,"end":4642.81,"speaker":"Peter Boghossian","text":"Just to be clear with my sense. I was very explicit in my work and my writing that religion is not the problem. Religion. In fact, I. I couldn't be more clear. Religion is community. Religion is people coming together. Religion, religious. A lot of positive aspects of my problem has always, from day one, been the epistemological claims, the truth claims. And again, I never think about this stuff anymore. It's just totally irrelevant, given the civilizational threats we're currently facing. I think we both agree on those. All right, I have to go."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":4642.81,"end":4646.01,"speaker":"Jonathan Pageau","text":"All right, all right. It was good. We can set up another meeting. But this was."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":4646.01,"end":4648.09,"speaker":"Peter Boghossian","text":"Let's do another one, man. Let's do another one."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":4648.09,"end":4649.33,"speaker":"Jonathan Pageau","text":"Enjoy it. All right, good."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":4649.33,"end":4652.01,"speaker":"Peter Boghossian","text":"I had a good time. Thanks, Jonathan. Quite good fun."}
{"episode_id":"SW - #352 - 2024-08-08 - Peter Boghossian - What Is Religion -","start":4653.23,"end":4668.11,"speaker":"Jonathan Pageau","text":"If you enjoy these videos and podcasts, please go to the symbolicworld.com website and see how you can support what we're doing. There are multiple subscriber tiers with perks. There are apparel and books to purchase, so go to the symbolicworld.com and thank you for your support."}
