{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":12.56,"end":38.17,"speaker":"Jonathan Pageau","text":"This is Jonathan Peugeot. Welcome to the symbolic world. Well, Vesper, it's good to see you. For people who are watching this, they probably don't know that we've. We've exchanged quite a few emails in the past. We've even had some phone calls. And so it's. It's kind of nice to have a public discussion."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":38.57,"end":39.85,"speaker":"Vesper Stamper","text":"Yeah. This is exciting."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":40.57,"end":44.01,"speaker":"Jonathan Pageau","text":"So you must be really excited. Your book is. When is your book coming out?"}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":44.73,"end":67.11,"speaker":"Vesper Stamper","text":"So my book comes out August 25th, and it's called A Cloud of Outrageous Blue. I put a copy behind me, you know, because you're supposed to do that, you know, you're supposed to first of all pose in front of a bookshelf, you know, to show that you're widely read. And then you're supposed to like, casually of your own book among the canon."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":67.35,"end":75.43,"speaker":"Jonathan Pageau","text":"You know, you're doing everything right. There you go. You're doing everything right. And so are you done? Are you finished?"}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":75.99,"end":111.13,"speaker":"Vesper Stamper","text":"Yeah. So here's the crazy thing about the book. As you know, it's a book about the great plague of 1348. So it's a pandemic book. And I just so happen to have like, wrapped it up and put a nice neat little bow on it in. Just after the new year, like just in January, got through the last pass of the copy editing, handed in all the artwork, and then the pandemic hit. So sort of relevant, sort of timely. I think we can have some interesting things to talk about today."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":111.45,"end":148.81,"speaker":"Jonathan Pageau","text":"Yeah. So how do you. How do you feel like. I mean, it must be a weird. We always. I always use the phrase symbolism. Happens when you know you something. All these patterns are kind of coming together in a way that wasn't planned, but ends up looking almost as if someone planned because maybe you were in on the conspiracy and from the beginning, you know, that's. Yes, you're part of the conspiracy. So maybe we can talk about. Start with that, if you're interested. And I mean, I'd like to get a sense of how, in terms of narrative, how you treated the question of the plague and human relationships and how it relates to kind of what we're going through right now."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":149.21,"end":220.58,"speaker":"Vesper Stamper","text":"Yeah, well, originally, this wasn't the book that I was going to write. I was going to write a book about. About the fluidity of time, time and space, the fact that land holds memory. There are all these other things that I was going to write about these two girls that could see each other through time. So nobody. Can nobody steal that idea because I'm still going to write that book. But my publisher, because I had written a historical fiction book when I first came on with Knopf, they wanted to kind of keep me in the historical fiction vein for readers. And so I kind of went, you know, squarely to the medieval part of the story. And, you know, I've always been a medieval Phil. I kind of cut my teeth on iconography, like, in more of an art historical sense than a faith sense. I'm not orthodox, but. So it was interesting to me, but, like, I couldn't settle on a time period I was going to. I really wanted to write something from, like, around the turn of the millennium. Like the Hildegard von Bingen kind of era."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":220.74,"end":221.22,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":221.3,"end":329.22,"speaker":"Vesper Stamper","text":"But there just wasn't enough documentation. But it seemed like right around the time of the plague, all of this documentation kind of hit, you know, and there was just a lot more wealth of research available, you know. So that's kind of how I fell into the time period. And I thought, oh, wouldn't it be interesting to write about a girl or anybody who was, like, who had these powers of perception, but also was perceived as kind of a misfit, you know, as all this chaos was breaking out, you know, like, how. Because, like, the subject of saints, you know, how does somebody become a saint? And then how does somebody become labeled a heretic? Well, sometimes that's the same person. Sometimes they're a saint one minute, and then they, you know, get labeled heretic next, and they're being burned at the stake. Or sometimes they're considered a heretic, but then after they're burned at the stake, they emerge as a saint. So I thought, okay, well, what would it be like to be that a real person, right, who's on the outside, who's a misfit and has this way of seeing the world that isn't like everybody else, doesn't conform as the world's falling apart. Yeah. So that's what the book is about. And her kind of powers of perception really are. There's synesthesia. So are you familiar with what synopsis? So for, I guess, for those who don't know, it's a kind of crossing over of the senses neurologically so that people can see sound as color, you know, playing out before them, or they can taste emotion or things like that. So. Yeah."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":330.18,"end":379.57,"speaker":"Jonathan Pageau","text":"And how do you feel? Do you feel like the. The way you approach that, say, disease or. Or the plague time? How do you see it? Do you see it connected? Because the thing about the time of the plague is we. There was a Lot of apocalypticism at the same time. Time. Obviously it makes sense. You've got half the population, people dying off whole villages, you know, being exterminated by this plague. And so you can imagine that there was a lot of conspiracy and a lot of apocalypticism going on. Kind of madness took over some aspects of European culture. Not everywhere, some places remain quite sane. But, you know, this idea of the image of the Jews poisoning the well, or this kind of idea of the stranger who is the one who brings about the plague. So. So I don't know if you were able to deal with those ideas in your book as well. This kind of weird apocalypticism that comes about."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":380.21,"end":473.97,"speaker":"Vesper Stamper","text":"Yeah, yeah, definitely. I mean, that. That plays out in the latter half of the book when the plague actually hits. But because my first novel was about the post Holocaust period, and I was dealing with the question of how antisemitism arises when it arises. And one of the things that I discovered in the research for that was that these major persecutions of the Jews emerge like clockwork, like every 70 to 100 years. So maybe like once a generation, there will be, like, a major persecution of the Jews. The Holocaust was not the first and certainly won't be the last. It just happened to be the biggest. But then that's how I discovered, you know, the persecution of the Jews during the plague. Now, in England, where my book is set, it's a little bit different because the Jews had been expelled. I can't remember which king it was. I think it was one of the Edwards who had expelled them in the 13th century. So there wasn't like a tangible Jewish community. But in places, you know, more in central Europe, that was really a monstrous thing that was taking place. So. But what emerged in England and in other parts of Europe was the. The movement of the flagellants, like the people who would go through streets, you know, whipping themselves and stuff. And so that is something that I felt was important, was. Was important and was kind of of a piece with that kind of conspiratorial thinking."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":474.13,"end":477.17,"speaker":"Jonathan Pageau","text":"Yeah. And it's happening now. We're seeing flagellants, right?"}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":479.02,"end":524.45,"speaker":"Vesper Stamper","text":"I mean, totally. And it's kind of like every stage of this thing, right from the announcement of the pandemic all the way through to, like, yesterday I saw a video of. Was it yesterday, today? Of the mayor of Minneapolis being hauled before a crowd and told to defund the police. An idea which is about, like, in the public consciousness, which is about one week old. So we're gonna, like, completely dismantle this whole system in one week. And what was he gonna do? You know, like he had to. The option was self flagellate or maybe we'll kill you or flee for your life."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":524.53,"end":525.09,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":525.49,"end":528.01,"speaker":"Vesper Stamper","text":"You know, so, yeah, it's very."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":528.01,"end":585.47,"speaker":"Jonathan Pageau","text":"It's a very. It's very strange because a lot of people don't necessarily want to see or don't understand that there's a dis. Direct connection between what's happening in terms of the riots and in terms of the protests and the COVID It's related narratively. It's related in terms of general apocalypticism. Right. That's most of what's going on. The sense that either this system is falling apart, it's going to end, or that the system has to end, that we will be part of its dismantling. And then what we haven't seen yet, but which is coming. And we've seen some hints of it, actually, in Chicago, there were some hints of it where it's going to be people resisting and saying, no, we don't want to dismantle this system and we're going to fight to stop it. And so it's not looking. It's not looking like a bright. Like a bright future."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":586.19,"end":663.29,"speaker":"Vesper Stamper","text":"No. And I was talking to somebody earlier today and I. I said, you know, this could kind of go a number of different ways. We could either, like we were saying, you know, you never know that you're living in a moment of history until you look back on it. Right. Well, everybody's saying this is a historic moment. And I said, well, that's certainly possible. I mean, two of the options are that we could either, you know, find a great solution and move forward in this, like, way of peace and have like a 1964 Civil Rights act moment where things get healed, you know, at least enough for the moment to be able to move forward. Right. Or we could break out into open civil war. The third option is the thing peters out and we look back and we're like, oh, remember that thing that happened? Yeah, that was weird. You know, I mean, I don't think so, but, you know, I think the movement, the fact that the movements, whether it's Covid or it's the race riots, that they're global is something that we haven't seen in our generation."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":664.49,"end":693.29,"speaker":"Jonathan Pageau","text":"Yeah, yeah, we'll see. We'll see how it goes. I think that because it's also an election year, I don't see this changing, at least for the near future. So we're gonna have to strap on. It's. I had. It's so weird because at the beginning of the year, I said, I told people, this year, you guys get ready for this year, because it's gonna be crazy. But I didn't expect all of it. I didn't expect so much to come together. So."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":693.69,"end":699.13,"speaker":"Vesper Stamper","text":"Oh, my goodness. I feel like I'm living in a movie. I can't believe it, you know?"}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":699.45,"end":714.16,"speaker":"Jonathan Pageau","text":"Well, the images of the protesters wearing masks, it really looks like a science fiction movie, like a post apocalyptic movie. So, yeah, we are definitely. The story is definitely ramping up."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":714.56,"end":716,"speaker":"Vesper Stamper","text":"Yes. Yeah."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":716.4,"end":749.59,"speaker":"Jonathan Pageau","text":"And so the thing about the plague is that it came. There was a lot of upheaval during the time of the plague, and people don't remember that so much. There was a lot of peasant revolt and there was a lot of, say, people from the higher classes who were being, you know, killed, just being stopped on the road and being killed. And there were revolts, like actual, you know, civil war type revolts within the peasants after the. During the time of the plague and especially after the first wave."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":750.55,"end":800.41,"speaker":"Vesper Stamper","text":"Right, right. Like the peasants revolt of 1381. And I think what's interesting is that, I mean, there's just so many parallels. But, you know, you had. In like, 1315, you had the. The great famine. Right. And so the parents of the people, the parents of, let's say the young people during plague had experienced their own trauma, you know, with the great famine where like a significant amount of the population of Europe died in that because of. I think it was the end of the Medieval Warm Period. So you had this like, climate change event and catastrophic famine like that, an already kind of weakened population. Right. And then into that comes the pandemic, and then into that comes the civil unrest."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":800.65,"end":801.13,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":801.21,"end":814.72,"speaker":"Vesper Stamper","text":"You know, and so it's interesting that you brought up the revolt too, because one of the things that has been fascinating to me is, is the degree to which the plague was responsible for the birth of the modern world."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":814.96,"end":858.37,"speaker":"Jonathan Pageau","text":"Yeah, very much so. The Renaissance is a direct descendant of the plague or a reaction to the plague as well. Because one of the things that happened during the plague is that a lot of the institutions also broke down. You know, the Catholic Church institutions broke down. The level of learning in the clergy went way down. And. And so you can understand how at the time of the Renaissance, people also, they'd forgotten the 12th century. I mean, they'd forgotten how glorious the 12th century was. And they were like, oh, no, this is it. Like, this is the Renaissance. We're being born out of this very, very dark time, which is mostly the Time of the plague, mostly the time of the late Middle Ages."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":858.61,"end":862.21,"speaker":"Vesper Stamper","text":"So are you saying that the Renaissance was sort of a short sighted?"}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":864.98,"end":866.54,"speaker":"Jonathan Pageau","text":"I think so, yeah."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":866.54,"end":871.62,"speaker":"Vesper Stamper","text":"So that like they were reading, reading darkness into the whole time before then that wasn't there?"}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":872.02,"end":934.67,"speaker":"Jonathan Pageau","text":"I think so. Well, I mean the whole idea of the real, real darkness of the time before was more, was, came later during the Enlightenment, you know, the term Dark Ages and all this type of terminology came in Enlightenment. But I think there was already some, some sense of that in the time of, in the time of the Renaissance, you know, because they were also unearthing all these things from the, from the ground. You know, they were taking out all these statues, they were kind of bringing up all this, this very old past and you know, and also they were breaking away from Constantinople. You can see in some of the writings of the Renaissance artists that they talk about moving away from the, from the like the Eastern way of painting, you know, that they were doing it deliberately. They wanted to move away from that type of painting. So there was a lot of things, there was definitely a lot of things going on. But like if you look at 12th century culture, it was so radiant. I mean it was really all the Gothic. I mean, is there anything more European than Gothic architecture? And that's all comes from the 12th century."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":934.75,"end":964.09,"speaker":"Vesper Stamper","text":"I mean, is there anything more like soaring for the human spirit? You know, even now to walk into Gothic cathedral and you feel your heart just rise to something so much higher than yourself, you know, even just like your eyes being drawn up, you know, and you know, what came after that was everything was, was an imitation of that basically until the Enlightenment and the, you know, and everything kind of."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":964.09,"end":998.8,"speaker":"Jonathan Pageau","text":"Yeah, there's definitely the neoclassical. The neoclassical move is really a, I hate to say it, but the neoclassical move was always a kind of a weird anti Christian move. Kind of desire to return to the pagans, return to the Greeks, return to the ancients and kind of forget all that happened, all the glory of the, you know, of the high Middle Ages, let's say, and the artistic accomplishments that were there. So that's, I'm definitely speaking, I'm not speaking objectively, I'm definitely speaking from my side of the artistic battle."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":999.36,"end":1041.16,"speaker":"Vesper Stamper","text":"Well, sure. And you know, I was actually thinking of you when I've been listening to the audiobook of Giorgio Vasari's Lies of the Artists, which I haven't touched since high school, you know, AP art history class. So it was good to kind of come back to that. And I was just really struck at his prejudice against iconography. Against, like, what you said, like the Eastern or the. What does he call it? The Greek. You know, not acknowledging that that was a horror whole, that the concerns of the Byzantine were a completely different set of concerns from the humanist, Renaissance concerns. Yeah, but he treated it instead as a primitive."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":1041.72,"end":1171.61,"speaker":"Jonathan Pageau","text":"Right. And I think. But it's interesting because in a way, we've reached the end, I guess, of this. We've kind of come. Even the modern period, like the 20th century period was already a breakdown of the Renaissance idea and already a breakdown of the ideals of the Renaissance. And so you can see in modern artists an inkling, let's say in someone like Kandinsky, you can see an inkling of trying to recover a different type of artistic language, a more algebraic language, a more typified language. And so I think that right now, most people have the capacity to understand what iconography is about. They're not as blinded as they were during the Baroque period, where it's like. I don't think they could have even imagined what this was about, what was this stupid art about. But at the same time, it acts as a weird. It's funny because it acts as a mythological backdrop for even the Renaissance in making the Middle Ages dark, and in making them kind of this dark past that we're moving out of, they ended up making it also a mythological backdrop out of which they ended up existing. You know, just like if you read. If you read Greek architecture, Greek myth and everything, they have this sense of this ancient time, you know, this time of the gods or the time, the time of the Titans, or the time before, out of which we are. We're not that, but we're still. It's kind of like our unconscious past that we're our imaginary times. Right. And so you have all the fairy tales, all the folk stories end up looking way more medieval in their structure. The king, the castle, the prince, the princess. All of this stuff is. Although it did continue into the modern age, it really does have a medieval, you know, medieval root. The dragon, the trolls, all the monsters, all of this stuff is definitely more medieval, and it's still there today. I mean, all of fantasy is really just treating the Middle Ages as a. As a dream, as a kind of mythological dream world."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":1172.17,"end":1180.21,"speaker":"Vesper Stamper","text":"Right, right. And I'm just coming to plug something here. First of all, the fact that you mentioned Kandinsky, who was also a synesthete. Very interesting."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":1180.21,"end":1185.05,"speaker":"Jonathan Pageau","text":"Oh, really? I didn't know he was a synesthete. Yeah, makes sense, because this whole thing is about."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":1185.59,"end":1233.09,"speaker":"Vesper Stamper","text":"Yeah. But, you know, if there's any. Anybody watching or listening to this now, who's a fantasy fan, I call a Cloud of Outrageous Blue Fantasy Adjacent. Okay, so it is historical fiction. Yeah, it's historical fiction for sure. But it does have this because it deals with perception and it deals with kind of magical thinking. And it's written in sort of a magical realist sense style. I think that, you know, people who enjoy fantasy will kind of like find a way into that. But so have you read. I think it's Katsuo Ishiguro. Is that. Am I saying his name right? The one who. The man who wrote. Is It Remains of the Day. Oh, my gosh. Anyway, he's gonna be."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":1233.09,"end":1233.93,"speaker":"Jonathan Pageau","text":"No, no, I didn't."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":1234.17,"end":1238.49,"speaker":"Vesper Stamper","text":"Well, he wrote a book that you should definitely read called the Buried Giant."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":1238.74,"end":1239.22,"speaker":"Jonathan Pageau","text":"Okay."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":1239.78,"end":1248.58,"speaker":"Vesper Stamper","text":"And it is written at the moment where I think it's probably supposed to take place in the year maybe 600."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":1248.98,"end":1249.54,"speaker":"Jonathan Pageau","text":"Okay."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":1249.94,"end":1316.5,"speaker":"Vesper Stamper","text":"And it's this kind of transitional point from when. From the. When the Saxons had come in and sort of, like, assimilated. Right. So you have like this conflict between the Saxons and the Britons. You know, the Britons B, R I T O N S. Yeah, yeah. And as, like, Britain culture is kind of dying out and Saxon culture is rising. Right. But the cool thing about it is at first you think you're reading a book of historical fiction, but then there's a dragon and these, like, mythical realities are just kind of taken as commonplace and they. They go to find this buried giant, you know, and so the book really becomes, like, about the death of the old world and like the death of dream time, the death of that time before and the emergence of, like, what then is modern. Modern world. Right."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":1317.55,"end":1358.01,"speaker":"Jonathan Pageau","text":"What's the right time to deal with it? Deal with it. Because in the way that I talk about the Middle Ages is also the way that the Celtic past, what it plays for the Saxon invasion because in the end, your king is still going to be King Arthur. You know, hundreds and hundreds of years later, your king is still King Arthur. He's still. He's still a Celt. None. No. Despite the. Or he's still from that world. So there's a. Sometimes an idea that he's Roman, I don't know about that. He's like that he's a Roman, but in that time. And so despite the fact that you push that aside, you push it into the margins, it still remains there as your kind of mythical past."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":1358.41,"end":1385.89,"speaker":"Vesper Stamper","text":"Yeah, yeah. And the Buried Giant is actually a post Arthurian legend. So it has characters, you know, some of the knights, the Arthurian knights who are like, who are elderly now and they're dying out, you know, and it's set among this backdrop of like where there's still Roman villas around. Right. But they're, they're ruined, they're crumbling. It's fascinating. You would really love this book. It's. I think it's right up your alley."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":1385.89,"end":1396.68,"speaker":"Jonathan Pageau","text":"The 6th century really is one of, for me one of the most fascinating moments, you know, when I, when I think of a period of time that I wish I could have visited, that's really, that's when."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":1396.68,"end":1396.96,"speaker":"Vesper Stamper","text":"Yeah."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":1396.96,"end":1397.32,"speaker":"Jonathan Pageau","text":"You know."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":1397.4,"end":1482.57,"speaker":"Vesper Stamper","text":"Yeah, yeah. I think sometime in the future I'm going to wind up writing, I think that A Cloud of Outrageous Blue. I have in mind that it would be part of a trilogy with a modern day version and then going all the way back to either that, you know, six hundreds time or maybe to like 600 B.C. you know, like pre Roman Britain or maybe Roman Britain, I don't know. But I just, I think that what strikes me about all of this, like I get to England whenever I can. It's my happy place and when I'm there I feel the memory of the land, you know. And part of what interested me about writing about this time period, when it was going to be this other book, was when you go to a place of worship in England, you quickly discover that it, it's always been a worship site. You know, before it was a Christian worship site, it was a pagan worship site. You know, you'll have these healing wells, you know, these holy wells where not just, you know, a saint is associated with it, but then like a pagan figure is associated with it as well, you know, so they did a good."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":1482.57,"end":1505.25,"speaker":"Jonathan Pageau","text":"Job at integrating their path, but the Romans and the Greeks did too, but then they just imposed it on everybody else. Like the Romans also did a really good job at integrating their path and then they tried to impose it on. Yeah, try to impose it on England, which is really insane. It's so far and so removed. It's like, why are you trying to impose this weird Roman thing on us? I don't know."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":1505.85,"end":1607.11,"speaker":"Vesper Stamper","text":"Yeah, yeah, totally. So I'm interested to know more of your thoughts on. Okay, so if we look at the plague as sort of like the birth of the modern world and then this backdrop of, you know, what they labeled as the Dark Ages, you know, the time before. And then, I mean, gosh, you can just trace a straight, a completely straight line from plague to Renaissance to enlightenment to, you know, 20th century, even 20th century genocide, you know, history, the industrial revolution, scientific revolution and all of that. Right. Even the birth of modern medicine from the plague. You know, are you familiar with Guy de Chauliac? So he was, I think the Pope's physician in Avignon and he contracted the plague and he experimented on himself to try to find, you know, remedies for it, obviously using like, you know, Galen's poor, humorous, you know, humoric method. But he, he, he survived. Right. And the whole time he documented his experiments. Right. I mean that's the birth of modern medicine in my opinion. You know, that like application of experiment and scientific method. Right. So with all that being said, with that straight line being traced, do you think that we are like in another cycle of that and where on that cycle do you think we are? Like you mentioned that in Chicago, like this is playing out exactly how you."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":1607.99,"end":1651.23,"speaker":"Jonathan Pageau","text":"Well, no, I just said when I talked about Chicago, it's just because I saw an article about seeing some seeing. Because until now we've seen the protests and the, we've seen the riots and then I, there was also some articles about, you know, young men with baseball bats just hanging out, trying to, wanting to stop people from coming into their neighborhoods. So I was like, if that stuff starts to happen, which seems inevitable at this point, then it's just going to become, like you said, it's going to become a low key civil war at first. And then when the military, the national guard, the police feel forced to take sides, then it's going to get really messy."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":1651.79,"end":1652.59,"speaker":"Vesper Stamper","text":"So messy."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":1653.15,"end":1720.12,"speaker":"Jonathan Pageau","text":"So it's a very different situation in that sense. It's different from at the time of the plague. In the time of the plague, you really, I mean, because of the plague and because of the social chaos, then all of a sudden the serfs had flexibility and they also, because so many people died, then the value of their work went up dramatically. And so it's one of the times in the ancient times when the lower class had the most money because they were so much in demand. All the nobles were looking for serfs to work on their land. And so they tried to keep them on the land because the serfs were bound to the land, but they just couldn't because it was like, yeah, what are you gonna do? You know, it's like the world is empty of people. So it's interesting because it's actually, I talked about this in a recent video. We tend to think that revolts happen when people are desperate. And that is actually, I don't think that's Actually, totally true. I think revolts happen actually when people are a little better off."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":1721.29,"end":1721.61,"speaker":"Vesper Stamper","text":"Yeah."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":1722.89,"end":1725.93,"speaker":"Jonathan Pageau","text":"They have room to maneuver and so."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":1726.81,"end":1727.61,"speaker":"Vesper Stamper","text":"Yeah, sorry."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":1727.85,"end":1740.65,"speaker":"Jonathan Pageau","text":"So after the plague, the peasants had more power than they had had in the last few centuries, and that's what gave them the possibility to revolt, at least in that situation."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":1741.13,"end":1763.55,"speaker":"Vesper Stamper","text":"Right. Because you have 40 years between the plague and the peasants revolt. 35 years, maybe. So it's not in the middle of the plague where everybody's dropping dead. That's just the fear part. That's the crisis moment. But then when you have some ability to reflect, then comes in the revolt."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":1763.71,"end":1796.36,"speaker":"Jonathan Pageau","text":"Yeah. And also it was also economic because they did have the possibility. All of a sudden they weren't bound anymore. The nobles didn't have the capacity to. To kind of hold them to their land. And so they had freedom movement. They were making more money. There was a lot of land, like just available land. You could just take land and do stuff. And so then they didn't want to. They just didn't. They wanted to have their own thing. They didn't want to submit to the nobles anymore, so. Which is totally understandable. You know, you can also see why that would happen."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":1797.08,"end":1854.06,"speaker":"Vesper Stamper","text":"Yeah, yeah. And I mean, this is. That's. This is a whole other tangent, but, like, you know, I kind of think. I mean, with my limited knowledge, I'm not a historian, I'm just a historical fiction writer, but it seems to me like that's the birth of the individual in Western culture, you know, when. Well, yeah, well, the revolt. Yeah, the revolts, like when the serf becomes untied to the community, like to the communal structure, and can branch off on his own, you know, go like, seek his fortune in the. In the kind of, you know, in that sense, fairy tale sense. Right. But then you have like almost a theology of the individual that kind of emerges into the modern world. Right. And the concept of individual rights, or like bargaining for your labor, for your wage, you know, capitalism, maybe."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":1854.54,"end":1866.89,"speaker":"Jonathan Pageau","text":"It's interesting to think about. Um. Yeah, yeah, we have to think about it more. It's possible that it's. There's definitely something happening in the late Middle Ages which seem to be sparking some of that, you know."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":1867.21,"end":1879.93,"speaker":"Vesper Stamper","text":"Yeah, yeah. I'm not saying it emerged out of nowhere, but just that the conditions were right for that to kind of come to fruition. Yeah, yeah, yeah."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":1882.1,"end":1904.54,"speaker":"Jonathan Pageau","text":"But it's. It's weird to compare the two to the two now because it's. Everything now is happening in real time and it's so compressed and is so Accentuated. Because on the one hand, the. Let's say, the disease we had, it has nothing to do with the plague. I don't care what people say. People did die, but there's nothing compared to what was happening in the plague."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":1904.54,"end":1905.3,"speaker":"Vesper Stamper","text":"Every other person."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":1905.38,"end":1957.63,"speaker":"Jonathan Pageau","text":"Right, Exactly. It's not. It's. It's not, you know, even, you know, it's 1% of the population. It's not 30% or 50% of the population. And so that is true. And then the level of inequality is also nothing to do with socioeconomic inequality than what we would have seen in the Middle Ages. And so, on the one hand, everything is very. Nothing is as intense, but it just seems very intense because of our media apparatuses and our social media apparatuses. And, you know, I had to. Like, I. Yesterday, I'm like, I need to get off Twitter because it was gonna drive me crazy because it was gonna completely drive me insane. It was pulling me feels. It feels like I was being pulled in all these different directions, getting angry for both sides, getting angry this side, that side, and then thinking, okay, no, I need to stop, or else I'm just gonna. I'm gonna lose my mind."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":1958.99,"end":2010.47,"speaker":"Vesper Stamper","text":"Yeah, I dumped my Twitter at the new year. Yeah. And it was. Honestly, it was the best thing that I could have done for my mental health. I cannot imagine with the stresses that are on everybody right now, if I were on Twitter, I might have a breakdown. I mean, it's already. I've had. So I've had a series of dreams during this whole thing. I had a dream before the pandemic about the pandemic directly. I mean, it had to do with waves and, you know, the elderly and, I mean, everything. It was just like clockwork. And I've been watching it play out exactly like my dream. But I've. You know, I've also."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":2010.55,"end":2013.27,"speaker":"Jonathan Pageau","text":"How did your dream finish, Vesper? How did it finish?"}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":2014.39,"end":2016.63,"speaker":"Vesper Stamper","text":"Want me to tell you? I'll tell you the dream. It's pretty short."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":2016.63,"end":2018.39,"speaker":"Jonathan Pageau","text":"Go for it, because we need a profit right now."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":2018.77,"end":2108.46,"speaker":"Vesper Stamper","text":"Okay, well. Okay, So I was sitting on a back patio, which doesn't exist. It's my. My dream house, my fictional house, right. Sitting on a back patio. And I noticed this window box, and it's full of these spring flowers, like huge azaleas and daffodils and stuff. And I. I thought it was the middle of winter, but all of a sudden, it's spring, and it's this abundance of spring. So I go and I stick my face in the flowers, and I'm like, oh, it's amazing. Spring is emerging. It's. It's so incredible. And then I go and take a seat on the patio and I notice that next to my house, or a little beyond my house is a river that I never knew was there before. But oh, how interesting. There's a river. And I noticed the river starting to rise and I thought, oh gosh, I think it's going to flood. Instead of flooding, it turns into a tidal wave and it crashes over the patio. And it's salt water from a river and it's bitter, you know, but it doesn't ever get into the house. It tumbles the patio furniture around. You know, my mother and father in law were there with me. We kind of got knocked off our feet a little bit, but then it receded. We picked up the furniture again and I looked over and I noticed that those flowers that had been so abundant there a minute before were completely gone, as if they had never existed. Right. No sooner did we kind of dust ourselves off than a second wave comes."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":2108.54,"end":2109.02,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":2109.42,"end":2142.44,"speaker":"Vesper Stamper","text":"And this wave was not as severe as the first one, but it still, it came. It, you know, flooded the patio. And this time it did get a little bit into the kitchen where my father in law was cooking something. And then I woke up and I told my husband about it at the time and I said, what do you think this means? Because we really do believe in dreams and we've been, we've made major life decisions based on dreams we've had and it's been the right thing kind of when, you know, it's that kind of dream, you know."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":2142.44,"end":2142.84,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":2142.92,"end":2207.34,"speaker":"Vesper Stamper","text":"And he had some thoughts about it for himself. And I thought, I don't think that's really what it means. But I kind of put it down for a little while and right when lockdown happened. So I think that was in January sometime that I had that dream. And March, you know, 12th or 13th comes around the lockdown starts and my kids go to, are out of school and I'm standing there doing the dishes and I thought of that scripture that says that the Lord doesn't do anything without telling his prophets, something like that, you know, And I, I just kind of prayed. I was like, God, why didn't you tell anybody that this was going to happen? And he goes, I gave you a dream. Remember that dream I gave you? That was that, you know. So I was like, oh, okay. And I haven't gone around like trumpeting it or anything like that, but it's been very instructive to me to kind of Keep me calm and level, you know, to say, okay, well, this is what I can expect. And so far, it's played out exactly like that. You know, I think the spring flowers had to do with the economy."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":2209.83,"end":2209.95,"speaker":"Jonathan Pageau","text":"You."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":2209.95,"end":2233.27,"speaker":"Vesper Stamper","text":"Know, things like that. Anyway, so. But at the same time that I've been feeling this sense of calm and, you know, things playing out as they're going to play out, I found myself with like an enormous amount of anxiety. And I don't suffer from anxiety or depression, but I've had a couple of anxiety attacks in the stores, some of it related to wearing the mask."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":2233.91,"end":2234.95,"speaker":"Jonathan Pageau","text":"Yeah. You can't breathe."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":2235.65,"end":2239.45,"speaker":"Vesper Stamper","text":"Yeah. Not only that, but you can't see people's expressions, right?"}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":2239.45,"end":2239.89,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":2240.13,"end":2242.45,"speaker":"Vesper Stamper","text":"And that's. That is just deeply anti. Human."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":2243.17,"end":2243.73,"speaker":"Jonathan Pageau","text":"Oh, yeah."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":2243.73,"end":2259.17,"speaker":"Vesper Stamper","text":"You know, to not be able to see anybody's expression or read their demeanor, that's. That's very deeply like wounding to the psyche of the populace. You know what I mean? So anyway."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":2260.45,"end":2267.17,"speaker":"Jonathan Pageau","text":"Yeah. So for the people who are watching, maybe we can decode some of the elements of your dream so that they can understand it."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":2267.49,"end":2269.97,"speaker":"Vesper Stamper","text":"Please. Yes. Give me a symbolic interpretation of this."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":2271.25,"end":2340.47,"speaker":"Jonathan Pageau","text":"Well, right, so you're. You're. You're sorry. The first thing is, of course, the. The idea of the. Of the water, you know, and it's important that the water is salty because the salty water is different from fresh water. And so you have this river next to your house, but it ends up being. Ends up being salty, bitter, like you said. And so bitter waters in the Bible is exactly that. It's the waters of chaos. It's the waters that you can't use, really. That's why it's the. Sometimes I tell people, salt water, it's an image of chaos. It's not arbitrary. It's. It's the image of chaos because you can't drink it. It's not. It's not. It's not. It's not palatable for the human person. Right. It's so. It's just this chaos. And so the. Obviously the wave coming in. It's interesting that. So then your house ended up playing the role of a little arc, which is. Which makes. Which makes sense because that's what a house is. And in a way, that's what the ark was as well. It was like the preservation of square possibility. Right. Of structure within a kind of uprising. Chaos."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":2341.11,"end":2341.51,"speaker":"Vesper Stamper","text":"Right."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":2342.19,"end":2351.39,"speaker":"Jonathan Pageau","text":"And so the fact that the wave didn't get in, it's a very good sign, you know, like you said. So it destroyed the fruits, but it didn't destroy the Structure."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":2352.03,"end":2359.39,"speaker":"Vesper Stamper","text":"Exactly. And let me just interject here for a second. The only thing that it did affect were the temporary structures."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":2359.47,"end":2359.83,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":2359.83,"end":2365.31,"speaker":"Vesper Stamper","text":"The patio. The patio furniture, which isn't even real furniture. Right."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":2365.95,"end":2457.82,"speaker":"Jonathan Pageau","text":"It's also the. The idea of a patio or. The idea of a patio or a porch or something like that is really. Is this notion of. It's kind of like the extension of structure into the outside, but it's a marginal extension. Right. It's kind of the effect of the structure, but it's not the house. It's not where you don't go there to be safe. You kind of extend yourself out into the natural world. And so the idea of the. Of the flowers and of the patio, it has to do with the fruits of the structure. So it's good to see that. It's good to think because I also. I have the same feeling of when the pandemic hit. I had the same feeling because at first I thought I was getting ready. I thought, okay, this is going to be massive. I'm going to lose my commissions. People are going to stop supporting me on Patreon. We're going to lose. Basically, I was expecting my revenue to massively go down because of the pandemic, and then it didn't. And I was like, okay, interesting. I mean, obviously some people who probably struggle financially kind of went away and some people put off their commissions for later. But, you know, it didn't end up having a massive effect on the, like, the basic frame of my life. But for sure, in terms of. In terms of the fruits of civilization, that's for sure, that it definitely is having a major effect. And it. It had a major effect on people's mental health, that is for certain."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":2457.82,"end":2458.54,"speaker":"Vesper Stamper","text":"Yes. Yes."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":2458.54,"end":2485.07,"speaker":"Jonathan Pageau","text":"I mean, I've seen. I've been really surprised in the past few weeks to. Around me to encounter suicides. Suicide of people, friends, like a lot of suicide, either directly or in people who know other people. And also people. Mental breakdowns. Like real mental people who just go crazy and leave for three days and live in their car because. Can't deal with it. A lot of that stuff going on."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":2485.31,"end":2538.26,"speaker":"Vesper Stamper","text":"Yeah, yeah. I mean, I've. Like I said, I don't struggle with mental illness, thank God, but I've felt myself fraying at the edges. And one of the anxiety attacks that I had was. I was in Target, you know, And I'm walking around thinking to myself, people are. You could feel it palpably. Like, people were so on the edge mentally that I thought it's really surprising that somebody hasn't cracked by now and that there haven't been like several mass shootings. Well, this was three days before the riots started. So, yeah, call that prescient or call that, you know, reading the writing on the wall of what was. What was happening. But, yeah, I mean, I know a few people who had expressed that they were having suicidal thoughts and these weren't. It wasn't because they had lost jobs."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":2538.74,"end":2569.22,"speaker":"Jonathan Pageau","text":"No, it's more than that. It's. It's more of a. Kind of a weird breakdown of everything. And the social isolation. Yeah, it's more. Like you said, it's more than just economic. It actually has to do with the very, like the fear and the very idea of self isolating and, you know, I mean, we started now seeing some friends just in the past few weeks and. Oh, my goodness. I mean, that's when you realize just how much you need to be with people. Like."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":2569.22,"end":2569.7,"speaker":"Vesper Stamper","text":"Yeah."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":2569.7,"end":2579.54,"speaker":"Jonathan Pageau","text":"You know, because when you're. You're just living your life and you see friends and you live your life, you go to church, you do this, you don't realize just how much you need it in order to stay sane. But when it goes away, then."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":2580.58,"end":2580.9,"speaker":"Vesper Stamper","text":"Yeah."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":2581.22,"end":2582.1,"speaker":"Jonathan Pageau","text":"Feel the difference."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":2582.34,"end":2662.51,"speaker":"Vesper Stamper","text":"Yeah. And I was thinking about you too, because I'm reading the book Sacred Pathways by Gary Thomas, and he talks about, you know, different people having different spiritual personalities, let's say. Right. So you have the naturalist who really finds God in nature and, you know, whatever, and. And the traditionalist who finds God through the, you know, the smells and bells, let's say. And then somebody like me who's more of a sensate, you know, I really encounter God through the tangible making of things and. But also a little bit of a traditionalist in that sense. So I was thinking about you at one point during the quarantine in thinking about church, and we haven't really been able to, like, we moved to where we live now, like, three years ago, and we haven't been able to settle into a church. And one of them that we did visit was an Orthodox church in my area. And so I was wondering, like, without, like, it is so communal, the orthodox experience, and so sensory that if that were my normal expression, I'd really just be hurting for that right now. So I was wondering, like, how. How are you functioning in your church community without. Do you have. How do you do online church?"}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":2662.51,"end":2662.99,"speaker":"Jonathan Pageau","text":"Oh, yeah."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":2662.99,"end":2663.89,"speaker":"Vesper Stamper","text":"With Orthodox words."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":2664.28,"end":2665.32,"speaker":"Jonathan Pageau","text":"Yeah, they do, they do."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":2666.2,"end":2667.16,"speaker":"Vesper Stamper","text":"How are they doing that?"}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":2667.72,"end":2727.75,"speaker":"Jonathan Pageau","text":"I was really, I was really involved during the time just before Easter, like during Holy Week and leading up to Easter, I was very, very involved, but it's just very difficult. Oh, I just find it very difficult and. And alienating. And so, to be honest, I've gone to a few services since. Since Pascha, but not a lot because it's just so. And we're not taking communion. And so it's just very odd. The whole thing is very odd. And so I really hope this is going to end soon. But just like in the US I guess here in Quebec, religious services are way down on the line of priority. They don't consider them important at all. So I don't know how it's going to. And everybody's trying to be a good Christian and obey their law and to be, you know, to be respectful of the authorities, but it's pushing the limits. So we'll see how it plays out. We haven't yet. Nothing has. We haven't had been having services at all."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":2728.55,"end":2729.67,"speaker":"Vesper Stamper","text":"Even online or."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":2729.75,"end":2732.79,"speaker":"Jonathan Pageau","text":"Yeah, they have online services, but it's like. What exactly is that?"}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":2732.87,"end":2747.63,"speaker":"Vesper Stamper","text":"No. Yeah. Without the communal aspect of it, then it's. It's just. No, it doesn't make sense. I wonder, do you think that at some point people are going to start having clandestine masses? Masses?"}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":2747.63,"end":2750.79,"speaker":"Jonathan Pageau","text":"I think they probably already are, but just maybe. No one has told me."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":2751.11,"end":2751.67,"speaker":"Vesper Stamper","text":"Okay."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":2752.63,"end":2756.15,"speaker":"Jonathan Pageau","text":"I'm sure the clergy are. We know. With people that are very, very close to them."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":2756.47,"end":2756.95,"speaker":"Vesper Stamper","text":"Yeah."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":2757.11,"end":2763.51,"speaker":"Jonathan Pageau","text":"And so I just haven't necessarily been in the loop maybe, and it might. Might be a little far from where I am, even if there is. So."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":2765.11,"end":2784.16,"speaker":"Vesper Stamper","text":"So getting back to sort of the. The symbolic nature of all this, Right. Like if you. If you deconstruct the church gathering right through the communal gathering, the ability to be together, what do you think that does to us?"}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":2784.48,"end":2852,"speaker":"Jonathan Pageau","text":"Well, it does. What's going on right now. It does exactly that. So one of the things that happened, you know, is that the quarantines took away all the places where people were able to one come together, because let's say we took away churches, but those that aren't religious, they still had things like restaurants, they still had things like coffee shops or sports as well, where it's a place of identity and communion. And so they took away that, then they took away also. The sports is important. I know that people will think it's secondary, but for me, I don't care about sports. I'm not interested in sports. But for most, for a lot of people, sports are a place to fuel your aggressive tendencies. So you put in your aggression into your team and your team defeating other Teams, then therefore it sublimates your aggression. And it's been like this forever. That's in a part with the gladiators before they were trying to sublimate your, your aggression. And so."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":2852,"end":2853.76,"speaker":"Vesper Stamper","text":"And that's to express a catharsis."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":2853.84,"end":2933.48,"speaker":"Jonathan Pageau","text":"Yes, it's a communal catharsis of violence. Right. Is really what it ends up being. And you can criticize this all you want, but if you take it away, then you end up with what we've got now. And so you end up with a pseudo religious actions where people are using all religious tropes, tropes of scapegoating, tropes of catharsis, tropes of violence, of contrition. All the tropes that you find in religion are now the only place where it is permitted. Yes, this is crazy. The only place where it is permitted is in these protests. And so all over the United States you have the situation where the authorities are telling people you still need to self isolate, you still, you can't go to church, you can't go to restaurants, you can't do all, any of this. But, but you can protest and you should almost like you should go to these things. So it's almost. I hate being looking like a conspiracy theorist, but it looks like all of people's, all of people's religious drive is being fueled into this thing. And then people are going along with it because they need to vent that part of themselves."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":2933.96,"end":3129.3,"speaker":"Vesper Stamper","text":"And I don't think that that sounds conspiratorial at all. I think that's natural human tendency to want to fill any vacuum. Right. The politicians want to fill the power vacuum. You know, like you're saying people want to fill the religious vacuum. So I went to a protest in New York last week to stand with some friends and it was my first time out of my town in four months. But I'm a native New Yorker, you know, so going back to my city was really meaningful to me, but I also felt kind of alienated from it. So. And I haven't spoken about this publicly because I am in a posture of listening right now. I'm not. Well, one thing's for sure, I'm not going to say other people's words. I'm not going to say other people's words until I fully understand them. And then at such point, if I feel that they're my words too, then I will say them. But I'm. Anyway, I'll get there. So I caught up with, you know, walked into the area where the protest was happening and this was a rally that was going to turn into a march. And it was peaceful. It was not. There's no rioting. However, riots had just happened the night before. So I walk into the crowd, I enter the crowd, and immediately I was struck with the sense that I was in this kind of movie type caricature of a Catholic mass. And I. I couldn't. There was no. There's. In Foley Square where this rally was taking place, there is a monument. And I thought, okay, surely somebody must be up there on the monument kind of directing this. Right. But I couldn't hear any. There was no PA system or anything like that. It seemed to be completely decentralized. But out of the crowd would suddenly erupt this chant, you know, no justice, no peace, or F Trump or whatever it was, you know, and. But it was like, plug it in, say the phrase unplug. It was eerie. It was very creepy, actually. And then the next cue was everyone's fists went up. Unplug. It's over. The next cue was everybody kneeled. And I thought, this is. We are just. This is a religion. This is totally enacting a religious right. And just like, if you're a cradle Catholic or whatever, and you don't even need. You don't even need to be fully conscious of what the priest is saying. You just intuitively know when to sit, stand and kneel, when to say the Our Father, when to. You know, that's what this was like. And what really struck me, Jonathan, was that this rally in particular was, I would say, in the end, 85% white people. And I. I don't know what to make of that."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":3133.06,"end":3136.34,"speaker":"Jonathan Pageau","text":"You don't know what to make of the fact that this is happening?"}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":3137.14,"end":3141.54,"speaker":"Vesper Stamper","text":"No, that it's. That it is. It seems to me, to be driven by white people."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":3141.94,"end":3142.42,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":3143.23,"end":3193.17,"speaker":"Vesper Stamper","text":"At least in my. In my experience. Yeah. And that's brought up questions for me of allyship, like the definition of ally and the meaning, really the meaning of the word ally. I've been trying to sit with that and deconstruct it. And it seems to me that an ally is somebody who's across. Is on the other side of a border from you. Right. Is across the ocean from you, who you. You make a mutual agreement to come to each other's defense. Right. That's not a friend, though. Like, that's not an intimate relationship, you know, And I think that the term of ally has come to stand in for like a. An. Like a believed intimacy that isn't really there, you know what I'm saying?"}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":3195.95,"end":3246.7,"speaker":"Jonathan Pageau","text":"Well, one of the, it's one of the problems. Is one of the problems that they, that the people in that protest, like these 85% white people, the problem that they have is that they have to enact their, their, their narrative. They have to enact it. And let's say the. So the, let's say the upper class. The upper class liberal white person, they have embraced the emancipatory narrative, right? Because that's our narrative. Like the emancipatory narrative of the French Revolution. Of the Revolution. The revolution idea. The idea of the underdog coming up and rising up and removing the people above them."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":3246.86,"end":3247.26,"speaker":"Vesper Stamper","text":"Okay."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":3247.82,"end":3254.5,"speaker":"Jonathan Pageau","text":"And so this is not just. It's not just a racial thing right now. It's happening with a racial overtone, but it's not."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":3254.5,"end":3254.86,"speaker":"Vesper Stamper","text":"It was."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":3255.58,"end":3273.54,"speaker":"Jonathan Pageau","text":"It's feminism. It's basically like a kind of communist ideal, let's say, of the lower classes coming up and taking. And taking power. And so they have fully accepted that narrative, yet they're the rich, they're the elites."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":3273.86,"end":3274.26,"speaker":"Vesper Stamper","text":"Okay."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":3274.26,"end":3276.58,"speaker":"Jonathan Pageau","text":"I'm gonna say, how do they enact their narrative?"}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":3276.82,"end":3278.26,"speaker":"Vesper Stamper","text":"They end up having a little."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":3278.66,"end":3281.14,"speaker":"Jonathan Pageau","text":"They have to flagellate. They have to self. Flagellate."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":3281.3,"end":3281.78,"speaker":"Vesper Stamper","text":"Yes."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":3282.74,"end":3286.66,"speaker":"Jonathan Pageau","text":"It's the only way for their narrative to actually, to actually make sense."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":3286.98,"end":3287.38,"speaker":"Vesper Stamper","text":"Right."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":3288.18,"end":3303.3,"speaker":"Jonathan Pageau","text":"Either they give up their power, which they're not going to do, or they just flagellate in public in order to signal that they agree with this narrative, but that they're not going to give their houses to a black family. Like, that's not gonna happen."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":3303.88,"end":3422.02,"speaker":"Vesper Stamper","text":"Right? Or. Okay, I'll get there. So. Growing up in New York is a very, very, very different experience than transplanting to New York from the Midwest. And I'm gonna. I'm gonna make people angry by saying this, okay? But this is what I do. There. There's. There's a certain type of person who moves to New York whose, Whose daddy pays full tuition to NYU or whatever school, Columbia. A certain type of person who comes from the suburbs and deeply resents their conservative upbringing or what have you, or feels deeply guilty that their parents were both doctors or something like that, comes to New York to try to kind of shed all of that and like, live this kind of authentic experience. You know what I mean? And I've been encountering more and more people like that over the years, and I find it deeply alienating. I. Because what they don't understand that they're doing is pushing out communities that have been there for generations. Some of those communities, you know, that I grew up in and Convincing themselves that they are allies or speaking for people who they may have met somebody from that community when they're for the first time, when they're 25. And so the thought that people would do this and enact not just, I'm not going to give up my house for a black person, but I'm actually going to take a brick and put it through the window of a black business and think that I'm doing good for the community."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":3422.58,"end":3447.4,"speaker":"Jonathan Pageau","text":"If you want to know why Twitter was driving me crazy, it was watching those punk antifa kids destroying that community. It just made me so angry. I was like, so. So that's one of the reasons why Twitter was driving me crazy, was to watch that happen and to think, like. And you're doing that in the name of, like, what the hell, you're insane."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":3447.96,"end":3465.46,"speaker":"Vesper Stamper","text":"Right, right. And so. And so isn't that, in a sense, what an ally would do in the. Like. Let's take it from a military perspective. Right? An ally would come and drop bombs in a country that they may be trying to liberate."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":3465.54,"end":3474.02,"speaker":"Jonathan Pageau","text":"Yeah, yeah, yeah, yeah, right. That's. That's a good analogy. That's what the US has done in the Middle east, you know, to liberate countries. They destroy them."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":3474.34,"end":3474.62,"speaker":"Vesper Stamper","text":"Right."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":3474.62,"end":3476.34,"speaker":"Jonathan Pageau","text":"I mean, look at Syria. My goodness."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":3476.66,"end":3477.22,"speaker":"Vesper Stamper","text":"Yeah."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":3477.22,"end":3513.98,"speaker":"Jonathan Pageau","text":"Damascus is. Has been completely leveled. So. Yeah. No, I agree. I agree with your analysis. And I. But it's. There's a blindness because it's ideological. The thing about. That's the problem with the thing about the problem with symbolism. And it's the problem with. Also with the way that I think is that when you're dealing with symbolism, we're dealing with categories which coagulate. Right. So you have characteristics which coagulate into categories, and you notice them, but you have to also be careful of its effects."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":3514.14,"end":3514.62,"speaker":"Vesper Stamper","text":"Yes."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":3514.86,"end":3564.98,"speaker":"Jonathan Pageau","text":"Because what happens in. When you idealize these idea, it's like, I'm an ally of black people, but that there are no. There is no black people. You only encounter actual individuals. You only encounter individuals. There is no. Like, you can't encounter the category. You only encounter people. And so when people get attached, it's like, you know, it's like that idea of the. Of the common man or the working man. There's an amazing. One of my favorite scenes in movies is in the Coen's Brother movie. What's the name of the Barton Fink, where Barton Fink is, like, is a writer who writes plays about the common man. And he's talking to, like, a salesman and he's telling him about the common man and the dream. The common man, the salesman's like, oh, yeah, I could tell you some stories. And he's like, yeah, yeah, yeah, yeah, yeah, yeah, yeah."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":3564.98,"end":3572.81,"speaker":"Vesper Stamper","text":"No, no, no. Yeah. And this is exactly what's happening with narratives about the working class, right?"}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":3574.09,"end":3581.77,"speaker":"Jonathan Pageau","text":"Yeah, yeah. It's always hilarious because a lot of the rich elite types, they would hate the working class."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":3582.09,"end":3583.45,"speaker":"Vesper Stamper","text":"They do hate the working class."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":3583.45,"end":3606.9,"speaker":"Jonathan Pageau","text":"Of course they do. Because the problem with the working class, a lot of the working class guys are just regular guys. They'll say things which don't at all politically correct all the time. And so on the one hand you want to defend them, but if you actually met someone who's like that, you would, you would see only their faults because of your pristine political correct frame. So how do you deal with that?"}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":3607.3,"end":3624.42,"speaker":"Vesper Stamper","text":"Right. And the working class is not just people of color and the working class is not just white people. It's everybody. It's most people. Most people are working class. Yeah. It's just so disconnected from reality."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":3624.58,"end":3674.11,"speaker":"Jonathan Pageau","text":"Yeah, for sure. That's definitely one of the reasons why we're seeing it happen. But I think understanding this can really help you understand why it has to be, it has to be symbolizing religious patterns and use as you know, that people will act out these things. It's the same thing. Like, I hate to say it, but it's the same thing with recycling. Like, recycling has also taken on a religious overtone because all these people who are living like kings and queens, which it's like, I'm not even going to criticize that. But then at the same time, they think that we're destroying the environment. So how do you do it? How do you do it? Well, you need to have a way to, to atone for your sins. And so you have to recycle. Like, if you don't recycle, then you're evil. Because I. It's not that I'm evil, it's those that don't recycle that are evil."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":3675.39,"end":3675.79,"speaker":"Vesper Stamper","text":"Yeah."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":3675.79,"end":3691.55,"speaker":"Jonathan Pageau","text":"So. But then it doesn't make. Does it really make a difference? Like here in Quebec, I have one of my family members, he's really into in construction and works in that world. And he says, you know, half those recycle recycling trucks, they just go to the dump."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":3691.55,"end":3692.23,"speaker":"Vesper Stamper","text":"They go to the dump?"}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":3692.23,"end":3700.75,"speaker":"Jonathan Pageau","text":"Yeah, they just go straight to the dump. And so it ends up being just a kind of gesture of atonement. Anyways."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":3702.43,"end":3759.2,"speaker":"Vesper Stamper","text":"So speaking of performance art, what my friend Stephen Roach says that, you know, you know that liturgy is performance art, you know, that we are. It's. It's deeply important that we reenact, you know, these things. Well, it matters what you reenact, I suppose, but. So what do you think? Okay. Because I just started this podcast about artistic thinking, and I'm trying to give people an alternative to the political worldview, kind of similar to what you're doing in terms of the symbolic world. But I want to help people to get in touch with their own critical thinking capacities. Right. As coming specifically from the point of view of an artist. So as a fellow artist, what do you think that we have to offer in this moment?"}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":3761.87,"end":3899.56,"speaker":"Jonathan Pageau","text":"Well, the best things I think that artists have to offer is that their capacity to understand that the world needs image and narrative. Like that the world manifests itself through image and story, and we understand that because we experience it. Because when you're trying to draw something, you have to make decisions about what you're going to leave out and what you're going to put in. Because the world is too big, too complicated. And it's the same with a story. When you're telling a story, you know that there is no neutrality in our perception, that our perception is qualified by narrative and image. You have to, you have to decide which elements, which events are you going to choose to put together in order to tell a story. And so I think that because of that, if we are aware of it, we have a. We're almost like magicians. We have a magical power. And if we understand it, then we can probably use our magical power for good and also understand that it's not arbitrary and it does matter. The stories we tell do matter. And so, you know, a lot of, you know, because you can be a magician, you can also, you can tell twisted stories to gain very, very pointed attention because it works. Right. Just like passions are very pointed and will get your attention, then stories that are extremely pointed and twisted will also get attention. But I think that as artists who want to kind of be part of a healing process or help the world return to Logos or return to the idea of God and creation meeting somehow, then we have to be attentive to the story we tell. And we can tell. We can change the world with our stories. Yeah, you know, like I keep telling people about. No, let's say we, as 20th century Christians, let's say we have, we have Tolkien and Lord of the Rings. And what's interesting about him is that his story is the imagination, structure, imaginal structure of our, of the modern world. It's the Lord of the Rings."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":3899.96,"end":3900.44,"speaker":"Vesper Stamper","text":"Yeah."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":3900.6,"end":3974.71,"speaker":"Jonathan Pageau","text":"All the video games, all the comic books, all the fantasy novels, all of this, all Harry Potter, all of it could not exist without the pattern that Tolkien gave the 20th century. And so he told the story that was so big that it sunk. And one of the ways, you know, that it's, it's that powerful is that elites don't like it. The elites really don't like Lord of the Rings. They think it's a, it's badly written, you know, that it's kind of amateurish or whatever. And that's even better. It's like, yeah, yeah, yeah. Just like they thought scripture was written in bad Greek, you know, it's like, that's fine, that's fine. That's. Those that are able to connect the highest stories with the lowest, let's say manifestations, they're the ones who win in the end because they sink into the pattern of reality. And so I think that that's what the power we have. We really have that power. And we can see in the 20th century those that had used that power, I would say, for evil or to twist and to make the problem worse. But there are also a few shining examples of people that are participating in the healing. So that's what we should. I think that's what we should be doing."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":3975.83,"end":4035.24,"speaker":"Vesper Stamper","text":"Yeah, yeah, agreed. I think, I think that artists have been, I mean, artists have always had a political bent, of course, but I think what we've seen in maybe the last couple decades is that artists have really been co opted by the political worldview, like, to an extreme degree. But there are some of us outliers, you know, who are still staying connected to that narrative structure. And I like what you say often about that, you know, that Jesus or the Logos, like, fills the whole narrative structure, the whole hierarchy from top to bottom, you know, and that you can never get, you can never exhaust that, you know, can never get away from that. And those of us that are staying connected, whether we're Christians or not, but to that concept, that's just such a deeply artistic way to see the world. And I think it's very hopeful."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":4035.56,"end":4037.16,"speaker":"Jonathan Pageau","text":"Yeah, I think so too."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":4038.28,"end":4268.64,"speaker":"Vesper Stamper","text":"I think there's one little dream that I had last night that I wanted to share with you and get your. Okay, so one of the things that I noticed in the protests that I attended was that there was no music and. Right. So as much as it was following this very kind of religious structure, there was no music. And even the. I would even go so far as to say there was Very little creativity. So the signs all said the same thing. The signs were just the usual slogans. There weren't. I'm familiar with protests. This is not my first rodeo, you know, and. And I followed. I'm a Martin Luther King girl, like, dyed in the wool, you know, so protest is not new to me. Signage, marches, these are not new things in my life. So when I have been to previous protests, I'm so used to the artists really coming forth and taking the opportunity to get creative with their signage. Now, I understand that this is all very, like, sudden and raw, and so we haven't had the time to process and come up with, you know, really creative, like, slogans and things like that. But I just really was struck by. It seemed devoid of a spirit of creativity to me. Right, okay. So that's the backdrop. So I've been thinking a lot about, like, what made the civil rights movement so powerful and so successful in its aims at the time. And one of those things was music. Whether it's, you know, the spirituals that would be sung during protest, or whether it was, you know, protest songwriters like Bob Dylan, you know, or Woody Guthrie or Odetta, you know, people singing these songs of protest. And you can buy records of songs of protest from the 60s and stuff. Right. I've been asking myself, how is that going to emerge again? Like, what is the song of this current movement? Is there one? Okay, so that's the backdrop. So last night I had this very brief dream where I was at some kind of, like, church dinner or conference dinner or something, and people were milling around, socializing. It didn't have any real form. And I sat down at a keyboard and I started to play this song, this protest song called Lift Every Voice and Sing. And it's sometimes called the Black National Anthem. And it's a song that I grew up with, song that we sang in school. And I was trying to figure out the. You know, I'm playing the music for it, but I couldn't remember the words. So there's somebody sitting next to me on the piano bench, and I turn to him and. And it's Dr. Martin Luther King. And I turned to him and I said, oh, do you remember the words to this song? And he didn't say anything. He just sort of. It's hard to describe, but he kind of gestured with his presence to the fact that I had a stack of books in my hand. And at the bottom of this stack of books was the book of poetry, Lift Every Voice and Sing. And so I opened the book And I put it up on the piano stand. And instead of having the words listed, you know, on one page, like that would make it easy to be able to sing it at the piano. The words were running at the bottom of every page of the book. So you'd have to keep turning the page and turning the page to get all the lyrics. And then I woke up. Okay, so, Jonathan Pageau, what do I think it means?"}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":4271.2,"end":4298.07,"speaker":"Jonathan Pageau","text":"I don't know. I'd have to think about it. It's not, it's not obvious. It's not obvious at all in terms of what you're saying. Yeah, I'd have to think about it because nothing comes to mind. One of the things, though, that I might want to say in terms of the fact, the difference between the civil rights movement and. And now is it's, it is very different."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":4298.63,"end":4299.19,"speaker":"Vesper Stamper","text":"Yeah."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":4299.43,"end":4363.15,"speaker":"Jonathan Pageau","text":"Because in the civil rights movement, there was active opposition to the goal of the protest. Whereas today, I don't, I understand the anger of the moment because it was a horrifying thing to see. It was horrifying to watch that. And I can only understand it. But the goal, I don't see anybody opposing it. Like, I don't see resistance. I don't see the authority saying, no, we're gonna keep you down. Like, so it seems to me, it seems different than trying to remove segregation and Jim Crow rules it. I don't totally. So I don't understand. There isn't at all a sense massive corporations are all coming in favor all the levels of government. Even though people hate Trump. Trump came right away and said this guy should be, should be arrested. And everybody, everybody agrees that what happened is horrible and that."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":4363.63,"end":4368.19,"speaker":"Vesper Stamper","text":"And he has been. And the police officer has been charged with second degree murder."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":4368.27,"end":4448.12,"speaker":"Jonathan Pageau","text":"Right. And his wife left him and his whole world is over. Right. And so. And so. And so it's very different because it doesn't then look like the same kind of protest we saw before. It really does look more like a kind of religious atonement of some kind. Some kind of massive religious atonement for something. And so, I don't know, I just find it different. And that might also be why we don't. We're not going to find music that is, let's say, specific of this, this protest, because our whole culture is that like, our whole culture is aesthetically in tune with what the people want. Like this idea of racial equality, of the value of black culture, of the value. And so I don't. I mean, there are exceptions, but sure. And there are, but I mean, in terms of a thrust, it's it that seems to be the culture. And so I. And so I struggle to see how there could be some kind of, let's say, graffiti graffiti, rebellious art that could be there that hasn't already been expressed."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":4448.28,"end":4448.96,"speaker":"Vesper Stamper","text":"Right, right."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":4448.96,"end":4465.65,"speaker":"Jonathan Pageau","text":"It's like Public Enemy made millions of dollars selling their albums, and that was in the 80s, and that was a long time ago. And Kendrick Lamar is a multi, multi, multi millionaire, and the people and his movies are in. His music is in. Marvel movies."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":4465.81,"end":4466.21,"speaker":"Vesper Stamper","text":"Right."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":4466.45,"end":4471.97,"speaker":"Jonathan Pageau","text":"So the images that would maybe represent this movement are not marginal anymore."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":4472.05,"end":4483.56,"speaker":"Vesper Stamper","text":"Yeah. I wonder if the work that you're doing, and to some extent the work that I'm doing is actually the work of rebellion."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":4485.4,"end":4486.84,"speaker":"Jonathan Pageau","text":"You mean. You mean what."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":4489.08,"end":4505.4,"speaker":"Vesper Stamper","text":"I mean the. I mean doing work from. The work. From metanarrative, like, and. And figurative work. And I wonder if that is the rebellion."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":4505.74,"end":4577.9,"speaker":"Jonathan Pageau","text":"Well, I tend to think that. I mean, I tend to think that restoring a fuller worldview, in a way, is the most. It's both. The most. It's both an act of restoring a form of order, but also restoring the possibility of transgression. I always tell people, it's like, I understand the margin better than you guys do, and I understand its value and its role, and I talk about it all the time, but I also understand the problem with the margin and the difficulties that are there. Just like I understand the problem and the value of authority. And so I think that restoring a more fuller vision of the world can maybe help us. But, you know, honestly, it might be too late. That's laughing as I say that. But, I mean, right now I'm thinking a remnant. It will be enough, you know, But I don't see. I don't see massive. I don't see it having a massive effect, at least not at this time."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":4578.54,"end":4656.31,"speaker":"Vesper Stamper","text":"Yeah. Yeah. I think your work on the margins has really helped me to understand. I mean, I've. I've never left the margins. I've lived on the margins my whole life, and I don't. There's nowhere that I fit. I'm politically homeless and all of that. But I said in one of my episodes recently, it's like, always living in the lobby and never the sanctuary. But I have a deep connection to the sanctuary, and I have a deep connection to the parking lot, you know, but I'm in the lobby, you know, but. But there's a place. There's a deeply important place for the margin and for the lobby and for the narthex, you know, for the ability for people to pass through you to one side or the other. And I've come to very deeply appreciate that. That that is who I've been made to be and who I'm called to be as an artist, as a Christian, because the other structure that lives in the margin is a bridge. Yeah. And, hey, I welcome that. Totally."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":4656.79,"end":4663.43,"speaker":"Jonathan Pageau","text":"That's great. That's great. Well, we've been going for a while. I think this is a good place to stop."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":4663.51,"end":4665.35,"speaker":"Vesper Stamper","text":"I think so. Yeah."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":4665.75,"end":4681.68,"speaker":"Jonathan Pageau","text":"I wish you the best with your book. And I started reading it. I haven't finished, but I've definitely kind of dove in. And so I'm looking forward to seeing, to learning more about it. And I wish you the best. Maybe when it comes out and everything, we could have another conversation."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":4681.84,"end":4687.2,"speaker":"Vesper Stamper","text":"Oh, that'd be great. And hopefully the world may have taken a deep breath by then."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":4688.24,"end":4689.36,"speaker":"Jonathan Pageau","text":"Yeah, let's hope."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":4689.76,"end":4690.24,"speaker":"Vesper Stamper","text":"Yeah."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":4691.28,"end":4692.96,"speaker":"Jonathan Pageau","text":"All right, Vesper, it's good to talk to you."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":4693.04,"end":4694.28,"speaker":"Vesper Stamper","text":"You too. Thanks, Jonathan."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":4694.28,"end":4694.8,"speaker":"Jonathan Pageau","text":"Bye. Bye."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":4694.8,"end":4695.12,"speaker":"Vesper Stamper","text":"Bye."}
{"episode_id":"SW - #106 - 2020-06-30 - Vesper Stamper - Plague, Revolt and Flagellants","start":4695.92,"end":4760.86,"speaker":"Jonathan Pageau","text":"I hope you enjoyed this episode of the Symbolic World. The Symbolic World is edited by Justin Ward and it is based on a series of video that you can find on my YouTube channel, Jonathan Pageau's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course, leaving a review on itunes. Everybody knows that's the best way to get the podcast out there, to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon Pageau videos as well and on SubscribeStar, all those links you can find on my website or in the show description. So thank you and I will see you soon."}
