{"episode_id":"SW - #291 - 2023-06-15 - Heather Pollington - The Art Behind 'Snow White and the Widow Queen'","start":9.6,"end":58.48,"speaker":"Jonathan Pageau","text":"Once upon a time, the queen of a certain kingdom was barren. Though she wished it more than anything, she could not have a child. She kept her sadness hidden in songs and kindness, but the king could discern her suffering through the smiles. For years, she kept her tears to herself, her heart secretly praying for her long desired child. One day on the feast of Candlemas, a crow perched in a tree just above her in the garden. Startled in her mending, the queen pricked her finger and a drop of her blood fell onto the pristine snow. She knew at that moment that she would have a child. But her prayers had been answered. She would give birth to the most beautiful girl in the world, with skin as white as the virgin snow, with lips as red as blood, and with hair as black as co."}
{"episode_id":"SW - #291 - 2023-06-15 - Heather Pollington - The Art Behind 'Snow White and the Widow Queen'","start":73.34,"end":134.79,"speaker":"Jonathan Pageau","text":"This is Jonathan Peugeot. Welcome to the symbolic world. Hello, everyone. I am very excited today because we are going to present you the Snow White Project, which is coming out on Kickstarter next week, June 6th. As you know, I started working. We've been working on this for several months with Heather Pallington, who's here with me. And so I'm, you know, we're all both really nervous because this is like our little baby that we've been working on for a long time. And, you know, in some ways, we're really doing something that is both very strange and surprising, but then also something which is a fairy tale, like, a fairy tale like everybody knows about. So we. What we want to do is we want to go through some of the reasons why we're doing this, why we're doing Snow White, you know, why we're also doing this series of fairy tales and why we're doing it now. So, first of all, Heather, thanks for joining me."}
{"episode_id":"SW - #291 - 2023-06-15 - Heather Pollington - The Art Behind 'Snow White and the Widow Queen'","start":135.19,"end":136.79,"speaker":"Heather Pollington","text":"You're welcome. It's good to be here."}
{"episode_id":"SW - #291 - 2023-06-15 - Heather Pollington - The Art Behind 'Snow White and the Widow Queen'","start":136.95,"end":406.13,"speaker":"Jonathan Pageau","text":"Yeah. And so Heather and I, we met several months ago before we did the Snow White project. You know, she helped me with the rebranding of the symbolic world, as you know, and I told her about this project that I was working on. And so for several years now, I've been thinking about fairy tales. I've been thinking about them very much inside the symbolic world, comparing them to Bible stories, comparing them to myth, and realizing to what extent, you know, there's just a range, there's a scale between Bible stories, myths and fairy tales. They're really of the same nature. It's just that some are more fantastical. You know, fairy tales can be more whimsical, fantastical. They're able to stretch reality much more, but ultimately, they just follow very similar patterns. And several people have had that intuition. When you hear the story of Snow White, you can see there's an apple and then she eats it and she falls asleep. You know, there's a temptation and there's all that, and it's as if it's just right out of reach. What's this relationship to the Bible story? You know, what's the connection between the story and the Bible? So this is something that I've been thinking about for. For a long time, meditating on, trying to see what is going on in the Snow White story. And, you know, I wrote this as a play for my children a while ago. Of course I've added it, I changed it, But a long time ago, I wrote it as a little play for my kids. As we were homeschooling and as I was, you know, after we finished God's Dog, I was thinking about that story. It just kept coming back in my mind. And I realized, you know, I think it's time to retell the fairy tales. And this is in some ways a kind of cultural moment. You know, we've been watching for the past decade. People try to reinterpret the fairy tales, change them, adapt them politically to our current situation, make comments on them. In some ways, be quite cynical. You know, if you think of series like the Shrek series where they take these. All these fairy tale mashups and they make something very funny, very whimsical, but also quite cynical about what is in the fairy tales. And there are several versions of that, both for adults and for children. You know, the Disney had a series called Once Upon a Time that had, like, adult versions of the fairy tales. And you can kind of see all their. Their kind of desires. It's more like a soap opera. And so there have been many efforts to try to kind of dive into this fairy tale world, but to do it in a way that, like I said, is a bit dark and a bit cynical. And my intuition was, maybe it's time to jump back into the fairy tales and do something similar. Create a kind of world where the fairy tales cross each other, where the characters, you know, continue on between the different stories, but ultimately with the purpose of creating insight about what's in those fairy tales. And so the project is for kids. You know, you can read the story to your children. It's a beautiful storybook. We're doing it, you know, with beautiful materials, like a, you know, like a 19th century fairy tale storybook that is well bound and it looks amazing. But the idea is there'll be two readings in the fairy tale, one for the children, one for the adults. But now it won't be dirty jokes and kind of, you know, references that just go over the head of the children, but rather there's a layer that is deeper in insight and is trying to help people see what is really going on in these fairy tales. And so I'm quite excited. And, you know, this seemed like an impossible project, but I've been very fortunate to be surrounded by wonderful people. And Heather, of course, you know, has really just amazed me to what level she's been able to capture the vision of what it is that I wanted. Also, everybody knows I love medieval art. I love, you know, traditional icons, all of that. And she was able to kind of create a visual language to join, you know, more, let's say, 18th, 19th, 20th century fairy tales, early 20th century fairy tale styles with the power of medieval storytelling. And so, Heather, you know, maybe you can tell us. You know, first of all, I'd like to know, because this is a strange, wild project. You're a professional artist. You know, you've been doing all these projects with big. With big franchises, Disney and all these companies. And so here's this, like, icon carver that asks you if you're willing to help him tell a bunch of fairy tales. And so what is it that made you accept something like this?"}
{"episode_id":"SW - #291 - 2023-06-15 - Heather Pollington - The Art Behind 'Snow White and the Widow Queen'","start":406.45,"end":491.57,"speaker":"Heather Pollington","text":"Okay, well, there's a bit of a story behind this, and it kind of goes back to around 2017, and I was working on Maleficent 2 in England, and it was having a great time on that film. It was a really fun project. We were doing loads of really opulent, kind of brightly colored medieval stuff. And I had to do tons of research for that project, obviously designing tapestries, carpets, things like that. And what happened was it was the first time, really in my career that I managed to get the chance to delve into the medieval world. I mean, if you work in the world of film, you are always jumping between different eras. You know, like eight months you're on Victorian, and then the next month you're doing like 16th century Amsterdam or something. So you have to switch very quickly between all these different languages. And this was the first one that kind of combined medieval and fairy tale for me. And when I started researching, I just came across this art and it was. It literally just knocked my socks off. It was so interesting. And I was like, how did I not know about this before? So I'm going to show you some of the art that I encountered and kind of what it did for me, and that sort of gave a lot of the impetus to this project. But it's something that's been kind of brewing for a few years, and when you came along, it kind of all came together for me. So I'm going to take you through and you see that."}
{"episode_id":"SW - #291 - 2023-06-15 - Heather Pollington - The Art Behind 'Snow White and the Widow Queen'","start":492.21,"end":492.77,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #291 - 2023-06-15 - Heather Pollington - The Art Behind 'Snow White and the Widow Queen'","start":492.93,"end":777.45,"speaker":"Heather Pollington","text":"Okay. So when you're working in film, it's very much like a magpie culture, and we're always looking for things that are going to kind of best transmit our story. So you're looking around in the world of design, you're trying to figure out, like, what is this artistic language? How can it be used for storytelling and ultimately, how does it affect the audience? Because, you know, last time I was on here, I was talking very much about, you know, what it is to design for film and very much how we think about emotion and how we can drive plot, you know, with different. Different languages and. Yeah. So I started looking across the sort of medieval world. It was the first time that I encountered iconography and I was also looking at manuscript arts and I started to notice there is, like, very specific technical things that this art was doing that was just really impressing me. So I've just labeled it up here. I'll just go through quickly. Very dynamic poses and breaking the frame. Simultaneous depiction of multiple moments in time. Symbolic use of colour and a manipulation of scale to transmit meaning. Also using complex perspective systems that converge on the viewer. And I was thinking, what. What is it that. About these features? You know, what. Why is kind of early Christian art developed in this way? And I was looking deeper and I was thinking, everything, whether it's like 2D or 3D, it's always projecting out and. And it's like. It's so powerful. And it's like. I see it in churches in England. These are across the bottom, you can see their roof bosses, which are architectural details that meet in the ribs of Gothic architecture. But they're some of my favorite things and they're so creative. And I think I was. Yeah. So I was thinking, like, why. Why does it project out in the way that it does? It's so dynamic. You know, you can see here this. And this was a. You know, it's like there's a shadow there because he. He kind of comes out. So I was thinking, the only thing I can think of is because, you know, Christianity is all about receiving in so many ways, isn't it? It's all about, like, receiving the word, receiving communion, and I think receiving the image. It's the same thing that These are definitely art forms that are made to be received and kind of transmit stories to us. So I just want to make this kind of point really obvious. There's two depictions here of Emmaus, and the one on the left is a roof boss, that one that I absolutely love. And even though, you know, it's pretty dilapidated, unfortunately, these figures have lost their heads. It's like when you make your way around this roof boss, you're actually experiencing the whole of this story. You've got Christ here with the pilgrim bag coming in on the walk, then you've got him at the table, and then you've got him, you know, ascending here as well. So you're, like, experiencing the whole story. And to me, it's like experiencing these is, like, similar to experiencing scripture, because when you're reading scripture, you kind of meditate on things. You come back to it, it looks different from different angles, so you sort of experiencing it in a fresh way every time. And I think I just want to compare it to this painting here, which is like the most famous version of Emmaus that we have by Caravaggio. And although it's wonderful, it's doing a very different thing. It's kind of. It's. It's. It's a moment in time. It's. It's painted in a realistic way. And this is like the father of, like, the cinematic language and also, you know, the. The snapshot, so that it's pulling you into a different dimension, basically. Whereas this one, to me, is kind of affirming you actually reading the story there. So this is the kind of art that I really love. It's kind of. It's universalist in style. It's using a lot of elements to kind of transmit a massive amount of story in one piece. So I was also interested in the sort of correlation between, like, art and scripture. And so when you came to with the project, I looked at the site, the kind of language that you'd used in the fairy tale, and it seemed very interesting because it's like. Which seemed very concise. It's like you considered every single element of it. Like, everything seemed considered that there was, like, the explicit elements and also implicit elements. So there's definitely kind of layers to it. I don't know if you could talk about that."}
{"episode_id":"SW - #291 - 2023-06-15 - Heather Pollington - The Art Behind 'Snow White and the Widow Queen'","start":777.45,"end":852.34,"speaker":"Jonathan Pageau","text":"No, but it's interesting that you also. The way you said it, and I think this is something which will surprise people when they read it, is. My model for writing the fairy tale is very much scripture in the sense of. The scripture has a way of telling a story which is very concise and very simple without stopping on long descriptions or describing interstates. There's none of that in scripture. It's quite direct. And so I thought that there was something about that way of telling the story, like the way that the gospels tell the story, you know, for, you know, for a Victorian reader is quite lacking. But I think there's something about it which is so simple and powerful and it comes close to the way that the old fairy tales were told. You know, the first Snow white version is 3,000 words. It's very short, it's very concise, and there's a sense in which you can tell it in one sitting. And so this is really what I wanted to recapture in the way that I, that I told the story of fairy tale. So every single sentence was, you know, fought over and thought over and trying to get to the essence of what it is that Snow White is doing. And there's not a lot of. There's not a lot of flowery language and a lot of flowery description."}
{"episode_id":"SW - #291 - 2023-06-15 - Heather Pollington - The Art Behind 'Snow White and the Widow Queen'","start":852.42,"end":940.17,"speaker":"Heather Pollington","text":"No, it must be really hard because like you say, it's. It's a collective language, isn't it? It's something that's basically been contributed to. It's probably an oral culture and it gets changed over time and kind of distilled, like you say. That's very different from a kind of 19th century novelist who has a kind of, you know, particular voice. But yeah, so, so what was great about it, just this first passage is, you know, little things just kind of leap out in terms of colors and, and imagery. So it was quite clear, like, you know, way where you wanted to. The things that you wanted to emphasize, let's say. Yeah, so one thing I did next was kind of dived into the world of fairy tale illustration because obviously I was really influenced by Christian art. But we're not, you know, we're not on a sacred subject. And so we need to look broader and, and find some kind of synthesis. So one thing I found that was really common in fairy tale illustration that you talk of is, is the silhouette. And I don't know if it's a technical thing because books are very expensive to reproduce or, you know, I don't know what you think. I was wondering if it's because fairy tales kind of deal with archetypes and so, you know, you kind of only need a shape to tell you what that thing is. You don't really need the detail. They don't have a particular identity necessarily, these characters."}
{"episode_id":"SW - #291 - 2023-06-15 - Heather Pollington - The Art Behind 'Snow White and the Widow Queen'","start":940.49,"end":986.18,"speaker":"Jonathan Pageau","text":"But I think it's also. Because it's also to capture, probably intuitively, but it's a version of the medieval storytelling we saw before. Because in order to create silhouette art, you have to have the character placed in a manner that everything is recognizable in the movement they're doing. So there's something that's very like, you see in the images here. You have to be able to see them from the side pose or from the front with the arms moving in a way that is very clear. The action is clear, everything is clear. Or else. Or else you'll just see a big black mass that doesn't make any sense. And so it seems like a modern way to capture some of what we see in medieval art, which is this frontal or side poses and very clear, clear movement."}
{"episode_id":"SW - #291 - 2023-06-15 - Heather Pollington - The Art Behind 'Snow White and the Widow Queen'","start":987.7,"end":1069.22,"speaker":"Heather Pollington","text":"So, yeah. So having found the silhouettes, then I looked into what's called the Golden Age. And what was really interesting is this. This guy here, Heinrich Leffler, he was an Austrian artist, and he was really drawing from the. The Byzantine style in the early 20th century. And I found out a whole load about that movement that was happening in Austria and in. In the wider arts. It involved people like Gustav Klimt. And we know that obviously he was really influenced by the. The mosaics in Ravenna, and he brought that into the fine art world. But Leffler was doing that in the world of illustration. So as soon as I found a kind of synthesis of. Of like, Christian art and. And fairy tale, it was like, okay, well, you know, we're clearly on solid ground here, because actually this has been done before. And it was really nice to discover his work. Kay Nielsen, obviously a giant of fairy tale illustration, really looked at his stuff. Errol Lecane, he's much later, but kind of was real, really big fan of K. Nielsen. And then this lady, Mary Blair, was a concept artist at Disney, and I absolutely love her work. She did a lot of really expressive gouache paintings for Disney, a lot of concept work that made its way into the films. So she seemed like a good touch point as well."}
{"episode_id":"SW - #291 - 2023-06-15 - Heather Pollington - The Art Behind 'Snow White and the Widow Queen'","start":1070.18,"end":1074.98,"speaker":"Jonathan Pageau","text":"And you can see in these influences already some of what you ended up putting into the text."}
{"episode_id":"SW - #291 - 2023-06-15 - Heather Pollington - The Art Behind 'Snow White and the Widow Queen'","start":1075.06,"end":1238.28,"speaker":"Heather Pollington","text":"Yeah, I think what in my career, I've spent a lot of time, like, mimicking historical styles. You know, I'll be on a movie and they say, oh, you know, you need to do an illustration from 1910. And so I could have done that, but I didn't want to because I wanted to make sure that I wasn't just doing something like, you know, the, the watercolor artists from the early 20th century, because they've already done it and it's, you know, they've already done beautiful works. It's like, okay, we need to blend together some different aspects and try and bring out, you know, some have to have a bit of 21st century technology in there as well. So that was really important to find a style that sort of was a blend, but there was also new. So, speaking of Disney, obviously, as part of the project, you've got to look back at all the incarnations of Snow White. And we looked at a lot of illustration together, didn't we? But what kind of popped out was obviously the 1937 Snow White and the Seven Dwarves film. You know, it's the most iconic adaptation. Everyone knows that. It's amazing. But what was interesting was just looking around the. The production of that. That film, and what I found was that in 1933, there was another Snow White by the Fleischer brothers. And the story is that they were the kind of east coast rival to Disney in the 20s and 30s. And their stuff is absolutely amazing. By the way, if you go on YouTube, you can see their cartoons. They're so inventive, but they're very, very dark. And their version of Snow White, which you see on the left, is absolutely mad. Go and look at it. So it's got all, like, it's got the elements there. There's Betty Boofus, Snow White, there's the Queen, and then there's some very strange creatures. And what I realized is that when Walt Disney made his Snow White In 1937, it wasn't like, it wasn't coming into a culture of, like, Snow White being wholesome. It was. He actually consciously decided to do a kind of radical, traditional version of Snow White with new technology. And so, yeah, it seemed interesting to me because you've talked about, you know, what's going on at the moment in culture and the way the fairy tales are being depicted. And, you know, it seems like a similar moment that, you know, you could actually do something traditional and it could. It could, you know, become interesting in that environment. So, yeah, that's the."}
{"episode_id":"SW - #291 - 2023-06-15 - Heather Pollington - The Art Behind 'Snow White and the Widow Queen'","start":1238.28,"end":1287.47,"speaker":"Jonathan Pageau","text":"I think that when you presented me this image of Fleischer and Disney, I think it was really. It just hit me that that's exactly what it is we're trying to do. And in some ways, that's exactly the moment that we're in, which is the surprising moment when things have been so twisted and become so surreal and strange that they're almost unrecognizable. So, like, you Said the Betty Boop, the Snow White, the Fleischer Snow White. It's really fascinating and hypnotizing and interesting, but it's almost unrecognizable as the story of Snow White. You really need to know the story deeply in order to realize that this is Snow White because it's all irony and comment and kind of joking about in the story. And so it's. This is a. In some ways, we're in the exact same position where exactly."}
{"episode_id":"SW - #291 - 2023-06-15 - Heather Pollington - The Art Behind 'Snow White and the Widow Queen'","start":1287.55,"end":1294.27,"speaker":"Heather Pollington","text":"And when. When you watch the Disney Snow White, I think everyone looks at it and goes, oh, it's from. You know, it's old, it's from the past."}
{"episode_id":"SW - #291 - 2023-06-15 - Heather Pollington - The Art Behind 'Snow White and the Widow Queen'","start":1294.75,"end":1297.63,"speaker":"Jonathan Pageau","text":"It's like. It's just this tradition that has been around."}
{"episode_id":"SW - #291 - 2023-06-15 - Heather Pollington - The Art Behind 'Snow White and the Widow Queen'","start":1298.43,"end":1437.29,"speaker":"Heather Pollington","text":"It's like, no, he knew what he was doing. I mean, just look at everything about it. Look at the titles. You know, he was reviving medieval forms in. In the late 30s, you know, for a reason. So that. That was really interesting. Anyway, so I got. Yeah, I do loads and loads of research. I had tons and tons of stuff to look at. And this is just a kind of picture of my process. On the left is me and Thessaloniki, and I went to an exhibition on Ravenna mosaics. And that people will know is quite a famous pattern that made its way into the book as a kind of snowflake design. So I'm basically collecting patterns and designs all the time. And then obviously on the right is, like, what you see behind me. That's my board. So what I'll do is, because I've got all these elements, I'll just bring them all together on a pin board. And basically it, like, after I've lived with it for a few months, it tends to kind of synthesize in my mind and helps me make decisions as I'm drawing. Okay. So this is the COVID of our book and just wanted to talk about it in terms of ornamentation. Now, ornament gets quite a bad rep. It's like always at the bottom of the. Of the kind of visual arts hierarchy. But I have a love for ornament because I went to work with it a lot in film and it can do quite a bit, you know. So you can see that I've done a kind of decorative panel, but I've drawn from mainly mosaics, but Byzantine ornament. But I've drawn mainly from the more florid aspects, you know, because I felt like they would fit into, you know, the idea of fairy tales. So going with kind of flowers and vines and things like that. And then you see this pattern here that goes around, and I picked that because obviously you've made the kind of reference to Genesis and, you know, I got the tree, but you don't really want to show the snake. So I just thought, why don't we just have like a serpentine pattern? You know, it's like. It's not so obvious, but hopefully it's just enough. And so that was the thinking behind that. And then obviously the. With sitting within the ornament is lots of details of the story. So, yeah, that's our cover."}
{"episode_id":"SW - #291 - 2023-06-15 - Heather Pollington - The Art Behind 'Snow White and the Widow Queen'","start":1438.89,"end":1478.76,"speaker":"Jonathan Pageau","text":"And this is also one of the things that was important to. To both of us was, you know, when you think of Fairy Tale World, you really see Neo Gothic is the way that people tend to. So immediately like the way that people understand the medieval world. There's certain tropes which, if you don't think about it too much and you go simply at it, you end up with kind of Neo Gothic, or at least late Romanesque imagery. And one of the things we wanted was to incorporate some Byzantine aspect on the one hand, to connect with that medieval imagery, but also to be able to have a bit of wonder and surprise in the image."}
{"episode_id":"SW - #291 - 2023-06-15 - Heather Pollington - The Art Behind 'Snow White and the Widow Queen'","start":1478.76,"end":1543.73,"speaker":"Heather Pollington","text":"Yeah, yeah. Okay. So this is one of the illustrations. And it's. It's. It's good that you said that, Jonathan, because in. In conceptualizing the style of it, I really didn't want it to be a certain moment in time in a certain place. For the reasons that I talked about before. I. I much prefer art that is kind of universalist. And I think my aim was it should feel like more like a kind of Christian dream world than, you know, oh, that's a 14th century, you know, wherever. Again, I've spent a lot of my career doing very specific historical pieces, and I actually find it's much more enjoyable to draw from different sources and pull them together. But, I mean, people will notice. Yeah, there's. There's Byzantine, there's also Romanesque. This one, I feel like, was more you than me because you gave a really specific description for this illustration. I basically just had to draw it. And you designed the King and the Queen, I think. So I don't know if you want to talk about it."}
{"episode_id":"SW - #291 - 2023-06-15 - Heather Pollington - The Art Behind 'Snow White and the Widow Queen'","start":1544.13,"end":1645.99,"speaker":"Jonathan Pageau","text":"Well, I think that the first thing to say is that what you said about a Christian dream world, that is exactly what we're going for. And it's not something that we're going for just in this project, but it's something that I was kind of going for already in God's Dog. Right. It's the idea that we've had this interesting moment in history where Tolkien, who is a devout Christian, created a. A fantasy world or, you know, develop the fantasy trope in a way that was based on pre Christian and pagan and, you know, folk elements. And so what we're trying to do is in some way push that in a direction that will surprise everyone, which is to have a fantasy world, but that is based really on. On Christian tropes and on Christian imagery. On Christian. And you see that it's already there, right. In the fairy tale world. It's already there very implicitly. You know, if you think of Disney's Sleeping Beauty, for example, like, that's a Gothic, you know, mass. It really does take in some of the medieval and Gothic imagery, but we wanted to do it in a way that's far more explicit and so bringing in tropes of Christian iconography. Not explicitly, but, you know, the way the story is told, the way that the layout is done. And so here, of course, we have an image which is, you know, basically the image of Constantine and Helen, right. That's. That are standing together, but that is also joined with a kind of Adam and Eve image with the tree in the center. And so really bringing in different images from the Christian tradition, but telling them, bring. Bringing them in a way that most people won't know. Like, if someone looks at this, they'll just. They'll just see it. They won't necessarily understand what we're dragging into it. But that is what. That's what we're bringing into the image."}
{"episode_id":"SW - #291 - 2023-06-15 - Heather Pollington - The Art Behind 'Snow White and the Widow Queen'","start":1646.23,"end":1678.25,"speaker":"Heather Pollington","text":"Yeah, yeah. And I think, you know, for me, the Byzantine world is pretty new and I was really interested to study it, but naturally, because I live in England and I'm surrounded by kind of Western medieval art, it's inevitable that that's going to come in. And so I kind of welcome that synthesis. And the other thing to say is, you know, in the. In the medieval English churches that they were. They were like, absorbing the Byzantine style and the Romanesque style anyway and kind of appropriating it. So all of this stuff is really link together."}
{"episode_id":"SW - #291 - 2023-06-15 - Heather Pollington - The Art Behind 'Snow White and the Widow Queen'","start":1678.49,"end":1678.97,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #291 - 2023-06-15 - Heather Pollington - The Art Behind 'Snow White and the Widow Queen'","start":1681.05,"end":1684.69,"speaker":"Heather Pollington","text":"So, yeah, as you said, there's the icon of Helen."}
{"episode_id":"SW - #291 - 2023-06-15 - Heather Pollington - The Art Behind 'Snow White and the Widow Queen'","start":1684.69,"end":1686.25,"speaker":"Jonathan Pageau","text":"I mean, it's pretty clear, right?"}
{"episode_id":"SW - #291 - 2023-06-15 - Heather Pollington - The Art Behind 'Snow White and the Widow Queen'","start":1686.25,"end":1719.64,"speaker":"Heather Pollington","text":"Yeah, it's very clear. This is the first ivory we've looked at, actually. And I haven't talked about them yet, but I know that you're a big fan, and it was a really big part of my thinking on this job because I just. I love the way they're stylized and I. I found them not particularly this one but there's quite a few I've looked at that are like these little, like, theatrical vignettes. You know, you often get these, like, frames with a curtain, and then there's, like, you know, one of the evangelists inside, you know, writing the gospels with architectural."}
{"episode_id":"SW - #291 - 2023-06-15 - Heather Pollington - The Art Behind 'Snow White and the Widow Queen'","start":1720.92,"end":1721.72,"speaker":"Jonathan Pageau","text":"Framed. Often."}
{"episode_id":"SW - #291 - 2023-06-15 - Heather Pollington - The Art Behind 'Snow White and the Widow Queen'","start":1721.8,"end":1722.28,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #291 - 2023-06-15 - Heather Pollington - The Art Behind 'Snow White and the Widow Queen'","start":1722.52,"end":1725.08,"speaker":"Jonathan Pageau","text":"So you have this canopy on top of the image."}
{"episode_id":"SW - #291 - 2023-06-15 - Heather Pollington - The Art Behind 'Snow White and the Widow Queen'","start":1725.08,"end":1829.04,"speaker":"Heather Pollington","text":"Yeah, exactly. Exactly that. So. And I know that this whole project, as you said, was conceived initially as a theatrical project. So, again, it seemed like a good language to go to. So. Yeah, so this is Constantine and Helen. You know, I looked at lots of kind of manuscripts with. With the city and just turned it into a decorative frame again. That's a nice kind of economy there. And then these. If you look at these patterns here. So obviously, had to design. Wanted to do a pattern for the king and the queen that had some coherence in the frame, but they've got different motifs. In the king's one I found on a Byzantine robe, and it had this. It had this weird thing going through the middle, going in two directions. And I don't know about you, but there was a subtle thing in your. In your text where the king's kind of dubious. And I was like, yeah, that's. That's the right symbol for him. You know, he kind of marries too quickly and all of that. And then. And then with the queen, you know, this is quite a typical Byzanti design with the two birds. But, you know, they're looking. They're looking away from each other, so it just gives that unsettling feeling in the marriage, I think. And again, like, all of this is historically accurate, but I've selected it for story reasons. So that's the rogues. Yeah. So both of these on the left we've got the death of the Queen, and on the right is the death of Snow White. And they. Again, you gave me a direction for this. So it was the icon of the Dormition. And so you can see there's a mirroring between the two pieces. And again, the reference with the ivory."}
{"episode_id":"SW - #291 - 2023-06-15 - Heather Pollington - The Art Behind 'Snow White and the Widow Queen'","start":1829.44,"end":1894.45,"speaker":"Jonathan Pageau","text":"Yeah, yeah. And so this is. I mean, this is an example where, you know, we're trying to pull in imagery from the Christian tradition without, you know, without being explicit. People, Most people will look at this and never know what we're pulling from. But there's a strength in the composition. Right. In some ways, what we're doing is we're using all this powerful storytelling language that has. That just was developed organically over centuries within the church. And, you know, why couldn't we use it why shouldn't we use it? And so the powerful image of the woman, of the feminine, you know, as this. As this horizontal line in the image with. With a man kind of standing over, being a vertical. In vertical relationship to. To the woman. It's a. It's a very simple, powerful tool for. For helping to kind of intuitively understand the relationship of the Maxine to the feminine. You know, I mean, it's very simple. So. Yeah, so it is, but. And when you look at it, it's very effective. You know, both of those images are very effective in terms of what they're doing."}
{"episode_id":"SW - #291 - 2023-06-15 - Heather Pollington - The Art Behind 'Snow White and the Widow Queen'","start":1894.85,"end":1941.13,"speaker":"Heather Pollington","text":"Yeah. So the nice thing about this, you've got the angle of his crown going down to the dead queen, and then that goes down there, and then your eye ends up on Snow White, who's the, you know, potential future, I think. But I think. Yeah, while we've got these two up, I just want to mention, if you see the way that we're using silhouettes. So like I said, in your text, there was explicit action and then implicit action. So here you've obviously got the queen and the. The king, you know, rendered in full color. The. The midwife is kind of half silhouette. And then you've got the widow queen, who's basically. Obviously, she's not there right at that scene, but she's kind of looming in the background because she's about to come on the stage."}
{"episode_id":"SW - #291 - 2023-06-15 - Heather Pollington - The Art Behind 'Snow White and the Widow Queen'","start":1941.21,"end":1941.57,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #291 - 2023-06-15 - Heather Pollington - The Art Behind 'Snow White and the Widow Queen'","start":1941.57,"end":1964.5,"speaker":"Heather Pollington","text":"You know, she. She's just. She's just a shape at the moment. So, yeah, I wanted to reflect kind of the hierarchy in your writing with the kind of visual hierarchy in the illustrations. And then you see with this one, you've got the prince kneeling, and that's because he's. He's kind of submitting to her, isn't he? So we don't need to see the details of the prince at this point. And all of the kind of visual emphasis is on Snow White."}
{"episode_id":"SW - #291 - 2023-06-15 - Heather Pollington - The Art Behind 'Snow White and the Widow Queen'","start":1964.98,"end":2006.54,"speaker":"Jonathan Pageau","text":"Yeah. And it's important to understand for people that, you know, while we worked quite so much on this, this whole story, because much of the others are large, there's a part of the narrative which is not in the text. So there's a. There's a. There are little strains of narrative which appear only in the images. And so people have to pay attention to the images as they're reading to get subtext and to get some of the things that. That. That are. That is happening that isn't mentioned in the. So, for example, the fact of the widow queen already there in the background, as, you know, the queen, the Mother of Snow White is exiting the story. That's a little hint of that. But there are a few more of those as the story progresses."}
{"episode_id":"SW - #291 - 2023-06-15 - Heather Pollington - The Art Behind 'Snow White and the Widow Queen'","start":2006.86,"end":2034.89,"speaker":"Heather Pollington","text":"There are. Okay, so this is the widow Queen now on the left. You can see, I think early 20th century illustration is one of the many ones that I looked at, but this one really stood out to me because she's. It says at the bottom, mirror, mirror in my hand, who's the fairest of the land? And I was like, okay, that's different to what we're all used to. Right. You know, because we all know the mirror, mirror on the wall, that's the famous one."}
{"episode_id":"SW - #291 - 2023-06-15 - Heather Pollington - The Art Behind 'Snow White and the Widow Queen'","start":2035.05,"end":2057.63,"speaker":"Jonathan Pageau","text":"And Heather literally had me change the way that I wrote it because she had such a great idea about this. When I saw the image also of the queen holding the mirror in her hand, I thought, this is amazing. She's holding a cell phone. Like, she's literally taking a selfie. And I realized that this, for now at least, this was really the most powerful way to present the. The story. So. So it was. It was a great change."}
{"episode_id":"SW - #291 - 2023-06-15 - Heather Pollington - The Art Behind 'Snow White and the Widow Queen'","start":2058.03,"end":2108.75,"speaker":"Heather Pollington","text":"Yeah. So that's right. So it was like this. Really. At the. At first it was like, there's really something about this that I need to pay attention to. And then eventually I realized, and I was like, okay, so we're living in the age of narcissism, clearly. And, you know, we're all captivated by these devices. And I know a lot of people have made comparisons between phones and mirrors. I think Paul Kingsnorth was talking about it recently, and I started to think about it. I was like, yeah, so let's think about kind of the whole social media thing. And how is that. How is that like a kind of feedback loop? And I, you know, I'm on Instagram and, you know, now and again, I put up a design or picture that I've done or something. Basically, what you're doing is you're kind of looking for, you know, oh, did anyone like my picture? Let's have a look. You know, it's like a little bit of affirmation, right?"}
{"episode_id":"SW - #291 - 2023-06-15 - Heather Pollington - The Art Behind 'Snow White and the Widow Queen'","start":2108.83,"end":2113.07,"speaker":"Jonathan Pageau","text":"Yeah. You're asking the mirror, who's the fairest. Yeah. Okay."}
{"episode_id":"SW - #291 - 2023-06-15 - Heather Pollington - The Art Behind 'Snow White and the Widow Queen'","start":2113.51,"end":2124.75,"speaker":"Heather Pollington","text":"And. And what Instagram does, which is really dark. Is it when you first join, it shows you a lot of the things that you want to see. But as time goes on, it starts pushing more and more ads at you."}
{"episode_id":"SW - #291 - 2023-06-15 - Heather Pollington - The Art Behind 'Snow White and the Widow Queen'","start":2124.75,"end":2125.11,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #291 - 2023-06-15 - Heather Pollington - The Art Behind 'Snow White and the Widow Queen'","start":2125.67,"end":2200.1,"speaker":"Heather Pollington","text":"So it starts to become undermining. And, you know, these days, if I go on, I just get told, you know, that I'm kind of old and wrinkly. And all of that stuff because, like, they know I'm 45. So it's actually an awful thing if you pick up the. The mirror and you just, you know, so. So I was thinking, that's an interesting relationship. So you're basically looking for something, and you get the opposite. And then I started thinking about it more, and I think we all know stories of people who kind of got so into, you know, their TikTok accounts or Instagram that have actually started to, you know, have surgeries and stuff, and they end up kind of destroying themselves, you know, because they become so captivated with the narrative of. Of the mirror. Right. So this is what happens to the queen. She starts to believe the mirror more than, you know, say, her husband, you know, the king clearly loves her. But again, the danger we have in the modern world is we're not seeking affirmation from our families. We're actually seeking affirmation in the algorithms. And so there's this very dangerous kind of thing that can happen that can destroy you. And I thought, okay, so that's. Maybe this is one of the reasons we're making Snow White now, because all of these themes are so kind of present."}
{"episode_id":"SW - #291 - 2023-06-15 - Heather Pollington - The Art Behind 'Snow White and the Widow Queen'","start":2200.42,"end":2273.53,"speaker":"Jonathan Pageau","text":"And in our version, I really did try to push that. You know, it's so weird that I. I had that intention in the story to bring about something like that, but I didn't think of the mirror in the hand, and when you showed it to me was like, yeah, that's exactly what I'm doing. And so the idea is that the queen, you know, ultimately ends up destroying herself. Herself. She ended up just destroying herself through this obsession that she has with finding out who's the most beautiful. And so that image of the person, you know, looking in their phone or whatever, obviously, it's not just that, but that's a good example of what's going on. Looking in their phone and then becoming obsessed with the tropes of beauty, like you said, to the point where they will destroy their faces, destroy their body, or become caricatures of humans. Sometimes. It's not just. It's like, even these makeup. All these, like, makeup tutorials where you. You know, people, you can see, like, they're just caking it on in a way that looks good on the phone. But you can tell, even looking at the. In the photo, that if I saw this person in real life, I would run away from them, like, with all their, like, really strong lines on the nose and all that. It's like. It's. It's this living for the Mirror, like. Yes, it's wild. It's like transforming yourself for the way that the phone takes a picture of you."}
{"episode_id":"SW - #291 - 2023-06-15 - Heather Pollington - The Art Behind 'Snow White and the Widow Queen'","start":2274.01,"end":2294.57,"speaker":"Heather Pollington","text":"Yeah, yeah, yeah. Because you're so captured by the mirror. And then that's what these images show, that she's, you know, we never really see her interacting with humans. We only see her staring into, you know, what. She's. She's staring into the mirror or staring eventually at the apple, which becomes the kind of, you know, the end of things."}
{"episode_id":"SW - #291 - 2023-06-15 - Heather Pollington - The Art Behind 'Snow White and the Widow Queen'","start":2294.57,"end":2295.13,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #291 - 2023-06-15 - Heather Pollington - The Art Behind 'Snow White and the Widow Queen'","start":2295.29,"end":2341.01,"speaker":"Heather Pollington","text":"So, yeah, that. That was a. That was a really fun thing to. To kind of weave through it. These are a couple that kind of look. Look nicely together. And the one on the left is the death of the king. And the reason I'm showing this is because there's been a lot of chat recently about, you know, fatherlessness. And. And so I really wanted this one. Like, it's framed by the death of the king, and in the middle is Snow White, looking so vulnerable, and she's obviously playing with. With a ball that is the same as the fruit on the tree. And so. And then up above, we can see the queen with the hunter. So again, they're in silhouette. So. So. But yeah, it's. It's one of my favorites, actually."}
{"episode_id":"SW - #291 - 2023-06-15 - Heather Pollington - The Art Behind 'Snow White and the Widow Queen'","start":2341.73,"end":2342.37,"speaker":"Jonathan Pageau","text":"Wonderful."}
{"episode_id":"SW - #291 - 2023-06-15 - Heather Pollington - The Art Behind 'Snow White and the Widow Queen'","start":2342.77,"end":2357.89,"speaker":"Heather Pollington","text":"And on the one on the right is a prince. And I've got to admit, that was my little indulgence. I just wanted to draw a prince. I think you kind of let me get away with that. It wasn't really kind of the story really called for. And I was."}
{"episode_id":"SW - #291 - 2023-06-15 - Heather Pollington - The Art Behind 'Snow White and the Widow Queen'","start":2358.45,"end":2374.21,"speaker":"Jonathan Pageau","text":"It's like, this is the portrait of the prince. It's perfect. Right. Even though in the story we don't talk about it that way, but it's like. Like I said, you know, if you're going to represent the prince and you want him to have presence and a kind of regal quality, you know, having him on the horse is the best way to do it. So it was a perfect choice."}
{"episode_id":"SW - #291 - 2023-06-15 - Heather Pollington - The Art Behind 'Snow White and the Widow Queen'","start":2374.45,"end":2376.69,"speaker":"Heather Pollington","text":"Yeah, you let me have that one."}
{"episode_id":"SW - #291 - 2023-06-15 - Heather Pollington - The Art Behind 'Snow White and the Widow Queen'","start":2376.69,"end":2378.77,"speaker":"Jonathan Pageau","text":"Yeah. And I was very happy with that."}
{"episode_id":"SW - #291 - 2023-06-15 - Heather Pollington - The Art Behind 'Snow White and the Widow Queen'","start":2379.41,"end":2417.62,"speaker":"Heather Pollington","text":"Okay, so this is a double page spread of the palace. So this is a nice example of, you know, lots of things going on, you know, multiple activities going on in one. In one frame, we see the prince meeting Snow White. By the time he leaves, he's in silhouette against the rosy dawn. I think the main thing to say about this one is it's really, really influenced by the. The ivories. You know, the first drawing I did was. Was literally just in. In ivory, a line drawing. And. And this is it kind of colored up. But yeah, I Think it was the first one I did as well, wasn't it?"}
{"episode_id":"SW - #291 - 2023-06-15 - Heather Pollington - The Art Behind 'Snow White and the Widow Queen'","start":2417.62,"end":2423.46,"speaker":"Jonathan Pageau","text":"I think it was. I think it was because it was also very complex and we wanted to do a lot in the image."}
{"episode_id":"SW - #291 - 2023-06-15 - Heather Pollington - The Art Behind 'Snow White and the Widow Queen'","start":2424.04,"end":2424.32,"speaker":"Heather Pollington","text":"Yeah."}
{"episode_id":"SW - #291 - 2023-06-15 - Heather Pollington - The Art Behind 'Snow White and the Widow Queen'","start":2424.32,"end":2438.12,"speaker":"Jonathan Pageau","text":"In some ways it's the one that looks the most like almost like a medieval illumination, you know, because of how. How it's split in two with the colors and, you know, it's a flat architectural motif with characters inside the windows."}
{"episode_id":"SW - #291 - 2023-06-15 - Heather Pollington - The Art Behind 'Snow White and the Widow Queen'","start":2438.36,"end":2442.52,"speaker":"Heather Pollington","text":"Very theatrical as well. I mean, it's like. I think of it as a stage set. This one."}
{"episode_id":"SW - #291 - 2023-06-15 - Heather Pollington - The Art Behind 'Snow White and the Widow Queen'","start":2442.6,"end":2451.88,"speaker":"Jonathan Pageau","text":"Yeah, that's one of the ones also that I kind of worked hard on. I did designs of it myself with. With someone else trying to kind of figure out how to do it in a way that makes sense."}
{"episode_id":"SW - #291 - 2023-06-15 - Heather Pollington - The Art Behind 'Snow White and the Widow Queen'","start":2452.44,"end":2493.28,"speaker":"Heather Pollington","text":"Yeah, yeah. Inherited quite a lot from me on that one with the, you know, like the gargoyles and the angel and everything. It was really nice details. Next one I'm showing is. It's the woodland scene. So all of the palace illustrations are quite formalized and I knew that once we got into the woods it had to get a bit wilder. The, the reference on the top is. Was my main touch point for the, for the woods because I just knew like, as soon as I read it I was like, the. The trees are going to make our frame. So this is a, like first sketch that I did and then this is it colored up."}
{"episode_id":"SW - #291 - 2023-06-15 - Heather Pollington - The Art Behind 'Snow White and the Widow Queen'","start":2493.52,"end":2510.02,"speaker":"Jonathan Pageau","text":"But it was such a good idea to move from architectural framing and then keep the framing aspect but use trees to do it. It's a very simple, intuitive change, but it, it really marks a transition between like into the wilderness and into the. The wilds of the woods."}
{"episode_id":"SW - #291 - 2023-06-15 - Heather Pollington - The Art Behind 'Snow White and the Widow Queen'","start":2510.42,"end":2539.63,"speaker":"Heather Pollington","text":"Yeah. So we can see the hunter there. And there was very much a, you know, a sense of that kind of downward path that she was going, that she's going down into the dwarf's house. And then in the text it says a quirky house stood there, a strangely childlike house. So, yeah, really wanted to make it look, you know, tiny and strange and obviously. Yeah. As you can see, there's silhouettes of animals. The hunter. I really like the character of the hunter."}
{"episode_id":"SW - #291 - 2023-06-15 - Heather Pollington - The Art Behind 'Snow White and the Widow Queen'","start":2539.63,"end":2540.19,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #291 - 2023-06-15 - Heather Pollington - The Art Behind 'Snow White and the Widow Queen'","start":2540.19,"end":2541.71,"speaker":"Heather Pollington","text":"Pretty fierce looking, isn't he?"}
{"episode_id":"SW - #291 - 2023-06-15 - Heather Pollington - The Art Behind 'Snow White and the Widow Queen'","start":2541.79,"end":2542.67,"speaker":"Jonathan Pageau","text":"Yeah, definitely."}
{"episode_id":"SW - #291 - 2023-06-15 - Heather Pollington - The Art Behind 'Snow White and the Widow Queen'","start":2543.39,"end":2584.28,"speaker":"Heather Pollington","text":"But, yeah, anyway, Going on. Yeah. So this is Snow White in the cottage and she's eating at the doors table. And with the. I mean, this one, I just kind of just saw it in my head. I didn't really know like formally whether it was going to work, but it was definitely influenced by seeing those roof bosses with the kind of. No, you've got like two perspectives I was, I drew her and then I was just like, I'm just going to flatten out that table because it's. I know that you said to me the whole scene in the dwarves cottages was all about, you know, what was it? Pointless repetition or cycles."}
{"episode_id":"SW - #291 - 2023-06-15 - Heather Pollington - The Art Behind 'Snow White and the Widow Queen'","start":2584.36,"end":2672.93,"speaker":"Jonathan Pageau","text":"Yeah, well, it's always, It's. It's as if she's, you know, the idea is that Snow White, you know, part of the, part of what Snow White is, is of course, the transition of a young girl into womanhood. And one of the things that it seems to show is that when Snow White, you know, makes that transition, she falls into a space where she's in contact with all these, you could say, let's say, unacceptable mates is the good way to understand it. So she's dealing with like all these quirky, idiosyncratic old men, basically, or that don't. That can't be her. Her husband, that can't be, you know, her. Can't join with her. And so. And then she learns to clean and cook and stuff. And so she has all the negative aspects of what it is to be a woman, let's say, traditionally. So she, she's with all these, you know, like these old men that don't. That. That are like quirky aspects of what Machin is. And then she's cleaning and cooking and so she needs to find her prince. Like, she needs to find the reason why she's going through this transition in the first place. And you can understand that also just in general, like a woman's body changing and at first having to deal with this cycle. And like, what is this thing, like, what is this painful, annoying thing that I have to deal with all the time? What's the reason for it? And then ultimately realizing in marriage and in. And in child and in having children that that's. Oh, that's the reason, like, this is in some ways what this is for. So that's what we wanted to suggest in that part of the story."}
{"episode_id":"SW - #291 - 2023-06-15 - Heather Pollington - The Art Behind 'Snow White and the Widow Queen'","start":2673.57,"end":2726.94,"speaker":"Heather Pollington","text":"Yeah, I think. Yeah. So I definitely wanted to use lots of circular motifs. And also all the illustrations in the Dwarves cottage feel much more kind of psychological to me for some reason. You know, like, there's a. There's a transformation happening and it's much. It's much less figurative and naturalistic. So this is the illustration of the Dwarves house. And again, it was, you know, it's like a doll's house, basically. I've always loved illustrations of houses where the front's taken off and you can see in all the little rooms. So again, there's a lot of circular motifs and there's the dwarves. I didn't really emphasize the idiosyncrasy of the dwarves, of their kind of like a. A unit, if you know what I mean. Yeah, that seemed right for some reason because we were having such emphasis on her. And so, yeah, I think it's."}
{"episode_id":"SW - #291 - 2023-06-15 - Heather Pollington - The Art Behind 'Snow White and the Widow Queen'","start":2726.94,"end":2731.42,"speaker":"Jonathan Pageau","text":"I think it's perfect. And then you kind of see them going up there with their. Their clubs and their knives."}
{"episode_id":"SW - #291 - 2023-06-15 - Heather Pollington - The Art Behind 'Snow White and the Widow Queen'","start":2732.38,"end":2747.82,"speaker":"Heather Pollington","text":"Yeah, that's great. Yeah, yeah. And here's a couple of illustrations from the end. So here's the witch we've already seen with the apple, and then Snow White after she's eaten the apple."}
{"episode_id":"SW - #291 - 2023-06-15 - Heather Pollington - The Art Behind 'Snow White and the Widow Queen'","start":2748.63,"end":2794.88,"speaker":"Jonathan Pageau","text":"And, you know, and very simple choices that are. That are intuitively right to have the, you know, the architecture now grown over with thorns and, you know, the. Obviously the crack mirror and all of these images and having also the, you know, the. The. In the beginning, when Snow White enters into the dwarf's house, you have all these cobwebs and there's like this unsettled aspect of what she's going through and what she. It's like things haven't settled yet. She hasn't found the reason. And so the cobwebs appear at the. At the dinner table and then they appear again here in the. In this kind of moment where the witch is losing control. I could say. We could say. Or kind of devolving into. Into kind of obsessive madness."}
{"episode_id":"SW - #291 - 2023-06-15 - Heather Pollington - The Art Behind 'Snow White and the Widow Queen'","start":2795.68,"end":2802.08,"speaker":"Heather Pollington","text":"Yeah, yeah, that's it, actually, because I've. I think we need to leave some."}
{"episode_id":"SW - #291 - 2023-06-15 - Heather Pollington - The Art Behind 'Snow White and the Widow Queen'","start":2802.24,"end":2804,"speaker":"Jonathan Pageau","text":"Well, of course you can't show all the."}
{"episode_id":"SW - #291 - 2023-06-15 - Heather Pollington - The Art Behind 'Snow White and the Widow Queen'","start":2804.24,"end":2833.66,"speaker":"Heather Pollington","text":"Show all of them, but yeah, there is a lot of things hidden in the illustrations and I really hope people will be interested to buy it and. And find more. This is just to show. This is going to be the frontispiece. This is like a drawing I'm doing at the moment. It's kind of work in progress. That'll be at the front of the book. Yeah. And this is. Yeah, this is our Kickstarter campaign. Basically, a couple of images from there we're going to have."}
{"episode_id":"SW - #291 - 2023-06-15 - Heather Pollington - The Art Behind 'Snow White and the Widow Queen'","start":2833.74,"end":2984.89,"speaker":"Jonathan Pageau","text":"The idea is we're really going to. So we're trying. The way we're doing the Kickstarter was really first of all to try to make it accessible to everyone who would like to get it. So, you know, the first prices are quite reasonable. But then we realized, like, we're really doing it, making a treasure here. Like, we're really making something that is quite unusual at this time to make something so celebrate. Celebratory, so ornamental. Like unapologetically, you know, diving into all these patterns and stuff. So we thought we need also to give people the opportunity to really jump in and go crazy. And so the, you know, the highest tiers have a leather bound book with like, with actual little jewels on the corners. And, and we're having. I'm also doing a very complex illustration of the scene where Snow White receives the apple from the queen, you know, and I'm doing all these details very similar, of course, to the way that Heather did it, because that's also my go to. Right. Is to think in medieval style, to have everything compress into an image. So I'm also making one and we're doing all kinds of stuff. We're having, we're gonna have pins and it's gonna be really. For people who are interested in it. Like they can really jump in and have a lot of fun with this Kickstarter. So we're definitely. I think you'll see how excited we are about this project when you see everything that we're putting into this Kickstarter. So this is really the beginning, to be honest. This is the first book. We're going to do eight books in all that are going to take the same approach to storytelling. But as you notice, as the stories continue, they will accumulate references and there'll be crossover of characters and you'll see the fairy tale world kind of come alive and start to make sense more and more to you and the. I've already written four of the fairy tales. I still have a few to write and Heather has agreed to work as artistic director on the whole series. And so we're going to have a through line. It's going to be coherent and, and visually powerful and we have great illustrators in line to do this. So it's going to be really wonderful. This is honestly the most. The thing that excites me the most about my work at this time is is this fairy tale series and also starting the symbolic world press so that we can do this and we can continue to do this. So. And so. Yeah. So, Heather, thanks for taking such a. In some ways it's a big risk for you to do something like this. And so we definitely appreciate the amount of time and energy you put into this."}
{"episode_id":"SW - #291 - 2023-06-15 - Heather Pollington - The Art Behind 'Snow White and the Widow Queen'","start":2984.97,"end":2990.65,"speaker":"Heather Pollington","text":"Oh, it's been brilliant. I've really loved it and yeah, I hope. Yeah, I can't wait to see it printed."}
{"episode_id":"SW - #291 - 2023-06-15 - Heather Pollington - The Art Behind 'Snow White and the Widow Queen'","start":2991.05,"end":3041.76,"speaker":"Jonathan Pageau","text":"So everybody go to the Kickstarter page. You'll see the link in the description. This might not be. We might not have started yet if not you can sign up to get reminders when we're starting. And if we've already started the Kickstarter, then please back it, share it to your friends and everything, because we think it's a watershed moment. It's time to re celebrate our stories. It's time to do it unapologetically and in a way also that is going to bring more insight to what these stories are about. Not just naively, you know, not just innocently, but to take some of the knowledge that has been unearthed in the postmodern tropes, but then apply it to a higher good. So thanks everybody, for paying attention to us. I hope you're as excited as we are, and we'll talk to you very soon."}
