{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":12.48,"end":15.92,"speaker":"Jonathan Pageau","text":"This is Jonathan Peugeot. Welcome to the symbolic world."}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":26.17,"end":26.97,"speaker":"John Vervaeke","text":"Right, here we go."}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":28.57,"end":35.61,"speaker":"Paul Vander Klay","text":"Welcome. I don't know who's. I don't know who greets, who hosts or anything. I had some thoughts, so I'm gonna jump right in."}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":36.57,"end":37.13,"speaker":"John Vervaeke","text":"This is."}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":37.29,"end":48.25,"speaker":"Paul Vander Klay","text":"This is. I think in some ways this is a little bit of consolation for the fact that we can't meet this September in Thunder Bay."}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":48.73,"end":49.21,"speaker":"John Vervaeke","text":"Yeah."}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":49.53,"end":81.11,"speaker":"Paul Vander Klay","text":"And, you know, my. My hat's off to Urban Abbey and their desire to put this together. And I really hope that next year we'll have the ability to do this right. And I hope that nothing. I hope that what we do today adds to the anticipation. And actually, in my experience with conversations, the more we talk together, the better our conversations will get because we know each other better."}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":81.59,"end":92.79,"speaker":"John Vervaeke","text":"Yeah. Thank you for saying that, Paul, and thank you for welcoming us here. I hope I can get a copy of these files because I want to upload it on my channel as well."}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":95.67,"end":97.91,"speaker":"Paul Vander Klay","text":"I will send it out today right after we're done."}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":98.39,"end":107.6,"speaker":"John Vervaeke","text":"Great. And Jonathan, as always, it's great to see you as well, Paul. I hope that things have stabilized for you a bit. You're in my thoughts."}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":107.76,"end":132.32,"speaker":"Paul Vander Klay","text":"Well, thank you. No, it's been, you know, with COVID and that impact on the church. And so I've just been trying to launch some new initiatives. And, you know, I have this day job, which people often don't recognize, but it's a real day job. And so when things get a little crazy, things get a little crazy. So YouTube comes second."}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":134.51,"end":139.87,"speaker":"Jonathan Pageau","text":"I haven't been following, I guess, the situation. Are you having some issues at the church with."}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":141.47,"end":235.25,"speaker":"Paul Vander Klay","text":"Yeah, you know, it's Covid craziness. Well, I think a lot of it is, you know, California is locked down. Who knows for how long? And so I think some of the older members of the church are who live at a distance, especially widows. I mean, their children. Mom, you shouldn't drive that far to that church. And so what will emerge after Covid is difficult to know. So I've been. I announced two new efforts which really aren't any different from. Really aren't a lot different from what I've been doing. One is to continue to help the church connect better online as church, but then Also more my YouTube channel, which I call Estuary, which is much more a place where it's similar to what we've been doing with our Jordan Peterson meetup. It's just a place for outside the walls of the church. I use your icon of everything often, Jonathan, in this because it's Estuary sort of Outside the wall. A church needs a place for its flow to go. And so that's what I've been doing and. But it's going fine and I'm doing well. It's exciting, but yeah, we'll see what happens. I thought we might begin by. I'd like to hear from both of you. We've sort of been cast together."}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":237.97,"end":238.85,"speaker":"John Vervaeke","text":"Drawn together."}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":239.17,"end":255.1,"speaker":"Paul Vander Klay","text":"Drawn together. And we're a strange trio. And I'd like to hear from both of you where things are at with you and why this conversation now."}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":257.1,"end":475.76,"speaker":"John Vervaeke","text":"Okay, well, I'll go first. I really like what you sent in the email, Paul. I thought that was excellent. I was proposing some general topics. I'm really interested in the emerging discussion about the relationship between symbolism and the cultivation of wisdom. And that weaves through both of your work in pretty important ways. But I don't know if that's ever been explicit a topic of discussion. But then you did something I thought was very good, Paul. You pointed out that there's this emerging realization which I completely agree with and I think I'm exemplifying the thing you're pointing to that sense making, meaning making wisdom cultivation is not. It's insufficient to just have a personal philosophy or an individual practice. One needs community and ultimately that community needs culture. And so I see you guys having traditions that are worthy of entering into dialogue with about that. I'm engaged in that process right now. And that was motivated by a criticism that Jonathan made that I took to heart because I love both you guys and I care about what you have to say and I take it seriously. And so Jonathan made the point about, you know, well, John does all these sort of individual, I think you call them mystical practices, but there isn't that. So I've launched this whole project of dialectic and dialogos. And Paul, you're contributing to that anthology and then also building community, building the Sangha, the morning community around the meditation and contemplation. Now we're going through the Western wisdom traditions, Epicureanism, Stoicism, Neoplatonism, and then the Discord server and then meeting with like was at the movement summit and all these emerging communities of practices. I mean that was just an impressive summit. All these emerging communities and practices and you know, and how they're all responding to the meeting crisis. And there's this desire to network together and build a culture. And I've sort of been building this sort of somewhat a little bit tongue in cheek, but you know this slogan, Akira the dawn. Did, you know, steal the culture. We did a meeting wave around it and that whole idea. So I want to talk to you guys about that because I think, well, Jonathan made the criticism, I respond to it. And then, Paul, you've made also a criticism that I've taken to heart, the scalability issue and then the issue about that there's value to. And you use this term so it's not pejorative, the slowness of traditional. That there's a value to that. And so I take that, all of those points seriously. And then, like I said, I think that is enmeshed up with this ongoing discussion that's emerging. It's actually a pretty significant discussion on my Discord server community about Jonathan, about the relationship of the symbolic way, you know, the symbolic mode of cognition. And is that a way of knowing? Is it more properly understood as something that affords understanding and wisdom? So that's also something that people are wanting to bring in discussion in connection with the project of community building. And I take it that that's not a coincidence. So that's what I'm interested in, and that's what I want to. That's what I would like to bring into discussion right now."}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":478.49,"end":547.52,"speaker":"Jonathan Pageau","text":"Yeah, I think that the continuation of this moment in terms of recognizing the meaning crisis and the fact that it's accelerating to a certain extent in terms of this year, I mean, we kind of. If you would have asked me when I thought it would be accelerated, I would have known it was 2020 because I mentioned it before, just because of the election, because of what happened in 2016. Similar things happen. And that's what launched this thing, like in 2016. That's when Jordan appeared on the horizon. And it was in relationship to what was going on. These crazy protests were happening, not as bad as now, but it was similar in terms of a kind of accentuation of this kind of meaning crisis. And so it's not surprising that right now it's ramping up again and it's ramping up even more. And there's Covid has also added a whole layer which brings it into our body that we talked about, John and I, in our last discussion. And I've had a lot of people really appreciate our last discussion, by the way. A lot of people really, really appreciate."}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":547.52,"end":550.68,"speaker":"John Vervaeke","text":"Yeah, I did, too. Thank you for that, Jonathan."}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":551.08,"end":599.55,"speaker":"Jonathan Pageau","text":"And so I think that it really is a moment where we need to continue to examine what's happening and try to propose the little solutions we can and propose ways of being that can avoid the polarization that is kind of manifesting itself. And so in that sense, that's what I see as the continuation of this discussion. And I think. But also I think, of course, the whole idea to me, the central question and the question I think which most interests me and mostly I think needs to be worked out and played out, is the question of emergence. The relationship between emergence or the relationship between the bottom up and the top down."}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":599.63,"end":600.11,"speaker":"John Vervaeke","text":"Yeah."}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":600.83,"end":672.28,"speaker":"Jonathan Pageau","text":"In terms of understanding how reality works itself out, that to me is the biggest question in always trying to work through ways to talk about it, to think about it more and to make it more, to be. Make it clearer. And so that's really what fascinates me with this discussion and also the access that, John, you give us to COGSCI and to other elements which weren't part of our, like, part of my vocabulary at least, and weren't part of my horizon. And so it's actually adding a lot of breadth to, let's say, breadth to my thinking. And I find, like, I think I mentioned this every time I talk to you, but I always find myself, you know, I talked to this group of Jungian psychologists, the Assisi Foundation. They invited me to do a conference, and it just. I found myself using your terms because in that context, these are the right terms to use. You know, if I use just Christian terms in that context, some of them won't even understand what I'm talking about. But if I talk about combinatorial explosion, then they're like, they. Then they kind of understand where I'm going in terms of the problem of emergence."}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":673.64,"end":714.68,"speaker":"John Vervaeke","text":"One of the great joys of my work has been exactly what you said, that people are finding the conceptual vocabulary and the theoretical grammar affording to them. That brings me a lot of happiness knowing that I've been able to help people that way. And I think it's valuable that even if people disagree with me on some central points, and both of you do in different ways, you nevertheless can take my work up in a way that is affording the good work that you guys are doing. So that pleases me quite deeply. So thank you for sharing that."}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":715.08,"end":732.55,"speaker":"Jonathan Pageau","text":"And Paul, I was excited to see some crossover between our kind of crews or whatever. One of the people who's really involved in the symbolic world discussion, I think, hosted a. An event on your Discord server. And so I wasn't mass, sadly, wasn't able to attend, but I was just happy to see that happening."}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":733.43,"end":791.35,"speaker":"Paul Vander Klay","text":"Well, I think one of the things that all of our work, and I'm perhaps as the Protestant coming late to the party is the recognition of the continued breakdown of the modern liberal consensus as the unifying sense making. Something which had a particular take on science and what we talk about as science in our culture. And I see that as it's been interesting because both of you have shown me from different ways. Again, I think Jonathan, you're right, it's kind of the emergence and the emanation have shown me from different ways how the sense making consensus is breaking down. And of course, as I think we."}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":791.35,"end":791.67,"speaker":"John Vervaeke","text":"Saw."}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":793.83,"end":916.54,"speaker":"Paul Vander Klay","text":"In the, you know, the Protestant Reformation was a breakdown of an institutional authority and a sense making consensus which led to the Enlightenment and all of this new paradigm. Now as I think we see the, the continued recession of the new paradigm which is ironically also fueled by science. Because a lot of what I've learned from you, John, and from having watched Jordan Peterson who kind of sparked it, is that there are scientific reasons for the breakdown of the old paradigm. And Jonathan Pigeot coming along and saying quite clearly, I don't think anyone would understand my channel in if the recession hadn't in a sense exposed so much beach. And so now we're beginning to see some very old things that were beneath the surface. And that then brings us into the question because communities require and I've been listening to Stephen Smith who wrote a very interesting book, Pagans and Christians in the City that look at basically the breakdown of the sense making of late antiquity and the coming out of Christianity in that period. And I think we're in again one of those moments. But each community that has stakes just with the breakdown of Christendom. Christians of course, resisted, resisted, resisted. But while you're resisting, you're also accommodating and that then leads to the next paradigm. So it's very interesting to watch both of you because in some ways you're both seeing the breakdown and seeking new communities and a new consensus. But Jonathan, sort of from the ancient and John from the scientific modern, it's been fascinating to have both watch both of you in this process."}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":917.89,"end":1209.69,"speaker":"John Vervaeke","text":"Well, I hope Jonathan feels that as a scientist I'm also deeply respectful and informed by the ancient. I mean, so the Neoplatonic and Socratic traditions as well as the Christian and Buddhist and Taoist traditions have deep influence on me. But I like the way you position things, Paul. I think it's a fair, I think what's interesting because I think this, this might be one of those issues that is scalable in the way you've been talking about Paul, because I see at the highest levels of both theology and metaphysics, even within an academic arena. I see people really wrestling with these issues now of emergence and emanation at a high metaphysical level. And you can even see it in the science. Quantum theory is very much about how things emerge upward. And then relativity theory is very much about how the cosmological emanates down and curves and shapes things. So this grammar of emergence and emanation, it's pervasive in a lot of the work that's happening in even formal ontology in science. But I think you're right when you say, because you wrote it in your email, one of the burning issues now is what's the relationship between these emerging communities, these emerging rituals, these emerging psycho technologies, to use my term, and the established traditions. It's interesting that Christianity now finds itself on the other side of that dynamic. So I take the analogy to late antiquity to be a good one, where Christianity is the new kid on the block and facing the at times trenchant conservatism of paganism and then the dialogue that went there. But now Christianity is on the other side, it seems to me, at least historically. And so I'm wondering, like, we've got to pay attention to that analogy, but we've got to get the analogy the right way too. And so it's a tricky question to ask. And so, I mean, I've been trying to, you know, because of what you guys both said. Again, I take what you say seriously. Providing the grammar and the vocabulary is really important and empowering. That's why I've been doing a lot of work on this notion of the practice of dialectic and how it engenders dialogos as a way of moving us out of oppositional into a point of processing discourse in which emergence is a sought after feature of the dialogue. But also, Jonathan, I've been having discussions with JP about this. JP Morceau, can we situate that practice into a metaphysical dialectic? Again, I think there is precedent both within Neoplatonism, the pagan tradition, but also clearly, you know, Erigina Maximus, right, within the Christian tradition, at least the Eastern Orthodox Christian tradition, for a dialectical metaphysics. And so, like I said, it seems that I'm trying to find that as a potential place where practice and metaphysics can properly start to resonate with each other. That's the project I've been engaging in to try and address this issue about how can we get the emergence of the emanation. I'm saying that, as you said, Christianity, the tradition emanates. It emanates the Constraints of possibility. The paradigm is emanated into the culture, if you'll allow me that. And so that's what I've been trying to do to various degrees of failure and success about trying to recapture the ancient Socratic and Neoplatonic practices of dialectic and then put them into discourse with all these emerging discourse modalities. You guys, both of you, I think, have met Guy Senstock, the circling modalities, and Peter Lindbergh and the anti debate modalities and the insight dialect. The number of these, even in the anthologies, the number of these things is growing. And I think there's good reason for that. I think there's a deep emerging understanding that we need to commune, and I use that word specifically, we need to learn how to commune with each other together again in a powerful way if we're going to get the kind of right relationship between emanation and emergence. At least that's, that's what I'm proposing. I'm proposing to the two of you. I want to hear what you think about that and how you want to respond to that."}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":1211.61,"end":1448.53,"speaker":"Jonathan Pageau","text":"Well, I mean, I think that I feel like right now I feel like we're just going to go over the same elements of our discussion we always go over, which is fine because we haven't worked through them. To me, I think the element which I find that is that will, the element that I think will prevent this from completely consolidating is the narrative is the lack of narrative. And I know that you talk about a post narrative possibility. The difficulty is that there is a narrative that is we're going through it right now, right? All the protests in the US Are a narrative that we're burning in the narrative, right? It's running through our society and there's competing narratives and there's a fight between the narrative. One of the reasons why there's a fight is that the narrative has come down to the strictly political level of narrative, right? And so let's say Christians, what Christians had, and what I think they still do have is they have an eschatological narrative. That is, they have a narrative which is understood as this playing out of history at a grand, grand scale. We're part of a story. And of course, the early Christians thought like it was imminent, and the lay Christians think that it's imminent. It's also actually part of the narrative to think that it's imminent because it ends up being a driving force towards behavior, like a driving force towards the manner in which we engage with what's here that it's on the one hand pressing, on the other hand temporary. And we're looking towards a, let's say, a goal of manifesting that which is beyond history, but we're doing it within history. And so there. So what I think that's the. I think that if we don't recapture narrative, then we're going to be a slave of narrative or we're going to be eaten up by the narrative that brought about the world wars in 20th century and that are playing out in similar fashion today. And the narrative is. It's exactly the problem that we're talking about that is the two sides are a. They're the same sides. They're the same sides as the question, because there's one side which is a bottom up side which is, which looks in its diseased way, it looks like communism looks like revolution, looks like, let's say, kind of equalizing of everything. And then there's another side which is a top down version of the disease, which is a clampdown, enforced hierarchy, enforced identity, enforced structures, enforced state, mass, state, mass control, all of the. And so the two narratives are an image of the very problem of the meaning crisis, which is how to join together the bottom up and the top down in a communal manner rather than a battle between two sides of a story. And so that's why I think that. I think that although I really appreciate the practices and I think that the direction people are going and the questions they're asking, they're all the right questions and they're the kind of people that I want to talk to, let's say it that way, because I feel like they're in the right mindset and everything. But we also can't ignore that the world is on a collision course again and that it's very difficult to. We can't just like, I don't know, I'm not saying I'm not even a very political person, I'm not involved politically. But I also realize that it's a narrative fight that we're seeing."}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":1449.74,"end":1536.24,"speaker":"Paul Vander Klay","text":"I wonder if for the sake of our listeners, because I remember the talk you two had before last. We get pretty esoteric here. I wonder if you might flesh out a little bit what you mean by eminence, what you mean by emergence. Because you're right, Jonathan. And as watching both of your materials and thinking about this, it's in some ways the, the structure of our conversation has developed. And so on my last video, Strachan is kind of my always watching John and always sending me clips did you see this one? Did you see this one? So I wonder if for the sake of our audience, you could sketch out a little bit what you mean by emergence, what we mean by eminence, and then where is the conflict, or at least not the conflict, but where is the fold in this conversation with respect to narrative? Because I think with the non theism and theism with a system which is not necessarily bound to telos versus narrative which is energized by telos. I wonder if you guys could flesh that out a little bit for the audience lest we lose them right away."}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":1536.8,"end":2114.96,"speaker":"John Vervaeke","text":"Yeah. So thank you, Paul. Let's do that. Let's keep our audience with us because we want as many companions on the way as possible. So I'll try from. I won't claim to be exhaustive because Jonathan will have a take on this. I'll speak from sort of a cog sized scientific perspective about how these terms are being used and then my particular take on them and then I'll say something about narrative that maybe will be a bit of moving towards closing the gap between us and this a bit because of a discussion with Strawn, actually. So on the Discord server you might be alluding to that. So emergence is an issue in cogsci. It's one of the ways in which where it came to the fore initially. And Jonathan will be. And Paul, you'll probably be interested in this too, is around of course, the discussion of consciousness. I don't want to get into a debate about consciousness here. I'm just using this. This is a historical point I'm making. I'm not making a substantial point right now. I'm doing that elsewhere. Okay, but here for us. And the idea was, well, because many people have rejected dualism, the sort of Cartesian position of mind, and many people had come to reject a reductive physicalism that it's sort of just sort of the properties of matter as given by physics that you could reduce consciousness to that many people started talking about the fact first that there is emergence, the idea and the standard MA analogy, and it's strong as an analogy, but also very weak as an analogy is. I have hydrogen, it's a gas, I have oxygen, it's a gas. But when they interact together you get water. And water has emergent properties. It has properties that neither hydrogen nor oxygen have. It's wet, it's a liquid, it's consumable, it's nutritious to us in a way that oxygen, but hydrogen isn't, etc. Etc. Or the way sodium and chloride are both poisons, but when you put them together, you get salt, which is a nutritious. So you get the idea of, from the parts, you get a whole of some kind that has new properties, new ways of interacting with the world that are not found in the parts that's emergence. And then people started to realize that that's not just a case about consciousness, it's a case about life. It's also a case about knowledge. This is an argument that I make. It can't all be. We can't say that the only thing that's real is the bottom level. Because if that's the only thing that's real, then the dial that I'm using to read my equipment to tell me about the quantum particles isn't real. And that means the knowledge isn't real. And I take it as this, that if I'm claiming X is real, then I'm required to claim that, that my knowledge of X is real and therefore the gauge is real and the information is real. So I've been arguing that emergence is a much more comprehensive. That's why I keep saying I'm not a reductive physicalist, right? I'm not a reductive physicalist. So emergence is this. But as that's been happening, people have been noticing. Yes, but we have to talk this emergence isn't this word gets used periodically, isn't willy nilly, it doesn't just, you know, there are constraints on it. So while there are enabling constraints like hydrogen and oxygen coming together to make water, there's also the idea. But there must be principles that constrain the patterns of emergence that we reliably see. Because this emergence continues to be intelligibly like, it continues to produce intelligible patterns for us. And so more and more people talk about, well, there must be sets of what are called selective constraints that are sort of really existing. And notice, I've also argued we have to change the meaning of possibility. Real possibilities, real constraints that shape what's probable for us. So that of all of the ways things could emerge, this kind of water emerges out of hydrogen and oxygen, et cetera, right? And so, and like I said, you can see this ribbon through the metaphysics of physics, the project of trying to get quantum, which is about bottom up emergence, and relativity, which is about top down emanation. Because what is relativity? It's not an event, relativity isn't an event, it's a set of constraints on what is possible in the universe. So even science is therefore Caught in having to acknowledge both emergence and emanation and facing tremendous conceptual difficulty. Physics has been. This gets me into trouble every time I say this. Physics has been sort of moribund theoretically for a long time. If you want a place where theory is really hot in science, go to biology, physics. Well, they keep generating theories. Yeah, they keep generating theories that fall apart to try and bring these two together. Now, not everybody will come to what I'm going to say, but I'm not alone in saying that I suspect there's some deep conceptual difficulty that is preventing the reconciliation of those two. And I think something more, in a cunian sense, something more of a paradigmatic shift has to be brought in to resolve that in physics. And then I think that has to be consistent and coherent with all these other places where the emergence and the emanation in biology, in cognitive science about consciousness, it has. There's a grand multi nested reconciliation between emergence and emanation that is needed. Now I take Jonathan's point because I always take your point seriously about narrative. And Straw proposed to me that the practices of dialectic are narrative, but in a new kind. And I had a really interesting discussion with James Karst, the guy who wrote the Religious Case Against Belief on the Stoa, because he wrote the book Finite and Infinite Games and he distinguishes between a finite game that is played to completion and an infinite game that is played for continuance. And he said that we have to. And what Schram proposed to me is that there is a kind of narrative that's in conversation, but it's not the narrative of a finite game. And then I took this up with James. It's the narrative of an infinite game. It's where the point of the narrative is constantly to try and change the rules by which you're playing out the narrative. So the conversation is supposed to be open ended in an important fashion. And so I'm again, I don't know if I take very seriously the postmodern critique of there's no metanarrative. But I am coming to think that there is something at least like narrative or trans narrative in a dialectic practice. Especially if it can fit into a worldview that reconciles in that nested way emergence and emanation together. So we don't just talk about it. If you and I, Paul, could enact the coming together of emergence emanation within an open ended dialectic and then that is an enacted symbol of the way the logos of the universe unfolds. Is that narrative? I don't know but it feels very symbolic and it feels like it's got a progression to it that you guys seem to want in narrative, but it's not a typical narrative. So that's what I have to say about that. One more point on this. The bottom up and the top down, that's for me, relevance realization. The bottom up is the generation of variation, the enabling constraints. The top down is the selection, et cetera. And that's how you get the ongoing evolution of relevance realization. So I think the machinery of relevance realization and the machinery of the intelligibility of things that's found in the reconciliation of emergence and emanation, I think they are deeply at one with each other. And that goes again to something I got from Jonathan, the idea that I've started to see in both some of the great poets and in some of the Neoplatonic literature, that there is a deep analogy between how my cognition is doing relevance realization and taking the combinatorial explosion indeterminacy and bringing it into selective determination and the way the universe as a whole has got some principle that is moving between indeterminacy and determination. Again, I listened to Jonathan and so I think enacting that, is that a narrative? I don't know, but it's something at least symbolic and conversational and perhaps that's moving a little bit towards your guys position. So that's where things are at for me right now. I don't know if that's helpful or if it's disruptive, but that's my take on what you asked for, Paul."}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":2115.44,"end":2116.32,"speaker":"Paul Vander Klay","text":"That was helpful."}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":2118,"end":2439.11,"speaker":"Jonathan Pageau","text":"Yeah, I mean, I think one of the great things about talking with John is to what extent I feel like he really does see that. He sees the things that I'm trying to talk about and he has good words for them. And so of course I come from it less in terms of the scientific sense. I see it more within the human horizon, let's say. And so I tend to use. My analogies tend to be more related to notions of emergence in terms of the person and how we are constituted, how we're constituted of many parts and how the manner in which those the unity of our being and the multiplicity of our being are joined together. And I tend to see that scale up from the parts of a person into a community, into larger communities. And ultimately I see that there is the connection between the Cogsci version, the relevance realization and the, let's say the communal version to me is completely linked together because we don't have. This is something I Say all the time. There is no other perspective. We don't have another perspective besides the perspective of the first person within consciousness. Perspective we are. And so science ends up fitting, let's say fitting into the bigger. The bigger pattern for me is not the scientific pattern. The bigger pattern is the pattern of what you would call the pattern of consciousness or the pattern of meaning. The manner in which meaning manifests as these two sides. And then science are just a bunch of examples of how that happened. And so maybe I'm to going kind of like a reverse from science. I have a lot of appreciation for science because it gives good examples of places where this is. So I really am more of a Neoplatonist in like a very strict sense. But one of the things that is amazing is how what's happening in the sciences and exactly what you talked about, about this problem of the emergent qualities and of the patterns, of noticing that there are patterns to this emergence. It's not just anything goes. There are patterns and patterns which also manifest themselves across different emergent phenomena. So you have emergent phenomena and then you notice that there is a pattern of emergence which is across the different phenomena. I think that it's a key for modern people to go back into the. The Platonic tradition. We'll go back into Aristotle and understand what he was talking about. This is what he was talking about. He was talking about body, potential, you know, and essences or these and how. And the solution to me is an incarnational principle is that you can't actually ultimately separate them, that they are meant to only be embodied. And it's only in the embodiment that you encounter the pattern. And so, you know, that's the idea of the resurrection in Christianity in the sense that although sadly, many Christians, many who are very close to me, keep talking about going to heaven, which is just not at all the real Christian understanding. Christians don't go to heaven, right? Christians, Christian, we don't see the disembodied person as a. As the ultimate realization of what the universe is about. You know, we see resurrection or a full manifestation of the totality of the possibilities of the body with joining together with a fullness of the essence of what that thing is. That's the resurrection. But it's. It's an. It's also eschatological in the sense that it doesn't happen in the story. The story leads to it, but it doesn't happen in the story. It happens after the story, whatever that means, in the sense that it's something that it's like something that history is pointing to, but that it's also happens beyond the point where history stops. And so it's not in the story. The story is pointing to it, but it doesn't happen in the story. That, I think, is also an important aspect of the Christian story, which that it. It's pointing towards things beyond itself which are real, realer than real. Like, they're not imaginary. They're not just phantasms, but they're realer than real. But they're also not part of this world. They're not going to happen in this world. I don't know if that makes sense in terms of understanding what the. Let's say the solution to the problem of. The solution to the problem of this thing is that it. Can I say this? We have a perception of its telos, but its telos isn't in the story. Right? It actually, it actually. It kind of leads towards. And then there's this, you know, it's like a jump. It's the same jump as the emergent jump."}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":2439.6,"end":2439.76,"speaker":"John Vervaeke","text":"Right."}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":2439.76,"end":2575.35,"speaker":"Jonathan Pageau","text":"You can understand it that way. It's like it's a. Imagine that there's an emergence happening at every level of reality and there's a naming or a patterning, and that happens. And then there's everything, and then there's another jump. And that jump is beyond. It's like it's. It's beyond everything. It's also. It's also the communion of everything. So. And it breaks apart a little bit of the. The simplistic, let's say, eschatological vision. That normal. Like, I don't want to. I hate bashing kind of normal people, like, or just kind of the regular faith going Christian. But it offers a possibility for something which is more encompassing than just a kind of basic understanding that Jesus is coming back and, you know, he's gonna judge the world and we're all gonna be saved. Which is a great formulation. I don't want it to. Like I said, I don't want to disparage it, but it leaves it. So even for the person who believes it in a kind of very basic way, it'll still motivate their world in the same way as someone who maybe has a higher understanding of that story. And maybe that's also one of the things that I think story does, is that it makes that possible. Makes it possible for everybody to participate. And not just because one of the things that happens, for example, in. Even in the groups that we're in and then the discussions we're in is we end up being an elite because not everybody has access to that. Like, not everybody has access to guy saying, stocks circling practices. Like my second cousin, right. Doesn't have access to that, or my aunt or. Because they don't. They're living at a different just level of reality. And so I think that that's also one of the things that's helpful in terms of. I feel like I'm rambling now, but that narrative is able to connect all these levels because of its pattern, because it speaks in a very, very basic way and uses terms that everybody can relate to. Then it connects everybody together."}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":2577.57,"end":2613.25,"speaker":"Paul Vander Klay","text":"You know, I really connect with what both of you were saying. And I think the differentiation between the finite and the infinite games is important. And I see how so as a pastor, I live in a very. Especially since my YouTube career, I live in a very scaled world. I minister to people with mental impairments for whom Jesus died for my sins is. So that's the verbal narrative instantiation of the story. And it's interesting to me how."}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":2615.01,"end":2615.33,"speaker":"John Vervaeke","text":"The."}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":2615.33,"end":2865.8,"speaker":"Paul Vander Klay","text":"Emergence and the emanation, these so map onto the heaven and earth dichotomies. And you see narratively how these things sort of flesh themselves out. One of the things I was thinking about, John, when I was listening to you, because you didn't mention it here yet, but lately in our last conversation, we talked about the suchness and the moreness and I think in some ways part of what emanation, I think, and the constraints you talked about. I'll throw another word in there, which is always difficult because we like dualities, because they focus things for us. But the foundness, the foundness of the fact that things, as Jonathan always says, things lay themselves out in patterns that not only we see repetition, but we see correlation between the patterns. And we see that narratively. We see that working in narrative. I think we also. We also see that with these, you know, because there's all these weird things in Christianity that if you look at the basic narratives and you look at them a while and you look at, let's say, the Scriptures, which is the guide, especially in a Protestant way, for the laying out of these things, they come to these funny conclusions. Like when they ask Jesus, you know, this guy who wound up married to seven, this woman who wound up married to seven brothers, who's he married to in the resurrection? And, you know, you get to some of these weird points where Jesus kind of says, your category no longer works. You've come to the end of this particular narrative game. Yet another Piece from Jonathan that I picked up with one of his conversations was one of the real insights I got from Jordan Peterson when he was talking about the reality of sacrifice in human dynamics, was he noted that part of the difficulty we have from a modernist perspective is we imagine that in my words, we imagine this monarchical vision where there's no. Where there's no narrative, there's no culture, there just is apart from us. And Jonathan mentioned. But we're patterns, seeing patterns. So the fact is, as you said, John, that physics seems to have hit a. Seems to have hit a wall. And there seems to be correlation between the wall that physics has hit and. And sort of, I mean, Thomas Nagel I think has brought some of this out. That boy, isn't it interesting, that same wall that we hit with respect to all of the tricks we learned in modernity of attempting to take human patterns out of the conversation, to see things as such, to imagine we see things as such. But wait a minute, we're all human beings in these things. And this, as you've said many times before too, John, that this narrative way of thinking, it is not necessarily our machine code. It's something we learn when we're three or four. It is simply so powerful, so pervasive that at least conceptualizing human beings getting beyond narrative itself. I simply doubt that any of us are capable of that conceptualization simply because it ruptures exactly the suchness of what we see as human beings to be."}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":2866.28,"end":2984.67,"speaker":"Jonathan Pageau","text":"But also because there's also the question of narrative in the sense that I think it's also. Maybe my notion of narrative is that it's also a fractal. It has a fractal structure. And it goes from just taking an apple and bringing it to your mouth and experiencing that satisfaction and then throwing the core away. That's a story. That's the same story as many larger, larger patterns that happen at a multi person level. And so to me that when I talk about narrative and our experience of the sense, the meaning of a sequence of events, it scales down very low in terms of micro narratives that we encounter in our life. But then those micro narratives then, like branches of trees and joining to a larger narrative, end up being what create the higher narratives and higher, higher and higher narratives. And so that's also one of the reasons why I feel like we just can't. Like it's impossible to, to avoid it. Because I really do see it as. I could even say as something which might be pushing it to a limit. But I could say that breathing is A narrative, breathing, inhaling and exhaling is the pattern of everything. Right? And I'm not the first person to say that. Obviously if you read Vedantic literature, they actually talk about the entire reality, all of reality, as a breath of the, you know, of the atma or of the infinite, as this kind of, this bringing in of potential and then producing, you know, this bringing in of breath and this expiration of breath. It's life and death. It's everything, even in the pattern of the breath."}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":2987.07,"end":3288.5,"speaker":"John Vervaeke","text":"Okay, well, you both have said, as I expected, some very good things and thought provoking things. And I'm glad that you think that I take, I listen carefully because I do. And so let me try a couple of responses maybe from bottom up and top down. From bottom up, when you talk to people, and I've got training in it, who do work in therapy and things like cbt. Often what's needed for people to heal is to realize that there isn't a narrative there, that there was no story for why the truck hit the woman that you love. There's no story there. You're trying to find a story, you're trying to come up with some narrative. You're trying to make the universe fit into a narrative framework, and you're not going to be able to do that. And accepting that there are aspects of the universe that are beyond or outside the narrative framings of your life is often, I'm not speaking facetiously. This is often deeply therapeutically beneficial to people. Why is he suffering there? Well, you're trying to find a story, you're trying to find a purpose, you're trying to find a telos. And that is really, really suffering. Now, I want to acknowledge, and I've acknowledged it repeatedly with both you guys, what I call the indispensability of narrative. We can't become temporally extended selves without narrative. I acknowledge all of that. And so we can't become moral agents because in order to be a moral agent, you need to be a temporally extended self. And it's clear that we learn narrative to do that. And I'm going to say, although it's not sufficient, it's certainly a necessary requirement for being a person that you're a temporally extended moral agent. So that argument is narrative is indispensable to being a person. But aren't there aspects of the universe like this is the therapeutic context that are properly thought of as being impersonal? And so in the sense that thinking that they operate according to the patterns and principles of Personhood and personality, those are not the same thing. Those are not the same thing. But let's group them together. Because narrative deals with personality and personhood. Right? That's what narrative is about to my mind. So maybe we can go back to the breathing thing in a bit, Jonathan. And so bottom up, I think that, and you see this throughout, stoicism is a big recognition that there is the logos, there is intelligibility. But to expect that to operate according to the principles and what do I want to call the principles and patterns of personality and personhood is a mistake. Now remember, I did acknowledge a deep analogy between relevance realization and the manifestation of intelligibility. We want to put it that way, the metaphysics of intelligibility. But it seems to me that there are many instances where people find a special healing and then that gets taken up clearly within the mystical tradition where people clearly report states, and I do experimental work on this that are like non personal or supra personal and supranarrative. And I think you even see hints of this, if you'll allow me. I always feel like I'm treading on ground when I do this. But I'm very influenced by the theology of Sally McFagg and the work she's done on parables, both within the Christian tradition and especially within the Sufi tradition. And she points out the point of a parable is to sucker you in to a narrative framework that then undermines itself as a story. What's the story of the prodigal son? Well, I can tell you sort of the sequence of events, but what's the narrative there? Well, good luck, because it's an infinite game, right? I can't tell you what the story is. And she says that's the point, because there is no final telos, no final reconciliation between justice and compassion, et cetera. And if we try to resolve that that's precisely where we lose our humanity, it's only in preserving the tension in a non narrative fashion that we preserve our humanity. So I'm trying to show you sort of top down and bottom up. There seems to be lots of instances where again, acknowledging the indispensability of narrative to personhood, it's both therapeutic and also transcendent to realize the non narrative and to realize that I think it's even impregnated in a lot of the, you know, the parables and allegories. It's in the Plato's allegory of the cave. It sounds like a story, but it's not a story. Because when he sees the sun, you know, his mind is blown open. And so I think."}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":3289.94,"end":3295.54,"speaker":"Jonathan Pageau","text":"I think that you're right. I think that you're right. What you're saying is completely right on."}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":3295.78,"end":3296.34,"speaker":"John Vervaeke","text":"Okay?"}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":3296.5,"end":3359.3,"speaker":"Jonathan Pageau","text":"But I think it's right on. I think that it's maybe the reason why we're finding some kind of clash or we're not totally agreeing is that maybe it's because I haven't mentioned or I haven't clearly stated that the narrative, the story, the only story, let's say, is the story of the. Is the breakdown in meaning, right? That's the story. That's the story. I'm sorry to say. It's like the story is always a breakdown in meaning. That's always what a story is. A story is a breakdown in meaning and then a recapturing of meaning in a different manner. That's why I talk about breathing in and breathing out. Or, you know, it's always a fall and a standing up. It's always going down into the belly of the whale and crying out and then coming back up. Right? It's always Job who is suffering without reason and is calling out to. And sometimes he doesn't even get a reason."}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":3359.46,"end":3359.86,"speaker":"John Vervaeke","text":"Right?"}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":3359.94,"end":3367.7,"speaker":"Jonathan Pageau","text":"And you see that in even the story of Christ, who on the cross says, why have you abandoned me?"}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":3367.7,"end":3368.18,"speaker":"John Vervaeke","text":"Okay?"}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":3368.5,"end":3406.99,"speaker":"Jonathan Pageau","text":"So to me, that is the story. And so I think a good way to understand it may be to understand it in like a three tiered structure. You could say, so you have beyond, beyond meaning. You have the absolute or you have the mystical direct vision, which goes beyond narrative, which is above narrative. And then you also have death, chaos and death, which is this breakdown in meaning in a negative sense, where things are scattered and fractured and they cause suffering."}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":3407.38,"end":3407.78,"speaker":"John Vervaeke","text":"Okay?"}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":3408.26,"end":3431.94,"speaker":"Jonathan Pageau","text":"And so you have these two sides and then in the middle, which is actually most of the time the world we navigate in, that's where the story happens. And the story ends up being a negotiation between these two parts, these two aspects. That which transcends meeting and that meaning and that which is below and is a breakdown of meaning."}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":3431.94,"end":3432.34,"speaker":"John Vervaeke","text":"Right?"}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":3432.34,"end":3447.14,"speaker":"Jonathan Pageau","text":"So you understand the story as a pyramid, as a mountain. Right? I always talk about this, this image of the mountain. So you have. Which is above the light coming down. And then you have the thorns and the ocean and the leviathan at the bottom of the mountain."}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":3447.14,"end":3447.7,"speaker":"John Vervaeke","text":"Okay?"}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":3447.78,"end":3600.84,"speaker":"Jonathan Pageau","text":"And so there is, of course, like you said, there is, for example, in that person who is hit by a bus. That's what they've. They've just been tossed into the sea. That's exactly what's happened to them. They've been thrown to the shark, they've been eaten by a fish. And now they're going down into the. Into the water and they're searching for meaning. They're looking around and they're saying, where is it? Where. Where is the meaning? There's no meaning. This is painful. This is suffering. And then there is this reconciliation. This. This reconciliation which has to happen, you know, and it can be a letting go of a desire for a false meaning. It can be all kinds of possibilities of letting go of a false narrative. But then they need to get back out of the water. They're going to have to find another narrative, right? That person that got hit by a bus and is in the hospital and it has broken legs and broken limbs and is searching for meaning to understand why it happened to them as they let go of that search for a kind of broken narrative. If they're going to get out of the hospital and start their life again, they're going to have to find a new story. There's going to have to. A new story is going to have to manifest itself. And so to me, that's how I see the narrative now. The mystery, and this is the biggest mystery of all, and this is the biggest mystery of Christ is that what Christ is showing us is that ultimately. And this is the very disturbing. Disturbing thing that I'm going to say. But ultimately, what's up here and what's down here, they're the same. You can reach a point where the cross is at the top of the mountain, which is like. It blows your mind because it's actually saying that the non. Duality encompasses both the breakdown of meaning and the trance, the transcendence of meaning. And it's something that. It's hard. It's like I said, it's hard to deal with because it just breaks everything in your mind. But that's. To me, that's how I see the importance of narrative. The manner in which it's transcended, the manner in which it brings us into death. And then ultimately how I think the story itself is transcended in a way that's hard to fathom in the story of the crucifixion."}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":3604.07,"end":3605.91,"speaker":"Paul Vander Klay","text":"Well, go. Go, John."}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":3606.15,"end":3780.54,"speaker":"John Vervaeke","text":"Okay, sorry. I'm cognizant of the fact that it's sort of your turn to speak, Paul. I'll try to keep this brief. So I think that was really cool, and I don't mean that in a dismissive fashion. I think that metaphor and symbol and narrative Are all a continuum of things we do that we learn. Kids also have to learn metaphor. They're not naturally metaphorical. They have to learn humor. They have to learn symbol. And I mean, I think that's purely. And so I think this is the indispensable arena in which we train the non logical identity that you talked about, because the identity you talked about at the end, they're the same. You're clearly not making that a logical identity. It's. It's translogical and I think narrative, like the parables. And you even said this like they are an affordance, but they're a springboard to something beyond it. Because it sounds to me. Sorry, I don't want to impose. Sounds to me like you're saying the principle that makes whatever it is that's making narrative is not itself narrative. And what I'm wondering is if that's sort of ultimately reconcilable with a scientific worldview that sees things in non teleological terms. That's one part of what I want to say. The other part is, which is a problem I keep coming back to, which is the problem of pluralism. I get the idea of encompassing narratives that reach from the depths of the emergence to the height of emanation and bind them together, symbol on non logical identity. I get that, I acknowledge it. But what I see, and this is the postmodern influence on me, right? I see multiple versions of these. I mean, you guys even have different versions of Christianity. And I'm not trying to be insulting, right. And different traditions. And so while I acknowledge everything, say Jonathan, and I think I'm acknowledging it quite sincerely and deeply, the sort of. This triangle of pluralism that we also have. We also have this scientific discourse that has made tremendous progress by going non narrative. And that's pretty undeniable. And then we have the other fact of the pluralism of these grand narratives as also an undeniable fact for people. And so that's why I hesitate to say there is the story. That's what's problematic for me."}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":3780.94,"end":3922.8,"speaker":"Jonathan Pageau","text":"Yeah, I understand what you're saying. In terms of the story, there's only, let's say there's only instantiations of the story too. There is the story. All the different instantiations of the story point to a story which is in a manner beyond its manifestation, the pattern of everything, right? So necessarily that's also one of the things that you get at the top of the mountain. So you get. So you have this. Like in St. Gregory of Nyssa, there's a really wonderful way of explaining it, which is that Moses is on the mountain, and he goes up the mountain. And so in order to go up the mountain, he does actually have to kind of strip away the outer layers of himself. Kind of strips away and strips away. And then when he gets into the highest point of the mountain, God gives him the pattern of the tabernacle. He gives him the pattern. But you understand that the only way that we can encounter the pattern of the tabernacle, he says crazy things. He says things like the pattern of the tabernacle, which is Christ himself. It's like, read the story. It's describing a building. It's not describing the Anointed One. It's not describing the Messiah. But what he's trying to show you is to say that he encountered the pattern. He encountered the Logos itself. But when it's written in the text, it's a building, because what else are you going to do? It has to come down. Has to come down the mountain. He receives the law in a pure form. He sees the divine light. But when he comes down, he has to have tablets with things written on them. And those things are not. I want to disparage the law in the sense that it's. That it's just a form or it's just a covering. But it is a covering, but it's a covering that manifests that which is beyond it. So Moses wears a veil on his face. The veil that Moses wears on his face is the law. Those two things are the same. He's coming down the mountain and he's showing. And so it's like. It's funny because I hate to use. It's funny. I'm going to use the. I'm going to use a Hindu text to talk about Christianity. But that's the. To me, that's what happens in the Bhagavad Gita."}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":3922.8,"end":3923.68,"speaker":"John Vervaeke","text":"Yeah. Yes, yes."}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":3923.68,"end":3990.53,"speaker":"Jonathan Pageau","text":"Right. So Arjuna sees Krishna, but he can't. It's unbearable to see that. It's. It's. It's too much. It's. It's overwhelming. It's. It's an explosion of unity and multiplicity. And it's like he sees. He sees divinity, and it's. And then he's like. But then what's Krishna telling him to do? He's basically. He's saying, like, why would I fight? Like, why would I fight? Because there's this. The same problem. You're saying there's these multiple stories and there's these different things and all these things. So it's like I'm brought into a kind of lethargy where I can't act because there's all these different paths and all these different roads that lead up the mountain. And Krishna is saying, take your sword, go fight. You have to be on a path. There's no other way. You have to be on an actual road that leads you up the mountain. And that road is as real as it's going to get until you reach the divine vision. And I can't talk for what happens after that. Who can speak for what happens after that?"}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":3990.93,"end":4052.64,"speaker":"John Vervaeke","text":"Well, I mean, I like that you brought in the Bhagavad Gita, how ka grows through a pluralism. Now I become deaf, right? And now I become this and now I'm come that. And it's the trajectory through all of the instantiations that Arjuna is supposed to pick up on. So I agree with that. And the idea that sort of behind beyond, but beneath the stories is the logos. But what I'm suggesting is maybe a better model for the logos than story is. Dialogos is what we're doing now. There's a reason why it's called dialogos. I think a better model for the logos is dialogos. What's happening here, this unexpected, unpredictable unfolding of relevance, realization and meaning making. And that's a better and more. Right. A better metaphor, a better symbol for the logos than the telling of stories. That's to me, that's what I'm proposing."}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":4053.84,"end":4252.34,"speaker":"Paul Vander Klay","text":"It's interesting to me in conversations like this, I often ask myself, okay, where. Where is the disagreement and what is the disagreement about in your. Because, you know, I've got a lot of experience, John, in the illustration that you used of the woman who is hit by a truck. And because that there's, you know, and I think Jonathan really nicely sort of laid out the meta story. What exactly is a story? And another way to frame it. It's interesting in NT writes in his magisterial work, his first volume, he goes first thing. One of the first thing he gets into in terms of his prologomen is what is a story? And another conceptualization of it is you have Shalom, the breakdown of Shalom and the recapture of Shalom. And this is in many ways also gets at. Jonathan framed it in terms of meaning. You could frame it in terms of shalom. But it's this basic movement from, you know, creation, fall, redemption. In more of the, you know, the classic statement of my own tradition, it always strikes me the what is. What exactly is the consolation, what exactly is the consolation of hearing that the accident with the truck was a product, there was no purpose behind it. And to me, this is where we bump up into, where this conversation bumps up into consciousness and persons. And I've been doing a ton of thinking about persons over the last two years in terms of what persons are, because there is this emergent quality to, to personhood and the connection to our physiology and our histories. I mean, all of this is evident in personhood. Cognitive science, psychology has illuminated so many of those connections. Yet when it comes to the story of the truck accident so often, what I see, how it boils down in the lives of people, is that father meant me no harm or there wasn't. This gets into this archetypal thing that what crushes people often in Christianity, especially in a very robust version of Christianity, which is Calvinism, which very much accentuates personhood through and through, where, you know, all of the evil that comes to me is brought to me by my father, by Father's hand. And you know, this gets really weird in some Calvinist circles, but therapeutically, pastorally, theologically, you can see these moves. And I think it's interesting in Christianity, in the Hebrew scriptures, where."}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":4256.74,"end":4257.34,"speaker":"John Vervaeke","text":"Among the."}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":4257.34,"end":4413.8,"speaker":"Paul Vander Klay","text":"Background of creation narratives which are simply replete with persons, free agents, as you will, small G. Gods. The sun is a God, the moon is a God. Everything's just replete with gods. You get this story at the beginning of Genesis where there's, there's one consciousness and the sun is a functionary, but you don't pray to the sun, and the moon governs by night, but you don't pray to the moon. In the words of St. Francis, it might be Brother Sun, Sister Moon, but even that formulation relativizes my personhood with respect to the source personhood of which my personhood is but a reflection, as even in a sense the sun and the moon are. Even though we don't treat them as persons, they are obedient functionaries, but in a sense non conscious. So in a funny way. So what I'm trying to do is to begin to get a sense of. Okay, so we've got someone advocating for the meta story, and I think Jonathan articulated so well, and John, you articulated well. And I wonder, okay, where's the disagreement here? And not in the spirit of saying, let's paper over these disagreements so we can all hold hands and sing Kumbaya, but much more in the spirit of Dialogos, where we're saying, okay, I understand Jonathan a little bit better And I understand John a little bit better and I might even see some mutual mappings that I didn't see before. But I very much understand both of you. Where all of the usual suspects that we're dealing with now in terms of our meaning making are at play in this conversation between you two and. And the different traditions that they're not simply the same thing as people like to sort of facilely jump to. Oh, they're all talking about the same thing. It's all. There's no disagreement there. None of us are doing that. So it's just interesting listening to you both and looking at the mappings and saying, very interesting. Put that on my tombstone, my life. It was very interesting. I don't know if that leads either of you to anywhere."}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":4415,"end":4493.1,"speaker":"Jonathan Pageau","text":"I can maybe steel man John's position in the sense that I understand his suspicion of, let's say story or the suspicion of inhabiting a story in the sense that that leads to war. It does. It really does. And it happens all through human history where inhabiting identities and inhabiting stories will lead you into conflict with people who have other stories. And the fact that John is mentioning that there are these other passages, there's religion, there are different types of Christianity, there are different ways of practicing religion that shows this difficulty, which is how if you inhabit a path, if you take on this path as a story and you enter into a story, then you're going to find yourself in competition with other stories. And the danger is that we fall back onto a kind of tribal type of tribal warfare that has plagued human history. So do you think that I'm right in terms of understanding? One of the reasons, let's say, why you're. You're careful with that idea."}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":4493.82,"end":4599.28,"speaker":"John Vervaeke","text":"I think that's fair. And then I would add one element, I think that's implicit, which is the idea that story comes to an end and that what I need to do therefore is end other stories so that the only ending is my story's ending. And I don't think so. I think there's a deep connection between. I see some of the things you're saying is saying that there are narratives that are non teleological. I want to leave that open. I don't want to impose on you because I think breathing is a non. I don't want breathing to end. That would be a mistake. Right. I don't want to complete that process. It's not a finite game. It's an infinite game, if I take the metaphor correctly. But I think that for many Standard interpretations of what narrative means is narrative is teleological. And I find on one hand that problematic with respect to science. I've already mentioned that. But I also find it problematic because I think there is a deep connection between, and this is what Jane Carr argues between teleology, finite game and conflict warfare. Yes. I think those are inherently bound together in a powerful way. Because if the point is to get to X and you say, no, the point is to get to Y, it's often the case, well, I've got to shut you up so that we get to X. And warfare narratives are exactly that kind of narrative. That's exactly the kind of narratives there are. They're teleological narratives in which I try to crush one telos so that my telos is realized. So did I respond in. In kind to you?"}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":4599.28,"end":4672.24,"speaker":"Jonathan Pageau","text":"No, I think you're right. I think you're right. It's also one of the reasons why I'm trying to point out the idea of eschatological storytelling, which is what many religions have, not just Christianity, Islam and Buddhism and Hinduism and Judaism all have eschatological storytelling, which is that the resolution of their story happens in another age, happens in an age beyond ages or an age of ages where, you know, the final manifestation of the final Buddha will create, will restore a new cycle. It doesn't. There are different ways of putting it in terms of Christianity. It's the, you know, the new Jerusalem, the messianic age, another age. And so what? Because the storytelling is eschatological, it pushes the resolution of the story outside of the story or outside of the possibility of, like a movie where the movie has an ending, the story has an ending, but that ending is not in the story."}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":4674.24,"end":4758.35,"speaker":"Paul Vander Klay","text":"And I think in a lot of the work that I've done, I think that is actually a critical force feature to actually having human communities have stable stories. Because there are elements of the story that if brought off into a new age, afford. Afford the pulling back of too many finite stories. Miroslav Wolf makes this point in the breakdown of Yugoslavia. He noticed that it was the secular atheist descendants of Communists who must settle scores in this age, because there was not a new age in which another age in which the scores would finally be settled. And so what Miroslav Volf noted is that there's a. With, and I think part of the scientific frame that pushes us towards this is that now there's only this frame. And when there's only this frame, all games must suddenly become finite. And it actually intensifies the narrative conflicts between us, which produces more bloodshed. And so in this way, there's sort of an ironic relationship between this dance of finite and infinite stories."}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":4760.03,"end":4937.38,"speaker":"John Vervaeke","text":"That's a good point, Paul. And what you just said, Jonathan, it makes your. I don't know if you've read Mick Fagg, but her metaphorical theology and her speaking in parables. But your sense of narrative is very much. And again. But it sounds more trans. Narrative. It sounds like the point of the story is to throw you outside of the story, like the parables. And the point about the parable, well, sorry, I'm doing what I've said. One lesson I have learned from the parable of the prodigal son. And Carol Shields does an excellent version of this in the story she wrote. That's an allegory of the prodigal Son. Is that the attempt to find a resolution between justice and compassion? Is it something we should do? Right. We shouldn't do that. We will lose our humanity. And here's where I'm influenced by Tillich. He talks about all these tonas, the attempt to resolve the needs for individuation and participation. We shouldn't do that. We shouldn't try to resolve those tensions. Right. We shouldn't try to bring them to resolution. So I guess the thing I'm trying to negotiate here with you, and I feel like this is genuine sort of dialogos, is what does it mean then? There's two things you're saying, right? We want it. There's a sense in which the part of the infinite game is to keep the tensions alive, if you'll allow me that, because that's where we preserve our humanity. And again, this is a theological argument. Tillich makes it repeatedly. It's not something I'm imposing on Christianity from without. And I'll bring in Jordan Peterson. After you play all the games, you have to constantly remember that you're playing the metagame. And the point is never to end the metagame, never to get. And sometimes you win and sometimes you lose. And if you try to always win, you've actually lost the metagame. These are the concerns I'm bringing in. Now, if what you said is right, Paul, there's a sense in which like is the age beyond all ages. It sounds like to me like the God beyond all gods. But we'll go back to that another time. Is the age beyond all ages? Is it a promised land or is it a horizon? Because if it's. It can do. It can function the way you both said. If it's just a Horizon of intelligibility. Not a promised land that we'll get to where all these tensions will finally be resolved and everything will come to some kind of inhuman. I want to say it. Inhuman peace, because I don't want that inhuman peace. And I don't know why anybody should recommend it to me. And so that's kind of. I'm trying to play. I'm trying to play your ballpark."}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":4937.38,"end":4950.2,"speaker":"Jonathan Pageau","text":"Look, at least in the. At least in most orthodox understanding, it's that deification is a eternally dynamic process."}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":4950.28,"end":4951.56,"speaker":"John Vervaeke","text":"Yeah, the epictasis."}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":4951.8,"end":4975.65,"speaker":"Jonathan Pageau","text":"And so if that. And so there isn't this idea of the coming age as we're all gonna be sitting on clouds with heart. You know, that kind of cliche and just. And just bored, you know, whatever. There really is this idea that it's a. That it's from glory to glory, infinite movement from glory to glory, and that there is no. There is no finish line."}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":4977.89,"end":5014.9,"speaker":"John Vervaeke","text":"Well, as you know, and I mentioned it in my series, I like the Eastern Orthodox idea of epictasis. I think I sort of see that. And I think that goes back to the Vedanta. It's the right. You're not supposed to latch onto any one of the manifestations of Ka. It's the infinite trajectory. It's the way that trajectory points to beyond all the manifestation that gives you the sense of divinity. But that sounds to me then that the answer to my question is that the age beyond ages is a horizon rather than a promised land."}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":5015.38,"end":5023.7,"speaker":"Jonathan Pageau","text":"But I think in the image, I think they can be both. I think it can be both at the same time. And I think, how about this? The promised land is a mountain."}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":5026.08,"end":5026.2,"speaker":"John Vervaeke","text":"An."}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":5026.2,"end":5031.44,"speaker":"Jonathan Pageau","text":"Infinite mountain that has that. Whose summit reaches into infinity."}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":5031.92,"end":5197.79,"speaker":"Paul Vander Klay","text":"See, I wouldn't phrase it. Now, I'm gonna put on the theological. What theologians do is quibble about words and distinctions. I wouldn't phrase it as age beyond ages, because that sort of just sort of punts it out into nothingness, where. Whereas one of my favorite articulations of this is CS Lewis's children's book the Last Battle, where it's further up and further in. And where right now we get this. Neil DeGrasse Tyson had this very interesting conversation where he said, we have this funny dynamic that the more we know, the more we realize we don't know. Because with. With each increasing vista, we see more vistas. And. Well, that's a curious aspect about reality. We would have thought we'd have got to the bottom of it. And we. You know, for all of we haven't been doing it that long, but we don't seem to really be getting to the bottom of it. And so CS Lewis in the Last Battle, and it's very interesting, at Lewis's point in his life, he starts writing children's book. The this man who seemed to know no children, nor have reason to know children, starts writing these children's books. And the Last Battle is my favorite of those books because you have this sense of suddenly the children discover true Narnia. Well, of course, this gets deeply into philosophy because it's Lewis. And then their quest is to go further up and further in. And you have the same sense in the Great Divorce, his book about, in some ways, the age to come. And Christianity has always recognized that the images we have of the next age, at least, because let's not try to posit every age, but let's just be content with at least the next one. All of our images are evocative, they're all limited, but I think in many ways they do function as necessary elements for us to manage the age we have and to not concern ourselves too much about the age to come. And again, this is sort of where my Calvinism kicks in because finally all of those questions get punted to, well, if there is in fact such a God, then, and if this God is in fact good and right, then he will finally do what's right with it. So, and that's obviously very pastoral move."}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":5198.27,"end":5198.67,"speaker":"John Vervaeke","text":"But."}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":5198.67,"end":5265.76,"speaker":"Jonathan Pageau","text":"But I love the. I love the CS Lewis image. I think it's a beautiful image and it's a very powerful image. And it also helps to understand that. That at least. At least my understanding when I read the Fathers and I read the Mystics, is that the, the age to come is also now. It's also now. It's not just the age to come. It's that even in the now, which is beyond what is immediately accessible to us in terms of seeing the glory of God. You could see it that way, or seeing the radiance of the glory of God in the world. And so it's not just a. It's an age to come when you talk about it in terms of, let's say, the cosmic story. But it's accessible to the mystics now, that age to come. Like they are already we. Already we see that in the text where they talk about, you know, that there are some saints that are already in the resurrection, that they. They already participate in the resurrected, in the resurrected body. And so it's not just a. It doesn't just have a narrative function. It has an ontological reality which we can participate in."}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":5266.82,"end":5276.3,"speaker":"John Vervaeke","text":"That's how I interpreted the up and always up and in. It's Neoplatonic, which of course is why Jonathan likes it and why Lewis probably."}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":5276.3,"end":5277.22,"speaker":"Paul Vander Klay","text":"Picked it up from."}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":5277.3,"end":5331.19,"speaker":"John Vervaeke","text":"Well, of course, I mean, what does he say in the Magician's Nephew? It's all in Plato. I don't know what they're teaching children these days, but that to me, yeah, but isn't. I mean, neoplate Platonism is basically the vertical ontology rather than the narrative horizontal, the horizontal moving towards the horizon. That's the narrative structure. But the Platonists and the Stoics say ultimately is no, no. And I go back to one of Jonathan's point where you should ultimately set your identity isn't this way. This is practical, I'll use Buddhist terms. This is relatively useful for getting around in your life. But where you should ultimately set your identity is in that ontological relation."}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":5331.99,"end":5362.51,"speaker":"Jonathan Pageau","text":"That's why the narrative is actually not going towards the horizon. It's going up and down a mountain. They join together. The story of your life becomes your struggle to go up and down the ontological mountain. And that's what the story is again. It is the fall from. It's going down the mountain, falling, tumbling, falling into the water and then going back up somehow or joining the two extremes together."}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":5364.11,"end":5491.08,"speaker":"Paul Vander Klay","text":"And to reframe it in a pastoral sense, this also maps onto the command to love. And I started a little clips channel and I John, I used your clip at the end of 15, I think it was of agape. And just last night at a meetup, one of the people watched my clip, he said, I've never seen John Vervaeke talk about agape like that. And I've seen so many Christians just light up when they heard that. And so in a sense, so we're talking all these symbolic ways, but the very pastoral way to love your neighbor is in many ways many of these things just simply map onto that because loving your neighbor is like climbing a mountain and it's often falling from the mountain and it's loving a person. And one of the things that you immediately get into when you start trying to love a person is all of the deconstructed grime of that person where they've taken on all these bad habits and they have all this crappy thinking and all of this self deception. And so even in that journey, which Jesus basically boils down to, okay, well, let's, you know, I'm going to make it real simple and scalable for all of you. I want you to love your neighbor, and that's in a sense where your journey begins. And I think even in the sense of beginning that journey, anyone who loves their neighbor imaginatively engages a narrative that says, I imagine for my neighbor a blessedness that at this point they can neither comprehend nor attain. And so my love in itself will. It won't guarantee, but it will be an affordance and a pathway up the mountain with them."}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":5495.24,"end":5676.94,"speaker":"John Vervaeke","text":"Okay, well, that. I mean, I'm in deep agreement with that, I guess. I think that the. I don't know if I'm making. I'm not making a counter argument. I think I'm just putting on another dimension. But maybe it'll turn into a counter argument because I'm trained that way. But I think that because I'm doing a deep dive in this. If you dive deeply into Platonic dialectic. But you can see it seated in Socrates, those two dimensions. And Jesus gives two commands. Love God with all your heart, and then love your neighbor as yourself. Love. And I think of those. The first command is the vertical, and the second is the horizontal. And like Jonathan said, what dialectic does, and this is how I see it being trans. Narrative, is that it says those two are always. I think of them almost like the X and Y on a Cartesian graph. Right. And then there's the third dimension that emerges from them, the third factor that's neither the horizontal nor the vertical, but that which grounds the two of them together. If you'll allow me, I think this is something about what puts emergence and emanation together. But that's getting very abstract. Let's bring it down to it. This is what I'm trying to say, that when loving you isn't telling a story about you, ultimately it's about entering into dialogue that is constantly moving back in the tonas between your individuation and participation and my individuation and that dialogue, that logos that emerges between us, that intimacy. Right. That also. That prefigures. I'll use a Christian word, it prefigures the intimacy I can have with the vertical logos and makes the two resonate together. And so for me, that's what I'm trying to propose when I'm trying to propose dialogue. But maybe the difference between these two is now disappearing. I'm proposing that as maybe, wow, this is going to be pretentious. The gods are going to strike me down for hubris. Maybe that is a better metaphor for the coming age, an enacted symbol of the logos than story. Because we need something that will allow all of these emerging communities to dialogue with each other. I think dialogue is really, really important right now. And that sounds like such a, you know, United nations platitude. And that's not what I'm trying to get at. I'm trying to get at a form of human discourse that is doing what we're doing now. And so I don't think, if you'd allow me. I don't think that any one of our stories is. I'll try and use the cap is the appropriate symbol for the sacred. I think the ongoing dialogue between us is the best symbol for the sacred, and it's one we can enact in love. Horizontal and vertical love right now."}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":5677.9,"end":5686.38,"speaker":"Jonathan Pageau","text":"Yeah. But I also. I don't think. How can I say this? I don't think that those two are exclusionary of each other. Like, I don't think that maybe they're not."}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":5686.38,"end":5688.46,"speaker":"John Vervaeke","text":"I'm willing to concede that. I'm willing to concede that."}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":5688.46,"end":5771.57,"speaker":"Jonathan Pageau","text":"And so I think that. So imagine it like a good way to, maybe to imagine is to imagine like a dance, right? And so we're dancing, and that dance has a pattern. And that pattern will express itself in terms of communion in a immediate sense. Right. In the sense that you talk about, in the sense of this exchange and this finding of places where we connect. And then also this kind of accepting and relinquishing the places where we aren't connected. And so there's this breathing in and breathing out in the discussion where we connect and disconnect, but we still continue to dance. Right. In this discussion. And so I think that that's definitely a powerful and like you said, a good image of the sacred. And I think it's great. I think it's wonderful. But like I said, because I think that if we can't avoid being in a story which scales at all these different levels that I talk about, I feel like if we ignore it or if we try to cast it aside, just like any pattern, if you try to set it aside."}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":5773.43,"end":5773.95,"speaker":"John Vervaeke","text":"It'S going to."}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":5773.95,"end":5825.26,"speaker":"Jonathan Pageau","text":"Take its revenge on you. It's going to come back just like not sleeping. Like, I talk about, you don't sleep and you think that sleeping is not useful, then it's going to come back. And I think that that's what I think that because we're seeing a. Because we're seeing this narrative burning right now all around, especially in the west, we also have to be able to find ways to. To reconcile ourselves within these stories and to find our place, let's say, to find the way in which we fit into these stories as well. And so I think that. That's why. I think that I totally agree with what you said, but I also think that we have to be in a story, and if we don't, it's going."}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":5825.26,"end":5827.9,"speaker":"John Vervaeke","text":"To happen to us when we began."}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":5828.06,"end":5904.92,"speaker":"Paul Vander Klay","text":"I really liked how both of you. So we've got the emergence from below, and in a sense, we're all living in that emergence. And our relevance realization is all the time because we understand the terror of falling back down the mountain. And we understand. So we're all in the emergence, but the Emanation. I think with a vision of the Emanation, one can have hope in the emergent process that the emergence will not be futile. Now, it's a weird thing because on one hand, if you emphasize the Emanation too strongly, I think, as you said, Jonathan, you get this tyrannical and you also squelch the. I love how John, I never put that together. Where your relevance realization is, is sort of right at the border between those two things. And that both drives us into the narrative. It drives us into the future. And this is one thing that when I think about the age to come, my anxiety about the age to come is, well, what do you mean? There's no more sea in the book of Revelation? Because that's symbolic of sort of chaos being put to rest and we'll wipe every tear and all of that."}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":5904.92,"end":5905.28,"speaker":"John Vervaeke","text":"But."}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":5906.25,"end":5959.28,"speaker":"Paul Vander Klay","text":"But so right now you both need the anxiety and the meaning, because again, meaning is right in there, too. The meaning of the quest at the emergent level, where we're struggling up, but yet also the confidence of the emanation, that this is, you know, finally, this is not purposeless. Finally, this seeks towards a telos, even though we understand that you do have finite and infinite games. And so I, you know, again, just listening to both of you and taking from both of you, I really find a lot of useful things to help me as the Protestant here, kind of in between the two of you."}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":5959.52,"end":6033.41,"speaker":"Jonathan Pageau","text":"But in terms of meaning, it's really. The idea of the eschatology is also important in terms of understanding this problem of meaning, which is that meaning is post hoc quite often. And it's also fine that it's post hoc. We don't have to see that as negative. We don't have to see it as negative. That meaning is revealed after the fact. And that meaning comes together after we've, you know, like that person who. That person who gets hit by a bus, and it's all meaningless, and they're in the hospital and everything, and then they can't do the job that they were going to do. And so finally they have to go to school and study something else. And then they end up doing some other job. And then they say, oh, that's why I got hit by a bus. And then you look at them and you think, are you silly person? You're just putting the pattern back onto what happened. But no, no, no, that's exactly how things work. And it's fine that they work that way. And the vision of eschatology has to do with a universal version of that, which is that the logos judges at the end, meaning. The final meaning will be given at the end."}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":6033.41,"end":6033.77,"speaker":"John Vervaeke","text":"Right?"}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":6033.93,"end":6039.93,"speaker":"Jonathan Pageau","text":"Just like a movie with a fishtail ending. It's only at the end that you see the full meaning."}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":6040.02,"end":6040.18,"speaker":"John Vervaeke","text":"And."}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":6040.33,"end":6078.69,"speaker":"Jonathan Pageau","text":"And that's not a negative thing. It's just. It's actually part of the pattern as well that the final meaning is pushed into the future. And it's weird because people. It's like postmoderns have used that to like, basically destroy. You know, they've used that pattern to notice how meaning comes after, to basically destroy all kind of essentialism. But I'm like, no, I don't think that destroys it. Think that's actually how it also works because you have. Darkness comes before the light. Even in the gen. In the Genesis creation story, the chaos is there before light. And that's how it works."}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":6078.69,"end":6091.41,"speaker":"John Vervaeke","text":"Oh, sorry, Jonathan. No, no, no. Well, I'm gonna play. I'm gonna play with this a little bit. Go for it, scientists. Because the phenomena that you talked about, I mean, that's very much the phenomena of reconstructive memory. Right?"}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":6091.65,"end":6092.05,"speaker":"Jonathan Pageau","text":"That."}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":6092.97,"end":6156.44,"speaker":"John Vervaeke","text":"So a good metaphor. This is. Our memories are not like computer files. Our memory is like a compost. Whatever is most recent is fairly accurate. But as you go backwards in time, things get meshed and confused together. And that's what you. All the memory research since about 1980. Elizabeth Loftus on And that's why people can. It's easy to implant false memory in people. I could get people right now, get them in a room, get them to imagine doing something, come back to them six months and ask them if they did it or not. And they're likely to say that they did it even though they imagined doing it. The examples of these are replete. This is one of the problems with the idea that our self is a stable entity because that story is rewriting itself. But part of that rewriting is undermining. And so we do this all the time. And one of the concerns of the postmodernists. You guys are putting me in the weird position of defending. I think there's value in postmodernism."}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":6156.76,"end":6158.08,"speaker":"Jonathan Pageau","text":"I think there's value in postmodernism."}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":6158.08,"end":6158.6,"speaker":"Paul Vander Klay","text":"I do, too."}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":6158.92,"end":6166.48,"speaker":"John Vervaeke","text":"Okay. Okay, good. Okay, great. Because that's one of the places where Jordan Peterson and I butt heads. I think, in a very."}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":6166.48,"end":6173.24,"speaker":"Jonathan Pageau","text":"Yeah, I told Jordan in the conversation with him that I think he doesn't understand Jacques Derrida. He doesn't understand."}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":6173.88,"end":6242.47,"speaker":"John Vervaeke","text":"There's deep connection between Derrida and negative theology. There's wonderful work on that. The influence of Derrida on Caputo and Mark Taylor, who are amazing theologians. I mean, that's just there. Or Foucault's deep reflections on stoicism and the technologies of the self and the work of Pierre Hadou. That's all there, too. But the concern is the. What the postmodernists, and that's what I'm trying to do with this example, is they're trying to say, but we have a pretense of the stability of the narrative. That is not true. That vent you got where the guy goes back and said, well, that's great, but, you know, that's reconstructive memory. And that's exactly what makes the idea that there's a narrow. That's. What if postmodernism is anything, it's an attempt to destabilize our culture. Cognitive grammar, and show that it's much less stable than we pretend it is. And just like we pretend that we have a stable self. Right. And that our memories are accurate, what we realize is actually our self isn't so stable and our memories are mostly false. And so."}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":6243.03,"end":6298.13,"speaker":"Jonathan Pageau","text":"But what if that pattern, the manner in which older events mesh into themselves, what if that is actually a very useful way to see patterns? Because it's like, I love the legends of Alexander the Great because there are some of the most mythical, mythically powerful stories that you can find because they seem to have been through that grinder that you talk about. And I think that I would even dare say, go as far as to saying that I think that the story in Genesis 1, that's what happened. It's just. It's at a cosmic scale. And so what's left in the story of Genesis is a telling of something that happened, but that has been brought into such patterning that it has. It's represented only in universal categories."}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":6298.45,"end":6317.29,"speaker":"John Vervaeke","text":"That's cool. Jonathan that's very cool, because when I teach my students about this, I say the point of memory is not an accurate recorder of the past, but an intelligent anticipator of the future. And so is that basically what you're saying? Is that how I should understand it?"}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":6317.61,"end":6341.02,"speaker":"Jonathan Pageau","text":"Well, I think it's mostly that I think that memory is there to, let's say, especially ancient memory is a patterning mechanism. It's not to remember accurately things in the past. It's there to recognize the pattern of being so that, well, maybe you could see it the way you said so that you can encounter that pattern as it manifests itself to you in the world right now."}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":6341.34,"end":6348.06,"speaker":"John Vervaeke","text":"It's the affording of good learning, basically, is what we're talking about. Because that's what you mean by pattern detection ultimately, right?"}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":6348.54,"end":6352.78,"speaker":"Jonathan Pageau","text":"I mean, yeah, that could be it. I'm not sure about the term you use. I never heard it, but I."}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":6355.1,"end":6391.78,"speaker":"Paul Vander Klay","text":"Well, and I think we're bumping into modernity again here. And we have to give modernity its due, because when you say the pretense of the stability of the narrative, that is not true. And what we're saying is that, you know, Sally really didn't go to the park on November 31st. And there's an interesting discussion in the CS Lewis community about the date. I mean, CS Lewis was horrible with dates. And he seemed to completely get wrong his conversion story, which is a seminal moment. And it's like, how could you get the timing of this wrong? Alistair McGrath, as a whole biography nearly half devoted to this issue."}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":6393.75,"end":6394.15,"speaker":"John Vervaeke","text":"You know."}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":6395.27,"end":6475.16,"speaker":"Paul Vander Klay","text":"Part of the reason modernity arrived and was so potent and was so, you know, was so productive for us, was it demanded the correlation to a certain layer of our reality. But those correlations, I mean, what Jonathan and I continually deal with, with our audiences, given all the deep impact of modernity on the reading of the biblical text, which is a pre modern text, obviously, is, well, how are we, in fact, to put all these layers together? And that also maps onto our questions of, let's say, the next age, because do I participate in this? Well, what am I? And what on earth does resurrection mean? And this resurrection of Jesus Christ? And I mean, so, you know, we have to, on one hand, give modernity its due in that Sally did not go to the park this day. And that is a memory she has. And, you know, even if so, I've been married longer, you know, I've been married for 32 years. And it's amazing the kinds of conversations you'll have with a spouse in terms of what she remembers and what I remember. And I refuse to do those fights."}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":6476.36,"end":6490.44,"speaker":"John Vervaeke","text":"Whenever it comes down to the confidence and the accuracy of memory, I just say no, we both have to admit that we're both wrong and let's try and work out, let's turn the fight to something current, because that's an irresolvable issue."}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":6493,"end":6575.73,"speaker":"Paul Vander Klay","text":"But we have to. So even in that quote, the pretense of the stability of narrative is that it's not true. The postmoderns, they can't live without the moderns. I mean, it's simply the way the pattern lays out, as Jonathan would say. I'm not pushing against it. I think it's right. And I think the quest now, as we're getting, as modernity is receding, is to not lose the benefits of what we earned in modernity in the phase that comes next and our instantiation of those phases, because that's, I think, what happened in the movement from Christendom into modernity and even in the movement from the pagan into the Christian era. And so as we travel, we try to say, okay, we'll concede that we got a discrepancy on the date here, but let's also understand the value of what is clearly valuable to us now. And these things are hard to all. And I think the culmination of the eminent, the emergent and the eminent coming together is in fact the fruition of all things. That's what we're looking for, even in our project."}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":6577.01,"end":6640.99,"speaker":"John Vervaeke","text":"I agree. I think that's good. So there's something that's occurring to me that. So it sounded to me, because what you said about trying to keep the two. And it sounded to me what Jonathan was saying is like, that's why I use the word anticipation, because it's not quite the same thing as prediction. Prediction is third person. Anticipation is transjective. It integrates the third person and the first person together. Right. I can predict the end of the universe, but saying that I anticipate it makes no sense. Right. But I anticipate, you know, going to work later in the day or something like that. So. Because it's. What I'm saying is it's not just propositional, it's procedural and it's perspectival and participatory. And then what I heard Jonathan saying is, you know, that there are, and I agree with this, there are kinds of predictions and they're also post dictions because you're also not. You're not just. You're not Just anticipating future patterns and pretend, right, you're also picking up on perennial patterns. Is that fair? And that's what I mean by post diction or maybe always diction rather than prediction and post diction, maybe we'll coin a new phrase. Always diction."}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":6643.23,"end":6645.55,"speaker":"Paul Vander Klay","text":"That's a good word for all of Jonathan's work."}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":6647.87,"end":6767.08,"speaker":"John Vervaeke","text":"And so what I heard Jonathan saying is that if you'll allow me, and you both know that I use this word in a non pejorative fashion, that there's something like mythic anticipation or mythic always diction that's important and valuable. And then what I'm trying to get at with what you just said, Paul, is. Yeah, but you know what's also really good at, we're really, really good at prediction is the scientific worldview. It's really good at detecting patterns. And remember, science isn't what it state. The content of science is constantly changing. This is a mistake. This is, I think this is the fundamental mistake of scientism. Scientism is to equate science with its current products. Science is a process of overcoming self deception in the ways we try and detect patterns. And you know, it's really powerful for distinguishing causal and correlational patterns, constitutive patterns from causal patterns, et cetera. That's very, very powerful. And so I'm looking for a way of trying to get these two to talk together. Because if what we're ultimately about is pattern detection, then I'll use your term. Now the narrative we need is one that has to encompass this tremendous process. Again, do not equate science with its current claims. That's a ridiculous thing to do. That's like equating you with what you say right now in this moment. That's a mistake. That's the mistake of scientism. I acknowledge it. I reject that mistake. Science is a family of processes for overcoming self deception in order to enhance pattern detection. And if that's what we're talking about here, science has to be included and it can't be included as like sort of the somewhat, the somewhat daft second cousin or something like that. It has to have an important seat at the table. That's what I'm arguing for here."}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":6767.96,"end":6952.93,"speaker":"Jonathan Pageau","text":"No, I think you really pushed a button in my own little polemic attitude, which is that because science has been treating me like the daft cousin for a few centuries, I want to turn around and slap it around a little bit so that it stops being so arrogant. But I agree that ultimately you're right. And I think that that's why I'm excited about this, these new horizons coming out of cognitive science, because I feel like the return to consciousness or the understanding of the effect of consciousness and the relationship between unconsciousness and meaning making and how that in a way fills up, kind of fills up the horizon of our understanding where you realize the inevitability of understanding consciousness. If we want to go further in understanding the way the world lays itself out, then I think that it's there that we're going to see the biggest connections between the two sides or the mythic side and the more technical side. You know, because you're right in terms of mythical. When you talk about mythical prediction, that's what Revelation is. Revelation is mythical prediction. It uses all the patterns of the Old Testament. There's nothing in Revelations, almost nothing in Revelation. But which is not in, like the book. In the book of Revelation, Ezekiel or. Yeah, in the book of Revelation. There's nothing that's not there in all the other books in Scripture. It's actually, it's taking these prophetic patterns of seeing the pattern of reality using imagistic language and is now telling you, putting it into a predictive mode where it's saying this is what you have to expect in terms of patterns as the world, kind of as the story plays itself out. And so because a lot of people don't see it that way, it's one of the reasons why they don't understand it because they always want to. They're always wanting to just identify, like, who's that figure, like who's what historical figure corresponds to that figure in Revelation. I think that that's, that's missing the, missing the point in terms of pattern making. But anyways, I'm kind of off the track here, but I totally think that you're right. And the image of the, of the. And I'm going to put my last little. The image of the last age in Scripture, the final image is the city. It's not, I always tell people, I always remind people, it's not. It's not the garden anymore. Or the garden is surrounded by the city. And the city is exactly that image of a technical understanding or, or technical realization. And so it has to. It becomes a form of glory in the end. Although it was in the narrative of Scripture, a result of the fall. And it kind of imagined like a desire to fall, right? Yeah, exactly. To protect yourself, to cover yourself, to create these buffers so that you. So that you're protected from the outside world. It ultimately ends up being a kind of glory in the. In the last moment."}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":6952.93,"end":6974.57,"speaker":"John Vervaeke","text":"We could say, jonathan, you really do have a genius for symbolic thought. Like, you draw things out that I've never seen before. I just want to compliment you on that. It's a sincere compliment. It's impressive. There's an artistry to it that I just. I respect. I think it's really powerful."}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":6975.61,"end":7004.07,"speaker":"Paul Vander Klay","text":"And I would just tweak the book of Revelation a bit, because I think the book of Revelation is Old Testament prophecy plus the revelation of Jesus Christ, because that's actually the new element between Ezekiel, Daniel, and the children of Cain as it arrives there in the new Jerusalem. But, you know, I think that's. No, this has been excellent. Maybe we should. Maybe we should land."}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":7004.07,"end":7008.63,"speaker":"Jonathan Pageau","text":"We probably should. We're going for two hours. I'm rarely able to go for two hours in a gallery."}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":7008.95,"end":7049.29,"speaker":"John Vervaeke","text":"I think we should maybe close it off here. I feel one of my criteria, my mark of Dialogos, is where the participants get to a place that they couldn't get to on their own, where everybody feels that they got to a place collectively that they couldn't get to on their own. And that's, you know, and I don't mean this sacrilegiously, you know, Jesus. Where two or three are gathered in my name, there I am also, you know, that something more than just the three of us, something emerged. But the emergence also disclosed the overarching sacred canopy of emanation. For me, at least, in this. And so I wanted to thank you both for this. I thought it was great."}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":7050.17,"end":7081.62,"speaker":"Jonathan Pageau","text":"Thank you. I really, really appreciate it, too. I think one of the things that I noticed is that every time I talk to both of you, I end up on paths that I've never been. And I say things that I've never said. And I realize, and I wonder, like, why have I never said that before, as I'm saying. And so it's actually, for me, it's like a wonderful trip to be like, oh, yeah, this is like pulling things out of my mind that I had never said. And so it's always a good. It's always a wonderful trip to be one with you guys. So I appreciate it."}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":7081.94,"end":7091.74,"speaker":"Paul Vander Klay","text":"I agree with everything that's been said. So thank you both. And I will. I will send this. I will. Once this is rendered, I will send it to both of you."}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":7091.74,"end":7095.34,"speaker":"Jonathan Pageau","text":"Yeah, we could. We could just all post it on a channel. I think that would be fun. Like, all."}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":7095.9,"end":7107.1,"speaker":"John Vervaeke","text":"We'll post it all. I'll post it on my channel today. And, Jonathan, you can do when you watch. And I would not to obligate anybody, but I think this was valuable and I would like to do it again at some point."}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":7107.74,"end":7109.5,"speaker":"Jonathan Pageau","text":"Yeah, definitely."}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":7110.11,"end":7110.51,"speaker":"John Vervaeke","text":"All right."}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":7110.99,"end":7111.87,"speaker":"Paul Vander Klay","text":"Take care, gentlemen."}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":7111.87,"end":7112.83,"speaker":"Jonathan Pageau","text":"All right. Bye, everybody."}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":7113.55,"end":7114.27,"speaker":"John Vervaeke","text":"Bye. Bye."}
{"episode_id":"SW - #117 - 2020-09-22 - Paul Vanderklay and John Vervaeke - Emergence and Narrative","start":7116.27,"end":7181.23,"speaker":"Jonathan Pageau","text":"I hope you enjoyed this episode of the Symbolic World. The Symbolic World is edited by Justin Ward and it is based on a series of videos that you can find on my YouTube channel, Jonathan Pageau's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course, leaving a review on itunes. Everybody knows that's the best way to get the podcast out there to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon Pageau videos as well and on subscribestar. All those links you can find on my website or in the show description. So thank you and I will see you soon."}
