{"episode_id":"SW - #390 - 2025-05-06 - Genesis - Symbolism in the Creation Story","start":0.16,"end":62.09,"speaker":"Laura Diaz","text":"Tucson, the weight is over Mediweight loss. They're officially open on North Oracle Road. That's right. No more counting down the days. You can walk in right now and start your journey to a healthier you. Hey, it's Laura Diaz from iheartradio and you can trust me. This isn't just another weight loss clinic. I know that because it's where I lost weight safely with real medical support. GLP1 medications. You can see them everywhere online right now. But the truth is your health shouldn't be a DIY project ordering these meds without the professional guidance. It can lead to dangerous mistakes, wrong doses, no oversight, and serious risks at mediweight loss. I got the same medication but with a customized plan, weekly check ins, and a licensed physician guiding me every step of the way. And the cost? The same as those risky online options. Tucson, your moment is here. If you're ready to take control, feel better and lose weight the right way, mediweight loss is ready for you. Walk in, get started and see real results. Call or visit mediweightloss.com to learn more and book your free consultation today. That's mediweightloss.com a few years ago, I."}
{"episode_id":"SW - #390 - 2025-05-06 - Genesis - Symbolism in the Creation Story","start":62.09,"end":4186.97,"speaker":"Jonathan Pageau","text":"Was invited by the Jung Society of Montreal to give a talk. I was a little overwhelmed, of course, because, you know, people know that I'm not that big of a fan of Jung. But also I know that many of the people that read Jung are quite intelligent and do have a good sense of symbolism. You know, the reasons why I struggle with Jung sometimes he does have good insight. That's not the reason why I struggle with him anyways. And so I accepted to do it and I thought I'm going to really try to up my game and I'm going to try to pull the story of Genesis together into a symbolic description. Made a lot of effort to bring it together and it turned out to be one of my more successful lectures, I believe. And in fact, it's already been posted online on Jordan Peterson's channel and it's the only video I've done that it's just me talking that has more than a million views. And so I think that I did hit the nail somewhere. Interestingly enough in this video, I didn't know that Jordan Peterson was actually going to be in the audience. And you know, I had the zoom in front of me with all the different people and I'm giving my lecture and at some point I see that Tammy Peterson is there and I'm like, oh, Tammy's there. And then all of a sudden, I see Jordan appear in the Tammy Peterson window, and I was like, oh, that's hilarious. And it was at a time when he was still kind of coming back from his disease, and I hadn't had that many chances to see him or to talk to him. So it was really a nice moment for me to kind of see him appear and to see that he was doing well. And so we thought that, you know, now that I'm getting ready to bring together Symbolic Thinking into a symbolism masterclass, which is starting this week, thought it'd be a good idea to revisit this and to post it on my channel, because it's never been posted on my channel. And so if you haven't seen this video, I would say, please enjoy. And if you've already seen it, it might be a good idea to re watch it, because there's a lot in there, and I feel like it's a place where I was able to pull symbolic thinking together in a pretty coherent way. So please enjoy. This is Jonathan Peugeot. Welcome to the Symbolic. Well, hello, everybody. Thank you for inviting me. This is really a wonderful opportunity. I'm surprised to see some people that I know in the. I'm kind of looking at the mosaic here of everybody. Not everybody, but some people. So I'm surprised to see some people that I know and then some people that I don't know. And so what I want to do with you today is I want to kind of take you on a kind of symbolic trip. I want to present to you, first of all, the, let's say, the source of the symbolism that I tried to present. The frame, you could say, of this symbolism. I'm going to present it maybe in a little more of. A little more of a technical way that I usually do in the. In the more kind of colloquial way that I do on YouTube. So hopefully that'll be okay. And then what I'll do is I'll take you on an example of this symbolic pattern, very basic example, which is we're going to read the first chapter of Genesis together, and we're going to try to look at how it kind of manifests the symbolic pattern and how this becomes a kind of map that you can use to interpret the world, but also a map, especially a map that you can use to inhabit your life. And so we'll see that symbolism is also not only about interpretation. I mean, as Jungians, you know that it's a way to be in. A way to kind of inhabit the world. And so there's an interesting moment right now, I think, in the zeitgeist, in the culture, something like the end of materialism or the end of physicalism. We saw, of course, I think that Jordan Peterson has played a big role in poking at this, you know, kind of poking at the New atheist, this last weird New atheist moment that we had in the early 2000s. And so what we're seeing is kind of materialism running to its end. And it's happening in physics with the problem of the observer. It's happening in things like just this notion of complexity or complexity theory, the problem of emergence. All of these things are bringing materialism to its end. And the way that I like to understand it is that for a while we had this kind of weird duality of mind and body, or mind and matter, where we abstracted the mind into this place that we didn't talk about. And then we look at the world and we interpret reality as materialism ran its course, as this scientism ran its course. At some point, you could say there is something of a little moment, a surprising moment of pride, where as we're exhausting the things that we study, people realize that, well, there's this one thing that we haven't studied. It's the thing that's looking at everything else. We're studying the world, the world, the world. But all of a sudden we realize that there's a viewer that's doing that, studying. As soon as the materialist eye, you could say, turned towards the viewer, turned towards the interpreter, turned towards trying to understand consciousness, trying to understand meaning itself, then things become very loopy and certain. The simplicity of the dualistic model stops to make sense. And this happens very much in terms of evolutionary thinking. What evolutionary thinking did in some parts is try to explain the motivations of humans. When you start to do that, you have a problem, because this human who's talking about evolution is what you're trying to interpret. And so you're actually interpreting the interpreter. And so what has happened is that it's opened the door to all kinds of questions. The problem of emergence, the problem of quality. And one of the big things that's happened is the problem of attention. And this has been manifesting itself in different fields. And it's realizing that the world is too complex, that the world actually is kind of indefinite in its complexity. Everything you look at, everything you encounter has an indefinite amount of complexity. It's made of parts. And those parts also have an indefinite amount of complexity. And you can just scale that down to the quantum field or whatever many thinkers realize. How is it that. How does this work? How do things scale up between different levels of phenomena? How is it that I can look at a chair and see that the chair is both one thing, It's a chair, but it also is many things. And those many things are also many things. But I can perceive at every level of reality that there's unity. So I can notice a leg of a chair and I can notice the color of the chair. But I can also see that all of this participates in the being of the chair. And this is like a hard problem. It's a difficult problem because it ends up infecting all of meaning making. And it infects science and infects. It's not an infection, it's actually a kind of healing, I think. But it kind of seeps back into science and seeps back into. Back into the very way in which we understand the world. And we realize that we have difficulty accounting for the qualities of things using descriptive means. That we have difficulty even accounting for the identity of things using descriptive means. So once we have the identity, we can describe things. But the identity seems to emerge from somewhere else or come from somewhere else. And kind of brings multiplicity into unity. And so what's fascinating is that, like I said, it has opened up all of a sudden the possibility for people to kind of. To understand ancient thinking in a way that until recently was very difficult to understand. So if we understand. So we realize that the world has to be patterned, that there has to be patterns in the world. And this is more than just a psychological reality. It's not just about describing the psyche of the human person. It's actually a descript, a cosmological argument. It's an argument about how reality works, which is that for things to exist, they have to be patterned. And those patterns seem to stack up at different levels of reality. And also seem to exist in smaller patterns, seems to exist in bigger patterns. You can think about it physically or think about it any way you want. And this actually seems to be something which is inevitable for us to be able to even encounter the world. Now, what that means is that it brings back the idea of intelligence, the idea of consciousness. And it can reconnect us to how the ancients talked about it. Some people are talking about something like the revenge of Aristotle, right, Or the revenge of Plato. Because suddenly when we talk of. When we. We have to reenter our experience and try to analyze our experience, we realize that, oh, actually when Aristotle talked about potentiality and Actuality, I experienced that every single day of my life. I actually encounter the field that presents itself to me as potential, which is brought into patterns, brought into actualities that I need in order to be able to exist. And those actualities, those patterns, they're not just mathematical patterns or ideas in the vague Platonic sense that people have, but they're actually teleological. They're purposes. And these purposes, they can be regained from evolutionary thinking, which is just the strangest thing in the world. Who would have thought that Darwin would bring Plato back? But when we reenter evolutionary thinking, we realize that we need purposes in order to encounter the world. So it's like if I this cup, the fact that I recognize it as a cup is because I recognize its purpose, its purpose to me as a human being. And that actually scales the hierarchy of purposes. Even in terms of science, right? People think that science is. Is just a study of phenomena. But we always forget that science is embedded into us, into social systems. And that, for example, the science that will get the most attention will always be the science that is the most fascinating or useful for humans. And the science that will get the least attention, which means the least money, the least effort to study, will be the things that are the least useful for humans. As soon as you re embed science into its actual social frame, then all of a sudden this hierarchy just reappears again. This ancient hierarchy, which is basically, you could call it something like the religious hierarchy. So what it does is that these patterns, these teleological patterns, these patterns with purpose come back into the way in which we actually exist in the world. So you can understand that ritual suddenly makes sense again. Not only does it make sense, but it's actually inevitable. And you can see everything you do through ritual because everything you do in the world is patterned teleologically. It's patterned towards purpose. And sometimes, let's say, there are moments in which that purpose will break down. But that is also part of the, let's say, great ritual, which usually involves something like carnival, which involves aspects of chaos. On the edges of these patterns. You realize that drinking a cup of water is necessarily ritualized. It has to be teleological, and it has to have a certain form. I have to do certain things in a certain order in order for me to be able to achieve the purpose that I'm reaching with my cup. Now bring this into the human sphere. It's the same when I encounter someone. My encounter necessarily has to be ritualized. And you can realize that it has to be ritualized. Because if you try to do the opposite of the ritual, you're going to get some funny reactions. Try to talk to the back of someone's head, for example, for a while. Or just lay down on the middle of the ground while you're speaking to someone. And you'll realize that human relationships are extremely ritualized. We speak and we feel the tension. It's really like a rubber band. You speak and then you have to stop speaking and you have to listen. And so there's this kind of wave, this back and forth wave, this call and response you could call it. That happens in a conversation that if you don't follow that pattern, you're going to break the relationship. And no one's going to want to talk to you anymore. And everybody knows someone like that. And everybody sometimes has fallen into that excess where they've talked too much and they realize it, or they haven't talked enough, they just listen and didn't give their opinion. And the other person feels like you weren't there. So we can see that this is how it works. Now, you can scale this pattern up from simple human interactions, from simple human engagements with objects, into social interactions as well. That is, we realize that in order to have teleology, in order to have purpose, and in order for a group to have purpose, it has to encounter itself ritually. It has to have things which bind it together, which make the group recognize that it is together. Because the problem of multiplicity and the problem of complexity happens especially in terms of human interactions. What's the difference between a group and a crowd? What's the difference between the team and a crowd? There are a bunch of people that are together, but one of them is not bound teleologically and the other is a team is bound teleologically. It's a soccer team. They are bound towards a purpose. They're bound towards a common. A common identity. And that common identity will manifest itself in ritual. And the ritual include those rituals include the rules of the game, the rules of engagement. Those rituals also includes other things which are more related to identity. And this is something which will bring us straight into religious ritual. That is, those rituals include the capacity to attend to the thing that binds us together. And this is when we're going to start to realize that this pattern is almost first and foremost the pattern of attention or the manner in which we're capable of paying attention. And so a team will have to attend to those things that bind them together. And what that will look like will be something like celebration at the Fear of sounding somewhat scandalous to people. It's going to look something like worship, like a little worship. It's going to be a celebration of the thing which binds us together. Reverence towards the thing that binds us together. I don't want to. I use the word worship to scandalize you a little bit, but, like, reverence is fine, right? And so they will have to reverence their team colors. They have to reverence their team name. They have to have a totem, a mascot, which will represent them in a mythological. With the mythological frame as a kind of an animal or some. Some figure that has more social connotation, that will bind their identity together. And then they will also be bound, you'd say, on the human level, through a person who will represent their ideal, the team captain, the coach, at different levels in this kind of hierarchy of being. And so you will see that a sports team, but not a sports team, a knitting group, or anything that is bound together will necessarily have to have these elements at different levels of reality. Now, one of the aspects is that it will also have to judge what is inside and what is outside. And what will be the judge of that? Inside and outside will be their reason for existing. And so you could say the logos. And to use a Christian term, the logos of the group will be that which binds together, which joins the body into one, but will also be that with judges, those that are inside, to bind them, but also to exclude them. And so think of a knitting group, for example, right? You have a knitting group, a bunch of people come together, they knit together. That's what they do. And so there's a ritualized reality to that, which is that when they meet, they're going to knit. Now, as they're knitting, they'll probably do other things as well. Well, they'll talk, they'll chat, they'll talk about their lives. They might, you know, someone might bring something to eat. And this is all going to kind of organically participate in the knitting group. But let's say that at some point someone comes and says, well, you know, oh, I like this knitting group. I like to be with this knitting group, but I don't want to knit. I want to play music. And so they're like, okay, well, maybe one person playing music while we're knitting is not a big deal. And so, you know, they play music. And then that person invites someone else and says, I like this knitting group, but this music playing is pretty cool. So what if I brought my instrument and then we start playing music? So imagine now that process going on to a point where, well, okay, are we a knitting group? Are we a band? What's going on? We have to decide, we have to judge. Either we exclude these musicians or exclude their practice, or we cease being what we are. We die. Basically, this knitting group is going to cease to exist. It's going to be transformed into something else. This is how this pattern acts as the attention that we give towards the teleology of the group will also act the logos of that. The reason, the purpose that I'm looking at will look like a binding agent, but will also look like a judge. And so, like I said, this is how all kind of reality works, or all of how reality lays itself out. This is it, folks. This might just be the culmination of my life's work. Join me for the symbolism masterclass this April 2025. During this course, I'll take you by the hand into the essentials and depths of symbolic thinking. Over six weeks and over 18 hours of lectures and Q&As in a concise and comprehensive way, I'll teach you everything about how I think, so that by the end, you might see the world anew. This class will not only be an introduction, but also a deep dive into a way of seeing that cuts right through our secular dead end. It reconnects the ancient religious ideas with some of the most cutting edge notions of complexity developed today. As the world is shaking and changing at an increasingly rapid pace, being able to read the patterns of reality will give you an anchor and a solid sense of what is up and what is down. In this class, we will talk about so many things, about heaven and earth, the sacred and the secular, the Bible, dragons, demons, fairies. We'll explore the surprising value of conspiracy theories, how symbolic patterns are found in movies, in science, philosophy, art. We'll look at the relationship of symbolism to natural selection. We'll look at the basic patterns of the world, of sacrifice, of the center, the margin, the masculine, the feminine, the mountain, time and space, left and right. It will be a synthesis of everything I've covered in the 500 YouTube videos that put out over the years, and much more as well now, all in a structure that has one purpose, which is to make you a master of symbolic thinking. This is your opportunity to get to the core of what symbolism is, to ask questions, to test out your ideas, and to make sure you have a strong foundation of the fundamentals. Plus getting some hidden gems that I've never shared before. So don't miss out on the live experience and register Today, of course, as usual, patrons at the involved level or plus get 10% off indefinitely. But also, if you sign up before April 6, you can get 15% off with the code MASTERCLASS1. And so I will see all of you in class. What I want to do is I want to show you that this pattern that I'm talking about is really just. It is a cosmological argument. It's an argument about how reality works. What it does is that it argues about how reality works based on the notion that intelligence is necessary for reality to unfold. This is something which is bubbling up. It's not something which is. That everybody agrees with in the world, but it's something which is bubbling up. And we're seeing appear in different fields, even in science. We're finding some physicists who are arguing what they call the strong anthropic principle, which is that consciousness or intelligence is necessary for the world to unfold. Because intelligence is the only thing which is able to discern pattern. And not just discern, but it's like a. It's not just a discernment. It's a participation in pattern. Right? Because the agent, the pattern, ends up coagulating in the agent, you could say. And so the conscious being sees these patterns, but also engages with these patterns and transforms these patterns. It's not just a. So it's not just a passive. Can I say, it's not just a passive relationship to the world. It's an active, embodied relationship to the world. Okay, now, before I give you. Before we go on the example, I want to say that this. Once you kind of enter into this way of thinking, it has certain consequences. And one of the consequences is that the intelligent perception, the perception of the embodied intelligence becomes the primary mode of engagement and interpretation in the world. When I'm saying this, this is extremely important because we tend to abstract and become scientists. We think that that is the primary way to interpret reality. And we do it. We all do it. We analyze. We're analysts. We look at the pattern from outside. We try to stand above and say, well, look at that interesting pattern in that culture and look at that interesting pattern in that culture, and look at how nice it is that they're the same. And we're kind of like these disembodied beings that are just looking at the world, supposedly. But once you realize that, once you realize this notion that intelligence is necessary and this ritualized embodied reality is necessary for the world to appear, then it changes everything because you have to embody the real way to Engage the world is the embodied way. It's not that we're standing above the stories and we're interpreting the stories. It's not that we're standing above the images and we're interpreting the images. We are in a story. We participate in a story. We participate in communities. We participate in images. They are our communities. They are our images. They are the things that make us exist as we actively engage with them. That's why if you look at the way that when David at the beginning said that Jonathan is an artist, this is extremely important in my theory about reality, is that it's not. It's like I'm presenting it to you in a way in the theory, but this presentation that I'm giving you, this is secondary to what is really going on. What is really going on is that to the extent that I'm capable of. I get up. I get up in the morning and I physically carve sacred images. I go to church on Sunday and I physically participate in the rituals and the liturgy. I sit there with my family around the table and I eat a meal. And I realize that this meal is a smaller version of the ritual that I'm engaging in on Sunday morning with my parish. It's an embodied reality. It's an embodied engagement with the world. Like I said, it's a pretty radical. It's very radical. Sometimes people don't realize how radical the proposition I'm making is. The proposition I'm making is. Is that if what. The things I said are true, that means that the. The only way for them to be fully true is for us to dive in and embody. While realizing, of course, and while being aware of all the problems that come with this pattern as well. There are many problems which come with this pattern because I said, right. One of the issues of the reality of being engaged in a group that has a teleology, that has a purpose and is that it excludes. That's the very nature of a group. A group excludes. Groups always exclude. That's why they're a group, because they're not the totality of all manifestation in the universe. They necessarily need to exclude. I mean, even if you want to be inclusive in the kind of, let's say, politically correct way, you're still going to exclude animals from your group, or you're still going to exclude rocks from your roop, you necessarily have to exclude. Because you're not God, right? You're not the totality of everything in order to kind of move teleologically in the world. You have to exclude. And so that has a problem, that has difficulty to it. And so. But there are ways to kind of, let's say, to deal with those in a manner which won't make the group completely self devouring and also won't make you kind of fall into the chaos of thinking that just that nothing has identity and everything is just a mush of potential, let's say. Okay, so hopefully, if that's clear, what I want to do is I'm going to go into the first chapter of Genesis and show you how the creation narrative, it's a very, very wide story. It's a very very. It's a huge narrative. Obviously I can't exhaust it, but I want to show you is that the manner in which it shows that the world manifests itself through intelligence, through consciousness, and that this is actually the agent of how reality comes together and how we participate in that as intelligent beings. Okay, and so hopefully you are a little aware. I will go through the verses, but I mean, I'm not going. I hope everybody's a little bit aware of the creation narrative in Genesis enough that, that you'll be able to at least follow. All right, so here we go. Okay, so Scripture starts, it says in the beginning, God created the heavens and the earth. Now the earth was formless and empty. Darkness was over the surface of the deep, and the Spirit of God was hovering over the waters. So what we have are first a setup of one thing which seems to be outside of the system, but is related actually to the top of the system. You have God who is in the beginning. The beginning can be interpreted as the head. The actual word means the head of something. It also means something like the principle or the origin. All of these words work into in the beginning. And so God is in the beginning and he separates heaven and earth. And the characteristics he gives of heaven and earth. Is that because he says that the Spirit was hovering above the water. Now we have to see the Spirit hovering above the waters as a repetition. You'll see it's all going to be repetition and showing you what the pattern is. And so the Spirit hovering above the water is the same as heaven. Heaven is just wind, right? We have to be immediate about this. Heaven is that are the things that you can't see, like wind, you can't see, like your breath, you can't see, like speech, you can't see. All of these things are things that you. That you can't see. And then so it separates heaven and earth. Two basic principles of reality. The Earth is void, it's empty, it's silence, it's water, and heaven is spirit, wind, breath and speech. At first, we basically just have two categories. The implications of these two categories are not going to be clear right away. They're going to start to manifest themselves. But you can already understand it as something like spirit and potential, or actuality and potential is actually totally fine. To see it that way. Dante completely joins together the Aristotelian categories of actuality and potential. And in the creation narrative, the idea of heaven and earth as these two basic principles. And so this is just this, right? It's no different. It's a universal category. It's there in every culture that exists, this idea of this basic separation of heaven and earth, and it is completely based on our actual experience in the world. And if you can't kind of re embody yourself and realize that this distinction is a very simple and clear one, you're going to struggle to understand what the meaning of it can be. Because as you're standing there, like, imagine yourself standing there on the ground. All light comes from above. Wind comes from above. The things that are above are unreachable. You can't touch the stars, you can't touch the sky, you can't touch the sun and the moon. All of these things which give you light and which are the source of wind. Invisible movement. Think about it that way. Think of wind as invisible movement, as invisible patterns of transformation. Okay, see, think of it that way. So you have all of this above you, and then below you have a world that you knock your foot against. You have a world that you can touch, that you can count, that you can get dirty with, that can kill you, and that is also dark, right? It hides the sun. If you take something that's on the ground, you take a rock and you put it above your head, it's going to hide the light from you. This is very embodied. This is very, very. But what it does is it separates two basic categories of real. When God said, let there be light, and there was light, God saw that the light was good, and he separated the light from the darkness. God called the light day, and the darkness he called night. There was an evening and there was a morning. The first day. So now it starts to become clear. You can easily understand, of course, if you can embody yourself, that light has to do with heaven, has to do with spirit. It's above. And then darkness has something to do with this void. So you don't necessarily have to represent it below, but it becomes analogous to below. Because it's the moment when the light stops being. It's the moment where the light stops showing you what the world is like. So I'm placing it like this for you to understand. You wouldn't necessarily have to put night at the bottom. But this is a good way to kind of see light, dark, earth as void and empty and heaven as wind, spirit, breath and speech. So God, sorry, let me say. So God is above and he speaks and light comes down on the world. So then God says, let there be a vault between the waters to separate water from water. So God made the vault and separated the water under the vault from the water above it. And so it was. So God called the vault sky. And there was an evening and there was a morning, the second day. All right, so already you're starting to see something like a narrowing. You have heaven above, but now you have like a second heaven which is like, okay, what's going on? You have the water that is below. It's kind of split into the earth that is below. It's kind of opened up. And now we have a pattern which is similar, which is setting itself up inside the world. You're going to start to see that this pattern of attention is fractal. Just like the way in which multiplicity moves into unity in any object in the world or in any community in the world. World happens at every level of reality. And this is what is going to start to appear to you, is that the pattern just repeating itself at different levels until it comes together in the middle. Okay? And so we have these waters being separated, and then we have now a secondary heaven, another heaven which is also above, but it's something like inside the earth. The Earth now is obviously not the earth exactly the way that we understand it, but that the inside, the things that are visible and are quantifiable. Now, Augustine said this clearly. He said everything you see and when you look up in the sky, all the things you see, the sun, the cloud, the stars, all of this is the Earth. All of this because it can be quantified. But it the second heaven, those things above that actually can be seen and identified, they are like a secondary heaven. There are pointers towards something which is truly invisible, you could say, or patterns that are truly invisible. I mean, I don't want you to think that I'm being all esoteric here. It's like the world has a pattern, let's say day and night. That's a pattern. And the thing that manifests that to you, that you can recognize that it is a pattern is those shining lights up in the sky that move. The shining lights up in the sky, they move and they reveal to you a regular pattern. The regular patterns of reality are in the sky. The more embodied, irregular patterns are in the world. They're still there, but they're more irregular. But the ones in this heavens are regular. Every day the sun comes up. Every day the sun goes down. The moon has its phases, the stars move in the sky. And so it's completely natural that these heavenly bodies are pointers to patterns. They point us to patterns. They point us to the invisible patterns, you could say, even though they are obviously visible. Okay, so God said, let the water under the sky be gathered to one place and let the dry ground appear. And it was so. So God called the dry ground land and gathered the water, and the gathered waters he called seas. And God saw that it was good. Now, I want to point you here something that I haven't pointed to yet before. So now think of the problem of intelligence that I'm trying to present to you. And this kind of embodied or active participation in the way that reality manifests itself to you teleologically. So God says, and you can imagine it like God says, is God shining light? Okay, so imagine a high in the sky and that a sun, an eye. The sun is the same thing as an eye, let's say. And this is shining light down on the world and is showing you things. And that has to do with identifying. When you encounter something that you've never seen before and you see it, what is it that you want to do? You want to identify it. That's your job. Your job is to identify. If you don't identify it, you don't know if it can kill you. You don't know if it's dangerous. You have no idea. And so there's a direct relationship between seeing, speaking in the sense of identifying, naming. You could say, okay, so God speaks. Identifies as light, comes down from heaven, manifests itself on the thing, and then God speaks it into being. But then he sees its relevance. He recognizes that which is manifesting itself to him, and he says that it's good. He judges it right away. God judges. Now think again of your experience. Think of your just basic experience. You walk into the room, you see the glass, you identify it. And immediately you ask yourself, consciously or unconsciously, you're always asking yourself if it's good. This is necessary because the reason why you even perceive the glass in the first place is because you use it to drink water. You always have to ask yourself if it's good or not. Is it a good glass? This is true about everything that you encounter. You don't even do it consciously. This is true of everything you encounter. As you're walking on the grass, you have a system which is constantly judging because it has to be able to recognize if there's a hole. It has to be able to recognize that there's an object in your way. It's looking at the ground, at the grass that you're walking on, or the path. And it's always identifying, naming and recognizing whether it's good. Hopefully this makes sense. All right, so now we're really going to start to see this fractal pattern start to appear more clearly. So you have the basic structure, you have the very invisible patterns of head, principle, origin, wind, spirit, breath, speech, which is completely above. And now you have the void, empty, silent, question, puzzle, darkness, potential. All of this is below. Now, at every level of reality, this is going to start to appear as being the same pattern. And so, like I said, the potential and the actuality of the glass is relative, obviously, but it points to the pattern itself, to the pattern of identity and potentiality itself. And so this is why you're going to see at every level, it's going to repeat. So you have the secondary heavens, which are the sky, and then you have the secondary earth. Now in the secondary earth, the same pattern happens again. God creates dry ground and separates it from the waters. Dry ground is above, it's higher than water. This is just basic experience. Dry ground is higher than water. Dry ground is the place where you live. Dry ground is the place where you find meaning because that's where you build cities. That's where you do things, that's where you eat. All of this is from the dry ground. That's where you can breathe air. You can encounter spirit from the dry ground and light, but you can't in the sea, right? In the sea, if you stay there too long, you die because you run out of spirit, you run out of meaning, you run out of air. All of these analogies play themselves out. So imagine dry ground as a mountain is the best way to understand it. You have this mountain and then at the bottom of the mountain or around the mountain, you have the sea, which is an image of the original chaos, the original potentiality. Now at a different level. Then God said, let the land produce vegetation, seed bearing plants and trees on the land that bear fruit with seed in it, according to the various kinds. And it was so the land Produced vegetation, plants bearing seeds according to their kinds, and trees bearing fruit with seed in accordance to their kinds. And God saw that it was good. And there was an evening and there was a morning. The third day. Now, here, notice again what is going on, right? So God says, let the land produce vegetation, but not just produce vegetation. What is he saying? He's saying, produce seed bearing plants. Why seed bearing plants? What a strange thing to say. He's saying seed bearing plants because once again, in this pattern now, the seed is the identity and the vegetation is the variation or is the bottom part of this pattern. So he's repeating the pattern. He's saying you need a way for this identity to recognize the identity of the plant. That's the seed. The seed is the manner in which you recognize the identity of what you're encountering. So you want reality to have stability. This is how we work in the world. We have to be able to recognize the different plants. And in that pattern, what there is, is there's both identity and variability. So we're moving towards a kind of multiplication. But this multiplication always has to be a recognition also of the identity of each plant and how these plants are different from each other and how they participate in a major pattern of the plants. So you can see this fractal process just kind of continuing. Then once again, the same thing. God says the identity is in the. God said it's in the seed of the plants. And then the plants kind of manifest its variability. God sees and judges and says that it is good. So now you can see same thing, the dry ground. On the dry ground, you have the same pattern of above and below, right? Identity, spirit. Obviously it's not spirit in this case, but identity and variability. All right, so we continue. So God said, let there be lights in the vault of the sky to separate the day from the night. And let them serve as signs to mark sacred times and days and years. And let them be lights in the vault of the sky to give light on the earth. And it was so God made two great lights, the greater light to govern the day and the lesser light to govern the night. He also made the stars. God set them in the vault of the sky to give light on the earth to govern the day and the night and to separate light from darkness. And God saw that it was good, and there was an evening, and there was a morning, the fourth day. So now in the heaven, even in the world of meaning, the same pattern appears. So the pattern appears below in kind of the world of manifestation. You could say as A fractal pattern, but it also appears above in the pattern itself. And so we have these signs in the sky. They are signs to mark the days. They are signs for you to identify the pattern of reality. There's one of the major ones, one of the major lights which is there to govern the day and one to govern the night. So you have light and dark even in the heavens. The pattern is fractal all the way through. Every day is going to be like that, just spoiler here. And God said, let the water teem with living creatures and let birds fly above the earth across the vault of the sky. So God created the great creatures of the sea. Sea monsters. It doesn't say. They don't like to say sea monsters. But great creatures of the sea mean sea serpents and sea monsters. All these demythologizing Biblicists are the worst. It just means, it means sea monsters. God created the great creatures of the sea and every living thing with which the water teems, that moves about it according to their kinds and every winged bird according to its kind. And God saw that it was good. God blessed them and said, be fruitful and increase in number and fill the water and the seas, and that the birds increase on the earth. There's an evening and there's morning. The fifth day. Now this is where you're going to start to see what's really going on. Because until now you might have thought that what I'm saying is just a bunch of like, just random interpretation. But here you. It becomes impossible not to see. Why on earth would God create birds and fish on the same day? What is happening? It's the strangest thing in the world, it seems to us. Doesn't make any sense, right? Well, it only makes sense if we understand that he's constantly establishing the repetition of the heaven and earth pattern, of the above and below pattern, which is started from the beginning. And so he creates the birds above and the sea monsters below and. And the fish. So even in the sea he separates fish and sea monsters. The fish are those that you can eat, that you can encounter, and the sea monsters are those that are going to eat you. Right? There's a difference between the two. So you have the fish and the sea monsters, but even in this whole pattern you have the birds and the fish as framing again the same duality which is being framed from the very beginning of the text. And you have to understand that that's what's been going on from the beginning. Because why would God create vegetation before he created the sun and the moon. It doesn't make any sense in terms of science. How can you create vegetation first and then create the sun? It's completely logical in terms of a scientist, but in terms of a pattern of reality, it's completely understandable. What you'll notice is that from the beginning of this whole thing, the bottom stuff appears first. The potentiality kind of manifests itself first as a question, as this kind of darkness which is calling to be solved, this potential which is asking to be resolved. And then comes the answer from above, right? The name, the idea, the light. So think again about your experience, right? You encounter something in the world you can imagine in a microsecond, in a micro, microsecond. The first thing it does is present itself to you as potential or as puzzle. And then obviously, it happens almost simultaneously. You immediately identify, judge, and make it participate in reality. But you can obviously have the experience of seeing something you've never seen before. I mean, everybody's had that experience. You see something or you experience something that you've never seen before. So at first it presents itself to you as a puzzle, right? It's like, what is this? And then the process has to happen, this back and forth process of question and identification, of question and judging in order for you to finally be able to kind of identify and participate in its. In its existence. All right? And so now we have. God said, let the land produce living creatures according to their kinds. The livestock, the creatures that move along the ground, and the wild animals, each according to its kind. And it was so God made the wild animals according to their kinds, the livestock according to the kinds, and all the creatures that move along the ground according to their kinds. And God saw that it was good. And so once again, what is happening. What is happening in this text? Why is it that God separates living creatures between livestock, wild animals and creatures that move on the ground? And the answer is very simple. It's just to continue the very same pattern. This hierarchy that we're seeing is a hierarchy of meaning. It's a hierarchy of identification, participation in reality. And so when God creates the animals, he does it in the same. In the same pattern. That is, you have livestock. Livestock is more intelligent animals, you can call them animals that are closer to us, animals that participate in our intelligence. They are the sheep, the cows, all the animals that kind of, let's say, are almost, not almost, but are more like extensions of human society. Then you have the wild animals which are out there in the chaos, in the wild, in the world. That doesn't completely make sense to us. And now then the creepy crawlers are the ones that live underground, like the sea monsters live on the ground, that dig holes in the ground that come up, you know, and. And that don't actually are not completely in the light. You could say that they're actually hiding in darkness, hiding under rocks. And so you have to kind of dig in order to encounter them, just like the sea monsters and the fish are on the ground, Just like the very pattern from the beginning of darkness, chaos at the bottom, and light, meaning participation at the top. And then, of course, now we come to man again. Then God said, let us make mankind in our image and our likeness so that they may rule over the fish in the sea and the birds in the sky, over the livestock and all the wild animals, and over all the creatures that move along the ground. So why is it that man has to rule? This is like the most politically incorrect thing that you could say, right? What are we talking about? But once you realize this pattern, the pattern of intelligence, it has to change the way you see reality, which is that intelligence is the place in which reality is encountered, identified, and also judged. This is going to be a tough pill for a lot of people to swallow, but at least try to understand it. Try to understand it. In this pattern, man has to rule because man is an image of God. Man is an image of God in the sense that man is a locus of intelligence. And all the things that God said, all the things that you saw from the beginning in terms of how God creates the world, is something that we participate in at a lower level. We could say we recognize that we participate in that at a lower level because we do that. We cast light, we identify, we. We judge, and then we are the place in which meaning is gathered into us. And so now God puts man above all the creatures which are below. Now, remember, those creatures were already organized in this hierarchy of meaning, right? Livestock, wild animals, crawlers, fish, sea monsters. All of this is organized in this kind of hierarchy of meaning, this hierarchy of danger, this hierarchy between that which is in the light, which is identifiable, which participates intelligence, and that which is below and is in the chaos and is and is also dangerous to you, okay? And so we have the human person meeting in the middle, becoming the place where all of these patterns kind of join together in the center. And so then to understand the role of man a little better, we actually have to go into Genesis 2 just for a little bit to kind of understand, because in Genesis 2, there's another creation narrative. Which focuses more on the human person. And then it says God. Sorry, let me skip this actually. Oh yeah, so it says, I don't want to run out of time here. But he says, God bless them and said, be fruitful, increase in number, fill the earth and subdue it. Again, this is going to be difficult, but intelligence fills the earth and subdues it, not in a negative sense, but in the sense of identifying the scientist that is constantly discovering new species. And all of this is something like intelligence or man filling the earth and subduing it in the sense of identifying it and making it participate in a pattern of meaning. Rule over the fish in the sea and the birds in the sky and over every living creature that moved in the ground. Then God said, I give you every seed bearing plant, etc, etc and then he saw that it was good. It's important that when God created the humans, he creates the male and female. In scripture there's a sense in which at first this is almost like man is actually androgynous, that he creates man, male and female. That is in man is the duality of heaven and earth itself. There's a microcosm of this basic duality of heaven and earth which is being reproduced inside the human person. As within them, they also contain this actuality and potentiality and how they also participate in the manner in which actuality and potentiality come together in the world. It's not just in them, but it's actually as being intelligent subjects, they are able to now encounter the world as this union of these two. All right, so this is where I wanted to go into the second chapter of Genesis just for a little bit to help you understand how this kind of comes together. So it says this is the account of the heavens of the earth when they were created, when the Lord God made the earth and the heavens. Now no shrub had yet appeared on the earth. Now you see, it's different here. Here there's a sense in which actually man kind of comes before everything. He's actually there at the outset, before God did all those other things, before you can imagine that God was man, or the microcosm or the intelligent agent was there. Even in the origin of creation itself. No shrub had yet appeared on the earth and no plant had sprung up. For the Lord God had not sent rain on the earth and there was no one to work the ground. But streams came up from the earth and watered the whole surface of the ground. Then the Lord God formed a man from the dust of the ground and breathed into his nostrils the Breath of life. And the man became a living being. So it's a similar image as to what we have before. But here man is there right at the outset. So it says that there was no plant, there was nothing on the ground. And that water covered the earth. Water came out from the earth and covered the earth. So it's the same image as before. You have heaven above and the earth below. The earth is chaos and water. And then what God does is he gathers all the potentiality, the dust, all this formless chaos. He gathers it into one place, and then he puts heaven into it. He blows air into this gathered dust. And that's how man becomes a living being. Now, what I want to propose to you is that process of gathering dust and putting air into it. That's what was being described in the first chapter of Genesis. And that is how you encounter everything in reality. All the time, nonstop. It is the world presents itself to you as indefinite potential. And the manner in which you are able to exist in a living world is that intelligence gathers potential into bodies and then puts purpose or recognizes purpose, engages with purpose, meaning spirit, breath. And that is how the world actually exists. The description in Genesis is a description of how the world exists. Not in a scientific way, but in a way which takes into account that intelligence is necessary, that we are intelligent beings in the world. And that we can't avoid that problem. We can't pretend that we're not in the world. And that we're just analyzing phenomena. And that we're not part of that process. So it's a cosmic vision of reality which includes the viewer, which measures the viewer, or includes the viewer in the way in which we understand the world. All right? And so we have this image again. Now we can represent it this way. We can also represent it this way. This is a way that will help you understand. If you can realize that you can represent it this way, you're going to understand so much. And this is where I want to make a shameless plug. Which is that my brother Mathieu Pageau and I, we developed a lot of this way of speaking about reality together, which is not something that we invented. It really is just a reinterpretation of traditional pattern making. It's an interpretation of the church Fathers, of the rabbis, of the. Of the Brahmin. It's just a way in which we are trying to represent these traditional stories for the modern world. He wrote a book called the Language of Creation, which goes through a lot of the things that I'm talking about in almost in A more. Even in a more kind of mathematical, technical way. So now think of this, the first image that I showed you as heaven and Earth, you could say so this is the same at the top. You have just lay them out there. There's more complexity to this, but it's like father, heaven, spirit, light, essence, pattern, mind, purpose, all of these things which are above and then at the bottom, mother earth, waters, chaos, potential question, body, puzzle, multiplication. All of these images of that which is below. And then what you have is. You have the pattern which descends, right? The ray of light, the speech, the speaking, which comes down, the logos which comes down from the Father and connects with heaven. Sorry, connect with earth. That usually, in all traditions, pretty much appears at the top of a mountain, which is just completely intuitive. The mountain is the place where heaven and earth meet. It's like the earth coming together into a point where the heaven now touches the earth at its highest point. But it's also an image of this difference between quality and quantity, identity variability, all of this kind of image of the relationship between the identity of your team and the variability of its players, of its idiosyncrasies. All of that will kind of come down below as this image of the mountain or the pyramid. I won't go into this right now, but there's, let's say, a centrifugal force and a centripetal force. That is, there is a capacity to move into attention, to move into identity, to move into purpose. And then there's a way in which we are able to have this, let's say, what you could call a breakdown of attention or focused attention, but is also this kind of general attention, you could call it where we have this general attention on the borders, even of our visual field, where it's almost like an alarm system where things, if things. We don't have a lot of energy there, but if things pop in, this variability pops in on the edge. And it's the question, the puzzle. Something's happening here and I can't see it. It's a puzzle. So what do I do? I then put my attention on it, identify it, judge it, and do all the things that we talked about before. There's a centrifugal force and a centripetal force. And that's true as much in your attention as it is in a team or a country or any group, anything that has body, there's something which is making it more towards its identity and some aspect which is pushing it towards multiplicity, variability and potentiality. Okay, I don't want to go into that too much because that would take us into a whole other world. But just to understand that you probably are, if you're Jungians, you're aware of the kind of coagulus solve structure that Jung used in terms of alchemy. This is exactly what I'm talking about. This is exactly the coagulus solve pattern, which is a movement towards solidity and identity and then a dispersion into potentiality. But what I want to help you to understand especially is that this structure, like this basic pattern, can help you understand so many things. It's the pattern of a temple. It's a pattern of a temple where in a temple, let's say in the Jewish temple, you had the holy of holies, where the glory of God would descend in the holy of holies. And then there you would have a priest who is just one person. And then outside of that, you would have all these levels of quantification where outside you would have the priestly caste, then you would have the faithful, and then you would have the strangers. It's a pattern of a church which has the same pattern. You have the altar in the highest point of the church where God descends on the altar. And then there's also a reduced amount of people that are there that represent this moving into quality, this moving away from quantity. And then the sacraments get dispersed out into the nave where the faithful gather. And then there's a narthex or a vestibule where strangers come. And then on the outside of the church, there are gargoyles and strangers and other aspects of reality. Okay, so this is the structure of. The structure of the way that Greeks understood themselves in ancient times. They had the umphalos, they had the navel of the world. And in that place they received oracles from heaven which would bind them together, which would manifest their destiny. All of that was manifested at the place where they had the belly button of the world, the center of the world. And then as you moved away, you would have Greeks and then strangers that you knew, and then finally barbarians and ultimately monsters. Things that have confused identities, things that you don't recognize would be outside on the outer edges of this. Okay, so like I said, this is basically just the pattern of the way in which we encounter the world. But it's also the pattern of how societies actually bind together. It's not just a subjective experience, but it scales up in terms of your experience into the social experience, and ultimately, I think, into a cosmic virgin. It's an image of the cosmic Pattern. So I just want to show you quickly, without even going into detail, I want to show you how this pattern just appears everywhere. So here's an icon of the Ascension of Christ. Look, you have above, you have the top of the pyramid or the top of the mountain. You have the principle, the Logos, which is above. You can imagine that the Father is actually above this, hidden above. And then below, you have the mother as the place of potentiality. And then next to her, you have all this multiplicity. So you have the one, you have the mother, you have the 12. This is one example. Here's an example of the image of baptism. So you have Christ as the one who now joins heaven and earth, as this point at the top of the mountain. The joints have been there, but now he's descending all the way down from the top, let's say down into the waters, down into the waters of chaos. And you see the spirits above, which is coming down on the. On. On the top of the mountain. And below you have the sea monsters, which are below in the chaos of the waters. Right. Symbol. Just many, many. And so this is a version that I made, which I call the Image of Everything, basically. And it's just trying to kind of capture the Bible story as an image of this pattern, as an image of how the top of the pattern relates to the bottom of the pattern, the waters at the bottom, the sin, the fall, the thorns, as this multiplicity, et cetera, et cetera. The sea monster. I don't want to interpret it, but there are different ways in which you can kind of see this. And the last one I wanted to show you is an image of the Last Judgment, which is really the ultimate image of this, if you want to see an ultimate image of this whole pattern, because obviously, the Last Judgment being the last moment, or the eschaton, or the moment in which all of totality is manifested in one final thing, then you have this image of the world. In this version especially, you actually have the Father above, above, above, right at the top. Can you. I don't think you can see my cursor."}
{"episode_id":"SW - #390 - 2025-05-06 - Genesis - Symbolism in the Creation Story","start":4186.97,"end":4187.33,"speaker":"Jordan Peterson","text":"Huh?"}
{"episode_id":"SW - #390 - 2025-05-06 - Genesis - Symbolism in the Creation Story","start":4188.05,"end":4214.38,"speaker":"Jonathan Pageau","text":"Can you see my cursor? Oh, here, you can see it this way. Okay, so you have the Father above here. Then you have the Logos descending onto the world. Can you see that? He's got the world underneath him. And then you have that which is below, which is both the hell, this kind of monstrous hell."}
{"episode_id":"SW - #390 - 2025-05-06 - Genesis - Symbolism in the Creation Story","start":4214.54,"end":4215.1,"speaker":"Jordan Peterson","text":"Okay?"}
{"episode_id":"SW - #390 - 2025-05-06 - Genesis - Symbolism in the Creation Story","start":4216.06,"end":4423.93,"speaker":"Jonathan Pageau","text":"But it's also the place of paradise here because it's the place in which we gather things together. So remember, in Scripture, the gathering of the dust and the blowing of the spirit. Well, that also happens from the bottom. Right. So you have the two sides. Remember I talked about the centrifugal and the centripetal force. On the left of Christ is the sword, and there's a descent down into death. On the right of Christ, there is his hand lifting up. Right, sorry, wrong hand lifting up. And here you find the gathering of the saints. And they rise up. See these little saints with angels with wings, they go up on the right of Christ into glory. So there are very, very mysterious things about this image that I don't want to go into too much detail, but you can understand that this is happening through these angels that are making music, that are making sounds, pattern sounds. And this is what is calling to the end, bringing about the judgment of all of reality in which all of this is happening. The judging of the good, bringing into the center and the ultimate exclusion in a cosmic way towards death. And then here, this is the process. So this is. It's a complicated thing in orthodox theology, but on this, this is the soul, which is. You can see the soul here. The soul is moving up this serpent ladder. So it's both a way to go down and a way to go up. Just like Chutes and Ladders, guys. This is. Chutes and Ladders is one of the oldest games. In reality, it's a truly cosmic game, by the way. It's almost religious as a game. So you have this coming down and moving up, which is captured in one image. And on this are all the sins that you can have. Those sins are coupled with virtues. And so as the soul ascends this thing, they encounter at every level of reality a demon which is pulling it down. But also they also encounter angels which are pulling them up. Here in this one, you don't see the angel so much. In other versions, you'll see the angel. Like in this one, you see the angel as the one trying to push down the demon. And as you move up, you kind of move towards this judgment. And that's actually that hierarchy that I showed you at the beginning in the creation that also obviously has an analogous version of that in you, in your virtues, in your capacity to scatter yourself into chaos by falling into all these thoughts that rip you apart and the capacity to join together into one and to move up the ladder of attention. As you worship God of attention, as you move towards virtue, rather than this dilapidation and distraction by which you lose the worship, you lose the capacity to attend to that which is above you, and you fall into chaos and the multiplicity of the passions. Right. Passions that rip you apart. Jordan, I think we're starting with your questions. Go for it."}
{"episode_id":"SW - #390 - 2025-05-06 - Genesis - Symbolism in the Creation Story","start":4425.61,"end":4441.29,"speaker":"Jordan Peterson","text":"Well, how about subdue? Think of the word sub to or to arrange hierarchically. Do. To give everything its due, that is. So when man subdues the world, he does exactly what you're doing."}
{"episode_id":"SW - #390 - 2025-05-06 - Genesis - Symbolism in the Creation Story","start":4442.65,"end":4443.05,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #390 - 2025-05-06 - Genesis - Symbolism in the Creation Story","start":4443.05,"end":4495.02,"speaker":"Jordan Peterson","text":"Everything, place. And that's a reflection of the simultaneous act of perception and judgment and the fact that those things, as you pointed out, are inextricable. And that's technically true, Right? Yeah. Psychologists studying perception from the biological ground have drawn that inescapable conclusion. So that was really cool. Ritual encounters with other people. In Dostoyevsky's the Devils, the Possessed, there's a great scene where Stavrogin goes into a. An officer's club and he's coming unglued. At this point in his political chaos, utopian political chaos, he's possessed by these ideas. He puts his fingers in the nostrils of an aged general and drags him onto the street, and it just causes absolute chaos in the entire society."}
{"episode_id":"SW - #390 - 2025-05-06 - Genesis - Symbolism in the Creation Story","start":4496.54,"end":4503.58,"speaker":"Jonathan Pageau","text":"Yeah. You realize how fragile, like, how easy it is to actually just shatter, you know, this ritual reality."}
{"episode_id":"SW - #390 - 2025-05-06 - Genesis - Symbolism in the Creation Story","start":4503.98,"end":4573.72,"speaker":"Jordan Peterson","text":"Yes. Dostoevsky understood that so deeply. So that's stunning. The female potential equation. I've been criticized a lot for associating femininity with chaos, although it's not an insult, and it's not something that I did casually, and it's not something I did. And the idea of the seminal word is precisely a reflection of that. And the implication of that is feminine potentiality, and the analog between the word and the drawing out of potential new forms. So there's a sexual element to that. Obviously, that's reflected in the idea of the seminal word, the pyramid notion. On top of the George Washington Tower, the obelisk, is a pyramid capped in aluminum, of all things, because aluminum was the most valuable metal at that point. And so that idea that there's a pure and valuable top to the pyramidal structure, that's an icon of the entire structure of the United States and by extension, the entire, let's say Western world, but world as such."}
{"episode_id":"SW - #390 - 2025-05-06 - Genesis - Symbolism in the Creation Story","start":4573.88,"end":4583.46,"speaker":"Jonathan Pageau","text":"Yeah. The Egyptian pyramids were most probably capped with gold. Like, the very top of the pyramid would be like a mini pyramid, and then that would have been gilded."}
{"episode_id":"SW - #390 - 2025-05-06 - Genesis - Symbolism in the Creation Story","start":4583.62,"end":4600.82,"speaker":"Jordan Peterson","text":"Right. So one of the advantages to the interpretive framework, this interpretive framework is that it explains the intrinsic, sacred nature of the pyramidal structure. It's a great mystery, like what's up with these pyramids? Exactly. Like people put a lot of work into those things, so it wasn't trivial."}
{"episode_id":"SW - #390 - 2025-05-06 - Genesis - Symbolism in the Creation Story","start":4600.98,"end":4620.7,"speaker":"Jonathan Pageau","text":"Yeah. And the ziggurats are pyramids too. People always want to separate them. But, you know, all these structures, these kind of. These structures that are representing mountains are like geometric versions of mountains. That's what they are. And if you want to understand that, then you realize that every time someone goes up a mountain in scripture, it's the same as a pyramid. It's going up to the top of reality."}
{"episode_id":"SW - #390 - 2025-05-06 - Genesis - Symbolism in the Creation Story","start":4620.94,"end":4629.74,"speaker":"Jordan Peterson","text":"I think you did a brilliant job of explaining that with your analysis of those images. At the end. Are you going to make that image you made into a carving?"}
{"episode_id":"SW - #390 - 2025-05-06 - Genesis - Symbolism in the Creation Story","start":4630.3,"end":4634.7,"speaker":"Jonathan Pageau","text":"Yes, I am, but just in line, somewhere in one of my carvings, someone has."}
{"episode_id":"SW - #390 - 2025-05-06 - Genesis - Symbolism in the Creation Story","start":4635.1,"end":4637.26,"speaker":"Jordan Peterson","text":"You need a client to purchase that?"}
{"episode_id":"SW - #390 - 2025-05-06 - Genesis - Symbolism in the Creation Story","start":4638.27,"end":4640.51,"speaker":"Jonathan Pageau","text":"I have one, but I can also make one for you if you want."}
{"episode_id":"SW - #390 - 2025-05-06 - Genesis - Symbolism in the Creation Story","start":4640.83,"end":4655.79,"speaker":"Jordan Peterson","text":"It's quite something, Jonathan. And then this last thing I'll say, I think is in the second creation version, where you have man primary, that's a analog, a repetition of the notion of the word."}
{"episode_id":"SW - #390 - 2025-05-06 - Genesis - Symbolism in the Creation Story","start":4656.67,"end":4657.23,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #390 - 2025-05-06 - Genesis - Symbolism in the Creation Story","start":4657.47,"end":4673.87,"speaker":"Jordan Peterson","text":"So it's the same. So that. So interesting seeing that embedded in a really archaic narrative there. Oh, so I do have one other thing. Why did you use intelligence as. As the. As the primary descriptor of the interactive consciousness instead of logos?"}
{"episode_id":"SW - #390 - 2025-05-06 - Genesis - Symbolism in the Creation Story","start":4674.35,"end":4700.13,"speaker":"Jonathan Pageau","text":"Well, the reason why, I mean, I tried to kind of move between the two, it's also because it's hard to know which word to use, because the way that the ancients understood intelligence was very. Is a little different from the way we understand it. It was more. It is. It's called a noose in orthodox thinking, which is. It's actually. It's beyond rationality. It's the capacity to directly grasp the pattern to attention."}
{"episode_id":"SW - #390 - 2025-05-06 - Genesis - Symbolism in the Creation Story","start":4700.61,"end":4701.13,"speaker":"Jordan Peterson","text":"Exactly."}
{"episode_id":"SW - #390 - 2025-05-06 - Genesis - Symbolism in the Creation Story","start":4701.13,"end":4702.37,"speaker":"Jonathan Pageau","text":"That's why it's related to attention."}
{"episode_id":"SW - #390 - 2025-05-06 - Genesis - Symbolism in the Creation Story","start":4702.53,"end":4718.43,"speaker":"Jordan Peterson","text":"Yeah, yeah, yeah, that's. Yeah, that. And that supersedes rationality, is embedded inside that capacity to pay attention. Because attention selects the objects that rationality deals with. And rationality tends not to notice that. It's like. Well, that's the easy part. It's like. No, no, no, that's. That's the hard part. Hard, actually."}
{"episode_id":"SW - #390 - 2025-05-06 - Genesis - Symbolism in the Creation Story","start":4718.91,"end":4750.55,"speaker":"Jonathan Pageau","text":"Yeah. And as we see, like YouTube, virality is a great way to understand what happens when we were not careful about that. Because what we have with YouTube virality, or just Internet virality are just these random, you know, stupid things that pop up, gather all the attention, vanish. Pop up, gather all the attention, vanish. And so it's actually a. It's actually ends up being a form of breakdown of attention. It's A distraction it prevents us from seeing. It's the incapacity to pay attention to the right things. And it leads us into a kind of breakdown."}
{"episode_id":"SW - #390 - 2025-05-06 - Genesis - Symbolism in the Creation Story","start":4753.11,"end":4759.99,"speaker":"Jordan Peterson","text":"It was great. I always learned a lot listening to you. It's really good. Really good. Thanks."}
{"episode_id":"SW - #390 - 2025-05-06 - Genesis - Symbolism in the Creation Story","start":4759.99,"end":4763.11,"speaker":"Jonathan Pageau","text":"I really appreciate it. Thank you so much. Thanks."}
{"episode_id":"SW - #390 - 2025-05-06 - Genesis - Symbolism in the Creation Story","start":4765.11,"end":4771.51,"speaker":"Moderator","text":"Okay, one question someone is asking. Could you elaborate on what you mean about above and below?"}
{"episode_id":"SW - #390 - 2025-05-06 - Genesis - Symbolism in the Creation Story","start":4774.62,"end":4876.17,"speaker":"Jonathan Pageau","text":"Well, the idea of above and below, like I said, it manifests itself fractally, but it's about something like. I mean, it's actual and potential and so it's identity and potentiality. And so think about it. Let's think about it just like, let's bring it down to like a real, like a basic level. So let's think of a sports team again. So you have the identity of the sports team, the reason why it exists, which is to win basketball games or to do that. Then there's the identity of the team itself, which is kind of embedded in that. And then there's the potential. The potential of that team are the players. Those players have also their own potential. Like I said, it's fractal. So the players can change, but the identity of the team won't. That's what we mean by potential. It's variability which comes together and then is able to manifest the purpose in the world. That's what we mean by above and below. God says, let the earth bring forth vegetation that has seed. We always forget that God doesn't just speak it into existence. He says to the earth, bring forth. It's like out of the potential comes this variability which then receives name from above and joins it together into specific identities. Like I said, this idea of above and below can be seen in anything that you encounter."}
{"episode_id":"SW - #390 - 2025-05-06 - Genesis - Symbolism in the Creation Story","start":4877.3,"end":4893.7,"speaker":"Moderator","text":"Another question is, you mentioned the pattern of livestock and wild animals that manifest heaven and earth are people that try to tame animals such as tigers, bears. Examples of breakdown of the pattern. And that is why usually it ends in disaster."}
{"episode_id":"SW - #390 - 2025-05-06 - Genesis - Symbolism in the Creation Story","start":4895.22,"end":4965.66,"speaker":"Jonathan Pageau","text":"Yeah, definitely. I mean, you can see that you have to kind of have a respect subdue, as Jordan said. I love that. I actually love that. That is, you have to be able to see things where they really are and engage with them where they are in this kind of pattern of reality. And so if you engage with. If you engage with the pattern of reality in a wrong way, that's you die. And it. And it can be. It can be something like taming, taming a tiger, but it can also be something like eating rocks. Like rocks are not potential that you have access to to eat. And that's true for an indefinite amount of things. There are certain identities which have certain potentials that can participate in them. And if you don't encounter that properly, then you're not going to work. If you have a basketball team and you decide to fill the basketball team with gerbils, well, your basketball team is going to lose. It's not going to exist. And so this is how it works in terms of. This idea of subduing or judging is a very good thing. It's a necessary thing because it's how you judge what potential is able to join with what identity."}
{"episode_id":"SW - #390 - 2025-05-06 - Genesis - Symbolism in the Creation Story","start":4966.94,"end":4998.15,"speaker":"Moderator","text":"Okay, we have a heretical question. How sure are you about the universality of heaven and Earth distinction? As far as I know, it is symbolic pattern appearing with the Axial Age cultures. Buddhist, Christianity, Socratic Greece, Islam, animistic culture, for example, do not have clear distinction between those two categories. So by extension, what makes you sure that all of this isn't just a perfect exposition of an Axial Age mind?"}
{"episode_id":"SW - #390 - 2025-05-06 - Genesis - Symbolism in the Creation Story","start":4999.99,"end":5068.24,"speaker":"Jonathan Pageau","text":"How can I say this now? I'm going to go back into what I'm saying. I'm going to go back into what I'm saying, which is about embodied reality. People who talk about the actual age and animistic as if they don't exist in the world, they just. I have no. I have very little patience for that. Like, where are you? Where are you to tell me about the actual age as if it's something which you're not in. And talk about the animistic age as if it's something that somehow you can see from outside. Like this. How can I say this? It's like we don't know much about animistic religions because we're not animistic religions. We're always interpreting animistic religions from the place where we are. And so it's a very. To me, it's always strange, like, do you know the secret traditions of the shamans? But you read the text that some European went out into Tibet and wrote some text based on what they encountered there. Were you initiated? Did they bring you into the secret of secrets? Did they tell you what their secret traditions are?"}
{"episode_id":"SW - #390 - 2025-05-06 - Genesis - Symbolism in the Creation Story","start":5068.24,"end":5068.84,"speaker":"Moderator","text":"No, they didn't."}
{"episode_id":"SW - #390 - 2025-05-06 - Genesis - Symbolism in the Creation Story","start":5068.84,"end":5188.54,"speaker":"Jonathan Pageau","text":"You don't know them. And so I'm not saying that the comet is true or false. I'm saying that you really know less about these traditions than you think you do. Because the way you know about something is not about. Is not by studying it from the outside, but it's about encountering it and living it from the inside. And those that are initiated into the higher mysteries they're not supposed to talk about it anyways, so they're not going to tell you. So even if a scholar was at some point maybe initiated into the Higher Mysteries, they shouldn't tell you. And if they tell you, it means they probably weren't initiated and they're bullshitting you, right? This is true, like, even of the Eleusinian Mysteries. Everybody talks about the Eleusinian Mystery as if they know what they are. It's like, that was a pretty awesome thing because no one ever told anybody what happened there, right? And so it's really important to understand that. To understand this. Anyways, I'm sorry, I don't want to go off on this person. But it's really just important to understand the implications of these embodied patterns and how it is that every time we pretend that we can stand above them and just analyze them, that I think we're deluding ourselves. And so, coming back to heaven and Earth, how can I say this? Like, I think that heaven and Earth is a universal pattern doesn't mean that there maybe aren't other ways of explaining that same duality or that same relationship. And also, it's the same. It's the same. It's the same thing. Like, it's the same problem. Like these animistic cultures that were there before the actual age, you don't know anything about them. You have no way of encountering them. And the ones you encounter now, the idea that they're the same as the ones that were there before the actual age is also. It's all kind of weird scientific delusions people give themselves. Sorry. Sorry to ever ask that question. I didn't mean to kind of go off, but these are. Sometimes these things. I get itchy about them."}
{"episode_id":"SW - #390 - 2025-05-06 - Genesis - Symbolism in the Creation Story","start":5189.34,"end":5197.59,"speaker":"Moderator","text":"Okay. Someone is asking, what is the meaning of the God calling the human very good versus calling the other things only good?"}
{"episode_id":"SW - #390 - 2025-05-06 - Genesis - Symbolism in the Creation Story","start":5199.91,"end":5246.55,"speaker":"Jonathan Pageau","text":"That's very. It's super interesting because there's even. There's even a day where God doesn't say that it was good. By the way, people always forget that when God separates the waters, he doesn't say that it was good. And so, I mean, I think that's what it is. It's that in a way, the human being participates in the pattern of the good in a way similar to the way God participates. Participates in the pattern of the good. That is, the human being can do good and can recognize good and can participate in the good, whereas the other beings, less so, not completely absent of it, but less so. And so I think that all living creatures participate in the good and participate in God ultimately. But it's just a question of hierarchy and embedded patterns. You could say."}
{"episode_id":"SW - #390 - 2025-05-06 - Genesis - Symbolism in the Creation Story","start":5248.46,"end":5275.81,"speaker":"Moderator","text":"There'S a psychological observation in terms of psychological work, how out of the infinite complexity of interpretations, certain interpretations of experience have been offered to us to stay inside the group. We accept defensively versus how we can seek out our intuitive, other patterns in our experience, create a new reality for ourselves."}
{"episode_id":"SW - #390 - 2025-05-06 - Genesis - Symbolism in the Creation Story","start":5279.89,"end":5441.86,"speaker":"Jonathan Pageau","text":"Okay, I would say, okay, let's it this way, that the patterns of specific groups, they are always limited. They are limited by their limitation. They're limited by the fact that they embody the patterns in a specific context. So because they do so, they will always be somewhat faulty. They won't be perfect because they're not. They're somewhat lower on the mountain of meaning, you could say. But ultimately, if you're attentive, the idea is that within those smaller patterns, you're able to intuit higher patterns and hopefully participate in things which lead you into higher patterns. So if you're. Let's give you an example. Like if. If you're part of a group of addicts, let's say, right, you hang out with a bunch of cokeheads or people who take heroin. So obviously you're in a. There's something in that pattern which is true, right? There's something in that pattern which binds you together in a way towards the telos, towards the reason. But there's also something in that pattern which is leading you into a breakdown of yourself. But it still has something. And so hopefully that's something, right? That capacity to bind together with others in a kind of communion that is ultimately what should lead you up towards a better version of that pattern, right? Towards. Instead of hanging out with a bunch of cokeheads, you hang out with some people who play sports or hang out with people who are interested in cars or people are interested in this. But there is a way in which even in the lowest versions of these, there's always something for it to even exist that has to participate. Now, I would be wary about the danger of thinking, the danger of seeing novelty as a value in itself, because this is something which we've seen very, very much in the modern world, which is we value novelty as of. Novelty is. Novelty is neutral. Some novelties are good and some novelties are bad. We shouldn't seek out new patterns just because they're new. If we seek new patterns or better patterns, it's because they're better. Better in the sense that they bring us closer to something which is a healthy mixture of this healthy balance of the patterning and the multiplicity. Right. It's this incarnational principle. If you kind of, if you're not careful, it's true, you can move too high and go into tyrannical systems. If you move too low, then you fall into kind of anarchic, chaotic realities."}
{"episode_id":"SW - #390 - 2025-05-06 - Genesis - Symbolism in the Creation Story","start":5444.74,"end":5466.41,"speaker":"Moderator","text":"Someone is commenting that your proposition at the beginning of the talk that intelligence is necessary for the world to unfold reminds them of Jung recounting in memory, dreams, reflection, standing over an African vista and having the feeling he's the first, first consciousness who ever have witnessed such a thing."}
{"episode_id":"SW - #390 - 2025-05-06 - Genesis - Symbolism in the Creation Story","start":5470.17,"end":5519.17,"speaker":"Jonathan Pageau","text":"Yeah, I mean there's definitely, there's, there's an aspect of potential or encountering the strange which is, which is very important because it, there's an aspect of surprise and wonder which comes with encountering that which we don't know, which is also part of the pattern of reality. And so there's an idea in ancient stories that there are treasures hidden in the deep, that there are treasures hidden in the outside, there are treasures being guarded by monsters. And so there's a sense in which moving out into potentiality is also a way in which to kind of discover these pearls, right? These secrets, these precious stones, these gems that are kind of hidden in the unknown. So that's definitely part of the pattern as well."}
{"episode_id":"SW - #390 - 2025-05-06 - Genesis - Symbolism in the Creation Story","start":5522.21,"end":5525.25,"speaker":"Moderator","text":"Yeah. I think we have another question by Jordan."}
{"episode_id":"SW - #390 - 2025-05-06 - Genesis - Symbolism in the Creation Story","start":5526.93,"end":5530.37,"speaker":"Jordan Peterson","text":"Actually it's a question from Tammy, so I'll let her ask it."}
{"episode_id":"SW - #390 - 2025-05-06 - Genesis - Symbolism in the Creation Story","start":5533.09,"end":5565.35,"speaker":"Jonathan Pageau","text":"How did Darwin bring Plato back? Because by coming back into the world of biology, he inevitably brought back purpose driven action, or selection is the best way to understand it. He brought back the idea of selection. And selection is not chaos, selection is not random. Selection is purpose oriented. And it's purpose oriented towards the perpetuation of the seed, the perpetuation of the identity."}
{"episode_id":"SW - #390 - 2025-05-06 - Genesis - Symbolism in the Creation Story","start":5566.95,"end":5578.83,"speaker":"Jordan Peterson","text":"This is the argument that I've been trying to put forth with Sam Harris and Richard Dawkins. It's like, you guys, there's a big contradiction here between Darwin and Newton or the way we look at Newton. It's like this is a big problem."}
{"episode_id":"SW - #390 - 2025-05-06 - Genesis - Symbolism in the Creation Story","start":5580.67,"end":5605.43,"speaker":"Jonathan Pageau","text":"And so it's a surprise. It's a surprise, I think that nobody kind of expected and nobody necessarily framed it completely that way. But they did end up bringing back the idea of quality back into the picture because you choose for a reason. And the reason is something which is closer to your own, the perpetuation of your own identity."}
{"episode_id":"SW - #390 - 2025-05-06 - Genesis - Symbolism in the Creation Story","start":5606.39,"end":5630.01,"speaker":"Jordan Peterson","text":"And it's like crafted by evolutionary forces. And so meaning itself is a consequence of the evolutionary process. And how that tangles up with the, like the theological perspective that you brought to bear today. That's an incredibly complicated and difficult problem. But as you said, God calls the earth to manifest its potential. So."}
{"episode_id":"SW - #390 - 2025-05-06 - Genesis - Symbolism in the Creation Story","start":5630.73,"end":5685.53,"speaker":"Jonathan Pageau","text":"Yeah, and so you could, you could. How can I say this? It's like so you can see it bottom up, which is, I mean, I've been experienced, I've been expressing it more bottom up recently just because people are kind of scientists scientifically mind it. But you can also, you can see it completely top down. Like, you can see it as like, like I was trying to explain to you, as the evolutionary process of maintaining your identity is a reflection of a deeper pattern, which is a cosmic pattern of how the world actually unfolds. It's not necessarily that evolutionary process brought about this, it's that the reason why evolutionary processes work the way they do and do what they do is because they're. They're functioning within a larger system. Yes, they're imaging, they're manifesting the way the world works."}
{"episode_id":"SW - #390 - 2025-05-06 - Genesis - Symbolism in the Creation Story","start":5685.69,"end":5700.89,"speaker":"Jordan Peterson","text":"So that's how the world discussion of subdue starts to become so relevant. Because as creatures make their choices and live or die by them, what they are in fact doing is the spiritual process of subduing. And if they do it improperly, then they perish."}
{"episode_id":"SW - #390 - 2025-05-06 - Genesis - Symbolism in the Creation Story","start":5701.77,"end":5859.62,"speaker":"Jonathan Pageau","text":"Yeah, exactly. And so, so there's an image, like we were talking about the idea of man at the outset, you know, and so this is represented in iconography, for example, as the image of Christ, Jesus Christ, human Jesus Christ, creating the world, which is just like for people, it just freaks them out because like, how does this work? How is this possible? But that's the understanding. There is a manner in which. How can I say this? And there's a manner in which, just like we have this Christian idea that Christ acts as an axis which transforms the past and the present, let's say, which kind of acts as this central axis. You could say that intelligence as it manifests itself in the world does the same. That is the human person, human intelligence goes back into the past and makes sense of it and goes into the future and makes sense of it. And so you could say that intelligence is at the outset, the things don't exist outside of this capacity to contain them in consciousness. And so the world is born in consciousness and the past as well. The past is born in consciousness too. So all those processes that people try to understand, all the Big Bang and all this stuff, it's still born in man, it's still born in consciousness. So the real origin is not the Big Bang. This is going to be the weirdest thing you're going to understand the real origin is the intelligence which is able to even perceive the Big Bang or see it as a pattern, as not just a quantum field which never changes. It's like perceiving change, transformation, identity, participating it. That's the origin of reality. So the description in Genesis, like I'm trying to help you see that it is an actual description of the origin of the world. It's not a metaphor like in the way that we want to think about it. It's not just a fairy tale which is helping us understand things we don't understand. It is describing the manner in which reality originates. And it originates in meaning. Then phenomena, not phenomena, phenomena. First as a puzzle. Right? I talked about that. Like this potential that bubbles up and calls to be answered. And then meaning which comes down. You can see the same from every single. All scientific theory is like that. It's like something presents itself as a puzzle and you're like, what is that? And then here comes the logos, the seed which comes in and patterns it or identifies it, judges it, separates it from other things in the way that happens in the first chapter of Genesis."}
{"episode_id":"SW - #390 - 2025-05-06 - Genesis - Symbolism in the Creation Story","start":5861.87,"end":5894.16,"speaker":"Moderator","text":"There's two more psychological questions I'm going to tell them both together because I think they are linked. Jordan, you may also have something to contribute to that. One, how would you work with the problem of inclusive exclusive categories in these times? Projections, scapegoating. And the other question that I think is related, where do the movements of cancel culture or Black Lives Matter fitness for how to make sense of these movements into this intelligence model?"}
{"episode_id":"SW - #390 - 2025-05-06 - Genesis - Symbolism in the Creation Story","start":5894.88,"end":5995.57,"speaker":"Jonathan Pageau","text":"Yeah, so one of the things we're seeing is we're seeing out of control versions of this identification system or this system of communion. The way in which reality works is fractal. And so communities or identities embed themselves in each other. That's how it works. And so in a normal kind of traditional world, you can be a family in a neighborhood, in a community, in a nation, in a church. And it's like it's all embedded. And you can also participate in all these different identities. You can be in a club or you can be in this and that. And so it all kind of works together. So one of the problems we're having right now is that kind of woke culture has understood the problem of identity. Right. They understand, they understand the problem of exclusion. But the answer they give is that they want to account for everything. They want everything to fit. Now the problem is that that doesn't. It's impossible. It's an impossible and it's even a dangerous thing. And there are a lot of ancient traditions which help you understand that. So, for example, you have the idea in Jewish law that you have to leave a fringe on your vestment, or you have to leave the corners of the field untilled for the strangers. All of these patterns are there to manifest the fact that you can't have a system which is both coherent and complete at the same time. You can't. Those two things."}
{"episode_id":"SW - #390 - 2025-05-06 - Genesis - Symbolism in the Creation Story","start":5996.29,"end":6048.79,"speaker":"Jordan Peterson","text":"Let me interrupt just for a second. Well, the ziggurat answers that question too, because people can be included at a higher level of unity and excluded at a lower. And so part of this is conceptual confusion. It's like the problem of category is the problem of inclusion and exclusion. And exclusion can lead to demonization very easily. And that's a big problem, a fundamental problem. But the problem that you're talking about that's manifesting socially as a consequence of this lack of understanding of the hierarchy of value. So the people who are pushing diversity, inclusivity and equity are saying something like, look, we're all divinely human. And you object to that by saying, well, yes, but we still need to differentiate ourselves into specialized categories. And we have to think through that very carefully so that we subdue things properly."}
{"episode_id":"SW - #390 - 2025-05-06 - Genesis - Symbolism in the Creation Story","start":6049.98,"end":6138.7,"speaker":"Jonathan Pageau","text":"No, exactly. And so what's happened. And so what's happened is that people want to make inclusivity the only value, really the only value because of the problem of exclusion. And so what happens, and this is what I'm going to say is going to seem radical to some, but what we're seeing in this process is the actual destruction of the world. And it's actually going to. This type of thinking can actually destroy the world or lead to absolute tyranny, one or the other. Or maybe one because causing the other because. So imagine you have a basketball team, right? You have a basketball team. The purpose of the team is to play basketball, to win a championship, to do this. But then you say, no, no, no, the purpose of the team is inclusion. And now imagine you do that for every single level of reality and every single communion. You say that the purpose of your group is inclusion. So then you sacrifice the actual purpose of the group, which is to play basketball, to win games and everything, for inclusion. And you end up doing that in all aspects of reality. What you're doing is you're devouring the purpose. You're eating it. It's like it's becoming eaten by this thing. It's a monster. It's like, it's the potential. It's like potentiality is infinite. It's like you need to let all this potential in. And so we were like, this is wrong."}
{"episode_id":"SW - #390 - 2025-05-06 - Genesis - Symbolism in the Creation Story","start":6138.7,"end":6138.9,"speaker":"Jordan Peterson","text":"Right?"}
{"episode_id":"SW - #390 - 2025-05-06 - Genesis - Symbolism in the Creation Story","start":6138.9,"end":6211.68,"speaker":"Jonathan Pageau","text":"You're excluding this potential. So we need to kind of bring all this potential in. So what it does is it's like a sea monster that comes up and devours the. And devours the identities. And so either it brings about a kind of fragmentation and chaos and breakdown, but often the world can't sustain itself that way. So what it tends to do is it tends to lead. To lead into a kind of absolute identity. And it's weird because the way it seems to be happening, it's just the strangest thing is that it's like people are trying to make inclusivity as the tyrannical system itself, which is. Just seems like it's not possible. But that seems to be what's happening, is that inclusivity is going to turn into tyranny. But what's important is that that gesture is going to create something like absolute scapegoats. Absolute scapegoats, which is that those that will refuse to participate in this highest. This weird principle of inclusivity will be absolutely excluded. It's the only sin, and it's an unforgivable sin. And so we're moving, kind of moving toward that. And it's. Yeah, it's kind of scary to see it happen."}
{"episode_id":"SW - #390 - 2025-05-06 - Genesis - Symbolism in the Creation Story","start":6212.57,"end":6234.57,"speaker":"Jordan Peterson","text":"Well, it's terminologically part of an assault on the idea of the patriarchy. And that means that it's assault on the idea of pyramidal categorization itself, because that's assimilated in the indiscriminate imagination with tyranny. And the identification of tyranny with the act of categorization itself."}
{"episode_id":"SW - #390 - 2025-05-06 - Genesis - Symbolism in the Creation Story","start":6236.09,"end":6237.69,"speaker":"Jonathan Pageau","text":"This is a deep struggle."}
{"episode_id":"SW - #390 - 2025-05-06 - Genesis - Symbolism in the Creation Story","start":6238.01,"end":6254.75,"speaker":"Jordan Peterson","text":"So if the act of categorization is part of submission, doing, and that's part of the manifestation of the word, then the assault on that under the guise of destructuring the patriarchy, is an assault on that principle itself. And an identification of the principle of discrimination with the principle of tyranny."}
{"episode_id":"SW - #390 - 2025-05-06 - Genesis - Symbolism in the Creation Story","start":6256.19,"end":6292.73,"speaker":"Jonathan Pageau","text":"Yeah, I mean, the idea that, for example, like the idea that the word discrimination has become an absolute evil is insane. It's an insane moment because you discriminate all the time. You constantly discriminating. Discriminating is like a normal aspect of reality, which is that you're constantly judging, like you're constantly kind of discriminating whether or not this piece of paper is the right one to scribble on or to print on, and you're discriminating whether or not this is the right keyboard for my computer, it's like you're constantly discriminating. But the fact that we even made that word into."}
{"episode_id":"SW - #390 - 2025-05-06 - Genesis - Symbolism in the Creation Story","start":6293.49,"end":6311.33,"speaker":"Jordan Peterson","text":"Well, you also said, Jonathan, that God himself said that that capacity for discrimination transformed good into very good. So now think of what an assault on that means. It means an assault on our ability to distinguish between that which is higher and that which is lower. God."}
{"episode_id":"SW - #390 - 2025-05-06 - Genesis - Symbolism in the Creation Story","start":6313.01,"end":6317.89,"speaker":"Jonathan Pageau","text":"And so, but there's a way in which, like it's important to understand that there is a way in which."}
{"episode_id":"SW - #390 - 2025-05-06 - Genesis - Symbolism in the Creation Story","start":6320.06,"end":6320.3,"speaker":"Jordan Peterson","text":"This."}
{"episode_id":"SW - #390 - 2025-05-06 - Genesis - Symbolism in the Creation Story","start":6320.3,"end":6328.18,"speaker":"Jonathan Pageau","text":"System, like let's say especially you see it in many versions, but in the Christian system, the one I know the best, the way in which he kind of heals itself or the way in."}
{"episode_id":"SW - #390 - 2025-05-06 - Genesis - Symbolism in the Creation Story","start":6328.18,"end":6328.46,"speaker":"Moderator","text":"Which."}
{"episode_id":"SW - #390 - 2025-05-06 - Genesis - Symbolism in the Creation Story","start":6330.38,"end":6567.34,"speaker":"Jonathan Pageau","text":"It deals with this problem is that at the very, very top of the hierarchy is something like identity. And then right above that identity is something like sacrifice. That is the pyramid is kenotic. It's self emptying. And so the highest thing, the highest thing is the king, and then the very highest thing is the martyr. And that's super important. It's super important to understand that. And it's actually technically accurate, right? In the sense that in order for the leg of a chair to be part of the chair, it has to sacrifice itself to the higher purpose. It has to, because it can't just be a leg of a chair, it has to participate in the higher pattern. The highest point of the pattern is a negation of identity. This might be a little hard for people to get, but it'll help you understand a lot of Christian symbolism. The highest point of identity is negation of identity. But the problem is that now what we have is something like we don't realize that negation of identity leads to identity. Then there's an identity going like this, and then there's a negation of identity below or a breakdown. And they're confusing the negation of identity below with the negation of identity above, which is the capacity to sacrifice yourself for a higher good and the capacity to sacrifice yourself for your own parts. The chair also has to sacrifice its purity in order to be able to exist. Because all chairs have idiosyncrasies. All chairs have aspects of it that aren't the pure chair. Or else the chairs couldn't exist. The identity of things sacrifice themselves above, they give themselves up, right? So imagine you take your best sheep and you give it up to God, right? You give it up to God or you die as a martyr. But then there's also a way in which that which is above then sacrifices itself for that which is below. So that's one of the ways in which we kind of deal with the problem. So it's not like a kind of Nietzsche and will to power thing. It's not at all that the real hierarchy ends in self sacrifice. That's why the cross is at the top of the hill. That's why the mystery at the top of the hill is. In mystical terms, we talk about the divine unknowing, that you reach knowledge, you read gnosis, and then when you reach the top of gnosis, the next step is unknowing. It's actually a form of divine darkness. That's the highest form of mystical, mystical union. And this is how one of the ways in which the system can. Can balance itself out. Because it is true that sometimes we struggle to think that the highest thing is. Okay, let's, let's think of it this way. The highest thing of the team is the quarterback that everybody loves and everybody worships. And it's like, yeah, that is the top of the team. But it's only the top of the team when the quarterback sacrifices himself above to the purpose of the team and sacrifices himself below to make the other team members participate in the team. If he doesn't do that, then he's not going to be at the top. He's going to be a tyrant. He's not going to be able to get the team to cohere. All of these things are going to happen. And so this is something which, like I said, it's maybe a bit harder to understand. I really didn't expect to go into this in this conversation, but it might be important to understand the problem of identity and how it can be solved, let's say, through this pattern."}
{"episode_id":"SW - #390 - 2025-05-06 - Genesis - Symbolism in the Creation Story","start":6568.94,"end":6587.65,"speaker":"Moderator","text":"Okay. Another question, maybe a big one, I don't know if can be summarized. What is the intelligence of dreams? Jung suggested the dream is a purest expression of individualating intelligence. This seems at odds with the orthodox view. Can the two views be reconciled?"}
{"episode_id":"SW - #390 - 2025-05-06 - Genesis - Symbolism in the Creation Story","start":6589.17,"end":6740.79,"speaker":"Jonathan Pageau","text":"It's very difficult. So the orthodox view or the way that the fathers talk about dreams is that they are mostly chaos, that they're mostly this lower waters, this kind of these moving waters, and that you have to be careful not to pay too much attention to them. But like I said, so there's an interesting image. For example, like let me give you an image that you find in the Revelation. It says in Revelation, at the end of time, the sea will become like glass, the sea will become like crystal. And so you. That's the way you can kind of understand the purpose of dreams, is that it's this lower potential that's kind of bubbling up, right? And so manifests all your passions, all your desires in a kind of. In a kind of wild way that sometimes is illogical, that it's kind of breakdown of logic. But then once in a while you could say through divine providence or through a skisis, that is through, let's say, the mystic who will transform himself and will kind of reduce their slavery to the passions. At some point this potential can still itself, can become still, and then it becomes a mirror. Because it is a mirror in the first place, right? It's already a mirror because that's where reality comes out of. Reality kind of comes out of this potential. The earth is pulled out of the waters. All of this is true. And so you can understand it that way. It's like the chaos and this kind of madness and chaos on the edge out of which reality comes. And you have to be careful not to pay too much attention to it because it can break you down. But once in a while it becomes this pure mirror. And then that's the vision. That's the mystic's vision. That's the capacity to see reality more clearly than you ever could. Because suddenly it becomes a mirror for the highest, highest things. So it's like, you know, one of the things you might have seen when you see the pattern of creation is that God is going like this, right? So the waters, the earth, and then the grass, the stars. And then it's like it's kind of moving in this way. So you can understand it as these extremes, but you can also understand that the lowest part can become a mirror for the highest part. In the proper circumstance, it can become like this. That's one of the things Christ does, by the way. If you want to understand the story of Jesus, he goes to the bottom of reality and then kind of transforms it into glory. Anyways, little tidbit on that."}
{"episode_id":"SW - #390 - 2025-05-06 - Genesis - Symbolism in the Creation Story","start":6743.11,"end":6753.17,"speaker":"Moderator","text":"Okay, I'm aware of the time. I'm also aware we could go on for hours and hours. Jonathan, I don't know how you're doing. About time. You want to take one last question?"}
{"episode_id":"SW - #390 - 2025-05-06 - Genesis - Symbolism in the Creation Story","start":6753.65,"end":6760.21,"speaker":"Jonathan Pageau","text":"I'm fine, yeah, if you want. I'm totally fine. I went too long in my presentation anyway, so I'm willing to accept more questions."}
{"episode_id":"SW - #390 - 2025-05-06 - Genesis - Symbolism in the Creation Story","start":6761.25,"end":6783.75,"speaker":"Moderator","text":"Okay. If the teleological patterns of being constitute the realm of heaven, what then is the abode of the individual human soul? In other words, what is the relationship between the semi Platonic conception you've presented here and the standard Christian model of heaven as a domain of souls?"}
{"episode_id":"SW - #390 - 2025-05-06 - Genesis - Symbolism in the Creation Story","start":6784.63,"end":6968.12,"speaker":"Jonathan Pageau","text":"And so they're the same. That is that your soul is your invisible part of you. It's the pattern, the patterning of your, of your being, right? That's what your soul is. And there's a way, and there's a way in which that soul in its very center, you could say that there's a hierarchy of patterns in you. And at the core of that hierarchy of pattern is God. I want to tell you that it's the spark of the divine is at the center of every individual soul. That's the manner in which we actually exist, is that we contain a spark of the divine. And that as we commune with each other, as we love each other, then we become this embodied pattern. Your individual Logos joins with the divine Logos and becomes the body of Christ. That's the way that it works. You can understand it in different ways. You can understand it as physically. How can I say this? That Christ says things like you are called to be like angels, and he says you are gods. What he means is that human beings can become patterns for other human beings. We become models. That's why we have models. We have models because humans can move up into heaven, we can ascend into heaven, and then we become patterns for others and we become patrons for others. So we name a church after someone, we name a city after someone, we name things after people because those beings are like gods. They become patterns for the rest of us. And so. And that's actually how reality works. Like we. Reality doesn't hold together by ideas. Even your nations, they don't hold together by ideal. They hold together by a succession of people who modeled behavior on which you, you base yourself. And some of those rise up very high and become the patron saints of entire aspects of reality. And that's how they become like angels. They become gods in the divine council, they become co rulers with Christ. All these things that Christ talks about and these are things that can happen at a very small level. Your own father, your own mother can image for you how to live and how to be. And then that can scale up, you know, all the way to St. Peter and St. Paul or the Mother of God, or the saints which are venerated as being like in the divine council."}
{"episode_id":"SW - #390 - 2025-05-06 - Genesis - Symbolism in the Creation Story","start":6973.08,"end":6979.24,"speaker":"Moderator","text":"Thank you so much for a great talk. And Jordan and Tommy, thank you so much for your participation."}
{"episode_id":"SW - #390 - 2025-05-06 - Genesis - Symbolism in the Creation Story","start":6982.36,"end":7010.83,"speaker":"Jonathan Pageau","text":"Yeah, this has been great. I'm really happy because let me say this is that I was hoping that this, this discussion would push me further in saying things in a certain way and kind of bringing things together. And I'm very grateful because I feel like it has and so I appreciate Jordan, you pushed me and I think the questions were wonderful and so it's actually been a great opportunity for myself to just say, okay, I'm gonna try as hard as I can to really bring this together. So thank you."}
{"episode_id":"SW - #390 - 2025-05-06 - Genesis - Symbolism in the Creation Story","start":7012.51,"end":7022.57,"speaker":"Moderator","text":"Thank you everybody. Sorry for those who we didn't have time to ask their questions. Only so many questions sort of time."}
{"episode_id":"SW - #390 - 2025-05-06 - Genesis - Symbolism in the Creation Story","start":7024.01,"end":7026.57,"speaker":"Jordan Peterson","text":"I'll just jump in. If, like me, you didn't have a."}
{"episode_id":"SW - #390 - 2025-05-06 - Genesis - Symbolism in the Creation Story","start":7026.57,"end":7035.61,"speaker":"Jonathan Pageau","text":"Chance to answer to ask a question, maybe you can attend another Jung Society of Montreal event and we'll form our."}
{"episode_id":"SW - #390 - 2025-05-06 - Genesis - Symbolism in the Creation Story","start":7035.61,"end":7039.37,"speaker":"Jordan Peterson","text":"Group with our purpose and continue in these rituals."}
{"episode_id":"SW - #390 - 2025-05-06 - Genesis - Symbolism in the Creation Story","start":7042.02,"end":7042.5,"speaker":"Moderator","text":"Very good."}
{"episode_id":"SW - #390 - 2025-05-06 - Genesis - Symbolism in the Creation Story","start":7042.82,"end":7059.22,"speaker":"Jonathan Pageau","text":"All right. Thanks everybody. If you enjoy these videos and podcasts, please go to the symbolicworld.com website and see how you can support what we're doing. There are multiple subscriber tiers with perks. There are apparel and books to purchase. So go to the symbolic world.com and thank you for your support."}
{"episode_id":"SW - #390 - 2025-05-06 - Genesis - Symbolism in the Creation Story","start":7059.7,"end":7120.79,"speaker":"Laura Diaz","text":"Tucson the Weight is Over Medi Weight Loss. They're officially open on North Oracle Road. That's right, no more counting down the days. You can walk in right now and start your journey to a healthier you. Hey, it's Laura Diaz from iheartradio and you can trust me. This isn't just another weight loss clinic. I know that because it's where I lost weight safely with real medical support. GLP1 medications. You can see them everywhere online right now. But the truth is, your health shouldn't be a DIY project. Ordering these meds without the professional guidance. It can lead to dangerous mistakes, wrong doses, no oversight, and serious risk risks. At mediweightloss, I got the same medication but with a customized plan, weekly check ins, and a licensed physician guiding me every step of the way. And the cost? The same as those risky online options. Tucson, your moment is here. If you're ready to take control, feel better, and lose weight the right way, mediweightloss is ready for you. Walk in, get started and see real results. Call or visit mediweightloss.com to learn more and book your free consultation today. That's mediweightloss.com."}
