{"episode_id":"SW - #224 - 2022-03-14 - Thoughts on the Situation in Ukraine","start":0.32,"end":70.77,"speaker":"Jonathan Pageau","text":"So as of course, everybody knows, the conflict which has been going on between Russia and Ukraine since at least 2014 has ramped up dramatically, has accelerated, has become a full scale war. And many people have asked me why I haven't been saying much about it, why I haven't been more vocal on social media or in my videos to talk about what is going on in that conflict. And so I thought it would be worth the time to spend a few minutes to explain, first of all, why I haven't been more vocal and maybe give you a little bit of a sense of my perception of what is going on, or rather why it is that I'm being very attentive and a little quiet at the moment to try to kind of perceive through the, through the chaos and through the, the barrage of information, to get a sense of what is happening on a symbolic level. This is Jonathan Peugeot."}
{"episode_id":"SW - #224 - 2022-03-14 - Thoughts on the Situation in Ukraine","start":71.17,"end":72.93,"speaker":"Announcer","text":"Welcome to the symbolic world."}
{"episode_id":"SW - #224 - 2022-03-14 - Thoughts on the Situation in Ukraine","start":83.19,"end":914.74,"speaker":"Jonathan Pageau","text":"So the first thing to say is that the stories we are hearing, that we are seeing coming from Ukraine are rather horrible. I think it's very important to pray for the people of Ukraine and to give to people that can help in the humanitarian sphere. I myself worked for many years with Mennonite Central Committee mcc, which I trust and which I know does good work. And so we're going to go through that, through that channel to try to do what we can to help the people of Ukraine. I think that's the first thing to say. I think a lot of people are distressed, especially Orthodox Christians are distressed and feel a little bit overwhelmed by the situation, because what we're seeing in many cases are Orthodox Christians, or at least people who identify as Orthodox Christians, fighting each other, invading each other. And so it is very difficult to kind of remain calm and to be objective about that. That has, of course, been one of the reasons why I've been quiet. But mostly, I'll be honest with you, I tend to not comment too much on international politics. If you follow me, you'll notice that I will talk about the things that I understand, about the symbolic patterns that I perceive. But I'm not a political commentator. I have been more vocal in the past few months because things have been happening in my own sandbox, in my own world that I can see, that I can see through because I can experience it. I can, you know, I have my feet on the ground, I can get a sense of what is going on. And because I do not trust the media, I do not trust the media. I've stopped trusting the media in 2016 when I saw them going after Jordan Peterson, who I knew and who I trusted. And I saw that what the media was saying was so completely out of whack with what he was and what he was doing and what he was saying, that from that moment on, I've become extremely critical of the media apparatus. And I saw the same thing happen in the US election in 2016 as well. And since then, I'm not going to start trusting the media, because now it's a different subject. That's not going to happen. I simply do not trust the media. I do not trust what we're getting from official channels in terms of information. And so because it's very difficult to see through the propaganda that is being pushed on all sides, it is very difficult to pronounce yourself and to speak. Everybody is going off on Twitter and on social media, and I feel like it is often irresponsible because we do not know what is true of what we are being told of what is happening over there. So I think that's very important to understand that. One of the reasons why I'm not saying much is because I don't know what's going on, and I don't totally trust what I'm hearing, what I'm seeing, and I especially don't trust the motivation of the people that are taking extreme positions in this conflict. I see what I could only call, let's say, other political reasons why people are focusing so much on what is going on and are taking positions so strongly. You know, and especially, I have to be honest, especially Americans, I find it very difficult to watch Americans posture and be extremely arrogant and extremely, you know, to take on this strong position of we need to defend democracy and we need to defend people that are suffering, you know, in the wake of the Iraqi war, of Libya, of what's still going on in Yemen, of the bombing in Somalia, of Syria, the horrible Syrian war, which was in much part backed some of those rebels which were backed by the United States. And so I. I just find it very difficult to watch people get up on their high horse and now start to preach to others. I just struggled to deal with that. So I think that that's another thing that's going on in terms of why I've been kind of quiet about the issues that are happening now. Let's say the third reason, or let's say the more symbolic reason why I haven't been saying much and why I've been paying attention and watching is because there's something which happened in 2014 now when the coup happened. In 2014, you know, the maiden protest and the ousting of the. By force of the president, which was there, and the reinstating of a new president, which was there in 2014. There was a lot of things, a lot of suspicious things going on. But one of the strangest things that happened during that time is that Pope Francis did a ceremony with a boy and a girl, a young boy dressed in blue and a young girl dressed in red. You know, very, very powerful symbolism. Stood at his window and released two doves. The boy released one dove and the girl released another dove for peace in Ukraine. And when that happened, as the doves were flying away from the window, the doves were attacked by two birds. One blackbird, a kind of crow type bird, attacked one of the doves, and another, a kind of seagull bird, attacked the other dove. And it was very dramatic because here you had these two kind of scavenger birds, these kind of scavenger birds that were now attacking the two doves as if the prayer was being interrupted by something, as if the request for peace was being taken up by these. These. These scavenger birds. These aspects of. These aspects of. Of heaven or these aspects of what is above, which picks up things, you know, which are. Is the more kind of tyrannical and even scavenger aspect of heaven, you know, the darker aspect of. Of a structure, let's say. And so since then, I have, of course, been extremely attentive to what is going on there, especially because, you know, a lot of people think that these types of omens, of course, are silly, they're ridiculous. But I would be more. I would be less skeptical if I were you after spending many, many years listening to my videos. For some of you, I hope that you would understand that symbolism happens and that the fact that this happened and the fact that it follows an almost mythical structure, you know, that this event has a mythical structure, and that not only does it have a mythical structure, but that it's shown itself to be true, that is, that the peace in Ukraine is not there and it's not happening. And not only that, but there is something. There is a sense that this event, these things that are happening in Ukraine, you know, and everybody kind of has this feeling that there's something, of course, bigger going on and that there's an unraveling happening, an unraveling of a certain narrative, an unraveling of, let's say, American supremacy. We're not sure exactly what it is, but there definitely is a feeling like something is breaking down and that the consequences of what is happening are not going to be short term consequences. And the fact that President Putin went out and did such a daring act of invasion is going to, is not going to play out well. It's not going to play out well. I don't know how what's going to happen, I don't know how it's going to play out. But that it seems like we are ramping up from, you know, we are ramping up from the COVID moment into war. And you know, this happened 100 years ago, folks. I just want, I hope you understand that these patterns, they play themselves back over and over. There's a relationship between epidemics and war and there's relation, there's all these strange relationships of how these things kind of play into each other and how they move from one space to the next. And so the conflict, and you can see it, everybody knows if you pay attention to attention, how the war on attention and the war of attention moved radically from COVID to Russia within the space of a week, within the space of one week, Covid is almost, almost doesn't exist. And now all of a sudden, all our attention has moved from a war and a virus to now an actual war that is happening. And people's rhetoric is inflamed and people's attitudes are frightening, to say the least. And you know, I guess if you asked me if I knew this was coming, I knew this was coming. I didn't, I didn't know how it was going to play out. I knew that the pattern of what happened a century ago was never solved. The problems that were brought up, the issues that kind of came about weren't solved. And they're playing out again. And we can see how the political aspect of this conflict is much bigger than just a conflict between Russia and Ukraine and has an entire. The positioning that people are taking has a weird globalist sense to it, whereas it's difficult to oppose what Russia is doing without falling into something else. Something which is frightening as well in terms of, you know, what is going on. You know, I've talked about, I've talked about how the 666 symbolism is growing and how the pattern of systems of control is becoming more and more apparent. Systems of control out of which you cannot escape. And now these systems of control are showing themselves, just nakedly showing themselves out in public. And the COVID situation has made that more and more visible. And now the Russian attack has made it even more visible to see what is going to play out in terms of this system of control and this kind of world system of control. We saw here in Canada with the trucker protest, how the use of blocking people's bank accounts, of closing down their access to funds was done without flinching. That as if this is something which is completely normal to do. And now we're seeing the same thing happening, that is the sanctions that are brought upon Russia. The idea of shutting down services, of closing off accesses to banks, you know, Google Pay, Apple pay, stopping just not working anymore in Russia. All of a sudden people, you know, normal people coming to the store and trying to pay with their phones and then they just can't. They just can't pay. It's just not accessible to them. And we saw people asking, for example, Elon Musk to turn off all the Teslas in Russia. And so people don't realize that the mechanisms of control, once the power for those mechanisms is, let's say, brought about and is rolling. It's not just going to be used against the people you oppose. You can be against what's happening in Russia and all of a sudden want all these powerful people to use all these methods in order to clamp down on their political enemies. And you don't realize that these types of measures will then be used even inside countries and will be used against people within. And we saw it happened a few weeks from each other where these methods were used in the trucker convoy to shut down people by closing or freezing their bank accounts. So as we move towards digital identity, as we move towards digital currency, these methods will become more and more inevitable. And as they become politicized, that is when things are going to get scary and they're already politicized. We saw it with COVID and. And we're going to see it more and more. And so I would have to say that that's the reason why I haven't been extremely vocal about what's going on. I've been watching, I've been listening, I've been trying to pay attention to the signs and to the symbolism which is laying itself out. And I'm also quite, of course, I'm also quite saddened because, you know, I am Orthodox and it's hard to understand what's going on and why this is happening. We can understand why it's happening in terms of material causes, but there's a kind of sadness which comes about to watch Orthodox Christians attack others and to watch polarization that's happening within the church itself. It's very difficult to watch that and to, yeah, to not be affected. And so I would say pray for the people of Ukraine, you know, pray also for Russia, that the Russians can understand, you know, what they're doing and the violence that they're bringing about on other Orthodox Christians and that God may forgive us all as Lent starts. It's a very strange time also for all this to be going on as Lent begins. And we are supposed to enter into more prayer, into more fasting, you know, into more repentance. And so hopefully, at least for most of us, we can keep that eye of repentance on ourselves and not just point it out, point our fingers out to the outside, but try to see our own faults and not to see the faults of our brothers in this time of repentance. And so everybody, you know, I wish you a productive Lent through all this chaos and we'll talk to you very soon."}
{"episode_id":"SW - #224 - 2022-03-14 - Thoughts on the Situation in Ukraine","start":914.74,"end":934.02,"speaker":"Announcer","text":"I hope you enjoyed this episode of the Symbolic World. The Symbolic World is based on a series of videos that you can find on my YouTube channel, Jonathan Pedro's YouTube channel. You can also get involved with. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion."}
{"episode_id":"SW - #224 - 2022-03-14 - Thoughts on the Situation in Ukraine","start":934.1,"end":935.34,"speaker":"Jonathan Pageau","text":"I will put a link to that."}
{"episode_id":"SW - #224 - 2022-03-14 - Thoughts on the Situation in Ukraine","start":935.34,"end":976.73,"speaker":"Announcer","text":"In the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course, leaving a review on itunes. Everybody knows that's the best way to get the podcast out there, to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon the Pajeau videos as well, and on subscribestar. All those links you can find on my website or in the show description. So thank you and I will see you soon."}
