{"episode_id":"SW - #108 - 2020-07-15 - Casting Down Images","start":0.16,"end":1153.08,"speaker":"Jonathan Pageau","text":"In the past few weeks, in the wake of the killing of George Floyd, we have seen a bunch of stuff happening. And some of the things that we've seen has been the destruction of statues, the renaming of schools. They desire to destroy certain aspects of American culture especially. So I'm going to look at that. What it means to destroy statues, what it means to do that. The answer I give you might not be the one that you want, but nonetheless, hopefully will help you understand this pattern and why it is that people would engage in such behavior. This is Jonathan Peugeot. Welcome to the symbolic world. So one of the things we've seen in the past few weeks has been the massive attack on monuments. Now, the beginning of these attacks were, of course, on Confederate statues, on different characters which represent the south, and for some people who were associated with the slavery in the South. But that, of course, went much further than that. We saw some statues of George Washington. We saw a statue of Thomas Jefferson being destroyed. There was also a statue of Ulysses Grant being destroyed, who is, strangely, is the general who actually defeated the south in the Civil War. Now there was even a statue of Abraham Lincoln, which was defaced in, in Europe. And there is a threat on a statue of Abraham Lincoln, who is the very person who liberated the slaves in America. So the question is, what is happening? Why are people doing this? And the first thing I have to tell you, and like I said, some people might not like this, is that destroying statues in itself is not a bad thing. People, everybody destroys statues. Every culture destroys statues. There is an inevitable aspect to any civilization that it will tend to diminish that which was there before Christians did the exact same thing. When Christians Christianized the Roman Empire, one of the aspects of what they did was to destroy or to remove, at least in public view, the statues of the ancient gods, the statues which were there in which the emperors were being worshipped. These types of statues were progressively removed from the public sphere. The same thing happened as Islamic, you know, Islamic culture took over regions. One of the things they did was to remove the statues of the pagan gods, to remove even the images of the Christian saints as they were taking over that area. And like I said, I know this is difficult for some people to understand, but everybody does that. Let's say that you buy a house and you and your family, you're going to move into this new house that you bought. And this house belonged to a family that was there before you. And so you buy the house, you go in, and you notice that in the house, for some reason, the People who were there before, they left pictures of themselves hanging on the wall. Now you want that house to be your house. And so what you will do is you're going to remove those pictures, because those pictures are now residues of a former world. They're residues of a former identity which don't connect to your identity. And so in order to found your identity, you will have to clean up. You're going to have to remove markers of the former identity which are too strong, which will clash, which will cause confusion in terms of your current identity. And so it's just as you do that in your own house, in the same manner any new civilization will do the same. And I'm not trying to defend anything. I'm just describing the way it happens. If a group takes over another group, one of the things they're going to want to do is to remove markers that remind them that this space in which they are used to belong to somebody else. And so the removing of statues will happen inevitably at the transition, or the removing of images will happen necessarily at the transition between two worlds. When one world is changing into another. One of the things that's going to happen is a type of iconoclasm, the destruction of the memory of the ancient world. And so the reason why I say that is, first of all, for people to understand that in itself, this act is one which is inevitable. It's going to happen. But I also want you to understand what it means when people start to destroy images, start to destroy symbols of. Of an identity, it's because they want to dismantle that identity. It's because they want to destroy that which was there before. And one of the things that happens, especially when you, you come to the end of something, when you come to the end of an identity and you start a new one, is that what you perceive of the old identity is usually the negative aspects of it. And so you could say it this way. When you found something, when you found a new identity, one of the things that is necessary to do is, like you see in the Old Testament, in the story of Noah, you have this story where Noah is now the new father of the new world. Noah is about to start a new world. And in that moment, there is a scandal. Noah gets drunk, passes out naked in his tent, and one of his sons sees that and mocks his father for this event. His other sons walk backwards and cover the nakedness of his father. And so, in order to found any identity which holds together, one of the things we need to do is, is to walk Backwards and cover the nakedness of our origin. Of course, there's a limit to how much you can cover, but you necessarily have to do that. Think about it in terms of a family. Now, every family has certain aspects of it which are not pretty, certain aspects of it which are not great. As a father, I have my faults, I have my. I have the things which are. Which I'm not doing properly. You know, my wife, as a mother has things that she's doing well, other things that she's not doing well. But the reality is that in order to preserve the unity of the family, one of the things that has to happen constantly is to a certain extent we need to walk backwards and cover the nakedness of our parents. And because if we don't, if we expose constantly the nakedness of our parents, what's going to happen is the family is going to break apart. And sometimes it should break apart. If the scandal is too great, if the father abuses his children or, you know, some horrible thing that happened, then maybe that is too great and you can't cover it and you shouldn't cover it, but they are. Everybody has their fault, you know, everybody has their little thing, which doesn't make. Which shows that they're not perfect. But if you constantly expose that, especially if you expose it to the outside, you're exposing your weakness. And your family will break apart if you do that. And so that is something which you necessarily have to do in order to preserve any country, any identity, your family, your. Your group. Like if you have a sports team, and in your sports team there are certain bad habits or certain things that. The way that the players play, you have to be careful not to expose the weakness of your team too much. Because if you're constantly talking about your star player and his weaknesses and you expose them, then that will be used by your enemy as a way to take over your team, to beat your team. And. And so you have to cover the nakedness of your own to a certain extent. Like I said, there's a limit at which it's impossible or you shouldn't do it. Because if the damage of covering the nakedness, like in case of abuse or whatever, then it's bad. And you can see that people have done that. Some people have covered the sins too much. You have the stories of coaches, of priests abusing children. And in order to preserve the team, people realize that if we expose them at the time, then it will destroy the thing we care about. And so they actually preserve the scandal. Now, you can imagine there's A hierarchy of that there are little things that go wrong that you don't want to expose. And then there's a. There's a point where you. You have to expose it if it gets too big. But you know, that's difficult to know when that's the case, when you should do one or you should do the other. But one of the things that will happen inevitably is, is that shame, that secret that you hid is going to stay there in the thing. It's going to be the fatal flaw of your identity, the thing that will in the end be exposed. There's a reason why Christ talks about how in the end all that is hidden will be exposed. He's not just saying that in terms of a moral statement. He's saying it in because it is the very process by which an identity unfolds. At first, the fault of the identity or the story or the character will be hidden. And as the story plays out and in the end, those things which were hidden at the beginning will become the undoing of the identity. And so if you want to understand what is happening now, that is what is happening. That the origins of that which was implicit in the origins of America is playing out. That is the sins of the beginning are playing out. Now the thing is that you can't avoid those. I'm not saying that to virtue signal. I'm not saying that to criticize those leaders or to criticize what was there. I mean, everybody has. All countries, all stories, all nations have darkness in their origin. That's because we are broken. And that's because we human beings have a brokenness to them. You can't avoid it. Now in the founding of America, right? Imagine a nation that was founded on the idea of kingship and hierarchy and strength and, and all of that and power. And, and that was the main core value of, of the king. And the king, you know, this hereditary, hereditary kingship. And he's the most powerful. Now there are positive aspects to that, but there are often scandals and abuses hidden in that pattern. And then ultimately what will often happen is that king will be undone by the very dark aspects of kingship will be. Will be taken by a coup from, from his brother or his cousin or someone else who's in line to be king. And they will use the dark aspects of kingship in order to then take it over. Now this is what is happening in America as well. One of the things that America was founded on was the notion of equality from freedom. Freedom and equality are the basis of the American system. And so in the very founding of the United States was hidden a sin. There was a sin hidden in the we, the people of the United States of America. In that very, those very first sentences, the notion that we are, that we are born free, that we are equal, and that these truths are seen as self evident, that was hiding a sin because, and it is that which is being exposed now, that is that which we are seeing is that the very principle of equality and freedom is now turning against those who declared it. Christ talks about how the measure by which you judge others is the measure which will be used to judge you. And that is what we're seeing happening, happening right now. And like I said, I don't want to defend it because you have to understand that what is at stake right now, as you watch statues of the founders of America and the characters which mark American history and European history, what you're seeing is an attack upon the very identity of what you are. You are witnessing a revolutionary action. That is what you're witnessing. And that's important to understand that what is happening is the dismantling of the story and the identity of America. Now, like I said, the reason why it's working is because the manner in which that dismantling is being done is through the very mechanisms of its identity. By exposing the nakedness of the fathers, by showing how they didn't live up to their own standards, how in their very declaration of freedom and equality, they were enacting something different. And the very values by which they founded their country is now coming back to devour them. And so hopefully that will be helpful. And like I said, I don't particularly like watching iconoclasts. I'm an icon carver. I don't like watching iconoclast take down statues. I don't particularly want to see the Western world be dismantled. And so hopefully what I'm giving to you is at least a key in understanding why it's happening, how it's happening. But I have to be honest with you, at this point, I don't have a solution to offer to you. I can only point and help you understand how it's happening and, and why it's happening. But you also have to understand as this ends, that one of the difficulties in what's going on right now is, for example, when Christianity took over the pagan world, there was a clear vision of what they wanted to bring about. There was not just a negative, it wasn't just about tearing down, but there was a plan of what they wanted to replace it with. If you move into a new house and you take down the pictures of your. Take down the pictures of the people who were there before. You do that with the purpose of putting up your own pictures at some point. Now it is not clear what is supposed to replace this, the identity of the United States. Right now it is not clear. And what. What appears to be shaping itself on the horizon looks much scarier than the. The very real sins of the United States founder and looks a lot scarier than that. And so I'm not cheering. I'm not cheering for the dissolution of the Western story. Even though I disagree with some aspects of it. I'm definitely not cheering for its dissolution. And it's also important to understand that once the wheel of revolution has started, it's very difficult to stop because some of the founders of. Of the. Of those who are now the woke culture, some of those also have very, very deep sins in their story as well. And those will inevitably be exposed as well. You know, there are reasons why there has never been a movie made about mlk. It's because he also has. For all the great things that he did. There are. There are dark aspects to his story and dark sins that he's hiding for all the love people have of. Of jfk. There's a reason why no one has really made a movie about his life either because his story is very dark as well. We have to be careful. If we start exposing the nakedness of our fathers there, there's very little stopping it. Catching up. We talked about how the revolution eats itself and. And that's very possible that we're going to see that happen happening at a faster and faster rate. And so sorry to be such a bummer everybody, but right that I guess that's what's happening. I still have the video game movie on the interpretation of Mario Brothers in the works. For some reason it's difficult to focus on that. I imagine you can see why, but I'll get to it of course. And so it was great to talk to everybody and I'll see you very soon. I hope you enjoyed this episode of the Symbolic World. The Symbolic World is edited by Justin Ward and it is based on a series of videos that you can find on my YouTube channel, Jonathan Pageau's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course, leaving a review on itunes. Everybody knows that's the best way to get the podcast out there to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon Pageot videos as well, and on subscribestar, all those links you can find on my website or in the show description. So thank you and I will see you soon."}
