{"episode_id":"SW - #260 - 2022-10-28 - Cain And Abel","start":0.08,"end":1676.32,"speaker":"Jonathan Pageau","text":"So the story of Cain and Abel is of course, one of the most known in scripture. And so I thought that I would go over the story with you to look at some of the details, to look at how it relates to the left and the right that I've been talking about in my most recent videos. But I also want to look at how there is a reflection of this story and a few pagan myths, and hopefully would also help you see the manner in which one can look at other stories from other cultures, from other myths, and how it can actually give you hints about some of the biblical structure. It doesn't compromise it, it doesn't question the integrity of the biblical story. But sometimes, because it follows similar patterns, it can help us see what is going on in the biblical stories, see things that we wouldn't have noticed at first glance. This is Jonathan Peugeot. Welcome to the Symbolic. So I'm going to read the story to start off with, and of course I will not go through all the details of the story. It's a very complex story. I'm prompted to do this in part because when I was in London last week, I went on stage with Jordan Peterson and he had spent the whole, whole time talking about Cain and Abel. And those of you know that Jordan really loves that story and sees it as a reflection of the pattern of deep resentment which exists in humans. And he. He wanted me to do the Q and A at the end. And as he was speaking, I had these images of these three pagan stories that came up in my mind. And so I asked him about it in the Q and A, and he gave me his answer. So I'm hoping they're going to publish the talk so you can hear what Jordan's answer was. But in the meantime, I will give you my own answer and my own, let's say, intuitions about these stories and how they all relate together. So we start in Genesis, chapter four. Now, Adam knew Eve his wife, and she conceived and bore Cain and said, I have acquired a man from the Lord. Then she bore again, this time his brother Abel. Now, Abel was a keeper of sheep, but Cain was a tiller of the ground. And in the process of time, it came to pass that Cain brought an offering of the fruit of the ground to the Lord. Abel also brought of the firstborn of his flock and of their fat. And the Lord respected Abel and his offering, but he did not respect Cain and his offering. And Cain was very angry and his countenance fell. So the Lord said to Cain, why are you angry? And why has Your countenance fallen. If you do well, will you not be accepted? And if you do not do well, sin lies at your door, and its desire is for you, but you should rule over it. Now Cain talked with Abel, his brother. And it came to pass when they were in the field that Cain rose up against Abel, his brother, and killed him. Then the Lord said to Cain, where is Abel, your brother? He said, I do not know. Am I my brother's keeper? And he said, what have you done? The voice of your brother's blood cries out to me from the ground. So now you are cursed from the earth which has opened its mouth to receive your brother's blood from your hand. When you till the ground, it shall no longer yield its strength to you. A fugitive and vagabond you shall be on the earth. And Cain said to the Lord, my punishment is greater than I can bear. Surely you have driven me out this day from the face of the ground. I shall be hidden from your face, and I shall be a fugitive and a vagabond on the earth. And it will happen that anyone who finds me will. Will kill me. And the Lord said to him, therefore whoever kills Cain, vengeance shall be taken on him sevenfold. And the Lord set a mark on Cain, lest anyone finding him should kill him. Then Cain went out from the presence of the Lord and dwelt in the land of Nod on the east of Eden. And Cain knew his wife. She conceived and bore Enoch, and he built the city and called the name of the city after his son Enoch. To Enoch was born Irad. And Irad begot Mehujalah, Jael and Mehujael begot Methushael. And Methushael begot Lamech. So let's keep going a little bit. Then Lamech took for himself two wives. The name of one was Adah, and the name of the second was Zelah. And Adah bore Jabal, and he was the father of those who dwell in tents and have livestock. His brother's name was Jubal. He was the father of those who play the harp and flute. And as for Zelah, she also bore Tubal Cain, an instructor of every craftsman in bronze and iron. And. And the sister of Tubalcain was Naamah. Then Lamech said to his wives Ada and Zila, hear my voice, wives of Lamech. Listen to my speech. For I have killed a man for wounding me, even a young man for hurting me. If Cain shall be avenged sevenfold, then Lamech, 77fold. So, of course, this story has many Elements in it. At first, when we look at it, we noticed a few things. If you're interested in some of the details of this, I already made a video called the Mark of Cain, which looks at the relationship between Cain and civilization. But a few things you can notice is of course, the relationship of increase between civilization, the increase of civilization, the increase of the curse, and how these things go together. That is, as Cain becomes a nomad and sets up a city, which looks like a contradiction, but is not at all, he sets up a city, he also sets up an increase in power, and he sets up at the same time an increase of the curse with his descendants. All of these things are there in the genealogy and the way in which it sets itself up. So, of course, as I mentioned many times before, this will lead up to the flood. As the final result of this increase of the curse, of technology, of evil in the world, all of these things are going to increase. Now, the first thing I want to do with you is I want to look at a few images of Cain and Abel. And it'll be interesting to notice the relationship of the left and the right hand that I mentioned in my different videos. And you'll see the different ways in which it can be portrayed. And so here you have a version, a few versions of the sacrifice of Cain and Abel. Now notice in each image, one of the things you have is you have Abel, who is on the side of the blessing that is on the right side of the image. He's on the left side from our point of view, but on the right side from the point of view of God, who is represented as this just dark glory that moves into light and through the hand of God here that you can see here. And so the right hand is blessing. If you remember that I talked about how the right hand has the blessing, the right hand of Christ in the icon of the. Of the Pantocrator. So the right hand is blessing Abel, who's offering the sacrifice. You can see this represented as a straight line of a ray of light or a ray of blessing which comes down upon the Lamb. And if you look carefully, you'll notice that above the Lamb there's also a flame. So the fire is going up, the blessing is coming down, and Cain here is being ignored, we could say, in this image. So there are different ways of representing it here, you see now, of course, this is a later image. And so God is represented completely, which we won't talk about here, but you can see nonetheless that God is represented here. His hand is on the right hand is blessing Abel, who is down here. His fire is going up towards God. Cain is here. God is looking away from Cain and, and the fire of his sacrifice is not going up, it's coming down towards below. And so if you remember again, the images of the Last Judgment, how on the one side, the right side is going up, the left side is going down, all of these things come together. Here's just one more image, one more version, one more way of representing it, which is interesting. Here you again have Cain and Abel here. And God appears here. Of course, this seems to be Christ, though not sure. He has a cross and it's halo. And so Christ appears above with his right hand. He is blessing Abel below. And here, interestingly enough, the smoke from Abel's sacrifice is going up, but the smoke from Cain sacrifice is returning on Cain. It's turning back on him. And his blinding him is going into his eyes and making him blind. The very powerful image of the left hand, of the straight and the curved, if you remember, I've talked about that in terms of the, for example, the staff and the globus, there are different versions of this or the staff and the snake. You know, if you think about it that way, the different aspects of the two sides, let's say, of the basic structure. And so you can see the right and the left hand symbolism being represented very well there. Now, what I wanted to talk about is, I wanted to talk about, I want to bring up three pagan myths. And so I'm going to tell you the pagan myths. And then we're. What we're going to do is we're going to look at those pagan myths with the frame of the biblical story of Cain and Abel. And what I'm hoping is that it'll help you see how you can actually use pagan myths to understand the Bible without, without feeling like it is compromising it or questioning it, but rather see it as these pattern stories that all are participating in the same pattern, seen from different points of view or for different aspects of the same patterns. And so it can help you see a pattern in scripture that maybe you hadn't noticed before. And so the first story I want to tell you is the story of Romulus and Remus. So most of you will know the story. This is of course, an image of them when they were very young and they were being suckled by a she wolf. And so the story of Romulus and Remus is that both of these brothers find a place where they're going to. Found a city, a city which in the future will be Rome. It will be the city of Rome that they're going to found. And so Romulus decides to trace the limit of the city. And after he has traced the limits, sometimes built a wall or traced some kind of limit, his brother Remus jumps over the wall, basically questions the the limit that Romulus is trying to set as being the city. And because of that, Romulus kills his brother and then founds the city of Rome. So that is story number one. Now story number two, the Titan Prometheus, who was one of the Titans. As you know, the Titans are ambiguous characters in the story. They are sometimes seen as gods that precede the lineage of Zeus or the gods that are under Zeus but somehow have been pushed in the margins. They have a marginal existence. There are many versions of how there's a relationship to them, how Zeus is related to the Titans. That is probably the best way to understand it is that there are these gods which were there before, they're there on the margin. They're related sometimes to the notion of the giants in general. There are different associations which come to be brought together. So Prometheus is on the Earth. And as the humans are offering a sacrifice to Zeus, what Prometheus does is that he tricks Zeus. Usually for the sacrifice, he would give the best part to the gods. But what Prometheus does is that he takes the bones of the animal and then puts them on the altar and hides the bones with the skin of the animal. And so Zeus can't see what is being sacrificed. And Prometheus sacrifices, gives a improper sacrifice, we could say, to Zeus. And so because of this improper sacrifice, Zeus decides to remove the fire, the divine fire that humans had, the fire that humans had to warm themselves to also create technology. So Prometheus has to, you know, climb up Mount Olympus and steal the fire from the gods and in order to bring it down to humans and give it back to humans, in doing so, he becomes the patron of technology, the patron of the different crafts, and is represented as such. Now, interestingly enough, the image that I'm showing you here is an image from the Rockefeller center in New York, which is a celebration of Prometheus. In the myth, Prometheus is then punished by Zeus for doing that. He is tied to a rock and every day an eagle comes and eats his liver. Importantly enough, it's good to understand that the liver for the ancient Greeks was seen as the seed of emotion. We could understand it as the seed of the passions. Maybe a good way to see it that way and so Prometheus ends up in this cycle of the passion because every day the eagle comes and eats his liver, but then it grows back again the next day. And so by engaging in this behavior, Prometheus falls into this cycle of passion. And of course, the last story is the story of Hephaistos. So Hephaestus is in different versions, sometimes he is the son of Zeus and Hera. Sometimes he is only a son of Hera that was born without a relationship to a man that was kind of like a virgin birth of Hera. And what happens, though, with this character Hephaestus, is that at some point he acts in an improper way. We could also say something like he breaks the rule. He makes an improper sacrifice. And because of that, he actually, what he tries to do is he tries to have a relationship with his own mother. And so he tries to seduce or to rape or to, you know, try to have a sexual intercourse with his mother. And because of that, he is thrown out of paradise. He is thrown out of the Mount Olympus, this mountain where the gods live above, and down into Hades. And now in Hades, he becomes a blacksmith and becomes the great artificer who develops all the weapons and all the different. The different metal objects that the Greeks and the Greek gods use. So now, if we think about these stories, it's interesting to notice how they come to be related to each other. So in the story of Cain and Abel, it doesn't say why it is that, you know, Cain's sacrifice is refused. And to a certain extent, it's possible that that doesn't really matter. What really matters is only the fact that it's not the right sacrifice and that sometimes this is not necessarily. That. We don't necessarily always know, you know, what is the right sacrifice or what isn't. That's possible. But. But in the story of Prometheus, it is suggested that there is a kind of trickery in the sacrifice. That is, Prometheus tries to trick Zeus by offering the least good, you know, not the best fruit, but the worst fruits. But that, of course, if you do that, you know, you can't trick the gods. And that is what prompts Zeus to remove the fire from the humans. In the story of Cain and Abel, it is what prompts Cain to become resentful. He doesn't offer the proper sacrifice, he becomes resentful. But then he founds a city. And so it's very important to see the relationship that in the story of Prometheus, the idea that there's a relationship between Improper sacrifice or presumptuous sacrifice maybe is the best way to understand it. You know, a kind of trying to trick reality or trying to not be forthright and true about what is real. And artificing, even though we even use it, you can understand that we use the notion artificer. We say that something is artificial because we see it to a certain extent as a fake or a lesser version of. Of that which is the true thing. So in the very story of Cain, now you can understand and in the story of Prometheus that there's a relationship between the improper sacrifice and that which pretends to be something else and the artificing and how technology, although it is an increasing of power, it is something like a. An imitation of the natural processes, possibly an increase, but an increase in which the essence of something is diminished as it increases its power. So we can see that of course, in the story of Cain and Abel, that is that as Cain increases the power and as his generations increase in power and in making weapons and different aspects of that, then he is also increasing the curse. Now, in the story of Cain and Abel, you can understand that even as the arts, that is the artificial version of natural patterns that are imitated by humans. And so there are natural patterns that kind of reveal themselves to us. And now humans will imitate those patterns, whether it's music, whether it is by different, you know, images, making images that resemble something else, making buildings that have, let's say, the proportions, natural proportions of a natural space, but now enclosing and kind of creating a shell around it in order to protect Cain and Abel. So you can kind of get this intuition of what it is that what are these themes dealing with? And you can also see, for example, in the story of Hephaistos, the same type of pattern, which is that Hephaistos is presumptuous. He tries to do something which is unacceptable. He tries to raise himself up at the level of his father by having a relationship with his own mother. And because of that, he gets thrown out of paradise, just like Prometheus is, let's say, thrown out of the presence of the God chain to the. To the rock. There's a punishment. And that punishment will lead Hephaistos to create the artifices that he creates. Now, in the story of Hephaistos, you get an even better sense of what's going on, because in the story it says that Hephaistos, there are two versions, or they're different strains. One is that when Zeus threw him out of Olympus he fell and then became lame. And there are other versions where he was already lame before. And that is possibly one of the reasons why Zeus threw him out. To a certain extent. It doesn't matter which one of those versions you you look at. What's important to understand is that there's a relationship between weakness and artifice. There's a relationship between the fact of not having self sufficient power within ourselves and having to add this power from the outside, like the garments of skin, in order to increase one's power. And so if in Adam and Eve the fall and the fall out of the garden makes them weaker and because of that they have to supplement their power, they. The same thing happens to Cain as he's chased out further out from the garden, he becomes weaker and fragile and is in danger and so has to create the city to compensate for his weakness. You see that of course, in the story of Hephaistos. Now what's interesting is that you can see kind of all these themes coming together, that there's a relationship between presumption, a relationship between presumption and then also weakness, maybe even presumption in weakness. And that this is what let's say brings about the civilization itself and brings about technology as a means to supplement that that weakness. And so it's very interesting to notice how if you look at the different stories, you can see these weave patterns. They're not exactly the same. You know, it's those all these stories are not the same, but they have enough elements that are similar to help us see how a through line of what it is that these stories are talking about. Because they are using different analogies to bring about similar conclusions or to help us see similar things. So you can understand for example, that the passions that Prometheus deals with, this cycle of passions is related to even the causing of technology and the desire for more power that technology brings about. It's also related to the fact that Cain, when he is resentful of his brother and angry that his sacrifice is not accepted, that God warns him, right, that sin is at his door and is watching him and is there to devour him. And so this is of course related to Prometheus, who's in this cycle of emotions or cycle of passion, which could also be seen as a cycle of sin. And that cycle of sin is related of course to Hephaisos transgression, which is a circular transgression as well. That is wanting to have intercourse with your own mother, breaking the normal causality, which will then lead him to becoming an artificer. So all of these things are related. And so what's important is to see that, at least at the outset, in the laboratory of symbolism, as we're looking at the different stories and how they relate to each other and how the analogies come together and how the analogies show mirror each other. What we don't have at the outset is a kind of moralism, is a kind of lesson. The lesson isn't there quite at the outset. You have to be able to distill the imagery and to get a sense of what it is that's going on. And then later, then you can apply it, and you can apply it in different ways because you have a sense of what deep, deep, deep pattern these stories are bringing to the fore. And so you can then use the story of Cain and Abel to talk about resentment. You can use the story of Cain and Abel to talk about how the more you increase your power, the more there is danger, that you will also increase the, let's say, the curse or let's say, the consequences of that power in the world. So you can use it in different ways. There are different aspects that you can bring about once you start to kind of understand the story. And so there's another little interesting aspect in terms of circular causality that is there in the story of Cain and Abel, which is not in the Bible, but appears in later traditions that have to do with Hephaistos wanting to have a relationship with his own mother. So when we get to the last part, for example, of the story of Lamech, when it says, you know, he says to his wives Ada and Zila, hear my voice, wives of Lamech, listen to my speech where I have killed a man for wounding me, even a young man for hurting me. If Cain shall be avenged sevenfold, then Lamech77fold. It's very strange and mysterious text because he doesn't tell you, who did he kill? What is he talking about? Who is he referring to? None of this makes sense. And so, of course, these, these cryptic texts, especially the very early ones, they will give rise to legends. And then, if you understand all these analogies that I've been bringing up, you can understand why the legends look the way they do. The legends related to these stories often are a way to explicit what it is that's going on. And so the way the legend goes, which is based on different pseudographic texts, both in the Christian sources and in the Jewish sources as well, you see it in Rashi, but you also see it in, I think, what Is. I forget what it's called, the Book of Adam and Eve. This, I think it's that. That's the book. The, the legend goes that Lamech became old and was. Became blind. And so as he was old and blind, he was taken by his son, Tubal Cain to go hunting. So Tubal Cain brought him hunting. And so as they were hunting, they saw in the distance something which they thought, or that Tubal Cain thought to be an animal. And when Lamech shot the arrow, it turned out that that character was actually Cain. And so Lamech kills Cain, but then when he finds out that he's killed his own ancestor, he gets extremely angry and. And then kills Tubal Cain as well. And so he kills Cain, he kills Tubal Cain, and then that brings him to say that he will be avenged 77fold. And so what's interesting is that you see both the increase in violence, you also see the circular causality where Lamech is killing both his ancestor and his son. Right. We talked about the problem of revolutionary, revolutionary myths where you have Zeus, you know, you have Saturn, that Kronos, who castrates his father and then has to eat his children in order to, to stop the revolution. You see the same story in some versions of the story of Zeus where, you know, he ends up killing his father and he. Or he ends up killing his children. So you have this problem of the revolutionary story and how it tends to self devour and self and break apart. And so you have a version of this in this legend about Cain and Abel, where ultimately the process that Cain enters into, this process of supplementarity based on the killing of his own brother, leads to a place where he is killed by his descendant. And that descendant also kills his own son. And so he is left in a position, an impossible position of tragedy, where the entire line of Cain self devours in the end and leads to this increase, increase, increase in violence, which is represented in the idea of Lamech saying, you know, if Cain shall be avenged sevenfold, then I will be avenged 77fold. And so as you kind of understand the structure of these stories, you will be able hopefully to see that even the legends that get associated with the biblical story, they're not usually not arbitrary. Of course, they have less force than the text themselves. But if you can get the pattern, then when you look at those legends, you'll be able to understand them more easily. So I hope this has been enlightening, and I know for some of you it might be frustrating because I'm leaving it at least in this case into all these analogies and bringing you up into the laboratory of symbolism. And it'll be interesting to see how you can take all these references and links that I brought together and then apply them to specific contexts. And so I thank everybody for your attention and I'll talk to you very soon. I hope you enjoyed this episode of the Symbolic World. The Symbolic World is based on a series of videos that you can find on my YouTube channel, Jonathan Pageau's YouTube channel. You can also get involved with. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course leaving a review on itunes."}
