{"episode_id":"SW - #183 - 2021-10-25 - August 2021 Super-Post-Covid Q&A","start":12.16,"end":8025.31,"speaker":"Jonathan Pageau","text":"This is Jonathan Pedro. Welcome to the symbolic world. All right, here we are. August. Super post. Covid. Q and A. August was crazy. My goodness, August was insane, at least for me. I went to Europe, participated in, in a manifesto event which was pretty intense, I have to say, just very intense weekend. And then I spent a day in. Spend a few more days there in Denmark and it was great. It was wonderful. And. And then I got Covid. Yeah, so I, I got back here and I was tested at the airport here to just avoid kind of the social stigma and the social problems. We are really self isolated from my family. Then the result was positive. Two days later I got the positive result and so I moved out of the house and lived basically outside the house in a tent for a few days. And then my wonderful wife found a camper trailer that someone on my street had and so we rented it for the week. So yeah, so I really did get Covid. It was like, it was like this, just this really bad flu that lasted, lasted a whole week. And I lost my sense of smell and of taste. So I was very, just. My brain was in complete fog, which is why I didn't make any videos. You know, during that time I actually carved a lot, which was great. It was actually wonderful. I could just carve all day and that was fine because it didn't take up my brain. And so yes, I am recovered. I'm back. My sense of smell and taste have come back in the past three, four days. But I'm still, I'm still super exhausted. It's like it really, you know, I, I feel like I have energy and then at some point during the day I just totally burn out. And so that's been pretty intense. And so, so that has been this month. And today I was interviewed by the Babylon Bee, which was a lot of fun and so look forward to that. I'm. I'm. I don't know when they're gonna, gonna put it out. It was, it was a little intense I guess because I think, I don't know how much they knew about what I was doing. So I think they were surprised at some of my answers. But it ended up being fun. There was some funny moments in it. So you should definitely watch it. And what else is there going on? Yes. Something some of you might will be very happy to hear is that next Thursday. So the second, September 2nd at 7:00pm Eastern I will be on Jay Dyer's channel. We'll be talking about iconography. And so a lot of people have been looking forward to that for a very long time. So I'm pretty happy that it's. That it's finally happening. You know, we had some. We had some kind of misunderstanding and some issues, and I feel like we really worked through them and that, you know, the. Let's say that the respect between us is mutual. And so I think it's a. It's a good time. So. So we're going to do that. Going to do that the next few days. So look forward to that. What else is going on? There's a lot of stuff going on. And then on. On Friday. Is it on Friday? I think no, it's next week. Next week on the 10th, I'm Inter. I'm having another discussion with Jordan Peters, with John Vervecki. And so if you guys watch that conversation between Jordan and John, that was crazy. That was a crazy conversation. It was extremely manic and intense. And so I'm both looking forward to that and let's be honest, a little nervous about, about that conversation. So there's a lot of stuff. Look, something else that you might want to pay attention to. I'll be posting about it on social media. I'm on my website as well. On the 25th of September, I'll be speaking at the Jung Society of Montreal. And so they invited me to come speak. It's going to be on Zoom. So if people want to get tickets, I don't know how much it is, but you can get tickets and you can participate in that event. Yeah, just a bunch of stuff. Just a bunch of stuff going on. So I don't know if there's anything else. I'm supposed to be in Florida in October to speak at the OCA Diocese of the south as a keynote speaker. And I'm supposed to be in Chicago as well to participate in a Catholic art conference in October as well, but with all the weird travel stuff. And now our Covid passport is starting tomorrow. Yay. Hooray for Covid passports. Starting tomorrow. Those that are not vaccinated cannot access any public spaces. You can't go to a restaurant, can't go to a theater, can go to participate, go to a gym, participate in any sports activities. And. And so that's starting tomorrow. So. Yes, that's just, just, just great. Just, that's, that's just great. We just super happy about, you know, this whole system of the beast thing kind of just manifesting itself slowly but surely. All right, sorry. Okay, let's stay positive tonight because there are so many, so many questions. So many questions. I don't know how to deal with this anymore. There's like, someone in the chat said, we gave you a hundred questions because we have no manners. That's what it feels like. Well, it's not anybody's fault. Everybody just puts in one question. So. So yes, I. I think there's something like. Like 80 questions. So I don't know. I don't know if we'll make it through. We'll see. We'll make it through. We'll try. We'll do what we can. So. So, yes. Okay, so here we go. Let us start. We will start with the website. So I hope nobody's still having. Yes, Vincent Harris says coughing equals coronavirus. You know what? I don't think it's the coronavirus. It might have made it worse. But one of the things that. That happened during my Covid is that I spent the whole week in my workshop, you know, all day for. For like 10 days. And I started coughing like crazy. And I thought it was Covid, but I think I have silica in my lungs. I think that because it's been kind of happening before, I noticed that I run out of breath. You might have seen me sometimes in interviews. Sometimes I kind of run out of breath. And it's possible that I have silica in my lungs, which is really bad. Yeah, it's very bad. So I need to find solutions to that or else I won't be able. Or else I actually will have to stop carving because it can. It can ruin your lungs completely. Okay. So anyways, so a lot of joy. Somebody asked the Green Knight movie. I haven't watched it yet, so I can't interpret that. So I don't know. I don't know. I will watch it. I'm for sure. I'm gonna watch it. Everybody tell me I need to watch it. So I definitely will watch it, but I haven't watched it yet. I'm gonna make a video. I want to make a video on the Loki series, just the last episode, because there was so many weird, interesting things about the Garden of Eden and the temptation and that this kind of presentation of extremes and how, you know, it was presented like they had no solution. So anyways, I'm going to do. Probably do a video on. On that. I still have my video about the Mark of the Beast, which, as you can see, I'm very much hesitating to make because. Because a lot of stuff has happened, and part of it has been that I've been somewhat warned by people I respect and people who knew Elder Saint Paisios about some of the things that Saint Paisios said. He did say them, but just been warned to be careful about that. And so I want to make sure that I'm not just pouring oil on a fire, but I. I also think it's important to. To kind of talk about this stuff. So. Yeah, so let's go. All right, here we go. So the more I talk, the less I'm answering questions. And since there are a lot of questions, I need to do that. Okay. So Nikos asks maybe that better formulated. Are we determined to be free or are we free to be slaves? And so the idea is that there really is only one freedom, and that the freedom, the only freedom we have is to move, let's say in humility towards God. And so as we submit to God, we actually become free. It might seem like some kind of paradox, but it actually isn't a paradox. It's actually very coherent because the slavery we have is usually at least. Especially personally, it's at least it's lateral and it's lower. It's like we're slaves of our desires. We're slave of a. Of a tyranny of your passions, something things that are controlling you. And the. The slavery happens here, right? The slavery happens. Happens in your mind and in your. In the way that you interpret your situation. But as you kind of move towards God, then you become free in the sense that you might actually be led to your death. You might actually be tortured, you might actually be persecuted. All these things might happen to you, but those things won't determine you. And that's what, let's say the difference between slavery and true freedom is, is that even though things will happen to you, and outwardly you might look like you are constrained, but inwardly you are free because you get your identity. You get your. Yeah, you get your identity from above. And so you don't. You don't feel weight. You're not weighed down by the things that are constraining you outside you. So that's actually the freedom. And St Max Maximus presents it that way. The only freedom is choosing God. When you choose other things aside from God, that's when you become a slave. So it's not about being able to do whatever you want. That's not the idea. But you. But anyways. But it's all. It's discovering that what you really want deep down inside is to be united with your origin, to united with that which is, you know, the source of you. So. Yeah, so. All right. Sorry, Nicos, I'm taking Only one question per person or else this is not, it's not going to work. So I'm going to have to skip your question. Your second question, Timothy Aspaslaw Ask. Hey Jonathan, glad to hear you're feeling better. What are your latest recommendations? For example, a new book you've been reading or a podcast you just found. Hope you feel better every day. Thank you. I'm reading right now. I'm looking at an interesting book. I'll show it to you. I don't know where it is. Where did I put it? Sorry, I can't. I don't know where I put it. It's something like. It's like the Plan to Kill God or the Conspiracy to Kill God. And it looks at the real strategies that the communists used in, in Russia to destroy religion and how it was active, hostile atheism. And I'm just reading that just because I just want more, more arsenal towards people who kind of portray secularism and atheism as this benign force, as this kind of live and let live force. But definitely in the communist era it was an active anti theism, you know. And the strategies that you can find are interesting because you can kind of see, kind of see on the horizon some of these strategies appearing. I'm also reading Father Andrew Damick's new book. Is it oh God, Arise? And so I'm really excited about that. I haven't started it yet, but that's really like the next thing I'm going to look into. And I'll also have Father Andrew on my channel very soon to talk about his new book. So that's cool. Okay. So Shay, Shay McKenna says if you want to just answer this Chris question thoughts on Donna Donda and will you make a video on it? Have loved all your kind of videos. And so I'm still kind of digesting the Donda thing because it's like two hours long that album. It's like who has time, man? You? I don't know. So, so I'm kind of listening it to it in my spare time, trying to kind of wrap my head around it. I think that my first impression of it is that it's, it's somewhat uneven let's say in terms of an album. Some of the songs seem unfinished and some of the songs are, are, are really good. And so there are some that I really like. There's a song called Heaven and Hell which I really like because it has, it has a kind of that militant feeling about, you know, about heaven and hell and about the devil and everything. I like that. I like that song a lot. There's Another song called 24 which uses the, you know, this kind of gospel choir feeling which I also quite kind of like. I really like Jesus Is King. A lot of people said it wasn't one of his best albums, but I really, I actually really liked all the songs on that album. So. So those are the songs close. I don't like. I really struggle with this. The, like the, the recent rap, you know, noise making is the only thing I can say. And also the desire to reduce the. Reduce the bars, you know, like to have each sentence be like two words. I really struggle with that. So it's hard for me to enjoy that. I just, and I just gets on my nerves. So I have to say for now at least it's, it's a, it's kind of 50, 50 and it. And also the, the things that are said on the album seem a little less coherent, let's say just, just a little bit all. Yeah, so that's my, that's my thing. How does one properly name a multi headed beast? That would be a hydra. That's usually how we call the multi headed beast. I mean, I don't know if there's another word for it. I mean the chimera is the usual just word we use for a beast that has different types of heads, you know. So. Eddie T. Why does a snake respond to the music of the snake charmer? I think it doesn't. Is my understanding is that it actually responds to the movement of the flute. And so it's the movement of the flute which is making the serpent sway back and forth. And so I think it's. I mean it's just basically fixing a moving point like a predator. And so I think that that's what is happening. But if you want to understand the symbolism, let's say of the idea of the music, the snake charming musician. It has to do with the idea that patterns solve animality. And that pattern, you know, this idea, you know, that was it music calms the beast or whatever. You see different tropes of that. It has to, it has to do with the idea that. That patterns are what elevate the world into consciousness, you could say. And so through it. I don't think it actually. These things actually work. But the idea that. I think animals actually don't hear the, the patterns. But the idea, let's say that the trope or the, the kind of superstition around it is quite coherent. It's really the idea that through, through patterns you can make something more human or make something calmer, bring it into the pattern. And so an example that of course is David, who plays music for King Saul and is able to calm his melancholy by playing music for him. So these patterns are healing King Saul. So Garner brothers asked, what is the symbolism of Hollywood, a city industry that sells stories as products? Seems there's something wrong with churning out stories to meet a bottom line for stories production investors rather than letting stories arise organically from the experience of storyteller culture. Yes, I mean, for sure, there's definitely a problem with Hollywood in terms of what it is and what it manifests. Seems also in general that it's not just about storytelling. There's also a whole idea of storytelling which are leading us towards decadence. Are normalizing things which, which are not normal in a regular society, you know, a kind of voyeurism where you look at people's private lives in way that, that we're so used to, we think it's normal, but. But that is actually somewhat perverse ultimately. And so, I mean, I'm not saying there isn't anything good that can ever come out of. Of that, you know, and you know, you've watched some of my video movie critiques where I've actually tried to point to some of the positive things. But I think in general, Hollywood and the movie industry and the music industry and all these things participate in the problem of entertainment culture and the transformation from participative culture into this kind of passive consumer culture, which is, which is really deadly for the soul ultimately, especially if that's all you have. You know, you can't live in these movies. You can't live in a concert is a passive. These are not your songs. Right? They're their songs. They're not your stories. It's their stories. It's not the things you can participate in. So ultimately that's what it's leading to. So Samuel asks. Hi, Jonathan, hope you're well. After watching your interesting conversation with Uber Boyo, I was thinking about Christianity and physical strength. Are there any good places to look for Christian inspiration or guidance on being physically strong or a protector? It does seem most writings are from monks who, although I appreciate that they are battling demons and not exactly considering the spiritual implication of getting shredded or being a protector in the way a warrior would need to be. Is there a devotional aspect to exercise physical activity in the Christian tradition? And do you know anywhere to explore this idea in any depth? And so yes, there is, there is. At least I unders. I know it more in terms of the West. That is, in the west, there developed a, A chivalric code, you know, in which physical prowess, prowess and, you know, capacity to accomplish certain skills which were related to combat to war, were seen as way to, as a way to, to, let's say, accumulate honor. And then, of course, this honor would be given to a woman, would be given to, to your lady, you know, and so that is an interesting idea in terms of the notion that, that you receive honor, then sacrifice it towards, towards those that can't do what you're doing. And so there definitely is a general aesthetic of the night and of the, the, the, the. The. The prowess of the physical prowess of the night, which I think is there. I think that we have to be careful. It's, it is a dangerous world to get into because it is a world which is full of. Which can lead you to pride just like a lot of other things. For sure, I struggle a little more with the getting shredded part in the sense of, you know, the, the sense of creating these, these, these bodies that aesthetic, let's say, I struggle a little more with that. But, you know, who knows? It's not, I don't think it's, it's not necessarily evil or anything. I just think it's maybe not as useful for the spiritual life. And I think that physical discipline and, and exercise and, and physical discipline can be downstream from spiritual discipline. It can help you understand the difficulty. The sacrifice can help you understand the, you know, that the idea of being drawn by purpose and focusing on purpose, you know, and creating good habits, all of that, I think can be useful to help you understand what spiritual discipline is. So, you know, St. Paul himself uses the image of an athlete, you know, of a race and all these images to talk about the spiritual life, you know, which means that analogically, you know, there's something in those practices which are worthy of using as images for the spiritual, spiritual life. So. Nelson, Justin, Evan. I feel uneasy at the prospect of secular food banks which forbid mentioning religious affiliation. The secular food bank does what Christ asked, feeding the hungry, but they do it in a way which does not recognize Christ's lordship. Just as Judas tries to sell the anointing oil to feed the poor instead of using to worship, Christ is giving aid to the homeless without saying the aid is given in Christ's name, an embodiment of Antichrist typology. So the one thing that's important to understand is that the kind of helping the poor that Christ talks about has a lot to do with spiritual realization has a lot to do with. With understanding your own passions and then giving yourself to those that are smaller than you, you know, in order to kind of participate in this great pattern of God giving to us. You know, I think that. That it happens very much individually. I don't think that. I think that it is completely fine to give to the poor as an individual without preaching to them. I think that the purpose is. Really, a lot of the purpose is for you when you give to the poor, yes, of course you're going to help the poor, but a lot of it is about you being willing to give up, you know, your riches, willing to give up your surplus, willing to give up, you know, and. And give to the poor. And so. So I don't think you necessarily have to preach them all the time. In terms of secular food banks, I mean, I think. I think those are. How can I say this? It's like I think Christian food banks are better, but if there aren't Christian food banks, then I think secular food banks are fine in the sense that when non Christians do what Christians should do, I think that that's good. But like you said, of course, this is not a Christian thing, right? And so I think that as Christians, we should give to people in the name of Christ. And we should, you know, and we should. So Christians, if there's a competition for Christians to have food banks with non Christians, you know, and so Christians just need to rise up. Just need to rise up to the challenge, I think, and. And do it in a more loving way. Because one of the things that qualifies secular charity, and this is something that I've experienced living in Africa for a very long time, is that it's extremely bureaucratic. And there's something about it which is actually quite cold. There isn't that sacrifice, self sacrifice, which will. Which will be embodied by some nun, you know, who lives in Uganda and takes care of children and has given up her life in order to. To help these children. You know, this is very different from the NGO worker who has UN money and then delivers food to a village. There's nothing wrong with that, but there's definitely something lacking, you know, in terms of seeing this help also as an act of communion and of encountering Christ. So, PKB5021. The symbolic view shows us that we live in a narrative. And to a certain extent, we reflect our experiences in the narrative through stories, paintings, poems. How does free will live within the context of the symbolic view? Because sometimes it seems no matter what you Do a particular narrative has to be fulfilled, I. E. The death and rising of Christ. And so, like I said, the freedom that we have is not a freedom is not a freedom to do whatever you want. That, that is not what freedom is. Right. Freedom is to participate in the pattern in a way in which you are going up the ladder, you could say, which you're actually being freed from the lower aspects of the pattern as tyrants. And, and, and, and you're moving up towards God. And so you're right, that's the pattern. The death and rising of Christ, the pattern of everything is the pattern. And to a certain extent, you can't really change that. And there's no reason to want to. There is a place in. There is a place in this, this whole pattern for idiosyncrasy, you know, and, and, and idiosyncrasy is a, is, is part of it, but that's not what we should really be attached to. So we shouldn't necessarily be attached to the capacity we have for idiosyncra and wearing a blue tie instead of a red tie. I mean, that's fine, whatever, it's not a big deal, but that's obviously not what true freedom is. So the story. So David Flores asked, in the story of St. George and the dragon, at least the versions I've heard and depictions I've seen, there is an emphasis on piercing the dragon's throat. What is the symbolic significance of this being the mortal wound as opposed to the heat or something else? I'm not sure I understand the idea of the heat. Well, usually the way that you see St. George killing the dragon and also St. Michael is that they say, is that they stick the, the lance inside the mouth of the dragon. And so there's a lot going on there. It has to do with, let's say, fixing the lie, fixing the snake. You know, the head of the dragon is the place, of course, the head of anything is always the place where the identity is. It's always, it's. It's one of the places, let's say, where the identity is. And so the idea of, of, of piercing through the mouth, you know, piercing the head, you know, through the face, let's say, has to do with that, fixing the snake, you know, stopping it from moving left and right, let's say. So I think that that's what, that's what's, what's going on there. All right, so. All right, so, sorry, I'm, I'm really going to skip people's second questions, okay? I'm just gonna do one per person, so. Phil. Hi, Jonathan. Happy to hear you're on back on your feet. Joseph Campbell wrote that people have different capacities for belief, for conceptions of God, even when they use the same name. Campbell wrote that this is one of the ironies of monotheism, isn't it? Isn't monotheism at all because everybody believes in God in a different way. Is this spinning hairs? Maybe it speaks to Christianity and other monotheistic faiths ability to morph, to incorporate myths of many cultures or even different beliefs and individuals. So the way to understand that is not. It's not. It doesn't have to be that complicated, it doesn't have to be that controversial, is that God is beyond all identity, is beyond all name, is beyond all definition, is beyond all description. And so then from there, God fills up the entire world, fills up all of reality. And so what will happen is that then there will be dogmas, let's say the. The Trinity. There will be things which are real and are really a lower version of. Of a description of God, but nonetheless one which is real and participates in how God fills up reality. And then there will be more. There will be, let's say, more poetic versions where you hear people sing in the psalms, different descriptions of God. All of these will participate in that. And then there will also be the way that you. And that you encounter God. And that way will be, at least at the outset, extremely fragmentary, extremely limited, extremely related to your own story in a way which might make God look like not much. But that's because God fills up the world. And we encounter God in the capacity that we have to encounter God. And so as we come closer to God, then God, let's say self, reveals himself, reveals himself to the person. And then more aspects, a deeper version of what God's revelation is will start to connect to you and you'll start to have a lesson, a less idiosyncratic, a less, you know, a bigger and fuller version of what God really is. And that can lead, of course, to. To the highest. To the highest. And can leave. Yeah, leave there. So. All right. So glad to have you back. I hope by the time you see this, you regain your taste and smell. Yes, I have. But what is the symbolism of. Pertaining to the smearing and sprinkling of blood on the altar after the pouring of the blood on the earth? I have been thinking of them as opposites, but I'm not sure if that's a proper way of looking at them. My guess is that to do with the polarity of heaven and earth. I'm a little lost, though. It really has to do with covering, you know, and so the. The blood is like the life of the being. And so it's. And so it goes down, right? And so the flesh is kind of more like the potential, let's say, of the being. And then that goes up. It's. It's like a crossing. And so part of the going down is covering. So you can imagine blood covering the altar, covering the different holy things in order to purify them, you know, and so that has to do with the higher element of being coming down and covering in order to. In order to make it participate in that higher part, let's say. So at least that's the way that I understand it. All right, so King of the Rat Kings asks what is the symbolism of profanity, particularly how modern languages tend to place words related to things, things like feces and sexuality, as profanity as opposed to archaic profanities, like in Quebecois. And so what. What King of the Rat Kings is. Is suggesting is because in Quebecois, like the French Canadian, their profanity or their swearing is. Is all religious words, you know, and you hear that in English too. People will say the name of. Of Christ, will say the name of the Mother of God as a form of swearing, as a form of. Of profanity. And so that is definitely. That's what it is. That's really a form of. Of debasing, you know, it has to do with the idea that, you know, so I've talked to you about the idea of the, let's say the. The nakedness of. Of glory and the nakedness of shame. And it has to do with what I talked about in my video on this, on the. The mark of Cain. It has to do with setting aside. So what happens is that there are two aspects of setting aside. There's an aspect of setting aside which is setting aside above, right? So all the holy things. And there's an aspect of setting aside which is setting aside to exclude or to bury, you know, the taboo part, let's say. And so the setting aside above, that has to do with the religious words, the setting aside, let's say of shame has to do with the. The. All of. The idea of feces and of. Of. Of set dirty versions of sexuality or using. Using shocking words to describe sex and to describe. Describe the things that you hide in shame, the things that you. That you're not supposed to expose. So that's also why the words we use as profanity, sexual words, are not talking about procreation or about, you know, loving, tender relationship with your spouse, but is a kind of vulgar word which debases. Debases sexuality. That's why it's profanity. So it has to do with this setting aside. Now, what's fascinating about swearing is that it's, it's also, it's taking that which is set aside above and bringing it down below. And so it's turning that which is set aside for God and making it at the level of set aside in the shameful side, in the shameful way. And so that's what's going on there. That's why in swearing, you'll both have words that are about taboos and about, you know, about excrement and things that are. That are supposed to be hidden and about things that are supposed to be hidden in the holy things. So that's what's going on there. That's why those, both of those extremes are used to, let's say, express something beyond meaning, express something beyond rational meaning. And that's often what swearing is. It's something like expressing an emotion which is beyond meaning, beyond rational meaning. And so it comes out as these taboo words, expressing emotions which are too strong, expressing surprise, expressing frustration. All of this is the place where swearing will appear. And it's also filler, like basic, just filler, meaningless words that people insert into sentences because they can't hold their meaning together, let's say. And so they have a bad habit of putting in these filler words that aren't actually meaningful but are taboo words. So hopefully, I don't think I've ever talked about this before. So I think this, hopefully this will help you kind of understand why swearing and profanity, why they look the way. Why they look the way they do. All right, so CS Streetso asks. My wife recently became interested in pretty gemstone. The New Age spiritual movement and other cultures seem to have an affinity for crystals, gems and other rare stones. Sometimes the stones are perforated, perpetrated to have magical healing properties, the ability to channel negative energy, you know, away from positive energy towards person or place, and many other special properties. I scoffed at these claims when I was a materialist. However, I'm trying to break out of my materialist framework. And I recall a video you did on Dwarves where you briefly mentioned rare stones. Is this idea of using raw or polished stones to affect the world, a remnant of primitive technology, how to precious stones and gems fit into one's home and into the Christian hierarchy in general. And so for sure, stones, precious stones are really important. They're important in scripture and they're used meaningfully. They're used in the. Now my mind is blank. The, the vestment that the priest has, he had a square with stones in them. And that seems to be to the casting of lots and the, to the divination practices which existed in the Old Testament. And so it's not, it's not that material objects or that especially precious ones, especially those that are light bearing, you could say that's what, that's one of the reasons why these stones are so fascinating to people is that they're stones but they, they shine, right? They, you see through them. They're. They have a kind of subtlety which something like granite or, you know, the more opaque stones don't have. So for example, like a really, a really kind of fascinating midrash that can help you kind of understand the difference is that in there are some Jewish midrash and traditions which talk about how when Moses received the stones from God, at the outset there was like a precious stone, right? It was like a translucent precious stone on which God wrote the commandments. And then Moses brought them down, but the world was not ready for them. The world could not accept it. And there was no way to connect the, the. That these stones with the world. And so Moses broke them and then when he wrote them himself on stones, then they were rougher stones like, you know, like a marble or a granite or sandstone or something. And so it can kind of help you see that. You could also help you understand why the new Jerusalem is made out of these stones. Now, now, having said that, the problem with a lot of this New age stuff is that it's just made up. It's just made up. People just make it up. Who knows where all this stuff comes from? It's just kind of this thing. They give these properties to these stones. And I mean, whatever. I don't know where it comes from. I don't know what it is. And it's also a kind of weird materialism. It's not about meaning. It's not about, let's say, you know, the idea that, let's say the king would have certain stones which would be attributed to him and that would kind of participate in his glory, that kind of thing where there would be. The effect the stone would have, would be related to meaning. It's all it really is about like these, these weird energies that people talk about a lot of. And these, you Know a lot of these new ages, when they talk about energies, they really mean it in a like, in a scientific way, like a wave particle that is that that is kind of floating in the air and that you have to red. You have to focus or you have to do all this stuff. And so a lot of the new way stuff is just materialist nonsense. And so when you join with that some weird idea about stones, it just ends up being, I think it just ends up being a lot of, lot of made up stuff. It doesn't mean that it can't sometimes work because you know, belief is part of reality and you know, placebos work. So, so if you have something which is, which is kind of precious and which is beautiful and so maybe it can have an effect on you, but I definitely wouldn't count on that stuff. Like it's just, most of it is just modern made up stuff in my opinion. So sorry, I don't know if this is helpful, but. All right. So Stephen Wong says, what is the difference between Protestants and orthodox Christians views on salvation? I mean that would be a very long post and a very long answer. I'm not sure I could get through there. But an easy way for people to understand, let's say a little bit of the difference is that let's say many Protestants, not all Protestants, but many Protestants really focus on the idea of, of substitution, you know, and an atonement by substitution, which is the idea that when Adam sinned he kind of infected humanity with sin and that we deserve to die. And so the sacrificial system in the Old Testament was a way to compensate for that, was the way to offer things instead of yourself because you're supposed to die because you know, God's anger was kind of directed towards you to kill you. And so the idea is that God put all his anger on Christ and he is the substitution, the substitutional whatever sacrifice. And, and that's how we are saved. So if we believe in that, then we are saved because we can enter into that sacrifice. And so that's like, I'm, like I said, not all process believe that, but it's definitely a, a basic idea and that you're saved by faith. So you, if you believe that, if you believe God believe that this sacrifice is, is, is true, then then you are saved by it. And so orthodox really don't see salvation like that at all. They see salvation as a form of healing, a form of that that through the sin of Adam, death entered into the world. And so we live in these bodies of Death, which, which are pulling us in different directions, you know, because you, your, your body is in danger, then you have a propensity to sin because you can be convinced that your desire to eat or your desire for sex or your desire to protect yourself is all encompassing. And so you feel comfortable taking things from others because you're doing it to protect yourself or to bolster your dead life, let's say, and that Christ came to assume human nature, fill it up with his presence, and that participating in that through the sacraments, through communion, through love of each other, is a healing process for our life of death, let's say. So that's what salvation is. Salvation is actually healing from these passions, from these desires, from the slavery that we have, you know, with things of the world. And that the ultimate version of that is not just to be declared holy or declared saved or, you know, going to heaven when you die, but is really to become God through participation, to be united fully to God, to participate in his life to the extent that that's possible. And so that's the ultimate goal of salvation is theosis. It's to become. To be united with God. All right, so Jay Grubb says, what is the symbolism of the nose or smell in general, but also in the context of icons, saints often have thin noses. A quote of relevance may be from the Religion of the Apostles, where Father Stephen DeYoung says that an oft repeated theme in Hebrew scripture that God is slow to anger in Hebrew idiom, literally long of nose. This idiomatic phrase for patience or long suffering is reflected in depiction of the saints with long noses in traditional iconography. I don't understand the symbolic association between patience and having a long nose. I guess this question may be of more immediate relevance given your current loss of smell, which I hope you get back soon. But that makes me think, is the loss of smell from COVID symbolic anything? All right, so the importance of smell, for example, is very important because smell is, you could say something like smell is the closest thing to a spiritual sense that we have in the idea that smells are. You can't touch them, you can't see them, you can't hear them. They are ex pure experiences. There's a sense in which, like, you know, we burn the incense and the smoke, this air, the smells are contained in the air. So the air goes up and the air is smelled by God or the, the sacrifice, even of the meat. You know, the meat sacrifices were smelled by God because it's the spiritual part of it which goes up and it's air, basically. And so the idea of this capacity to perceive air is what smell is. And so that's why it is related to kind of the spiritual sense. There's also another aspect which is a little more immediate, which is that the nose is the highest point on your face. And so it's the furthest, it's the furthest from your whole face. It's like the summit of your face, you could say. And so there's something about that as well which is related to its spiritual quality of smelling, of being able to, to, let's say to perceive the spirit. Right, to perceive air, perceive the invisibles. But it's a very intuitive, it's not irrational, it's. It's pre rational or super rational, let's say. And so that's as much as I understand now. Why is it related to patience, something that I would think about, because I'm not sure I totally understand that. And yes, there are some people that, that understand that saints and icons have longer noses. I feel like some, some iconographers overdo it a little bit because I think sometimes it has, it shouldn't be a caricature, but. But yes, some people do definitely in their icons make the saints noses a little longer in order to show that, that they're, that they are becoming similar to God. So MFPRYSL says, as an icon cover what participation of icons in everyday secular life would you recommend? Some people create a corner in their home for an altar like structure. Others like in my tradition, are more in the one icon per room to spread the force field camp. I feel a bit uneasy about mixing sacred and profane. Should you watch Netflix Nights to an icon? So I think I would say just follow your tradition. You know, it's there. The Russians really have this tradition of the home altar or the, the bright corner, let's say. But like you said, it's not necessarily a universal practice. And there are people, for example, like there are people who say things like you shouldn't have if you're a married couple. You shouldn't have icons in your room because you know, that's where things happen. And then there are other traditions that say the very opposite. Say you should have an icon of the mother of God and of Christ in your bedroom if you're a married couple to kind of remember the chastity of your, of your wedding. And so I don't think there's a problem with mixing the sacred and the profane. That's for sure. Like in, in Constantinople there, there would have been Icons everywhere on the walls, you know, on the coins. You know, the idea that you would, you would have icons on coins, you have the image of Christ on actual coins, and you would have them on buildings, as much the, the church buildings as the, as the, the profane buildings. But obviously you need to have them placed in a, in, in a position of honor, in a position of respect. You don't want to, to have them on the floor or have them, you know, in, in a, in a kind of lowly, discarded place. You want them to be in a place of honor. So it just really depends on your. I would say it depends on your tradition, but I wouldn't be afraid of mixing sacred and profane if you, if you have a proper hierarchy. All right, so we're done with the website. Let's go. There's only one question on subscribestar, so let's do that. So XRD says, hi, Jonathan, glad you're over the hump. Since you're still recovering, I'll give you an easy one. What's a topic you never get asked about, but wish you would? It's interesting. I don't, I don't think I have a good, good answer for that. I really like the question and answers because, because I often am surprised about the questions and it forces me to say things that I've never said before that I didn't think were important. Like, for example, like just that question about profanity. It's not something that I would necessarily have made a video about, but then once I'm talking about it, I'm thinking, yeah, you know what? Actually, this is important, and I understand why people would be curious about this. And so, so, so I don't necessarily have a, have an answer for you. All right, so let's start on Patreon now. Don Diego de la Vega. Nice. Hope you've recovered well, mate, and your family's okay, too. Thanks, everybody. By the way, thanks for all the wishes, everybody. I really appreciate it. And I know a lot of people were praying for me. That's, you know, I'm very, I feel very touched by that. So, so my question is regarding the Lord is my shepherd prayer. What is the symbolic meaning behind the part of the prayer that says your rod and your staff, they comfort me. Specifically the rod and the staff. It probably has to do this is. This is me improvising now, because I never thought about this. I think it might have something to do with the right hand and the left hand in the sense that the staff has to do with identity. Right. There's a story where, you know, Tamar takes Judah's staff as a token of his identity. The idea of the staff of the king, or, you know, the scepter of the king, I think staff has to do with, like, this kind of verticality and identity. And I think that the rod, at least my understanding is that at least a rod is often, if that's what it says in scripture, right? Spare the rod, spoil the child. The idea that the rod is probably more for punishment. And so you would have the right hand and the left hand, in the sense of you would have this kind of authority which comforts you, which. You know that the shepherd is there for you. You can see him from far away with the staff. You can. You can understand that he's there to lead you, but you also have the rod, which maybe not necessarily. Maybe not necessarily used against the sheep, but maybe used against the wolves, too. Right. This idea of a capacity to. To have some kind of hostile or more aggressive behavior, let's say. So that's the way that I see that. But I might be completely wrong, but at least that's my understanding. So Chase and Lindsay says, hey, Jonathan, hope your recovery is going well. In the Lord of Spirits podcast, they talk about the notion that the reason fallen angels cannot repent, as well as the reason man was made mortal for sinning, is because having an immortal body somehow prevents one from repenting. I'd be interested in hearing your thoughts on this and perhaps an answer as to why an immortal can change in one direction from unfallen to fallen, but not the other. It's definitely something that I don't think I've completely wrapped my head around. It has to do with change, right? It has to do with. That's what death is. So death is the capacity to change, whereas the idea of the angels falling, you know, I've read some place where they say things like, as soon as the angels were created, they fell, right, in the sense that they're not participating in time in the same way that we are. And so they. They kind of take their position on the hierarchy in the direction that they're taking. And so that's probably the best way to. To understand that. But like I said, I don't think I totally understand for sure. I understand more. The idea of that's why God made us die. That's what God. That's why we have death in our lives, is because death is an agent of transformation and that the. The capacity to die can become a kind of purgation. You know, by which things are refined, you know, in your life and you, you, you're able to change. So, Garcia, do you think every technology is waiting to participate in the divine, or will there have to be some degree of renunciation? As someone going to school for accounting, do you have any tips on how to submit these technologies to higher principles? And so I think definitely there'll be some kind of renunciation because the whole image of Christ talking about the end of times has to do with the wheat and the chaff. And that there is an aspect of reality which is chaff and which will, will be burned off. And there's an aspect of it which is useful and something like seed or something like, you know, the, the useful part of the world which will be gathered together into the silo, gathered together into the, into the new Jerusalem. And so I think that that's the best way to, to understand that. And so you know how. Any tips on how to submit these technologies to higher principles? I think that there's no secret to it. It's, there's no. The tip is to always remember that these tools are tools, that these technologies are tools. They are not the purpose, which is something which shouldn't seem obvious to us, but they're not because we actually act very often as if the technologies were the purpose themselves, were the goal themselves. And so as long as technology remains a tool which is used for good, obviously you can use tools for bad, then you're in less danger. But it's hard to do because these tools have their own attention, attention grabbing mechanisms, you could say, especially the Internet and especially, you know, the kind of screen technology. So Charlie Longoria says. Hello, Jonathan, I've been wondering about the symbolism of the skull. I don't know how it is in Canada, but the police and military in the US have adopted the Punisher skull as their unofficial logo. Should this be something, should this be something to be worried about? I never really, I, I don't think I've ever seen that with police and military, you know, so I mean, the skull is just an, A skull is an image of death. It's a, it's an image of, of death. And so the skull that is used by, on a heavy metal T shirt. And let's say the skull that is represented on the monk's schema, you know, on the, on the, it has to do with, with death. And so for sure the, the Punisher skull is, is a frightening one because it's, it's not, it's Punisher is acting like the angel of death. That's how he perceives himself. And so the idea that skull is something like a sign of the angel of death or that this person is a purveyor of death. And so I've seen people use that, like kind of these kind of edgy, you know, whatever edgy guys with their Jeeps and their motorcycles or whatever, but I don't think I've police and military use that, which is odd because obviously Punisher is, is a, is not a. In the authority structure. You know, he, he's a vigilante. He's a. Yeah. So. Matt Turgeon. Hi, Jonathan. When Jesus said John the Baptist was Elijah, when the Pharisees asked John the Baptist if he was Elijah, he said no. Was John hiding his identity from the Pharisees or did he really not know? That is definitely a really interesting kind of aporia which is presented in scripture. And so maybe the best way to kind of understand that is that it was, it was Christ's prerogative to name him and that John would not have named himself. And so that's why he would say no when he was asked, but that Christ had the capacity to, to name him. So that's the best way. I understand that. So, Nicola Alexik, Christ conquered death by death. What do we make of conquest as a concept? Understand, we must conquer on soulful hearts through prayer, fasting and confession. But does it really stop there at the internal level? I mean, I think that there are ways to conquer which are acceptable, like to conquer a sphere. To conquer a sphere of activity in the sense of mastering it. There's definitely this, this idea, but I, I think that at least in the Christian vision, that Christians should not conquer other nations to conquer them. And that this is when it's happened in history. It's always seen or often presented as a, as in another manner to try to hide or mask the fact that they're conquering. For example, if you look at, you know, the whole history of colonization, it was never presented as a form of conquering. It was always presented as a form of help, as a form of supporting the people there. And so you can kind of see the problem of these Christian. And so, so I think that that's the best way to understand that, you know, Christian, Christian war was often done, you know, in defense rather than in conquering. Doesn't mean that it always happened that way. Doesn't mean that it will always happen that way. But there is an. There is a way in which conquering, for conquering, you know, is a missing of the, of the mark. So, you know, but you also have to understand something like taking back a land that had been taken from you is something that Christians, I think, have accepted. Very much so. And so, for example, the Crusades were not viewed as conquering. Crusades were viewed as a retaking of that which had been taken from us or re. Establishing of the original. Of the original limits, let's say. All right, so Mark Kalashnikov says. Hello, Jonathan, can you please explain the correlation. The iconographic depictions of an, of an angel, the right and the left hand on either side of Christ. More so how it relates to other similar depictions, usually in red and blue garments. Elijah and Moses, Martha and Mary, Adam and Eve, Peter and Paul, Theotokos and the Forerunner. And you've covered aspects of this previously, but looking at many icons, it seems to be a very strong recurrence in a lot of images. I was wondering if you had any other insights. Yes, I mean, I. You just have to understand all of these as different aspects of the right hand and the left hand of Christ or different aspects of the two extremes. You know, the two extremes that manifest themselves as being united by Christ. And so when you see characters that are facing each other in this kind of duality, you have to see them as complementary, right? So you can understand, you know, Elijah and Moses, for example. So Elijah is a prophet at the end of the world. Moses is the prophet at the beginning of the world. You know, Moses brings the law. You know, Elijah is facing a corrupt, corrupt Israel. You know, Moses. There are many there. Moses, let's say, has. It's more in. Related to the system or the, like the law and the system of sacrifice and all of that. Whereas Elijah is more about the fire, right, the fire coming down and a more kind of wild, mystical aspect of his, of his, of his life. You know, he stays in a cave and eats meat brought to him by a crow, which is very, very shocking, right, because crows are scavengers. Crows eat dead flesh. And so like, the symbolism of Elijah in that time of famine, in that time when the world is falling apart, being kept secret in the cave while everything is, While the world is ending basically is a very, very kind of profound and, and disturbing symbolism, you know, and you can compare it to, let's say Moses who was kept in the basket on the water and was brought to the, to the princess, to the Egyptian princess, whereas Elijah was kept in a dark cave and, and like I said, ate, ate scavenged meat. So, so that's what you have to understand It. So you look at Peter and Paul, you look at their. At their. How they are facing each other, how they are complementary, how they're opposites, Adam and Eve the same. And. Yeah, et cetera, et cetera, like the Mother of God and St. John is very. You can just see it right there. Right? So the Mother of God is pure. She's covered. She. She. And according to her tradition, she was. Is hidden in the temple as a young woman. She's a. And. And she's quiet. You know, her. Her tradition is private, and her influence is private. Whereas Xinjiang, the foreigner, he's out in the desert, he's screaming, he's telling everybody to repent. He's wearing garments of skin. He's got, you know, crazy hair, crazy beard, and he gets his head cut off, you know, so you can really see, like, you just really see these two. These two extremes manifesting themselves. So. All right, so. Hi, Jonathan. Hope you are well. My question, Dusan Babit asks, but my question is about Deuteronomy 12:23. But be sure you do not eat the blood, because the blood is the life, and you must not eat the life with the meat. What is the meaning of blood here? How's blood, life or soul in some translation? And why is. Why is eating it prohibited? I mean, it's the life in the sense that it's that which moves from the center into the periphery, right? It's that which goes into the heart and then moves out of the heart and goes out into all the flesh. And so it's like. It's like a water, the water above. It's the flowing water. You could say, you know, the idea of flowing water in Scripture is. Is like an influence of heaven, whereas static water or bitter waters is the lower part of that equation. And so blood, because it's flowing, because it moves from the. The heart, from the center to the periphery, and then goes back and carries. Is, let's say, life. That's why it's the soul of the body. It's. It's the soul of the flesh, let's say. So as for the rest, you know, you can refer to the other question I answered, which is. Which was already kind of dealing with that a little bit. So Matthew Mulbranden asks, I watch your old videos on space and time counteracting each other when you were flooded. Much of your geographic symbolism has revolved around borders, centers, walls, edges, order, chaos. What are one or two ways network spaces and times alter or fit into space and time? Patterns of obliteration and Control in the symbolic world and stories. What? All right, so let's, let's, let's. He says, just to clarify my question, I. What I meant by network, I put a definition below. A network is defined as nodes and edges and often has a hierarchy of importance in academia. So an airport that acts as a hub to exchange bachelors that are going to their places is a large node. The flight paths are edgy is the elite church was networked as it only controlled small spaces in a wider pagan world. This Q and A network, it exists in virtual space and time and is a hub. So what are one or two ways network spaces and times alter or fit into space and time? Patterns of obliteration and control in the symbolic world stories. I'm not sure I totally understand what you mean. Patterns of obliteration and control. Sorry, man, I don't totally understand what you. What you mean. And so maybe I can give you some hint of what I understand of what you're saying. I'm not sure I totally get it. And so imagine you have a network, like you're saying, you have a network structure which has these hubs and these edges which are the connection between, let's say, the center or the top of the reason for the hub or the place where it all culminates, and then the branches where it goes. And so you can understand that there are aspects of the world which are not connected to that hub. And those aspects of the world which are not connected to that hub are something like potential to the network. And so the network, by connecting itself to further out in quantity, can increase its control, integrate the potential of the world into its network structure. Right. And so that's how the church works too, right? The church, let's say, you know, has these bishops, then these bishops have other bishops, and then these other bishops have priests. And then you, you kind of have this network. And then at some point, someone goes out and founds another church and then connects that to the bishop and then on and on. And so the, the tree or the network can spread out and, and fill up more and more space and have more control over more. More space. So that's. That's as much as I can give you. Like I said, I'm not sure I totally understand your question. All right, so Manuel Montiel says, my question says, hi, Jonathan, praying for your continued recovery. My question surrounds the highly polarizing COVID vaccine mandates making waves in the West. In your April 2020 Q&A, you answered a question centering on this in a. In a great way control 660 counting for everything. But ended your, your response with an essence to be determined remark that when things begin to play out, you'd have to be more explicit about your response. Well, it seems like those things are beginning to play out. That being, what are your thoughts on the fact that it's becoming clear the vaccine will determine who's included and excluded from society? Yes, yes. I mean, you're right. And that's why I'm supposed to make this mark of the beast vaccine, mark of the beast video and that I haven't totally done it because the kind of thing that'll get me banned from YouTube in part. And it's also the kind of thing which will cause controversy in my own church and hierarchy. But I, I think you're right. I think that the fear that I had, which is that the vaccine would be used as a, as a way to account for those that are inside and then exclude people from the participation society. It seems like that is definitely on the horizon and it's happening here. And the obsession with vaccinating everybody, like the obsession with having, with vaccinating now children vaccinating 0 to 12 and 12 to 16 and is just to show that there's something that's not rational which is going on. There's something which has to do with the desire to have something in which everybody participates, to have a kind of sacrament in which everybody participates, which also has the advantage of creating a scapegoat for those who don't. A scapegoat for the disease itself, which is already happening. A scapegoat for whatever it is you're going to want to make go wrong or you're going to want to notice that goes wrong. We'll be able to be blamed on those that don't want to participate in this sacrament. So for example, if they don't reopen, if they keep saying that you have to wear masks, if they do another lockdown, if they. All of this will now be easily blamed on the scapegoats. And no matter what the facts are, it doesn't matter anymore. None of these things matter anymore. It's just going to be a narrative scapegoating which will reinforce the feeling that people who are vaccinated and, and have this interior passport that's coming are good citizens, that they're part of society that they, and they also have a group that they can, that they can despise. So it definitely looks like we're moving towards, towards 666 and mark the beast symbolism. I don't think we're there yet. I, I don't think that. Because in scripture it says that it will be a kind of apostasy. And I'm not sure I see that yet. Like, I don't see that it's an apostasy to be vaccinated. Unless people take the idea that some of these vaccines contain aborted cell lines, cell lines from aborted children. I don't think it's an explicit form of apostasy. So for me it's not there yet. But it's like, like you can see the system taking shape and you can kind of see it coming together. So for example, like if they make the COVID passport necessary to go to church, we will have reached another threshold. Like it's going to be a serious threshold. And I can kind of see it on the horizon. At least here in Quebec, I can see it coming. So, yeah, okay. So Adam, Vanya asks. Hi, Jonathan. My dad is a labs Catholic who has recently been trying to rediscover his faith. Faith. I would like to get him a Bible for his birthday this year, but I'm not sure what to purchase. He has mentioned wanting a book that features commentary and other translations of words included. Can you recommend any good study Bibles? Yeah, there's. I mean, obviously there's the orthodox study Bible, which is good, you know, it's good. It's pretty good. There is also. So Susan Martin wrote a comment suggesting the new Word on Fire Bible, which I haven't seen. So I don't know, I don't know what it looks like. It's actually beautiful. Like it's. Well, it's well made. And so those are two, two examples that, that you can look at. So Dionysus says, hello, Jonathan, do you have any thoughts or reading recommendations, preferably from the Christian tradition, regarding the distinction between information, belief, knowledge and wisdom? I'm afraid, I'm afraid nothing comes to mind at the moment. So if I think of something before the end of the Q and A, I'll tell you. All right. So Anonymous says, hi, Jonathan, hope you're recovering well. Could she music be understood as a way to symbolically box in the flowing or cosmic time nature of music? Is an arranged music score with all its formalities or even choreography, more representative of cosmic space in this regard, as opposed to free form folk music, for example? I think there's definitely something going on there. I think there's something in the general desire to document and to, you know, the ancient, let's say forms of notations in for music were very vague. They were really about going up, going down. Like I'm not a musical expert, but they're very vague. And so the movement towards a fixing of musical notation, the moving towards recording definitely affects one of the realities of music, which is this kind of. This kind of free flowing structure and this and this thing which changes, but also carries pattern in a more immediate and internal way. Because the ancient musician would have had to kind of internalized these patterns. Just like an ancient poem poet would internalize these patterns and then would be able to do something like improvise or to adjust and to move things around. So. All right. So Su Martin says, I'm curious, what do you think of the Dormition of the Mother of God in the Orthodox tradition and how it compares to the Assumption of Mary and the Catholic tradition? Are they basically the same thing or are they symbolic differences? According to the Catholic Catechism and the doctrine of the Immaculate Conception, Mary was conceived without original sin and so did not experience corruption of the body at death. Catholics believe she was taken body and soul into heaven at the end of her life. Since. Since that. I personally come from a Catholic background, I'm interested in cultivating a deeper understanding of the dermission of the Mother of God. Thank you. So there's a few things here. The first thing is that the Orthodox don't need the doctrine of the Immaculate Conception because we don't believe anybody is born with original sin. So we don't need that doctrine. We have the idea that we do believe that the Mother of God did not sin, but she doesn't have to have this special tag about her in order to describe her. Now, in the story on which the Dormition and the Assumption is based, you really do see the assumption of the Mother of God. You see it in the text of the story. So I think that it is there. The reason why I think it's not shown in the iconography often. Sometimes it is actually it happens, but it's not the usual way. I think it has to do with something like. Like the mystery of. Of the mystery of the final moment, like the mystery of. Of the resurrection or the mystery of the Body. Because the. The we, we as Orthodox, we understand that what the Mother of God went through is something like what ultimately we will all participate in. So there is a mystery there. I think that the reason why the falling asleep or the diminution of the Mother of God is more prominent also in Orthodoxy is that that it also represents a kind of full cycle with the End. It represents kind of like the end of the, of the world, right? The, the kind of. The end of this whole cycle. The end of the Body, you could say. And it also coincides with the end of the liturgical year and it's often represented on the back of the Church in the Western, where the sun goes down. So you can understand the Dormition of the Mother of God as the setting of the sun and the end of, of a cycle. And so I think that that's probably one of the reasons why. One of the many reasons why the Orthodox emphasize the Dormition explicitly far more than they do the, the assumption part, let's say. So Anton Olanderson says. Hello, Jonathan, glad you're back. You're one of the few sane voices in our confusing time. Well, thank you, Anton. That's very touching and very kind of you. I have a question regarding the Eucharist. It is traditionally received at church, but Christ doesn't mention priests as the only one who can consecrate and officiate the eucharist. In John 6, Christ seems to suggest that anyone can eat his flesh and drink his blood. Has the Church falsely claimed authority over the Eucharist? Do we all have the authority and could be united in Christ separately, or would it in fact be a sin and missing the point to partake at home on our own? The question has puzzled me for some time and I wonder how Christ actually intended for us to drink his blood and eat his flesh and practice. Well, I think it's really important to understand that Christ reveals the Eucharist, although he does say that to the crowd in John 6. But he reveals the mystery of what that means in presence of the apostles only in a private space, in a closed off space, not in the open. So there is a sense in which the Eucharist is a, is a mystery of, of the, of the inner circle, let's say. And that is the way that it was always understood by Christians. And it's, and it's the way that it's still practiced today, which is that the Eucharist is the mystery of the Church. It is the hidden aspect of Christianity. And so the early centuries, it seems like catechumen, those who were wanting to become Christian because they heard the Gospel and heard and, and knew something enough about Christ to be attracted that they would actually not be told about the Eucharist until after they were baptized, that it was something of a secret because it's very scandalous. It's extremely scandalous. And so we're used to it because We've had it for 2,000 years, but it's like. It's a very scandalous symbolism. And so it is kind of kept in the mystery. And so in terms of the idea that priests are the one who can consecrate and officiate the Eucharist, I think that that also is something which stems really from the. The very beginning, which is something like Christ did this ritual with the disciples, and then the disciples are the ones who perpetuated that. And then the disciples gave the authority to. To who they wanted to continue to perpetuate this mystery in the Church. And then that is the apostolic succession. That is the. That is the descendants of the disciples training their replacement to officiate the mysteries of the Church. And so, yeah, and you always have to remember that it's like, although it is Christ says that like that there's also St. Paul also as it. St. Paul, is it Christ himself who talks about that? If you do not recognize the body of Christ, then you're eating and drinking to your condemnation. That is that it is a dangerous thing. Taking the Eucharist is dangerous and should not be given to anybody because if you don't recognize the body of Christ in which you're participating, then it's like a curse on you. As. As dangerous as that. I remember. I remember an Orthodox priest when I was a catechumen. You know, people would come up to the chalice once in a while and they would Orthodox. And then he would ask them, are you Orthodox? And they would say, no. And then he would always say, I'm not going to give you communion. Right, right. And the reason why I'm not going to give you communion because I want to protect you. I want to protect you from this. Because if I give you communion, it's dangerous to you. And so. Yeah. All right. So Tyrone. Tyrone Camilleri says ask the same question, asked about the difference between the symbolism of their mission and the Assumption. So, yes, I think I answered that. So, sorry, I'm not gonna. I'm not gonna answer it again. I think that, that. That the idea of the Assumption of the Virgin in, in Orthodoxy is a kind of tacit or. Or hidden or. Or. Or less vocal tradition. It's just not. It's definitely not a dogma, that's for sure. It's just a. It's a pious tradition of the Church. So Enrico says, hi, Jonathan. How did ancient world scripture think of consciousness and subconscious minds before Freud? How did we make a distinction between them? Is it something like hard noose versus flesh and mind, or did they have a different persp. Minds. Architecture altogether? And so, yes, yes, they had the idea that the soul or the, or the person had different hierarchy of mind and that, that we had a rational mind, but we also had a kind of irascible part of us and we had a more passionate aspect of us. And in those, in those parts of the person is what we would call something like unconscious, you know, in the sense that, that they are these desires that pull us, these thoughts that appear to us, you know, these emotions that come to us and we don't control them completely and they, they seem to kind of arise out of these dark places. All right, so Marcus David asked to get asked about the mark of the beast and everything. So I think I answered where I think about that. Anders Braulstad asked, hey, Jonathan, is there an Overall pattern, symbolism? St. Peter, there's much going on with him and I cannot see how it holds together. He is, for instance, known for being a fisherman, being a rock, denying Jesus crucified upside down, striking priests with swords, and holding the keys to heaven. The symbolism of St. Peter is very coherent. It's, it's, it's quite coherent, actually. You know, he's, he is. Maybe I should make a video about it because I, I realized it, that I could explain it, but it's going to take, it is definitely going to take a while. But, but he. There is a duality to St. Peter. There's also duality to St. Paul. You know, a lot of symbol, a lot of symbolism or a lot of characters in scripture always have two sides to them. And so St. Peter is one of those, which is why there's a relationship between him being the first, being the rock, being the one who walks on water, and the one who denies Christ, you know, as well. So, yeah, so let me, let me, let me consider making a video about the symbol of St. Peter. Sorry. Great. Joe Kelly O' Neill says, God, you're feeling better, Jonathan. Okay, so I'm getting used to thinking symbolically, and I can't tell if this is an easy question or doozy of a question. What is the symbolism behind the inversion, the invention of birth control at the societal level? I mean, it has to do with a fragmentation of things. And so, you know, sexuality has many logi, has many purposes. And the invention and kind of spread of birth control is a way in which the world is, is breaking apart, which is that we're taking aspects of sexuality and we're breaking them apart from each other. And so we have an idea that there is baby making and then there's sex and that those two are actually kind of separate from each other and that, that, that sexuality is more to do with personal expression and, and pleasure and all of that. So that's what it is. And what it's going to do is very simple. Which is what is happening is that it just sense makes, makes society sterile and it makes society obsessed with pleasure and move towards idiosyncrasy and pleasure as well. So. So Janet Horstman says greeting from Minneapolis, epicenter of woke. George Floyd, first patron saint of the new religion, is venerated in many a church here. Whoa. It's disturbing. One of their newest doctrine is getting the COVID vaccine is the best way to show cruciform love, love willing to lay down your life to your neighbors. Right now. What is the right way to respond to this? The best way to respond to this is very simple, is that if that is true, then I don't think it's true. But if that is true, then love and willing and laying down your life is something which can only happen voluntarily, fully voluntarily. And if you do it because you have pressure from the government and because you have pressure from your employee, because you have pressure to get a Covid passport and you have pressure to, to participate in society and you do it because everybody's doing it and because you'll be excluded if you don't do it, then all of that nonsense goes away and that it has nothing to do with self sacrificial love because self sacrificial love is not imposed from, from authority. So yeah. All right, so Brett says howdy from the Lone Star State. What does the seven miracles performed by Jesus in the book of John symbolize? Dude, you can't ask questions like that. That. Okay, here we go. Also you could touch on the symbols of each miracle. Water to wine, healing the Roman soldier. These are. How can you ask these questions? You can't ask me to interpret every single, every single miracle that Christ does in the Gospel of John in a question in a Q and a. So I'm sorry, I don't think this is going to happen. All of Christ, all of Christ, all of Christ's miracles are the same. They are showing how Christ, Christ heals the world, fills the world, it has power over the world, you know, is the one who created the world. And so that's what you see with the water to wine. Healing the Roman soldier's son is definitely important because it also shows Christ as the top of the hierarchy and as capable of acting from afar in the hierarchy. You know, like, what is it that the, the, the Roman soldiers tells Christ about how that he, as a Roman soldier tells his. Tells his soldiers to do things and his will goes down the hierarchy and is able to act, you know, outside of immediate action. And so it kind of shows how. And then Christ says, you know, something like, you know, the, the faithless man or whatever, something about the faithless man. And so, so all of that paralyzed man at the pools, the same. The transformation of. In the pool itself, this idea of the transformation of static water into moving water, right. The raising of the water from above in order for it to kind of flow down is what that. What happens, happens there. But then Christ shows that he is, you know, directly doing that. So I think that's enough. I'm not going to go into every single one of them. So. But, you know, who knows, maybe you'd be interested in. It'd be interesting to do. To do more about miracles, if that interests you. So GR says, hi, Jonathan. Do you have any thoughts on the symbol symbolism of liminal spaces? I see them as haunted places of transition, time of Christ crisis, following some kind of loss, but ahead of an incoming judgment. I can't help but to picture them in my mind as the anteroom to the place where the Holy Grail is located. Seem to be quite prevalent in the modern world, especially during these weird times. Times. And so I'm not sure what you mean. Do you mean you see liminal spaces like haunted places or places that are not places like places of transition, like, like alleyways, like. So I'm not sure I totally understand what you mean by liminal spaces. Yeah, so I don't know, you know, I mean, if you mean like haunted places, for sure. Usually haunted places have to do with things which aren't resolved, which are left lingering. And so because they're left lingering, they had. They leave residues. And so in that sense, a liminal space like that, let's say somewhere where a violent crime happened and then will leave and then, because it's something which happened and isn't resolved, let's say, then it will leave residues. And those residues can be experienced as a kind of haunting because. Yeah, because. Because things have. Haven't been closed up. So maybe that's a. Interesting way to understand that. White Lawrence, what is the symbolism of SpongeBob SquarePants? Within five years of his premiere, it exploded into pop culture icon, perhaps the most famous children's show of all time. And I wonder if there is symbolic significance in the show's premise? Or is it a mistake to assume that because something is a staple pop culture, even for a long time, it has symbolic richness? I've never really watched Square Bob SquarePants, whatever, SpongeBob SquarePants. I was too old anyways. But it seems to. It has to do with absurdity and, you know, the laughter, which comes from absurdity. And so a lot of the tropes, a lot of the characters are absurd. You know, what is it? Bikini Bottom or whatever the name of the city is. You know, you can totally understand what's going on. It's all about the bottom of the ocean and the bottom of the waters and how it's all crazy and nonsensical and upside down and, and, and absurd. And so I think that's what it's. That's what it's about. It's about the absurd. And of course the absurd is funny. And so, and so that's why it's. So that's why it's so popular with kids. That's my. At least that's my interpretation. Now, whether or not they are in the story some kind of symbolic structure, I don't know because I haven't really. I haven't really watched it. So sorry. Hi, Jonathan, can you please explain the symbolism of behind the Warning moms tell their children about never being able to whistle as adults if they don't eat their bread crust as kids? I've never heard that. I totally never heard that, that at all. It's interesting, right, because the crust of on bread, of course, is the. Is the limit, right? It's like a hard shell which protects the rest of the bread that is exposed to elements. It's all that. And whistling is obviously just kind of pure, kind of musical sound that you make through by breathing out of your. Just by breathing, just by blowing out of your mouth. So there's definitely something there. There's definitely some kind of connection in terms of opposite it, but I don't totally. I never heard that. So I don't totally, totally get it. So David Luters asks, anyways, my question is what is your family familiarity opinion on the resurgence of intellectual life in conservative circles? Figures in mind are William Craig, John Piper, Tim Keller, the Discovery Institute. In particular, Craig is a prominent re reintroducing the intellectual viability of Christianity in the culture milieu. What do you think of his aim in particular? And how does Christian intellectual generally relate to the symbolism of totalizing orders? So I'm not a big fan of these guys, to be Honest, like, I'm sorry to say, William Lane Craig, his type of argumentation is just so far from mine. It's just so completely far from mine. I don't feel in William Lane Craig, I feel like he argues for the existence of God as a kind of, you know, ultimate cause and a kind of necessary, the culmination of creation into a point, you know, of origin. But I don't see him. I don't see. And any of these people. I don't see the idea of the, the story of Christ or the story of Scripture or the revelation of Christ as being something which fills up the world and, and, and shows us, makes us participate in, in the pattern of reality. And so because of that, I, I find them not super interesting, sorry to say. So the wakeful azure Jonathan, are the chaotic waters below that. You recently mentioned the same underworld that Dante describes it. So why does the latter have space and structure and so. No, they're not the same. The, the underworld, the upside down hierarchy of underworld is more like the corruption of identity. It's more like the corruption of the hierarchy. And so it's not just chaos, but it's rather identities which are not in their proper place is the best way to understand it. And so let's say desires that are all consuming and are not in their proper order. So because of that they end up creating an upside down hierarchy because of, because of their nature as being fragmentary and then taking up all your attention, you know, kind of like woke upside down hierarchies. You know, this is the same as the kind of hierarchy, the upside down hierarchy of hell where these passions take up. Up attention or take up cosmic space, take up cosmic attention. And so they, they end up laying themselves out in a, in a system where you're moving down towards, you know, the, the worst sin, let's say, which, which in Dante at least is a betrayal. So it's different. So Ulysses Basilio says, why Eve came from a rib. What does the symbolism mean? Is it that women cause always a little discomfort? I mean, I think it, it. I've talked about this often. It has to do with the fact that the way. The best way that I understand it, it has to do with the idea that Eve came from his side. I like that name word better than rib. So it's like the, the ver. Let's say that Eve was. You can imagine like a being cut in half, like part. It's like it's cut and now it becomes male and female. That's, that's really the Best way that I understand it. And also the idea that. That she came from his side means, you know, St. John Chrysostom has this idea that. That the reason why Eve came from Adam's side was because if she had come out of his head, he would have. She would have dominated over him. She had come out of his feet, then he would have dominated over her, but that God made her to be an equal and a helper, and therefore he took her from Adam's side. And so that's another way to kind of understand that in terms of. Of why she came from his side rather than something else. So Jason Galtz says, what is the dark night of the soul? And so the dark night of the soul obviously refers to St. John of the Cross and a Catholic mystic who spoke about the descent into death. You could say, and there are orthodox versions of this, which is that there's a mystery in which there are moments in your spiritual life where you actually feel empty, where you feel disconnected from God, where things actually break apart, and that you don't understand what's going on and that you. It really is kind of this. It's related to baptism symbolism. You could say it's related to the fact that you have to kind of go down before you go up and you have to break down your presuppositions and break down your false understanding in order to. Not just intellectually, but like even physically and the way that we. What we trust and the things we. We that give us joy and the things. So it's a kind of, like a kind of spiritual depression, you could call it. And, and St. John the Cross talked about this as a necessary part of the spiritual life where we go down and then. Then God brings us back up. And you see that in. In several of. Or the even recent Orthodox saints who talk about descending into Hades and let's say, staying in death, staying in Hades, and that this staying in Hades is kind of a breakdown of your pride and of your. Of your. Of your presuppositions so that God can pull you out, let's say. At least that's my understanding. So Armory says you have some favorite stories from Irish or Celtic folklore. Could you briefly share one of the main symbolic themes that arise in the story? I'd be honest with you. I don't really know a lot of Celtic and Irish type, so I don't really have an example which comes to mind. So Lynn Holland is if the best parts of Christianity to put love at the top of the hierarchy, then would a society which was fear at the top of Be anti Christian. Totally not talking about the Western reaction to a respiratory virus here. Yes, I agree. I think that, you know, there's a. Recently my. In my recent video that I did on Saint Ephrem the Syrian and Christ walking on water, you really see that relationship. Christ goes down to the disciples and he says, rejoice, be not afraid. For it is I. And I think that the relationship, that relationship you draw between fear and joy or fear and love is definitely the difference between a kind of tyrannical system and, and a true. Yeah, true communion. So, so Leo says reggaeton is a dance beat that appears to have spread around the world faster than Cobra. But I don't, I don't, I don't know what that is. Unlike other musical styles, it only has, it has only one specific rhythm. Currently in Spain, for example, it's practically the only type of music in here. Now, any context, do you have any thoughts on the phenomena of Regin? No, I don't, I don't have a comment on reggaeton. I don't know what that is. But if you want to understand it, you can understand it rather in terms of fashion, in terms of when you're not attached to. When you're not attached to a higher principle, when you're not attached to something which is binding you together and kind of bringing it all together, what happens is that you have, you have little tyrants of attention. That's what fashion is. And so instead of having something which kind of mediates the extremes and binds us together, what you have is these little things that pop up and become the attention and then go away. And then they pop up, they become the attention, they go away. And that's distraction. It's a kind of distraction. And so these fads that show up, you know, whatever fidget spinners or whatever stupid fads that appears and vanishes after six months is really an image of, of the problem. It's an image of this breakdown in meaning that we're dealing with, you know, the idea of going viral, like the idea of going viral on YouTube for some stupid, stupid, meaningless nonsense has to do with this. It's like, like you have all this bubbling chaos and then all of a sudden something, for reasons that are completely almost arbitrary, just kind of pop up and, and, and, and, and get our attention for 15 minutes and then they vanish and you never hear, hear about them again. And this, this. Yeah, so that's what I think about that. So John Valleys Wednesday says, Jonathan, your answer to this question will Resolve a dispute between me and my wife, Nancy. That's not good. That's not. That's not a good thing. I don't want to. I don't want to get involved in the dispute with your wife. All right. A friend of mine recommended exercising along with the YouTube channel called Yoga with Cassandra as a way to improve my flexibility. I find the stretches very effective, and they don't take too much time. My wife says that yoga is a part of the Buddhist liturgy, and that is bringing paganism into our home. So my question is, am I bringing paganism into my home? I have promised my wife I will abide by your judgment. Man, what is this? I'm counting on you. Don't let me down. Keep up the good work. Well, I have said that I would not do yoga myself. And the reason why I would not do yoga is because I do think that yoga at the outset in India is usually a kind of spiritual practice. It's embodied, but it's a. It's a movement towards embodying certain spiritual principles or transforming yourself in the light of certain spiritual principles. And so I feel like because of that, a lot of the pop yoga that we see is. It's like this liminal space that, that, that. That we were talking about before. It's like these haunted spaces where you have these residue of this yoga that people just don't understand, and they don't know what they're dealing with and. And see it as stretching, and so they do these stretches. And the thing is that I understand that probably they're good stretches because there's no contradiction between, you know, a spiritual practice making you healthier and. And then also being a kind of, you know, vehicle for something else. And so I think that's a problem. Like, I don't think that if you. I don't think you're bringing paganism into your. Your house, but I think it's. It's kind of like. It's kind of like this weird liminal space that we talked about. It's kind of like you've got all this stuff that is half meaningful, and you don't. It's not connected to your culture, and you don't totally understand. You don't know what you're doing. The person who's teaching it on the YouTube channel doesn't know what they're doing. And so they're getting involved in all these weird patterns that they don't understand and that they don't master. And so I think that it. I would say that beyond the specifics of people, you know, getting healthier doing yoga. I think in general, this kind of weird yoga obsession is part of the, it's part of the, the breakdown. Like, it's just, it's participates in the breakdown. So I don't have an answer for you. Like I, like I said, I'm not, I'm not saying you shouldn't do stretching or whatever, and some of these stretches are good. I'm just saying my general perception of what I think yoga is doing to our world, let's say. So Patrick Morrisons me a video, YouTube video. Sorry, Patrick, I can't watch it. He says video of Australian Orthodox priests, government mandated vaccinations. Are we there? I have to watch it later. I'm not gonna, I'm not gonna do that now. So sorry about that. So, Marcus and so question about the symbolism of finding treasure at the margin. If you use the cosmic mountain as an image, why would treasure be found where lawlessness and unmorality increases at the edge? Is this something related to the position of showbread north in the temple? Thanks. I don't know if it's related to that, but for sure what it's related to is that the world is full of God's glory. It always is. And so the margin in the potential is hiding sparks. It's hiding potential that can rise up and become very important. And so the idea of finding a, finding a treasure on the edge has to do with. That has to do with out there in the darkness, there are things which are valuable that you don't necessarily recognize yet. And so you can have the surprise of discovering, discovering something valuable hiding there. That's the symbolism of the fishermen that Christ talks about. And so you can imagine throwing your net out into the nations and then surprisingly finding these, these sparks of God that are hiding there in the, in the darkness. And so, and so that's what it has to do. But you can understand it in terms of, in terms of a practice, let's say you, you, you know, you, you have a certain way of doing things and it kind of works, you know, and then there are all these possible ways of doing things, which most of them would just be a waste of your time, right? And so you have all these possible ways of doing things and possible other tools you could use or other things you could use, but there's so many that it's like, it's just, it's, it's. You could lose yourself in there, but sometimes you have an intuition and then you find something in the darkness, something in Potential that you haven't tapped in yet, which end a shining light like something which will then be integrated and will bring about certain solutions that you had never thought about, that you had never. That you never could have imagined. And so that is also part of that, that kind of symbolism. So Kenan Wang asked, you mentioned sloth has to do with attention and that business can actually be slothful. Yes. What's the symbolism symbolic nature of lust? Is there a way that the concept is broader than normally expected? And so yeah, for sure in the sense that that lust or Eros, you know, if we, if we kind of broaden it. The idea of erotic desire is definitely something which is more than just negative. Like there's some fathers that actually taught. I was. I'm reading Timothy Petitza's book right now, the. The. The Ethics of Beauty. And he clearly explains how eros or lust or desire is actually supposed to be the driving force or the motor towards in. By which we are actually seduced by God. That we fall in love with God and we fall in love with the things of God. And so. And so. And so lust or eros is not something which is bad in itself. It's just that, you know, if it's directed in the wrong direction, then it can become a kind of tyranny. So Arie Fisher says, hey Maximos, as I understand it, Verveki makes a solid case that the best way to understand the process of relevance realization yet is not deliberative and teleological, but something more like an evolutionary process. Therefore a phenomenological description that says that this points towards that good because the good has something akin to will or intellect is less accurate because it implies teleology than a non theistic conception of the sacred. How would you respond? Sometimes I sense there is a real ground for new naturalistic evolutionistic religion in this. In his work. Would that be the Antichrist? His sister? Don't ask me if John Revake is the Antichrist. What kind of question is that? His sister reminds me of time while you're is more space. Perhaps we should have faith then that one day will crown Christianity. So I think I've explained it several times before which is that this is a process which happens both ways. It is bottom up and is top down. And so for example, things point towards the good to the extent that you are a being that recognizes the good. And so you can't find that pointing towards the good in the messiness of the process. It's above the messiness of the process and as conscious Beings, we perceive the good and we see that things are moving towards the good. And that good sometimes is after the fact appears to us, after the fact is revealed to us after the fact, but it's nonetheless true, it's nonetheless real, and that good nonetheless preceded the process, even if we don't, even if we can't see the causality. So a very simple example, like in terms of so kind of evolutionary biologists would say that eyes are not foreseeing, that that's a, that's, that's not right. They're not, they're not foreseeing. Eyes are a messy bottom up process of selection and mutation and reproduction which brought about the capacity to perceive images and to interpret them or whatever. But eyes are not foreseeing. But that's just not true. Eyes are for seeing, they just are. We know they are. We look at eyes and we realize that those eyes are foreseeing. And they, and, and whatever process brought them about, they brought them about in order for them to be able to see and live. Pay attention to an evolutionary type biologist for 10 minutes and you'll see that although he will explicitly say that eyes are not foreseeing, you will find that same person slipping five minutes later and speaking in teleological language, because we are teleological beings, because we perceive teleology. And to just say that that is not real, that that is an illusion, that that is whatever, is to deny your experience. It's just to deny the experience of being the conscious being, which is perceiving these processes, which is capable of naming them, which is capable of mapping them out. We are the ones doing that and we see telos in all of these things and that telos is real because without consciousness, doing, participating or culminate the culmination of relevance realization, something like consciousness, nothing, nothing really exists. So I hope that answers that, that it'd be good for me to talk to John about it more and maybe kind of try to work out a better explanation for it. But that's at least how I see it. All right, so Norm Golding says the mystery of Christ pierced right side is inexhaustible, referencing not only the baptism and the Eucharist, even the church, but also to show that Jesus is the new temple that Ezekiel envisions as the river flows out of the right side to the east of it. Also, Matthew writes that those on Jesus's right are the ones to be saved, saved in my church, though, in the crucifix above the altar, crisis pierced on his left side. Wow. Interesting. Interesting. I guess I've never. I've never seen that. But it's one of those things that you have to not get too caught up in, especially left and right symbolism. So we can recognize right hand symbolism, let's say, even when it's on the left. And I've tried. I've explained this several times. One of the reasons why it tends to flip back and forth is that. That when we say left and right, it depends from what perspective we're talking about. And so because of that, this symbolism can tend to flip from one to the other. But even if it flips, it doesn't. It still is manifesting similar things. And also, it also possible that your crucifix is just a. It's just an idiosyncratic crucifix, because idiosyncrasies happen all the time. People get tradition wrong, people make things up, people modified tradition. And then there's a process by which those like your idiosyncratic crucifix will probably be the only one, or there will be a few of those, and the one with Christ being pierced on his right will win. Right will end up surviving, and the other one will just vanish. So Kevin Patterson says Peterson talks about knowing your own capacity for danger, or don't be harmless so that people will respect you. What's the symbolic meaning of this? Growing a spine while aiming to live peacefully. It feels like a descent into division. I mean, I don't think it's the. It's the only way there. I think there are other ways, but I understand it. I understand because there's a. There's a difficulty in that people can mistake cowardice for humility. And that's definitely not what Christ is talking about, you know, and so the idea of being meek and of being, you know, of being nice. Can. Can. Can be done not through love or through a detachment from your passions, but can be done through cowardice. So I think that in that case, this type of discipline is better for sure, you know, than just thinking. You're thinking you're virtuous, but actually just being a coward. Power. So Dorote says, is there a feminine symbolism to archery? I'm thinking here of the goddess Diana and the Japanese priestesses, their sacred weapons. Was a bow and an arrow. I had to think about that. Never thought about that at all. El Dorado. What is the symbolism of a shooting star? That's. Why have I never thought about that? Huh. Okay, what. What does it mean when you have these, These. These celestial things that kind of are moving in the heaven. I wonder if that's also not part of the symbolism of the falling angels. If shooting stars didn't participate in that type symbolism. And you guys are asking really tough questions. It's also. I'm running out of steam. It's what's going on. All right, Amy. Hi, Jonathan. Have you read Gravity and Grace by Simon Wheel? It really impacted me specifically our idea that we must create. Create a void within ourselves, and in that emptiness is where God can exist. We must lose ourselves. If the void is unexpected, hatred arises and in that same void it's hell. What's your take on this? That contradicting attributes arise from each other. So when one does good, there's also rises an evil which one must put into themselves instead of the world. I mean, I never read this, so I don't really totally understand. I think the idea of creating a void is definitely something true like this, that a kind of self emptying is the way in which God fills you. That's why ascetic practices and humility are part of the Christian image. And so. But I'm not sure about the whole unexpected hatred thing. I'm not sure because if it's unexpected hatred, then it's not a void, is it? Or it's a fake void or something. So. So I'm not sure. All right. Chandler Turner says, recently I've been more frequently encountering this idea of antinatalism which I cannot wrap my mind around, really. Last week I went down the rabbit hole of reading some of the stuff, including a particularly disturbing passage by this supposedly feminist Simone de Beauvoir. And it seems as if these individuals are uncomfortable with the idea of having bodies or even existing at all. Is this simply nihilism taken to its logical conclusion? How does one argue against such a perverse ideology? For sure, that's what it is. And also it's a misunderstanding of morality and it's a misunderstanding of the purpose of reality. It's a. It's a misunderstanding of the way in which suffering can be transformed rather than the idea that suffering should be eliminated from the world. So antinatalists usually think that suffering itself is immoral and therefore we should eliminate human. Eliminate life so that. Not eliminate, but at least don't. Not procreate so that there's less suffering in the world. And yeah, I think it's a very, very dark and disturbing and wrong way of thinking because at least it's not Christian. That's for sure. Because Christ shows us rather how. How Christ fills suffering with Meaning, you know, how Christ transforms death into glory, and that's the ultimate. That's the ultimate solution to that. So. And people like Simone de Beauvoir and they. Let's just say their lives weren't great. And these antenatalists, I imagine their life must be pretty gray. It's all I can say. So Drew McMahon says, Jonathan, what are your thoughts on cremation? Is it okay for a practicing Christian? What is its symbolism? Thank you. And the answer is, at least in orthodox circles, you're not supposed to be cremated. You know that your body is supposed to return to the earth. So. So, no, I don't think it's okay for Christians, but it doesn't mean that if you get cremated you'll go to hell or something like that. But I think that it's. It's a perception about the body and a way in which we treat the body of the dead and the way that we understand the body as decomposing in the ground, I think is a very important part of the story and the, the reality of decomposition. And let's say the story part of that trumps, I think, the cremation as a very practical way of dying and a cheap way to have a funeral and a way in which you can take up less space, in which you're more environmentally sound or whatever. I think these are all false reasons. I think these are all secondary reasons to the vision of from dust you came to dust you will return, the idea of decomposition and the surprise of resurrection. So, yeah, so Podiumal says, what do you think of the therapeutic use of hypnosis? It's being increasingly used to help with weight loss, addiction, phobias, etc. Is it something Christians should avoid? Man, I wouldn't get hypnotized. That's never happening. I would never give my will over to someone else. And so I'm not a big fan of hypnotism. Sorry, man, I. I don't know. Like, I don't. I think one of the problems with hypnotism is that I don't think people even understand what it is. Is. And so. Because they don't seem to even understand what it is. Yeah, I think it's scary. And also, I think, I don't know, it's just something about. That's so unchristian about putting yourself in a situation where you are. Are you. Where you are open to suggestions, where you are, you know, in a suggestible, whatever state of mind. Doesn't sound right to me. How, Jonathan, how do we say? Dispassionate in extreme situation, especially while facing fear. I experienced the abyss before discovering orthodoxy. And the memory of that sensory experience can cause me to feel like a soldier, trembling, building and battle, as Saint Maximus would describe it. Any advice? Thanks. Say pray, man. I don't know. I don't know what else there is to pray the Jesus prayer and as the saints say, you know, to hide yourself in Christ. Right? To, to. To use Christ as a cover. All right, so, Connor Mitchell, as it is quite clear that the pattern of coercion surrounding the shot is almost a perfect match with the coercive method described in Revelation regards to the mark. Mark. However, there is also a place for an authority to withhold privileges and direct behavior in a just order as well. Is there anything explicitly demonic about the shot itself aside? Sorry, I'm not using the words because I don't want to get banned. Aside from an inappropriate place in the hierarchy. More important than attending church, desiring to determine what levels I comply in a profession that I'm sworn to follow orders. Yes, yes. There is another aspect of it which is disturbing, which is obviously the difficulty of. The difficulty of, of injecting a foreign substance into your body. Now, there's nothing wrong with that in itself. It can be a garment of skin, it can be a, a medicine. But the idea that you would inject a foreign substance into your body in order to be able to participate in society itself, your own society, your own identity, your own church, your own businesses, you know, not, not the idea of going to a foreign country, it's already very different, right? Because a lot of people are using that, that excuse, saying they're already vaccine passports. Right? When I went to Africa, I had to get vaccinated for the yellow fever and for, for all these things. But this is not the same. This is an interior identification which is. Which is branded by, by the receiving of a, of a foreign substance into you. And so I'm not saying I don't think it's demonic, but I think that it is pointing in a direction which has to do with the idea of the strange as a marker of identity. And the idea of the strange, of documenting the strange or using the strange as a method of calculation to, to account for everything, as I've said, you know, and so it has strangely, something to do with the, the explosion of gender identities, right? The idea that, that these strange markers become. It's almost like a weird inversion. It's like something strange, something foreign is, is that which shows that you belong to the society. And so it's like a weird upside down thing. Anyways, so more coming in in my video if I ever have the, the wisdom to do it. So. Hi Jonathan, what are your thoughts on idealism? Basically argued that consciousness is fundamental and the nature of it is mental. Not your mind alone or mine, but mind at large. Merci. And so why is it that I don't like idealism? Or why do I don't like the mind only solution? And the reason why I don't like it is I, I dislike any theory that posits that a major aspect of reality is an illusion. Just. It annoys me from a phenomenological point of view. It just annoys me. And so we are the minds. We are the minds in which our experience is happening. Now we can posit higher minds when Christians do, and we can posit the, the, the kind of existence, this fractal existence within these higher minds that culminate into the one or into, into God or into infinite mind, let's say. But I think that positing the, let's say are negating the existence of the, of the lower beings and negating the existence of body or negating the existence of the material world and saying it's an illusion and saying that your own own experience, that your own experience of being a independent being is an illusion. All of that stuff just, it actually ends up just being meaningless to me. It just, it, it's real to the extent that it's real. It's real to the extent that it has reality, you know, and maybe it points to something more, maybe points to something higher, but it's, but it's real. So I hope that makes sense when I explain it that way. I don't know how else to do it. All right, so Ramal says there was another. I, I guess I had forgotten this part here. Here. Could you please elaborate more in the symbolism of dogs? I've seen an old lecture that you talk briefly about dogs marking ends, Crypto and Cerberus and saw that kind of applies also in the context of Cenocephaly and the Canaanite woman. Yes, but I'm still struggling to understand how all that is associated with dogs. So why is it dogs? Because dogs are extensions of humans. Dogs are tamed animals. They are, are animals that are the extension of the will of humans. That's why. But they're also an immediate danger because of that, because they're so close to us. There may be the animal that is the closest to us in all of creation is the dog, because it follows Your orders, you can train it. You know, it has a. Even can kind of be humanized in the way in which you interact with your dog. But because of that it also. So it marks the limit between humans and animals because it's like a. It's like the place where animals and other animals. Right. So human dog and then other animals. And so that's why it also marks the limit. But it's also dangerous because that energy can turn against other humans, can turn against you. All of that can happen because they're so close to you. Then they can maul you or they can bite you or they can. Yeah. So Kelly Madden asked in his book Matthew says humanity's impetus in the universe can adequately be summed up as. As informing matter with meaning and expressing meaning with matter. Page 50. Is that how we should understand, in part the Lord's foundational command, fill the earth and subdue it. It's exactly how you should understand that. It's exactly how you should understand that. And so it's like imagine humans moving out and filling up the earth and therefore giving meaning and name to all the potentiality which is there. And so that's what the subduing is. So you fill and then you subdue in the sense that you make it participate in meaning. So. Yes. So. Adam Shalard. Hi, Jonathan. My recent seizure. Seizures have had thinking about the symbolism of seizures. My most recent one came before the healing of the epileptic sun. I know symbolism is. Isn't good or bad, so don't hold back. Thank you. So, yeah, I'm sorry, I saw that, Adam, that you were. That you were having seizures again. So I was, I was, I was quite sad to see that. But seizures are breakdown between heaven and earth. You know, they're. They're a moment where your body goes into frenetic. Make uncontrollable movements that you don't control. And so, so that's what seizures are. They're. They're. They're a manifestation of the. Of a break in communion between that which is above and that which is below. Yeah, so. All right guys, it's 10:13 and so let's see. We've got a lot of super chats. Let's see. Let me just kind of move slowly through these. I feel. Well, I should be super tired, but I actually have some energy. Took a nap before the Babylon V interview because. So Anna Shillard for $5 says last month's question didn't come through. What is the symbolism of seizures? Is Saint Christopher a saint of Epileptics. What? That is what I've seen online. So there's Adam again. Sorry, Adam, I just answered your question. I haven't seen this idea that St. Christopher is the saint of epileptics, but I also haven't looked into it. It wouldn't so totally surprise me because. Because of what he represents in terms of an excess of body, you could say. And so you can understand, you know, the idea of a seizure as that the body taking over, let's say. So it's possible. It would be interesting if that were the case. I still have that little icon of St. Christopher. Adam carved this little icon of St. Christopher out of soap one time, a long time ago in one of my classes. And I still have it. So further wrote, what's your diet like during quarantine? Jonathan for five dol and so I couldn't taste anything, so I didn't really care. I wasn't really hungry too, because it's just weird when you don't taste anything. And so I just ate two meals a day. And they were very simple, you know, mostly protein and. And vegetables. So it was just boring. I don't remember really what I was eating because I didn't really care. It was just all cardboard to me. So St. George for $10, JD said, did you see the Kanye events in the final when he sets himself on fire, the Baptist symbol and ends with a wedding? I didn't watch the events because I don't have apple music, but I. I did see some highlights of it and I don't know, man, you know, Kanye's 50. 50. You know, Kanye's 50. 50. So. So I don't know, you know, I can understand the setting on fire. And I did see those images of the wedding, which was odd because it's with his divorced wife, which is just kind of weird, you know, maybe he still loves her or whatever. I don't know. I don't know. So I. To be honest, I didn't think much of a lot of these. These events. Yeah, I don't totally get what's going on with him right now. I don't. It's like I'm watching him. I'm not sure what's happening. And it has to do with the. The feeling that I. That his album is a little uneven and I don't know exactly what's. What's happening, so. Parker for 4.99 USD hi, Jonathan. What is the symbolism of forging weapon like a sword out of a meteorite? Right. Seems to be common in fantasy stories. Thanks. I mean, it's a heavenly sword, you know, it's a sword that comes from heaven. It's not, it's not that complicated. It's like a, a sword is already a, a kind of image of, of light or, or of this thing that comes down, you know, this judging, you know, all of that. And so the idea of making a sword out of a heavenly stone is not so strange, you know, so lion says, may I have your top three books that bring you the fondest memories, not including the Bible, please. I'm a bibliophile and love to collect. I would say, like, if it's, if we're talking about like adult, adult life, some of the stories are like the novels that have really kind of stayed with me. I would say, of course, Brothers Karamazov by Dostoevsky, also the Glass Bead Game by Herman Hesse. I don't know, that story just really stayed with me. Just, just this, this kind of image of a, this beautiful game. And then in terms of another book which really stays with me quite a bit just because of what it is that I ended up being involved with is a book that I just bought back because I'd lost it in the flood. I have it right here. It's called the Myths of the Dogman by David Gordon White. And reading this book is the first place in which I encountered the legend of St. Christopher. And he's a really fascinating guy because he really has an intuition about symbolism and he gets some of it wrong because he also has a kind of desire to virtue signal and tends to see symbolism of dog headed men and of monsters only in the negative light. That is, it's only an image of marginalization, of dehumanizing the foreigner, all of that which is true, that's part of the symbolism. But even though he says that, he still ends up pointing despite himself or through that, he ends up pointing to the traditions that say, for example, that the dog headed men were gardens, were guardians of Eden, or that, you know, that there is this positive, this positive aspect to, to the dog headed man symbolism. And so he kind of ends up pointing to it. I was actually thinking of inviting him on the podcast, but. So we'll see. Maybe I'll do that. But he's, he's kind of like a, you know, he's, he's, he's this guy, he's like a, he's like a yoga tantra guy, you know, he's all into that kind of stuff. So, so I'm a little, I'm A little hesitant to invite him, but it could be an interesting conversation. So maybe those three books are some of the books that, that have kind of stayed with me quite a bit. And obviously Crisis of the Modern World by Rene Ginon was a huge, had a huge, huge impact on me because it, it really marked a transition, you know, know, for my life, Life of Moses. Obviously these are books you already know about. So I tried to find something else that you didn't know about. So. Ray Fleming for five British pounds, I noticed that hair has a double symbolism of being dead material on the one hand, but also symbolize glory. This apply to all marginalia. I mean not necessarily to all marginalia, but it applies to marginalia which is that for example, in marginalia, let's say in, in a manuscript you find both ornaments ornament and monsters and ornament is, is a form of glory. Right? And so you're right. And so this is, this is the thing that I'm telling you guys about, about the connection between death and glory and how one can become the other. And that, that seems to account for a lot of the symbolism from Genesis to Christ is how death and glory seems to be something like the same thing, but you know, a different, a different, different direction, let's say. So Louis Durand says, why was the idol made after the flight of Egypt a golden cast calf? Well, because it, animals are at the bottom of the mountain, right? It has to do with the garments of skin and, and also the bull or the, the calf as this support, you know, like this, this kind of lower part of reality. So I think that's what it has to do with, in terms of symbolism, it has to do with this idea of animality at the bottom of the mountain. So V2 Zooey says, how do we know where is the true church among all the options? Is an educated guess the best thing we can do or is there a symbolic way to find it? And so I mean I did, I, I did my own, like I, I went on my own path and I, and I think that I, I do believe that the Orthodox tradition, because it has preserved the most mystical vision of Christianity because it has preserved the image of theosis and the image of, you know, this image of crisis filling up the world. All of these things which are a little bit there in other, other denomination you could say, but for sure have been preserv observed more fully in the Orthodox Church and so can only say it from my experience. So purple dinosaur for $5 would you make of near death experience phenomena hearing Various accounts has helped me shake me out of materialist mindset I was inculcated with. I mean, I know a lot of people that say that for some reason I'm suspicious of them. I'm suspicious of them because I think some people are lying. I think some people are not telling the truth. I think some are. You know, the, some basic things that people seem to experience seem, seem interesting. You know, like they say the light at the end of the tunnel. Like, that's obviously a very simple but very powerful image of, of a, of a, of a transition right between two worlds. And so there are different things like that. But, but some people, they go really far in their descriptions. And some of those descriptions are shady, in my opinion, so I'm a little suspicious of them. But I'm happy if that does help you, if that's helped you to kind of break your materialist mindset. For Carlos Varga, 499usd says. Hey, Jonathan, my question is, will the church have a specific role to play in terms of evangelization in the revival after the death of Christianity? And so I think it's important to say, like, I, I kind of say Christianity is dying, Christianity is going to die. But I think it's really important to say that at least, at least Christ says that the church will not, not completely die, you know, because he says, you know, the doors of Hades will not prevail upon the church. So I think that we have to see it as this kind of descent, but not a complete disappearance and not a complete death. And so I do believe that the church will play a role in receding the world. You could say, I don't know how. I don't know exactly what that means, but for sure the body of Christ will participate in that. So the new guy for 499, do Angels of humanity, are they capable of love or are they simple people simply obeying the commandments of God without emotion? Yeah, that's tough. That's. Those are tough to answer. I think it's. I think, I think angels care, can care for humanity. I don't know about love. I think we're, I mean, we're definitely called to be united in love with all the angels. And so maybe it's just hard because the angels are just not the same kind of beings we are. And so they're, they're kind of intelligences. And so it's hard to really. It's hard to square some of trying to imagine what it's like to be. To be just an intelligence. So the new guy says for 999 he was D. Are there examples of God being amused by something or displaying a sense of humor? And where are the boundaries of humor? Crassus, vulgarity and such? Nor macdonald funny but wrong or macdonald? There are examples of God being amused by something or displaying a sense of humor. The. The, of course, the, the image of the. The idol which is brought into. Next to the. The Ark of the Covenant is brought next to an idol. I forget it's an isle of who. Baal, I think, you know, and then in the morning, the statue of BAAL is kind of fallen down on his face and is broken, you know, and you have this image of God basically, you know, foiling, foiling these, these false gods. And so those are like moments. Sense of humor. And so. So yeah, so that's a, that's an example. I think there are probably other examples, but I just can't necessarily think of them right now. So Samuel Ramillar from 5BRL says good night. Jonathan, can you please elaborate more on the symbolism of dogs? But I think I did, didn't I? Didn't I just do that? I think I did that. I don't think I'm gonna do it again. So if you're expecting more. Samuel, Sorry. So, red Redmond for 99 Euros. Hi, Jonathan. Are you familiar with, sorry, the philosophy of Bronze Age pervert? No, I don't know who that is. Do you think it is compatible with Christianity, though? He's a pagan, he's quite popular among young Christian men online. So no, I don't know who the Bronze Age pervert is. And he has a very strange name. So he doesn't necessarily. He doesn't necessarily inspire confidence with the name like that, at least not for me. So the new guy, 999usd, says, can fallen angels be redeemed? Does the Bible ever indicate that angels think, feel or behave in ways like we do, consequently being able to fall and possibly desiring redemption? Impossible. And so I would say the official line is that. No. Is that angels cannot be redeemed because they, they don't die. Like, they don't change. And so that's the official position. But it's difficult. It's such a difficult. It's such a difficult discussion because, say it this way, like, there is a manner in which the angels exist in the mind of God, as in their eternal. So I don't totally see how all this jives together, but let's say the official. The official stance is. Is just that. No. So, yeah, so Nathal Condon $5 no question. Thanks Ted N for 10 USD can you speak a bit about how the Bible, orthodoxy, etc is not about morality? I grew up in more convert type communities in the States and found a lot of thought of moralism bled into church at times. And so I mean, it's about morality downstream, but it's not firstly about morality. It's really about, it's about worship and it's about liturgy and it's about transformation of the person into the image of God, into God himself. You could say that's what it's about. And so morality or practices or spiritual disciplines end up being about healing and not so much about just doing what's right or wrong. You know, there are reasons why certain things are considered wrong is because, because they make you a slave to sin, make you a slave to passions, make you a slave, you know, to these, these fragmentary desires. And, and we have to be able to break free from those by developing true spiritual practices, by reattaching ourselves to higher principles, ultimately, you know, finding examples in the saints and, and attaching ourselves ultimately to Christ himself. And so that's what I mean when it's not about morality, it's not about, you know, if you do this or you don't do this, God is happy with you or God is mad with you because it goes against the moral order. It's like, yeah, I mean you can express it that way to a certain extent. It's not completely legitimate, but it's, it's lacking, let's say it's lacking in the, in the image of the reason why God created the world in the first place, which is, is to be united to his creature and to, to kind of this overflow of love into creation is called back into God to participate in his life. And that has little to do with morality the way we understand it. So. Jack of all trades Comics $5 USD what are the limits to icon carving? What should and shouldn't be carved? I mean the, the limits of icon carving are the tradition of the church. We, we, we, we basically follow the tradition that the church, Church has given us. You know, unless it's an image that has never been carved, then we, then we tend to be a little more, we have some flexibility. And so that's what kind of, that's what kind of designated, it's not a set process. People talk about iconographic cannons as if they're written down. They're not written down, they are just basically the received tradition of the church. And so there's Obviously some discussion. There's some disagreements. It's not a completely clean process, but it nonetheless is something which works itself out. All right, so the new guy, again, wow. For 1999 USD, you've done a video on Batman. Why not on his primary inspiration, the shadow. I think you'd find the character fascinating. He's better than Batman. Best source online is the Shadow cast on YouTube. Just a thought. I mean, I, I don't really know the story of the shadow very well. I know about him, but I, I don't know. I know that. I know that they made a horrible movie. I didn't even watch it. It was, it's like this horrible movie that looked like Sin City or something that they did, wasn't it? Yeah. So, Daniel Lopez for 35 GTQQ I don't know what that is. Is it wrong to attend the Catholic and Evangelical church at the same time? There's no Orthodox church where I live. Is it wrong? I mean, it can be confusing. It can be confusing to kind of just go to different churches, especially if you're doing it regularly. So I would say yes, for sure. You definitely wouldn't want to take communion in both places. And I don't think if your priest, if the Catholic priest knew, he definitely wouldn't, Wouldn't agree, shouldn't agree that you can take communion in both places. And so I would tend to, I would definitely tend to kind of to choose also just not to be kind of ripped apart. And so, you know, it's like, I, this is not ideal. But, you know, I, because my, I, you know, my, my family is Protestant. And so I, I have been called several times to go to Protestant churches, you know, for different reasons, for different events or whatever. And so it's like, I'll go, obviously, it happens rarely. And, and I'll go and I'll just, I'll just be polite and I'll be there and I'll, and I'll, you know, I'll smile and be nice to people, you know, but I would never take communion there, that's for sure. So I would say be cautious not to that. Not to be kind of ripped into pieces. So, so. Anderson Smith. 499. No questions. Thanks, man. So I think, I think we're done with, with, with pretty much everything. And so is it, is it me or did we basically spend like the entire, the entire Q and A without, without moderators? Who's the moderator? Who's there in this chat? I didn't even see. Anyways, so, yeah, so, so thanks, everybody. Thanks for. Thanks for your time. You know, thanks for your attention. Thanks for everything. Sorry that the month of August has been a little weird. Less videos than I guess I usually. I usually put up. But. But hopefully I'll be able to catch up this month and in the next few months. And so stay tuned for the things I talked about. My discussion with Jordan Peterson, John Revake, my discussion with Jay Dyer, Babylon Bee, all that stuff. Stuff. And, and so, yeah, and so I'll be posting on social media for people who want to participate in that event in month, the Society of Jung event. If you want to participate in that. I'm gonna make that discussion a little more technical maybe than I usually do or maybe I'll be willing to push it a little more in terms of, you know, in terms of. Of talking more about structure and stuff. So, yeah, so we'll do it. All right, guys, so it's good. Talk to everybody. And oh, Frank Rally's there, so keeping an eye on. Yeah, so we did have a moderator there. It's good to see you, Frank. And then someone says we must be so well behaved this time. I actually feel like that it's true. I didn't see. Because often I kind of see scrolling all of a sudden I see like all these messages being like, you know, removed or being blocked or whatever because of these spam bots and all these. This stuff. So, yeah, who knows? So thanks everybody. And yeah, stay tuned. I will see you next month. Thanks again for everybody who's supporting me. I really appreciate it and. And talk to you very soon. Bye bye. I hope you enjoyed this episode of the Symbolic World. The Symbolic World is based on a series of videos that you can find on my YouTube channel, Jonathan Pageau's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course, leaving a review on itunes. Everybody knows that's the best way to get the podcast out there, to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon the Pajo videos as well and on subscribestar. All those links you can find on my website or in the show description, so thank you and I will see you soon."}
